
#Область ПеременныеМодуля

&НаКлиенте
Процедура ПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПоставщиков = ПолучитьСписокПоставщиков();
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", СписокПоставщиков);
	ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор),Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПоставщиков()
	
	СписокПоставщиков = Новый СписокЗначений;
	Поставщики        = Запись.Услуга.Поставщики.ВыгрузитьКолонку("Поставщик");
	СписокПоставщиков.ЗагрузитьЗначения(Поставщики);
	
	Возврат СписокПоставщиков;
	
КонецФункции

#КонецОбласти
