
#Область ВыводМакета

// Процедура формирует и выводит отчет.
//
// Параметры:
//       ТабДок  - ЭлементФормы.
//
Процедура СпискиГражданПодлежащихПостановкеНаВоинскийУчетВывести(Момент,ЛетСлужбы, ТабДок, РезультатЗапроса) Экспорт 
	 
	ТабДок.Очистить();
	мПостроительОтчета.Параметры.Вставить("Момент", Момент);
	мПостроительОтчета.Выполнить();
	мПостроительОтчета.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	мПостроительОтчета.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	мПостроительОтчета.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	
	Выборка =РезультатЗапроса.Выбрать();
	Макет = ЭтотОбъект.ПолучитьМакет("Форма8");
	ЗаголовокОбласть = Макет.ПолучитьОбласть("Заголовок");
	ДеталиОбласть = Макет.ПолучитьОбласть("Детали");
	ГодРождения = Год(Момент) - ЛетСлужбы;
	ЗаголовокОбласть.Параметры.ТекущаяДата = ТекущаяДата();
	ЗаголовокОбласть.Параметры.ГодРожд = Формат(ГодРождения,"ЧГ=");
	ЗаголовокОбласть.Параметры.ТекущийГод = Формат(Год(Момент), "ЧГ=");
	ТабДок.Вывести(ЗаголовокОбласть);
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
		Если Год(Выборка.ДатаРождения) = ГодРождения Тогда
			
			Если ЗначениеЗаполнено(Выборка.Физлицо) Тогда
				
				ДеталиОбласть.Параметры.НомерСтроки = НомерСтроки;
				Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
					ДеталиОбласть.Параметры.ФИО = Выборка.Фамилия +" "+ Выборка.Имя + " " + Выборка.Отчество;
				Иначе
					ДеталиОбласть.Параметры.ФИО = Выборка.ФизЛицо;
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(Выборка.ФактАдрес) Тогда
					
					МестоРегистрации  = Выборка.ФактАдрес;
					
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.ЮрАдрес) Тогда
					
					МестоРегистрации  = Выборка.ЮрАдрес;
					
				Иначе
					МестоРегистрации  = " ";

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По строке №:" + НомерСтроки + " адресов нет в базе!");
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.Телефон) Тогда
					ДеталиОбласть.Параметры.МестоРегистрации = МестоРегистрации + ", тел: " +Выборка.Телефон;
				
				Иначе
				
					ДеталиОбласть.Параметры.МестоРегистрации = МестоРегистрации;
				
				КонецЕсли; 

				ДеталиОбласть.Параметры.ДатаРождения  = Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy");
				Если ЗначениеЗаполнено(Выборка.ДокументВид) Тогда
					ДеталиОбласть.Параметры.ПаспортныеДанные = Строка(Выборка.ДокументВид) + ", " + Строка(Выборка.ДокументСерия)+" "+Строка(Выборка.ДокументНомер)+", "+Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy")+", "+ Строка(Выборка.ДокументКемВыдан);
				Иначе
					ДеталиОбласть.Параметры.ПаспортныеДанные = " ";	
				КонецЕсли; 
				
				НомерСтроки = НомерСтроки + 1;
				ТабДок.Вывести(ДеталиОбласть);
				
			КонецЕсли; 
			
		Иначе
			
			Продолжить;	
			
		КонецЕсли; 
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти