
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеКопирования")
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Запрещено создавать элементы справочника копированием.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	ТабличныйДокумент = ПолучитьПечатныйДокумен(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПечатныйДокумен(Ссылка)
	
	//Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ТабличныйДокумент").Получить();
	ТабВложения = бит_ПрисоединенныеФайлыСервер.ПолучитьВложения(Ссылка);
	Если ТабВложения.Количество() = 1 Тогда  
		ДанныеФайла = бит_ПрисоединенныеФайлыСервер.ПолучитьДанныеФайла(ТабВложения[0].Ссылка);
	Иначе
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	ФайлТабДок = ПолучитьИмяВременногоФайла("mxl");
	ДвоичныеДанные.Записать(ФайлТабДок);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ФайлТабДок); 
	УдалитьФайлы(ФайлТабДок);
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти
