
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ") Тогда
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Проведен");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ.Проведен;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ.ПометкаУдаления;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзОбработкиВводПКО") Тогда
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВидОперации");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.НеРавно;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзОбработкиВводПКО.ВидОперации;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Элементы.Список.ТекущаяСтрока = Параметры.ЗаполнитьИзОбработкиВводПКО.НачальноеЗначениеВыбора;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПодборИзОбработкиВводПКО") Тогда
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВидОперации");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.НеРавно;
		Эл.ПравоеЗначение   = Параметры.ПодборИзОбработкиВводПКО.ВидОперации;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭтаФорма.ЗакрыватьПриВыборе = Параметры.ПодборИзОбработкиВводПКО.ЗакрыватьПриВыборе;
		
		Элементы.Список.МножественныйВыбор = Параметры.ПодборИзОбработкиВводПКО.МножественныйВыбор;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРаспределениеОплатыПоПоставщикам") Тогда
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Организация");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРаспределениеОплатыПоПоставщикам.Организация;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ответственный");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		
		// БИТ ЖКХ 02.10.2020
		Эл.ПравоеЗначение   = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		//Эл.ПравоеЗначение   = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(строка(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")), "ОсновнойОтветственный");
		
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "МожноСоздать" Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
		Если ТипЗнч(ЭтаФорма.ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.бит_НачислениеПениПоЛицевымСчетам") Тогда
			Если ЕстьНачислениеПоОплате(ВыбраннаяСтрока) Тогда 
				СтандартнаяОбработка = Ложь;
				Текст = "Документ с основанием: " + ВыбраннаяСтрока +" уже существует.";
				бит_ОбщегоНазначения.СообщитьОбОшибке(Текст,,,СтатусСообщения.ОченьВажное);
			Иначе
				Оповестить("ЗаполнитьОснованиеНачислениеПени",ВыбраннаяСтрока,);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНачислениеПоОплате(ВыбранноеЗначение)
	
	Если ЗначениеЗаполнено(Документы.бит_НачислениеПениПоЛицевымСчетам.НайтиПоРеквизиту("ДокОснование", ВыбранноеЗначение)) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ПроверитьДоступностьРолиНаСервере() Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Документ Оплата КУ создается автоматически при закрытии кассовой смены.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПроверитьДоступностьРолиНаСервере()
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Возврат НЕ РольДоступна("ПолныеПрава");
	
КонецФункции

#КонецОбласти
