
#Область ПроцедурыИФункцииОбщегоНазначения

// Помещает внешнюю библиотеку утилит во временное хранилище.
// 
// Параметры: 
// 	ВремДанныеРегистратора    	 -	Строка.
//  Адрес исполняемого файла регистратора библиотеки во временном хранилище.
// 	ВремДанныеБиблиотеки    	 -	Строка. Адрес библиотеки утилит во временном хранилище.
//
&НаСервереБезКонтекста
Процедура ПолучитьПараметрыБиблиотекиУтилитСервер(ВремДанныеРегистратора, ВремДанныеБиблиотеки)
	
	ВремДанныеРегистратора = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.бит_РегистраторВнешнихБиблиотек.Имя),Новый УникальныйИдентификатор);
	ВремДанныеБиблиотеки = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.бит_Утилиты.Имя),Новый УникальныйИдентификатор);
	
КонецПроцедуры // ПолучитьПараметрыБиблиотекиУтилитСервер()

// Вставляет картинку в форматированный документ.
// 
// Параметры: 
// 	АдресВХранилище    	 -	Строка. Адрес картинки во временном хранилище.
//
&НаСервере
Процедура ВставитьКартинкуСервер(АдресВХранилище)
	
	КартинкаДляВставки = Новый Картинка(ПолучитьИзВременногоХранилища(АдресВХранилище));
	КартинкаДляВставки = КартинкаДляВставки.Преобразовать(ФорматКартинки.PNG);
	НачалоВыделения = "";
	КонецВыделения = "";
	Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
	ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
	Элементы.ТекстСтатьиРедактирование.УстановитьГраницыВыделения(НачалоВыделения, НачалоВыделения);
	ТекстСтатьиРедактирование.Вставить(НачалоВыделения, КартинкаДляВставки, ТипЭлементаФорматированногоДокумента.Картинка);
	
	Модифицированность = Истина;
	
КонецПроцедуры // ВставитьКартинкуСервер()

// Вставляет текст HTML в текущую позицию курсора в форматированном документе.
// 
// Параметры: 
// 	ТекстДляВставки    	 -	Строка			        Статья.
// 	ПозицияВставки - ЗакладкаФорматированногоДокумента.
//  Текущая позиция курсора в форматированном документе.
//
&НаСервере
Процедура ВставитьТекстВHTMLСервер(ТекстДляВставки, ПозицияВставки)
	
	Элементы.ТекстСтатьиРедактирование.УстановитьГраницыВыделения(ПозицияВставки, ПозицияВставки);
		
	ТекстСтатьиРедактирование.Вставить(ПозицияВставки, "--СлужебныйТекстДляЗамены--", ТипЭлементаФорматированногоДокумента.Текст);
		
	ВремHTML = "";
	КартинкиПослеВставки = Новый Структура();
	ТекстСтатьиРедактирование.ПолучитьHTML(ВремHTML, КартинкиПослеВставки);
	ВремHTML = СтрЗаменить(ВремHTML, "--СлужебныйТекстДляЗамены--", ТекстДляВставки);
	ТекстСтатьиРедактирование.УстановитьHTML(ВремHTML, КартинкиПослеВставки);
		
КонецПроцедуры // ВставитьТекстВHTMLСервер()

// Получает список всех ролей, доступных в конфигурации.
// 
&НаСервереБезКонтекста
Функция ПолучитьСписокРолей()
	
	СписокРолей = Новый СписокЗначений();
	Для Каждого ТекРоль Из Метаданные.Роли Цикл
		СписокРолей.Добавить(ТекРоль.ПолноеИмя(), ТекРоль.Представление());
	КонецЦикла;
	
	Возврат СписокРолей;
	
КонецФункции // ПолучитьСписокРолей()

// Заполняет устанавливает видимость и доступность элементов формы.
// В зависимости от текущей позиции в списке статей.
// 
// Параметры: 
// 	Ссылка		       	 -	СправочникСсылка.бит_си_Статьи. Статья.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность(Ссылка = Неопределено)
	
	ВыбранЭлемент = НЕ (Ссылка = Неопределено ИЛИ Ссылка.ЭтоГруппа);
	ВыбранаГруппа = НЕ Ссылка = Неопределено И Ссылка.ЭтоГруппа;
	
	Элементы.ГруппаЗагрузитьСохранитьОтмена.Доступность = ?(Ссылка = Неопределено,
															Ложь,
															Истина);
															
	Элементы.ГруппаРедактирование.Видимость					= ВыбранЭлемент;
	Элементы.ГруппаHTML.Видимость							= ВыбранЭлемент;
	Элементы.ГруппаПривязкиМетки.Видимость					= ВыбранЭлемент;
	Элементы.ГруппаДоступностиСвязанныхОбъектов.Видимость	= ВыбранЭлемент;
	Элементы.ГруппаРедактирование.Видимость					= ВыбранЭлемент;
	Элементы.ГруппаПросмотр.Видимость						= ВыбранЭлемент;
	Элементы.НеВключатьВСодержание.Видимость				= ВыбранЭлемент;
	Элементы.ОписаниеРаздела.Видимость						= ВыбранаГруппа;
	Элементы.ЗаголовокСтатьи.Видимость						= ВыбранЭлемент;
	
	Элементы.НаименованиеРаздела.Заголовок = ?(ВыбранЭлемент,
											   "Идентификатор статьи",
											   "Наименование раздела");
												 
КонецПроцедуры // УстановитьВидимостьИДоступность()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура обработчик - события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Элементы.Список.РежимВыбора = ЭтаФорма.Параметры.РежимВыбора;
	
	Элементы.ФормаСохранитьСтатьи.Видимость = (НЕ Метаданные.Обработки.Найти("бит_си_СохранениеСправочнойИнформации") = Неопределено);
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура обработчик - события "ОбработкаОповещения" формы.
// 
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаСтатьяСправки" Тогда
		ТекущаяСтатья = ?(Элементы.Список.ТекущиеДанные = Неопределено, Неопределено, Элементы.Список.ТекущиеДанные.Ссылка);
		Если Параметр = ТекущаяСтатья Тогда
			ОбновитьОтображениеСтатьи();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ПроцедурыИФункцииОбновленияОписанияСтатьи

// Заполняет заполняет таблицу мест использования. 
// 
// Параметры: 
// 	СтатьяСсылка       	 -	СправочникСсылка.бит_си_Статьи. Статья.
//
&НаСервере
Процедура ЗаполнитьТаблицуМестИспользования(СтатьяСсылка)
	
	Если СтатьяСсылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	МестаИспользования.Очистить();
	МестаИспользования.Загрузить(СтатьяСсылка.МестаИспользования.Выгрузить());
	
КонецПроцедуры // ЗаполнитьТаблицуМестИспользования()

// Заполняет строки дерева меток по переданному дереву значений.
// 
// Параметры: 
// 	Строки           	 -	СтрокиДереваЗначений     Строки дерева значений.
// 	Родитель        	 -	ДанныеФормыЭлементДерева Элемент.
//  Дерева, в который добавляется новая строка.
//
&НаСервере 
Процедура ЗаполнитьСтрокиДереваМеток(Строки, Родитель = Неопределено)
	
	Родитель = ?(Родитель = Неопределено,Метки,Родитель);
	Для Каждого СтрокаДерева Из Строки Цикл 
		Если СтрокаДерева.Ссылка.ЭтоГруппа И
			СтрокаДерева.Строки.Количество() = 0  Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Метка = СтрокаДерева.Ссылка;
		НоваяСтрока.Использование = СтрокаДерева.Пометка;
		Если СтрокаДерева.Ссылка.ЭтоГруппа Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.СправочникОбъект;
			НоваяСтрока.ЭтоГруппа = Истина;
		Иначе
			ВремКартинка = СтрокаДерева.Ссылка.Пиктограмма.Получить();
			Если ТипЗнч(ВремКартинка) = Тип("ДвоичныеДанные") Тогда
				ВремКартинка = Новый Картинка(ВремКартинка);
			КонецЕсли;
			Если НЕ ТипЗнч(ВремКартинка) = Тип("Картинка") ИЛИ ВремКартинка.Вид = ВидКартинки.Пустая Тогда
				ВремКартинка = БиблиотекаКартинок.бит_си_МеткаСтатьи;
			КонецЕсли;
			НоваяСтрока.Картинка = ВремКартинка;
		КонецЕсли;
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ЗаполнитьСтрокиДереваМеток(СтрокаДерева.Строки, НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСтрокиДереваМеток()

// Заполняет дерево меток.
// 
// Параметры: 
// 	Статья		       	 -	СправочникСсылка.бит_си_Статьи. Строки для заполнения.
// 							
// 	УстановленныеМетки 	 -	ТаблицаЗначений.
//  Таблица меток, которые обязательно должны быть установленн.
// 	Обновлять        	 -	Булево. Проверка на необходимость заполнения.
//
&НаСервере
Процедура ЗаполнитьДеревоМеток(Знач Статья, Знач УстановленныеМетки = Неопределено, Знач Обновлять = Истина)
	
	Если Статья.ЭтоГруппа Или Не Обновлять Тогда
		Возврат;
	КонецЕсли;
	Метки.ПолучитьЭлементы().Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановленныеМетки.Метка
	               |ПОМЕСТИТЬ УстановленныеМетки
	               |ИЗ
	               |	&УстановленныеМетки КАК УстановленныеМетки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МеткиСтатей.Наименование КАК Метка,
	               |	ЕСТЬNULL(УстановленныеМетки.Пометка, 0) КАК Пометка,
	               |	МеткиСтатей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.бит_си_МеткиСтатей КАК МеткиСтатей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			УстановленныеМетки.Метка КАК Метка,
	               |			1 КАК Пометка
	               |		ИЗ
	               |			РегистрСведений.бит_си_УстановленныеМеткиСтатей КАК УстановленныеМетки
	               |		ГДЕ
	               |			УстановленныеМетки.Метка ССЫЛКА Справочник.бит_си_МеткиСтатей
	               |			И УстановленныеМетки.Статья = &Статья
	               |		
	               |		ОБЪЕДИНИТЬ
	               |		
	               |		ВЫБРАТЬ
	               |			УстановленныеМетки.Метка,
	               |			1
	               |		ИЗ
	               |			УстановленныеМетки КАК УстановленныеМетки) КАК УстановленныеМетки
	               |		ПО МеткиСтатей.Ссылка = УстановленныеМетки.Метка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка ИЕРАРХИЯ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Если НЕ ТипЗнч(УстановленныеМетки) = Тип("ТаблицаЗначений") Тогда
		УстановленныеМетки = Новый ТаблицаЗначений();
		УстановленныеМетки.Колонки.Добавить("Метка", Новый ОписаниеТипов("СправочникСсылка.бит_си_МеткиСтатей"));
	КонецЕсли;
	Запрос.УстановитьПараметр("Статья", Статья);
	Запрос.УстановитьПараметр("УстановленныеМетки", УстановленныеМетки);
	МеткиПер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗаполнитьСтрокиДереваМеток(МеткиПер.Строки);
	
КонецПроцедуры // ЗаполнитьДеревоМеток()

// Заполняет дерево отборов.
// 
// Параметры: 
// 	Статья	 -	СправочникСсылка.бит_си_Статьи. Строки для заполнения.
//
&НаСервере
Процедура ЗаполнитьДеревоОтборов(Статья)
	
	Если Статья.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ОтборыОбъектов.ПолучитьЭлементы().Очистить();
	ВыборкаИсточников = Справочники.бит_си_Источники.Выбрать();
	МассивДобавленных = Новый Массив();
	Пока ВыборкаИсточников.Следующий() Цикл
		Если НЕ ВыборкаИсточников.Обработка.Получить() = "бит_си_ИсточникСправочникСтатьи" Тогда
			Продолжить;
		КонецЕсли;
		ТекНастройки = ВыборкаИсточников.НастройкаПоУмолчанию.Получить();
		Если НЕ ТипЗнч(ТекНастройки) = Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ТекНастройки.Свойство("ОбъектыОтбора") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ТекОбъект Из ТекНастройки.ОбъектыОтбора Цикл
			Если НЕ МассивДобавленных.Найти(ТекОбъект.МетаОбъект) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ОтборыОбъектов.ПолучитьЭлементы().Добавить();
			НоваяСтрока.Объект = ТекОбъект.Заголовок;
			НоваяСтрока.Тип = ТекОбъект.МетаОбъект;
			МассивДобавленных.Добавить(ТекОбъект.МетаОбъект);
		КонецЦикла;
	КонецЦикла;
	Если ОтборыОбъектов.ПолучитьЭлементы().Количество() = 0 Тогда
		Элементы.ОтборыОбъектов.Доступность = Ложь;
		Элементы.ОтборыОбъектов.КоманднаяПанель.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.ОтборыОбъектов.Доступность = Истина;
		Элементы.ОтборыОбъектов.КоманднаяПанель.Доступность = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыОтбора.Объект КАК Объект,
	               |	ОбъектыОтбора.Тип КАК Тип
	               |ИЗ
	               |	РегистрСведений.бит_си_СвязанныеОбъекты КАК ОбъектыОтбора
	               |ГДЕ
	               |	ОбъектыОтбора.Статья = &Статья
	               |	И ОбъектыОтбора.ДляОтборов";
	Запрос.УстановитьПараметр("Статья", Статья);
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОбъектов.Следующий() Цикл
		СтрокиДерева = ОтборыОбъектов.ПолучитьЭлементы();
		СтрокаТипа = Неопределено;
		Для Каждого ТекСтрока Из СтрокиДерева Цикл
			Если ТекСтрока.Тип = ВыборкаОбъектов.Тип Тогда
				СтрокаТипа = ТекСтрока;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = СтрокаТипа.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Объект = ВыборкаОбъектов.Объект;
		НоваяСтрока.Тип = СтрокаТипа.Тип;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДеревоОтборов()

// Заполняет дерево связанных объектов.
// 
// Параметры: 
// 	Статья - СправочникСсылка.бит_си_Статьи. Статья, для которой заполняются связанные объекты.
//
&НаСервере
Процедура ЗаполнитьДеревоСвязанныхОбъектов(Статья)
	
	Если Статья.ЭтоГруппа  Тогда
		Возврат;
	КонецЕсли;
	СвязанныеОбъекты.ПолучитьЭлементы().Очистить();
	ВыборкаИсточников = Справочники.бит_си_Источники.Выбрать();
	МассивДобавленных = Новый Массив();
	Пока ВыборкаИсточников.Следующий() Цикл
		Если НЕ ВыборкаИсточников.Обработка.Получить() = "бит_си_ИсточникСправочникСтатьи" Тогда
			Продолжить;
		КонецЕсли;
		ТекНастройки = ВыборкаИсточников.НастройкаПоУмолчанию.Получить();
		Если НЕ ТипЗнч(ТекНастройки) = Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ТекНастройки.Свойство("ОбъектыПривязки") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ТекОбъект Из ТекНастройки.ОбъектыПривязки Цикл
			Если НЕ МассивДобавленных.Найти(ТекОбъект.МетаОбъект) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СвязанныеОбъекты.ПолучитьЭлементы().Добавить();
			НоваяСтрока.Объект = ТекОбъект.Заголовок;
			НоваяСтрока.Тип = ТекОбъект.МетаОбъект;
			МассивДобавленных.Добавить(ТекОбъект.МетаОбъект);
		КонецЦикла;
	КонецЦикла;
	Если ОтборыОбъектов.ПолучитьЭлементы().Количество() = 0 Тогда
		Элементы.СвязанныеОбъекты.Доступность = Ложь;
		Элементы.СвязанныеОбъекты.КоманднаяПанель.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.СвязанныеОбъекты.Доступность = Истина;
		Элементы.СвязанныеОбъекты.КоманднаяПанель.Доступность = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязанныеОбъекты.Объект КАК Объект,
	               |	СвязанныеОбъекты.Тип КАК Тип
	               |ИЗ
	               |	РегистрСведений.бит_си_СвязанныеОбъекты КАК СвязанныеОбъекты
	               |ГДЕ
	               |	СвязанныеОбъекты.Статья = &Статья
	               |	И НЕ СвязанныеОбъекты.ДляОтборов";
	Запрос.УстановитьПараметр("Статья", Статья);
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОбъектов.Следующий() Цикл
		СтрокиДерева = СвязанныеОбъекты.ПолучитьЭлементы();
		СтрокаТипа = Неопределено;
		Для Каждого ТекСтрока Из СтрокиДерева Цикл
			Если ТекСтрока.Тип = ВыборкаОбъектов.Тип Тогда
				СтрокаТипа = ТекСтрока;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = СтрокаТипа.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Объект = ВыборкаОбъектов.Объект;
		НоваяСтрока.Тип = СтрокаТипа.Тип;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДеревоСвязанныхОбъектов()

// Обновляет текст статьи.
// 
// Параметры: 
// 	СтатьяСсылка       	 -	СправочникСсылка.бит_си_Статьи. Статья.
// 							
//
&НаСервере
Процедура ОбновитьТекстСтатьиНаСервере(СтатьяСсылка)
	
	СпрСпОб = СтатьяСсылка.ПолучитьОбъект();
	ВремСписокКартинок = Новый СписокЗначений();
	РабочийТекстHTML = СпрСпОб.ЗагрузитьИзображенияИзБД(ЭтаФорма.УникальныйИдентификатор, ВремСписокКартинок);
	
	ТекстHTML = РабочийТекстHTML;
	СтруктураКартинок = Новый Структура();
	НомерКартинки = 0;
	Для Каждого ТекКартинка Из ВремСписокКартинок Цикл
		НомерКартинки = НомерКартинки + 1;
		Попытка
			СтруктураКартинок.Вставить("image" + СокрЛП(НомерКартинки), Новый Картинка(ТекКартинка.Значение));
		Исключение
			Продолжить;
		КонецПопытки;
		ТекстHTML = СтрЗаменить(ТекстHTML, ТекКартинка.Представление, "image" + СокрЛП(НомерКартинки));
	КонецЦикла;
	ТекстСтатьиРедактирование.УстановитьHTML(ТекстHTML, СтруктураКартинок);
	
КонецПроцедуры // ОбновитьТекстСтатьиНаСервере()

// Обновляет все закладки редактирования статьи, вызывает обновление отображения на сервере.
// Разворачивает узлы деревьев настройки меток, отборов, связанных объектов.
// 
&НаКлиенте
Процедура ОбновитьОтображениеСтатьи()
	
	ОбновитьОтображениеСтатьиСервер(?(Элементы.Список.ТекущиеДанные = Неопределено, Неопределено, Элементы.Список.ТекущиеДанные.Ссылка));
	
	Если Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	СтрокиДерева = Метки.ПолучитьЭлементы();
	Дерево = Элементы.Метки;
	Для Каждого ТекСтрока Из СтрокиДерева Цикл
		Узел = ТекСтрока.ПолучитьИдентификатор();
		Если Дерево.Развернут(Узел) Тогда
			Продолжить;
		КонецЕсли;
		Дерево.Развернуть(Узел);
	КонецЦикла;
	
	СтрокиДерева = ОтборыОбъектов.ПолучитьЭлементы();
	Дерево = Элементы.ОтборыОбъектов;
	Для Каждого ТекСтрока Из СтрокиДерева Цикл
		Узел = ТекСтрока.ПолучитьИдентификатор();
		Если Дерево.Развернут(Узел) Тогда
			Продолжить;
		КонецЕсли;
		Дерево.Развернуть(Узел);
	КонецЦикла;
	
	СтрокиДерева = СвязанныеОбъекты.ПолучитьЭлементы();
	Дерево = Элементы.СвязанныеОбъекты;
	Для Каждого ТекСтрока Из СтрокиДерева Цикл
		Узел = ТекСтрока.ПолучитьИдентификатор();
		Если Дерево.Развернут(Узел) Тогда
			Продолжить;
		КонецЕсли;
		Дерево.Развернуть(Узел);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьОтображениеСтатьи()

// Обновляет все закладки редактирования статьи на сервере.
// Устанавливает видимость и доступность закладок и элементов редактирования.
// 
&НаСервере
Процедура ОбновитьОтображениеСтатьиСервер(Ссылка)
	
	УстановитьВидимостьИДоступность(Ссылка);
	
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НазваниеСтатьи        = Ссылка.НазваниеСтатьи;
	НаименованиеРаздела   = Ссылка.Наименование;
	ОписаниеРаздела       = Ссылка.ОписаниеРаздела;
	НеВключатьВСодержание = Ссылка.НеВключатьВСодержание;
	
	Если Ссылка.ЭтоГруппа Тогда
		РабочийТекстHTML = "<html><title>&nbsp;</title><body>&nbsp;</body></html>";
	Иначе
		ОбновитьТекстСтатьиНаСервере(Ссылка);
		ЗаполнитьДеревоМеток(Ссылка); 
		ЗаполнитьТаблицуМестИспользования(Ссылка);
		ЗаполнитьДеревоОтборов(Ссылка);
		ЗаполнитьДеревоСвязанныхОбъектов(Ссылка);
	КонецЕсли;
	
КонецПроцедуры // ОбновитьОтображениеСтатьиСервер()

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСДеревомСтатей

// Изменяет порядок раздела/статьи, переданного.
// В качестве параметра, в указанном направлении.
// 
// Параметры: 
// 	ТекСсылка  	 -	СправочникСсылка.бит_си_Статьи.
//  Раздел/статья для которого изменяется порядок.
//                          
// 	Направление	 -	Число. Направление изменения порядка: -1 - Вверх; 1 - Вниз.
//
&НаСервере
Процедура ИзменитьПорядок(ТекСсылка, Направление)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Статьи.Ссылка,
	                      |	Статьи.Порядок КАК Порядок
	                      |ИЗ
	                      |	Справочник.бит_си_Статьи КАК Статьи
	                      |ГДЕ
	                      |	Статьи.Родитель = &Родитель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок,
	                      |	Статьи.Наименование");
	Запрос.УстановитьПараметр("Родитель", ТекСсылка.Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	Значение = 1;
	ПредСсылка = "";
	Пока Выборка.Следующий() Цикл
		Если (Выборка.Ссылка = ТекСсылка И Направление = -1 И НЕ Значение = 1)
		 ИЛИ (ПредСсылка = ТекСсылка И Направление = 1) Тогда
			ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекОбъект.Порядок = Значение - 1;
			ТекОбъект.Записать();
			
			ТекОбъект = ПредСсылка.ПолучитьОбъект();
			ТекОбъект.Порядок = Значение;
			ТекОбъект.Записать();
		ИначеЕсли НЕ Выборка.Порядок = Значение Тогда
			ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекОбъект.Порядок = Значение;
			ТекОбъект.Записать();
		КонецЕсли;
		Значение = Значение + 1;
		ПредСсылка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры // ИзменитьПорядок()

#КонецОбласти

#Область ПроцедурыИФункцииОбработкиТекстаСтатьи

// Получает список изображений в тексте HTML, при обнаружении ссылки.
// На локальный файл изображения, помещает такие файлы во временное хранилище.
// И заменяет ссылку на адрес во временном хранилище.
//
// Параметры: 
// 	пТекстHTML         	 -	Строка. Текст HTML для получения изображений.
//                          
&НаКлиенте
Функция ПолучитьСписокИзображенийВТексте(Знач пТекстHTML)
	
	сзСсылки = Новый СписокЗначений;
	Src_Открыт = Ложь;
	ВсегоСтрок = СтрЧислоСтрок(пТекстHTML);
	
	Для СчСтрок = 1 По ВсегоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(пТекстHTML, СчСтрок);
		ВсегоСимволов = СтрДлина(ТекСтрока);
		
		IMG_Начало = Найти(ВРег(ТекСтрока),"<IMG");
		
		Если IMG_Начало <> 0 Тогда
			IMG_Начало = IMG_Начало + 4;
			IMG_Путь = "";
			
			Для СчСимвол = IMG_Начало По ВсегоСимволов Цикл
				ТекСимвол = Сред(ТекСтрока, СчСимвол, 1);
				
				Если (ТекСимвол = Символ(34) ИЛИ ТекСимвол = Символ(39)) И Src_Открыт Тогда
					
					Если Лев(IMG_Путь, 5) = "e1cib" ИЛИ Лев(IMG_Путь, 6) = "e1c://" Тогда
						ИмяДляЗамены = IMG_Путь;
					Иначе
						Попытка
							ИмяДляЗамены = "";
							ПоместитьФайл(ИмяДляЗамены, IMG_Путь, , Ложь, ЭтаФорма.УникальныйИдентификатор);
						Исключение
							IMG_Путь = "";
							Src_Открыт = Ложь;
							Описание = ОписаниеОшибки();
							Продолжить;
						КонецПопытки;
					КонецЕсли;
					
					СчСимвол = СчСимвол - (СтрДлина(IMG_Путь) - СтрДлина(ИмяДляЗамены));
					ТекСтрока = СтрЗаменить(ТекСтрока, IMG_Путь, ИмяДляЗамены);
					
					сзСсылки.Добавить(ИмяДляЗамены, IMG_Путь);
					
					IMG_Путь = "";
					Src_Открыт = Ложь;
				КонецЕсли;
				
				Если НРег(Сред(ТекСтрока, СчСимвол, 5)) = ("src=" + Символ(34)) ИЛИ НРег(Сред(ТекСтрока, СчСимвол, 5)) = ("src=" + Символ(39)) Тогда
					СчСимвол = СчСимвол + 5;
					Src_Открыт = Истина;
				КонецЕсли;
				
				Если Src_Открыт Тогда
					IMG_Путь = IMG_Путь + Сред(ТекСтрока, СчСимвол, 1);
				КонецЕсли;
			КонецЦикла; // По строке, символы.
		КонецЕсли; // Встречается тег.
	КонецЦикла;	// По тексту, строки.

	Возврат сзСсылки;
	
КонецФункции // ПолучитьСписокИзображенийВТексте()

// Выполняет обновление текста HTML по результатм.
// Редактирования документа в поле форматированного документа.
//
&НаСервере
Процедура ОбновитьРабочийТекстИзПоляРедактирования()
	
	СтруктураКартинок = Новый Структура();
	ТекстHTML = "";
	ТекстСтатьиРедактирование.ПолучитьHTML(ТекстHTML, СтруктураКартинок);
	Для Каждого ТекКартинка Из СтруктураКартинок Цикл
		АдресКартинки = ПоместитьВоВременноеХранилище(ТекКартинка.Значение.ПолучитьДвоичныеДанные(), ЭтаФорма.УникальныйИдентификатор);
		ТекстHTML = СтрЗаменить(ТекстHTML, ТекКартинка.Ключ, АдресКартинки);
	КонецЦикла;
	
	РабочийТекстHTML = ТекстHTML;
	
КонецПроцедуры // ОбновитьРабочийтекстИзПоляРедактирования()

// Выполняет обновление форматированного документа.
// По результатм редактирования текста HTML.
// И переданного списка картинок.
//
// Параметры: 
// 	СписокКартинок     	 -	СписокЗначений.
//  Список изовражений: Значение - адрес картинки во временном хранилище.
//  Представление - ссылка на изображение как она используется в Тексте HTML.
//                          
&НаСервере
Процедура ОбновитьТекстПоляРедактированияИзРабочегоТекста(СписокКартинок)
	
	ТекстHTML = РабочийТекстHTML;
	СтруктураКартинок = Новый Структура();
	НомерКартинки = 0;
	Для Каждого ТекКартинка Из СписокКартинок Цикл
		НомерКартинки = НомерКартинки + 1;
		СтруктураКартинок.Вставить("image" + СокрЛП(НомерКартинки), Новый Картинка(ПолучитьИзВременногоХранилища(ТекКартинка.Значение)));
		ТекстHTML = СтрЗаменить(ТекстHTML, ТекКартинка.Представление, "image" + СокрЛП(НомерКартинки));
	КонецЦикла;
	
	ТекстСтатьиРедактирование.УстановитьHTML(ТекстHTML, СтруктураКартинок);
	
КонецПроцедуры // ОбновитьТекстПоляРедактированияИзРабочегоТекста()

// Записывает статью в справочник на сервере.
// 
// Параметры: 
// 	Ссылка		     	 -	СправочникСсылка.бит_си_Статьи.
//  Ссылка на элемент справочника статей в который будет выполнена запись.
//							
// 	СписокКартинок     	 -	СписокЗначений.
//  Список изовражений: Значение - адрес картинки во временном хранилище.
//  Представление - ссылка на изображение как она используется в Тексте HTML.
//                          
&НаСервере
Процедура ЗаписатьСтатьюНаСервере(Ссылка, СписокИзображений)
	
	Если Не ЭтаФорма.Модифицированность Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъектДляЗаписи = Ссылка.ПолучитьОбъект();
	ОбъектДляЗаписи.Наименование = НаименованиеРаздела;
	Если Ссылка.ЭтоГруппа Тогда 
		ОбъектДляЗаписи.ОписаниеРаздела = ОписаниеРаздела;
	КонецЕсли;
	ОбъектДляЗаписи.НеВключатьВСодержание = НеВключатьВСодержание;
	Если Ссылка.ЭтоГруппа Тогда 
		Попытка
			ОбъектДляЗаписи.Записать();
		Исключение
			Описание = ОписаниеОшибки();
		КонецПопытки;
		ЭтаФорма.Модифицированность = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбъектДляЗаписи.НазваниеСтатьи = НазваниеСтатьи;
	ОбъектДляЗаписи.ТекстHTML = РабочийТекстHTML;
	
	СтруктураКартинок = Новый Структура();
	НомерКартинки = 0;
	Для Каждого ТекКартинка Из СписокИзображений Цикл
		НомерКартинки = НомерКартинки + 1;
		ДанныеКартинки = ПолучитьИзВременногоХранилища(ТекКартинка.Значение);
		СтруктураКартинок.Вставить("image" + СокрЛП(НомерКартинки), Новый Картинка(ДанныеКартинки));
		ОбъектДляЗаписи.ТекстHTML = СтрЗаменить(ОбъектДляЗаписи.ТекстHTML, ТекКартинка.Представление, "image" + СокрЛП(НомерКартинки));
		
		ТекКартинка.Представление	= "image" + СокрЛП(НомерКартинки);
		ТекКартинка.Значение		= ДанныеКартинки;
	КонецЦикла;
	
	ОбъектДляЗаписи.Изображения = Новый ХранилищеЗначения(СписокИзображений);
	
	ОбъектДляЗаписи.МестаИспользования.Очистить();
	ОбъектДляЗаписи.МестаИспользования.Загрузить(МестаИспользования.Выгрузить());
	Попытка
		ОбъектДляЗаписи.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		//Сообщить("При записи статьи произошла ошибка: " + Описание);
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='При записи статьи произошла ошибка: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Описание);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
			
	КонецПопытки;
	
	НаборЗаписей = РегистрыСведений.бит_си_УстановленныеМеткиСтатей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Статья.Значение = Ссылка;
	НаборЗаписей.Отбор.Статья.Использование = Истина;
	УстановленныеМетки = УстановленныеМетки(Метки.ПолучитьЭлементы());
	Для Каждого ТекСтрока Из УстановленныеМетки Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Статья = Ссылка;
		Запись.Метка = ТекСтрока.Метка;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		//Сообщить("При записи меток статьи произошла ошибка: " + Описание);
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='При записи меток статьи произошла ошибка: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Описание);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
	
	НаборЗаписей = РегистрыСведений.бит_си_СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Статья.Значение = Ссылка;
	НаборЗаписей.Отбор.Статья.Использование = Истина;
	НаборЗаписей.Отбор.ДляОтборов.Значение = Истина;
	НаборЗаписей.Отбор.ДляОтборов.Использование = Истина;
	Для Каждого ТекТип Из ОтборыОбъектов.ПолучитьЭлементы() Цикл
		Для Каждого ТекСтрока Из ТекТип.ПолучитьЭлементы() Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Статья		= Ссылка;
			Запись.Объект		= ТекСтрока.Объект;
			Запись.Тип			= ТекТип.Тип;
			Запись.ДляОтборов	= Истина;
		КонецЦикла;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		//Сообщить("При критериев отбора произошла ошибка: " + Описание);
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='При критериев отбора произошла ошибка: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Описание);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
	
	НаборЗаписей = РегистрыСведений.бит_си_СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Статья.Значение = Ссылка;
	НаборЗаписей.Отбор.Статья.Использование = Истина;
	НаборЗаписей.Отбор.ДляОтборов.Значение = Ложь;
	НаборЗаписей.Отбор.ДляОтборов.Использование = Истина;
	Для Каждого ТекТип Из СвязанныеОбъекты.ПолучитьЭлементы() Цикл
		Для Каждого ТекСтрока Из ТекТип.ПолучитьЭлементы() Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Статья		= Ссылка;
			Запись.Объект		= ТекСтрока.Объект;
			Запись.Тип			= ТекТип.Тип;
			Запись.ДляОтборов	= Ложь;
		КонецЦикла;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		//Сообщить("При записи связанных объектов произошла ошибка: " + Описание);
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='При записи связанных объектов произошла ошибка: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Описание);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
		
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры // ЗаписатьСтатьюНаСервере()

// Возвращает таблицу устаноленных меток.
// 
// Параметры: 
// 	Строки      	 	 -	КоллекцияСтрокДереваЗначений. Строки для заполнения.
// 							
// 	ТабМетки	       	 -	ТаблицаЗначений       	 Таблица меток для заполнения.
// Возвращаемое значение:
// 	Возврат ...        	 -	ТаблицаЗначений        	 Таблица устаноленных меток.
//
&НаСервере
Функция УстановленныеМетки(Строки, ТабМетки = Неопределено)
	
	Если НЕ ТипЗнч(ТабМетки) = Тип("ТаблицаЗначений") Тогда
		ТабМетки = Новый ТаблицаЗначений();
		ТабМетки.Колонки.Добавить("Метка", Новый ОписаниеТипов("СправочникСсылка.бит_си_МеткиСтатей"));
	КонецЕсли;
	Для Каждого ТекСтрока Из Строки Цикл
		Если ТекСтрока.Метка.ЭтоГруппа Тогда
			УстановленныеМетки(ТекСтрока.ПолучитьЭлементы(), ТабМетки);
			Продолжить;
		КонецЕсли;
		Если ТекСтрока.Использование = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ТабМетки.Найти(ТекСтрока.Метка, "Метка") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабМетки.Добавить();
		НоваяСтрока.Метка = ТекСтрока.Метка;
	КонецЦикла;
	
	Возврат ТабМетки;
	
КонецФункции // УстановленныеМетки()

// Очищает справочник.
// 
&НаСервереБезКонтекста
Процедура ОчиститьСправкуНаСервере()
	
	бит_си_ИсточникСправочникСтатьи.ОчиститьСправочнуюИнформацию();
	
КонецПроцедуры // ОчиститьСправкуНаСервере()

// Загружает справку на сервере.
// 
// Параметры: 
// 	Адрес		       	 -	Строка               	 Адрес во временном хранилище.
// 	Расширение  	 	 -	Строка              	 Расширение файла.
//
&НаСервереБезКонтекста
Процедура ЗагрузитьСправкуНаСервере(Адрес, Расширение)
	
	ПроверкаПройдена = Истина;
	Попытка
		ВремФайл = "";
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		Данные = ПолучитьИзВременногоХранилища(Адрес);
		Данные.Записать(ИмяВременногоФайла);
		Файл = Новый Файл(ИмяВременногоФайла);
		ПроверкаПройдена = Файл.Существует();
	Исключение
		ПроверкаПройдена = Ложь;
	КонецПопытки;
	Если Не ПроверкаПройдена Тогда 
		Возврат;
	КонецЕсли;
	бит_си_ИсточникСправочникСтатьи.ЗагрузитьСправочнуюИнформациюИзФайла(ИмяВременногоФайла);
	
КонецПроцедуры // ЗагрузитьСправкуНаСервере()

// Загружает макет справки. 
// 
// Параметры: 
// 	АдресФайла	 -	Строка.
//  Адрес во временном хранилище файла архива выгруженной справочной информации.
//
&НаКлиенте
Процедура ЗагрузитьСправкуМакетНаСервере(АдресФайла)
	
	СтруктураМетаданных = Новый Структура;
	СтруктураМетаданных.Вставить("Конфигурация"				, Новый Структура("Коллекция, Представление",
																			  "Конфигурация", "Конфигурация"));
	СтруктураМетаданных.Вставить("Подсистема"				, Новый Структура("Коллекция, Представление",
																			  "Подсистемы", "Подсистемы"));
	СтруктураМетаданных.Вставить("ОбщаяФорма"				, Новый Структура("Коллекция, Представление",
																			  "ОбщиеФормы", "Общие формы"));
	СтруктураМетаданных.Вставить("Справочник"				, Новый Структура("Коллекция, Представление",
																			  "Справочники", "Справочники"));
	СтруктураМетаданных.Вставить("Документ"					, Новый Структура("Коллекция, Представление",
																			  "Документы", "Документы"));
	СтруктураМетаданных.Вставить("ЖурналДокументов"			, Новый Структура("Коллекция, Представление",
																			  "ЖурналыДокументов", "Журналы документов"));
	СтруктураМетаданных.Вставить("Обработка"				, Новый Структура("Коллекция, Представление",
																			  "Обработки", "Обработки"));
	СтруктураМетаданных.Вставить("Отчет"					, Новый Структура("Коллекция, Представление",
																			  "Отчеты", "Отчеты"));
	СтруктураМетаданных.Вставить("РегистрСведений"			, Новый Структура("Коллекция, Представление",
																			  "РегистрыСведений", "Регистры сведений"));
	СтруктураМетаданных.Вставить("РегистрБухгалтерии"		, Новый Структура("Коллекция, Представление",
																			  "РегистрыБухгалтерии", "Регистры бухгалтерии"));
	СтруктураМетаданных.Вставить("РегистрНакопления"		, Новый Структура("Коллекция, Представление",
																			  "РегистрыНакопления", "Регистры накопления"));
	СтруктураМетаданных.Вставить("РегистрРасчета"			, Новый Структура("Коллекция, Представление",
																			  "РегистрыРасчета", "Регистры расчета"));
	СтруктураМетаданных.Вставить("ПланВидовХарактеристик"	, Новый Структура("Коллекция, Представление",
																			  "ПланыВидовХарактеристик", "Планы видов характеристик"));
	СтруктураМетаданных.Вставить("ПланВидовРасчета"			, Новый Структура("Коллекция, Представление",
																			  "ПланыВидовРасчета", "Планы видов расчета"));
	СтруктураМетаданных.Вставить("ПланСчетов"				, Новый Структура("Коллекция, Представление",
																			  "ПланыСчетов", "Планы счетов"));
	СтруктураМетаданных.Вставить("ПланОбмена"				, Новый Структура("Коллекция, Представление",
																			  "ПланыОбмена", "Планы обмена"));
	
	ВремИмя = ПолучитьИмяВременногоФайла();
	ИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	НачатьСозданиеКаталога(Новый ОписаниеОповещения("ЗагрузитьСправкуМакетНаСервереЗавершение1", ЭтотОбъект, Новый Структура("АдресФайла, ВремИмя,  ИмяФайлаАрхива, СтруктураМетаданных", АдресФайла, ВремИмя,  ИмяФайлаАрхива, СтруктураМетаданных)), ВремИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправкуМакетНаСервереЗавершение1(ИмяКаталога, ДополнительныеПараметры) Экспорт
    
    АдресФайла = ДополнительныеПараметры.АдресФайла;
    ВремИмя = ДополнительныеПараметры.ВремИмя;
    ИмяФайлаАрхива = ДополнительныеПараметры.ИмяФайлаАрхива;
    СтруктураМетаданных = ДополнительныеПараметры.СтруктураМетаданных;
    
    
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
    ДвоичныеДанные.Записать(ИмяФайлаАрхива);
    
    Архив = Новый ЧтениеZipФайла(ИмяФайлаАрхива);
    Архив.ИзвлечьВсе(ВремИмя, РежимВосстановленияПутейФайловZIP.Восстанавливать);
    
    МассивФайлов = Неопределено;
    
    
    НачатьПоискФайлов(Новый ОписаниеОповещения("ЗагрузитьСправкуМакетНаСервереЗавершение", ЭтотОбъект, Новый Структура(" СтруктураМетаданных",  СтруктураМетаданных)), ВремИмя, "*.htm");

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьСправкуМакетНаСервереЗавершение(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДеревоСтатей = Новый ДеревоЗначений();
	ДеревоСтатей.Колонки.Добавить("Иерархия"			, Новый ОписаниеТипов("Строка"));
	ДеревоСтатей.Колонки.Добавить("Имя"					, Новый ОписаниеТипов("Строка"));
	ДеревоСтатей.Колонки.Добавить("Представление"		, Новый ОписаниеТипов("Строка"));
	ДеревоСтатей.Колонки.Добавить("Файл"				, Новый ОписаниеТипов("Строка"));
	ДеревоСтатей.Колонки.Добавить("СтруктураИерархии"	, Новый ОписаниеТипов("Строка"));
	
    СтруктураМетаданных = ДополнительныеПараметры.СтруктураМетаданных;
    
    МассивФайлов = НайденныеФайлы;
    Для Каждого Файл Из МассивФайлов Цикл
        Если Файл.ЭтоКаталог() Тогда
            Продолжить;
        КонецЕсли;
        
        СтрокаРазбора     = Файл.ИмяБезРасширения + ".";
        СтруктураИерархии = "";
        Иерархия = "";
        КолВоТочек        = СтрЧислоВхождений(СтрокаРазбора, ".");
        Имя = "";
        Для Сч = 1 По КолВоТочек Цикл
            
            ЭтоОписаниеКонфигурации = (Сч = 2 И Имя = "Конфигурация");
            
            ПозТочки = Найти(СтрокаРазбора, ".");
            Имя = Лев(СтрокаРазбора, ПозТочки - 1);
            
            СтруктураИерархииСтар = СтруктураИерархии;
            СтруктураИерархии     = ?(СтруктураИерархии = "", Имя, СтруктураИерархии + "." + Имя);
            Если НЕ ((Сч = 3 ИЛИ (Сч = 2 И ЭтоОписаниеКонфигурации)) И (Имя = "Форма" ИЛИ Имя = "Справка")) Тогда
                Иерархия = ?(Иерархия = "", Имя, Иерархия + "." + Имя);
            КонецЕсли;
            РодительскаяСтрокаСтар  = ДеревоСтатей.Строки.Найти(СтруктураИерархииСтар, "СтруктураИерархии", Истина);
            РодительскаяСтрока      = ДеревоСтатей.Строки.Найти(СтруктураИерархии, "СтруктураИерархии", Истина);
            
            Если РодительскаяСтрокаСтар = Неопределено И РодительскаяСтрока = Неопределено Тогда
                СтрокаДерева = ДеревоСтатей.Строки.Добавить();
            ИначеЕсли НЕ РодительскаяСтрока = Неопределено Тогда 
                СтрокаРазбора = Прав(СтрокаРазбора, СтрДлина(СтрокаРазбора) - ПозТочки);
                Продолжить;
            Иначе 
                Если ((Сч = 2 И ЭтоОписаниеКонфигурации) ИЛИ Сч = 3 ИЛИ Сч = 5) И Имя = "Справка" Тогда
                    РодительскаяСтрокаСтар.Файл = Файл.ПолноеИмя;
                    Прервать;
                КонецЕсли;
                СтрокаДерева = РодительскаяСтрокаСтар.Строки.Добавить();
            КонецЕсли; 
            
            СтрокаДерева.Имя				= Имя;
            Если Сч = 1 Тогда
                СтрокаДерева.Имя			= СтруктураМетаданных[Имя].Коллекция;
                СтрокаДерева.Представление	= СтруктураМетаданных[Имя].Представление;
            ИначеЕсли Сч = 2 Тогда
                СтрокаДерева.Представление	= Метаданные[СтрокаДерева.Родитель.Имя][Имя].Представление();
            ИначеЕсли Сч = 4 И СтрокаДерева.Родитель.Имя = "Форма" Тогда
                ВремМетаОбъект = Метаданные[СтрокаДерева.Родитель.Родитель.Родитель.Имя];
                СтрокаДерева.Представление	= ВремМетаОбъект[СтрокаДерева.Родитель.Родитель.Имя].Представление() + ": " +
                ВремМетаОбъект[СтрокаДерева.Родитель.Родитель.Имя].Формы[Имя].Представление();
            КонецЕсли;
            СтрокаДерева.Иерархия			= Иерархия;
            СтрокаДерева.СтруктураИерархии	= СтруктураИерархии;
            
            Если Сч = КолВоТочек - 1 Тогда
                СтрокаДерева.Файл = Файл.ПолноеИмя;
            КонецЕсли; 
            
            СтрокаРазбора = Прав(СтрокаРазбора, СтрДлина(СтрокаРазбора) - ПозТочки);
            
        КонецЦикла; 
    КонецЦикла; 
    
    ГруппаСС = Справочники.бит_си_Статьи.НайтиПоНаименованию("Справка 1С",Истина);
    Если НЕ ГруппаСС.ЭтоГруппа ИЛИ ГруппаСС.Пустая() Тогда
        ГруппаСС = Справочники.бит_си_Статьи.СоздатьГруппу();
        ГруппаСС.Наименование = "Справка 1С";
        ГруппаСС.ОписаниеРаздела = "Статьи встроенной справки конфигурации """ + СокрЛП(Метаданные.Синоним) + """";
        ГруппаСС.Записать();
        ГруппаСС = ГруппаСС.Ссылка;
    КонецЕсли;
    
    СоздатьСтатьиСправки(ДеревоСтатей, ГруппаСС);
    
    Для Каждого Файл Из МассивФайлов Цикл 
        Попытка
            УдалитьФайлы(Файл.ПолноеИмя);
        Исключение
            Продолжить;
        КонецПопытки;
    КонецЦикла;

КонецПроцедуры // ЗагрузитьСправкуМакетНаСервере()

// Создает статьи справки из данных строк дерева значений.
// 
// Параметры: 
// 	СтрокаДерева       	 -	СтрокаДереваЗначений.
//  Строка дерева, содержащая информацию для создания статьи справки.
// 		Поля: 
// 	Представление  	 -	Строка. Наименование статьи справки.
// 	Иерархия	  	 -	Строка. Наименование объекта метаданных для привязки статьи справки.
// 	Файл		  	 -	Строка. Имя файла на диске, содержащего текст справки.
// 	Группа:        	 -	СправочникСсылка.бит_си_Статьи	 Группа справочника статей.                                       
//
&НаСервереБезКонтекста
Процедура СоздатьСтатьиСправки(СтрокаДерева, Группа)
	
	Для Каждого Объект Из СтрокаДерева.Строки Цикл
		Если НЕ Объект.Файл = "" Тогда
    		Статья = Справочники.бит_си_Статьи.НайтиПоНаименованию(Объект.Представление, Истина, Группа);
			Если Статья.ЭтоГруппа ИЛИ Статья.Пустая() Тогда
				Статья = Справочники.бит_си_Статьи.СоздатьЭлемент();
				Статья.Родитель = Группа;
				Статья.Наименование = Объект.Представление;
			Иначе
				Статья = Статья.ПолучитьОбъект();
			КонецЕсли;
			Статья.НазваниеСтатьи = Объект.Представление;
			Статья.МестаИспользования.Очистить();
			Место = Статья.МестаИспользования.Добавить();
			Место.ИмяМетки = Объект.Иерархия;
			Статья.Записать();
			ВремФайл = Новый Файл(Объект.Файл);
			ТекКаталог = ВремФайл.Путь;
			ВремФайл = Новый ТекстовыйДокумент();
			ВремФайл.Прочитать(Объект.Файл);
			Если Статья.СохранитьИзображенияВБД(ВремФайл.ПолучитьТекст(), ТекКаталог) Тогда
				Статья.Записать();
			КонецЕсли;
		Иначе
			ГруппаК = Справочники.бит_си_Статьи.НайтиПоНаименованию(Объект.Представление, Истина, Группа);
			Если НЕ ГруппаК.ЭтоГруппа ИЛИ ГруппаК.Пустая() Тогда
				ГруппаК = Справочники.бит_си_Статьи.СоздатьГруппу();
				ГруппаК.Родитель		= Группа;
				ГруппаК.Наименование	= Объект.Представление;
				ГруппаК.ОписаниеРаздела	= "";
				ГруппаК.Записать();
				ГруппаК = ГруппаК.Ссылка;
			КонецЕсли;
			СоздатьСтатьиСправки(Объект, ГруппаК);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СоздатьСтатьиСправки()

#КонецОбласти

#Область ОбработкаКомандЗагрузкиСохраненияСтатей

// Процедура обработчик - события "ЗагрузитьИзСправки".
// Кнопки командной панели формы.
// 
&НаКлиенте
Процедура ЗагрузитьИзСправки(Команда)
	#Если Не ВебКлиент Тогда

	ВремИмя = ПолучитьИмяВременногоФайла();
	НачатьСозданиеКаталога(Новый ОписаниеОповещения("ЗагрузитьИзСправкиЗавершение3", ЭтотОбъект, Новый Структура("ВремИмя", ВремИмя)), ВремИмя);
	#Иначе
		//Сообщить("На веб клиенте не доступна возможность загрузки из справки.");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='На веб клиенте не доступна возможность загрузки из справки.'");
		Сообщение.Сообщить();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзСправкиЗавершение3(ИмяКаталога, ДополнительныеПараметры) Экспорт
    
    ВремИмя = ДополнительныеПараметры.ВремИмя;
    
    
    КодВозврата = 0;
    ЗапуститьСистему("DESIGNER /DumpConfigFiles  """ + ВремИмя +"\"+ """ -Help", Истина, КодВозврата);
    
    Если НЕ КодВозврата = 0 Тогда
		//Сообщить("Не удалось выгрузить файлы справки.");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Не удалось выгрузить файлы справки.'");
		Сообщение.Сообщить();
        Возврат;
    КонецЕсли;
    
    МассивФайлов = Неопределено;
    
    
    НачатьПоискФайлов(Новый ОписаниеОповещения("ЗагрузитьИзСправкиЗавершение2", ЭтотОбъект, Новый Структура("ВремИмя", ВремИмя)), ВремИмя, "*.htm");

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзСправкиЗавершение2(НайденныеФайлы, ДополнительныеПараметры) Экспорт
    
    ВремИмя = ДополнительныеПараметры.ВремИмя;
    
    
    МассивФайлов = НайденныеФайлы;
    Если МассивФайлов.Количество() = 0 Тогда
		//Сообщить("Не обнаружено выгруженных файлов справки.");
 		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Не обнаружено выгруженных файлов справки.'");
		Сообщение.Сообщить();
       Возврат;
    КонецЕсли;
    
    ИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
    
    Архив = Новый ЗаписьZipФайла(ИмяФайлаАрхива, , , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный);
    Архив.Добавить(ВремИмя + "\*.*",
    РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
    РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
    Архив.Записать();
    
    Попытка
        УдалитьФайлы(ВремИмя, "*.*");
    Исключение
        Ошибка = ОписаниеОшибки();
    КонецПопытки;
    
    АдресФайла = "";
    НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьИзСправкиЗавершение1", ЭтотОбъект, Новый Структура("АдресФайла, ИмяФайлаАрхива", АдресФайла, ИмяФайлаАрхива)), АдресФайла,
    ИмяФайлаАрхива,
    Ложь,
    ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзСправкиЗавершение1(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    
    АдресФайла = ДополнительныеПараметры.АдресФайла;
    ИмяФайлаАрхива = ДополнительныеПараметры.ИмяФайлаАрхива;
    
    
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;
    
    НачатьУдалениеФайлов(Новый ОписаниеОповещения("ЗагрузитьИзСправкиЗавершение", ЭтотОбъект, Новый Структура("АдресФайла", АдресФайла)), ИмяФайлаАрхива);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзСправкиЗавершение(ДополнительныеПараметры) Экспорт
    
    АдресФайла = ДополнительныеПараметры.АдресФайла;
    
    
    ЗагрузитьСправкуМакетНаСервере(АдресФайла);

КонецПроцедуры // ЗагрузитьИзСправки()

// Процедура обработчик - события "ЗагрузитьИзФайла".
// Кнопки командной панели формы.
// 
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = "Файлы разделов справки(*.xml)|*.xml|Упакованные файлы разделов справки (*.zip)|*.zip";
	ДиалогОткрытияФайла.Расширение = "zip";
	ДиалогОткрытияФайла.МножественныйВыбор = ложь;
			
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение1", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение1(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
    ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
    
    
    Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
        Возврат;
    КонецЕсли;
    
    ВремФайл = ДиалогОткрытияФайла.ПолноеИмяФайла;
    
    Ответ = Неопределено;
    
    
    ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)), "Очистить справочную информацию перед загрузкой?",
    РежимДиалогаВопрос.ДаНетОтмена,
    30,
    КодВозвратаДиалога.Нет,
    "Загрузка справочной информации");

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
    
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
        ОчиститьСправкуНаСервере();
    КонецЕсли;
    Расширение = Прав(ДиалогОткрытияФайла.ПолноеИмяФайла,3);
    АдресФайлаВоВременномХранилище = "";
    НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершениеЗавершение", ЭтотОбъект, Новый Структура("АдресФайлаВоВременномХранилище, Расширение", АдресФайлаВоВременномХранилище, Расширение)), АдресФайлаВоВременномХранилище,
        ДиалогОткрытияФайла.ПолноеИмяФайла,
        Ложь,
        ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершениеЗавершение(Результат, Адрес, ПолноеИмяФайла, ДополнительныеПараметры1) Экспорт
    
    АдресФайлаВоВременномХранилище = ДополнительныеПараметры1.АдресФайлаВоВременномХранилище;
    Расширение = ДополнительныеПараметры1.Расширение;
    
    
    Если Не Результат Тогда
        Возврат;
    КонецЕсли;
    ЗагрузитьСправкуНаСервере(АдресФайлаВоВременномХранилище, Расширение);
	//Сообщить("Данные загружены");
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = НСтр("ru='Данные загружены.'");
	Сообщение.Сообщить();
    Элементы.Список.Обновить();

КонецПроцедуры //ЗагрузитьИзФайла()

// Процедура обработчик команды "СохранитьСтатьи".
// 
&НаКлиенте
Процедура СохранитьСтатьи(Команда)
	
	Попытка
		Форма = ПолучитьФорму("Обработка.бит_си_СохранениеСправочнойИнформации.Форма.ФормаУправляемая", , ЭтаФорма);
	Исключение
		Возврат;
	КонецПопытки;
	Форма.Открыть();
	
КонецПроцедуры //СохранитьСтатьи()

// Процедура обработчик - события "ЗагрузитьHTMLИзФайла" кнопки командной панели "ГруппаЗагрузитьСохранитьОтмена".
// 
&НаКлиенте
Процедура ЗагрузитьHTMLИзФайла(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Или 
		Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Web-страница (*.htm,*.html)|*.htm;*.html";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ЗагрузитьHTMLИзФайлаЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьHTMLИзФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
    ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
    
    
    Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
        Возврат;
    КонецЕсли;
    
    ВремДок = Новый ТекстовыйДокумент();
    ВремДок.Прочитать(ДиалогОткрытияФайла.ПолноеИмяФайла);
    РабочийТекстHTML = ВремДок.ПолучитьТекст();
    
    ОбновитьТекстПоляРедактированияИзРабочегоТекста(ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
    
    Модифицированность = Истина;

КонецПроцедуры //ЗагрузитьHTMLИзФайла()

// Процедура обработчик - события "СохранитьСтатью" кнопки командной панели "ГруппаЗагрузитьСохранитьОтмена".
// 
&НаКлиенте
Процедура СохранитьСтатью(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ОткрытаяСтраницаСтатьи = "ГруппаРедактирование" И Модифицированность Тогда 
		ОбновитьРабочийТекстИзПоляРедактирования();
	ИначеЕсли ОткрытаяСтраницаСтатьи = "ГруппаHTML" И Модифицированность Тогда 
		ОбновитьТекстПоляРедактированияИзРабочегоТекста(ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
	КонецЕсли;
	ЗаписатьСтатьюНаСервере(Элементы.Список.ТекущиеДанные.Ссылка, ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
	Оповестить("ИзмененаСтатьяСправки", Элементы.Список.ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры //СохранитьСтатью()

// Процедура обработчик - события "ОтменитьЗаписть" кнопки командной панели "ГруппаЗагрузитьСохранитьОтмена".
// 
&НаКлиенте
Процедура ОтменитьЗапись(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Или 
		Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.Модифицированность = Ложь;
	СписокПриАктивизацииСтроки(Элементы.Список);
	
КонецПроцедуры //ОтменитьЗаписть()

#КонецОбласти

#Область ОбработкаКомандДереваСтатей

// Процедура обработчик - события "ИзменитьПорядокСтатейВверх" кнопки командной панели "ГруппаКоманднаяПанельСписка".
// 
&НаКлиенте
Процедура ИзменитьПорядокСтатейВверх(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПорядок(Элементы.Список.ТекущиеДанные.Ссылка, -1);
	Элементы.Список.Обновить();
КонецПроцедуры //ИзменитьПорядокСтатейВверх()

// Процедура обработчик - события "ИзменитьПорядокСтатейВниз" кнопки командной панели "ГруппаКоманднаяПанельСписка".
// 
&НаКлиенте
Процедура ИзменитьПорядокСтатейВниз(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПорядок(Элементы.Список.ТекущиеДанные.Ссылка, 1);
	Элементы.Список.Обновить();
КонецПроцедуры //ИзменитьПорядокСтатейВниз()

#КонецОбласти

#Область ОбработкаКомандРедактированияСтатьи

// Процедура обработчик - команды "ВставитьКартинкуИзБуфера", 
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента",
// Вставляет в текст статьи картинку из буфера обмена.
// 
&НаКлиенте
Процедура ВставитьКартинкуИзБуфера(Команда)
	
	ВремДанныеРегистратора = "";
	ВремДанныеБиблиотеки = "";
	ПолучитьПараметрыБиблиотекиУтилитСервер(ВремДанныеРегистратора, ВремДанныеБиблиотеки);
	Если НЕ бит_Утилиты.ЕстьКартинкаВБуфереОбмена(ВремДанныеБиблиотеки, ВремДанныеРегистратора) Тогда
		Возврат;
	КонецЕсли;
	ВыбранноеИзображение = бит_Утилиты.ПолучитьКартинкуИзБуфераОбмена(ВремДанныеРегистратора,ВремДанныеБиблиотеки, "png");
	АдресВХранилище = ПоместитьВоВременноеХранилище(ВыбранноеИзображение, ЭтаФорма.УникальныйИдентификатор);
	ВставитьКартинкуСервер(АдресВХранилище);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры //ВставитьКартинкуИзБуфера()

// Процедура обработчик - команды "ВставитьСсылкуНаСтатьюСправки", 
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента",
// Вставляет в текст статьи ссылку на другую статью справки.
// 
&НаКлиенте
Процедура ВставитьСсылкуНаСтатьюСправки(Команда)
	
	ФормаСтатьи = ПолучитьФорму("Справочник.бит_си_Статьи.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтаФорма);
	РезСтруктура = ФормаСтатьи.ОткрытьМодально(30);
	Если НЕ РезСтруктура = Неопределено Тогда
		НачалоВыделения = "";
		КонецВыделения = "";
		Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
		
		ТекстДляВставки = "<a href=""ВнСсылка=" +
						  СокрЛП(РезСтруктура.УникальныйИдентификатор()) +
						  """> " +
						  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
						    РезСтруктура.НазваниеСтатьи,
							ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
						  " </a>";
		
		ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
		
		ВставитьТекстВHTMLСервер(ТекстДляВставки, НачалоВыделения);
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры //ВставитьСсылкуНаСтатьюСправки()

// Процедура обработчик - команды "ВставитьСсылкуНаОбъект", 
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента",
// Вставляет в текст статьи ссылку на форму элемента Справочника, Документа, форму Отчета, Обработки.
// 
&НаКлиенте
Процедура ВставитьСсылкуНаОбъект(Команда)
	
	ИменаКоллекций = Новый Массив;
	ИменаКоллекций.Добавить("Справочники");
	ИменаКоллекций.Добавить("Документы");
	ИменаКоллекций.Добавить("Отчеты");
	ИменаКоллекций.Добавить("Обработки");
	
	ФормаДерева = ПолучитьФорму("Справочник.бит_си_Статьи.Форма.ДеревоМетаданныхУправляемая", Новый Структура("ИменаКоллекций", ИменаКоллекций), ЭтаФорма);
	РезСтруктура = ФормаДерева.ОткрытьМодально(30);
	
	Если НЕ РезСтруктура = Неопределено Тогда
		НачалоВыделения = "";
		КонецВыделения = "";
		Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
		
		Если НЕ Найти("Справочники, Документы", РезСтруктура.ВидОбъекта) = 0 Тогда
			ФормаВыбора = ПолучитьФорму(РезСтруктура.ИмяОбъектаПолное + ".ФормаВыбора", , ЭтаФорма);
			ЗначениеВыбора = ФормаВыбора.ОткрытьМодально(30);
			Если ЗначениеВыбора <> Неопределено Тогда
				ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
								  РезСтруктура.ВидОбъекта +
								  "@" + РезСтруктура.ИмяОбъекта +
								  "@" + СокрЛП(ЗначениеВыбора.УникальныйИдентификатор()) +
								  """> " +
								  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
								    СокрЛП(ЗначениеВыбора),
									ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
								  " </a>";
			КонецЕсли; 
		Иначе	
			ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
							  РезСтруктура.ВидОбъекта +
							  "@" + РезСтруктура.ИмяОбъекта +
							  "@Форма" + """> " +
							  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
							    РезСтруктура.Синоним,
								ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
							  " </a>";
		КонецЕсли; 
		
		ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
		
		ВставитьТекстВHTMLСервер(ТекстДляВставки, НачалоВыделения);
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры //ВставитьСсылкуНаОбъект()

// Процедура обработчик - команды "ВставитьСсылкуНаФормуСписка",
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента",
// Вставляет в текст статьи ссылку на форму списка Справочника, Документа, РегистраСведений.
// 
&НаКлиенте
Процедура ВставитьСсылкуНаФормуСписка(Команда)
	
	ИменаКоллекций = Новый Массив;
	ИменаКоллекций.Добавить("Справочники");
	ИменаКоллекций.Добавить("Документы");
	ИменаКоллекций.Добавить("РегистрыСведений");
	
	ФормаДерева = ПолучитьФорму("Справочник.бит_си_Статьи.Форма.ДеревоМетаданныхУправляемая", Новый Структура("ИменаКоллекций", ИменаКоллекций), ЭтаФорма);
	РезСтруктура = ФормаДерева.ОткрытьМодально(30);
	
	Если РезСтруктура <> Неопределено Тогда
		НачалоВыделения = "";
		КонецВыделения = "";
		Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
		
		ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
						  РезСтруктура.ВидОбъекта +
						  "@" + РезСтруктура.ИмяОбъекта +
						  "@ФормаСписка" + """> " +
						  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
						    РезСтруктура.Синоним,
							ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
						  " </a>";
						  
		ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
		
		ВставитьТекстВHTMLСервер(ТекстДляВставки, НачалоВыделения);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры //ВставитьСсылкуНаФормуСписка

#КонецОбласти

#Область ОбработкаПрочихКоманд

// Процедура обработчик - команды "Привязки" кнопки командной панели формы.
// 
&НаКлиенте
Процедура Привязки(Команда)
	ФормаУправляенияПривязками = ПолучитьФорму("Справочник.бит_си_Статьи.Форма.ФормаПривязкиСтатейУправляемая",
											   ,
											   ЭтаФорма);
	ФормаУправляенияПривязками.Открыть();										   
КонецПроцедуры //Привязки()

#КонецОбласти

#Область ОбработчикиСобытийДереваСтатей

// Процедура обработчик - события "ПриАктивизацииСтроки" элемента "Список".
// 
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ПоследняяСсылка = Элемент.ТекущиеДанные.Ссылка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность И НЕ ПоследняяСсылка.Пустая() Тогда 
		Ответ = Неопределено;
 
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокПриАктивизацииСтрокиЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), "Текст статьи: " + Строка(ПоследняяСсылка)+" был изменен. Сохранить изменения?",
	 				   РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	СписокПриАктивизацииСтрокиФрагмент(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Если ОткрытаяСтраницаСтатьи = "ГруппаРедактирование" И Модифицированность Тогда 
            ОбновитьРабочийТекстИзПоляРедактирования();
        ИначеЕсли ОткрытаяСтраницаСтатьи = "ГруппаHTML" И Модифицированность Тогда 
            ОбновитьТекстПоляРедактированияИзРабочегоТекста(ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
        КонецЕсли;
        ЗаписатьСтатьюНаСервере(ПоследняяСсылка, ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
        Оповестить("ИзмененаСтатьяСправки", ПоследняяСсылка, ЭтаФорма);
    КонецЕсли;
    ЭтаФорма.Модифицированность  = Ложь;
    
    СписокПриАктивизацииСтрокиФрагмент(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиФрагмент(Знач Элемент)
    
    ПоследняяСсылка = Элемент.ТекущиеДанные.Ссылка;
    
    ОтключитьОбработчикОжидания("ОбновитьОтображениеСтатьи");
    ПодключитьОбработчикОжидания("ОбновитьОтображениеСтатьи", 0.3, Истина);

КонецПроцедуры //СписокПриАктивизацииСтроки()

// Процедура обработчик - события "Выбор" элемента "Список".
// 
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры //СписокВыбор()

#КонецОбласти

#Область ОбработчикиСобытийПолейРедактированияСтатей

// Процедура обработчик - события "ПриИзменении" элемента "ТекстСтатьиРедактирование".
// 
&НаКлиенте
Процедура ТекстСтатьиРедактированиеПриИзменении(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьРабочийТекстИзПоляРедактирования();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры //ТекстСтатьиРедактированиеПриИзменении()

// Процедура обработчик - события "ПриСменеСтраницы" элемента "ГруппаТекстСтатьиРедактирование".
// 
&НаКлиенте
Процедура ГруппаТекстСтатьиРедактированиеПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		ОткрытаяСтраницаГруппы = ТекущаяСтраница.Имя;
		Возврат;
	КонецЕсли;
	
	//переделываем на смену страниц, чтобы пользователь мог работать сколько хотел
	Если ОткрытаяСтраницаСтатьи = "ГруппаРедактирование" И Модифицированность Тогда 
		ОбновитьРабочийТекстИзПоляРедактирования();
	ИначеЕсли ОткрытаяСтраницаСтатьи = "ГруппаHTML" И Модифицированность Тогда 
		ОбновитьТекстПоляРедактированияИзРабочегоТекста(ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
	КонецЕсли;
	
	ОткрытаяСтраницаСтатьи = ТекущаяСтраница.Имя;
	
КонецПроцедуры //ГруппаТекстСтатьиРедактированиеПриСменеСтраницы()

#КонецОбласти

#Область ОбработчикиСобытийРедактированияМетокСтатьи

// Процедура обработчик - команды "Метки_РедактироватьМетку" кнопки командной панели таблмицы "Метки".
// 
&НаКлиенте
Процедура Метки_РедактироватьМетку(Команда)
	
	Если Элементы.Метки.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Справочник.бит_си_МеткиСтатей." + ?(Элементы.Метки.ТекущиеДанные.ЭтоГруппа, "ФормаГруппы", "ФормаОбъекта"),
				 Новый Структура("Ключ", Элементы.Метки.ТекущиеДанные.Метка),
				 ЭтаФорма);
				 
КонецПроцедуры //Метки_РедактироватьМетку()

// Процедура обработчик - команды "Метки_ОткрытьСправочник" кнопки командной панели таблмицы "Метки".
// 
&НаКлиенте
Процедура Метки_ОткрытьСправочник(Команда)
	
	ОткрытьФорму("Справочник.бит_си_МеткиСтатей.ФормаСписка", , ЭтаФорма);
				 
КонецПроцедуры //Метки_ОткрытьСправочник()

// Процедура обработчик - команды "Метки_Обновить" кнопки командной панели таблмицы "Метки".
// 
&НаКлиенте
Процедура Метки_Обновить(Команда)
	
	ЗаполнитьДеревоМеток(Элементы.Список.ТекущиеДанные.Ссылка);
	
	СтрокиДерева = Метки.ПолучитьЭлементы();
	Дерево = Элементы.Метки;
	Для Каждого ТекСтрока Из СтрокиДерева Цикл
		Узел = ТекСтрока.ПолучитьИдентификатор();
		Если Дерево.Развернут(Узел) Тогда
			Продолжить;
		КонецЕсли;
		Дерево.Развернуть(Узел);
	КонецЦикла;
	
КонецПроцедуры //Метки_Обновить()

#КонецОбласти

#Область ОбработчикиСобытийРедактированияПривязокСтатьи

// Процедура обработчик - события "НачалоВыбора" поля "МестаИспользованияИмяМетки" таблицы "МестаИспользования".
// 
&НаКлиенте
Процедура МестаИспользованияИмяМеткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИменаКоллекций = Новый Массив();
	ИменаКоллекций.Добавить("Справочники");
	ИменаКоллекций.Добавить("Документы");
	ИменаКоллекций.Добавить("ЖурналыДокументов");
	ИменаКоллекций.Добавить("ПланыВидовХарактеристик");
	ИменаКоллекций.Добавить("ПланыСчетов");
	ИменаКоллекций.Добавить("ПланыВидовРасчета");
	ИменаКоллекций.Добавить("РегистрыСведений");
	ИменаКоллекций.Добавить("РегистрыНакопления");
	ИменаКоллекций.Добавить("РегистрыБухгалтерии");
	ИменаКоллекций.Добавить("РегистрыРасчета");
	ИменаКоллекций.Добавить("Отчеты");
	ИменаКоллекций.Добавить("Обработки");
	ИменаКоллекций.Добавить("БизнесПроцессы");
	ИменаКоллекций.Добавить("Задачи");
	ИменаКоллекций.Добавить("ПланыОбмена");
	ИменаКоллекций.Добавить("ОбщиеФормы");
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_си_Статьи.Форма.ДеревоМетаданныхУправляемая",
								Новый Структура("ИменаКоллекций,
												|ПоказыватьФормы,
												|ОповещатьОВыборе,
												|ВозвращаемоеЗначение",
												ИменаКоллекций,
												Истина,
												Истина,
												"ИмяОбъектаПолное"),
								Элемент);
	ФормаВыбора.Открыть();
	
КонецПроцедуры //МестаИспользованияИмяМеткиНачалоВыбора()

#КонецОбласти

#Область ОбработчикиСобытийРедактированияОборотовСтатьи

// Процедура обработчик - события "ПередНачаломДобавления" элемента "ОтборыОбъектов".
// 
&НаКлиенте
Процедура ОтборыОбъектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование = Истина Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.ОтборыОбъектов.ТекущаяСтрока = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.ОтборыОбъектов.ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		Отказ = Истина;
		НоваяСтрока = Элементы.ОтборыОбъектов.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
		Элементы.ОтборыОбъектов.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ОтборыОбъектовПриНачалеРедактирования(Элементы.ОтборыОбъектов, Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры //ОтборыОбъектовПередНачаломДобавления()

// Процедура обработчик - события "ПриНачалеРедактирования" табличного поля "ОтборыОбъектов".
// 
&НаКлиенте
Процедура ОтборыОбъектовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.ОтборыОбъектов.ТекущиеДанные;
		Если ТекущаяСтрока.ПолучитьРодителя().Тип = "#Роль" Тогда
			ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
			ТекущаяСтрока.Объект	= "";
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ВыбиратьТип = Ложь;
		ИначеЕсли ТекущаяСтрока.ПолучитьРодителя().Тип = "#РежимЗапуска" Тогда
			ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
			ТекущаяСтрока.Объект	= "";
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ВыбиратьТип = Ложь;
		Иначе
			ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
			ТекущаяСтрока.Объект	= Новый (Тип(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка.")));
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ОграничениеТипа = Новый ОписаниеТипов(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка."));
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ВыбиратьТип = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ОтборыОбъектовПриНачалеРедактирования()

// Процедура обработчик - события "ПередНачаломИзменения" табличного поля "ОтборыОбъектов".
// 
&НаКлиенте
Процедура ОтборыОбъектовПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.ОтборыОбъектов.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ОтборыОбъектовПередНачаломИзменения()

// Процедура обработчик - события "ПриИзменении" табличного поля "ОтборыОбъектовОбъект".
// 
&НаКлиенте
Процедура ОтборыОбъектовОбъектПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборыОбъектов.ТекущиеДанные;
	ТекущаяСтрока = Элементы.ОтборыОбъектов.ТекущаяСтрока;
	НайденаяСтрока = Неопределено;
	СтрокиДляПроверки = ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекСтрока Из СтрокиДЛяПроверки Цикл
		Если НЕ ТекСтрока.ПолучитьИдентификатор() = ТекущаяСтрока И ТекСтрока.Объект = ТекущиеДанные.Объект Тогда
			НайденаяСтрока = ТекСтрока.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НайденаяСтрока = Неопределено Тогда
		СтрокиДляПроверки.Удалить(СтрокиДляПроверки.Индекс(ТекущиеДанные));
		Элементы.ОтборыОбъектов.ТекущаяСтрока = НайденаяСтрока;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры //ОтборыОбъектовОбъектПриИзменении()

// Процедура обработчик - события "НачалоВыбора" табличного поля "ОтборыОбъектовОбъект".
// 
&НаКлиенте
Процедура ОтборыОбъектовОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ОтборыОбъектов.ТекущиеДанные.Тип = "#Роль" Тогда
		СтандартнаяОбработка = Ложь;
	
		СписокРолей = ПолучитьСписокРолей();
		ТекРоль = Неопределено;

		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОтборыОбъектовОбъектНачалоВыбораЗавершение1", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокРолей, Элемент, СписокРолей.НайтиПоЗначению(Элементы.ОтборыОбъектов.ТекущиеДанные.Объект));
	ИначеЕсли Элементы.ОтборыОбъектов.ТекущиеДанные.Тип = "#РежимЗапуска" Тогда
		СтандартнаяОбработка = Ложь;
	
		СписокРежимов = Новый СписокЗначений();
		СписокРежимов.Добавить("Обычный", "Обычный");
		СписокРежимов.Добавить("Управляемый", "Управляемый");
		ТекРежим = Неопределено;

		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОтборыОбъектовОбъектНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокРежимов, Элемент, СписокРежимов.НайтиПоЗначению(Элементы.ОтборыОбъектов.ТекущиеДанные.Объект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыОбъектовОбъектНачалоВыбораЗавершение1(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    ТекРоль = ВыбранныйЭлемент;
    Если НЕ ТекРоль = Неопределено Тогда
        Элементы.ОтборыОбъектов.ТекущиеДанные.Объект = ТекРоль.Значение;
        ОтборыОбъектовОбъектПриИзменении(Элемент);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборыОбъектовОбъектНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    ТекРежим = ВыбранныйЭлемент;
    Если НЕ ТекРежим = Неопределено Тогда
        Элементы.ОтборыОбъектов.ТекущиеДанные.Объект = ТекРежим.Значение;
        ОтборыОбъектовОбъектПриИзменении(Элемент);
    КонецЕсли;

КонецПроцедуры //ОтборыОбъектовОбъектНачалоВыбора()

#КонецОбласти

#Область ОбработчикиСобытийРедактированияСвязанныхОбъектовСтатьи

// Процедура обработчик - события "ПередНачаломДобавления" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Копирование = Истина Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.СвязанныеОбъекты.ТекущаяСтрока = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		Отказ = Истина;
		НоваяСтрока = Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
		Элементы.СвязанныеОбъекты.ТекущаяСтрока = Элементы.СвязанныеОбъекты.ТекущаяСтрока + 1;
		СвязанныеОбъектыПриНачалеРедактирования(Элементы.СвязанныеОбъекты, Истина, Ложь);
	КонецЕсли;
КонецПроцедуры //СвязанныеОбъектыПередНачаломДобавления()

// Процедура обработчик - события "ПриНачалеРедактирования" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.СвязанныеОбъекты.ТекущиеДанные;
		ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
		ТекущаяСтрока.Объект	= Новый (Тип(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка.")));
		Элемент.ПодчиненныеЭлементы.СвязанныеОбъектыОбъект.ОграничениеТипа = Новый ОписаниеТипов(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка."));
		Элемент.ПодчиненныеЭлементы.СвязанныеОбъектыОбъект.ВыбиратьТип = Ложь;
	КонецЕсли;
КонецПроцедуры //СвязанныеОбъектыПриНачалеРедактирования()

// Процедура обработчик - события "ПередНачаломИзменения" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры //СвязанныеОбъектыПередНачаломИзменения()

// Процедура обработчик - события "ПередУдалением" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПередУдалением(Элемент, Отказ)
	Если Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры //СвязанныеОбъектыПередУдалением()

// Процедура обработчик - события "ПриИзменении" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыОбъектПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СвязанныеОбъекты.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СвязанныеОбъекты.ТекущаяСтрока;
	НайденаяСтрока = Неопределено;
	СтрокиДляПроверки = ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекСтрока Из СтрокиДляПроверки Цикл
		Если НЕ ТекСтрока.ПолучитьИдентификатор() = ТекущаяСтрока И ТекСтрока.Объект = ТекущиеДанные.Объект Тогда
			НайденаяСтрока = ТекСтрока.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НайденаяСтрока = Неопределено Тогда
		СтрокиДляПроверки.Удалить(СтрокиДляПроверки.Индекс(ТекущиеДанные));
		Элементы.ОтборыОбъектов.ТекущаяСтрока = НайденаяСтрока;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры //СвязанныеОбъектыОбъектПриИзменении()

// Процедура обработчик - события "ПередНачаломИзменения" табличного поля "Список".
// 
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если ЭтаФорма.Модифицированность Тогда 
		//Сообщить("Перед началом изменения необходимо записать " + 
		//														  ?(Элементы.Список.ТекущиеДанные.ЭтоГруппа, "группу", "статью"));
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='Перед началом изменения необходимо записать %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ?(Элементы.Список.ТекущиеДанные.ЭтоГруппа, "группу", "статью"));
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры //СписокПередНачаломИзменения()

#КонецОбласти