
#Область ПроцедурыОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПредставлениеПериодаРегистрации = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененФлагРучнаяКорректировка" Тогда
		Если Объект.Ссылка = Параметр.ДокументСсылка Тогда 
			ЭтаФорма.Прочитать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеПериодаРегистрации) Тогда
		
		ПредставлениеПериодаРегистрации = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.Дата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.Дата;
	
	бит_РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, Объект.Дата, ЭтаФорма);
	
	ПредставлениеПериодаРегистрации = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.Дата);
	
	Объект.Дата = КонецМесяца(Объект.Дата) - 1 ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.Дата;
	
	ТекущаяДата = ?(Направление > 0, Объект.Дата, ДобавитьМесяц(Объект.Дата, -1));
	бит_РаботаСДиалогами.РегулированиеПредставленияПериодаРегистрации(
	Направление, СтандартнаяОбработка, ТекущаяДата, ПредставлениеПериодаРегистрации);
	Объект.Дата = КонецМесяца(ТекущаяДата) - 1;
	
КонецПроцедуры

#КонецОбласти
