
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПечатныйДокумент = Новый ТабличныйДокумент;
	
	СтруктураВнешнейОбработки = ?(Параметры.Свойство("СтруктураВнешнейОбработки")
	,Параметры.СтруктураВнешнейОбработки
	,Неопределено);
	
	Если Не СтруктураВнешнейОбработки = Неопределено Тогда
		
		ПредставлениеМакета = СтруктураВнешнейОбработки.ПредставлениеОбработки;
		
		// Сформируем печатный документ внешней обработкой.
		бит_ПечатьСервер.НапечататьВнешнююФорму(СтруктураВнешнейОбработки, ПечатныйДокумент);
		
	Иначе
		
		Если Не Параметры.Свойство("ИмяКоллекции") Тогда
			фОтказ = Истина;
			Возврат;
		КонецЕсли;
		
		// Получим значения из параметров формы.
		ИмяКоллекции		= Параметры.ИмяКоллекции;
		ИмяОбъекта			= Параметры.ИмяОбъекта;
		ИмяМакета       	= Параметры.ИмяМакета;
		ПредставлениеМакета = Параметры.ПредставлениеМакета;
		Ссылка       		= Параметры.Ссылка;
		ПараметрыПечати 	= Параметры.ПараметрыПечати;
		
	КонецЕсли;			
	
	ТабДок = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	ЭтаФорма.ТабличныйДокумент = ТабДок;
	
	// Установим свойста табличного документа формы.
	ЭтаФорма.ТабличныйДокумент.ОтображатьЗаголовки		= Ложь;
	ЭтаФорма.ТабличныйДокумент.ОтображатьСетку			= Ложь;
	ЭтаФорма.ТабличныйДокумент.Защита					= Ложь;
	ЭтаФорма.ТабличныйДокумент.КлючПараметровПечати		= ПечатныйДокумент.КлючПараметровПечати;
	ЭтаФорма.ТабличныйДокумент.ЧерноБелыйПросмотр		= Ложь;
	ЭтаФорма.ТабличныйДокумент.ЧерноБелаяПечать			= Истина;
	ЭтаФорма.ТабличныйДокумент.ПовторятьПриПечатиСтроки = ПечатныйДокумент.ПовторятьПриПечатиСтроки;
	
	ЭтаФорма.ТабличныйДокумент.ОриентацияСтраницы = ПечатныйДокумент.ОриентацияСтраницы;
	
	// Установим режим только просмотр.
	Элементы.ПолеТабличногоДокумента.ТолькоПросмотр 	= Истина;
	Элементы.ТолькоПросмотр.Пометка						= Истина;
	
	// Установим заголовок формы.
	ЭтаФорма.Заголовок = "Печать" + ?(ПустаяСтрока(ПредставлениеМакета), "", " - " + ПредставлениеМакета);
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ДействияКомандФормы

// Процедура - обработчик команды "ТолькоПросмотр" формы.
//
&НаКлиенте
Процедура ВыполнитьТолькоПросмотр(Команда)
	
	ТекТолькоПросмотр = Элементы.ТолькоПросмотр.Пометка;
	
	Элементы.ПолеТабличногоДокумента.ТолькоПросмотр = Не ТекТолькоПросмотр;
	Элементы.ТолькоПросмотр.Пометка					= Не ТекТолькоПросмотр;
	
КонецПроцедуры // ВыполнитьТолькоПросмотр()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ОбработкаРасшифровки" поля "ПолеТабличногоДокумента".
//
&НаКлиенте
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ИмяОбъекта = "бит_му_РасчетОтложенныхНалогов" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		бит_ПечатьКлиент.ОбработатьКомандуПечати(ИмяКоллекции
		,ИмяОбъекта
		,"РасшифровкаРасчетов"
		,"Расшифровка расчетов"
		,Расшифровка
		,Элемент);
	КонецЕсли;
	
КонецПроцедуры // ПолеТабличногоДокументаОбработкаРасшифровки()

#КонецОбласти