
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОДН_факт 
	Движения.лб_ОДН_факт.Записывать = Истина;
	Для Каждого ТекСтрокаФактическиеПоказатели Из ФактическиеПоказатели Цикл
		Движение = Движения.лб_ОДН_факт.Добавить();
		Движение.Период = Период;
		Движение.Адрес = ТекСтрокаФактическиеПоказатели.Адрес;
		Движение.ОДН_ВО_М = ТекСтрокаФактическиеПоказатели.ОДН_ВО_М;
		Движение.ОДН_ВО_Р = ТекСтрокаФактическиеПоказатели.ОДН_ВО_Р;
		Движение.ОДН_ХВ_М = ТекСтрокаФактическиеПоказатели.ОДН_ХВ_М;
		Движение.ОДН_ХВ_Р = ТекСтрокаФактическиеПоказатели.ОДН_ХВ_Р;
		Движение.ОДН_ГВ_М = ТекСтрокаФактическиеПоказатели.ОДН_ГВ_М;
		Движение.ОДН_ГВ_Р = ТекСтрокаФактическиеПоказатели.ОДН_ГВ_Р;
		Движение.ОДН_ЭЭ_Р = ТекСтрокаФактическиеПоказатели.ОДН_ЭЭ_Р;
		Движение.ОДН_ЭЭ_кВт = ТекСтрокаФактическиеПоказатели.ОДН_ЭЭ_кВт;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
