
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура УстановитьДатуЗапрета(Команда)
	
	ОткрытьФорму("ОбщаяФорма.бит_УстановкаДатыЗапретаИзмененияДанныхУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПрава(Команда)
	
	ОткрытьФорму("Обработка.бит_рлс_НастройкаПравДоступаПоОбъектамУчета.Форма.Форма");
	
КонецПроцедуры

#КонецОбласти