
#Область ПеременныеМодуля

Перем мДеревоМакетов;            // Хранит дерево макетов печатных форм.

Перем мПодменюПечати;            // Хранит элемент управления подменю печати.

Перем мПечатьПоУмолчанию;        // Хранит элемент управления кнопку печать по умолчанию.

Перем мКоличествоПроживающих;  // Хранит кол-во проживающих. 

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура устанавливает видимость.
//
&НаСервере
Процедура УстановитьВидимость()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислятьПени КАК НачислятьПени
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И НачислятьПени = ИСТИНА) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	Запрос.УстановитьПараметр("Дата"       ,КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	
	Элементы.Пени.Доступность = ?(Запрос.Выполнить().Пустой() ,Ложь, Истина);
	
	
	Если Объект.ОтображатьПоГруппам Тогда
		Элементы.ДеревоНачислений.Видимость = Истина;
		Элементы.ТаблицаНачислений.Видимость = Ложь;
		Элементы.ДеревоУслуг.Видимость = Истина;	
		Элементы.Услуги.Видимость = Ложь;
		
		// БИТ_ЖКХ 11.09.2014
		Элементы.РазвернутьДерево.Видимость = Истина;
		Элементы.СвернутьДерево.Видимость = Истина;
		Элементы.РазвернутьДеревоУслуг.Видимость = Истина;
		Элементы.СвернутьДеревоУслуг.Видимость = Истина;
		Элементы.ВывестиСписокДеревоНачислений.Видимость = Истина;
		Элементы.ВывестиСписокТаблицаНачислений.Видимость = Ложь;
		// БИТ_ЖКХ 11.09.2014
		
	Иначе
		Элементы.ДеревоНачислений.Видимость = Ложь;
		Элементы.ТаблицаНачислений.Видимость = Истина;
		Элементы.ДеревоУслуг.Видимость = Ложь;	
		Элементы.Услуги.Видимость = Истина;	
		
		// БИТ_ЖКХ 11.09.2014
		Элементы.РазвернутьДерево.Видимость = Ложь;
		Элементы.СвернутьДерево.Видимость = Ложь;
		Элементы.РазвернутьДеревоУслуг.Видимость = Ложь;
		Элементы.СвернутьДеревоУслуг.Видимость = Ложь;
		Элементы.ВывестиСписокДеревоНачислений.Видимость = Ложь;
		Элементы.ВывестиСписокТаблицаНачислений.Видимость = Истина;
		// БИТ_ЖКХ 11.09.2014
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет реквизиты нового элемента справочника.
//
&НаСервере
Процедура ЗаполнитьНовыйПоСпискуОтборов()
	
	Если ТипЗнч(СписокОтборов) <> Тип("Отбор") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСправочника = Объект.Ссылка.Метаданные().Реквизиты;
	
	Для каждого ЭлементОтбора Из СписокОтборов Цикл
		
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСправочника.Найти(ЭлементОтбора.Имя) = Неопределено 
			И ЭлементОтбора.Имя <> "Владелец" 
			И ЭлементОтбора.Имя <> "Родитель" Тогда
			Продолжить;
		КонецЕсли;
		
		СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		Если ЭлементОтбора.ВидСравнения = ВидСравнения.Равно Тогда
			
			СправочникОбъект[ЭлементОтбора.Имя] = ЭлементОтбора.Значение;
			
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравнения.ВСписке Тогда
			
			СправочникОбъект[ЭлементОтбора.Имя] = ЭлементОтбора.Значение[0].Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет реквизиты нового элемента справочника.
//
&НаКлиенте
Процедура ЗаполнитьНовыйЭлемент()
	
	ЗаполнитьНовыйПоСпискуОтборов();
	
КонецПроцедуры // ЗаполнитьНовыйЭлемент()

// Процедура заполняет доступные только для чтения реквизиты формы. 
// 
&НаСервере
Процедура ЗаполнитьОписания() 
	
	ОбновитьНастройкиЖКХ();
	
	мТаблицаНачислений = ДанныеФормыВЗначение(ТаблицаНачислений, Тип("ТаблицаЗначений"));
	мТаблицаНачислений.Очистить();
	
	мТаблицаСчетчиков = ДанныеФормыВЗначение(ТаблицаСчетчиков, Тип("ТаблицаЗначений"));
	мТаблицаСчетчиков.Очистить();
	
	мТаблицаРаспределений = ДанныеФормыВЗначение(ТаблицаРаспределений, Тип("ТаблицаЗначений"));
	мТаблицаРаспределений.Очистить();
	
	мТаблицаПроживающих = ДанныеФормыВЗначение(ТаблицаПроживающих, Тип("ТаблицаЗначений"));
	мТаблицаПроживающих.Очистить();
	
	мУслуги = ДанныеФормыВЗначение(Услуги, Тип("ТаблицаЗначений"));
	мУслуги.Очистить();
	
	мЛьготы = ДанныеФормыВЗначение(Льготы, Тип("ТаблицаЗначений"));
	мЛьготы.Очистить();
	
	// Заполенение параметров квартиры.
	Этаж             	= Объект.Квартира.Этаж;
	КоличествоКомнат 	= Объект.Квартира.КоличествоКомнат;
	Корпус   			= Объект.Здание.Корпус;
	
	СписокЛС = Новый Массив;
	СписокЛС.Добавить(Объект.Ссылка);
	
	СписокЗданий = Новый Массив;
	СписокЗданий.Добавить(Объект.Здание);
	
	ТаблицаНач = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаСч  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТаблицаЛт  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
	ТаблицаРп  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	ТаблицаПр  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ТекущаяДата(), 
	Объект.Организация, 
	СписокЛС, 
	СписокЗданий, 
	мКэшЗначений.мЛьготаПерсонифицированная, 
	Истина, 
	ТаблицаНач, 
	ТаблицаСч, 
	ТаблицаРп,
	ТаблицаЛт,
	,
	,
	мКэшЗначений.мРасчетСУчетомДолейВладения,
	мКэшЗначений.мУменьшениеНормыЛьготыВПределахФакта,
	мКэшЗначений.мНачислениеСУчетомДнейПроживания,
	ТаблицаПр,
	,
	// БИТ_ЖКХ_04102013_начало_изменений
	// мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика);.
	мКэшЗначений.мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
	мКэшЗначений.мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика, ,мКэшЗначений.мОптимизацияЛС);
	// БИТ_ЖКХ_04102013_окончание_изменений
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	// БИТ_ЖКХ_17012014_начало_изменений
	|	бит_СведенияОКвартиреСрезПоследних.ЖилоеПомещениеСпециализированногоЖилищногоФонда,
	// БИТ_ЖКХ_17012014_окончание_изменений
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("Момент"   ,КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Квартира" ,Объект.Квартира);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ТипКвартиры              = Выборка.ТипКвартиры;
		СтатусКвартиры           = Выборка.СтатусКвартиры;
		ОбщаяПлощадь             = Выборка.ОбщаяПлощадь;
		ЖилаяПлощадь             = Выборка.ЖилаяПлощадь;
		МОП                      = Выборка.МОП;  
		ОтапливаемаяПлощадь      = Выборка.ОтапливаемаяПлощадь;
		СовокупнаяПлощадь        = Выборка.СовокупнаяПлощадь;
		ТипПлиты                 = Выборка.ТипПлиты;
		ТипЗапирающегоУстройства = Выборка.ТипЗапирающегоУстройства;
		// БИТ_ЖКХ_17012014_начало_изменений
		ЖилоеПомещениеСпециализированногоЖилищногоФонда = Выборка.ЖилоеПомещениеСпециализированногоЖилищногоФонда;
		// БИТ_ЖКХ_17012014_окончание_изменений
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"		, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет"	, Объект.Ссылка);
	
	мКоличествоПроживающих	= 0;
	мКоличествоПоНорме			= 0;
	Постоянно					= 0;
	Времменно					= 0;
	
	мКоличествоПроживающихЛьгота = 0;
	мКоличествоПоНормеЛьгота       = 0;
	
	// БИТ_ЖКХ 24.05.2017 12:04:53 Начало правки...
	НовыйДокумент				= Неопределено; 
	// БИТ_ЖКХ 24.05.2017 12:04:53 Конец правки.
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
			ОтветсвенноеЛицо = Выборка.ФизЛицо;
		КонецЕсли; 
		
		НоваяСтрока = мТаблицаПроживающих.Добавить();
		НоваяСтрока.ФизЛица          = Выборка.ФизЛицо;
		НоваяСтрока.ВладелецКвартиры = Выборка.ВладелецКвартиры;
		НоваяСтрока.СтатусФизЛица    = Выборка.СтатусФизЛица; 
		
		Если ЗначениеЗаполнено(Выборка.ДатаЗаписи) 
			И НачалоДня(Выборка.ДатаЗаписи) <= НачалоДня(ТекущаяДата()) тогда
			
			Попытка
				
				Если НовыйДокумент = Неопределено Тогда
					НовыйДокумент				= Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент();
					НовыйДокумент.Дата			= ТекущаяДата();
					НовыйДокумент.ЛицевойСчет	= Объект.Ссылка;
					НовыйДокумент.Комментарий	= "Создан автоматически из лицевого счета.";
					НовыйДокумент.Ответственный	= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")//глЗначениеПеременной("глТекущийПользователь"), 
				КонецЕсли;
				
				НоваяСтрокаДОкумента = НовыйДокумент.СписокПроживающих.Добавить();
				НоваяСтрокаДОкумента.ФизЛицо                = Выборка.ФизЛицо;
				НоваяСтрокаДОкумента.ДатаРегистрации        = Выборка.ДатаРегистрации;
				НоваяСтрокаДОкумента.ДатаСнятияСРегистрации = Выборка.ДатаСнятияСРегистрации;
				НоваяСтрокаДОкумента.СтатусПроживания       = Выборка.СтатусПроживания;
				НоваяСтрокаДОкумента.СтепеньРодства         = Выборка.СтепеньРодства;
				НоваяСтрокаДОкумента.ДоляПлощади            = Выборка.ДоляПлощади;
				НоваяСтрокаДОкумента.СтатусФизЛица          = Выборка.СтатусФизЛицаДляИзменения;
				
				Если НоваяСтрокаДОкумента.СтатусФизЛица.Пустая() Тогда
					НоваяСтрокаДОкумента.СтатусФизЛица = Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация;
				КонецЕсли; 
				
				НоваяСтрока.СтатусФизЛица = НоваяСтрокаДОкумента.СтатусФизЛица;
				
			Исключение
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нет прав для работы с документом ""Регистрация проживающих по ЛС""");
			КонецПопытки; 
			
		КонецЕсли;
		
		НоваяСтрока.СтепеньРодства   = Выборка.СтепеньРодства;
		НоваяСтрока.СтатусПроживания = Выборка.СтатусПроживания;
		
		Если НоваяСтрока.СтатусФизЛица.ПроживаниеВДанныйМомент тогда
			
			мКоличествоПроживающих = мКоличествоПроживающих + 1; 
			Если Выборка.СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно тогда
				Постоянно = Постоянно + 1;
			иначе
				Времменно = Времменно + 1;
			КонецЕсли;
			
		КонецЕсли; 
		
		НоваяСтрока.ДоляПлощади = Выборка.ДоляПлощади;
		
	КонецЦикла; // Пока Выборка.Следующий() Цикл.
	
	Попытка
		
		Если НовыйДокумент.СписокПроживающих.Количество() > 0 тогда
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Изменены статусы физ. лиц.");
				
			Исключение

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ ""Регистрация проживающих по ЛС"": " +ОписаниеОшибки());

			КонецПопытки;
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;
	
	ЗначениеВДанныеФормы(мТаблицаПроживающих,ТаблицаПроживающих);
	
	ВсегоПроживающих = мКоличествоПроживающих;
	
	ТаблицаПроживающихСкоп = мТаблицаПроживающих.Скопировать(Новый Структура("СтепеньРодства",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо));
	
	Если ТаблицаПроживающихСкоп.Количество() > 1 Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете должен быть один ответственный.");
		
	ИначеЕсли ТаблицаПроживающихСкоп.Количество() = 1 тогда	          
		ВладелецЛицевогоСчета = ТаблицаПроживающихСкоп[0].ФизЛица;
		
		Телефон               = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(ВладелецЛицевогоСчета);
	ИначеЕсли ТаблицаПроживающихСкоп.Количество() = 0 тогда	

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете должен быть ответственный. ");
		
	КонецЕсли;
	
	Адрес = "" + мКэшЗначений.мПрефиксУлица + " " + Объект.УлицаЛицевогоСчета + ", " + мКэшЗначений.мПрефиксДом + " " + Объект.Здание +?(ЗначениеЗаполнено(Объект.Здание.Корпус),", "+ мКэшЗначений.мПрефиксКорпус + " "+ Объект.Здание.Корпус, "") +", " + Объект.Квартира;
	
	// БИТ_ЖКХ 25.02.2015{{
	// АдресПроживания       = ?(ЗначениеЗаполнено(Объект.Ссылка.Здание.ПочтовыйАдрес),Строка(Объект.Ссылка.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(Объект.Квартира), ", кв." + Строка(Объект.Квартира),""),Адрес);.
	Если Объект.Ссылка.Здание.КонтактнаяИнформация.Количество() > 0 Тогда 
		
		АдресПроживания       = ?(ЗначениеЗаполнено(Объект.Ссылка.Здание.ПочтовыйАдрес),Строка(Объект.Ссылка.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(Объект.Квартира), ", кв." + Строка(Объект.Квартира),""),Адрес);
		
	Иначе
		
		АдресПроживания       = Адрес;
		
	КонецЕсли;
	// БИТ_ЖКХ 25.02.2015}}
	
	// Заполнения таблицы "Льготы". 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Льготы.ФизЛицо КАК ФизЛицо,
	|	Льготы.Льгота,
	|	Льготы.СрокДействияЛьготы,
	|	ФизЛица.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	ФизЛица.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	Льготы.СрокЛьготыИстек
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|		ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|		ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|		ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|		ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|		ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации
	|	ИЗ
	|		РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|	ГДЕ
	|		(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))) КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ЛьготыПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|			бит_ЛьготыПоЛССрезПоследних.Льготы КАК Льгота,
	|			бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы КАК СрокДействияЛьготы,
	|			ВЫБОР
	|				КОГДА бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &Момент
	|						ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ КАК СрокЛьготыИстек
	|		ИЗ
	|			РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_ЛьготыПоЛССрезПоследних) КАК Льготы
	|		ПО ФизЛица.ФизЛицо = Льготы.ФизЛицо
	|ГДЕ
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы = ИСТИНА
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ФизЛицо)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("Момент"		, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет"	, Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Выборка.Следующий() Тогда
		
		КолЛьготников = Выборка.Физлицо;
		
		ВыборкаЛьготы = Выборка.Выбрать();
		
		ОписаниеСложнойЛьготы = "";
		ОписаниеЛьгот         = "";
		
		Пока ВыборкаЛьготы.Следующий() Цикл
			
			Если ВыборкаЛьготы.Количество() > 1 Тогда
				ОписаниеЛьгот = "СложнаяЛьготы";
			Иначе
				ОписаниеЛьгот = "" + ВыборкаЛьготы.Льгота;
			КонецЕсли;
			
			ОписаниеСложнойЛьготы = ОписаниеСложнойЛьготы + "" + ?(ОписаниеСложнойЛьготы = "","",", ") + СокрЛП(ВыборкаЛьготы.Льгота);
			
			НоваяСтрока = мЛьготы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЛьготы);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// БИТ_ЖКХ 04.02.2015{{
	// ЗначениеВДанныеФормы(мЛьготы,Льготы);.
	Льготы.Загрузить(мЛьготы);
	// БИТ_ЖКХ 04.02.2015}}
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = мУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Услуги.Загрузить(мУслуги);
	КонецЦикла; 
	
	Для каждого Строка Из ТаблицаНач Цикл
		
		НоваяСтрока = мТаблицаНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ТаблицаНачислений.Загрузить(ТаблицаНач);
	КонецЦикла;
	
	// БИТ_ЖКХ 19.03.2014
	Для каждого Строка из ТаблицаНач Цикл 
		
		Строка.Начислено      = Окр(Строка.Начислено,2);
		Строка.СальдоНаНачало = Окр(Строка.СальдоНаНачало,2);
		Строка.Льгота         = Окр(Строка.Льгота,2);
		Строка.Оплата         = Окр(Строка.Оплата,2);
		Строка.Разовые        = Окр(Строка.Разовые,2);
		Строка.КОплате        = Окр(Строка.КОплате,2);
		
	КонецЦикла;
	// БИТ_ЖКХ 19.03.2014
	
	ИтогиНаСервере(ТаблицаНач);	
	
	
	Для каждого Строка Из ТаблицаСч Цикл
		
		НоваяСтрока = мТаблицаСчетчиков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ТаблицаСчетчиков.Загрузить(ТаблицаСч);
	КонецЦикла;
	
	ТаблицаСчетчиков.Сортировать("Счетчик Возр, Приоритет Возр");
	
	Для каждого Строка Из ТаблицаРп Цикл
		
		НоваяСтрока = мТаблицаРаспределений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ТаблицаРаспределений.Загрузить(ТаблицаРп);
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабНач.Услуга
	|ПОМЕСТИТЬ ТабНач
	|ИЗ
	|	&ТабНач КАК ТабНач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток, 0) КАК Пени,
	|	ТабНач.Услуга
	|ИЗ
	|	ТабНач КАК ТабНач
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	|		ПО ТабНач.Услуга = бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ";
	
	Запрос.УстановитьПараметр("Дата"        , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("ТабНач"      ,мТаблицаНачислений);
	
	
	ТаблицаП = Запрос.Выполнить().Выгрузить();
	
	АдресТаблицыПениВХранилище = ПоместитьТаблицуПениВХранилище(ТаблицаП);
	
	// БИТ_ЖКХ 04.02.2015{{
	// ЗначениеВДанныеФормы(ТаблицаП,ТаблицаПени);.
	ТаблицаПени.Загрузить(ТаблицаП);
	// БИТ_ЖКХ 04.02.2015}}
	
	ТаблицаНачислений.Сортировать("Приоритет Возр");
	
	ЗаполнитьБиллинговыеУслуги();
	
	ДолгПоЛС = ВывестиСуммуДолгаПоЛС();
	Долг     = ДолгПоЛС.СтрокаДолга;
	Элементы.Долг.ЦветТекста = ДолгПоЛС.ЦветНадписи;
	
	Попытка
		СформироватьДанныеПечати();
	Исключение
	КонецПопытки;
	
	Если Объект.ОтображатьПоГруппам Тогда
		
		ЗаполнитьТаблицуПоГруппам();
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры 

// Процедура выполняет заполнение дерева значений и груперует услуги по группам.
//
&НаСервере
Процедура ЗаполнитьТаблицуПоГруппам()
	
	ДеревоН = ДанныеФормыВЗначение(ДеревоНачислений, Тип("ДеревоЗначений"));
	
	ДеревоН.Строки.Очистить();
	
	ДеревоУ = ДанныеФормыВЗначение(ДеревоУслуг, Тип("ДеревоЗначений"));
	
	ДеревоУ.Строки.Очистить();
	// Заполняем Дерево начислений.
	Для каждого Строка Из ТаблицаНачислений Цикл
		
		НоваяСтрока = ДеревоН.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	Для каждого Строка Из Услуги Цикл
		
		НоваяСтрока = ДеревоУ.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Приоритет             = Строка.Услуга.Приоритет;
		НоваяСтрока.ГруппаУслугиПриоритет = Строка.Услуга.ГруппаУслуги.Приоритет;
		
	КонецЦикла; 
	
	ТаблицаН = ДанныеФормыВЗначение(ТаблицаНачислений, Тип("ТаблицаЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Услуга
	|ПОМЕСТИТЬ ТабНач
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабНач.Услуга,
	|	ТабНач.Услуга.ГруппаУслуги КАК ГруппаУслуги
	|ИЗ
	|	ТабНач КАК ТабНач
	|ИТОГИ ПО
	|	ГруппаУслуги;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабНач";
	Запрос.УстановитьПараметр("Таблица",ТаблицаН);
	
	ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ДеревоН.Колонки.Найти("ПриоритетГруп")= Неопределено Тогда
		ДеревоН.Колонки.Добавить("ПриоритетГруп", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	КонецЕсли;
	
	Пока ВыборкаГруп.Следующий() Цикл
		
		Выборка = ВыборкаГруп.Выбрать();
		
		Если ВыборкаГруп.ГруппаУслуги = Справочники.бит_ГруппыУслуг.ПустаяСсылка() Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если Выборка.Количество() > 1 Тогда
			НоваяСтрока = ДеревоН.Строки.Добавить();
			НоваяСтрока.Услуга = ВыборкаГруп.ГруппаУслуги;
			
			// БИТ_ЖКХ добавление кода Начало: 23.08.2011 
			НоваяСтрока.ПриоритетГруп  	= ВыборкаГруп.ГруппаУслуги.Приоритет;
			// БИТ_ЖКХ добавление кода конец : 23.08.2011
			
			Пока Выборка.Следующий() Цикл
				
				Строка = ТаблицаН.Найти(Выборка.Услуга, "Услуга") ;	
				// Убираем строки с общией группой под группу.
				Если Строка <> Неопределено Тогда
					
					СтрокаДерева = ДеревоН.Строки.Найти(Выборка.Услуга, "Услуга");
					Если СтрокаДерева <> Неопределено Тогда
						
						ДеревоН.Строки.Удалить(СтрокаДерева);	
						
					КонецЕсли; 
					
					ПеренесеннаяСтрока = НоваяСтрока.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(ПеренесеннаяСтрока, Строка);
					
					НоваяСтрока.СальдоНаНачало = НоваяСтрока.СальдоНаНачало    + Строка.СальдоНаНачало;
					НоваяСтрока.Начислено      = НоваяСтрока.Начислено + Строка.Начислено;
					НоваяСтрока.Льгота         = НоваяСтрока.Льгота    + Строка.Льгота;
					НоваяСтрока.Субсидия       = НоваяСтрока.Субсидия  + Строка.Субсидия;
					НоваяСтрока.Оплата         = НоваяСтрока.Оплата    + Строка.Оплата;
					НоваяСтрока.Разовые        = НоваяСтрока.Разовые   + Строка.Разовые;      
					НоваяСтрока.КОплате        = НоваяСтрока.КОплате   + Строка.КОплате;
					НоваяСтрока.Долг           = НоваяСтрока.Долг      + Строка.Долг;
					НоваяСтрока.Переплата      = НоваяСтрока.Переплата + Строка.Переплата;
					
					НоваяСтрока.КОплатеЗаМесяц    = НоваяСтрока.КОплатеЗаМесяц + Строка.КОплатеЗаМесяц;
					НоваяСтрока.ПереплатаНаначало = НоваяСтрока.ПереплатаНаначало + Строка.ПереплатаНаначало;
				КонецЕсли;  
			КонецЦикла;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДеревоН.Строки.Сортировать("Приоритет Возр, ПриоритетГруп Возр", ИСТИНА);
	ЗначениеВДанныеФормы(ДеревоН,ДеревоНачислений);
	
	ТаблицаУ = ДанныеФормыВЗначение(Услуги, Тип("ТаблицаЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Услуга
	|ПОМЕСТИТЬ ТабНач
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабНач.Услуга,
	|	ТабНач.Услуга.ГруппаУслуги КАК ГруппаУслуги
	|ИЗ
	|	ТабНач КАК ТабНач
	|ИТОГИ ПО
	|	ГруппаУслуги;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабНач";
	Запрос.УстановитьПараметр("Таблица",ТаблицаУ);
	
	ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруп.Следующий() Цикл
		
		Выборка = ВыборкаГруп.Выбрать();
		
		Если ВыборкаГруп.ГруппаУслуги = Справочники.бит_ГруппыУслуг.ПустаяСсылка() Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если Выборка.Количество() > 1 Тогда
			НоваяСтрока = ДеревоУ.Строки.Добавить();
			НоваяСтрока.Услуга = ВыборкаГруп.ГруппаУслуги;
			
			НоваяСтрока.ГруппаУслугиПриоритет = ВыборкаГруп.ГруппаУслуги.Приоритет;
			
			Пока Выборка.Следующий() Цикл
				
				Строка = ТаблицаУ.Найти(Выборка.Услуга, "Услуга") ;
				// Убираем строки с общией группой под группу.
				Если Строка <> Неопределено Тогда
					
					СтрокаДерева = ДеревоУ.Строки.Найти(Выборка.Услуга, "Услуга");
					Если СтрокаДерева <> Неопределено Тогда
						
						ДеревоУ.Строки.Удалить(СтрокаДерева);	
						
					КонецЕсли; 
					
					ПеренесеннаяСтрока = НоваяСтрока.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(ПеренесеннаяСтрока, Строка);
					
				КонецЕсли;  
			КонецЦикла;
		КонецЕсли; 
		
	КонецЦикла; 
	ДеревоУ.Строки.Сортировать("Приоритет Возр, ГруппаУслугиПриоритет Возр", ИСТИНА);
	ЗначениеВДанныеФормы(ДеревоУ,ДеревоУслуг);
	
	Элементы.ДеревоНачислений.ПодчиненныеЭлементы.ДеревоНачисленийЛьгота.ТекстПодвала         = Формат(ДеревоН.Строки.Итог("Льгота")        , "ЧДЦ=2");
	
	Элементы.ДеревоНачислений.ПодчиненныеЭлементы.ДеревоНачисленийОплата.ТекстПодвала         = Формат(ДеревоН.Строки.Итог("Оплата")        , "ЧДЦ=2");
	
	Элементы.ДеревоНачислений.ПодчиненныеЭлементы.ДеревоНачисленийСальдоНаНачало.ТекстПодвала = Формат(ДеревоН.Строки.Итог("СальдоНаНачало"), "ЧДЦ=2");
	
	Элементы.ДеревоНачислений.ПодчиненныеЭлементы.ДеревоНачисленийНачислено.ТекстПодвала      = Формат(ДеревоН.Строки.Итог("Начислено")     , "ЧДЦ=2");
	
	Элементы.ДеревоНачислений.ПодчиненныеЭлементы.ДеревоНачисленийРазовые.ТекстПодвала        = Формат(ДеревоН.Строки.Итог("Разовые")       , "ЧДЦ=2");
	
	Элементы.ДеревоНачислений.ПодчиненныеЭлементы.ДеревоНачисленийКОплате.ТекстПодвала        = Формат(ДеревоН.Строки.Итог("КОплате")       , "ЧДЦ=2");
	
КонецПроцедуры

// Процедура выполняет заполнение таблицы на печать.
//
&НаСервере
Процедура ЗаполнитьТаблицуПечати()
	
	ТаблицаН = ДанныеФормыВЗначение(ТаблицаНачислений, Тип("ТаблицаЗначений"));
	ДеревоНач = ТаблицаН.СкопироватьКолонки();
	
	Если ДеревоНач.Колонки.Найти("ПриоритетГруп")= Неопределено Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(10,0);
		ОписаниеЧисло = Новый ОписаниеТипов(МассивТипов,КЧ);
		КолонкиСостава = ДеревоНач.Колонки;
		КолонкиСостава.Добавить("ПриоритетГруп", ОписаниеЧисло, "ПриоритетГруп", 100);
	КонецЕсли;
	
	ДеревоН = ДанныеФормыВЗначение(ДеревоНачислений, Тип("ДеревоЗначений"));
	
	Для каждого Строка Из ДеревоН.Строки Цикл
		
		НовСтрока = ДеревоНач.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		
		Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") 
			Тогда НовСтрока.ПриоритетГруп = Строка.Услуга.Приоритет;
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Объект.ОтображатьПоГруппам Тогда
		
		ДеревоНач.Сортировать("ПриоритетГруп Возр");
		ДеревоНач.Сортировать("Приоритет Возр");
		
	КонецЕсли; 
	
	ТаблицаДляПечати = ?(Объект.ОтображатьПоГруппам,ДеревоНач.Скопировать(), ТаблицаН.Скопировать());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// Удалены закоментированые участки кода.
	"ВЫБРАТЬ
	|	ТаблицаНачислений.Услуга,
	|	ВЫБОР
	|		КОГДА ТаблицаНачислений.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам)
	|				ИЛИ ТаблицаНачислений.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|		ИНАЧЕ ТаблицаНачислений.СпособРасчета
	|	КОНЕЦ КАК СпособРасчета,
	|	ТаблицаНачислений.Норма,
	|	ТаблицаНачислений.СверхНорма
	|ПОМЕСТИТЬ ТаблицаНачислений
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетчикам.Услуга,
	|	ТаблицаСчетчикам.КоличествоЕдиницПоЛС,
	|	ТаблицаСчетчикам.ОтПоказаний,
	|	ТаблицаСчетчикам.ДоПоказаний
	|ПОМЕСТИТЬ ТаблицаСчетчикам
	|ИЗ
	|	&ТаблицаСчетчикам КАК ТаблицаСчетчикам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДляПечати.Услуга,
	|	ТаблицаДляПечати.Приоритет,
	|	ТаблицаДляПечати.Ставка,
	|	ТаблицаДляПечати.СверхномСтавка,
	|	ТаблицаДляПечати.Норма,
	|	ТаблицаДляПечати.СверхНорма,
	|	ТаблицаДляПечати.СальдоНаНачало,
	|	ТаблицаДляПечати.Начислено,
	|	ТаблицаДляПечати.Льгота,
	|	ТаблицаДляПечати.Субсидия,
	|	ТаблицаДляПечати.Оплата,
	|	ТаблицаДляПечати.Разовые,
	|	ТаблицаДляПечати.КОплате,
	|	ТаблицаДляПечати.СпособРасчета,
	|	ТаблицаДляПечати.Норматив,
	|	ТаблицаДляПечати.Факт,
	|	ТаблицаДляПечати.Долг,
	|	ТаблицаДляПечати.ПереплатаНаНачало,
	|	ТаблицаДляПечати.Объем,
	|	ТаблицаДляПечати.Тариф,
	|	ТаблицаДляПечати.КОплатеЗаМесяц,
	|	ТаблицаДляПечати.НормативПоКу
	|ПОМЕСТИТЬ ТаблицаДляПечати
	|ИЗ
	|	&ТаблицаДляПечати КАК ТаблицаДляПечати
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПени.Услуга,
	|	ТаблицаПени.Пени КАК Пени
	|ПОМЕСТИТЬ ТаблицаПени
	|ИЗ
	|	&ТаблицаПени КАК ТаблицаПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДляПечати.Услуга,
	|	ТаблицаДляПечати.Приоритет,
	|	ТаблицаДляПечати.Ставка,
	|	ТаблицаДляПечати.СверхномСтавка,
	|	ТаблицаДляПечати.Норма,
	|	ТаблицаДляПечати.СверхНорма,
	|	ТаблицаДляПечати.СальдоНаНачало,
	|	ТаблицаДляПечати.Начислено,
	|	ТаблицаДляПечати.Льгота,
	|	ТаблицаДляПечати.Субсидия,
	|	ТаблицаДляПечати.Оплата,
	|	ТаблицаДляПечати.Разовые,
	|	ТаблицаДляПечати.КОплате,
	|	ТаблицаДляПечати.СпособРасчета,
	|	ТаблицаДляПечати.Норматив,
	|	ТаблицаДляПечати.Факт,
	|	ТаблицаДляПечати.Объем,
	|	ТаблицаДляПечати.Тариф,
	|	ВложенныйЗапрос.ЕдИзм,
	|	ВложенныйЗапрос.Количество,
	|	ТаблицаДляПечати.Долг,
	|	ТаблицаДляПечати.ПереплатаНаНачало,
	|	ТаблицаДляПечати.КОплатеЗаМесяц КАК КОплатеЗаМесяц,
	|	ВложенныйЗапрос.Пени,
	|	ТаблицаДляПечати.НормативПоКу
	|ИЗ
	|	ТаблицаДляПечати КАК ТаблицаДляПечати
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаНачислений.Услуга КАК Услуга,
	|			бит_УслугиЖКХСпособыРасчета.ЕдИзм КАК ЕдИзм,
	|			ВЫБОР
	|				КОГДА ТаблицаНачислений.СпособРасчета В (&СпособыРасчета)
	|					ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаСЧ.КоличествоЕдиниц КАК ЧИСЛО(15, 3)), 0)
	|				ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаНачислений.Норма + ТаблицаНачислений.СверхНорма КАК ЧИСЛО(15, 3)), 0)
	|			КОНЕЦ КАК Количество,
	|			ТаблицаПени.Пени КАК Пени
	|		ИЗ
	|			ТаблицаНачислений КАК ТаблицаНачислений
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|				ПО ТаблицаНачислений.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|					И ТаблицаНачислений.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПени КАК ТаблицаПени
	|				ПО ТаблицаНачислений.Услуга = ТаблицаПени.Услуга
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ТаблицаСчетчикам.Услуга КАК Услуга,
	|					СУММА(ТаблицаСчетчикам.КоличествоЕдиницПоЛС) КАК КоличествоЕдиниц,
	|					СУММА(ТаблицаСчетчикам.ОтПоказаний) КАК ОтПоказаний,
	|					СУММА(ТаблицаСчетчикам.ДоПоказаний) КАК ДоПоказаний
	|				ИЗ
	|					ТаблицаСчетчикам КАК ТаблицаСчетчикам
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ТаблицаСчетчикам.Услуга) КАК ТаблицаСЧ
	|				ПО ТаблицаНачислений.Услуга = ТаблицаСЧ.Услуга) КАК ВложенныйЗапрос
	|		ПО ТаблицаДляПечати.Услуга = ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСчетчикам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДляПечати
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПени";
	
	МассивСпособов = Новый Массив;
	МассивСпособов.Добавить(Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам);
	МассивСпособов.Добавить(Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных);
	МассивСпособов.Добавить(Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам);
	МассивСпособов.Добавить(Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам);
	
	Запрос.УстановитьПараметр("ТаблицаДляПечати" , ТаблицаДляПечати);
	Запрос.УстановитьПараметр("ТаблицаНачислений", ?(Объект.ОтображатьПоГруппам, ДеревоНач, ТаблицаН));
	
	ТаблицаС = ДанныеФормыВЗначение(ТаблицаСчетчиков, Тип("ТаблицаЗначений"));
	
	Запрос.УстановитьПараметр("ТаблицаСчетчикам" , ТаблицаС);
	
	ТаблицаПениИзХранилища  = ПолучитьИзВременногоХранилища(АдресТаблицыПениВХранилище);
	
	Запрос.УстановитьПараметр("ТаблицаПени"      , ТаблицаПениИзХранилища);
	
	Запрос.УстановитьПараметр("СпособыРасчета"   , МассивСпособов);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	мТаблицаПечати = Выгрузка.СкопироватьКолонки();
	
	мТаблицаПечати.Колонки.Добавить("ПриоритетГруп");
	
	Для каждого ТекСтрока Из Выгрузка Цикл
		
		НоваяСтрока = мТаблицаПечати.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		НоваяСтрока.Ставка         = Окр(ТекСтрока.Ставка, 2);
		НоваяСтрока.СверхномСтавка = Окр(ТекСтрока.СверхномСтавка, 2);
		
		Если ТипЗнч(ТекСтрока.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") 
			Тогда НоваяСтрока.ПриоритетГруп = ТекСтрока.Услуга.Приоритет;
		КонецЕсли; 
		
	КонецЦикла;
	
	Если НЕ Объект.ОтображатьПоГруппам Тогда
		
		АдресТаблицыПечатиВХранилище = ПоместитьТаблицуПечатиВХранилище(мТаблицаПечати);
		
		ДополнитьТаблицуПоставщиками();
		
		
	КонецЕсли; 
	
	Если Объект.ОтображатьПоГруппам Тогда
		
		мТаблицаПечати.Сортировать("ПриоритетГруп Возр");
		мТаблицаПечати.Сортировать("Приоритет Возр");
		
	Иначе
		мТаблицаПечати.Сортировать("Приоритет Возр");
		
	КонецЕсли; 
	
	АдресТаблицыПечатиВХранилище = ПоместитьТаблицуПечатиВХранилище(мТаблицаПечати);
	ТаблицаПечатиИзХранилища  = ПолучитьИзВременногоХранилища(АдресТаблицыПечатиВХранилище);
	
КонецПроцедуры

// Функция формирования структуры из площадей квартиры>.
//
// Параметры:
//  <НомерКвартиры>  - ссылка на квартиру в регистре сведений.
//
// Возвращаемое значение:
//  <ИскомыйРезультат.Структура> - набор данных по площадям.
//
&НаСервере
Функция ВывестиПлощадиКвартиры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ТекущаяДата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("Квартира", Объект.Квартира);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура();
	Отбор.Вставить("Квартира",Объект.Квартира);
	Строки = Результат.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		ИскомыйРезультат = Новый Массив;
		ИскомыйРезультат.Вставить(0,Строки[0].ОбщаяПлощадь);
		ИскомыйРезультат.Вставить(1,Строки[0].ЖилаяПлощадь);
		ИскомыйРезультат.Вставить(2,Строки[0].МОП);
		ИскомыйРезультат.Вставить(3,Строки[0].ОтапливаемаяПлощадь);
		ИскомыйРезультат.Вставить(4,Строки[0].СовокупнаяПлощадь);
	Иначе
		ИскомыйРезультат = Неопределено;
	КонецЕсли;
	
	Возврат  ИскомыйРезультат;
	
КонецФункции // ()

// Функция формирования списка комнат квартиры на дату.
//
&НаСервере
Функция ПолучитьСписокКомнат(НомерКвартиры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СведенияОКомнатеСрезПоследних.Комната,
	|	бит_СведенияОКомнатеСрезПоследних.Площадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОКомнате.СрезПоследних(&Момент, Комната.Владелец = &Владелец) КАК бит_СведенияОКомнатеСрезПоследних"; 
	
	Запрос.УстановитьПараметр("Владелец", НомерКвартиры);
	Запрос.УстановитьПараметр("Момент", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

// Процедура расчета различных типов площадей для сравнения и контроля аналогичных в справочнике Квартиры.
&НаСервере
Процедура ПосчитатьПлощади()
	
	ТабличноеПолеПлощадей.Очистить();
	Массив = Новый Массив;
	Массив.Вставить(0,"Общая площадь");
	Массив.Вставить(1,"Жилая площадь");
	Массив.Вставить(2,"МОП площадь");
	Массив.Вставить(3,"Отапливаемая площадь");
	Массив.Вставить(4,"Совокупная площадь");
	
	Площадь = Новый Массив(5);
	
	Для Счетчик = 0 По 4  Цикл
		Площадь[Счетчик] = 0;
	КонецЦикла; 
	СписокКомнат = ПолучитьСписокКомнат(Объект.Квартира);
	
	Для каждого СтрокаТЧ Из СписокКомнат Цикл
		Строка = СтрокаТЧ.Комната.ЧастьПомещения;
		Если Строка.КоэффициентНачислений <> 0 Тогда 
			// Отапливаемая.
			Площадь[3] = Площадь[3] + СтрокаТЧ.Площадь;
			Если Строка.Принадлежность = Перечисления.бит_ПринадлежностьКомнат.Внутренняя Тогда
				// Общая.
				Площадь[0] = Площадь[0] + СтрокаТЧ.Площадь;
				
				Если Строка.ТипКомнаты = Справочники.бит_ТипыКомнат.Жилая 
					Тогда
					// Жилая.
					Площадь[1] = Площадь[1] + СтрокаТЧ.Площадь;
				КонецЕсли;	
				
			КонецЕсли;	
		КонецЕсли;	
		
		Если Строка.ТипКомнаты = Справочники.бит_ТипыКомнат.МОП Тогда
			// МОП.
			Площадь[2] = Площадь[2] + СтрокаТЧ.Площадь;
		КонецЕсли;	
		// Совокупная.
		Площадь[4] = Площадь[4] + СтрокаТЧ.Площадь;
	КонецЦикла;                                                                    
	
	ПлощадиКвартиры = ВывестиПлощадиКвартиры();
	
	Если ЗначениеЗаполнено(ПлощадиКвартиры) Тогда
		Для Счетчик = 0 По 4 Цикл
			НоваяСтрока = ТабличноеПолеПлощадей.Добавить();// Вставить(Счетчик);.
			НоваяСтрока.ВидыПлощадей = Массив[Счетчик]; 
			НоваяСтрока.ПлощадиКвартиры = ПлощадиКвартиры[Счетчик];
			НоваяСтрока.ПлощадиКомнат = Площадь[Счетчик]; 
		КонецЦикла; 
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нет исходных данных по площадям квартиры! Проверьте регистр сведений ""Сведения о квартире""");
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения  = Новый Структура; 
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	КэшированныеЗначения.Вставить("ЭтоНовый"   , ?(Параметры.Ключ.Пустая(), Истина, Ложь));

	КэшированныеЗначения.Вставить("СписокКодовЧисел", СправочникОбъект.СписокКодовЧисел);
	
	КэшированныеЗначения.Вставить("мЛьготаПерсонифицированная", Неопределено);
	
	КэшированныеЗначения.Вставить("мВыводитьЛьготыНаСчетИзвещение", Неопределено);
	
	КэшированныеЗначения.Вставить("мРасчетСУчетомДолейВладения", Неопределено);
	
	КэшированныеЗначения.Вставить("мУменьшениеНормыЛьготыВПределахФакта", Неопределено);
	
	КэшированныеЗначения.Вставить("мНачислениеСУчетомДнейПроживания", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьУлица", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьДом", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьКорпус", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьКвартира", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьРайон", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксУлица", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксДом", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксКорпус", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксКвартира", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксРайон", Неопределено);
	
	КэшированныеЗначения.Вставить("мНомерПолучателяПоБанку", Неопределено);
	
	КэшированныеЗначения.Вставить("мИспользоватьНомерПолучателяВШК", Неопределено);
	
	КэшированныеЗначения.Вставить("мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика", Неопределено);
	
	КэшированныеЗначения.Вставить("мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Неопределено);
	
	КэшированныеЗначения.Вставить("мСтруктураДанных", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПечати", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПечатиСчетчиков", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПерерасчетов", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПени", Неопределено);
	
	КэшированныеЗначения.Вставить("мКолонка", Неопределено);
	
	КэшированныеЗначения.Вставить("мОбщаяПлощадь", Неопределено);
	
	КэшированныеЗначения.Вставить("мЖилаяПлощадь", Неопределено);
	
	КэшированныеЗначения.Вставить("мМОП", Неопределено);
	
	КэшированныеЗначения.Вставить("мОтапливаемаяПлощадь", Неопределено);
	
	КэшированныеЗначения.Вставить("мСовокупнаяПлощадь", Неопределено);
	
	// БИТ_ЖКХ 29.09.2014
	КэшированныеЗначения.Вставить("мТаблицаСвойств", Неопределено);
	// БИТ_ЖКХ 29.09.2014
	
	// БИТ_ЖКХ 24.05.2017 11:41:12 Начало правки...
	КэшированныеЗначения.Вставить("мОптимизацияЛС", Неопределено);
	// БИТ_ЖКХ 24.05.2017 11:41:12 Конец правки.
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// БИТ_ЖКХ 06.09.2016 12:48:43 Начало правки... 
	//// БИТ_ЖКХ 15.09.2014
	//бит_сл_клиент.ИнициализацияКлиентаЛицензирования();
	// БИТ_ЖКХ 06.09.2016 12:48:44 Конец правки. 
	
	Отказ = НЕ бит_ЗакрытыйСлужебныйСервер.ПродуктАктивирован();
	
	Если Отказ Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Система лицензирования не активирована.");
		
		Возврат;
	КонецЕсли; 
	
	Если мКэшЗначений.ЭтоНовый Тогда
		ЗаполнитьНовыйЭлемент();
	Иначе
		Элементы.УлицаЛицевогоСчета.ТолькоПросмотр = Истина;
		Элементы.Здание.ТолькоПросмотр             = Истина;
		Элементы.Корпус.ТолькоПросмотр             = Истина;
		Элементы.Квартира.ТолькоПросмотр           = Истина;
	КонецЕсли;
	
	// БИТ_ЖКХ 05.11.2015 16:39:02 Начало правки... 
	//ЗаполнитьОписания();
	// БИТ_ЖКХ 05.11.2015 16:39:07 Конец правки. 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет"           , Объект.Ссылка);
	ПараметрыФормы.Вставить("СтруктураДанных"       , мКэшЗначений.мСтруктураДанных);
	ПараметрыФормы.Вставить("ТаблицаПечати"         , мКэшЗначений.мТаблицаПечати);
	ПараметрыФормы.Вставить("ТаблицаПечатиСчетчиков", мКэшЗначений.мТаблицаПечатиСчетчиков);
	ПараметрыФормы.Вставить("ТаблицаПерерасчетов"   , мКэшЗначений.мТаблицаПерерасчетов);
	
	// БИТ_ЖКХ 29.09.2014
	ПараметрыФормы.Вставить("ТаблицаСвойств"   , мКэшЗначений.мТаблицаСвойств);
	// БИТ_ЖКХ 29.09.2014
	
	Оповестить("ОбновлениеФормыЛСРодитель", ПараметрыФормы, ЭтаФорма);
	
	ЭтаФорма.Заголовок = "Карточка лицевого счета - Текущий месяц ( "+Формат(ТекущаяДата(), "ДФ=ММММ")+" )";
	
	// БИТ_ЖКХ 05.11.2015 16:39:58 Начало правки... 
	//УстановитьОтборДляРазовых();
	//
	//УстановитьПраваДоступаКЭлементамФормыНаСервере();
	//
	//УстановитьВидимость();
	// БИТ_ЖКХ 05.11.2015 16:40:01 Конец правки. 
	
	Если НЕ ЗначениеЗаполнено(ТипКвартиры) Тогда
		
		ТипКвартиры = ПредопределенноеЗначение("Справочник.бит_ТипыКвартиры.ПустаяСсылка");	
		
	КонецЕсли;
	
	// БИТ_ЖКХ 28.03.2014 
	// Для оптимизации задержек перенесено в обработчик смены страницы.
	// ОбновитьДанныеКолонкиАдрес();.
	// ОбновитьДанныеКолонкиОтветственный();.
	
	// БИТ_ЖКХ 05.11.2015 16:41:46 Начало правки... 
	//// БИТ_ЖКХ 18.07.2014
	//ПрочитатьДанныеПолучательЛьготыНаСервере();
	//// БИТ_ЖКХ 18.07.2014
	// БИТ_ЖКХ 05.11.2015 16:41:49 Конец правки. 
	
	// БИТ_ЖКХ 28.03.2014
	
	мКэшЗначений.мОбщаяПлощадь = Элементы.ОбщаяПлощадь.ТекстРедактирования;
	
	мКэшЗначений.мЖилаяПлощадь = Элементы.ЖилаяПлощадь.ТекстРедактирования;
	
	мКэшЗначений.мМОП = Элементы.МОП.ТекстРедактирования;
	
	мКэшЗначений.мОтапливаемаяПлощадь = Элементы.ОтапливаемаяПлощадь.ТекстРедактирования;
	
	мКэшЗначений.мСовокупнаяПлощадь = Элементы.СовокупнаяПлощадь.ТекстРедактирования;
	
	// БИТ_ЖКХ 29.04.2014
	Если Параметры.КлючНазначенияИспользования = "АРМКассира" Тогда
		
		ОсновныеДействияФормыПечатьТекущихНачислений(Неопределено);
		
	КонецЕсли;	
	// БИТ_ЖКХ 29.04.2014
	
	// БИТ_ЖКХ 19.12.2014{{
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НЕ ИнтерфейсТакси Тогда
		
		Элементы.ГруппаПредоставленныеУслуги.Высота = 0;
		Элементы.ГруппаПредоставленныеУслуги.РастягиватьПоВертикали = Истина; 
		
		Элементы.Услуги.Высота = 0;
		Элементы.Услуги.РастягиватьПоВертикали = Истина;
		
		Элементы.БиллинговыеУслуги.Высота = 0;
		Элементы.БиллинговыеУслуги.РастягиватьПоВертикали = Истина; 
		
		Элементы.ТабличноеПолеНачисленияБиллинговыхУслуг.Высота = 0;
		Элементы.ТабличноеПолеНачисленияБиллинговыхУслуг.РастягиватьПоВертикали = Истина; 
		
		Элементы.ТаблицаПроживающих.Высота = 0;
		Элементы.ТаблицаПроживающих.РастягиватьПоВертикали = Истина; 
		
		Элементы.ГруппаПроживающие.Высота = 0;
		Элементы.ГруппаПроживающие.РастягиватьПоВертикали = Истина; 
		
		Элементы.Льготы.Высота = 0;
		Элементы.Льготы.РастягиватьПоВертикали = Истина; 
		
		Элементы.ТаблицаСоставаСемьи.Высота = 0;
		Элементы.ТаблицаСоставаСемьи.РастягиватьПоВертикали = Истина; 
		
		Элементы.ГруппаЛьготы.Высота = 0;
		Элементы.ГруппаЛьготы.РастягиватьПоВертикали = Истина; 
		
		Элементы.Группа21.Высота = 0;
		Элементы.Группа21.РастягиватьПоВертикали = Истина; 
		
		Элементы.Группа23.Высота = 0;
		Элементы.Группа23.РастягиватьПоВертикали = Истина; 
		
		Элементы.Группа22.Высота = 0;
		Элементы.Группа22.РастягиватьПоВертикали = Истина; 
		
		Элементы.СписокВведРазовых.Высота = 0;
		Элементы.СписокВведРазовых.РастягиватьПоВертикали = Истина; 
		
		Элементы.ТаблицаСчетчиков.Высота = 0;
		Элементы.ТаблицаСчетчиков.РастягиватьПоВертикали = Истина; 
		
		Элементы.ТаблицаРаспределений.Высота = 0;
		Элементы.ТаблицаРаспределений.РастягиватьПоВертикали = Истина; 
		
		Элементы.ГруппаЗамечанияПоЛС.Высота = 0;
		Элементы.ГруппаЗамечанияПоЛС.РастягиватьПоВертикали = Истина; 
		
		Элементы.Группа6.Высота = 0;
		Элементы.Группа6.РастягиватьПоВертикали = Истина; 
		
		Элементы.Группа17.Высота = 0;
		Элементы.Группа17.РастягиватьПоВертикали = Истина; 		
		
		Элементы.ТаблицаЗамечаний.Высота = 0;
		Элементы.ТаблицаЗамечаний.РастягиватьПоВертикали = Истина; 
		
		Элементы.Замечания.Высота = 0;
		Элементы.Замечания.РастягиватьПоВертикали = Истина; 
		
	КонецЕсли;	
	// БИТ_ЖКХ 19.12.2014}}	
	
КонецПроцедуры

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 15.09.2014
	Отказ = НЕ бит_ЗакрытыйСлужебныйСервер.ПродуктАктивирован();
	
	Если Отказ Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Система лицензирования не активирована.");
		
		Возврат;
	КонецЕсли; 
	// БИТ_ЖКХ 15.09.2014
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	// Вызов механизма разделения прав доступа.
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,СправочникОбъект,ЭтаФорма);	
	
	ТаблицаКомнат.Параметры.УстановитьЗначениеПараметра("Момент", ТекущаяДата()); 

	ТаблицаКомнат.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Квартира);
	
	ДокументыЖКХ.Параметры.УстановитьЗначениеПараметра("Ссылка", ПредопределенноеЗначение("Документ.бит_бу_НачисленияПоБиллинговымУслугам.ПустаяСсылка"));
	
	// БИТ_ЖКХ 05.11.2015 16:39:17 Начало правки...
	ЗаполнитьОписания();
	УстановитьОтборДляРазовых();
	УстановитьПраваДоступаКЭлементамФормыНаСервере();
	УстановитьВидимость();
	ПрочитатьДанныеПолучательЛьготыНаСервере();
	// БИТ_ЖКХ 05.11.2015 16:39:17 Конец правки.
	ПрочитатьДанныеНабораЗаписейНаСервере(); // БИТ_ЖКХ 31.10.2016 10:39:09 
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ИзменениеУслугПоЛС" И Параметр = Объект.Ссылка) 
		или (ИмяСобытия = "ИзменениеКвартирыдляЛС" И Параметр = Объект.Квартира) 
		или (ИмяСобытия = "ИзменениеПроживающихПоЛС" И Параметр = Объект.Ссылка) тогда
		
		ЗаполнитьОписания();	
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события "ПриЗаписиНаСервере" формы.
//
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаСоставаСемьиЗначение = ДанныеФормыВЗначение(ТаблицаСоставаСемьи, Тип("РегистрСведенийНаборЗаписей.бит_СписокСемейнойЛьготы"));
	ТаблицаСоставаСемьиЗначение.Отбор.ЛицевойСчет.Установить(Объект.Ссылка);  // БИТ_ЖКХ 31.10.2016 10:55:06 
	ТаблицаЗависимыеЛСЗначение = ДанныеФормыВЗначение(ТаблицаЗависимыеЛС, Тип("РегистрСведенийНаборЗаписей.бит_ЗависимыеЛС"));
	ТаблицаЗависимыеЛСЗначение.Отбор.ЛицевойСчет.Установить(Объект.Ссылка);  // БИТ_ЖКХ 31.10.2016 10:55:13 
	Попытка
		ТаблицаСоставаСемьиЗначение.Записать();
		ТаблицаЗависимыеЛСЗначение.Записать(Истина);
		
	Исключение

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+ОписаниеОшибки());
		
	КонецПопытки; 
	
КонецПроцедуры

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьТаблицыРегистров();
	
	// БИТ_ЖКХ 28.03.2014
	// Перенесен из ОбновитьТаблицыРегистров открытия страницы "ЗависимыеЛС"(оптимизация задержек). 
	ПрочитатьДанныеНабораЗаписейНаСервере();
	// БИТ_ЖКХ 28.03.2014
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

// Процедура - обработчик события "Нажатие". 
// Кнопки ИзменитьСписокПредоставляемыхУслуг командной панели КоманднаяПанельУслуг.
//
&НаКлиенте
Процедура КоманднаяПанельУслугИзменитьСписокПредоставляемыхУслуг(Команда)
	
	Выборка = ИзменитьСписокПредоставляемыхУслугНаСервере();
	Если Выборка = Ложь Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Улица"      , Объект.УлицаЛицевогоСчета);
		ЗначенияЗаполнения.Вставить("Здание"     , Объект.Здание);
		ЗначенияЗаполнения.Вставить("ЛицевойСчет", Объект.Ссылка);
		
		ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет"));
		
		
		ЗначенияЗаполнения.Вставить("Комментарий", "Документ создан автоматически из справочника ""Лицевые счета"".");
		
		ОткрытьФорму("Документ.бит_УстановкаИзменениеУслугПоЛС.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета, ЗначенияЗаполнения", Истина, ЗначенияЗаполнения), ЭтаФорма);
		
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",Выборка);
		
		ФормаОткрытия = ОткрытьФорму("Документ.бит_УстановкаИзменениеУслугПоЛС.Форма.ФормаДокументаУправляемая", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельЗамечанияДобавить(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		
		ПередаваемыеПараметры = ПолучитьЗаписьРегистраСведений();
		
		Если ПередаваемыеПараметры = Неопределено Тогда
			
			ЗначенияЗаполнения = Новый Структура;
			
			ЗначенияЗаполнения.Вставить("ЛицевойСчет",Объект.Ссылка);
			ЗначенияЗаполнения.Вставить("ДатаЗаписи" ,ТекущаяДата());
			
			ПередаваемыеПараметры = Новый Структура; //формируем структуру полей измерений
			
			ПередаваемыеПараметры.Вставить("ЛицевойСчет",Объект.Ссылка);
			ПередаваемыеПараметры.Вставить("Номер","");
			
			ОткрытьФорму("РегистрСведений.бит_ЗамечанияПоЛС.Форма.ФормаЗаписиУправляемая",Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета",ПередаваемыеПараметры, ЗначенияЗаполнения),ЭтаФорма);
		Иначе
			
			ПараметрыМассив = Новый Массив;
			ПараметрыМассив.Добавить(ПередаваемыеПараметры); // помещаем структуру в массив
			КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.бит_ЗамечанияПоЛС", ПараметрыМассив); ОткрытьФорму("РегистрСведений.бит_ЗамечанияПоЛС.Форма.ФормаЗаписиУправляемая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,, Новый ОписаниеОповещения("КоманднаяПанельЗамечанияДобавитьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельЗамечанияДобавитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;

КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки ИзменитьСписокПроживающих командной панели СписокПроживающих.
//
&НаКлиенте
Процедура ИзменитьСписокПроживающих(Команда)
	
	СписокПроживающих = ИзменитьСписокПроживающихНаСервере();
	Если  СписокПроживающих  = Ложь Тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ЛицевойСчет"     , Объект.Ссылка);
		ОткрытьФорму("Документ.бит_РегистрацияПроживающихПоЛС.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета", ПараметрыФормы), ЭтаФорма);
		
	Иначе
		
		ОткрытьФорму("Документ.бит_РегистрацияПроживающихПоЛС.Форма.ФормаДокументаУправляемая", Новый Структура("Ключ", СписокПроживающих), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки СправкаОСоставеСемьи командной панели КоманднаяПанельПроживающие.
//
&НаКлиенте
Процедура СправкаОСоставеСемьи(Команда)
	
	СправкаОСоставеСемьи = СправкаОСоставеСемьиНаСервере();	
	
	Если  СправкаОСоставеСемьи  = Ложь Тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ЛицевойСчет"     , Объект.Ссылка);
		ОткрытьФорму("Документ.бит_СправкаОСоставеСемьи.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета", ПараметрыФормы), ЭтаФорма);
		
	Иначе
		
		ОткрытьФорму("Документ.бит_СправкаОСоставеСемьи.Форма.ФормаДокументаУправляемая", Новый Структура("Ключ", СправкаОСоставеСемьи), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки ОбновитьОтображения командной панели ДействияФормы.
//
&НаКлиенте
Процедура ДействияФормыОбновитьОтображения(Команда)
	
	ЗаполнитьОписания();
	
	ПосчитатьПлощади();
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Файлы" коммандной панели СписокВведРазовых. 
////
&НаКлиенте
Процедура ФайлыВведРазовых(Команда)
	
	Если Элементы.СписокВведРазовых.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.СписокВведРазовых.ТекущаяСтрока;
	
	ПараметрыФормы = Новый Структура;
	
	// БИТ_ЖКХ 11.09.2014
	// ПараметрыФормы.Вставить("Объект", ТекДанные.Ссылка);.
	ПараметрыФормы.Вставить("Объект", ТекДанные);
	// БИТ_ЖКХ 11.09.2014
	
	ОткрытьФорму("Справочник.бит_рз_ХранилищеДополнительнойИнформации.Форма.ФормаСпискаУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "УстановитьСчетчик" коммандной панели "Счетчики".
//
&НаКлиенте
Процедура УстановитьСчетчик(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика");
	СоздатьДокументУстановкаСнятиеСчетчика(ВидОперации);
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ДобавитьУслугуНаСчетчик" коммандной панели "Счетчики".
//
&НаКлиенте
Процедура ДобавитьУслугуНаСчетчик(Команда)
	
	ТекДанные = Элементы.ТаблицаСчетчиков.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нет установленных счетчиков!");
		
		Возврат;
	ИначеЕсли ТекДанные.СпособРасчета <> ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам") Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Изменения по групповым счетчикам производятся в справочнике ""Список зданий""");
		
	Иначе
		ТекСчетчик = ТекДанные.Счетчик;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Организация",Объект.Организация);
		
		ПараметрыФормы.Вставить("Дата",ТекущаяДата());
		
		ПараметрыФормы.Вставить("Объект",Объект.Ссылка);
		
		ПараметрыФормы.Вставить("Счетчик",ТекСчетчик);
		
		ПараметрыФормы.Вставить("ВидОперации",ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик"));
		
		ФормаОткрытия = ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая",Новый Структура ("ЗаполнитьИзСправочникаЛицевыеСчета",ПараметрыФормы),ЭтаФорма);  
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "СнятьУслугиСоСчетчика" коммандной панели "Счетчики".
//
&НаКлиенте
Процедура СнятьУслугиСоСчетчика(Команда)
	
	ТекДанные = Элементы.ТаблицаСчетчиков.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нет установленных счетчиков!");
		
		Возврат;
	ИначеЕсли ТекДанные.СпособРасчета <> ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам") Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Изменения по групповым счетчикам производятся в справочнике ""Список зданий""");
		
	Иначе
		ТекСчетчик = ТекДанные.Счетчик;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Организация",Объект.Организация);
		
		ПараметрыФормы.Вставить("Дата",ТекущаяДата());
		
		ПараметрыФормы.Вставить("Объект",Объект.Ссылка);
		
		ПараметрыФормы.Вставить("Счетчик",ТекСчетчик);
		
		ПараметрыФормы.Вставить("ВидОперации",ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.УдалитьУслугиСоСчетчика"));
		
		ФормаОткрытия = ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая",Новый Структура ("ЗаполнитьИзСправочникаЛицевыеСчета",ПараметрыФормы),ЭтаФорма);  
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" на кнопку "ВвестиПоказания" кнопки "ВвечтиПоказания" коммандной панели "Счетчики".
// Вставлено: 22.04.2009.	
//
&НаКлиенте
Процедура ВвестиПоказания(Команда)
	ТекДанные = Элементы.ТаблицаСчетчиков.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нет установленных счетчиков!");
		
		Возврат;
	Иначе
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Дата"              , ТекущаяДата());
		ПараметрыФормы.Вставить("ЛицевойСчет"       , Объект.Ссылка);
		ПараметрыФормы.Вставить("Улица"             , Объект.УлицаЛицевогоСчета);
		ПараметрыФормы.Вставить("Дом"               , Объект.Здание);
		ПараметрыФормы.Вставить("ТипСчетчика"       , ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Индивидуальный"));
		ПараметрыФормы.Вставить("ВидОперации"       , ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний"));
		ПараметрыФормы.Вставить("ПоказанияНаселения", Истина);
		
		ОткрытьФорму("Документ.бит_ВводПоказанийПоСчетчикам.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета", ПараметрыФормы), ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "НачалоВыбора" элемента "Здание" ограничивает выбор здания с учетом улицы.
//
&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",,Элемент);
	Эл = ФормаСчета.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Улица");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.УлицаЛицевогоСчета;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "Улица лицевого счета" очищает здание и квартиру.
//
&НаКлиенте
Процедура УлицаЛицевогоСчетаПриИзменении(Элемент)
	
	Объект.Здание   = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
	
	Объект.Квартира   = ПредопределенноеЗначение("Справочник.бит_Квартиры.ПустаяСсылка");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "Здание" очищает квартиру.
//
&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Корпус   = 	 ПолучитьКорпусЗданияНаСервере(Объект.Здание);
	
	Объект.Квартира   = ПредопределенноеЗначение("Справочник.бит_Квартиры.ПустаяСсылка");
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода Наименование.
//
&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 23.05.2017 13:36:24 Начало правки...
	Если РазрешитьТекстЛС() Тогда
		Возврат;	
	КонецЕсли;
	// БИТ_ЖКХ 23.05.2017 13:36:24 Конец правки.
	
	Ошибка = Ложь;
	
	СписокКодовЧисел = ПолучитьСписокКодовЧиселНаСервере();	
	
	Для Значение = 1 По СтрДлина(Текст) Цикл
		Если мКэШЗначений.СписокКодовЧисел.НайтиПоЗначению(КодСимвола(Текст,Значение)) = Неопределено Тогда		
			ПоказатьПредупреждение(Новый ОписаниеОповещения("НаименованиеОкончаниеВводаТекстаЗавершение", ЭтотОбъект, Новый Структура("Текст", Текст)), "Введены некорректыне данные! Лицевой счет может содержать только цифры.");
			Возврат;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	НаименованиеОкончаниеВводаТекстаФрагмент(Ошибка, Текст);
КонецПроцедуры

// БИТ_ЖКХ 23.05.2017 13:37:09 Начало правки... 
&НаСервереБезКонтекста 
Функция РазрешитьТекстЛС()
	
	Возврат бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_РазрешитьТекстЛС");
	
КонецФункции
// БИТ_ЖКХ 23.05.2017 13:37:11 Конец правки.             

&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекстаЗавершение(ДополнительныеПараметры) Экспорт
	
	Текст = ДополнительныеПараметры.Текст;
	
	Ошибка = Истина;
	
	НаименованиеОкончаниеВводаТекстаФрагмент(Ошибка, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекстаФрагмент(Знач Ошибка, Знач Текст)
	
	Если Ошибка <> Истина Тогда
		Объект.Наименование = Текст;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода Квартира.
//
&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	ЗаполнитьОписания();
	
КонецПроцедуры

// Процедура устанавливает отбор таблицы разовых.
//
&НаСервере
Процедура УстановитьОтборДляРазовых()
	
	Если НЕ Объект.Ссылка.пустая() Тогда
		
		Элементы.СписокВведРазовых.Видимость = Истина;
		
		Эл = СписокВведРазовых.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ЛицевойСчет");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Объект.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Эл = СписокВведРазовых.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Дата");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		Эл.ПравоеЗначение   = НачалоМесяца(ТекущаяДата());
		Эл.Использование    = Ложь;
		
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Эл = СписокВведРазовых.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Дата");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		Эл.ПравоеЗначение  = КонецМесяца(ТекущаяДата());
		Эл.Использование    = Ложь;
		
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе
		
		Элементы.СписокВведРазовых.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля СписокВведРазовых.
//
&НаКлиенте
Процедура СписокВведРазовыхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Отказ = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;	
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокВведРазовыхПередНачаломДобавленияЗавершение", ЭтотОбъект, Новый Структура("Копирование, Элемент", Копирование, Элемент)), "Элемент еще не записан. Записать?", РежимДиалогаВопрос.ОКОтмена);
		Возврат;
		
	КонецЕсли;
	
	СписокВведРазовыхПередНачаломДобавленияФрагмент(Копирование, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВведРазовыхПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Копирование = ДополнительныеПараметры.Копирование;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Попытка
			ЗаписатьОбъект();
			УстановитьОтборДляРазовых();				
		Исключение
			
			Возврат;
			
		КонецПопытки;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	СписокВведРазовыхПередНачаломДобавленияФрагмент(Копирование, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВведРазовыхПередНачаломДобавленияФрагмент(Знач Копирование, Знач Элемент)
	
	Перем ПараметрыФормы;
	
	Если Не Копирование тогда	
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Организация"     , Объект.Организация);
		ПараметрыФормы.Вставить("ЛицевойСчет"     , Объект.Ссылка);
		
		ОткрытьФорму("Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета", ПараметрыФормы), Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "ОбщаяПлощадь".
//
&НаКлиенте
Процедура ОбщаяПлощадьПриИзменении(Элемент)
	
	ВернутьЗначение = ОбщаяПлощадьПриИзмененииНаСервере();
	
	Если ВернутьЗначение Тогда
		
		ОбщаяПлощадь = мКэшЗначений.мОбщаяПлощадь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "ОтапливаемаяПлощадь".
//
&НаКлиенте
Процедура ОтапливаемаяПлощадьПриИзменении(Элемент)
	
	ВернутьЗначение = ОтапливаемаяПлощадьПриИзмененииНаСервере();
	
	Если ВернутьЗначение Тогда
		
		ОтапливаемаяПлощадь = мКэшЗначений.мОтапливаемаяПлощадь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "ЖилаяПлощадь".
//
&НаКлиенте
Процедура ЖилаяПлощадьПриИзменении(Элемент)
	
	ВернутьЗначение = ЖилаяПлощадьПриИзмененииНаСервере();
	
	Если ВернутьЗначение Тогда
		
		ЖилаяПлощадь = мКэшЗначений.мЖилаяПлощадь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "СовокупнаяПлощадь".
//
&НаКлиенте
Процедура СовокупнаяПлощадьПриИзменении(Элемент)
	
	ВернутьЗначение = СовокупнаяПлощадьПриИзмененииНаСервере();
	
	Если ВернутьЗначение Тогда
		
		СовокупнаяПлощадь = мКэшЗначений.мСовокупнаяПлощадь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "МОП".
//
&НаКлиенте
Процедура МОППриИзменении(Элемент)
	
	ВернутьЗначение = МОППриИзмененииНаСервере();
	
	Если ВернутьЗначение Тогда
		
		МОП = мКэшЗначений.мМОП;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "ТипКвартиры".
//
&НаКлиенте
Процедура ТипКвартирыПриИзменении(Элемент)
	
	ИзменитьДанныеКвартиры("ТипКвартиры", ТипКвартиры);
	
	ЗаполнитьОписания();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" элемента "СтатусКвартиры".
//
&НаКлиенте
Процедура СтатусКвартирыПриИзменении(Элемент)
	
	ИзменитьДанныеКвартиры("СтатусКвартиры", СтатусКвартиры);
	
	ЗаполнитьОписания();
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "ТипЗапирающегоУстройства".
// 
&НаКлиенте
Процедура ТипЗапирающегоУстройстваПриИзменении(Элемент)
	
	ИзменитьДанныеКвартиры("ТипЗапирающегоУстройства", ТипЗапирающегоУстройства);
	
	ЗаполнитьОписания();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" элемента "Квартира".
// Ограничивает выбор квартиры с учетом здания.
//
&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора",,Элемент);
	
	Эл = ФормаСчета.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Здание;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "ТипПлиты".
//
&НаКлиенте
Процедура ТипПлитыПриИзменении(Элемент)
	
	ИзменитьДанныеКвартиры("ТипПлиты", ТипПлиты);
	
	ЗаполнитьОписания();
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "ОтображатьПоГруппам".
//
&НаКлиенте
Процедура ОтображатьПоГруппамПриИзменении(Элемент)
	
	Если Объект.ОтображатьПоГруппам Тогда
		
		ЗаполнитьТаблицуПоГруппам();
		
		Элементы.ДеревоНачислений.Видимость = Истина;
		Элементы.ТаблицаНачислений.Видимость = Ложь;
		
		Элементы.ДеревоУслуг.Видимость = Истина;	
		Элементы.Услуги.Видимость = Ложь;
		
		// БИТ_ЖКХ 11.09.2014
		Элементы.РазвернутьДерево.Видимость = Истина;
		Элементы.СвернутьДерево.Видимость = Истина;
		Элементы.РазвернутьДеревоУслуг.Видимость = Истина;
		Элементы.СвернутьДеревоУслуг.Видимость = Истина;
		Элементы.ВывестиСписокДеревоНачислений.Видимость = Истина;
		Элементы.ВывестиСписокТаблицаНачислений.Видимость = Ложь;
		// БИТ_ЖКХ 11.09.2014
		
	Иначе
		
		Элементы.ДеревоНачислений.Видимость = Ложь;
		Элементы.ТаблицаНачислений.Видимость = Истина;
		
		Элементы.ДеревоУслуг.Видимость = Ложь;	
		Элементы.Услуги.Видимость = Истина;	
		
		// БИТ_ЖКХ 11.09.2014
		Элементы.РазвернутьДерево.Видимость = Ложь;
		Элементы.СвернутьДерево.Видимость = Ложь;
		Элементы.РазвернутьДеревоУслуг.Видимость = Ложь;
		Элементы.СвернутьДеревоУслуг.Видимость = Ложь;
		Элементы.ВывестиСписокДеревоНачислений.Видимость = Ложь;
		Элементы.ВывестиСписокТаблицаНачислений.Видимость = Истина;
		// БИТ_ЖКХ 11.09.2014
		
	КонецЕсли;
	
	ЗаполнитьТаблицуПечати();
	
КонецПроцедуры

// Процедура - обработчик события "ПриАктивизацииЯчейки" таблицы "ТаблицаЗамечаний". 
////
&НаКлиенте
Процедура ТаблицаЗамечанийПриАктивизацииЯчейки(Элемент)
	
	Если НЕ Элемент.ТекущийЭлемент = Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя <> мКэшЗначений.мКолонка Тогда
			
			ДанныеЗамечаний = 	ТаблицаЗамечаний;
			
			мКэшЗначений.мКолонка = Элемент.ТекущийЭлемент.Имя; 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Группа6ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Заголовок = "Зависимые ЛС" Тогда
		
		ОбновитьТаблицуЗависимыеЛС();

		ПрочитатьДанныеНабораЗаписейНаСервере();

	ИначеЕсли ТекущаяСтраница.Заголовок = "Замечания по ЛС" Тогда
		ОбновитьТаблицуЗамечания();
		
	ИначеЕсли ТекущаяСтраница.Заголовок = "Комнаты" Тогда
		ЗаполнитьТаблицуКомнат();
		
	ИначеЕсли ТекущаяСтраница.Заголовок = "Основной ЛС" Тогда
		
		ЗаполнитьТаблицуОсновнойЛС();
		ОбновитьДанныеКолонкиАдресДляОсновногоЛС();
		ОбновитьДанныеКолонкиОтветственныйДляОсновногоЛС();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖилоеПомещениеСпециализированногоЖилищногоФондаПриИзменении(Элемент)
	
	ИзменитьДанныеКвартиры("ЖилоеПомещениеСпециализированногоЖилищногоФонда", ЖилоеПомещениеСпециализированногоЖилищногоФонда);
	
	ЗаполнитьОписания();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаСчетчиков

// Процедура - обработчик события "ПриАктивизацииСтроки".
// Выводит на форму данные о текущем счетчике.
//
&НаКлиенте
Процедура ТаблицаСчетчиковПриАктивизацииСтроки(Элемент)
	
	ТекДанные  = Элемент.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		
		ТекСчетчик = ТекДанные.Счетчик;
		
		Если НЕ ТекСчетчик = Null Тогда
			
			ТипСчетчика = ПолучитьТипСчетчикаНаСервере(ТекСчетчик);
			КоэффициентУмножения = ПолучитьКоэффициентУмноженияНаСервере(ТекСчетчик);
			
			ТипСчетчика 		= ТипСчетчика;
			Коэффициент 		= КоэффициентУмножения;
			ПоследнееПоказание 	= Элемент.ТекущиеДанные.ДоПоказаний;
			
			Если ВыбратьГрупповыеСчетчикиИзЗапросаНаСервере(ТекДанные.Услуга) = Истина Тогда
				Групповой = Истина;	
			Иначе	
				Групповой = Ложь;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "Выбор".
//
&НаКлиенте
Процедура ТаблицаСчетчиковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаСчетчиковНачислено" Тогда
		
		АдресТаблицыРасшифровкиСчетчиковВХранилище = ПоместитьТаблицуРасшифровкиСчетчиковВХранилище();
		
		ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиСчетчиковВХранилище", АдресТаблицыРасшифровкиСчетчиковВХранилище);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаРасшифровкиСтавкиУправляемая", ПараметрыФормы, Элемент);
		
	ИначеЕсли Поле.Имя = "ТаблицаСчетчиковКоличествоЕдиницПоЛС" Тогда
		
		АдресТаблицыРасшифровкиВХранилище = ПоместитьТаблицуРасшифровкиСчетчиковВХранилище();
		
		ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиВХранилище", АдресТаблицыРасшифровкиВХранилище);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаРасшифровкиКоличестваЕдиницУправляемая", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

//  Процедура - обработчик события "ПередНачаломДобавления" табличного поля "ТаблицаСчетчиков".
//
&НаКлиенте
Процедура ТаблицаСчетчиковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаНачислений

// Процедура - обработчик события "Выбор" табличного поля ТаблицаНачислений.
//
&НаКлиенте
Процедура ТаблицаНачисленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаНачисленийУслуга"
		Или Поле.Имя = "ТаблицаНачисленийСтавка" 
		Или Поле.Имя = "ТаблицаНачисленийНачислено" Тогда
		
		АдресТаблицыРасшифровкиВХранилище = ПоместитьТаблицуРасшифровкиВХранилище();
		
		ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиВХранилище", АдресТаблицыРасшифровкиВХранилище);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаРасшифровкиСтавкиУправляемая", ПараметрыФормы, Элемент);
		
	ИначеЕсли Поле.Имя = "ТаблицаНачисленийРазовые" Тогда 
		
		ТекСтрока = Элементы.ТаблицаНачислений.ТекущиеДанные;
		
		РасшифровкаРазовых = ЗапросДляРасшифровкиРазовыхНаСервере(ТекСтрока.Услуга);
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("РасшифровкаРазовых",РасшифровкаРазовых);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаРасшифровкиРазовыхУправляемая", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

//  Процедура - обработчик события "Выбор" дерева значений "ДеревоНачислений".
//
&НаКлиенте
Процедура ДеревоНачисленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	ДочерниеЭлементы = ТекСтрока.ПолучитьЭлементы();
	
	Если (Поле.Имя = "ДеревоНачисленийУслуга"
		Или Поле.Имя = "ДеревоНачисленийСтавка" 
		Или Поле.Имя = "ДеревоНачисленийНачислено") И ДочерниеЭлементы.Количество() = 0 Тогда
		
		АдресТаблицыРасшифровкиВХранилище = ПоместитьТаблицуРасшифровкиВХранилище();
		
		ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиВХранилище", АдресТаблицыРасшифровкиВХранилище);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаРасшифровкиСтавкиУправляемая", ПараметрыФормы, Элемент);
		
	ИначеЕсли Поле.Имя = "ДеревоНачисленийРазовые" Тогда  
		
		
		ТекСтрока = Элементы.ДеревоНачислений.ТекущиеДанные;
		
		РасшифровкаРазовых = ЗапросДляРасшифровкиРазовыхНаСервере(ТекСтрока.Услуга);
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("РасшифровкаРазовых",РасшифровкаРазовых);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаРасшифровкиРазовыхУправляемая", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляЗависимыеЛС

// Процедура - обработчик события "ОбработкаВыбора" табличного поля "ЛицевойСчетЗависимый" "ЗависимыеЛС". 
////
&НаКлиенте
Процедура ТаблицаЗависимыеЛСЛицевойСчетЗависимыйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		Если ВыбратьЗависимыйЛСНаСервере(ВыбранноеЗначение) <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗависимыеЛСЛицевойСчетЗависимыйПриИзменении(Элемент)
	
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
	
	ТекущаяСтрока = Элементы.ТаблицаЗависимыеЛС.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.ЛицевойСчет = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗависимыеЛСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущаяСтрока = Элементы.ТаблицаЗависимыеЛС.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.ЛицевойСчет = Объект.Ссылка;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаКомнат

&НаКлиенте
Процедура ТаблицаКомнатЗначенийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ТаблицаКомнатЗначений.ТекущиеДанные;
	
	Если ТекущиеДанные.НомерКартинки = 1 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ТаблицаКомнатЗначенийПередУдалениемЗавершение1", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Пометить элемент на удаление?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ТаблицаКомнатЗначенийПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("Ответ, ТекущиеДанные", Ответ, ТекущиеДанные)), "Снять с элемента пометку на удаление?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомнатЗначенийПередУдалениемЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = ПометитьКомнатуНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 2;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомнатЗначенийПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = ДополнительныеПараметры.Ответ;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = СнятьКомнатуСПометкиНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомнатЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Основание = Новый Структура;
	
	Основание.Вставить("Владелец", Объект.Квартира);
	
	Если Копирование Тогда
		
		ТекДанные = Элементы.ТаблицаКомнатЗначений.ТекущиеДанные;
		
		Если НЕ ТекДанные = Неопределено Тогда
			
			НомерКомнаты    = ПолучитьКвартираНомерКомнатыНаСервере(ТекДанные.Ссылка);
			ЧастьПомещения  = ПолучитьКвартираЧастьПомещенияНаСервере(ТекДанные.Ссылка);
			НаименованиеКом = ПолучитьКвартираНаименованиеНаСервере(ТекДанные.Ссылка);
			
			Основание.Вставить("НомерКомнаты"  , НомерКомнаты);
			Основание.Вставить("ЧастьПомещения", ЧастьПомещения);
			Основание.Вставить("Наименование"  , НаименованиеКом);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Основание, Момент", Основание, ТекущаяДата());
	
	ОткрытьФорму("Справочник.бит_Комнаты.Форма.ФормаЭлементаУправляемая", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомнатЗначенийНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ТаблицаКомнатЗначений.ТекущиеДанные;
	Элементы.ТаблицаКомнатЗначений.Доступность = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ"     , ТекДанные.Ссылка);
	ПараметрыФормы.Вставить("НаДату"   , ТекущаяДата());
	
	ОткрытьФорму("Справочник.бит_Комнаты.Форма.ФормаЭлементаУправляемая", ПараметрыФормы);
	
	Элементы.ТаблицаКомнатЗначений.Доступность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаЗамечаний

&НаКлиенте
Процедура ТаблицаЗамечанийПриАктивизацииСтроки(Элемент)
	
	ТекДанные  = Элемент.ТекущиеДанные;
	
	// БИТ_ЖКХ изменение кода. Начало. 13.10.2011{{
	Если НЕ ТекДанные = Неопределено Тогда
		
		// ТекстЗамечания = ТекДанные.ТекстЗамечания;.
		Элементы.Декорация1.Заголовок = ТекДанные.ТекстЗамечания;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗамечанийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Попытка
		Отказ = Истина;	
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ЛицевойСчет",Объект.Ссылка);
		
		ОткрытьФорму("РегистрСведений.бит_ЗамечанияПоЛС.Форма.ФормаЗаписиУправляемая",Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета",ПараметрыФормы),ЭтаФорма);	
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаСоставаСемьи

&НаКлиенте
Процедура ТаблицаСоставаСемьиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущаяСтрока = Элементы.Льготы.ТекущиеДанные;
	Отказ = (ТекущаяСтрока = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоставаСемьиПолучательЛьготыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяЛьгота = Элементы.Льготы.ТекущиеДанные;
	
	Если ТекущаяЛьгота = Неопределено Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	Элемент.СписокВыбора.Очистить();
	
	// БИТ_ЖКХ 03.03.2014
	// ТаблицаП = ПолучитьТаблицуПроживающихНаСервере(ТекущаяЛьгота);.
	СписокПроживающих = ПолучитьТаблицуПроживающихНаСервере();
	
	Поиск = СписокПроживающих.Найти(ТекущаяЛьгота.ФизЛицо);
	
	Если НЕ Поиск = Неопределено Тогда
		СписокПроживающих.Удалить(Поиск);
	КонецЕсли; 
	// БИТ_ЖКХ 03.03.2014
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(СписокПроживающих);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоставаСемьиПолучательЛьготыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяЛьгота = Элементы.Льготы.ТекущиеДанные;
	
	Если ТекущаяЛьгота = Неопределено Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	Элемент.СписокВыбора.Очистить();
	
	// БИТ_ЖКХ 03.03.2014
	// ТаблицаП = ПолучитьТаблицуПроживающихНаСервере(ТекущаяЛьгота);.
	СписокПроживающих = ПолучитьТаблицуПроживающихНаСервере();
	// СписокПроживающих = ТаблицаП.ВыгрузитьКолонку("ФизЛица");.

	Поиск = СписокПроживающих.Найти(ТекущаяЛьгота.ФизЛицо);
	
	Если НЕ Поиск = Неопределено Тогда
		СписокПроживающих.Удалить(Поиск);
	КонецЕсли; 
	// БИТ_ЖКХ 03.03.2014
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(СписокПроживающих);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоставаСемьиПолучательЛьготыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСоставаСемьи.ТекущиеДанные;
		
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.СтепеньРодства = ОпределитьРодство(ТекущаяСтрока.ПолучательЛьготы);
	ТекущаяСтрока.ЛицевойСчет = Объект.Ссылка;
	ТекущаяСтрока.ВладелецЛьготы = Элементы.Льготы.ТекущиеДанные.ФизЛицо;
	ТекущаяСтрока.Льгота = Элементы.Льготы.ТекущиеДанные.Льгота;
		
КонецПроцедуры

#КонецОбласти

&НаСервере
функция ОпределитьРодство (ПолучательЛьготы)
	
  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ
                 |	бит_ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
                 |	бит_ПроживающиеПоЛС.СтепеньРодства КАК СтепеньРодства
                 |ИЗ
                 |	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
                 |ГДЕ
                 |	бит_ПроживающиеПоЛС.ФизЛицо = &ФизЛицо";
  
  запрос.УстановитьПараметр("ФизЛицо", ПолучательЛьготы.Ссылка);
  
  таб = запрос.Выполнить().Выгрузить();
  
  если таб.Количество() > 0 тогда
	  
	 возврат таб[0].СтепеньРодства; 
	  
  конецесли;	  
  
  
КонецФункции	

#Область ДействияКомандФормы

//  Процедура - обработчик события "Нажатие" кнопки "РегистрацияЛьгот" коммандной панели "КоманднаяПанельПроживающие".
//
&НаКлиенте
Процедура РегистрацияЛьгот(Команда)
	
	РегистрацияЛьгот = РегистрацияЛьготНаСервере();	
	
	Если  РегистрацияЛьгот  = Ложь Тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ЛицевойСчет"     , Объект.Ссылка);
		ОткрытьФорму("Документ.бит_РегистрацияЛьготПоЛС.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета", ПараметрыФормы), ЭтаФорма);
		
	Иначе
		
		ОткрытьФорму("Документ.бит_РегистрацияЛьготПоЛС.Форма.ФормаДокументаУправляемая", Новый Структура("Ключ", РегистрацияЛьгот), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

//  Процедура - обработчик события "Нажатие" кнопки "ИсторияПроживающихПоЛС" коммандной панели "КоманднаяПанельПроживающие".
//
&НаКлиенте
Процедура ИсторияПроживающихПоЛС(Команда)
	
	// БИТ_ЖКХ 09.09.2014
	// ФормаОтчета = ОткрытьФорму("Отчет.бит_ИсторияПроживающихНаЛС.Форма.ФормаОтчета",,ЭтаФорма);.
	ФормаОтчета = ОткрытьФорму("Отчет.бит_ИсторияПроживающихНаЛС.Форма.ФормаОтчетаУправляемая",,ЭтаФорма);
	
	ЗначениеПараметраЛС = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ЛицевойСчет"));
	Для Каждого ТекСтрока Из ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		Если ТекСтрока.ЛевоеЗначение = ЗначениеПараметраЛС.Поле тогда
			ТекСтрока.ПравоеЗначение = Объект.Ссылка;
			ТекСтрока.Использование  = Истина;
			Прервать;	
		КонецЕсли;	 
	КонецЦикла;	
	
	// БИТ_ЖКХ 20.01.2015{{
	Оповестить("ОткрытьИзЛС");
	// БИТ_ЖКХ 20.01.2015}}
	
КонецПроцедуры

// Процедура формирует данные печати. 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура СформироватьДанныеПечати()
	
	Обработка = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	мКэшЗначений.мСтруктураДанных        = Обработка.ПолучитьСтруктуруДанных();
	
	мТаблицаПечати = Обработка.ПолучитьТаблицуПечати();
	мТаблицаПечатиСчетчиков = Обработка.ПолучитьТаблицуПечатиСчетчиков();
	мТаблицаПерерасчетов    = Обработка.ПолучитьТаблицуПерерасчетов();
	
	// БИТ_ЖКХ 29.09.2014
	мТаблицаСвойств	= Новый ТаблицаЗначений;
	// БИТ_ЖКХ 29.09.2014
	
	// БИТ_ЖКХ 09.02.2015{{
	мТаблицаОбщедомовыхСчетчиков = Обработка.ПолучитьТаблицуОбщедомовыхСчетчиков();
	// БИТ_ЖКХ 09.02.2015}}
	
	Если Объект.Организация.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	Обработка.Период      = КонецМесяца(ТекущаяДата());
	Обработка.Организация = Объект.Организация;
	
	Обработка.ОбновитьКэшОрганизации();
	Обработка.ОбновитьНастройкиЖКХ();
	// БИТ_ЖКХ 24.01.2017 13:36:17 Начало правки...
	Обработка.ОбновитьКэшПолучателяПлатежа();
	// БИТ_ЖКХ 24.01.2017 13:36:17 Конец правки.
	Обработка.ЗаполнитьСтруктураДанных(мКэшЗначений.мСтруктураДанных);
	
	ТаблицаН = ДанныеФормыВЗначение(ТаблицаНачислений,Тип("ТаблицаЗначений"));
	ТаблицаП = ДанныеФормыВЗначение(ТаблицаПени,Тип("ТаблицаЗначений"));
	
	ТаблицаПениИзХранилища  = ПолучитьИзВременногоХранилища(АдресТаблицыПениВХранилище);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица"    , ТаблицаН);
	Запрос.УстановитьПараметр("ТаблицаПени", ТаблицаПениИзХранилища);
	Запрос.УстановитьПараметр("Дата"       , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПени.Услуга,
	|	ТаблицаПени.Пени КАК Пени
	|ПОМЕСТИТЬ ТаблицаПени
	|ИЗ
	|	&ТаблицаПени КАК ТаблицаПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Услуга,
	|	Таблица.Долг,
	|	Таблица.КОплате,
	|	Таблица.КОплатеЗаМесяц,
	|	Таблица.Факт,
	|	Таблица.Льгота,
	|	Таблица.Начислено,
	|	Таблица.Норматив,
	|	Таблица.Объем,
	|	Таблица.ПереплатаНаначало,
	|	Таблица.Приоритет,
	|	Таблица.Разовые,
	|	Таблица.Оплата,
	|	Таблица.СальдоНаНачало,
	|	Таблица.Ставка,
	|	Таблица.Тариф
	|ПОМЕСТИТЬ ТаблицаНачислений
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.Услуга,
	|	ТаблицаНачислений.Услуга.ГруппаУслуги КАК ГруппаУслуги,
	|	ТаблицаНачислений.Услуга.ГруппаУслуги.Приоритет КАК ПриоритетГруп,
	|	ТаблицаНачислений.Долг,
	|	ТаблицаНачислений.КОплате,
	|	ТаблицаНачислений.КОплатеЗаМесяц,
	|	ТаблицаНачислений.Факт КАК Количество,
	|	ТаблицаНачислений.Льгота,
	|	ТаблицаНачислений.Начислено,
	|	ТаблицаНачислений.Норматив,
	|	ТаблицаНачислений.Объем,
	|	ТаблицаНачислений.ПереплатаНаначало,
	|	ТаблицаНачислений.Приоритет,
	|	ТаблицаНачислений.Разовые,
	|	ТаблицаНачислений.Оплата,
	|	ТаблицаНачислений.СальдоНаНачало КАК Сальдо,
	|	ТаблицаНачислений.Ставка,
	|	ТаблицаНачислений.Тариф,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_УслугиЖКХСпособыРасчета.ЕдИзм КАК ЕдИзм,
	|	ТаблицаПени.Пени
	|ИЗ
	|	ТаблицаНачислений КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|			ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|				И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|		ПО ТаблицаНачислений.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПени КАК ТаблицаПени
	|		ПО ТаблицаНачислений.Услуга = ТаблицаПени.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоПереплата         = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Сальдо = 0 ИЛИ НЕ Выборка.Начислено = 0 ИЛИ НЕ Выборка.Разовые = 0 Тогда
		Иначе
			Продолжить;
		КонецЕсли;
		
		Переплата         = 0;
		
		ЗакрытиеВхДолга = Выборка.Сальдо - Выборка.Оплата;
		
		ДолгСУчетомОплаты = ?(ЗакрытиеВхДолга > 0, ЗакрытиеВхДолга , 0);
		Авансы            = ?(ЗакрытиеВхДолга < 0, ЗакрытиеВхДолга * -1, 0);
		
		НоваяСтрока = мТаблицаПечати.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Выборка.Норматив = 0 Тогда
			НоваяСтрока.Объем = Выборка.Количество;
		КонецЕсли; 
		
		Переплата = Выборка.ПереплатаНаНачало + Выборка.Начислено +  Выборка.Разовые - Выборка.Оплата - ?(мКэшЗначений.мЛьготаПерсонифицированная,0,Выборка.Льгота);
		
		ИтогоПереплата         = ИтогоПереплата + Переплата;
		
	КонецЦикла; 
	
	СтрРайон 	= ?(мКэшЗначений.мНеПечататьРайон   , "", ""+ мКэшЗначений.мПрефиксРайон +" "+ СокрЛП(Строка(Объект.Здание.Район)) + ",");
	СтрУлица    = ?(мКэшЗначений.мНеПечататьУлица   , "", ""+ мКэшЗначений.мПрефиксУлица +" "+ СокрЛП(Строка(Объект.УлицаЛицевогоСчета)) + ",");
	СтрДом      = ?(мКэшЗначений.мНеПечататьДом     , "", " " + мКэшЗначений.мПрефиксДом +" "+ СокрЛП(Строка(Объект.Здание))+",") ;
	СтрКорпус   = ?(мКэшЗначений.мНеПечататьКорпус  , "", ?(ЗначениеЗаполнено(Корпус)," "+мКэшЗначений.мПрефиксКорпус+ " " +СокрЛП(Строка(Корпус)) + ",",""));
	СтрКвартира = ?(мКэшЗначений.мНеПечататьКвартира, "", " " + мКэшЗначений.мПрефиксКвартира +" "+ СокрЛП(Строка(Объект.Квартира)));
	
	Адрес = "" + СтрРайон + СтрУлица + СтрДом + СтрКорпус + СтрКвартира;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ОплатаКУСписокЛС.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
	|ГДЕ
	|	бит_ОплатаКУСписокЛС.ЛицевойСчет = &ЛицевойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаПоследнейОплаты = Выборка.Дата;
	КонецЕсли;
	
	мКэшЗначений.мСтруктураДанных.ГруппироватьУслуги               = Объект.ОтображатьПоГруппам;
	мКэшЗначений.мСтруктураДанных.ДатаПечатиКвитанций              = Формат(ТекущаяДата(), "ДФ=dd.MMMM.yyyy");
	мКэшЗначений.мСтруктураДанных.ДатаПоследнейОплаты              = ДатаПоследнейОплаты;
	мКэшЗначений.мСтруктураДанных.Долг                             = мТаблицаПечати.Итог("Долг");
	мКэшЗначений.мСтруктураДанных.ДолгНач                          = мТаблицаПечати.Итог("Долг") * -1;
	мКэшЗначений.мСтруктураДанных.ИтогПени                         = мТаблицаПечати.Итог("Пени");
	мКэшЗначений.мСтруктураДанных.КОплате                          = мТаблицаПечати.Итог("КОплате");
	мКэшЗначений.мСтруктураДанных.КОплатеЗаМесяц                   = мТаблицаПечати.Итог("КОплатеЗаМесяц");
	мКэшЗначений.мСтруктураДанных.КолЛьготников                    = мКоличествоЛьготников;
	мКэшЗначений.мСтруктураДанных.КоличествоКомнат                 = КоличествоКомнат;
	мКэшЗначений.мСтруктураДанных.КоличествоПроживающих            = Постоянно;
	мКэшЗначений.мСтруктураДанных.ЛицевойСчет                      = Объект.Ссылка;
	мКэшЗначений.мСтруктураДанных.ЛицевойСчетАдрес                 = Адрес;
	мКэшЗначений.мСтруктураДанных.ЛицевойСчетНомер                 = Объект.Наименование;
	мКэшЗначений.мСтруктураДанных.ЛицевойСчетФио                   = ОтветсвенноеЛицо;
	мКэшЗначений.мСтруктураДанных.Льгота                           = мТаблицаПечати.Итог("Льгота");
	мКэшЗначений.мСтруктураДанных.Начислено                        = мТаблицаПечати.Итог("Начислено");
	мКэшЗначений.мСтруктураДанных.ОписаниеЖилойПлощади             = ЖилаяПлощадь;
	мКэшЗначений.мСтруктураДанных.ОписаниеОбщейПлощади             = ОбщаяПлощадь;
	мКэшЗначений.мСтруктураДанных.ОписаниеОтапливаемойПлощади      = ОтапливаемаяПлощадь;
	мКэшЗначений.мСтруктураДанных.ОписаниеЛьгот                    = ОписаниеЛьгот;
	мКэшЗначений.мСтруктураДанных.ОписаниеСложнойЛьготы            = ОписаниеСложнойЛьготы;
	мКэшЗначений.мСтруктураДанных.Оплата                           = мТаблицаПечати.Итог("Оплата");
	мКэшЗначений.мСтруктураДанных.Переплата                        = ИтогоПереплата;
	мКэшЗначений.мСтруктураДанных.ПереплатаНаНачало                = мТаблицаПечати.Итог("ПереплатаНаначало");
	мКэшЗначений.мСтруктураДанных.Разовые                          = мТаблицаПечати.Итог("Разовые");
	мКэшЗначений.мСтруктураДанных.Сальдо                           = мТаблицаПечати.Итог("Сальдо");
	мКэшЗначений.мСтруктураДанных.СальдоЗнак                       = "";
	мКэшЗначений.мСтруктураДанных.СтатусКвартиры                   = СтатусКвартиры;
	мКэшЗначений.мСтруктураДанных.ТипКвартиры                      = ТипКвартиры;
	мКэшЗначений.мСтруктураДанных.ПроцентОтОплаты                  = 0;
	
	ТаблицаС = ДанныеФормыВЗначение(ТаблицаСчетчиков, Тип("ТаблицаЗначений"));
	
	Запрос.УстановитьПараметр("ТаблицаСЧ", ТаблицаС);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСЧ.Счетчик,
	|	ТаблицаСЧ.Услуга,
	|	ТаблицаСЧ.Приоритет,
	|	ТаблицаСЧ.ДоПоказаний,
	|	ТаблицаСЧ.СпособРасчета,
	|	ТаблицаСЧ.ОтПоказаний,
	|	ТаблицаСЧ.КоличествоЕдиницПоЛС,
	|	ТаблицаСЧ.Многотарифный,
	|	ТаблицаСЧ.Норматив
	|ПОМЕСТИТЬ ТаблицаСчетчиков
	|ИЗ
	|	&ТаблицаСЧ КАК ТаблицаСЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетчиков.Счетчик КАК Счетчик,
	|	ТаблицаСчетчиков.Услуга,
	|	ТаблицаСчетчиков.Услуга.НаименованиеСокращенное КАК СокрНаименование,
	|	ТаблицаСчетчиков.Услуга.ОбщедомовыеНачисления КАК ОбщедомовыеНачисления,
	|	ТаблицаСчетчиков.Приоритет,
	|	ТаблицаСчетчиков.ДоПоказаний,
	|	ТаблицаСчетчиков.ОтПоказаний,
	|	ТаблицаСчетчиков.КоличествоЕдиницПоЛС КАК КоличествоЕдиниц,
	|	ТаблицаСчетчиков.Многотарифный КАК Многотарифный,
	|	ТаблицаСчетчиков.Норматив
	|ИЗ
	|	ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|ГДЕ
	|	ТаблицаСчетчиков.СпособРасчета = Значение(Перечисление.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам)
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(Многотарифный)
	|ПО
	|	Счетчик";
	
	ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСЧ.Следующий() Цикл
		
		Выборка = ВыборкаСЧ.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = мТаблицаПечатиСчетчиков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Если НЕ ВыборкаСЧ.Многотарифный Тогда
				Прервать;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация"  , Объект.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.ВидОперации КАК Основание,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга КАК Услуга,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга.Приоритет КАК Приоритет,
	|	СУММА(бит_РазовыеПоУслугамЖКХСписокУслуг.Сумма) КАК Сумма
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ.СписокУслуг КАК бит_РазовыеПоУслугамЖКХСписокУслуг
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Организация = &Организация
	|	И бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Проведен
	|	И (бит_РазовыеПоУслугамЖКХСписокУслуг.ЛицевойСчет = &ЛицевойСчет
	|			ИЛИ бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.ЛицевойСчет = &ЛицевойСчет)
	|	И бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.ВидОперации,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга.Приоритет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.ВидОперации,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга.Приоритет,
	|	СУММА(бит_РазовыеПоУслугамЖКХЛицевыеСчета.Сумма)
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ.ЛицевыеСчета КАК бит_РазовыеПоУслугамЖКХЛицевыеСчета
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Проведен
	|	И бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Организация = &Организация
	|	И (бит_РазовыеПоУслугамЖКХЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|			ИЛИ бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.ЛицевойСчет = &ЛицевойСчет)
	|	И бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.ВидОперации,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основание,
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = мТаблицаПерерасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла; 
	
	АдресСтруктурыВХранилище = ПоместитьСтруктуруВХранилище(мКэшЗначений.мСтруктураДанных,мТаблицаПечати,мТаблицаПечатиСчетчиков,мТаблицаПерерасчетов,мТаблицаСвойств,мТаблицаОбщедомовыхСчетчиков);
	
КонецПроцедуры // () 

//  Процедура - обработчик события "Нажатие" кнопки "Пени".
// 
&НаКлиенте
Процедура КнопкаПениНажатие(Команда)
	
	РезультатЗапроса = ПолучитьСуммуПениНаСервере();
	
	ПараметрыФормы  = Новый Структура;
	
	ПараметрыФормы.Вставить("ЛицевойСчет", Объект.Ссылка);
	
	ПараметрыФормы.Вставить("РезультатЗапроса", РезультатЗапроса);
	
	Форма = ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаПениУправляемая",Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета",ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Файлы" коммандной панели формы. 
////
&НаКлиенте
Процедура Файлы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ФайлыЗавершение", ЭтотОбъект), "Сначала запишите документ.");
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Объект", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.бит_рз_ХранилищеДополнительнойИнформации.Форма.ФормаСпискаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ИсторияУслуг" коммандной панели КоманднаяПанельУслуг. 
////
&НаКлиенте
Процедура КоманднаяПанельУслугИсторияУслуг(Команда)
	
	// БИТ_ЖКХ 09.09.2014
	// ФормаОтчета = ОткрытьФорму("Отчет.бит_ИсторияУслугЛС.Форма.ФормаОтчета",,ЭтаФорма);.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет",Объект.Ссылка);
	
	ФормаОтчета = ОткрытьФорму("Отчет.бит_ИсторияУслугЛС.Форма.ФормаОтчетаУправляемая",Новый Структура("СформироватьИзЛС",ПараметрыФормы),ЭтаФорма);
	
	ЗначениеПараметраЛС = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ЛицевойСчет"));
	Для Каждого ТекСтрока Из ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		Если ТекСтрока.ЛевоеЗначение = ЗначениеПараметраЛС.Поле тогда
			ТекСтрока.ПравоеЗначение = Объект.Ссылка;
			ТекСтрока.Использование  = Истина;
			Прервать;	
		КонецЕсли;	 
	КонецЦикла;	
	// БИТ_ЖКХ 09.09.2014
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ИсторияСчетчиков" коммандной панели КоманднаяПанельСчетчиков. 
////
&НаКлиенте
Процедура ИсторияСчетчиков(Команда)
	
	Если Элементы.ТаблицаСчетчиков.ТекущиеДанные =  Неопределено Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нет установленных счетчиков!");
		
		Возврат;
	Иначе
		
		// БИТ_ЖКХ 17.10.2014
		// ФормаОтчета = ОткрытьФорму("Отчет.бит_СчетчикиНаЛС.Форма.ФормаОтчета",,ЭтаФорма);.
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Счетчик",Элементы.ТаблицаСчетчиков.ТекущиеДанные.Счетчик);
		ПараметрыФормы.Вставить("Услуга",Элементы.ТаблицаСчетчиков.ТекущиеДанные.Услуга);
		ПараметрыФормы.Вставить("ЛицевойСчет",Объект.Ссылка);
		
		ФормаОтчета = ОткрытьФорму("Отчет.бит_СчетчикиНаЛС.Форма.ФормаОтчетаУправляемая",Новый Структура("ИзЛС",ПараметрыФормы),ЭтаФорма);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ДействияФормыID" формы. 
////
&НаКлиенте
Процедура ДействияФормыID(Команда)
	
	Если ЗначениеЗаполнено(Объект.Идентификатор) Тогда
		Текст = "Идентификатор : "+ Строка(Объект.Идентификатор);
	Иначе
		Текст = "Идентификатор не установлен, выполните запись.";
	КонецЕсли; 
	
	#Если Клиент Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ДействияФормыIDЗавершение", ЭтотОбъект), Текст,10, ""+Строка(Объект.ССылка));
	#Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
		
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыIDЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

// БИТ_ЖКХ 28.06.2016 11:20:33 Начало правки... 
&НаКлиенте
Процедура ЕЛС(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЕЛСГИСЖКХ) Тогда
		Текст = "Единый лицевой счет ГИС ЖКХ : "+ Строка(Объект.ЕЛСГИСЖКХ);
	Иначе
		Текст = "ЕЛС ГИС ЖКХ не установлен.";
	КонецЕсли; 
	
	#Если Клиент Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ДействияФормыЕЛСЗавершение", ЭтотОбъект), Текст,10, ""+Строка(Объект.ССылка));
	#Иначе
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
	#КонецЕсли 
	
КонецПроцедуры
// БИТ_ЖКХ 28.06.2016 11:20:36 Конец правки. 

&НаКлиенте
Процедура ДействияФормыЕЛСЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

// Процедура создает новый документ Корректировка показаний счетчиков с видом операции Корректирвка ошибочных показаний.
&НаКлиенте
Процедура КорректировкаПоказаний(Команда)
	
	ТекСтрока = Элементы.ТаблицаСчетчиков.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ПоГрупповымСчетчикам = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам");
	ПоГрупповымСчетчикамСНалИнд = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных");
	
	Если ТекСтрока.СпособРасчета = ПоГрупповымСчетчикам ИЛИ ТекСтрока.СпособРасчета = ПоГрупповымСчетчикамСНалИнд Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Корректировка показаний счетчиков доступна только для индивидуальных счетчиков");
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации"      , ПредопределенноеЗначение("Перечисление.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаОшибочныхПоказаний"));
	ПараметрыФормы.Вставить("Дата"             , ТекущаяДата());
	ПараметрыФормы.Вставить("Организация"      , Объект.Организация);
	ПараметрыФормы.Вставить("Здание"           , Объект.Здание);
	ПараметрыФормы.Вставить("Улица"            , Объект.УлицаЛицевогоСчета);
	
	// БИТ_ЖКХ 07.02.2014
	// ПараметрыФормы.Вставить("Ответственный"    , глЗначениеПеременной("глТекущийПользователь"));.
	ПараметрыФормы.Вставить("Ответственный"    , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	// БИТ_ЖКХ 07.02.2014
	
	ПараметрыФормы.Вставить("ЛицевойСчет"      , Объект.Ссылка);
	ПараметрыФормы.Вставить("Счетчик"          , ТекСтрока.Счетчик);
	ПараметрыФормы.Вставить("Многотарифный"    , ТекСтрока.Многотарифный);
	ПараметрыФормы.Вставить("ИсточникПоказаний", ПредопределенноеЗначение("Перечисление.бит_ИсточникПоказаний.Население"));
	ПараметрыФормы.Вставить("Услуга"           , ТекСтрока.Услуга);
	
	ОткрытьФорму("Документ.бит_КорректировкаПоказанийСчетчиков.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаЛицевыеСчета", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

// Процедура изменяет список биллинговых услуг.
//
&НаКлиенте
Процедура ИзменитьСписокБиллинговыхУслуг(Команда)
	
	СтруктураОснования =  Новый Структура;
	СтруктураОснования.Вставить("Улица"      , Объект.УлицаЛицевогоСчета);
	СтруктураОснования.Вставить("Здание"     , Объект.Здание);
	СтруктураОснования.Вставить("ЛицевойСчет", Объект.Ссылка);
	
	ОткрытьФорму("Документ.бит_бу_УстановкаБиллинговыхУслугНаЛС.ФормаОбъекта", Новый Структура("Основание", СтруктураОснования));
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ВвестиНачисления" страницы "Начисления" "БиллинговыеУслуги". 
////
&НаКлиенте
Процедура ВвестиНачисления(Команда)
	
	СтруктураОснования =  Новый Структура;
	СтруктураОснования.Вставить("Улица"            , Объект.УлицаЛицевогоСчета);
	СтруктураОснования.Вставить("Здание"           , Объект.Здание);
	
	ОткрытьФорму("Документ.бит_бу_НачисленияПоБиллинговымУслугам.ФормаОбъекта", Новый Структура("Основание", СтруктураОснования));
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ВвестиОплату" страницы "Начисления" "БиллинговыеУслуги". 
////
&НаКлиенте
Процедура ВвестиОплату(Команда)
	
	ОткрытьФорму("Документ.бит_бу_ОплатаБиллинговыхУслуг.ФормаОбъекта");
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ВвестиРазовые" страницы "Начисления" "БиллинговыеУслуги". 
////
&НаКлиенте
Процедура ВвестиРазовые(Команда)
	
	ОткрытьФорму("Документ.бит_бу_РазовыеПоБиллинговымУслугам.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыПечатьТекущихНачислений(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед печатью счет-извещений запишите элемент.");
		
		Возврат;
	КонецЕсли;
	
	АдресСтруктурыВХранилище = ПолучитьАдресСтруктурыВХранилище();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСтруктурыВХранилище"           , АдресСтруктурыВХранилище);
	
	Если Параметры.КлючНазначенияИспользования = "АРМКассира" Тогда
		
		Форма = ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаПечатиТекущихНачислений", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаПечатиТекущихНачислений", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоквартирнаяКарточка(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",Объект.Ссылка);
	
	ФормаОтчета = ОткрытьФорму("Отчет.бит_ПоквартирнаяКарточка.Форма.ПоквартирнаяКарточкаУправляемая",Новый Структура("ОткрытьИзЛС",ПараметрыФормы),ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КопияФинансовоЛицевогоСчета(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет", Объект.Ссылка);
	
	ОткрытьФорму("Отчет.бит_КопияФинансовоЛицевогоСчета.Форма.ФормаОтчета", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаИзДомовойКниги(Команда)
	
	// БИТ_ЖКХ 03.03.2014
	// Результат = Сформировать("ВыпискаИзДомовойКниги");.
	// УниверсальныеМеханизмы.НапечататьДокумент(Результат,,,"Выписка из домовой книги");.
	ФормаОтчета = ОткрытьФорму("Отчет.бит_ВыпискаИзДомовойКниги.Форма.ФормаОтчетаУправляемая",,ЭтаФорма);
	
	ФормаОтчета.Отчет.Дата        = ТекущаяДата();
	
	ФормаОтчета.Отчет.ЛицевойСчет = Объект.Ссылка;
	// БИТ_ЖКХ 03.03.2014
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыПечатьПлатежногоДокумента(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед печатью счет-извещений запишите элемент.");
		
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет"       , Объект.Ссылка);
	
	ОткрытьФорму("Обработка.бит_ПечатьСчетИзвещений.Форма.ФормаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаРасчетовПоЛицевомуСчету(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачалоПериода"    , НачалоМесяца(ТекущаяДата()));
	ПараметрыФормы.Вставить("КонецПериода"     , КонецМесяца(ТекущаяДата()));
	ПараметрыФормы.Вставить("ЛицевойСчет"      , Объект.Ссылка);
	ПараметрыФормы.Вставить("СформироватьОтчет", Истина);
	
	ОткрытьФорму("Отчет.бит_КарточкаРасчетовПоЛицевомуСчету.Форма.ФормаОтчета", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаПоПовестке(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет", Объект.Ссылка);
	
	ОткрытьФорму("Отчет.бит_СправкаПоПовестке.Форма.ФормаОтчета", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОДвиженияхНаЛСПомесячно(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет", Объект.Ссылка);
	
	ОткрытьФорму("Отчет.бит_ОтчетОДвиженияхНаЛСПомесячно.Форма.ФормаОтчета", ПараметрыФормы);
	
КонецПроцедуры

// БИТ_ЖКХ 11.09.2014	
&НаКлиенте
Процедура РазвернутьДерево(Команда)
	
	КоллекцияЭлементовДерева=ДеревоНачислений.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоНачислений.Развернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	КоллекцияЭлементовДерева=ДеревоНачислений.ПолучитьЭлементы();
	// Свернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоНачислений.Свернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоУслуг(Команда)
	
	КоллекцияЭлементовДерева=ДеревоНачислений.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоУслуг.Развернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоУслуг(Команда)
	
	КоллекцияЭлементовДерева=ДеревоНачислений.ПолучитьЭлементы();
	// Свернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоУслуг.Свернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
КонецПроцедуры
// БИТ_ЖКХ 11.09.2014	

// Процедура - обработчик события "Нажатие" кнопки "СнятьСчетчик" коммандной панели "КоманднаяПанельСчетчики".
//
&НаКлиенте
Процедура СнятьСчетчик(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика");
	СоздатьДокументУстановкаСнятиеСчетчика(ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицуКомнат();
	ПосчитатьПлощади();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыЖКХ(Команда)
	
	ОбновитьДокументыЖКХНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыРегистрСведенийбит_СведенияОКомнатеОткрытьПоЗначениюКомната(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаКомнатЗначений.ТекущиеДанные;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Комната", ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("РегистрСведений.бит_СведенияОКомнате.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма); 
	
КонецПроцедуры 

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляЛьготы

//  Процедура - обработчик события "ПередНачаломДобавления" табличного поля "Льготы".
//
&НаКлиенте
Процедура ЛьготыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийСтраницыКомнаты

// Процедура сохранения введенных данных по площади в регистре сведений бит_СведенияОКомнате.
// 
&НаКлиенте
Процедура ТаблицаКомнатЗначенийПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаКомнатЗначений.ТекущиеДанные;
	
	Комната = ТекущиеДанные.Ссылка;
	
	Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКомнате(Комната, ТекущаяДата());
	
	бит_ОбщегоНазначения.ИзменитьДанныеОКомнате(Запись, "Площадь", ТекущиеДанные.Площадь);
	
КонецПроцедуры

// Процедура сохранения введенных данных по высоте в регистре сведений бит_СведенияОКомнате.
// 
&НаКлиенте
Процедура ТаблицаКомнатЗначенийВысотаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаКомнатЗначений.ТекущиеДанные;
	
	Комната = ТекущиеДанные.Ссылка;
	
	Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКомнате(Комната, ТекущаяДата());
	
	бит_ОбщегоНазначения.ИзменитьДанныеОКомнате(Запись, "Высота", ТекущиеДанные.Высота);
	
КонецПроцедуры

// Процедура сохранения введенных данных по высоте в регистре сведений бит_СведенияОКомнате.
// 
&НаКлиенте
Процедура ТаблицаКомнатЗначенийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьТаблицуКомнат();
	ПосчитатьПлощади();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПоместитьТаблицуПечатиВХранилище(ТаблицаП)
	
	АдресТаблицуПениВХранилище = ПоместитьВоВременноеХранилище(ТаблицаП, УникальныйИдентификатор);
	
	Возврат АдресТаблицуПениВХранилище;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуПениВХранилище(ТаблицаП)
	
	АдресТаблицуПениВХранилище = ПоместитьВоВременноеХранилище(ТаблицаП, УникальныйИдентификатор);
	
	Возврат АдресТаблицуПениВХранилище;
	
КонецФункции

// Процедура устанавливает отбор для таблицы состава семьи.
//
// Параметры:
//  Параметр1 – Строка.
//
&НаКлиенте
Процедура УстановитьОтборСоставаСемьи(ВыбранноеЗначение)
	
	ТекущаяСтрока = Элементы.Льготы.ТекущиеДанные;
	
	ВладелецЛьготы = ?(ТекущаяСтрока = Неопределено, Неопределено, ТекущаяСтрока.ФизЛицо);
	Льгота         = ?(ТекущаяСтрока = Неопределено, Неопределено, ТекущаяСтрока.Льгота);
	
	Эл = ТаблицаСоставаСемьи.Отбор.ЛицевойСчет;
	
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.Значение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	
	Эл = ТаблицаСоставаСемьи.Отбор.ВладелецЛьготы;
	
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.Значение   = ВладелецЛьготы;
	Эл.Использование    = Истина;
	
	Эл = ТаблицаСоставаСемьи.Отбор.Льгота;
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.Значение   = Льгота;
	Эл.Использование    = Истина;
	
	ПрочитатьДанныеПолучательЛьготыНаСервере();
	
КонецПроцедуры // () 

// БИТ_ЖКХ 23.12.2011 Выводит сумму долга по лицевому счету.
//
&НаСервере
Функция ВывестиСуммуДолгаПоЛС()
	
	ДатаДолга = ПолучитьДатуДолга(Объект.Организация, ТекущаяДата());
	
	// Определим сумму долга по начислениям для текущего лицевого счета.
	ЗапросПоНачислениям = Новый Запрос;
	ЗапросПоНачислениям.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	ЗапросПоНачислениям.УстановитьПараметр("ЛицевойСчет" , Объект.Ссылка);
	ЗапросПоНачислениям.УстановитьПараметр("ДатаДолга"   , ДатаДолга);
	ЗапросПоНачислениям.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|		СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаДолга {(&ДатаДолга)}, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет) КАК Долг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|						ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Оплата,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|						ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Разовые
	|		ИЗ
	|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(НАЧАЛОПЕРИОДА(&ДатаДолга, МЕСЯЦ) {(&ДатаДолга)}, &КонецПериода {(&КонецПериода)}, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ОплатаСДатыДолга
	|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет";
	
	тмпДолг = 0;
	
	Выборка = ЗапросПоНачислениям.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		тмпДолг = Выборка.Долг;
	КонецЕсли;
	
	Если тмпДолг > 0 Тогда
		ИнфСтрока = "Долг = " + Строка(тмпДолг);
		ЦветНадписи = Новый Цвет(255, 0, 0); // Красный.

	Иначе
		ИнфСтрока = "Долг = 0";
		ЦветНадписи = Новый Цвет(0, 0, 0);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СтрокаДолга", ИнфСтрока);
	СтруктураВозврата.Вставить("ЦветНадписи", ЦветНадписи);
	
	Возврат СтруктураВозврата;
	
КонецФункции  //ВывестиСуммуДолгаПоЛС()

// Функция фозвращает дату долга.
//
// Параметры:
//  Организация  - СправочникСсылка - фильтр к запросу.
//
//  Дата         - Дата             - фильтр к запросу.
//
// Возвращаемое значение:
//   Дата   - текущая дата долга.
//
&НаСервере
Функция ПолучитьДатуДолга(Организация, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(ВЫБОР
	|				КОГДА ДЕНЬ(&Дата) > бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДата(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции // ()

&НаСервере
Процедура ОбновитьНастройкиЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"          , Ложь);
	ПараметрыЖКХ.Вставить("ВыводитьЛьготыНаСчетИзвещение"      , Ложь);
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"         , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта", Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"    , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьУлица"                    , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьДом"                      , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьКорпус"                   , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьКвартира"                 , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьРайон"                    , Ложь);
	ПараметрыЖКХ.Вставить("ПрефиксУлица"                       , "");
	ПараметрыЖКХ.Вставить("ПрефиксДом"                         , "");
	ПараметрыЖКХ.Вставить("ПрефиксКорпус"                      , "");
	ПараметрыЖКХ.Вставить("ПрефиксКвартира"                    , "");
	ПараметрыЖКХ.Вставить("ПрефиксРайон"                       , "");
	ПараметрыЖКХ.Вставить("НомерПолучателяПоБанку"             , 0);
	ПараметрыЖКХ.Вставить("ИспользоватьНомерПолучателяВШК"     , Ложь);
	
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	// БИТ_ЖКХ_04102013_начало_изменений
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	// БИТ_ЖКХ_04102013_окончание_изменений
	
	// БИТ_ЖКХ 24.05.2017 11:42:05 Начало правки...
	ПараметрыЖКХ.Вставить("ОптимизацияЛС"						, Ложь);
	// БИТ_ЖКХ 24.05.2017 11:42:05 Конец правки.
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(ТекущаяДата(), Объект.Организация, ПараметрыЖКХ);
	
	мКэшЗначений.мЛьготаПерсонифицированная           = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	
	мКэшЗначений.мВыводитьЛьготыНаСчетИзвещение       = ПараметрыЖКХ.ВыводитьЛьготыНаСчетИзвещение;
	мКэшЗначений.мРасчетСУчетомДолейВладения          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мКэшЗначений.мУменьшениеНормыЛьготыВПределахФакта = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	мКэшЗначений.мНачислениеСУчетомДнейПроживания     = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	мКэшЗначений.мНеПечататьУлица                     = ПараметрыЖКХ.НеПечататьУлица;
	мКэшЗначений.мНеПечататьДом                       = ПараметрыЖКХ.НеПечататьДом;
	мКэшЗначений.мНеПечататьКорпус                    = ПараметрыЖКХ.НеПечататьКорпус;
	мКэшЗначений.мНеПечататьКвартира                  = ПараметрыЖКХ.НеПечататьКвартира;
	мКэшЗначений.мНеПечататьРайон                     = ПараметрыЖКХ.НеПечататьРайон;
	мКэшЗначений.мПрефиксУлица                        = ПараметрыЖКХ.ПрефиксУлица;
	мКэшЗначений.мПрефиксДом                          = ПараметрыЖКХ.ПрефиксДом;
	мКэшЗначений.мПрефиксКорпус                       = ПараметрыЖКХ.ПрефиксКорпус;
	мКэшЗначений.мПрефиксКвартира                     = ПараметрыЖКХ.ПрефиксКвартира;
	мКэшЗначений.мПрефиксРайон                        = ПараметрыЖКХ.ПрефиксРайон;
	мКэшЗначений.мНомерПолучателяПоБанку              = ПараметрыЖКХ.НомерПолучателяПоБанку;
	мКэшЗначений.мИспользоватьНомерПолучателяВШК      = ПараметрыЖКХ.ИспользоватьНомерПолучателяВШК;
	
	мКэшЗначений.мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика;
	
	// БИТ_ЖКХ_04102013_начало_изменений
	мКэшЗначений.мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	// БИТ_ЖКХ_04102013_окончание_изменений
	
	// БИТ_ЖКХ 24.05.2017 11:42:27 Начало правки...
	мКэшЗначений.мОптимизацияЛС							= ПараметрыЖКХ.ОптимизацияЛС;
	// БИТ_ЖКХ 24.05.2017 11:42:27 Конец правки.
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКомнат()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_Комнаты.Ссылка.Наименование КАК Наименование,
	|	бит_Комнаты.Ссылка.НомерКомнаты КАК НомерКомнаты,
	|	бит_СведенияОКомнатеСрезПоследних.Высота,
	|	бит_СведенияОКомнатеСрезПоследних.Площадь,
	|	бит_Комнаты.Ссылка.Владелец КАК Владелец,
	|	ВЫБОР
	|		КОГДА бит_Комнаты.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерКартинки,
	|	бит_Комнаты.Ссылка КАК Ссылка,
	|	бит_Комнаты.Ссылка КАК Комната,
	|	бит_Комнаты.ЧастьПомещения
	|ИЗ
	|	Справочник.бит_Комнаты КАК бит_Комнаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКомнате.СрезПоследних(&Момент, Комната.Владелец = &Владелец) КАК бит_СведенияОКомнатеСрезПоследних
	|		ПО (бит_СведенияОКомнатеСрезПоследних.Комната = бит_Комнаты.Ссылка)
	|ГДЕ
	|	бит_Комнаты.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Квартира);
	Запрос.УстановитьПараметр("Момент"  , ТекущаяДата());
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаписей.Количество() > 0 Тогда 
		
		ТаблицаКомнатЗначений.Загрузить(ТаблицаЗаписей);
		
	КонецЕсли;
	
	ТаблицаКомнатЗначений.Сортировать("НомерКомнаты Возр");
	
	Модифицированность = Ложь;
	
КонецПроцедуры

// БИТ_ЖКХ 05.05.2017 9:59:31 Начало правки... Проверка модулей (не используется).
//// Функция возвращает ПравоДобавления.
////
//&НаСервере
//Функция ПравоДобавления()
//	
//	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
//	
//	Справочник = СправочникОбъект.Метаданные();
//	
//	ПравоДобавления = ПравоДоступа("Добавление", Справочник);
//	Возврат ПравоДобавления;
//	
//КонецФункции
// БИТ_ЖКХ 05.05.2017 9:59:34 Конец правки. 

// Процедура устанавливает доступ к элементам формы.
//
&НаСервере
Процедура УстановитьПраваДоступаКЭлементамФормыНаСервере()
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	Справочник = СправочникОбъект.Метаданные();
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("Этаж");
	МассивЭлементов.Добавить("КоличествоКомнат");
	МассивЭлементов.Добавить("ТипКвартиры");
	МассивЭлементов.Добавить("СтатусКвартиры");
	МассивЭлементов.Добавить("ОбщаяПлощадь");
	МассивЭлементов.Добавить("ЖилаяПлощадь");
	МассивЭлементов.Добавить("МОП");
	МассивЭлементов.Добавить("ОтапливаемаяПлощадь");
	МассивЭлементов.Добавить("СовокупнаяПлощадь");
	МассивЭлементов.Добавить("Постоянно");
	МассивЭлементов.Добавить("Времменно");
	МассивЭлементов.Добавить("ВсегоПроживающих");
	МассивЭлементов.Добавить("Услуги");
	МассивЭлементов.Добавить("ДеревоУслуг");
	МассивЭлементов.Добавить("ТаблицаПроживающих");
	МассивЭлементов.Добавить("Льготы");
	МассивЭлементов.Добавить("СписокВведРазовых");
	МассивЭлементов.Добавить("ТаблицаСчетчиков");
	МассивЭлементов.Добавить("ТаблицаЗамечаний");
	МассивЭлементов.Добавить("ТаблицаЗависимыеЛС");
	МассивЭлементов.Добавить("ТипЗапирающегоУстройства");
	МассивЭлементов.Добавить("ТипПлиты");
	МассивЭлементов.Добавить("БиллинговыеУслуги");
	МассивЭлементов.Добавить("ТабличноеПолеНачисленияБиллинговыхУслуг");
	МассивЭлементов.Добавить("ТаблицаКомнат");
	// БИТ_ЖКХ_17012014_начало_изменений
	МассивЭлементов.Добавить("ЖилоеПомещениеСпециализированногоЖилищногоФонда");
	// БИТ_ЖКХ_17012014_окончание_изменений
	
	бит_ОбщегоНазначения.УстановитьПраваДоступаКЭлементамФормы(Справочник, МассивЭлементов, Элементы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицыРегистров()
	
	Эл = ТаблицаЗамечаний.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ЛицевойСчет");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Эл = ТаблицаЗависимыеЛС.Отбор.ЛицевойСчет;
	
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.Значение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеНабораЗаписейНаСервере()
	
	ТаблицаЗависимыеЛСОбъект = ДанныеФормыВЗначение(ТаблицаЗависимыеЛС, Тип("РегистрСведенийНаборЗаписей.бит_ЗависимыеЛС"));
	// БИТ_ЖКХ 31.10.2016 10:34:35 Начало правки... 
	ТаблицаЗависимыеЛСОбъект.Отбор.ЛицевойСчет.Установить(Объект.Ссылка);
	// БИТ_ЖКХ 31.10.2016 10:34:36 Конец правки. 
	ТаблицаЗависимыеЛСОбъект.Прочитать();
	
	ТаблицаЗависимыеЛС.Очистить();
	Для каждого Запись Из ТаблицаЗависимыеЛСОбъект Цикл
		НоваяСтрока = ТаблицаЗависимыеЛС.Добавить();
		НоваяСтрока.ЛицевойСчет = Запись.ЛицевойСчет;
		НоваяСтрока.ЛицевойСчетЗависимый = Запись.ЛицевойСчетЗависимый;
		
	КонецЦикла;
	
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуПениНаСервере()
	
	Запрос = Новый Запрос;
	// БИТ_ЖКХ 03.03.2016 15:03:50 Начало правки... 
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТаблицаНачислений.Услуга
	//|ПОМЕСТИТЬ ТаблицаНачислений
	//|ИЗ
	//|	&ТаблицаНачислений КАК ТаблицаНачислений
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//// БИТ_ЖКХ 15.01.2016 13:40:54 Начало правки... 
	////|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Процент, 0) КАК ПроцентПени,
	//// БИТ_ЖКХ 15.01.2016 13:40:58 Конец правки. 
	//|	ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток, 0) КАК Сумма,
	//|	ТаблицаНачислений.Услуга
	//|ИЗ
	//|	ТаблицаНачислений КАК ТаблицаНачислений
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Дата, ЛицевойСчет = &ЛС) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	//|		ПО ТаблицаНачислений.Услуга = бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_ПениПоУслугамЖКХСрезПоследних
	//|		ПО ТаблицаНачислений.Услуга = бит_ПениПоУслугамЖКХСрезПоследних.Услуга
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ТаблицаНачислений";
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНачислений.Услуга
	|ПОМЕСТИТЬ ТаблицаНачислений
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНачислений.Услуга,
	|	ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток, 0) КАК Сумма
	|ИЗ
	|	ТаблицаНачислений КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Дата, ЛицевойСчет = &ЛС) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	|		ПО ТаблицаНачислений.Услуга = бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|		ПО ТаблицаНачислений.Услуга = бит_ПениПоУслугамЖКХСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаНачислений";
	// БИТ_ЖКХ 03.03.2016 15:03:54 Конец правки. 
	Запрос.УстановитьПараметр("Дата"  , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛС"    , Объект.Ссылка);
	
	ТаблицаН = ДанныеФормыВЗначение(ТаблицаНачислений, Тип("ТаблицаЗначений"));
	
	Запрос.УстановитьПараметр("ТаблицаНачислений", ТаблицаН);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресСтруктурыВХранилище()
	
	Возврат АдресСтруктурыВХранилище;	
	
КонецФункции

&НаСервере
Функция ПоместитьСтруктуруВХранилище(мСтруктураДанных,мТаблицаПечати,мТаблицаПечатиСчетчиков,мТаблицаПерерасчетов,мТаблицаСвойств,мТаблицаОбщедомовыхСчетчиков)
	
	Обработка = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет"           , Объект.Ссылка);
	ПараметрыФормы.Вставить("СтруктураДанных"       , мСтруктураДанных);
	
	ПараметрыФормы.Вставить("ТаблицаПечати"         , мТаблицаПечати);
	ПараметрыФормы.Вставить("ТаблицаПечатиСчетчиков", мТаблицаПечатиСчетчиков);
	ПараметрыФормы.Вставить("ТаблицаПерерасчетов"   , мТаблицаПерерасчетов);
	
	// БИТ_ЖКХ 29.09.2014
	ПараметрыФормы.Вставить("ТаблицаСвойств"   , мТаблицаСвойств);
	// БИТ_ЖКХ 29.09.2014
	
	// БИТ_ЖКХ 09.02.2015{{
	ПараметрыФормы.Вставить("ТаблицаОбщедомовыхСчетчиков"   , мТаблицаОбщедомовыхСчетчиков);
	// БИТ_ЖКХ 09.02.2015}}
	
	АдресСтруктурыВХранилище = ПоместитьВоВременноеХранилище(ПараметрыФормы, УникальныйИдентификатор);
	
	Возврат АдресСтруктурыВХранилище;
	
КонецФункции

&НаСервере
Функция ИзменитьСписокПредоставляемыхУслугНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_УстановкаИзменениеУслугПоЛС.Ссылка,
	|	бит_УстановкаИзменениеУслугПоЛС.Дата КАК Дата
	|ИЗ
	|	Документ.бит_УстановкаИзменениеУслугПоЛС КАК бит_УстановкаИзменениеУслугПоЛС
	|ГДЕ
	|	бит_УстановкаИзменениеУслугПоЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_УстановкаИзменениеУслугПоЛС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет)
	|	И бит_УстановкаИзменениеУслугПоЛС.Дата >= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЛицевойСчет"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата"		, НачалоМесяца(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда 
		
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("СправочникОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Функция ПолучитьСписокКодовЧиселНаСервере()
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	СписокКодовЧисел = СправочникОбъект.СписокКодовЧисел;
	
	Возврат СписокКодовЧисел;
	
КонецФункции

&НаСервере
Функция ПолучитьКорпусЗданияНаСервере(Здание)
	
	Возврат Здание.Корпус;	
	
КонецФункции

&НаСервере
Функция ИзменитьСписокПроживающихНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегистрацияПроживающихПоЛС.Ссылка,
	|	РегистрацияПроживающихПоЛС.Дата КАК Дата
	|ИЗ
	|	Документ.бит_РегистрацияПроживающихПоЛС КАК РегистрацияПроживающихПоЛС
	|ГДЕ
	|	РегистрацияПроживающихПоЛС.ЛицевойСчет = &ЛицевойСчет
	|	И РегистрацияПроживающихПоЛС.Дата >= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЛицевойСчет"	, Объект.Ссылка);
	// БИТ_ЖКХ
	// Новый месяц - новый документ. 
	// Корректировка старых документов(больше чем месяц) может отразиться на истории начислений. 
	Запрос.УстановитьПараметр("Дата"		, НачалоМесяца(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыФормы = Новый Структура;
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СправкаОСоставеСемьиНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СправкаОСоставеСемьи.Ссылка,
	|	СправкаОСоставеСемьи.Дата КАК Дата
	|ИЗ
	|	Документ.бит_СправкаОСоставеСемьи КАК СправкаОСоставеСемьи
	|ГДЕ
	|	СправкаОСоставеСемьи.ЛицевойСчет = &ЛицевойСчет
	|	И СправкаОСоставеСемьи.Дата >= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЛицевойСчет"	, Объект.Ссылка);
	// БИТ_ЖКХ
	// Новый месяц - новый документ. 
	// Корректировка старых документов(больше чем месяц) может отразиться на истории начислений. 
	Запрос.УстановитьПараметр("Дата"		, НачалоМесяца(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда

		Возврат Выборка.Ссылка;
		
	иначе
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция РегистрацияЛьготНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_РегистрацияЛьготПоЛС.Ссылка,
	|	бит_РегистрацияЛьготПоЛС.Дата
	|ИЗ
	|	Документ.бит_РегистрацияЛьготПоЛС КАК бит_РегистрацияЛьготПоЛС
	|ГДЕ
	|	бит_РегистрацияЛьготПоЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_РегистрацияЛьготПоЛС.Дата >= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_РегистрацияЛьготПоЛС.Дата";
	
	Запрос.УстановитьПараметр("ЛицевойСчет"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата"		, НачалоМесяца(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		
		Возврат Выборка.Ссылка;
		
	иначе
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Процедура содает новый документ "Установка\снятие счетчика" с переданным видом операции.
//
// Параметры:
//
// <ВидОперации> - тип: ПеречиислениеСсылка  - Перечисление бит_ВидыОперацийУстановкаСчетчика.
//
&НаКлиенте
Процедура СоздатьДокументУстановкаСнятиеСчетчика(ВидОперации)
	
	Если НЕ ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.бит_ВидыОперацийУстановкаСчетчика") Тогда
		ВидОперации = Неопределено;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ВидОперации);
	ПараметрыФормы.Вставить("Объект"     , Объект.Ссылка);
	ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
	
	ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочника", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

// БИТ_ЖКХ 05.02.2015{{
&НаСервере
Процедура ОбновитьТаблицуЗависимыеЛС()
	
	Эл = ТаблицаЗависимыеЛС.Отбор.ЛицевойСчет;
	
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.Значение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	
КонецПроцедуры
// БИТ_ЖКХ 05.02.2015}}

&НаКлиенте
Процедура ОбновитьТаблицуЗамечания()
	
	Эл = ТаблицаЗамечаний.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ЛицевойСчет");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

// БИТ_ЖКХ 28.05.2014
&НаСервере
Процедура ЗаполнитьТаблицуОсновнойЛС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗависимыеЛС.ЛицевойСчет,
	|	бит_ЗависимыеЛС.ЛицевойСчетЗависимый
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	|ГДЕ
	|	бит_ЗависимыеЛС.ЛицевойСчетЗависимый = &ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ЛицевойСчет",Объект.Ссылка);	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТаблицаОсновнойЛС.Очистить();
		НоваяСтрока = ТаблицаОсновнойЛС.Добавить();
		НоваяСтрока.ЛицевойСчет = ВыборкаДетальныеЗаписи.ЛицевойСчет;
		
	КонецЦикла;
	
КонецПроцедуры

// Служебная процедура для заполнения колонки "Адрес" табличного поля "ТаблицаЗависимыеЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиАдрес()
	
	СписокЛС = Новый СписокЗначений;	
	
	Для Каждого Эл из ТаблицаЗависимыеЛС Цикл
		
		СписокЛС.Добавить(Эл.ЛицевойСчетЗависимый);	
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",СписокЛС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из ТаблицаЗависимыеЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчетЗависимый,"ЛицевойСчет") Тогда
			
			Стр.Адрес = Строка(Выборка.УлицаЛицевогоСчета) + ", д. " + Строка(Выборка.Здание) + ?(ПустаяСтрока(Выборка.Корпус),"",", кор. " + Строка(Выборка.Корпус)) + ", кв. " + Строка(Выборка.Квартира);
			
		Иначе
			
			Стр.Адрес = "";
			
		КонецЕсли;
		
		Выборка.Сбросить();
		
	КонецЦикла;
	
КонецПроцедуры

// Служебная процедура для заполнения колонки "Ответственный" табличного поля "ТаблицаЗависимыеЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиОтветственный()
	
	СписокЛС = Новый СписокЗначений;	
	
	Для Каждого Эл из ТаблицаЗависимыеЛС Цикл
		
		СписокЛС.Добавить(Эл.ЛицевойСчетЗависимый);	
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",СписокЛС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из ТаблицаЗависимыеЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчетЗависимый,"ЛицевойСчет") Тогда
			
			Стр.Ответственный = ОтветственныйНаЛС(Стр.ЛицевойСчетЗависимый);
			
		Иначе
			
			Стр.Ответственный = "";
			
		КонецЕсли;
		
		Выборка.Сбросить();
		
	КонецЦикла;
	
КонецПроцедуры

// БИТ_ЖКХ 28.05.2014
// Служебная процедура для заполнения колонки "Адрес" табличного поля "ТаблицаЗависимыеЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиАдресДляОсновногоЛС()
	
	СписокЛС = Новый СписокЗначений;	
	
	Для Каждого Эл из ТаблицаОсновнойЛС Цикл
		
		СписокЛС.Добавить(Эл.ЛицевойСчет);	
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",СписокЛС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из ТаблицаОсновнойЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчет,"ЛицевойСчет") Тогда
			
			Стр.Адрес = Строка(Выборка.УлицаЛицевогоСчета) + ", д. " + Строка(Выборка.Здание) + ?(ПустаяСтрока(Выборка.Корпус),"",", кор. " + Строка(Выборка.Корпус)) + ", кв. " + Строка(Выборка.Квартира);
			
		Иначе
			
			Стр.Адрес = "";
			
		КонецЕсли;
		
		Выборка.Сбросить();
		
	КонецЦикла;
	
КонецПроцедуры

// Служебная процедура для заполнения колонки "Ответственный" табличного поля "ТаблицаЗависимыеЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиОтветственныйДляОсновногоЛС()
	
	СписокЛС = Новый СписокЗначений;	
	
	Для Каждого Эл из ТаблицаОсновнойЛС Цикл
		
		СписокЛС.Добавить(Эл.ЛицевойСчет);	
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",СписокЛС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из ТаблицаОсновнойЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчет,"ЛицевойСчет") Тогда
			
			Стр.Ответственный = ОтветственныйНаЛС(Стр.ЛицевойСчет);
			
		Иначе
			
			Стр.Ответственный = "";
			
		КонецЕсли;
		
		Выборка.Сбросить();
		
	КонецЦикла;
	
КонецПроцедуры
// БИТ_ЖКХ 28.05.2014

&НаСервере
Функция ЗапросДляРасшифровкиРазовыхНаСервере(Услуга)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка КАК Документ,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Сумма
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ.СписокУслуг КАК бит_РазовыеПоУслугамЖКХСписокУслуг
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|	И бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|	И бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга = &Услуга
	|	И бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.ЛицевойСчет = &ЛицевойСчет";
	Запрос.УстановитьПараметр("Дата"        ,ТекущаяДата());
	Запрос.УстановитьПараметр("Услуга"      ,Услуга);
	Запрос.УстановитьПараметр("ЛицевойСчет" ,Объект.Ссылка);
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуРасшифровкиСчетчиковВХранилище()
	
	ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаСчетчиков");
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТаблицаРасшифровкиИзРеквизитаФормы, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуРасшифровкиВХранилище()
	
	ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаНачислений");
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТаблицаРасшифровкиИзРеквизитаФормы, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

&НаСервере
Функция ПолучитьТипСчетчикаНаСервере(ТекСчетчик)
	
	Возврат ТекСчетчик.ТипСчетчика;
	
КонецФункции

&НаСервере
Функция ПолучитьКоэффициентУмноженияНаСервере(ТекСчетчик)
	
	Возврат ТекСчетчик.КоэффициентУмножения;
	
КонецФункции

&НаСервере
Функция ВыбратьГрупповыеСчетчикиИзЗапросаНаСервере(Услуга)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"	, ТекущаяДата());
	Запрос.УстановитьПараметр("Здание"	, Объект.Здание);
	Запрос.УстановитьПараметр("Услуга"	, Услуга);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Групповой
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Здание
	|				И Услуга = &Услуга
	|				И ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)) КАК бит_СчетчикиНаУслугахСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат  Истина;
	Иначе
		Возврат  Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЛьготыПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСоставаСемьи(Неопределено);
	
КонецПроцедуры

&НаСервере
Функция СовокупнаяПлощадьПриИзмененииНаСервере()
	
	Попытка	
		
		СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		СправочникОбъект.ИзменитьДанныеКвартиры("СовокупнаяПлощадь",СовокупнаяПлощадь);
		
		ЗаполнитьОписания();
		
		Возврат Ложь;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Откройте форму заново для редактирования данных");
		
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ОтапливаемаяПлощадьПриИзмененииНаСервере()
	
	Попытка	
		
		СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		СправочникОбъект.ИзменитьДанныеКвартиры("ОтапливаемаяПлощадь",ОтапливаемаяПлощадь);
		
		ЗаполнитьОписания();
		
		Возврат Ложь;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Откройте форму заново для редактирования данных");
		
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция МОППриИзмененииНаСервере()
	
	Попытка	
		
		СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		СправочникОбъект.ИзменитьДанныеКвартиры("МОП",МОП);
		
		ЗаполнитьОписания();
		
		Возврат Ложь;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Откройте форму заново для редактирования данных");
		
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ЖилаяПлощадьПриИзмененииНаСервере()
	
	Попытка	
		
		СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		СправочникОбъект.ИзменитьДанныеКвартиры("ЖилаяПлощадь",ЖилаяПлощадь);
		
		ЗаполнитьОписания();
		
		Возврат Ложь;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Откройте форму заново для редактирования данных");
		
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ОбщаяПлощадьПриИзмененииНаСервере()
	
	Попытка	
		
		СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		СправочникОбъект.ИзменитьДанныеКвартиры("ОбщаяПлощадь",ОбщаяПлощадь);
		
		ЗаполнитьОписания();
		
		Возврат Ложь;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Откройте форму заново для редактирования данных");
		
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

// Процедура получает объект из данных формы и записывает объект
//
&НаСервере
Процедура ЗаписатьОбъект()
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	Попытка
		
		СправочникОбъект.Записать();
		
		мКэшЗначений.ЭтоНовый = Ложь;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не удалось записать объект """ + СправочникОбъект + """!
		|" + ОписаниеОшибки());
		
	КонецПопытки;
	
	ЗначениеВДанныеФормы(СправочникОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументыЖКХНаСервере()
	
	Если НЕ Объект.Ссылка.пустая() Тогда
		
		СписокДокументовЛицевогоСчета = КритерииОтбора.бит_ДокументыПоЛицевомуСчету.Найти(Объект.Ссылка);
		
		ДокументыЖКХ.Параметры.УстановитьЗначениеПараметра("Ссылка", СписокДокументовЛицевогоСчета);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКвартираНомерКомнатыНаСервере(Квартира)
	
	Возврат Квартира.НомерКомнаты;
	
КонецФункции

&НаСервере
Функция ПолучитьКвартираЧастьПомещенияНаСервере(Квартира)
	
	Возврат Квартира.ЧастьПомещения;
	
КонецФункции

&НаСервере
Функция ПолучитьКвартираНаименованиеНаСервере(Квартира)
	
	Возврат Квартира.Наименование;
	
КонецФункции

&НаСервере
Функция ПометитьКомнатуНаУдалениеНаСервере(Знач Ссылка)
	
	ОбъектКомнаты = Ссылка.ПолучитьОбъект();
	
	ОбъектКомнаты.ПометкаУдаления = Истина;
	
	Попытка
		
		ОбъектКомнаты.Записать();
		
		Возврат Истина;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция СнятьКомнатуСПометкиНаУдалениеНаСервере(Знач Ссылка)
	
	ОбъектКомнаты = Ссылка.ПолучитьОбъект();
	
	ОбъектКомнаты.ПометкаУдаления = Ложь;
	
	Попытка
		
		ОбъектКомнаты.Записать();
		
		Возврат Истина;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ВыбратьЗависимыйЛСНаСервере(ВыбранноеЗначение)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", ВыбранноеЗначение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗависимыеЛС.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	|ГДЕ
	|	бит_ЗависимыеЛС.ЛицевойСчетЗависимый = &ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выбраный лицевой счет является зависимым у ЛС: " + Выборка.ЛицевойСчет + " и не может быть зависимым.");
		
		СтандартнаяОбработка = Ложь;
		Возврат Истина;
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗависимыеЛС.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	|ГДЕ
	|	бит_ЗависимыеЛС.ЛицевойСчет = &ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выбраный лицевой счет имеет зависимые ЛС и не может быть зависимым.");
		
		Возврат Истина;
	КонецЕсли;
	
	Если ВыбранноеЗначение = Объект.Ссылка Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выбран собственый лицевой счет.");
		
		Возврат Истина;
	КонецЕсли; 
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПроживающихНаСервере()
	
	ТаблицаП = ДанныеФормыВЗначение(ТаблицаПроживающих, Тип("ТаблицаЗначений"));
	
	СписокПроживающих = ТаблицаП.ВыгрузитьКолонку("ФизЛица");
	
	Возврат СписокПроживающих;	
	
КонецФункции

&НаСервере
Процедура ПрочитатьДанныеПолучательЛьготыНаСервере()
	
	ТаблицаСоставаСемьиОбъект = ДанныеФормыВЗначение(ТаблицаСоставаСемьи, Тип("РегистрСведенийНаборЗаписей.бит_СписокСемейнойЛьготы"));
	ТаблицаСоставаСемьиОбъект.Отбор.ЛицевойСчет.Установить(Объект.Ссылка);  // БИТ_ЖКХ 31.10.2016 10:55:06 
	ТаблицаСоставаСемьиОбъект.Прочитать();
	
	ТаблицаСоставаСемьи.Очистить();
	Для каждого Запись Из ТаблицаСоставаСемьиОбъект Цикл
		НоваяСтрока = ТаблицаСоставаСемьи.Добавить();
		НоваяСтрока.ПолучательЛьготы = Запись.ПолучательЛьготы;
		НоваяСтрока.ВладелецЛьготы = Запись.ВладелецЛьготы;
		НоваяСтрока.ЛицевойСчет = Запись.ЛицевойСчет;
		НоваяСтрока.Льгота = Запись.Льгота;
		НоваяСтрока.СтепеньРодства = Запись.СтепеньРодства;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДанныеКвартиры(Знач Реквизит, Знач Значение)
	
	Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Объект.Квартира, ТекущаяДата());
	
	бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, Реквизит, Значение);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаписьРегистраСведений()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_ЗамечанияПоЛС.Номер,
	|	бит_ЗамечанияПоЛС.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_ЗамечанияПоЛС КАК бит_ЗамечанияПоЛС
	|ГДЕ
	|	бит_ЗамечанияПоЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_ЗамечанияПоЛС.ДатаЗаписи = &ДатаЗаписи");
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаЗаписи",  НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Новый Структура;
		
		Результат.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		Результат.Вставить("Номер"      , Выборка.Номер);
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// БИТ_ЖКХ 28.03.2014
// Перенесен из процедуры ПриСозданииНаСервере и ПриОткрытии(оптимизация задержек).
&НаКлиенте
Процедура Группа3ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Заголовок = "Журнал документов" Тогда
		
		ОбновитьДокументыЖКХНаСервере();
		
	ИначеЕсли ТекущаяСтраница.Заголовок = "Данные по счетчикам" или ТекущаяСтраница.Заголовок = "Доп. информация" Тогда
		
		ПосчитатьПлощади();
		ОбновитьТаблицуЗамечания();
		
	ИначеЕсли ТекущаяСтраница.Заголовок = "Льготы" Тогда
		
		ПрочитатьДанныеПолучательЛьготыНаСервере();
		
	ИначеЕсли ТекущаяСтраница.Заголовок = "Список введенных разовых" Тогда
		
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 28.03.2014

&НаСервере
Процедура ИтогиНаСервере(ТаблицаНач)
	
	Элементы.ТаблицаНачислений.ПодчиненныеЭлементы.ТаблицаНачисленийЛьгота.ТекстПодвала         = Формат(ТаблицаНач.Итог("Льгота")        , "ЧДЦ=2");
	
	Элементы.ТаблицаНачислений.ПодчиненныеЭлементы.ТаблицаНачисленийОплата.ТекстПодвала         = Формат(ТаблицаНач.Итог("Оплата")        , "ЧДЦ=2");
	
	Элементы.ТаблицаНачислений.ПодчиненныеЭлементы.ТаблицаНачисленийСальдоНаНачало.ТекстПодвала = Формат(ТаблицаНач.Итог("СальдоНаНачало"), "ЧДЦ=2");
	
	Элементы.ТаблицаНачислений.ПодчиненныеЭлементы.ТаблицаНачисленийНачислено.ТекстПодвала      = Формат(ТаблицаНач.Итог("Начислено")     , "ЧДЦ=2");
	
	Элементы.ТаблицаНачислений.ПодчиненныеЭлементы.ТаблицаНачисленийРазовые.ТекстПодвала        = Формат(ТаблицаНач.Итог("Разовые")       , "ЧДЦ=2");
	
	Элементы.ТаблицаНачислений.ПодчиненныеЭлементы.ТаблицаНачисленийКОплате.ТекстПодвала        = Формат(ТаблицаНач.Итог("КОплате")       , "ЧДЦ=2");
	
КонецПроцедуры

// Процедура дополняет таблицу значений поставщиками.
//
&НаСервере
Процедура ДополнитьТаблицуПоставщиками()
	
	ТаблицаПечатиИзФормыЭлемента  = ПолучитьИзВременногоХранилища(АдресТаблицыПечатиВХранилище);
	
	Если ТаблицаПечатиИзФормыЭлемента = Неопределено ИЛИ ТаблицаПечатиИзФормыЭлемента.Количество()<= 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СписокУслуг = ТаблицаПечатиИзФормыЭлемента.ВыгрузитьКолонку("Услуга");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Услуга В (&СписокУлсуг)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	(НЕ бит_СведенияПоУслугамЛССрезПоследних.Поставщик ЕСТЬ NULL )";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокУлсуг", СписокУслуг);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаПечатиИзФормыЭлемента.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	
	Пока Выборка.Следующий() Цикл
		
		Строка = ТаблицаПечатиИзФормыЭлемента.Найти(Выборка.Услуга, "Услуга");
		
		Если Строка <> Неопределено Тогда
			
			Строка.Поставщик = Выборка.Поставщик;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Функция Получение ответственного на выбранном ЛС.
// Параметры:
//  <ЛицевойСчет> – <Справочник.бит_ЛицевыеСчета> – для получения ответственного по ЛС.
//
// Возвращаемое значение:
//   <ТаблицаЗначений.Строка> – <строка с ответственным по ЛС>.
//
&НаСервере
Функция ОтветственныйНаЛС(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ЛицевыеСчета.Ссылка
	|				ИЗ
	|					Справочник.бит_ЛицевыеСчета КАК ЛицевыеСчета
	|				ГДЕ
	|					ЛицевыеСчета.Ссылка = &ЛицевойСчет)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("Момент", 	 ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()> 0 Тогда
		
		РезультатФизЛицо = Результат[0].ФизЛицо
	Иначе
		РезультатФизЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФизЛицо;
	
КонецФункции // 

// Процедура заполняет биллинговые услуги.
//
&НаСервере
Процедура ЗаполнитьБиллинговыеУслуги()
	
	ТабличноеПолеНачисленияБиллинговыхУслуг.Очистить();
	БиллинговыеУслуги.Очистить();
	
	Запрос = Новый Запрос;
	МВТ    = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.РежимПотребления,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать
	|ПОМЕСТИТЬ СведенияОбУслугах
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(
	|			&Момент,
	|			Организация = &Организация
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_бу_НачисленияБиллинговыхУслугОстатки.Услуга,
	|	СУММА(бит_бу_НачисленияБиллинговыхУслугОстатки.СуммаОстаток) КАК Сальдо
	|ПОМЕСТИТЬ ВходящееСальдо
	|ИЗ
	|	РегистрНакопления.бит_бу_НачисленияБиллинговыхУслуг.Остатки(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			Организация = &Организация
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_бу_НачисленияБиллинговыхУслугОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_НачисленияБиллинговыхУслугОстатки.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_бу_НачисленияБиллинговыхУслугОбороты.Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.Регистратор ССЫЛКА Документ.бит_бу_НачисленияПоБиллинговымУслугам
	|				ТОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.Регистратор ССЫЛКА Документ.бит_бу_РазовыеПоБиллинговымУслугам
	|				ТОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.Регистратор ССЫЛКА Документ.бит_бу_ОплатаБиллинговыхУслуг
	|				ТОГДА -бит_бу_НачисленияБиллинговыхУслугОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_бу_НачисленияБиллинговыхУслуг.Обороты(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ),
	|			Регистратор,
	|			Организация = &Организация
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_бу_НачисленияБиллинговыхУслугОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_НачисленияБиллинговыхУслугОбороты.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбУслугах.Услуга,
	|	СведенияОбУслугах.РежимПотребления,
	|	СведенияОбУслугах.Поставщик,
	|	СведенияОбУслугах.Приоритет,
	|	ЕстьNull(ВходящееСальдо.Сальдо,0) КАК Сальдо,
	|	ЕстьNull(Обороты.Начисления,0) КАК Начисления ,
	|	ЕстьNull(Обороты.Разовые,0) КАК Разовые ,
	|	ЕстьNull(Обороты.Оплата,0) КАК Оплата ,
	|	СведенияОбУслугах.Использовать
	|ИЗ
	|	СведенияОбУслугах КАК СведенияОбУслугах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВходящееСальдо КАК ВходящееСальдо
	|		ПО СведенияОбУслугах.Услуга = ВходящееСальдо.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО СведенияОбУслугах.Услуга = Обороты.Услуга";
	Запрос.УстановитьПараметр("Момент"     , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Использовать Тогда
			
			НоваяСтрока = БиллинговыеУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЕсли; 
		
		Если Выборка.Сальдо = 0 И Выборка.Начисления = 0 И Выборка.Разовые = 0 И Выборка.Оплата = 0 Тогда
			
		Иначе
			
			НоваяСтрокаНачисления = ТабличноеПолеНачисленияБиллинговыхУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисления, Выборка);
			НоваяСтрокаНачисления.Итого = НоваяСтрокаНачисления.Сальдо + НоваяСтрокаНачисления.Начисления + НоваяСтрокаНачисления.Разовые - НоваяСтрокаНачисления.Оплата;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	МВТ.Закрыть();
	
КонецПроцедуры

// 16.10.2018
&НаКлиенте
Процедура ДокументыЖКХВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, ЭтаФорма.Элементы.ДокументыЖКХ.ТекущиеДанные.Ссылка);
КонецПроцедуры
//---
#КонецОбласти

#Область ОператорыОсновнойПрограммы

// БИТ_ЖКХ добавление кода Начало: 07.12.2010 
мКоличествоЛьготников = 0;
// БИТ_ЖКХ добавление кода конец : 07.12.2010

#КонецОбласти