
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТаблицыРасшифровкиВХранилище") Тогда
		
		ТаблицаРасшифровкиИзФормыЭлемента  = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыРасшифровкиВХранилище);
		
		СдвинутьКолонкиТаблицыРасшифровки(ТаблицаРасшифровкиИзФормыЭлемента);
		
		ТаблицаНужныхКолонок = СформироватьТаблицуНужныхКолонок();
		
		ВывестиТаблицуНаФорму(ЭтаФорма, "ТаблицаРасшифровки", ТаблицаРасшифровкиИзФормыЭлемента, Неопределено, ТаблицаНужныхКолонок);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ВывестиТаблицуНаФорму(УФ, ИмяТЗНаФорме, ТЗ, ТЗОбработчиковСобытий = Неопределено, ТаблицаНужныхКолонок)
    
    // СОЗДАНИЕ РЕКВИЗИТОВ ФОРМЫ.
    МассивДобавляемыхРеквизитов = Новый Массив; 
    
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		
        МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТЗНаФорме, Колонка.Заголовок));
		
    КонецЦикла; 
    
    МассивУдаляемыхРеквизитов = УФ.ПолучитьРеквизиты(ИмяТЗНаФорме);
	
    МассивИменУдаляемыхРеквизитов = Новый Массив;
    
	Для каждого Элемент Из МассивУдаляемыхРеквизитов Цикл
		
        МассивИменУдаляемыхРеквизитов.Добавить(ИмяТЗНаФорме + "." + Элемент.Имя);
		
    КонецЦикла; 
    
    УФ.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивИменУдаляемыхРеквизитов); 
    
    // СОЗДАНИЕ ЭЛЕМЕНТОВ ФОРМЫ.
	Для каждого Элемент Из МассивУдаляемыхРеквизитов Цикл
		
        УдаляемыйЭлемент = УФ.Элементы.Найти(ИмяТЗНаФорме + Элемент.Имя);
		
        УФ.Элементы.Удалить(УдаляемыйЭлемент);
		
    КонецЦикла; 
    
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		
        НоваяКолонка = УФ.Элементы.Добавить(ИмяТЗНаФорме + Колонка.Имя, Тип("ПолеФормы"), УФ.Элементы[ИмяТЗНаФорме]);
		
		НоваяКолонка.Вид                 = ВидПоляФормы.ПолеВвода; 
        НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Имя", Колонка.Имя);
		
		МассивСтрок = ТаблицаНужныхКолонок.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			НоваяКолонка.Заголовок   = МассивСтрок[0].Заголовок; 
            НоваяКолонка.ПутьКДанным = МассивСтрок[0].ПутьКДанным;
			НоваяКолонка.Видимость   = Истина;
			
			Если МассивСтрок[0].Итого Тогда
				
				НоваяКолонка.ОтображатьВПодвале = Истина;
				
				Если Колонка.ТипЗначения.КвалификаторыЧисла.Разрядность > 0 Тогда
					
					ТекстЧисла = "ЧЦ=" + Строка(Колонка.ТипЗначения.КвалификаторыЧисла.Разрядность) +
					             "; ЧДЦ="+ Строка(Колонка.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти);
				
					НоваяКолонка.ТекстПодвала                    = Формат(ТЗ.Итог(Колонка.Имя), ТекстЧисла);
					НоваяКолонка.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
					
				Иначе
					
					НоваяКолонка.ТекстПодвала = "Итого:";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если МассивСтрок[0].Жирный Тогда
				
				НоваяКолонка.Шрифт = Новый Шрифт("Шрифт диалогов и меню", 8, Истина);
				
			КонецЕсли;

		Иначе
			
			НоваяКолонка.Заголовок   = Колонка.Заголовок; 
            НоваяКолонка.ПутьКДанным = ИмяТЗНаФорме + "." + Колонка.Имя;
			НоваяКолонка.Видимость   = Ложь;
			
		КонецЕсли;
		
    КонецЦикла;     
    
    УФ[ИмяТЗНаФорме].Загрузить(ТЗ);
    
    // Привязка обработчиков событий.
	Если ТЗОбработчиковСобытий = Неопределено Тогда
		
        Возврат;
		
    КонецЕсли;    
    
	Для Каждого Строка Из ТЗОбработчиковСобытий Цикл
		
        УФ.Элементы[Строка.ИмяЭлемента].УстановитьДействие(Строка.ИмяСобытия, Строка.ИмяЭлемента + Строка.ИмяСобытия);
		
    КонецЦикла;    
    
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуНужныхКолонок()
	
	ТаблицаНужныхКолонок = Новый ТаблицаЗначений;
	
	ТаблицаНужныхКолонок.Колонки.Добавить("Имя");
	ТаблицаНужныхКолонок.Колонки.Добавить("Заголовок");
	ТаблицаНужныхКолонок.Колонки.Добавить("ПутьКДанным");
	ТаблицаНужныхКолонок.Колонки.Добавить("Итого");
	ТаблицаНужныхКолонок.Колонки.Добавить("Жирный");
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "Счетчик";
	НоваяСтрока.Заголовок   = "Счетчик";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.Счетчик";
	НоваяСтрока.Итого       = Истина;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "ЛицевойСчет";
	НоваяСтрока.Заголовок   = "ЛицевойСчет";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.ЛицевойСчет";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "Услуга";
	НоваяСтрока.Заголовок   = "Услуга";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.Услуга";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "СпособРасчета";
	НоваяСтрока.Заголовок   = "Способ расчета";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.СпособРасчета";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "ОсновнойСпособРасчета";
	НоваяСтрока.Заголовок   = "Единица распределения";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.ОсновнойСпособРасчета";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "ДоляПоЛС";
	НоваяСтрока.Заголовок   = "Количество единиц";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.ДоляПоЛС";
	НоваяСтрока.Итого       = Истина;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "КоличествоЕдиницПоЛС";
	НоваяСтрока.Заголовок   = "Доля от группового";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.КоличествоЕдиницПоЛС";
	НоваяСтрока.Итого       = Истина;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "Начислено";
	НоваяСтрока.Заголовок   = "Сумма начислений";
	НоваяСтрока.ПутьКДанным = "ТаблицаРасшифровки.Начислено";
	НоваяСтрока.Итого       = Истина;
	НоваяСтрока.Жирный      = Ложь;
	
	Возврат ТаблицаНужныхКолонок;
	
КонецФункции

&НаСервере
Процедура СдвинутьКолонкиТаблицыРасшифровки(ТаблицаЗначений)
		
	Колонка = ТаблицаЗначений.Колонки["Счетчик"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка));
	
	Колонка = ТаблицаЗначений.Колонки["ЛицевойСчет"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 1);

	Колонка = ТаблицаЗначений.Колонки["Услуга"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 2);
	
	Колонка = ТаблицаЗначений.Колонки["СпособРасчета"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 3);
	
	Колонка = ТаблицаЗначений.Колонки["ОсновнойСпособРасчета"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 4);
	
	Колонка = ТаблицаЗначений.Колонки["ДоляПоЛС"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 5);
	
	Колонка = ТаблицаЗначений.Колонки["КоличествоЕдиницПоЛС"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 6);
	
	Колонка = ТаблицаЗначений.Колонки["Начислено"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 7);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасшифровкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Заголовок = "Доля от группового" Тогда
		
		АдресТаблицыРасшифровкиВХранилище = ПоместитьТаблицуРасшифровкиВХранилище();
	
	    ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиВХранилище", АдресТаблицыРасшифровкиВХранилище);
		
		ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаРасшифровкиКоличестваЕдиницУправляемая", ПараметрыФормы, Элемент);
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуРасшифровкиВХранилище()
	
	ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТаблицаРасшифровкиИзРеквизитаФормы, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

#КонецОбласти