
// Модуль содержит методы работы с механизмом общих переменных.
#Область ОбщиеПеременные

Функция ЗначениеПеременной(ИмяПараметра) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	НайденноеЗначение = бит_ОбщиеПеременныеПовтИсп.ЗначениеПеременной(ИмяПараметра);
		
	Возврат НайденноеЗначение;
	
КонецФункции // ЗначениеПеременной()

Процедура ЗначениеПеременнойУстановить(ИмяПеременной, ЗначениеПеременной, Обновлять = Истина) Экспорт

	// Изменено значение общей переменной - сбрасываем повторно используемые значения.
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры // ЗначениеПеременнойУстановить()

#КонецОбласти