
// Модуль содержит процедуры подключения к внешним базам. 
// Подключения кешируются механизмом повторного использования возвращаемых значений.

#Область ПрограммныйИнтерфейс

// Функция выполняет подключение к внешней базе посредством ComConnector.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_НастройкиПодключений.
//
// Возвращаемое значение:
//  Коннектор – ComObject.
//
Функция ПодключитьКОМ(НастройкаПодключения) Экспорт

	Коннектор = Неопределено;
	
	Возврат Коннектор;
	
КонецФункции // ПодключитьКОМ()

// Функция выполняет подключение к внешней базе посредством OLE.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_НастройкиПодключений.
//
// Возвращаемое значение:
//  Коннектор – ComObject.
//
Функция ПодключитьОЛЕ(НастройкаПодключения) Экспорт

	Коннектор = Неопределено;
	
	Возврат Коннектор;
	
КонецФункции // ПодключитьОЛЕ()

// Функция получает структуру метаданных целевой внешней базы по HTTP.
//
// Параметры:
//
// Возвращаемое значение:
//  ОтветHTTP – HTTPОтвет.
//
Функция ПолучитьМетаданныеHTTP(НастройкаПодключения, Развернуто = Истина, ВыводитьСообщения = Ложь) Экспорт
	
	ПризнакОбращения = бит_мпд_КлиентСервер.ПризнакОбращенияОДата();
	ТекстЗапросаМета =  ПризнакОбращения+?(Развернуто, "$metadata", "");
	
	Путь = НастройкаПодключения.ИмяСервера+"/"+НастройкаПодключения.ИмяБазы;
	
	СоединениеHTTP = Новый HTTPСоединение(Путь,,НастройкаПодключения.Пользователь,НастройкаПодключения.Пароль);
	
	ЗапросHTTP = Новый HTTPЗапрос(ТекстЗапросаМета);
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	Если НЕ ОтветHTTP.КодСостояния = 200 Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось получить метаданные по настройке %1. Код ошибки: %2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, НастройкаПодключения, ОтветHTTP.КодСостояния);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
	Возврат ОтветHTTP;
	
КонецФункции // ПолучитьМетаданныеHTTP()

#КонецОбласти