
#Область ПеременныеМодуля

&НаСервере
Перем мДатаТекст; // Хранит дату закрытия в текстовом предствалении.

&НаСервере
Перем мОтветственный; // Хранит ответственного(текущего пользователя).

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура ПоместитьЗначениеВОтборКомпановщика(Значение, Индекс)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[Индекс].ПравоеЗначение = Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииУправленияВнешнимВидомФорм

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ВидСравненияЗдание.Доступность  = ИспользоватьОтборЗдание;
	Элементы.ВидСравненияУчасток.Доступность = ИспользоватьОтборУчасток;
	Элементы.ВидСравненияРайон.Доступность   = ИспользоватьОтборРайон;
	Элементы.ВидСравненияУлица.Доступность   = ИспользоватьОтборУлица;
	
	Элементы.Здание.Доступность  = ИспользоватьОтборЗдание;
	Элементы.Участок.Доступность = ИспользоватьОтборУчасток;
	Элементы.Район.Доступность   = ИспользоватьОтборРайон;
	Элементы.Улица.Доступность   = ИспользоватьОтборУлица;
	
	//Элементы.ВыполнитьНачисленияПоЛьготам.Доступность   = Объект.ВыполнитьНачисления;
	//Элементы.ВыполнитьНачисленияПоНормам.Доступность    = Объект.ВыполнитьНачисления;
	//Элементы.ВыполнитьНачисленияПоСчетчикам.Доступность = Объект.ВыполнитьНачисления;
	//
	//Элементы.ФормироватьСчетФактураВыданный.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	//
	//Элементы.Разовые.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	//Элементы.РеализацииОтНачисления.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	//
	//Если Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету Тогда
	//	
	//	Элементы.ДокументРаспределенияРасходовНаОказаниеУслуг.Доступность = Истина;
	//	
	//Иначе
	//	Элементы.ДокументРаспределенияРасходовНаОказаниеУслуг.Доступность = Ложь;
	//КонецЕсли;
	
	//Элементы.ЗаполняемыеРеквизиты.Доступность = Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "АктОбОказанииПроизводственныхУслуг";
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ВидСравненияРайон   = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияЗдание  = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияУлица   = ВидСравненияКомпоновкиДанных.Равно;
	
	Объект.Организация = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ОбработкаОбъект = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.бит_ЗакрытиеМесяцаЖКХ"));	
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ОбработкаОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
		Объект.Организация = ОбработкаОбъект.Организация;
		
	КонецЕсли;
	
	Объект.ДатаЗакрытия = КонецМесяца(бит_ОбщегоНазначения.ПолучитьРабочуюДату());
	
	ОбновитьПараметрыЖКХ();
	
	Объект.ПереоформитьПроживающих        = Истина;
	Объект.ВыполнитьНачисления            = Истина;
	Объект.ВводПоказанийПодкрутки         = Истина;
	Объект.ВыполнитьНачисленияПоНормам    = Истина;
	Объект.ВыполнитьНачисленияПоСчетчикам = Истина;
	Объект.ВыполнитьНачисленияПоЛьготам   = Истина;
	Объект.ВыполнитьОбщедомовыеНачисления = Истина;
	Объект.ВыполнитьРаспределениеАванса	  = Истина;
	
	// Установить видимость реквизитов и заголовков колонок.
	ПредставлениеПериодаРегистрации = Формат(ТекущаяДата(), "ДФ='ММММ гггг'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(СтрокаКонецПериода) Тогда
		СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.ДатаЗакрытия);
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
	Элементы.ДатаЗакрытия.Видимость = Ложь;
	
	Элементы.ДатаКонцаПериода.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура СформироватьАвансы(Команда)
	
	Форма = ПолучитьФорму("Обработка.бит_ЗакрытиеМесяцаЖКХ.Форма.ФормаРаботыСДокументами",,ЭтаФорма, ЭтаФорма);
	
	Если Форма.Открыта() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед закрытием месяца закройте ""Форму работы с документами""!");
		
		Возврат;
		
	КонецЕсли; 

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выполняется распределенние авансов.");
	
	ЗакрытьМесяцНаСервере();

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Распределение авансов выполнено.");
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаРаботыСдокументами(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация" , Объект.Организация);
	ПараметрыФормы.Вставить("ДатаЗакрытия", Объект.ДатаЗакрытия);
	
	Форма = ПолучитьФорму("Обработка.бит_ЗакрытиеМесяцаЖКХ.Форма.ФормаРаботыСДокументами", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
	Если Форма.Открыта() Тогда
		Форма.Активизировать();
	Иначе
		Форма.Открыть();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	Объект.ДатаЗакрытия = КонецМесяца(Объект.ДатаЗакрытия)+1;
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	Объект.ДатаЗакрытия = НачалоМесяца(Объект.ДатаЗакрытия-1);
	
	ПриИзмененииПериода();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Здание, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Участок, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Район, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Улица, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборРайонПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ИспользоватьОтборРайон;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборУчастокПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = ИспользоватьОтборУчасток;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборЗданиеПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование  = ИспользоватьОтборЗдание;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборУлицаПриИзменении(Элемент)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование  = ИспользоватьОтборУлица;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Если ИспользоватьОтборРайон И ЗначениеЗаполнено(Район) Тогда
		Отбор.Вставить("Район", Район);
	КонецЕсли;
	
	Если ИспользоватьОтборУчасток И ЗначениеЗаполнено(Участок) Тогда
		Отбор.Вставить("Участок", Участок);
	КонецЕсли;
	
	Если ИспользоватьОтборУлица И ЗначениеЗаполнено(Улица) Тогда
		Отбор.Вставить("Улица", Улица);
	КонецЕсли;
	
	МножественныйВыбор = (ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор, МножественныйВыбор", Отбор, МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияЗданиеПриИзменении(Элемент)
	
	Если ВидСравненияЗдание = Неопределено Тогда
		
		ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Здание) = Тип("СписокЗначений") Тогда
		
		Здание = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Здание, 3);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ВидСравнения   = ВидСравненияЗдание;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияРайонПриИзменении(Элемент)
	
	Если ВидСравненияРайон = Неопределено Тогда
		
		ВидСравненияРайон = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияРайон = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияРайон = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Район) = Тип("СписокЗначений") Тогда
		
		Район = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Район, 0);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ВидСравнения   = ВидСравненияРайон;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияУчастокПриИзменении(Элемент)
	
	Если ВидСравненияУчасток = Неопределено Тогда
		
		ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Участок) = Тип("СписокЗначений") Тогда
		
		Участок = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Участок, 1);
		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения   = ВидСравненияУчасток;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияУлицаПриИзменении(Элемент)
	
	Если ВидСравненияУлица = Неопределено Тогда
		
		ВидСравненияУлица = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияУлица = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияУлица = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Улица) = Тип("СписокЗначений") Тогда
		
		Улица = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Улица, 2);
		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].ВидСравнения   = ВидСравненияУлица;
	
КонецПроцедуры

&НаКлиенте
Процедура РайонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияРайон = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияРайон = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_АдминистративныеОкруга.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_ТехническиеУчастки.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияУлица = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияУлица = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СписокУлиц.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СтрокаКонецПериода) Тогда
		СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.ДатаЗакрытия);
	КонецЕсли; 
	
	ОбновитьПараметрыЖКХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.ДатаЗакрытия;
	
	бит_РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент,
	СтандартнаяОбработка, 
	Объект.ДатаЗакрытия, 
	ЭтаФорма);
	СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.ДатаЗакрытия);
	Объект.ДатаЗакрытия = КонецМесяца(Объект.ДатаЗакрытия);
	
	ОбновитьПараметрыЖКХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.ДатаЗакрытия;
	
	ТекущаяДата = ?(Направление > 0, Объект.ДатаЗакрытия, ДобавитьМесяц(Объект.ДатаЗакрытия, -1));
	бит_РаботаСДиалогами.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, ТекущаяДата, СтрокаКонецПериода);
	Объект.ДатаЗакрытия = КонецМесяца(ТекущаяДата);
	
	ОбновитьПараметрыЖКХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНачисленияПриИзменении(Элемент)
	
	Объект.ВыполнитьНачисленияПоНормам    = Объект.ВыполнитьНачисления;
	Объект.ВыполнитьНачисленияПоЛьготам   = Объект.ВыполнитьНачисления;
	Объект.ВыполнитьНачисленияПоСчетчикам = Объект.ВыполнитьНачисления;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчетуПриИзменении(Элемент)
	
	Объект.ФормироватьСчетФактураВыданный = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	
	Разовые = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	
	РеализацииОтНачисления = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
    // БИТ_ЖКХ 23.10.2017 11:36:14 Начало правки... 
    Объект.ФормироватьСчетНаОплату = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	Элементы.ФормироватьСчетНаОплату.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
    // БИТ_ЖКХ 23.10.2017 11:36:16 Конец правки. 
    УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРаспределенияРасходовНаОказаниеУслугПриИзменении(Элемент)
	
	Элементы.ЗаполняемыеРеквизиты.Доступность = Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "АктОбОказанииПроизводственныхУслуг";
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьПараметрыЖКХ();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРекомендацияНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ДатыЗапретаИзменения.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйПериодПриИзменении(Элемент)
	
	Если ПроизвольныйПериод Тогда
		
		Элементы.ДатаЗакрытия.Видимость = Ложь;
		
		Элементы.ДатаКонцаПериода.Видимость = Истина;
		
		
		ДатаКонцаПериода = Объект.ДатаЗакрытия;
		
	Иначе
		
		Элементы.ДатаЗакрытия.Видимость = Истина;
		
		Элементы.ДатаКонцаПериода.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	мКэшЗначений.ЗначениеДаты = ВыбранноеЗначение;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПриИзменении(Элемент)
	
	ПредставлениеПериодаРегистрации = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), 
	НачалоМесяца(Объект.ДатаЗакрытия), 
	КонецМесяца(Объект.ДатаЗакрытия));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Объект.ДатаЗакрытия), КонецМесяца(Объект.ДатаЗакрытия));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, Элементы.ПредставлениеПериодаРегистрации, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	
	КэшированныеЗначения.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	КэшированныеЗначения.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	КэшированныеЗначения.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	КэшированныеЗначения.Вставить("ОбщедомовыеРасходыВГрафеНачисления"                   , Ложь);
	КэшированныеЗначения.Вставить("СчетчикиПодкрутка"                                    , Ложь);
	КэшированныеЗначения.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	КэшированныеЗначения.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	КэшированныеЗначения.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	КэшированныеЗначения.Вставить("УчитыватьНачисленияПоГрупповымСчетчикам"              , Ложь);
	КэшированныеЗначения.Вставить("УчитыватьПерерасчет"                                  , Ложь);
	КэшированныеЗначения.Вставить("СчетАбонента"                                         , Неопределено);
	КэшированныеЗначения.Вставить("Контрагент"                                            , Неопределено);
	КэшированныеЗначения.Вставить("ФормироватьАктИРеализациюПоКонтрагенту"                , Ложь);
	КэшированныеЗначения.Вставить("ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц", Ложь);
	
	КэшированныеЗначения.Вставить("ДокументУчетаСобственныхУслуг", Неопределено);
	
	КэшированныеЗначения.Вставить("ПорядокРаспределенияРасходовНаОказаниеУслуг", Неопределено);
	
	КэшированныеЗначения.Вставить("ПоПлановымЦенамИВыручке", Перечисления.бит_ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенамИВыручке);
	
	КэшированныеЗначения.Вставить("ЗначениеДаты"                                         , Неопределено);
	
КонецПроцедуры

// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьМакет("ОсновныеНачисления");
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры

// Процедура выполняет заполнение табличной части "Товары".
//
&НаСервере
Процедура ЗакрытьМесяцНаСервере()
	
	ВыполнитьРаспределениеАванса();
	
КонецПроцедуры

&НаСервере
Процедура ПереоформлениеПроживающих()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ФизЛицо");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтатусФизЛица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтепеньРодства");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтатусПроживания");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаРегистрации");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаСнятияСРегистрации");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаЗаписи");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ВладелецКвартиры");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ПричинаВыписки");
	СтруктураНастроек.ОбязательныеПоля.Добавить("КудаВыписан");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Контрагент");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДоляПлощади");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтатусФизЛицаДляИзменения");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ПравоустанавливающиеДокументы");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПереоформлениеПроживающих";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаЛС = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ДокументРПЛ = Неопределено;
		
		Выборка = ВыборкаЛС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ДокументРПЛ = Неопределено Тогда
				
				ДокументРПЛ = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент();
				
				ДокументРПЛ.Дата          = КонецДня(Объект.ДатаЗакрытия) - 2;
				ДокументРПЛ.ЛицевойСчет   = ВыборкаЛС.ЛицевойСчет;
				ДокументРПЛ.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				ДокументРПЛ.Ответственный = мОтветственный;
				
			КонецЕсли;
			
			НоваяСтрока = ДокументРПЛ.СписокПроживающих.Добавить();
			
			НоваяСтрока.ФизЛицо                       = Выборка.ФизЛицо;
			НоваяСтрока.ДатаРегистрации               = Выборка.ДатаРегистрации;
			НоваяСтрока.ДатаСнятияСРегистрации        = Выборка.ДатаСнятияСРегистрации;
			НоваяСтрока.СтатусПроживания              = Выборка.СтатусПроживания;
			НоваяСтрока.СтепеньРодства                = Выборка.СтепеньРодства;
			НоваяСтрока.ПравоустанавливающиеДокументы = Выборка.ПравоустанавливающиеДокументы; 
			НоваяСтрока.ВладелецКвартиры              = Выборка.ВладелецКвартиры;
			НоваяСтрока.ДоляПлощади                   = Выборка.ДоляПлощади;
			
			Если ЗначениеЗаполнено(Выборка.ДатаЗаписи) Тогда
				
				НоваяСтрока.СтатусФизЛица = ?(НЕ ЗначениеЗаполнено(Выборка.СтатусФизЛицаДляИзменения),
				Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация,
				Выборка.СтатусФизЛицаДляИзменения);
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
				
				НоваяСтрока.СтатусФизЛица  = Справочники.бит_СтатусФизЛица.Выписан;
				НоваяСтрока.ПричинаВыписки = Справочники.бит_ПричиныВыписки.ОкончаниеВремениРегистрации;
				
			КонецЕсли;  
			
			Если НоваяСтрока.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
				
				НоваяСтрока.Контрагент = Выборка.Контрагент;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если НЕ ДокументРПЛ = Неопределено И ДокументРПЛ.СписокПроживающих.Количество() > 0 Тогда 
			
			Попытка
				
				ДокументРПЛ.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ВводПоказанийПодкрутки()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Счетчик");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Удалить");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ВводПоказанийПоПоказаниям";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаЗдание = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗдание.Следующий() Цикл
		
		ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
		
		ДокументВводПоказаний.Дата          = КонецДня(КонецМесяца(Объект.ДатаЗакрытия)) - 2;
		ДокументВводПоказаний.Организация   = Объект.Организация;
		ДокументВводПоказаний.ВидОперации   = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки;
		ДокументВводПоказаний.ТипСчетчика   = Перечисления.бит_ТипСчетчика.Индивидуальный;
		ДокументВводПоказаний.Улица         = ВыборкаЗдание.Здание.Улица;
		ДокументВводПоказаний.Дом           = ВыборкаЗдание.Здание;
		ДокументВводПоказаний.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
		ДокументВводПоказаний.Ответственный = мОтветственный;
		ДокументВводПоказаний.ЗаполнитьТаблицуПоказаний();
		
		Отбор = Новый Структура;
		
		Выборка = ВыборкаЗдание.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Отбор.Очистить();
			Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет); 
			Отбор.Вставить("Счетчик"    ,Выборка.Счетчик);
			
			МассивСтрок =  ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Отбор);
			
			Для каждого Строка Из МассивСтрок Цикл
				Если Выборка.Удалить Тогда
					
					ДокументВводПоказаний.ПоказанияПоСчетчикам.Удалить(Строка);
					
				КонецЕсли; 
			КонецЦикла; 
			
		КонецЦикла; 
		
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 0 Тогда
			
			Попытка
				
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОсновныеНачисления()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументНачисления");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументПоСч");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументПоЛьготам");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ОсновныеНачисления";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	Запрос = Новый Запрос;
	ТекстЛС = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание";
	
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ДокументНачисления) И Объект.ВыполнитьНачисленияПоНормам Тогда
			
			ДокументНачисленийПоЛС = Выборка.ДокументНачисления.ПолучитьОбъект();
			
			Если ДокументНачисленийПоЛС.ПометкаУдаления Тогда
				
				ДокументНачисленийПоЛС.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли; 
			
			ДокументНачисленийПоЛС.ЛицевыеСчета.Очистить();
			ДокументНачисленийПоЛС.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДокументПоСч) И Объект.ВыполнитьНачисленияПоСчетчикам Тогда
			
			ДокументНачисленийПоСЧ = Выборка.ДокументПоСч.ПолучитьОбъект();
			
			Если ДокументНачисленийПоСЧ.ПометкаУдаления Тогда
				
				ДокументНачисленийПоСЧ.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли;
			
			ДокументНачисленийПоСЧ.Начисления.Очистить();
			ДокументНачисленийПоСЧ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДокументПоЛьготам) И Объект.ВыполнитьНачисленияПоЛьготам Тогда
			
			ДокументНачисленийПоЛьготам = Выборка.ДокументПоЛьготам.ПолучитьОбъект();
			
			Если ДокументНачисленийПоЛьготам.ПометкаУдаления Тогда
				
				ДокументНачисленийПоЛьготам.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли;
			
			ДокументНачисленийПоЛьготам.ЛицевыеСчета.Очистить();
			ДокументНачисленийПоЛьготам.СписокЛьгот.Очистить();
			ДокументНачисленийПоЛьготам.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Выборка.Сбросить();
	
	ДокументыНаПроведение = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Запрос.Текст = ТекстЛС;
		
		Запрос.УстановитьПараметр("Здание", Выборка.Здание);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		СписокЗданий = Новый Массив;
		СписокЛС     = Новый Массив;
		
		СписокЗданий.Добавить(Выборка.Здание);
		
		СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТаблицаНачислений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		ТаблицаСчетчиков  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
		ТаблицаРаспред    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
		ТаблицаПрожив     = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецМесяца(Объект.ДатаЗакрытия), 
		Объект.Организация, 
		СписокЛС, 
		СписокЗданий, 
		, 
		, 
		ТаблицаНачислений, 
		ТаблицаСчетчиков, 
		ТаблицаРаспред, 
		,
		,
		,
		мКэшЗначений.РасчетСУчетомДолейВладения,
		мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта, 
		мКэшЗначений.НачислениеСУчетомДнейПроживания, 
		ТаблицаПрожив, 
		,
		мКэшЗначений.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
		мКэшЗначений.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
		
		
		// БИТ ЖКХ 08.04.2020
	    ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		ТаблицаПоДнямСобственности = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПоДнямСобственности();	

		// БИТ ЖКХ 17.04.2020
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата"       , КонецДня(Объект.ДатаЗакрытия));
	//	Запрос.УстановитьПараметр("Организация", Объект.ЛицевойСчет.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НастройкаПараметровЖКХСрезПоследних.НачислениеСоДняПраваСобственности КАК НачислениеСоДняПраваСобственности
		|ИЗ
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата,) КАК бит_НастройкаПараметровЖКХСрезПоследних";
		
		ВыборкаНастроекЖКХ = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаНастроекЖКХ.Следующий() Тогда
			НачислениеСоДняПраваСобственности = ВыборкаНастроекЖКХ.НачислениеСоДняПраваСобственности;
		Иначе	
			НачислениеСоДняПраваСобственности = Ложь;
		КонецЕсли;

		// БИТ ЖКХ 16.04.2020
  	    //бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисленияПоДнямСобственности(КонецМесяца(Объект.ДатаЗакрытия), Объект.Организация, СписокЛС, СписокЗданий, , , ТабЛицевыеСчета,,,,,,мКэшЗначений.РасчетСУчетомДолейВладения,,мКэшЗначений.НачислениеСУчетомДнейПроживания, ТаблицаПоДнямСобственности);
		если НачислениеСоДняПраваСобственности = Истина тогда 
         бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисленияПоДнямСобственности(КонецМесяца(Объект.ДатаЗакрытия), Объект.Организация, СписокЛС, СписокЗданий, , , ТаблицаНачислений,,,,,,мКэшЗначений.РасчетСУчетомДолейВладения,,мКэшЗначений.НачислениеСУчетомДнейПроживания, ТаблицаПоДнямСобственности);
		конецесли; 

		Если Объект.ВыполнитьНачисления И Объект.ВыполнитьНачисленияПоНормам Тогда
			
			Если  ЗначениеЗаполнено(Выборка.ДокументНачисления) Тогда
				
				ДокументНачисленийПоЛС = Выборка.ДокументНачисления.ПолучитьОбъект();

			Иначе
				
				ДокументНачисленийПоЛС = Документы.бит_НачислениеПоЛицевымСчетам.СоздатьДокумент();
				
				ДокументНачисленийПоЛС.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументНачисленийПоЛС.Организация = Объект.Организация;
				ДокументНачисленийПоЛС.Улица       = Выборка.Улица;
				ДокументНачисленийПоЛС.Здание      = Выборка.Здание;
				
				ДокументНачисленийПоЛС.Ответственный = мОтветственный;
				ДокументНачисленийПоЛС.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				
			КонецЕсли;
			
			// Начисление по лицевым счетам.
			Если ТаблицаНачислений.Количество() > 0 Тогда
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаНачислений);
				ДокументНачисленийПоЛС.ЗаполнениеСчетовКУ(ТаблицаНачислений);
				
				ДокументНачисленийПоЛС.ЛицевыеСчета.Очистить();
				ДокументНачисленийПоЛС.ЛицевыеСчета.Загрузить(ТаблицаНачислений);
				
				ДокументНачисленийПоЛС.НачисленияПоПроживающим.Очистить();
				ДокументНачисленийПоЛС.НачисленияПоПроживающим.Загрузить(ТаблицаПрожив);
				
				// БИТ ЖКХ 14.04.2020
				ДокументНачисленийПоЛС.НачисленияПоДнямПраваСобственности.Очистить();
				ДокументНачисленийПоЛС.НачисленияПоДнямПраваСобственности.Загрузить(ТаблицаПоДнямСобственности);
				
				ДокументНачисленийПоЛС.мРасчетСУчетомДолейВладения          = мКэшЗначений.РасчетСУчетомДолейВладения;
				ДокументНачисленийПоЛС.мУменьшениеНормыЛьготыВПределахФакта = мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта;
				
				Попытка
					
					Если ДокументНачисленийПоЛС.ЛицевыеСчета.Количество() > 0 Тогда
						
						ДокументНачисленийПоЛС.Записать(РежимЗаписиДокумента.Запись);
						ДокументыНаПроведение.Добавить(ДокументНачисленийПоЛС.Ссылка);
						
					КонецЕсли; 
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ВыполнитьНачисления И Объект.ВыполнитьНачисленияПоСчетчикам Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДокументПоСч) Тогда
				
				ДокументНачисленийПоСЧ = Выборка.ДокументПоСч.ПолучитьОбъект();

			Иначе
				ДокументНачисленийПоСЧ = Документы.бит_НачисленияПоСчетчикам.СоздатьДокумент();
				
				ДокументНачисленийПоСЧ.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументНачисленийПоСЧ.Организация = Объект.Организация;
				ДокументНачисленийПоСЧ.Улица       = Выборка.Улица;
				ДокументНачисленийПоСЧ.Здание      = Выборка.Здание;
				
				ДокументНачисленийПоСЧ.Ответственный = мОтветственный;
				ДокументНачисленийПоСЧ.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				
			КонецЕсли;
			
			// Начисление по счетчикам.
			Если ТаблицаСчетчиков.Количество() > 0 ИЛИ ТаблицаРаспред.Количество() > 0 Тогда
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаСчетчиков);
				ДокументНачисленийПоСЧ.ЗаполнениеСчетовКУ(ТаблицаСчетчиков);
				ДокументНачисленийПоСЧ.Начисления.Очистить();
				ДокументНачисленийПоСЧ.Начисления.Загрузить(ТаблицаСчетчиков);
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаРаспред);
				ДокументНачисленийПоСЧ.ЗаполнениеСчетовКУ(ТаблицаРаспред);
				ДокументНачисленийПоСЧ.Распределения.Очистить();
				ДокументНачисленийПоСЧ.Распределения.Загрузить(ТаблицаРаспред);
				
				ДокументНачисленийПоСЧ.мУчетДнейПроживания = мКэшЗначений.НачислениеСУчетомДнейПроживания;
				
				Попытка
					
					Если ДокументНачисленийПоСЧ.Начисления.Количество() > 0 ИЛИ ДокументНачисленийПоСЧ.Распределения.Количество() > 0 Тогда
						
						ДокументНачисленийПоСЧ.Записать(РежимЗаписиДокумента.Запись);
						ДокументыНаПроведение.Добавить(ДокументНачисленийПоСЧ.Ссылка);
						
					КонецЕсли; 
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПровестиДокументы(ДокументыНаПроведение);
	
	Если мКэшЗначений.ОбщедомовыеРасходыВГрафеНачисления
		И Объект.ВыполнитьОбщедомовыеНачисления Тогда
		
		ВыполнитьОбщедомовыеНачисления();
		
	КонецЕсли;
	
	// Расчет Льгот после выполнения всех начислений.
	ДокументыНаПроведение.Очистить();
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		Запрос.Текст = ТекстЛС;
		
		Запрос.УстановитьПараметр("Здание", Выборка.Здание);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		СписокЗданий = Новый Массив;
		СписокЛС     = Новый Массив;
		
		СписокЗданий.Добавить(Выборка.Здание);
		
		СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТаблицаЛьгот      = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецМесяца(Объект.ДатаЗакрытия), 
		Объект.Организация, 
		СписокЛС, 
		СписокЗданий, 
		, 
		, 
		, 
		, 
		, 
		ТаблицаЛьгот,
		,
		,
		мКэшЗначений.РасчетСУчетомДолейВладения,
		мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта, 
		мКэшЗначений.НачислениеСУчетомДнейПроживания, 
		, 
		,
		мКэшЗначений.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
		мКэшЗначений.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
		
		Если Объект.ВыполнитьНачисления И Объект.ВыполнитьНачисленияПоЛьготам Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДокументПоЛьготам) Тогда
				
				ДокументНачисленийПоЛьготам = Выборка.ДокументПоЛьготам.ПолучитьОбъект();
				
			Иначе
				
				ДокументНачисленийПоЛьготам = Документы.бит_НачислениеЛьготПоЛицевымСчетам.СоздатьДокумент();
				
				ДокументНачисленийПоЛьготам.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументНачисленийПоЛьготам.Организация = Объект.Организация;
				ДокументНачисленийПоЛьготам.Улица       = Выборка.Улица;
				ДокументНачисленийПоЛьготам.Здание      = Выборка.Здание;
				
				ДокументНачисленийПоЛьготам.Ответственный = мОтветственный;
				ДокументНачисленийПоЛьготам.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				
			КонецЕсли;
			
			Если ТаблицаЛьгот.Количество() > 0 Тогда
				
				Для Каждого Строка Из ТаблицаЛьгот Цикл
					
					Строка.СуммаСумм = Окр((Строка.СуммаЛичной + Строка.НачисленоСемейной),2);
					
				КонецЦикла;
				
				ДокументНачисленийПоЛьготам.СписокЛьгот.Очистить();
				
				ДокументНачисленийПоЛьготам.СписокЛьгот.Загрузить(ТаблицаЛьгот);
				
				ТаблицаЛьгот.Свернуть("ЛицевойСчет,Услуга,Начислено");
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаЛьгот);
				ДокументНачисленийПоЛьготам.ЗаполнениеСчетовКУ(ТаблицаЛьгот);
				
				Для каждого СтрокаЛС из ТаблицаЛьгот Цикл
					
					Отбор = Новый Структура;
					
					Отбор.Очистить();
					Отбор.Вставить("ЛицевойСчет", СтрокаЛС.ЛицевойСчет);
					Отбор.Вставить("Услуга"     , СтрокаЛС.Услуга);
					
					МассивСтрокЛьгот = ДокументНачисленийПоЛьготам.СписокЛьгот.НайтиСтроки(Отбор);
					
					Если МассивСтрокЛьгот.Количество()>1 Тогда
						
						СуммаСумм = 0;
						
						Для Каждого Строка Из МассивСтрокЛьгот Цикл
							
							СуммаСумм = СуммаСумм + Строка.СуммаСумм;
							
							Строка.Начислено = Строка.СуммаСумм; 
							
						КонецЦикла;
						
						СтрокаЛС.Начислено =  СуммаСумм;
						
					КонецЕсли;
					
				КонецЦикла;	
				
				ДокументНачисленийПоЛьготам.ЛицевыеСчета.Очистить();
				ДокументНачисленийПоЛьготам.ЛицевыеСчета.Загрузить(ТаблицаЛьгот);
				
				ДокументНачисленийПоЛьготам.мЛьготаПерсонифицированная           = мКэшЗначений.ЛьготаПерсонифицированная;
				ДокументНачисленийПоЛьготам.мРасчетСУчетомДолейВладения          = мКэшЗначений.РасчетСУчетомДолейВладения;
				ДокументНачисленийПоЛьготам.мУменьшениеНормыЛьготыВПределахФакта = мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта;
				
				Попытка
					
					Если ДокументНачисленийПоЛьготам.ЛицевыеСчета.Количество() > 0 Тогда
						
						ДокументНачисленийПоЛьготам.Записать(РежимЗаписиДокумента.Запись);
						ДокументыНаПроведение.Добавить(ДокументНачисленийПоЛьготам.Ссылка);
						
					КонецЕсли; 
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПровестиДокументы(ДокументыНаПроведение);
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументы(ДокументыНаПроведение)
	
	Для каждого СсылкаНаДокумент Из ДокументыНаПроведение Цикл
		
		Попытка
			Документ = СсылкаНаДокумент.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьОбщедомовыеНачисления()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Документ");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ОбщедомовыеНачисления";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ДокументОбщедомовыеРасходы = Неопределено;
	
	Отбор = Новый Структура;
	
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Документ.Пустая() Тогда
			
			ДокументОбщедомовыеРасходы = Выборка.Документ.ПолучитьОбъект();
			
			Если ДокументОбщедомовыеРасходы.ПометкаУдаления Тогда
				
				ДокументОбщедомовыеРасходы.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли; 
			
			ДокументОбщедомовыеРасходы.Начисления.Очистить();
			ДокументОбщедомовыеРасходы.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаОбщедомовыеНачисления = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуОбщедомовыхРасходов();
	
	бит_РасчетыПоКоммунальнымУслугам.РасчитатьНачисленияПоОбщедомовымРасходам(КонецМесяца(Объект.ДатаЗакрытия)
	,Объект.ДатаЗакрытия
	,Объект.ДатаЗакрытия
	,Объект.Организация
	,ТаблицаОбщедомовыеНачисления
	,мКэшЗначений.УчитыватьНачисленияПоГрупповымСчетчикам
	,мКэшЗначений.УчитыватьПерерасчет);
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаОбщедомовыеНачисления);
	
	СписокЛС = ТаблицаОбщедомовыеНачисления.ВыгрузитьКолонку("ЛицевойСчет");
	Колонки  = ТаблицаОбщедомовыеНачисления.Колонки;
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТаблицаОбщедомовыеНачисления, Колонки, СписокЛС, Объект.Организация, Объект.ДатаЗакрытия);
	
	ТаблицаОбщедомовыеНачисления.Сортировать("Приоритет ВОЗР, НаименованиеЛС ВОЗР");
	
	ДокументыНаПроведение = Новый Массив;
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Документ.Пустая() Тогда
			
			ДокументОбщедомовыеРасходы = Выборка.Документ.ПолучитьОбъект();
			
		Иначе
			
			ДокументОбщедомовыеРасходы = Документы.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.СоздатьДокумент();
			
			ДокументОбщедомовыеРасходы.Дата          = КонецМесяца(Объект.ДатаЗакрытия) - 1;
			ДокументОбщедомовыеРасходы.Улица         = Выборка.Улица;
			ДокументОбщедомовыеРасходы.Здание        = Выборка.Здание;
			ДокументОбщедомовыеРасходы.Организация   = Объект.Организация;
			ДокументОбщедомовыеРасходы.Ответственный = мОтветственный;
			ДокументОбщедомовыеРасходы.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
			
		КонецЕсли;
		
		Отбор.Очистить();
		Отбор.Вставить("Здание", Выборка.Здание);
		
		СтрокиПоЗданию = ТаблицаОбщедомовыеНачисления.НайтиСтроки(Отбор);
		
		Если НЕ ДокументОбщедомовыеРасходы = Неопределено Тогда
			
			ДокументОбщедомовыеРасходы.Начисления.Очистить();
			
			Если СтрокиПоЗданию.Количество() > 0 Тогда
				
				Для каждого СтрокаТаблицы Из СтрокиПоЗданию Цикл
					
					НоваяСтрока = ДокументОбщедомовыеРасходы.Начисления.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					
				КонецЦикла; 
				
				Попытка
					
					ДокументОбщедомовыеРасходы.Записать(РежимЗаписиДокумента.Запись);
					ДокументыНаПроведение.Добавить(ДокументОбщедомовыеРасходы.Ссылка);
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СсылкаНаДокумент Из ДокументыНаПроведение Цикл
		
		Попытка
			Документ = СсылкаНаДокумент.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАктРеализацию()
	
	тмпТаблицаУслуг = Новый ТаблицаЗначений;
	тмпТаблицаУслуг.Колонки.Добавить("Контрагент"              , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тмпТаблицаУслуг.Колонки.Добавить("Номенклатура"            , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тмпТаблицаУслуг.Колонки.Добавить("Количество"              , ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
    // БИТ_ЖКХ 23.10.2017 11:25:30 Начало правки... 
    //тмпТаблицаУслуг.Колонки.Добавить("Цена"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("Цена"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	тмпТаблицаУслуг.Колонки.Добавить("ЛС"                      , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	тмпТаблицаУслуг.Колонки.Добавить("НЖ"                      , Новый ОписаниеТипов("Булево") );
	тмпТаблицаУслуг.Колонки.Добавить("Здание"                  , Новый ОписаниеТипов("СправочникСсылка.бит_СписокЗданий"));
    // БИТ_ЖКХ 23.10.2017 11:25:32 Конец правки. 
    тмпТаблицаУслуг.Колонки.Добавить("Сумма"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СтавкаНДС"               , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаНДС"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,10));
	тмпТаблицаУслуг.Колонки.Добавить("НоменклатурнаяГруппа"    , Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетУчетаНДСПоРеализации", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ПлановаяСтоимость"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаПлановая"           , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СчетДоходов"             , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетРасходов"            , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ДоговорКонтрагента"      , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Документ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Услуга");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Контрагент");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетАбонента");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетКУ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Начислено");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДоговорКонтрагента");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
    
    // БИТ_ЖКХ 23.10.2017 11:26:54 Начало правки... 
	СтруктураНастроек.ОбязательныеПоля.Добавить("Тариф");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ОсновнаяСтавка");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛС");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ТипКвартиры");
	// БИТ_ЖКХ 23.10.2017 11:27:01 Конец правки. 
    
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	// БИТ_ЖКХ 23.10.2017 11:27:29 Начало правки... 
	//СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "УчетСобственныхУслуг";
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "УчетСобственныхУслугОбъединенный";
    тмпТаблицаУслугНЖ = тмпТаблицаУслуг.СкопироватьКолонки();
	// БИТ_ЖКХ 23.10.2017 11:27:43 Конец правки. 
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаДокумент = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		тмпТаблицаУслуг.Очистить();
		// БИТ_ЖКХ 23.10.2017 11:27:56 Начало правки... 
        тмпТаблицаУслугНЖ.Очистить();
		//Основание = ВыборкаДокумент.Здание;
		Основание = ВыборкаДокумент.Документ;
		// БИТ_ЖКХ 23.10.2017 11:28:00 Конец правки. 
		Выборка = ВыборкаДокумент.Выбрать();
		ЗданиеСсылка = ВыборкаДокумент.Здание; // БИТ_ЖКХ 23.10.2017 11:28:59 
		Пока Выборка.Следующий() Цикл
			
			Контрагент = Неопределено;
            // БИТ_ЖКХ 23.10.2017 11:29:10 Начало правки... 
            ДоговорКонтрагента = Неопределено;
			Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
				Контрагент = Выборка.Контрагент;
                ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
            // БИТ_ЖКХ 23.10.2017 11:29:14 Конец правки.
			ИначеЕсли Выборка.СчетАбонента.Код = "76.КУ" Тогда
				
				Контрагент = мКэшЗначений.Контрагент;
				
			Иначе
				
				СтрокаСубконта = Выборка.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
				
				Если НЕ СтрокаСубконта = Неопределено тогда
					
					НомерСтрокиСубконтоКонтрагент = СтрокаСубконта.НомерСтроки;
					
					Контрагент = Выборка["Субконто" + НомерСтрокиСубконтоКонтрагент];
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Номенклатура = Неопределено;
			
			НомерСтрокиСубконтоНоменклатура = -1;
			
			СтрокаСубконта = Выборка.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто");
			
			Если НЕ СтрокаСубконта = Неопределено Тогда
				
				НомерСтрокиСубконтоНоменклатура = СтрокаСубконта.НомерСтроки;
				
				Номенклатура = Выборка["СубконтоКУ"+НомерСтрокиСубконтоНоменклатура];
				
			КонецЕсли;
			
			НоменклатурнаяГруппа = Неопределено;
			СтавкаНДС            = Неопределено;
			
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				
				НомерСтрокиСубконтоНоменклатурныеГруппы = -1;
				
				СтрокаСубконта = Выборка.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто");
				
				Если НЕ СтрокаСубконта = Неопределено тогда
					
					НомерСтрокиСубконтоНоменклатурныеГруппы = СтрокаСубконта.НомерСтроки;
					
					НоменклатурнаяГруппа = Выборка["СубконтоКУ"+НомерСтрокиСубконтоНоменклатурныеГруппы];
					
				КонецЕсли;
				
				НомерСтрокиСубконтоСтавкиНДС = -1;
				
				СтрокаСубконта = Выборка.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто");
				
				Если НЕ СтрокаСубконта = Неопределено Тогда
					
					НомерСтрокиСубконтоСтавкиНДС = СтрокаСубконта.НомерСтроки;
					
					СтавкаНДС = Выборка["СубконтоКУ"+НомерСтрокиСубконтоСтавкиНДС];
					
				КонецЕсли;
				
			КонецЕсли; 
			
			СчетРасходов = Неопределено;
			
			Если Выборка.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД Тогда
				
				СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
				
			ИначеЕсли Выборка.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД Тогда
				
				СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажЕНВД;
				
			КонецЕсли; 
			// БИТ_ЖКХ 23.10.2017 11:30:16 Начало правки... 
     		Если Выборка.Тариф = 0 Тогда
				Цена = Выборка.ОсновнаяСтавка;
			Иначе
				Цена = Выборка.Тариф;
			КонецЕсли;
            
            Если Выборка.ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение Тогда
                НЖ = Истина;    
            Иначе
                НЖ = Ложь;              
            КонецЕсли;
			// БИТ_ЖКХ 23.10.2017 11:30:26 Конец правки. 
			
			Если НЕ Номенклатура = Неопределено И НЕ Выборка.начислено = 0 Тогда
                    НоваяСтрока = тмпТаблицаУслуг.Добавить();
    				НоваяСтрока.Контрагент               = Контрагент;
    				НоваяСтрока.Номенклатура             = Номенклатура;
    				НоваяСтрока.Количество               = 1;
                    // БИТ_ЖКХ 23.10.2017 11:31:06 Начало правки...                    
                    //НоваяСтрока.Цена                     = Выборка.Начислено;
    				НоваяСтрока.Цена                     = Цена;
                    // БИТ_ЖКХ 23.10.2017 11:31:09 Конец правки.                     
                    НоваяСтрока.Сумма                    = Выборка.Начислено;
    				НоваяСтрока.СтавкаНДС                = СтавкаНДС;
    				НоваяСтрока.СуммаНДС                 = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Выборка.Начислено,Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
    				НоваяСтрока.НоменклатурнаяГруппа     = НоменклатурнаяГруппа;
    				НоваяСтрока.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.Продажи_НДС;
    				НоваяСтрока.ПлановаяСтоимость        = Выборка.Начислено;
    				НоваяСтрока.СуммаПлановая            = Выборка.Начислено;
    				НоваяСтрока.СчетДоходов              = Выборка.СчетКУ;
    				НоваяСтрока.СчетРасходов             = СчетРасходов;
    				НоваяСтрока.ДоговорКонтрагента       = Выборка.ДоговорКонтрагента;
					// БИТ_ЖКХ 23.10.2017 11:31:38 Начало правки... 
					НоваяСтрока.ЛС                       = Выборка.ЛицевойСчет;
                    НоваяСтрока.НЖ                       = НЖ;
                    
                    Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
                    	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По лицевому счету: " + Выборка.ЛицевойСчет + " Контрагент не определен.");
                    КонецЕсли;
                    Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
                    	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По лицевому счету: " + Выборка.ЛицевойСчет + " есть услуги с пустой номенклатурой.");
                    КонецЕсли;
					// БИТ_ЖКХ 23.10.2017 11:31:40 Конец правки. 
			КонецЕсли;
		КонецЦикла; 
		
		ТаблицаУслуг = тмпТаблицаУслуг.Скопировать();
		
		Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагенту И НЕ мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
			// БИТ_ЖКХ 23.10.2017 11:32:43 Начало правки... 
			//ТаблицаУслуг.Свернуть("Номенклатура,
			//|СтавкаНДС, 
			//|НоменклатурнаяГруппа, 
			//|СчетУчетаНДСПоРеализации,
			//|СчетДоходов,
			//|СчетРасходов",
			//"Цена,
			//|Сумма,
			//|СуммаНДС,
			//|ПлановаяСтоимость,
			//|СуммаПлановая");
			ТаблицаУслуг.Свернуть("Номенклатура,
			|СтавкаНДС, 
			|НоменклатурнаяГруппа, 
			|СчетУчетаНДСПоРеализации,
			|СчетДоходов,
			|СчетРасходов,
            |Цена",
			"Сумма,
			|СуммаНДС,
			|ПлановаяСтоимость,
			|СуммаПлановая");
			// БИТ_ЖКХ 23.10.2017 11:32:47 Конец правки. 
			
			Если ТаблицаУслуг.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
			Контрагент         = мКэшЗначений.Контрагент;
			ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			МассивВидовДоговоров = Новый Массив;
			МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
			Если ЗначениеЗаполнено(ВыборкаДокумент.ДоговорКонтрагента) Тогда
				ДоговорКонтрагента = ВыборкаДокумент.ДоговорКонтрагента;
			Иначе	
				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
			КонецЕсли;
			
			// БИТ_ЖКХ 23.10.2017 11:33:14 Начало правки... 
			//СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг);
			СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг, ЗданиеСсылка, );
			// БИТ_ЖКХ 23.10.2017 11:33:15 Конец правки. 
			
		Иначе
			// БИТ_ЖКХ 23.10.2017 11:34:25 Начало правки... 
			//ТаблицаУслуг.Свернуть("Контрагент,
			//|ДоговорКонтрагента,
			//|Номенклатура,
			//|СтавкаНДС, 
			//|НоменклатурнаяГруппа, 
			//|СчетУчетаНДСПоРеализации,
			//|СчетДоходов,
			//|СчетРасходов",
			//"Цена,
			//|Сумма,
			//|СуммаНДС,
			//|ПлановаяСтоимость,
			//|СуммаПлановая");
			//
			//Запрос = Новый Запрос;
			//Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслуг);
			//
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ТаблицаУслуг.Контрагент,
			//|	ТаблицаУслуг.ДоговорКонтрагента,
			//|	ТаблицаУслуг.Номенклатура,
			//|	ТаблицаУслуг.СтавкаНДС,
			//|	ТаблицаУслуг.НоменклатурнаяГруппа,
			//|	ТаблицаУслуг.СчетУчетаНДСПоРеализации,
			//|	ТаблицаУслуг.СчетДоходов,
			//|	ТаблицаУслуг.СчетРасходов,
			//|	ТаблицаУслуг.Цена,
			//|	ТаблицаУслуг.Сумма,
			//|	ТаблицаУслуг.СуммаНДС,
			//|	ТаблицаУслуг.ПлановаяСтоимость,
			//|	ТаблицаУслуг.СуммаПлановая
			//|ПОМЕСТИТЬ ТабУслуг
			//|ИЗ
			//|	&ТаблицаУслуг КАК ТаблицаУслуг
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	ТабУслуг.Контрагент КАК Контрагент,
			//|	ТабУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
			//|	ТабУслуг.Номенклатура КАК Номенклатура,
			//|	ТабУслуг.СтавкаНДС,
			//|	ТабУслуг.НоменклатурнаяГруппа,
			//|	ТабУслуг.СчетУчетаНДСПоРеализации,
			//|	ТабУслуг.СчетДоходов,
			//|	ТабУслуг.СчетРасходов,
			//|	ТабУслуг.Цена,
			//|	ТабУслуг.Сумма,
			//|	ТабУслуг.СуммаНДС,
			//|	ТабУслуг.ПлановаяСтоимость,
			//|	ТабУслуг.СуммаПлановая
			//|ИЗ
			//|	ТабУслуг КАК ТабУслуг
			//|ГДЕ
			//|	НЕ ТабУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			//|	И НЕ ТабУслуг.Контрагент ЕСТЬ NULL
			//|ИТОГИ ПО
			//|	Контрагент,
			//|	ДоговорКонтрагента";
			//
			//ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//Пока ВыборкаКонтрагент.Следующий() Цикл // Обход контрагентов.
			//	
			//	Контрагент         = ВыборкаКонтрагент.Контрагент;
			//	ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			//	МассивВидовДоговоров = Новый Массив;
			//	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			//	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
			//	ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
			//	
			//	ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//	Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
			//		
			//		Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
			//			ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
			//		КонецЕсли;
			//		Выборка = ВыборкаДоговорКонтрагента.Выбрать();
			//		СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка);
			//		
			//	КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
			//	
			//КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
			
			Отбор = Новый Структура;
            Отбор.Вставить("НЖ", ЛОЖЬ);
            ТаблицаУслугЖ = ТаблицаУслуг.Скопировать(Отбор);    
            Отбор.Вставить("НЖ", Истина);
            ТаблицаУслугНЖ = ТаблицаУслуг.Скопировать(Отбор);    
            
            Если ТаблицаУслугЖ.Количество() > 0 Тогда
    			ТаблицаУслугЖ.Свернуть("Контрагент,
    			|ДоговорКонтрагента,
    			|Номенклатура,
    			|СтавкаНДС, 
    			|НоменклатурнаяГруппа, 
    			|СчетУчетаНДСПоРеализации,
    			|СчетДоходов,
    			|СчетРасходов,
                |Цена",
    			"Сумма,
    			|СуммаНДС,
    			|ПлановаяСтоимость,
    			|СуммаПлановая");
    			
    			Запрос = Новый Запрос;
    			Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслугЖ);
    			
    			Запрос.Текст = 
    			"ВЫБРАТЬ
    			|	ТаблицаУслуг.Контрагент,
    			|	ТаблицаУслуг.ДоговорКонтрагента,
    			|	ТаблицаУслуг.Номенклатура,
    			|	ТаблицаУслуг.СтавкаНДС,
    			|	ТаблицаУслуг.НоменклатурнаяГруппа,
    			|	ТаблицаУслуг.СчетУчетаНДСПоРеализации,
    			|	ТаблицаУслуг.СчетДоходов,
    			|	ТаблицаУслуг.СчетРасходов,
    			|	ТаблицаУслуг.Цена,
    			|	ТаблицаУслуг.Сумма,
    			|	ТаблицаУслуг.СуммаНДС,
    			|	ТаблицаУслуг.ПлановаяСтоимость,
    			|	ТаблицаУслуг.СуммаПлановая
    			|ПОМЕСТИТЬ ТабУслуг
    			|ИЗ
    			|	&ТаблицаУслуг КАК ТаблицаУслуг
    			|;
    			|
    			|////////////////////////////////////////////////////////////////////////////////
    			|ВЫБРАТЬ
    			|	ЕСТЬNULL(ТабУслуг.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
    			|	ТабУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
    			|	ТабУслуг.Номенклатура КАК Номенклатура,
    			|	ТабУслуг.СтавкаНДС,
    			|	ТабУслуг.НоменклатурнаяГруппа,
    			|	ТабУслуг.СчетУчетаНДСПоРеализации,
    			|	ТабУслуг.СчетДоходов,
    			|	ТабУслуг.СчетРасходов,
    			|	ТабУслуг.Цена,
    			|	ТабУслуг.Сумма,
    			|	ТабУслуг.СуммаНДС,
    			|	ТабУслуг.ПлановаяСтоимость,
    			|	ТабУслуг.СуммаПлановая
    			|ИЗ
    			|	ТабУслуг КАК ТабУслуг
				//|ГДЕ
				//|	НЕ ТабУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				//|	И НЕ ТабУслуг.Контрагент ЕСТЬ NULL
    			|ИТОГИ ПО
    			|	Контрагент,
    			|	ДоговорКонтрагента";
    			
    			ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    			Пока ВыборкаКонтрагент.Следующий() Цикл // Обход контрагентов.
    				
    				Контрагент         = ВыборкаКонтрагент.Контрагент;
    				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
    				МассивВидовДоговоров = Новый Массив;
    				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
    				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
    				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
    				
    				ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
                        

                        //УИД = СгенерироватьИдентификатор(ТаблицаУслуг,Контрагент,ВыборкаДоговорКонтрагента.ДоговорКонтрагента,ЛОЖЬ);
                        
                        Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
    						ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
    					КонецЕсли;
    					Выборка = ВыборкаДоговорКонтрагента.Выбрать();
    					СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка, ЗданиеСсылка, Неопределено);
    					
    				КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
    				
    			КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
            КонецЕсли;           
            
            //Для нежилых помещений
            //На каждого договора должен быть один ЛС - объязательно
            Если ТаблицаУслугНЖ.Количество() > 0 Тогда
    			ТаблицаУслугНЖ.Свернуть("Контрагент,
    			|ДоговорКонтрагента,
    			|Номенклатура,
    			|СтавкаНДС, 
    			|НоменклатурнаяГруппа, 
    			|СчетУчетаНДСПоРеализации,
    			|СчетДоходов,
    			|СчетРасходов,
                |ЛС,
                |Цена",
    			"Сумма,
    			|СуммаНДС,
    			|ПлановаяСтоимость,
    			|СуммаПлановая");
    			
    			Запрос = Новый Запрос;
    			Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслугНЖ);
    			
    			Запрос.Текст = 
    			"ВЫБРАТЬ
    			|	ТаблицаУслуг.Контрагент КАК Контрагент,
    			|	ТаблицаУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
    			|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
    			|	ТаблицаУслуг.СтавкаНДС КАК СтавкаНДС,
    			|	ТаблицаУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
    			|	ТаблицаУслуг.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
    			|	ТаблицаУслуг.СчетДоходов КАК СчетДоходов,
    			|	ТаблицаУслуг.СчетРасходов КАК СчетРасходов,
    			|	ТаблицаУслуг.ЛС КАК ЛС,
    			|	ТаблицаУслуг.Цена КАК Цена,
    			|	ТаблицаУслуг.Сумма КАК Сумма,
    			|	ТаблицаУслуг.СуммаНДС КАК СуммаНДС,
    			|	ТаблицаУслуг.ПлановаяСтоимость КАК ПлановаяСтоимость,
    			|	ТаблицаУслуг.СуммаПлановая КАК СуммаПлановая
    			|ПОМЕСТИТЬ ТабУслуг
    			|ИЗ
    			|	&ТаблицаУслуг КАК ТаблицаУслуг
    			|;
    			|
    			|////////////////////////////////////////////////////////////////////////////////
    			|ВЫБРАТЬ
    			|	ЕСТЬNULL(ТабУслуг.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
    			|	ТабУслуг.ЛС КАК ЛС,
    			|	ТабУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
    			|	ТабУслуг.Номенклатура КАК Номенклатура,
    			|	ТабУслуг.СтавкаНДС КАК СтавкаНДС,
    			|	ТабУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
    			|	ТабУслуг.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
    			|	ТабУслуг.СчетДоходов КАК СчетДоходов,
    			|	ТабУслуг.СчетРасходов КАК СчетРасходов,
    			|	ТабУслуг.Цена КАК Цена,
    			|	ТабУслуг.Сумма КАК Сумма,
    			|	ТабУслуг.СуммаНДС КАК СуммаНДС,
    			|	ТабУслуг.ПлановаяСтоимость КАК ПлановаяСтоимость,
    			|	ТабУслуг.СуммаПлановая КАК СуммаПлановая
    			|ИЗ
    			|	ТабУслуг КАК ТабУслуг
				//|ГДЕ
				//|	НЕ ТабУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
 				//|   И НЕ ТабУслуг.Контрагент ЕСТЬ NULL
   				|ИТОГИ ПО
    			|	Контрагент,
    			|	ДоговорКонтрагента,
    			|	ЛС";
    			
    			ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    			Пока ВыборкаКонтрагент.Следующий() Цикл // Обход контрагентов.
    				
    				Контрагент         = ВыборкаКонтрагент.Контрагент;
    				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
    				МассивВидовДоговоров = Новый Массив;
    				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
    				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
    				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
    				ЛС = "";
    				ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
                        
    					Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
    						ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
    					КонецЕсли;
    					ВыборкаЛС = ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
                        Пока ВыборкаЛС.Следующий() Цикл
                            Если ЗначениеЗаполнено(ВыборкаЛС.ЛС) Тогда
                              ЛС =  ВыборкаЛС.ЛС;
                            КонецЕсли; 
                            Выборка = ВыборкаЛС.Выбрать();
        					СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка, ЗданиеСсылка, ЛС, Истина);
                        КонецЦикла; 
    				КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
    				
    			КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
            КонецЕсли;
            // БИТ_ЖКХ 23.10.2017 11:35:03 Конец правки. 
            
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервере
Процедура СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, ДокументОснование, ДанныеТаблицы, ЗданиеСсылка, ЛС, НежилоеПомещение = Ложь)
	
	// БИТ_ЖКХ 23.10.2017 11:20:58 Начало правки...
	//СсылкаДокументРеализация = НайтиДокументНаРеализацию(Контрагент, ДоговорКонтрагента, ДокументОснование);
	СсылкаДокументРеализация = НайтиДокументНаРеализацию(Контрагент, ДоговорКонтрагента, ЗданиеСсылка, ЛС);
	// БИТ_ЖКХ 23.10.2017 11:21:03 Конец правки. 
	
	Если (НЕ ЗначениеЗаполнено(СсылкаДокументРеализация)) Тогда
		ДокументРеализация = Документы[Объект.ДокументРаспределенияРасходовНаОказаниеУслуг].СоздатьДокумент();
	Иначе
		ДокументРеализация = СсылкаДокументРеализация.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументРеализация.Проведен Тогда
		
		Если НЕ  бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.ОтменаПроведения,,"Ошибки") Тогда
			Возврат;
		КонецЕсли; 
		
	КонецЕсли; 
	// БИТ_ЖКХ 23.10.2017 11:21:49 Начало правки... 
	Если ДокументРеализация.ПометкаУдаления Тогда
		Сообщить("Пометка на удаления снята с документа: "+ДокументРеализация);
        ДокументРеализация.ПометкаУдаления = Ложь;
	КонецЕсли;
	// БИТ_ЖКХ 23.10.2017 11:21:52 Конец правки. 
	ДокументРеализация.Услуги.Очистить();
	
	Попытка
		ДокументРеализация.Товары.Очистить();
	Исключение
		
	КонецПопытки;
	
	ДокументРеализация.Дата                = КонецМесяца(Объект.ДатаЗакрытия) - 1;
	ДокументРеализация.Организация         = Объект.Организация;
	ДокументРеализация.Ответственный       = мОтветственный;
	ДокументРеализация.Контрагент          = Контрагент;
	ДокументРеализация.ДоговорКонтрагента  = ДоговорКонтрагента;
	ДокументРеализация.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	// БИТ_ЖКХ 23.10.2017 11:22:31 Начало правки... 
	//ДокументРеализация.Комментарий         = "На основании " + ДокументОснование;
	//ДокументРеализация.ВалютаДокумента     = Константы.ВалютаРегламентированногоУчета.Получить();          
    ДокументРеализация.Комментарий         = Строка(ЗданиеСсылка.Улица)+", д. "+Строка(ЗданиеСсылка.Наименование)+?(ПустаяСтрока(ЗданиеСсылка.Корпус),"",", кор. "+ЗданиеСсылка.Корпус) +?(ЗначениеЗаполнено(ЛС),"Л/сч "+ЛС,"")+" \ Документ создан автоматически при закрытии месяца \ дата создания " + ТекущаяДата();
	//16.05.2019
	если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг <> "АктОбОказанииПроизводственныхУслуг" тогда
	
     ДокументРеализация.бит_Здание          = ЗданиеСсылка;
     ДокументРеализация.бит_ЛицевойСчет     = ЛС;
	 
	конецесли; 
	// БИТ_ЖКХ 23.10.2017 11:22:33 Конец правки. 
	ДокументРеализация.ВалютаДокумента     = Константы.ВалютаРегламентированногоУчета.Получить();          
	ДокументРеализация.СуммаВключаетНДС    = Истина;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Контрагент, ДоговорКонтрагента);
	
	ДокументРеализация.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
	ДокументРеализация.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
	
	СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументРеализация.ВалютаДокумента, ДокументРеализация.Дата);
	
	ДокументРеализация.КурсВзаиморасчетов      = СтруктураКурсаДокумента.Курс;
	ДокументРеализация.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
	
	ДокументРеализация.бит_ДокументОснование = ДокументОснование;
	
	Если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "АктОбОказанииПроизводственныхУслуг" Тогда
		
		ДокументРеализация.СчетЗатрат           = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
		ДокументРеализация.ПодразделениеЗатрат  = Объект.ПодразделениеЗатрат;
		ДокументРеализация.НоменклатурнаяГруппа = Объект.НоменклатурнаяГруппа;
		
	Иначе
		ДокументРеализация.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		
		ДокументРеализация.Склад = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
	КонецЕсли;
	
		
	Если ТипЗнч(ДанныеТаблицы) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		
		Пока ДанныеТаблицы.Следующий() Цикл
			
			ЗаполнитьДанныеДокументаРеализации(ДанныеТаблицы, ДокументРеализация);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеТаблицы) = Тип("ТаблицаЗначений") Тогда 
		
		Для каждого СтрокаТаблицы Из ДанныеТаблицы Цикл
			
			ЗаполнитьДанныеДокументаРеализации(СтрокаТаблицы, ДокументРеализация);
			
		КонецЦикла;
		
	КонецЕсли;
    // БИТ_ЖКХ 23.10.2017 11:23:12 Начало правки... 	
	//Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.Проведение,,) И Объект.ФормироватьСчетФактураВыданный Тогда
	//	ФормироватьСчетФактуру(ДокументРеализация.Ссылка);
	//КонецЕсли;
	
	// БИТ ЖКХ 19.06.2020
	если Объект.ВидОперацииУслуги = истина тогда
		ДокументРеализация.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги;
		ДокументРеализация.бит_Здание = неопределено;
	конецесли;	

	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.Запись,,);
		Возврат;
	КонецЕсли;
	
	Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.Проведение,,) Тогда
		Если Объект.ФормироватьСчетФактураВыданный Тогда
			ФормироватьСчетФактуру(ДокументРеализация.Ссылка);
		КонецЕсли; 
		Если Объект.ФормироватьСчетНаОплату И НежилоеПомещение Тогда
			ФормироватьСчетНаОплату(ДокументРеализация.Ссылка);
		КонецЕсли
	КонецЕсли;
    // БИТ_ЖКХ 23.10.2017 11:23:29 Конец правки. 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДокументаРеализации(Источник, ДокументРеализация)
	
	ИмяТаблицы = "Услуги";
	
	Если НЕ Источник.Номенклатура.Услуга И Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "РеализацияТоваровУслуг" Тогда
		ИмяТаблицы = "Товары";
	КонецЕсли;
	
	НоваяСтрока = ДокументРеализация[ИмяТаблицы].Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Субконто   = Источник.НоменклатурнаяГруппа;
	
	// БИТ_ЖКХ 23.10.2017 11:20:04 Начало правки... 
	Если Источник.Цена = 0 ИЛИ Источник.Цена = Неопределено Тогда 
		НоваяСтрока.Количество      = 1;
        НоваяСтрока.Цена            = Источник.Сумма;
	Иначе 
		НоваяСтрока.Количество = Формат(Источник.Сумма / Источник.Цена,"ЧЦ=10; ЧДЦ=4");
	КонецЕсли;	
	// БИТ_ЖКХ 23.10.2017 11:20:11 Конец правки. 
	Если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "РеализацияТоваровУслуг" Тогда
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументРеализация.Организация,
		
		НоваяСтрока.Номенклатура,
		ДокументРеализация.Склад,
		ДокументРеализация.Дата,
		ДокументРеализация.ДеятельностьНаПатенте);
	Иначе
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументРеализация.Организация,
		НоваяСтрока.Номенклатура,
		,
		ДокументРеализация.Дата,
		ДокументРеализация.ДеятельностьНаПатенте);
	КонецЕсли; 
	
	
	Если ИмяТаблицы = "Товары" Тогда
		НоваяСтрока.СчетУчета  = СчетаУчета.СчетУчета;
	ИначеЕсли Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "РеализацияТоваровУслуг" Тогда
		НоваяСтрока.Содержание = НоваяСтрока.Номенклатура.НаименованиеПолное;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСчетФактуру(ДокументСсылка)
	
	// Попытаемся найти счет-фактуру.
	
	СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокументСсылка, "СчетФактураВыданный");
	
	Если (ДокументСсылка.ПометкаУдаления) И Не ЗначениеЗаполнено(СчетФактура) Тогда
		ВызватьИсключение "Документ: "+ ДокументСсылка +"помечен на удаление";
		Возврат;
	КонецЕсли;
	
	ОбъектСчетаФактуры = Неопределено;
	
	// Если потерпели неудачу, то необходимо ввести новый документ. 
	Если (НЕ ЗначениеЗаполнено(СчетФактура)) Тогда
		// Вводим новый документ на основании нашего.
		ОбъектСчетаФактуры = Документы.СчетФактураВыданный.СоздатьДокумент();
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбъектСчетаФактуры.ДокументыОснования.Очистить();
	ОбъектСчетаФактуры.ВидСчетаФактуры = Неопределено;
	
	Попытка
		ОбъектРеализация = ДокументСсылка.ПолучитьОбъект();
		ОбъектРеализация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		Если ОбъектСчетаФактуры.Проведен Тогда
			
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ОбъектСчетаФактуры,РежимЗаписиДокумента.ОтменаПроведения,,);
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	ОбъектСчетаФактуры.Заполнить(ДокументСсылка);
	ОбъектСчетаФактуры.Ответственный = ДокументСсылка.Ответственный;
	ОбъектСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;

	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ОбъектСчетаФактуры,РежимЗаписиДокумента.Проведение,,);
	
КонецПроцедуры

// БИТ_ЖКХ 23.10.2017 11:36:50 Начало правки... 
&НаСервере
Процедура ФормироватьСчетНаОплату(ДокументСсылка)
	
	ДокСчет = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка,
	|	СчетНаОплатуПокупателю.ПометкаУдаления
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.бит_ДокРеализации = &ДокРеализации";
	
	Запрос.УстановитьПараметр("ДокРеализации", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокСчет = ВыборкаДетальныеЗаписи.Ссылка;
		ПомеченНаУд = ВыборкаДетальныеЗаписи.ПометкаУдаления;
	КонецЦикла;	
	
	Если ДокСчет <> Документы.СчетНаОплатуПокупателю.ПустаяСсылка() Тогда
		Если ПомеченНаУд Тогда
			Сообщить("Пометка на удаления снята с документа: "+ДокСчет);
		КонецЕсли;
		ДокументСчет = ДокСчет.ПолучитьОбъект();
        ДокументСчет.ПометкаУдаления = ЛОЖЬ;
	Иначе
		ДокументСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	КонецЕсли;
	
	//ДокументСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	//ДокументСсылка = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
	ДокументСчет.бит_ДокРеализации = ДокументСсылка;
	//17.05.2019
	если Строка(ТипЗнч(ДокументСсылка)) <> "Оказание производственных услуг" тогда
	 ДокументСчет.бит_ЛицевойСчет = ДокументСсылка.бит_ЛицевойСчет;
	конецесли; 
	ДокументСчет.бит_ПериодСчета = Формат(ДокументСсылка.Дата, "ДФ=""ММММ гггг 'г.'""");
    ДокументСчет.ОрганизацияПолучатель = ДокументСсылка.Организация;
	ДокументСчет.СтруктурнаяЕдиница = ДокументСсылка.Организация.ОсновнойБанковскийСчет;
	ДокументСчет.Дата = ДокументСсылка.Дата;
	ДокументСчет.Ответственный = ДокументСсылка.Ответственный;
	ДокументСчет.Комментарий = ДокументСсылка.Комментарий;
	ДокументСчет.Заполнить(ДокументСсылка);
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументСчет,РежимЗаписиДокумента.Запись,,);
	
	
КонецПроцедуры
// БИТ_ЖКХ 23.10.2017 11:36:55 Конец правки.

&НаСервере
Функция НайтиДокументНаРеализацию(Контрагент, ДоговорКонтрагента, Здание, ЛС)	
	
	ДокументРеализации = Неопределено;
	// БИТ_ЖКХ 23.10.2017 11:18:05 Начало правки... 
	ЗапросУсл="";
    Если ЗначениеЗаполнено(ЛС) Тогда
        ЗапросУсл =  "
        |	И ДокументРеализации.бит_ЛицевойСчет = &бит_ЛицевойСчет";
	КонецЕсли; 
	
	//16.05.2019
	ДопЗапрос = "";
	// 23.06.2020
	если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг <> "АктОбОказанииПроизводственныхУслуг" тогда
		ДопЗапрос = " И ( ДокументРеализации.бит_Здание = &бит_Здание " + строка(" ИЛИ  ") + 
		                строка(" ДокументРеализации.бит_Здание = &пустоеЗдание) ") +   
		                     ЗапросУсл + " ";
	конецесли;	
	
	// БИТ_ЖКХ 23.10.2017 11:18:10 Конец правки. 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент"        , Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	// БИТ_ЖКХ 23.10.2017 11:17:43 Начало правки... 
	//Запрос.УстановитьПараметр("ДокументОснование" , ДокументОснование);
	Запрос.УстановитьПараметр("бит_Здание" , Здание);
	Запрос.УстановитьПараметр("пустоеЗдание" , справочники.бит_СписокЗданий.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидОперации" ,Перечисления.ВидыОперацийРеализацияТоваров.Услуги);

	Запрос.УстановитьПараметр("бит_ЛицевойСчет" , ЛС);
    Запрос.УстановитьПараметр("ДатаНач"        , НачалоМесяца(Объект.ДатаЗакрытия));
	Запрос.УстановитьПараметр("ДатаКон"        , КонецМесяца(Объект.ДатаЗакрытия));
	// БИТ_ЖКХ 23.10.2017 11:17:45 Конец правки. 
	
	Запрос.Текст = 
	// БИТ_ЖКХ 23.10.2017 11:17:11 Начало правки...
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	//|	ДокументРеализации.Ссылка
	//|ИЗ
	//|	Документ."+Объект.ДокументРаспределенияРасходовНаОказаниеУслуг+" КАК ДокументРеализации
	//|ГДЕ
	//|	ДокументРеализации.бит_ДокументОснование = &ДокументОснование
	//|	И ДокументРеализации.Контрагент = &Контрагент
	//|	И ДокументРеализации.ДоговорКонтрагента = &ДоговорКонтрагента";

	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДокументРеализации.Ссылка
	|ИЗ
	|	Документ."+Объект.ДокументРаспределенияРасходовНаОказаниеУслуг+" КАК ДокументРеализации
	|ГДЕ
	|	ДокументРеализации.Контрагент = &Контрагент "
	+ ДопЗапрос + "	
//	|	И ДокументРеализации.бит_Здание = &бит_Здание"+ЗапросУсл+"	
	|	И ДокументРеализации.ДоговорКонтрагента = &ДоговорКонтрагента
	| 	И ДокументРеализации.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	// БИТ_ЖКХ 23.10.2017 11:17:21 Конец правки. 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДокументРеализации = Выборка.Ссылка;
		
	КонецЕсли; 
	
	Возврат ДокументРеализации;
	
КонецФункции

&НаСервере
// Процедура обновляет параметры настроек ЖКХ из регистра актуальным значением.
//
Процедура ОбновитьПараметрыЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"         , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта", Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"    , Ложь);
	ПараметрыЖКХ.Вставить("ОбщедомовыеРасходыВГрафеНачисления" , Ложь);
	ПараметрыЖКХ.Вставить("СчетчикиПодкрутка"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"          , Ложь);   
	ПараметрыЖКХ.Вставить("УчитыватьПерерасчет"                , Ложь);
	ПараметрыЖКХ.Вставить("СчетАбонента"                       , Неопределено);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика" , Ложь);
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика" , Ложь);
	ПараметрыЖКХ.Вставить("ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц", Ложь);
	ПараметрыЖКХ.Вставить("Контрагент"                             , Неопределено);
	ПараметрыЖКХ.Вставить("ФормироватьАктИРеализациюПоКонтрагенту" , Ложь);
	ПараметрыЖКХ.Вставить("УчитыватьНачисленияПоГрупповымСчетчикам", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(Объект.ДатаЗакрытия), Объект.Организация, ПараметрыЖКХ);
	
	ЗаполнитьЗначенияСвойств(мКэшЗначений, ПараметрыЖКХ);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период"     , Объект.ДатаЗакрытия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитика.ПорядокРаспределенияРасходовНаОказаниеУслуг
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитика";
	
	мКэшЗначений.ПорядокРаспределенияРасходовНаОказаниеУслуг = Неопределено;

	//Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = Элементы.ДокументРаспределенияРасходовНаОказаниеУслуг.СписокВыбора[1].Значение;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПериода()
	
	// Обновляем представление периода на форме.
	ПредставлениеПериодаРегистрации = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"),
	Объект.ДатаЗакрытия, 
	КонецМесяца(Объект.ДатаЗакрытия));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаЗакрытия = РезультатВыбора.КонецПериода;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАктРеализациюРазовые()
	
	тмпТаблицаУслуг = Новый ТаблицаЗначений;
	тмпТаблицаУслуг.Колонки.Добавить("Контрагент"              , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тмпТаблицаУслуг.Колонки.Добавить("Номенклатура"            , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тмпТаблицаУслуг.Колонки.Добавить("Количество"              , ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	тмпТаблицаУслуг.Колонки.Добавить("Цена"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("Сумма"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СтавкаНДС"               , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаНДС"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("НоменклатурнаяГруппа"    , Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетУчетаНДСПоРеализации", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ПлановаяСтоимость"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаПлановая"           , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СчетДоходов"             , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетРасходов"            , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ДоговорКонтрагента"      , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Документ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Услуга");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Контрагент");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетАбонента");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетКУ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Начислено");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДоговорКонтрагента");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "УчетСобственныхУслугРазовые";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаДокумент = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Выборка = ВыборкаДокумент.Выбрать();
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		тмпТаблицаУслуг.Очистить();
		
		Основание = ВыборкаДокумент.Документ;
		
		ТаблицаУслугВЦикле(тмпТаблицаУслуг,ВыборкаДокумент);		
		Пока ВыборкаДокумент.Следующий() Цикл
			ТаблицаУслугВЦикле(тмпТаблицаУслуг,ВыборкаДокумент);
		КонецЦикла; 
		
		ТаблицаУслуг = тмпТаблицаУслуг.Скопировать();
		
		Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагенту И НЕ мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
			ТаблицаУслуг.Свернуть("Номенклатура,
			|СтавкаНДС, 
			|НоменклатурнаяГруппа, 
			|СчетУчетаНДСПоРеализации,
			|СчетДоходов,
			|СчетРасходов",
			"Цена,
			|Сумма,
			|СуммаНДС,
			|ПлановаяСтоимость,
			|СуммаПлановая");
			
			Если ТаблицаУслуг.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
			Контрагент         = мКэшЗначений.Контрагент;
			ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			МассивВидовДоговоров = Новый Массив;
			МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
			Если ЗначениеЗаполнено(ВыборкаДокумент.ДоговорКонтрагента) Тогда
				ДоговорКонтрагента = ВыборкаДокумент.ДоговорКонтрагента;
			Иначе	
				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
			КонецЕсли;
			
			// БИТ_ЖКХ 23.10.2017 11:35:36 Конец правки. 
			//СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг);
			СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг,,);
			// БИТ_ЖКХ 23.10.2017 11:35:37 Конец правки. 
			
		Иначе
			
			ТаблицаУслуг.Свернуть("Контрагент,
			|ДоговорКонтрагента,
			|Номенклатура,
			|СтавкаНДС, 
			|НоменклатурнаяГруппа, 
			|СчетУчетаНДСПоРеализации,
			|СчетДоходов,
			|СчетРасходов",
			"Цена,
			|Сумма,
			|СуммаНДС,
			|ПлановаяСтоимость,
			|СуммаПлановая");
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслуг);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаУслуг.Контрагент,
			|	ТаблицаУслуг.ДоговорКонтрагента,
			|	ТаблицаУслуг.Номенклатура,
			|	ТаблицаУслуг.СтавкаНДС,
			|	ТаблицаУслуг.НоменклатурнаяГруппа,
			|	ТаблицаУслуг.СчетУчетаНДСПоРеализации,
			|	ТаблицаУслуг.СчетДоходов,
			|	ТаблицаУслуг.СчетРасходов,
			|	ТаблицаУслуг.Цена,
			|	ТаблицаУслуг.Сумма,
			|	ТаблицаУслуг.СуммаНДС,
			|	ТаблицаУслуг.ПлановаяСтоимость,
			|	ТаблицаУслуг.СуммаПлановая
			|ПОМЕСТИТЬ ТабУслуг
			|ИЗ
			|	&ТаблицаУслуг КАК ТаблицаУслуг
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабУслуг.Контрагент КАК Контрагент,
			|	ТабУслуг.ДоговорКонтрагента,
			|	ТабУслуг.Номенклатура КАК Номенклатура,
			|	ТабУслуг.СтавкаНДС,
			|	ТабУслуг.НоменклатурнаяГруппа,
			|	ТабУслуг.СчетУчетаНДСПоРеализации,
			|	ТабУслуг.СчетДоходов,
			|	ТабУслуг.СчетРасходов,
			|	ТабУслуг.Цена,
			|	ТабУслуг.Сумма,
			|	ТабУслуг.СуммаНДС,
			|	ТабУслуг.ПлановаяСтоимость,
			|	ТабУслуг.СуммаПлановая
			|ИЗ
			|	ТабУслуг КАК ТабУслуг
			|ИТОГИ ПО
			|	Контрагент,
			|	ДоговорКонтрагента";
			
			ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				Контрагент         = ВыборкаКонтрагент.Контрагент;
				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				МассивВидовДоговоров = Новый Массив;
				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
				
				ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
					
					Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
						ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
					КонецЕсли;
					Выборка = ВыборкаДоговорКонтрагента.Выбрать();
					// БИТ_ЖКХ 23.10.2017 11:35:56 Начало правки... 
					//СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка);
					СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка,,);
					// БИТ_ЖКХ 23.10.2017 11:35:57 Конец правки. 
					
				КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
				
			КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаУслугВЦикле(тмпТаблицаУслуг,ВыборкаДокумент)
	
	Контрагент = Неопределено;
	
	Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
		Контрагент = ВыборкаДокумент.Контрагент;
	ИначеЕсли ВыборкаДокумент.СчетАбонента.Код = "76.КУ" Тогда
		
		Контрагент = мКэшЗначений.Контрагент;
		
	Иначе
		
		СтрокаСубконта = ВыборкаДокумент.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
		
		Если НЕ СтрокаСубконта = Неопределено тогда
			
			НомерСтрокиСубконтоКонтрагент = СтрокаСубконта.НомерСтроки;
			
			Контрагент = ВыборкаДокумент["Субконто" + НомерСтрокиСубконтоКонтрагент];
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Номенклатура = Неопределено;
	
	НомерСтрокиСубконтоНоменклатура = -1;
	
	СтрокаСубконта = ВыборкаДокумент.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто");
	
	Если НЕ СтрокаСубконта = Неопределено Тогда
		
		НомерСтрокиСубконтоНоменклатура = СтрокаСубконта.НомерСтроки;
		
		Номенклатура = ВыборкаДокумент["СубконтоКУ"+НомерСтрокиСубконтоНоменклатура];
		
	КонецЕсли;
	
	НоменклатурнаяГруппа = Неопределено;
	СтавкаНДС            = Неопределено;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		НомерСтрокиСубконтоНоменклатурныеГруппы = -1;
		
		СтрокаСубконта = ВыборкаДокумент.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто");
		
		Если НЕ СтрокаСубконта = Неопределено тогда
			
			НомерСтрокиСубконтоНоменклатурныеГруппы = СтрокаСубконта.НомерСтроки;
			
			НоменклатурнаяГруппа = ВыборкаДокумент["СубконтоКУ"+НомерСтрокиСубконтоНоменклатурныеГруппы];
			
		КонецЕсли;
		
		НомерСтрокиСубконтоСтавкиНДС = -1;
		
		СтрокаСубконта = ВыборкаДокумент.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто");
		
		Если НЕ СтрокаСубконта = Неопределено Тогда
			
			НомерСтрокиСубконтоСтавкиНДС = СтрокаСубконта.НомерСтроки;
			
			СтавкаНДС = ВыборкаДокумент["СубконтоКУ"+НомерСтрокиСубконтоСтавкиНДС];
			
		КонецЕсли;
		
	КонецЕсли; 
	
	СчетРасходов = Неопределено;
	
	Если ВыборкаДокумент.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД Тогда
		
		СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
		
	ИначеЕсли ВыборкаДокумент.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД Тогда
		
		СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажЕНВД;
		
	КонецЕсли; 
	
	Если НЕ Номенклатура = Неопределено И НЕ ВыборкаДокумент.начислено = 0 Тогда
		
		НоваяСтрока = тмпТаблицаУслуг.Добавить();
		
		НоваяСтрока.Контрагент               = Контрагент;
		НоваяСтрока.Номенклатура             = Номенклатура;
		НоваяСтрока.Количество               = 1;
		НоваяСтрока.Цена                     = ВыборкаДокумент.Начислено;
		НоваяСтрока.Сумма                    = ВыборкаДокумент.Начислено;
		НоваяСтрока.СтавкаНДС                = СтавкаНДС;
		
		НоваяСтрока.СуммаНДС                 = УчетНДСКлиентСервер.РассчитатьСуммуНДС(ВыборкаДокумент.Начислено,Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
		
		НоваяСтрока.НоменклатурнаяГруппа     = НоменклатурнаяГруппа;
		НоваяСтрока.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.Продажи_НДС;
		НоваяСтрока.ПлановаяСтоимость        = ВыборкаДокумент.Начислено;
		НоваяСтрока.СуммаПлановая            = ВыборкаДокумент.Начислено;
		НоваяСтрока.СчетДоходов              = ВыборкаДокумент.СчетКУ;
		НоваяСтрока.СчетРасходов             = СчетРасходов;
		НоваяСтрока.ДоговорКонтрагента       = ВыборкаДокумент.ДоговорКонтрагента;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРаспределениеАванса()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументРаспределениеАванса");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "РаспределениеАванса";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
	
	ДокументыНаПроведение = Новый Массив;
	Если Объект.ВыполнитьРаспределениеАванса Тогда
		
		МассивПовторов = Новый Массив;
		
		// Сброс данных по текущим документам.
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ДокументРаспределениеАванса) 
				И МассивПовторов.Найти(Выборка.ДокументРаспределениеАванса) = Неопределено Тогда
				
				МассивПовторов.Добавить(Выборка.ДокументРаспределениеАванса);
				
				ДокументРаспределениеАванса = Выборка.ДокументРаспределениеАванса.ПолучитьОбъект();
				
				Если ДокументРаспределениеАванса.ПометкаУдаления Тогда
					ДокументРаспределениеАванса.УстановитьПометкуУдаления(Ложь);
				КонецЕсли; 
				
				ДокументРаспределениеАванса.СписокУслугПоПериоду.Очистить();
				ДокументРаспределениеАванса.СуммаДокумента = 0;
				ДокументРаспределениеАванса.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Выборка.Сбросить();
		МассивПовторов.Очистить();
		
		// Пререзаполнение и создание новых документов.
		Пока Выборка.Следующий() Цикл
			
			// Проверка повторного проведения (документ на всю улицу и документы на каждый дом).
			Если ЗначениеЗаполнено(Выборка.ДокументРаспределениеАванса) Тогда 
				Если МассивПовторов.Найти(Выборка.ДокументРаспределениеАванса) = Неопределено Тогда
					МассивПовторов.Добавить(Выборка.ДокументРаспределениеАванса);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДокументРаспределениеАванса) Тогда
				ДокументРаспределениеАванса = Выборка.ДокументРаспределениеАванса.ПолучитьОбъект();
			Иначе
				ДокументРаспределениеАванса				= Документы.бит_РаспределениеАванса.СоздатьДокумент();
				ДокументРаспределениеАванса.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументРаспределениеАванса.Организация = Объект.Организация;
				ДокументРаспределениеАванса.Улица       = Выборка.Улица;
				ДокументРаспределениеАванса.Здание      = Выборка.Здание;
				ДокументРаспределениеАванса.Ответственный = мОтветственный;
				ДокументРаспределениеАванса.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
			КонецЕсли;
			
			// БИТ ЖКХ 22.12.2020
			Если ЗначениеЗаполнено(ДокументРаспределениеАванса.Ответственный) = ложь Тогда 
				ДокументРаспределениеАванса.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			
			// Заполнение тч документа.
			ДокументРаспределениеАванса.ЗаполнитьСписокУслуг(Истина);
			
			Попытка
				
				Если ДокументРаспределениеАванса.СписокУслугПоПериоду.Количество() > 0 Тогда
					ДокументРаспределениеАванса.Записать(РежимЗаписиДокумента.Запись);
					ДокументыНаПроведение.Добавить(ДокументРаспределениеАванса.Ссылка);
				КонецЕсли; 
				
			Исключение
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
			КонецПопытки; 
			
		КонецЦикла; // Создание и перепроведение ДокументРаспределениеАванса.
		
	КонецЕсли; // Объект.ВыполнитьРаспределениеАванса.
	
	ПровестиДокументы(ДокументыНаПроведение);
	
КонецПроцедуры

#КонецОбласти