
#Область ПеременныеМодуля

&НаКлиенте
Перем мФормаПодбораЛС;  // Хранит форму подбора лицевых счетов.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура выполняет базовые проверки при изменении начальных и конечных показаний.
//
&НаКлиенте
Процедура ПриИзмененииПоказаний(Значение, НачалоСообщения, Отказ = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Объект.Счетчик) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не установлен счетчик!");
		
		Значение = 0;
		Отказ    = Истина;
		Возврат;
		
	КонецЕсли; 
	
	Если Значение > мКэшЗначений.Разрядность Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(НачалоСообщения + " не могут быть больше максимального значения счетчика = " + мКэшЗначений.Разрядность);
		
		Отказ    = Истина;
		Значение = 0;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(Объект.ВидОперации));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	// Управление видимостью элементов.
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЛицевыеСчетаНаСчетчик
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 27.11.2015 15:32:08 
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УдалитьЛицевыеСчетаСоСчетчика Тогда
		
		Элементы.ГруппаЛицевыеСчета.Видимость                = Истина;
		Элементы.ДеревоОбъектовУчетаОбновитьЗдания.Видимость = Истина;
		// БИТ_ЖКХ 27.11.2015 15:32:33 Начало правки...
		Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик Тогда
			Элементы.ДеревоОбъектовУчетаДобавитьЗдание.Видимость = Истина;
		Иначе
			Элементы.ДеревоОбъектовУчетаДобавитьЗдание.Видимость = Ложь;
		КонецЕсли;
		//Элементы.ДеревоОбъектовУчетаДобавитьЗдание.Видимость = Ложь;
		// БИТ_ЖКХ 27.11.2015 15:32:33 Конец правки. 
		
		Элементы.НачальныеПоказания.Видимость                  = Ложь;
		Элементы.КонечныеПоказания.Видимость                   = Ложь;
		Элементы.МестоУстановкиСчетчика.Видимость              = Ложь;
		Элементы.ВвестиРазовые.Видимость                       = Ложь;
		Элементы.Декорация1.Видимость                          = Ложь;
		Элементы.Объект.Видимость                              = Ложь;
		Элементы.Приоритет.Видимость                           = Ложь;
		Элементы.ИспользоватьСтавкуПоСчетчику.Видимость        = Ложь;
		Элементы.ГруппаУслуги.Видимость                        = Ложь;
		Элементы.ДатаПоверки.Видимость                         = Ложь;
		Элементы.Многотарифный.Видимость                       = Ложь;
		Элементы.СчетчикСЗависимымиУслугами.Видимость          = Ложь;
		Элементы.ИспользоватьПравилоУменьшения.Видимость       = Ложь;
		Элементы.УслугиСпособРасчетаУменьшения.Видимость       = Ложь;
		Элементы.УслугиСпособРаспределенияУменьшения.Видимость = Ложь;
		
		Элементы.ИспользоватьПравилоУменьшения.Доступность = Ложь;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УдалитьУслугиСоСчетчика Тогда
		
		Элементы.ГруппаЛицевыеСчета.Видимость                = Истина;
		Элементы.ДеревоОбъектовУчетаОбновитьЗдания.Видимость = Истина;
		Элементы.ДеревоОбъектовУчетаДобавитьЗдание.Видимость = Ложь;
		
		Элементы.НачальныеПоказания.Видимость                  = Ложь;
		Элементы.КонечныеПоказания.Видимость                   = Ложь;
		Элементы.МестоУстановкиСчетчика.Видимость              = Ложь;
		Элементы.ВвестиРазовые.Видимость                       = Ложь;
		Элементы.Приоритет.Видимость                           = Ложь;
		Элементы.ИспользоватьСтавкуПоСчетчику.Видимость        = Ложь;
		Элементы.ДатаПоверки.Видимость                         = Ложь;
		Элементы.Многотарифный.Видимость                       = Ложь;
		Элементы.СчетчикСЗависимымиУслугами.Видимость          = Ложь;
		Элементы.ИспользоватьПравилоУменьшения.Видимость       = Ложь;
		Элементы.УслугиСпособРасчетаУменьшения.Видимость       = Ложь;
		Элементы.УслугиСпособРаспределенияУменьшения.Видимость = Ложь;
		Элементы.СпособРасчета.Видимость                       = Ложь;
		Элементы.УслугиОсновнаяУслуга.Видимость                = Ложь;
		
		Если НЕ Объект.Счетчик.Пустая() Тогда
			Элементы.Объект.Доступность     = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
		Иначе
			Элементы.Объект.Доступность     = Истина;
		КонецЕсли;
		
		Элементы.ГруппаЛицевыеСчета.Видимость = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой;
		
		Элементы.УслугиКонечныеПоказания.Видимость  = Объект.Многотарифный;
		Элементы.УслугиНачальныеПоказания.Видимость = Объект.Многотарифный;
		
		Элементы.УслугиСпособРаспределения.Видимость = (Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных
		И Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик);
		
		Элементы.ИспользоватьСтавкуПоСчетчику.Доступность = (НЕ Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам);
		Элементы.ПараметрыСтавок.Видимость                = Объект.ИспользоватьСтавкуПоСчетчику;
		Элементы.ПараметрыСтавок2.Видимость               = Объект.ИспользоватьСтавкуПоСчетчику;
		
	Иначе
		
		Элементы.ДеревоОбъектовУчетаОбновитьЗдания.Видимость = Ложь;
		Элементы.ДеревоОбъектовУчетаДобавитьЗдание.Видимость = Истина;
		
		Элементы.ГруппаУслуги.Видимость = Истина;
		Элементы.Декорация1.Видимость   = Истина;
		
		Элементы.Объект.Видимость                        = Истина;
		Элементы.ДатаПоверки.Видимость                   = Истина;
		Элементы.Многотарифный.Видимость                 = Истина;
		Элементы.МестоУстановкиСчетчика.Видимость        = Истина;
		Элементы.Приоритет.Видимость                     = Истина;
		Элементы.ИспользоватьСтавкуПоСчетчику.Видимость  = Истина;
		Попытка
			Элементы.ИспользоватьПравилоУменьшения.Видимость = Истина;
		Исключение
		КонецПопытки;
		Элементы.СчетчикСЗависимымиУслугами.Видимость    = Истина;
		Элементы.СпособРасчета.Видимость                 = Истина;
		Элементы.СчетчикСЗависимымиУслугами.Доступность  = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой;;
		
		Элементы.Многотарифный.Доступность      = НЕ Объект.СчетчикСЗависимымиУслугами;
		Элементы.УслугиОсновнаяУслуга.Видимость = Объект.СчетчикСЗависимымиУслугами;
		
		Элементы.НачальныеПоказания.Видимость = НЕ Объект.Многотарифный;
		Элементы.КонечныеПоказания.Видимость  = НЕ Объект.Многотарифный;
		
		Элементы.УслугиКонечныеПоказания.Видимость  = Объект.Многотарифный;
		Элементы.УслугиНачальныеПоказания.Видимость = Объект.Многотарифный;
		
		Элементы.УслугиСпособРаспределения.Видимость = Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных;
		
		Элементы.МестоУстановкиСчетчика.Доступность    = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
		
		Если Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный И мКэшЗначений.ПравоИзменения Тогда
			Элементы.ВвестиРазовые.Доступность = Истина;
			Элементы.ВвестиРазовые.Видимость   = Истина;
		Иначе
			Элементы.ВвестиРазовые.Доступность = Ложь;
			Элементы.ВвестиРазовые.Видимость   = Ложь;
		КонецЕсли;
		
		Если НЕ Объект.Счетчик.Пустая() Тогда
			Элементы.Объект.Доступность     = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
		Иначе
			Элементы.Объект.Доступность     = Истина;
		КонецЕсли; 
		
		Элементы.СпособРасчета.Доступность = (Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой И НЕ Объект.СчетчикСЗависимымиУслугами);
		
		Элементы.ГруппаЛицевыеСчета.Видимость = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой;
		
		Элементы.Приоритет.Доступность        = Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных;
		
		Элементы.ИспользоватьСтавкуПоСчетчику.Доступность = (НЕ Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам);
		Элементы.ПараметрыСтавок.Видимость                = Объект.ИспользоватьСтавкуПоСчетчику;
		Элементы.ПараметрыСтавок2.Видимость               = Объект.ИспользоватьСтавкуПоСчетчику;
		
		// БИТ_ЖКХ 08.12.2014{{
		// Элементы.ИспользоватьПравилоУменьшения.Доступность     = (Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных И НЕ Объект.СчетчикСЗависимымиУслугами);.
		Элементы.ИспользоватьПравилоУменьшения.Доступность     = (Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных ИЛИ Объект.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам) И НЕ Объект.СчетчикСЗависимымиУслугами;
		// БИТ_ЖКХ 08.12.2014}}
		
		Элементы.УслугиСпособРасчетаУменьшения.Видимость       = Объект.ИспользоватьПравилоУменьшения;
		Элементы.УслугиСпособРаспределенияУменьшения.Видимость = Объект.ИспользоватьПравилоУменьшения;
		
	КонецЕсли; 
	
	Проведен = Объект.Проведен;
	
	Элементы.Организация.ТолькоПросмотр                = Проведен;
	Элементы.НачальныеПоказания.ТолькоПросмотр         = Проведен;
	Элементы.КонечныеПоказания.ТолькоПросмотр          = Проведен;
	Элементы.Многотарифный.ТолькоПросмотр              = Проведен;
	Элементы.Услуги.ТолькоПросмотр                     = Проведен;
	Элементы.ЛицевыеСчета.ТолькоПросмотр               = Проведен;
	Элементы.ДатаПоверки.ТолькоПросмотр                = Проведен;
	Элементы.Объект.ТолькоПросмотр                     = Проведен;
	Элементы.Счетчик.ТолькоПросмотр                    = Проведен;
	Элементы.ВидОперации.ТолькоПросмотр                = Проведен;
	Элементы.Дата.ТолькоПросмотр                       = Проведен;
	Элементы.СпособРасчета.ТолькоПросмотр              = Проведен;
	Элементы.Ответственный.ТолькоПросмотр              = Проведен;
	Элементы.Комментарий.ТолькоПросмотр                = Проведен;
	Элементы.ДеревоОбъектовУчета.ТолькоПросмотр        = Проведен;
	Элементы.МестоУстановкиСчетчика.ТолькоПросмотр     = Проведен;
	Элементы.Приоритет.ТолькоПросмотр                  = Проведен;
	Элементы.СчетчикСЗависимымиУслугами.ТолькоПросмотр = Проведен;
	
	Элементы.ИспользоватьСтавкуПоСчетчику.ТолькоПросмотр = Проведен;
	Элементы.ПараметрыСтавок.ТолькоПросмотр              = Проведен;
	Элементы.ПараметрыСтавок2.ТолькоПросмотр             = Проведен;
	
	Элементы.ДеревоОбъектовУчетаДобавитьЗдание.Доступность = НЕ Проведен;
	Элементы.ЗаполнитьДерево.Доступность                   = НЕ Проведен;
	
	Элементы.ИспользоватьПравилоУменьшения.ТолькоПросмотр = Проведен;
	
	Если НЕ Проведен Тогда
		
		// СнятиеСчетчика = Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчикаСДомов;.
		СнятиеСчетчика = Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика;
		
		Элементы.НачальныеПоказания.ТолькоПросмотр         = СнятиеСчетчика;
		Элементы.КонечныеПоказания.ТолькоПросмотр          = СнятиеСчетчика;
		Элементы.Многотарифный.ТолькоПросмотр              = СнятиеСчетчика;
		Элементы.Услуги.ТолькоПросмотр                     = СнятиеСчетчика;
		Элементы.ЛицевыеСчета.ТолькоПросмотр               = СнятиеСчетчика;
		Элементы.ДатаПоверки.ТолькоПросмотр                = СнятиеСчетчика;
		Элементы.ДеревоОбъектовУчета.ТолькоПросмотр        = СнятиеСчетчика;
		Элементы.МестоУстановкиСчетчика.ТолькоПросмотр     = СнятиеСчетчика;
		Элементы.Приоритет.ТолькоПросмотр                  = СнятиеСчетчика;
		Элементы.СчетчикСЗависимымиУслугами.ТолькоПросмотр = СнятиеСчетчика;
		
		Элементы.ИспользоватьСтавкуПоСчетчику.ТолькоПросмотр = СнятиеСчетчика;
		Элементы.ПараметрыСтавок.ТолькоПросмотр              = СнятиеСчетчика;
		Элементы.ПараметрыСтавок2.ТолькоПросмотр             = СнятиеСчетчика;
		
		Элементы.ДеревоОбъектовУчетаДобавитьЗдание.Доступность = НЕ СнятиеСчетчика;
		Элементы.ЗаполнитьДерево.Доступность                   = НЕ СнятиеСчетчика;
		
		Элементы.ИспользоватьПравилоУменьшения.ТолькоПросмотр = СнятиеСчетчика;
		
	КонецЕсли; 
	
	СпособыПоГрупповым();
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверка доступа к реквизитам докумиента.
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		Объект.ВидОперации = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ВидОперации;
		Объект.Дата        = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Дата;
		
		Если Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Свойство("Объект") Тогда
			Объект.Объект = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Объект;
		КонецЕсли;
		
		Если Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Свойство("Организация") Тогда
			Объект.Организация = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Организация;
		КонецЕсли;
		
		Если Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Свойство("Счетчик") Тогда
			Объект.Счетчик = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Счетчик;
		КонецЕсли;
		
		// Заполним документ если он вызван из другой формы.
	ИначеЕсли Параметры.Свойство("ЗаполнитьИзСправочника") Тогда
		
		Объект.ВидОперации = Параметры.ЗаполнитьИзСправочника.ВидОперации;
		Объект.Дата        = Параметры.ЗаполнитьИзСправочника.Дата;
		
		Если Параметры.ЗаполнитьИзСправочника.Свойство("Объект") Тогда
			Объект.Объект = Параметры.ЗаполнитьИзСправочника.Объект;
		КонецЕсли;
		
		Если Параметры.ЗаполнитьИзСправочника.Свойство("ТекущийЭлемент") Тогда
			ТекущийЭлемент = Элементы[Параметры.ЗаполнитьИзСправочника.ТекущийЭлемент];
		КонецЕсли;
		
		Если Параметры.ЗаполнитьИзСправочника.Свойство("Счетчик") Тогда
			Объект.Счетчик = Параметры.ЗаполнитьИзСправочника.Счетчик;
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ЗаполнитьИзОбработкиПоверки") Тогда
		
		Объект.ВидОперации = Параметры.ЗаполнитьИзОбработкиПоверки.ВидОперации;
		Объект.Объект      = Параметры.ЗаполнитьИзОбработкиПоверки.Объект;
		Объект.Дата        = Параметры.ЗаполнитьИзОбработкиПоверки.Дата;
		Объект.Счетчик     = Параметры.ЗаполнитьИзОбработкиПоверки.Счетчик;
		
	ИначеЕсли Параметры.Ключ.Пустая() Тогда
		Объект.Объект = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка");
	КонецЕсли;
	
	// Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчикаСДомов.
	//	ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчикаНаДома Тогда.
	Если Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		
		ОбновитьДерево();
		
	КонецЕсли; 
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	ОбновитьКэшПоСчетчику();
	
	Если НЕ Объект.Объект = Неопределено И Не Объект.Объект.Пустая() Тогда
		
		ЗаполнитьКэшРеквизитовЛицевогоСчета(Объект.Объект, мКэшЗначений);
		
	КонецЕсли;
	
	Если НЕ Объект.Счетчик.Пустая() Тогда
		
		ЗаполнитьКэшРеквизитовСчетчика(Объект.Счетчик, мКэшЗначений);
		
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтоНовый = ?(Параметры.Ключ.Пустая(), Истина, Ложь);

	Если ЭтоНовый тогда
		Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");	
		Элементы.ВвестиРазовые.Заголовок = "Ввести разовые начисления по тарифу";
	Иначе
		
		ДокументРазовые = ПолучитьДокументРазовые();
		
		Если НЕ ДокументРазовые = Неопределено Тогда
			
			// БИТ_ЖКХ 28.05.2014
			ДокументРазовыеНомер = ПолучитьНомерНаСервере(ДокументРазовые);
			ДокументРазовыеДата = ПолучитьДатуНаСервере(ДокументРазовые);
			
			// Элементы.ВвестиРазовые.Заголовок = "Разовые № " + Строка(ДокументРазовые.Номер) + " от:" + Строка(ДокументРазовые.Дата);.
			Элементы.ВвестиРазовые.Заголовок = "Разовые № " + Строка(ДокументРазовыеНомер) + " от:" + Строка(ДокументРазовыеДата);
			// БИТ_ЖКХ 28.05.2014
			
		Иначе
			Элементы.ВвестиРазовые.Заголовок = "Ввести разовые начисления по тарифу";
		КонецЕсли;
		
	КонецЕсли;
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// БИТ_ЖКХ 08.12.2014{{
	СпособыПоГрупповым();
	// БИТ_ЖКХ 08.12.2014}}
	
	// БИТ_ЖКХ 10.12.2014{{
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НЕ ИнтерфейсТакси Тогда
		
		Элементы.Страницы.Высота = 0;
		Элементы.Страницы.РастягиватьПоВертикали = Истина; 
		
		Элементы.Услуги.Высота = 0;
		Элементы.Услуги.РастягиватьПоВертикали = Истина; 
		
	КонецЕсли;	
	// БИТ_ЖКХ 10.12.2014}}	
	
	Если мКэшЗначений.ЗаполнитьИзОбработкиПоверки = Истина Тогда
		
		Объект.Услуги.Очистить();
		Объект.ЛицевыеСчета.Очистить();
		Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
		Корень.Очистить();
		
		Объект.НачальныеПоказания = 0;
		Объект.КонечныеПоказания  = 0;
		Объект.Приоритет          = 0;
		Объект.СпособРасчета      = Неопределено;
		
		ПриИзмененииСчетчикаНаСервере();
		
		СпособыПоГрупповым();
		
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Функция ПолучитьНомерНаСервере(ДокументРазовые)
	
	Возврат ДокументРазовые.Номер;
	
КонецФункции

&НаСервере
Функция ПолучитьДатуНаСервере(ДокументРазовые)
	
	Возврат ДокументРазовые.Дата;
	
КонецФункции

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПослеЗаписи()

// Процедура - обработчик события "ПередЗаписью" формы.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗадатьВопрос = Ложь;
	Текст        = "Конечные показания меньше Начальных. Переход через 0";
	
	Если НЕ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.СнятиеСчетчика Тогда
		
		Если НЕ Объект.Многотарифный Тогда
			
			Если Объект.НачальныеПоказания > Объект.КонечныеПоказания Тогда
				
				ЗадатьВопрос = Истина;
				
			КонецЕсли;
			
		Иначе
			
			Услуги = "";
			
			Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
				
				Если СтрокаТаблицы.НачальныеПоказания > СтрокаТаблицы.КонечныеПоказания Тогда
					
					Услуги = Услуги + " " + СтрокаТаблицы.Услуга;
					ЗадатьВопрос = Истина;
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Текст = "Для услуг: " + Услуги + " " + Текст;
			
		КонецЕсли;
		
		Если ЗадатьВопрос Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика") 
		И Объект.СчетчикСЗависимымиУслугами Тогда
		
		Поиск = Объект.Услуги.НайтиСтроки(Новый Структура("ОсновнаяУслуга", Истина));
		
		Если Поиск.Количество() = 0 Тогда
			
			Отказ = Истина;

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите основную услугу.");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая" Тогда
		
		Если ИсточникВыбора.СписокЗданий.Количество() > 0 Тогда
			
			ОбработатьВыбранныеЗначения(ВыбранноеЗначение);
		Иначе
			
			ОбработатьВыбранныеЗначенияУслуга(ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;
	РазвернутьВсеУровни();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

// Процедура - обработчик события "Нажатие" кнопки "Подбор".
//
&НаКлиенте
Процедура Подбор(Команда)
	
	// БИТ_ЖКХ 03.10.2014
	Объект.ПодборРазныеЗдания = Ложь;
	Элементы.ПодборРазныеЗдания.Видимость = Ложь;
	// БИТ_ЖКХ 03.10.2014
	
	Если Объект.Проведен Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ проведен. Изменения невозможны!");
			
	ИначеЕсли Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.СнятиеСчетчика Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("При снятии счетчика изменения невозможны!");
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
		ПараметрыФормы.Вставить("Дата"              , Объект.Дата);
		ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
		
		СписокУслуг = Новый СписокЗначений;
		
		Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
		
		Для каждого СтрокаТаблицы Из Корень Цикл
			Если СписокУслуг.НайтиПоЗначению(СтрокаТаблицы.Услуга) = Неопределено Тогда
				СписокУслуг.Добавить(СтрокаТаблицы.Услуга);
			КонецЕсли; 
		КонецЦикла; 
		
		ПараметрыФормы.Вставить("СписокУслуг", СписокУслуг);
		
		ТекСтрока = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
		
		Если ТекСтрока = Неопределено Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите строку содержащую здание для подбора лицевых счетов.");
			
			Возврат;
			
		КонецЕсли; 
		
		Здание    = ТекСтрока.Здание;
		
		ПараметрыФормы.Вставить("Здание", Здание);
		
		// БИТ_ЖКХ 10.09.2014
		Улица = УлицаНаСервере(Здание);
		// ПараметрыФормы.Вставить("Улица" , Здание.Улица);.
		ПараметрыФормы.Вставить("Улица" , Улица);
		
		СписокУлиц   = Новый СписокЗначений;
		СписокЗданий = Новый СписокЗначений;
		
		Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
		
		Для каждого СтрокаДерева Из Корень Цикл
			
			СписокЗданий.Добавить(СтрокаДерева.Здание);
			
			Улица = УлицаНаСервере(СтрокаДерева.Здание);
			// СписокУлиц.Добавить(СтрокаДерева.Здание.Улица);.
			СписокУлиц.Добавить(Улица);
			// БИТ_ЖКХ 10.09.2014
			
		КонецЦикла;
		
		ПараметрыФормы.Вставить("СписокЗданий", СписокЗданий);
		ПараметрыФормы.Вставить("СписокУлиц"  , СписокУлиц);
		
		Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 02.12.2015 17:39:44 
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьЛицевыеСчетаСоСчетчика
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик 
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика Тогда
			
			ПараметрыФормы.Вставить("СписокЛС"  , мКэшЗначений.СписокЛС);
			ПараметрыФормы.Вставить("ВСписке "  , (НЕ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
													И НЕ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик)); // БИТ_ЖКХ 03.12.2015 13:17:27 
			
		КонецЕсли; 
		
		ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УлицаНаСервере(Здание)
	
	Возврат Здание.Улица;
	
КонецФункции	

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля ввода "Объект".
//
&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	Объект.Услуги.Очистить();
	Объект.ЛицевыеСчета.Очистить();
	
	Объект.НачальныеПоказания     = 0;
	Объект.КонечныеПоказания      = 0;
	Объект.Приоритет              = 0;
	Объект.Счетчик                = Неопределено;
	Объект.СпособРасчета          = Неопределено;
	Объект.МестоУстановкиСчетчика = Неопределено;
	
	ОбъектПриИзмененииНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ВидОперации".
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.Услуги.Очистить();
	Объект.ЛицевыеСчета.Очистить();
	Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
	Корень.Очистить();
	
	Объект.НачальныеПоказания = 0;
	Объект.КонечныеПоказания  = 0;
	Объект.Счетчик            = Неопределено;
	Объект.Объект             = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка");
	
	УстановитьЗаголовокФормыДокумента();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Многотарифный".
//
&НаКлиенте
Процедура МноготарифныйПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "Счетчик".
//
&НаКлиенте
Процедура СчетчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ВидОперации.Пустая() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбран вид операции!");
		
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура;
	
	ПараметрыФормыВыбора.Вставить("Дата"       , КонецДня(Объект.Дата));
	
	Установлен = (Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.СнятиеСчетчика 
	ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
	ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьЛицевыеСчетаСоСчетчика
	ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик
	ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик  // БИТ_ЖКХ 27.11.2015 15:47:15 
	ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика); 
	
	ТипСчетчика = ?(ЗначениеЗаполнено(Объект.Объект),
	мКэшЗначений.Перечисления.бит_ТипСчетчика.Индивидуальный,
	мКэшЗначений.Перечисления.бит_ТипСчетчика.Групповой);
	
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.УдалитьУслугиСоСчетчика"))
		И ЗначениеЗаполнено(Объект.Объект) Тогда
		
		ПараметрыФормыВыбора.Вставить("ОбъектУчета", Объект.Объект);
		
	КонецЕсли;
	
	ПараметрыФормыВыбора.Вставить("Установлен" , Установлен);
	ПараметрыФормыВыбора.Вставить("ТипСчетчика", ТипСчетчика);
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.бит_Счетчики.Форма.ФормаВыбораСчетчиков", ПараметрыФормыВыбора, Элемент);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Счетчик".
//
&НаКлиенте
Процедура СчетчикПриИзменении(Элемент)
	
	Объект.Услуги.Очистить();
	Объект.ЛицевыеСчета.Очистить();
	Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
	Корень.Очистить();
	
	Объект.НачальныеПоказания = 0;
	Объект.КонечныеПоказания  = 0;
	Объект.Приоритет          = 0;
	Объект.СпособРасчета      = Неопределено;
	
	ПриИзмененииСчетчикаНаСервере();
	
	// БИТ_ЖКХ 04.12.2014{{
	СпособыПоГрупповым();
	// БИТ_ЖКХ 04.12.2014}}
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "НачальныеПоказания".
//
&НаКлиенте
Процедура НачальныеПоказанияПриИзменении(Элемент)
	
	ПриИзмененииПоказаний(Объект.НачальныеПоказания, Элемент.Имя);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "НачальныеПоказания".
//
&НаКлиенте
Процедура КонечныеПоказанияПриИзменении(Элемент)
	
	Отказ = Ложь;
	
	ПриИзмененииПоказаний(Объект.КонечныеПоказания, Элемент.Имя, Отказ);
	
	Если Объект.КонечныеПоказания < Объект.НачальныеПоказания И НЕ Отказ Тогда
		
		// Разность = Объект.Счетчик.Разрядность - Объект.НачальныеПоказания + 1 + Объект.КонечныеПоказания;.
		Разность = мКэшЗначений.Разрядность - Объект.НачальныеПоказания + 1 + Объект.КонечныеПоказания;
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КонечныеПоказанияПриИзмененииЗавершение", ЭтотОбъект), "Произойдет переход через 0 на разность: " + Разность +". Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонечныеПоказанияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.КонечныеПоказания = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиРазовыеНажатие(Элемент)
	
	Если Элемент.Заголовок = "Ввести разовые начисления по тарифу" Тогда   // вводим разовые начисления
		
		Если НЕ Объект.Проведен Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Проведите документ!");
			
			Возврат;
		КонецЕсли;
		
		РазовыеПоСчетчикам();
		
	Иначе // Открываем разовые начисления.
		
		ДокументРазовые = ПолучитьДокументРазовые();
		
		Если НЕ ДокументРазовые = Неопределено Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ",ДокументРазовые);
			Форма = ОткрытьФорму("Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаДокументаУправляемая",ПараметрыФормы,ЭтаФорма);
			
		Иначе
			
			РазовыеПоСчетчикам();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазовыеПоСчетчикам()
	
	Ссылка = Неопределено;
	СоздатьДокумент(Ссылка);
	
	Если НЕ Ссылка = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",Ссылка);
		Форма = ОткрытьФорму("Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаДокументаУправляемая",ПараметрыФормы,ЭтаФорма);
		
		// БИТ_ЖКХ 28.05.2014
		ДокументРазовыеНомер = ПолучитьНомерНаСервере(Ссылка);
		ДокументРазовыеДата = ПолучитьДатуНаСервере(Ссылка);
		
		// Элементы.ВвестиРазовые.Заголовок = "Разовые № " + Строка(Ссылка.Номер) + " от:" + Строка(Ссылка.Дата);.
		Элементы.ВвестиРазовые.Заголовок = "Разовые № " + Строка(ДокументРазовыеНомер) + " от:" + Строка(ДокументРазовыеДата);
		// БИТ_ЖКХ 28.05.2014
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета.Очистить();
	ДеревоОбъектовУчета.ПолучитьЭлементы().Очистить();
	
	
	Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
		
		Если Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных 
			ИЛИ (Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам и Объект.ИспользоватьПравилоУменьшения) Тогда
			
			СтрокаТаблицы.СпособРаспределения           = мКэшЗначений.Перечисления.бит_СпособыРаспределения.ПоСчетчикам;
			СтрокаТаблицы.СпособРаспределенияУменьшения = мКэшЗначений.Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления;

		КонецЕсли; 
		
	КонецЦикла; 
	
	Если НЕ Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных 
		
		// БИТ_ЖКХ 02.12.2014{{	
		и НЕ Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам Тогда
		// БИТ_ЖКХ 02.12.2014}}	
		
		Объект.Приоритет = 0;
		
		Объект.ИспользоватьСтавкуПоСчетчику = Ложь;
		
		Объект.ИспользоватьПравилоУменьшения = Ложь;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляУслуги

&НаКлиенте
Процедура УслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Счетчик) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбран счетчик!");
		
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ТипСчетчика = ПолучитьТипСчетчика(Объект.Счетчик); 

	Если ТипСчетчика = ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Групповой") Тогда
	
		Если ТекДанные <> Неопределено Тогда
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("УслугиПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("Отказ, ТекДанные", Отказ, ТекДанные)), "При удалении услуги список лицевых счетов будет очищен по удаляемой услуге. Продолжить?", РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Отказ = ДополнительныеПараметры.Отказ;
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьСтрокиДерева(ТекДанные.Услуга);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика Тогда
		СписокУслуг = Новый СписокЗначений;
		МассивУсулг = мКэшЗначений.СписокУС.ВыгрузитьЗначения();
		СписокУслуг.ЗагрузитьЗначения(МассивУсулг);
	Иначе
		СписокУслуг = ПолучитьСписокУслуг();
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
		
		Поиск = СписокУслуг.НайтиПоЗначению(СтрокаТаблицы.Услуга);
		
		Если НЕ Поиск = Неопределено Тогда
			
			СписокУслуг.Удалить(Поиск);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик Тогда
		
		Для каждого Услуга Из мКэшЗначений.СписокУС Цикл
			
			ЭлементСписка = СписокУслуг.НайтиПоЗначению(Услуга.Значение);
			
			Если НЕ ЭлементСписка = Неопределено Тогда
				СписокУслуг.Удалить(ЭлементСписка);
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", СписокУслуг);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор", Отбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекДанные = Элементы.Услуги.ТекущиеДанные;
		
		Если НЕ ТекДанные.Услуга = ВыбранноеЗначение Тогда
			
			Отказ = Ложь;
			
			ПроверитьВозможностьУстановкиСчетчикаПоУслуге(ВыбранноеЗначение, Отказ);
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли; 

			ТипСчетчика = ПолучитьТипСчетчика(Объект.Счетчик); 
			Если ТипСчетчика = ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Групповой") Тогда

				УдалитьСтрокиДерева(ТекДанные.Услуга);
				РазвернутьВсеУровни();
			КонецЕсли; 
			
			ТекДанные.Услуга = ВыбранноеЗначение;
			
			Если Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных Тогда
				ТекДанные.СпособРаспределения           = мКэшЗначений.Перечисления.бит_СпособыРаспределения.ПоСчетчикам;
				ТекДанные.СпособРаспределенияУменьшения = мКэшЗначений.Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления;
				
				// БИТ_ЖКХ 02.12.2014{{	
			ИначеЕсли Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам Тогда
				ТекДанные.СпособРаспределения           = мКэшЗначений.Перечисления.бит_СпособыРаспределения.ПоСчетчикам;
				ТекДанные.СпособРаспределенияУменьшения = мКэшЗначений.Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления;
				ТекДанные.СпособРасчетаУменьшения       = Неопределено;
				// БИТ_ЖКХ 02.12.2014}}
				
			Иначе
				ТекДанные.СпособРаспределения           = мКэшЗначений.Перечисления.бит_СпособыРаспределения.НеИспользуется;
				ТекДанные.СпособРаспределенияУменьшения = мКэшЗначений.Перечисления.бит_СпособыРаспределения.НеИспользуется;
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьТипСчетчика(Счетчик)
	возврат Счетчик.ТипСчетчика; 
КонецФункции

&НаКлиенте
Процедура УслугиНачальныеПоказанияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ПриИзмененииПоказаний(ТекДанные.НачальныеПоказания, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКонечныеПоказанияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Отказ = Ложь;
	
	ПриИзмененииПоказаний(ТекДанные.КонечныеПоказания, Элемент.Имя, Отказ);
	
	Если ТекДанные.КонечныеПоказания < ТекДанные.НачальныеПоказания И НЕ Отказ Тогда
		
		Разность = мКэшЗначений.Разрядность - ТекДанные.НачальныеПоказания + 1 + ТекДанные.КонечныеПоказания;
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("УслугиКонечныеПоказанияПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные)), "Произойдет переход через 0 на разность: " + Разность +". Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКонечныеПоказанияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ТекДанные.КонечныеПоказания = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляЛицевыеСчета

&НаКлиенте
Процедура ЛицевыеСчетаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	СписокУслуг = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы из Объект.Услуги Цикл
		СписокУслуг.Добавить(СтрокаТаблицы.Услуга);
	КонецЦикла;
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",,Элемент);
	
	ОтборУслуг = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУслуг.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборУслуг.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборУслуг.ПравоеЗначение = СписокУслуг;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	СписокЛС = Новый СписокЗначений;
	
	Для каждого СтрокаТаблицы_Лицевыесчета Из Объект.ЛицевыеСчета Цикл
		
		СписокЛС.Добавить(СтрокаТаблицы_Лицевыесчета.ЛицевойСчет);
		
	КонецЦикла; 
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая",,Элемент);
	
	ОтборУслуг = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУслуг.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Здание");
	ОтборУслуг.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборУслуг.ПравоеЗначение = Объект.Объект;
	
	Если СписокЛС.Количество() > 0 Тогда
		
		ОтборЛС = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЛС.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборЛС.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ОтборЛС.ПравоеЗначение = СписокЛС;
		
	КонецЕсли; 
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.Услуга) Тогда
		
		Отказ = Ложь;
		
		ПроверитьВозможностьУстановкиСчетчикаНаЛицевойСчет(Объект.Объект, 
		ВыбранноеЗначение, 
		ТекСтрока.Услуга, 
		ТекСтрока.Адрес, 
		ТекСтрока.ОтветственноеЛицо, 
		ТекСтрока.Индивидуальный, 
		ТекСтрока.УстановленныйСчетчик,
		Отказ);
		
		Если ОТказ Тогда
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не указана услуга!");
		
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	Документ       = Метаданные.Документы.бит_УстановкаСчетчика;
	ПравоИзменения = ПравоДоступа("Изменение", Документ);
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_ВидыОпераций"            , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВидыОперацийУстановкаСчетчика));
	КэшПеречисления.Вставить("бит_ТипСчетчика"             , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ТипСчетчика));
	КэшПеречисления.Вставить("бит_СпособыРасчетаПоУслугам" , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_СпособыРасчетаПоУслугам));
	КэшПеречисления.Вставить("бит_СпособыРаспределения"    , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_СпособыРаспределения));
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	тмпТаблицаУслуг = Объект.Услуги.Выгрузить();
	
	КэшированныеЗначения.Вставить("ПравоИзменения", ПравоИзменения);
	КэшированныеЗначения.Вставить("Перечисления"  , КэшПеречисления);
	КэшированныеЗначения.Вставить("Услуга"        , Неопределено);
	
	КэшированныеЗначения.Вставить("Разрядность"                  , 0);
	КэшированныеЗначения.Вставить("ДатаПоверки"                  , Дата("00010101000000"));
	КэшированныеЗначения.Вставить("МестоУстановкиСчетчика"       , Справочники.бит_Комнаты.ПустаяСсылка());
	КэшированныеЗначения.Вставить("ИспользоватьСтавкуПоСчетчику" , Ложь);
	КэшированныеЗначения.Вставить("СчетчикСЗависимымиУслугами"   , Ложь);
	КэшированныеЗначения.Вставить("ИспользоватьПравилоУменьшения", Ложь);
	КэшированныеЗначения.Вставить("ТипСчетчика"                  , Перечисления.бит_ТипСчетчика.ПустаяСсылка());
	КэшированныеЗначения.Вставить("Квартира"                     , Справочники.бит_Квартиры.ПустаяСсылка());
	КэшированныеЗначения.Вставить("Улица"                        , Справочники.бит_СписокУлиц.ПустаяСсылка());
	КэшированныеЗначения.Вставить("Приоритет"                    , 0);
	КэшированныеЗначения.Вставить("СписокЛС"                     , Новый СписокЗначений);
	КэшированныеЗначения.Вставить("СписокУС"                     , Новый СписокЗначений);
	КэшированныеЗначения.Вставить("СписокЗданий"                 , Новый СписокЗначений);
	
	// БИТ_ЖКХ 06.11.2014
	КэшированныеЗначения.СчетчикСЗависимымиУслугами = Объект.СчетчикСЗависимымиУслугами;
	// БИТ_ЖКХ 06.11.2014
	
	КэшированныеЗначения.Вставить("ЗаполнитьИзОбработкиПоверки" , Ложь);
	Если Параметры.Свойство("ЗаполнитьИзОбработкиПоверки") Тогда
		КэшированныеЗначения.ЗаполнитьИзОбработкиПоверки = Истина;
	Иначе
		КэшированныеЗначения.ЗаполнитьИзОбработкиПоверки = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Функция ПолучитьСписокУслуг()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент"     , КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Объект"     , Объект.Объект);
	Запрос.УстановитьПараметр("ПоСчетчикам", Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам);
	
	Если ЗначениеЗаполнено(Объект.Объект) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|			&Момент,
		|			ЛицевойСчет = &Объект
		|				И Услуга.СпособыРасчета.СпособРасчета = &ПоСчетчикам) КАК бит_СведенияПоУслугамЛССрезПоследних";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_УслугиЖКХСпособыРасчета.Ссылка КАК Услуга
		|ИЗ
		|	Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
		|ГДЕ
		|	бит_УслугиЖКХСпособыРасчета.СпособРасчета = &ПоСчетчикам
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_УслугиЖКХСпособыРасчета.Ссылка";
		
	КонецЕсли;
	
	СписокУслуг = Новый СписокЗначений;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокУслуг.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокУслуг;
	
КонецФункции // ()

&НаСервере
Процедура ПроверитьВозможностьУстановкиСчетчикаПоУслуге(Услуга, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"  , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("Объект", Объект.Объект);
	
	ТЗРаспределений = Новый ТаблицаЗначений;
	ТЗРаспределений.Колонки.Добавить("Услуга",Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ")); 
	ТЗРаспределений.Колонки.Добавить("ЛицевойСчет",Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета")); 
	
	НоваяСтрока = ТЗРаспределений.Добавить();
	НоваяСтрока.Услуга      = Услуга;
	НоваяСтрока.ЛицевойСчет = Объект.Объект;
	
	Запрос.УстановитьПараметр("ТЗРаспределений"       , ТЗРаспределений);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗРаспределений.Услуга,
	|	ТЗРаспределений.ЛицевойСчет
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗРаспределений КАК ТЗРаспределений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	|	бит_РаспределенияНаУслугахСрезПоследних.Распределение
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Дата, ) КАК бит_РаспределенияНаУслугахСрезПоследних
	|		ПО ТЗ.Услуга = бит_РаспределенияНаУслугахСрезПоследних.Услуга
	|			И ТЗ.ЛицевойСчет = бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
	|ГДЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	|	бит_РаспределенияНаУслугахСрезПоследних.Распределение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете №" + Выборка.ЛицевойСчет + " на услуге:""" + Выборка.Услуга + """ установлено распределение " + Выборка.Распределение 
		+ " требуется его снять ");
		
		Отказ = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьУстановкиСчетчикаНаЛицевойСчет(Здание, ЛицевойСчет, Услуга, Адрес = "", ОтветственноеЛицо, Индивидуальный = "", УстановленныйСчетчик, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга"     , Услуга);
	Запрос.УстановитьПараметр("Объект"     , Здание);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете №" + ЛицевойСчет + " не установлена услуга: """+ Услуга + """.");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	|	бит_РаспределенияНаУслугахСрезПоследних.Распределение
	|ИЗ
	|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Услуга = &Услуга
	|				И Объект = &Объект) КАК бит_РаспределенияНаУслугахСрезПоследних
	|ГДЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Использовать";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете №" + ЛицевойСчет + " на услуге:""" + Выборка.Услуга + """ установлено распределение " + Выборка.Распределение 
		+ " требуется его снять ");
		
		Отказ = Истина;
		Возврат;
		
	КонецЦикла;
		
	ОтветственноеЛицо    = ПолучитьОтвЛицо(ЛицевойСчет);
	Адрес                = Строка(ЛицевойСчет.УлицаЛицевогоСчета) + ", " + Строка(ЛицевойСчет.Здание);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтвЛицо(ЛицевойСчет)
	
	Запрос= Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	ОтвЛицо = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОтвЛицо = Выборка.ФизЛицо;
		
	КонецЕсли;
	
	Возврат ОтвЛицо;
	
КонецФункции

&НаСервере
// Функция возвращает таблицу значений, которая содержит данные об услугах и начислениях по тарифам.
//
Функция НачисленияПоТарифам(СписокУслуг)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛС.ЛицевойСчет,
	|	ЛС.Квартира,
	|	ЛС.РежимПотребления,
	|	ЛС.Поставщик,
	|	ЛС.Услуга.ОсновнойСпособРасчета КАК СпособРасчета,
	|	ЛС.КоличествоЕдиницПотребления,
	|	ЛС.Услуга,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры
	|ПОМЕСТИТЬ ЛицевыеСчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|		бит_ЛицевыеСчета.Квартира КАК Квартира,
	|		бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|		бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|		бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|		бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	|	ИЗ
	|		РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, Услуга В (&СписокУслуг)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|			ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	|	ГДЕ
	|		бит_ЛицевыеСчета.УлицаЛицевогоСчета = &Улица
	|		И бит_ЛицевыеСчета.Здание = &Здание
	|		И бит_ЛицевыеСчета.Ссылка = &ЛицевойСчет
	|		И бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)) КАК ЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО ЛС.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛицевыеСчета.ЛицевойСчет,
	|	ЛицевыеСчета.Услуга,
	|	ЛицевыеСчета.Квартира,
	|	ЛицевыеСчета.РежимПотребления,
	|	ЛицевыеСчета.Поставщик,
	|	ЛицевыеСчета.СпособРасчета,
	|	ЛицевыеСчета.КоличествоЕдиницПотребления,
	|	ЕСТЬNULL(ЛицевыеСчета.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	|	ЕСТЬNULL(ЛицевыеСчета.ЖилаяПлощадь, 0) КАК ЖилаяПлощадь,
	|	ЕСТЬNULL(ЛицевыеСчета.МОП, 0) КАК МОП,
	|	ЕСТЬNULL(ЛицевыеСчета.ОтапливаемаяПлощадь, 0) КАК ОтапливаемаяПлощадь,
	|	ЕСТЬNULL(ЛицевыеСчета.СовокупнаяПлощадь, 0) КАК СовокупнаяПлощадь,
	|	ЛицевыеСчета.ТипКвартиры,
	|	ЛицевыеСчета.СтатусКвартиры,
	|	ЕСТЬNULL(Проживающие.КоличествоПроживающих, 0) КАК мКоличествоПроживающих,
	|	ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0) КАК мКоличествоПоНорме,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка, 0) КАК Ставка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка, 0) КАК СверхномСтавка,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ) КАК ИспользоватьДопНормуНаЛьготника,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет
	|ИЗ
	|	ЛицевыеСчета КАК ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|				&Момент,
	|				Услуга В (&СписокУслуг)
	|					И Поставщик В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.Поставщик
	|						ИЗ
	|							ЛицевыеСчета)
	|					И РежимПотребления В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.РежимПотребления
	|						ИЗ
	|							ЛицевыеСчета)
	|					И СпособРасчета В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.СпособРасчета
	|						ИЗ
	|							ЛицевыеСчета)
	|					И СтатусКвартиры В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.СтатусКвартиры
	|						ИЗ
	|							ЛицевыеСчета)
	|					И ТипКвартиры В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.ТипКвартиры
	|						ИЗ
	|							ЛицевыеСчета)) КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО ЛицевыеСчета.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			И ЛицевыеСчета.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И ЛицевыеСчета.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	|			И ЛицевыеСчета.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|			И ЛицевыеСчета.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|			И ЛицевыеСчета.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|				&Момент,
	|				Услуга В (&СписокУслуг)
	|					И РежимПотребления В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.РежимПотребления
	|						ИЗ
	|							ЛицевыеСчета)
	|					И СпособРасчетаПоУслуге В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.СпособРасчета
	|						ИЗ
	|							ЛицевыеСчета)
	|					И СтатусКвартиры В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.СтатусКвартиры
	|						ИЗ
	|							ЛицевыеСчета)
	|					И ТипКвартиры В
	|						(ВЫБРАТЬ
	|							ЛицевыеСчета.ТипКвартиры
	|						ИЗ
	|							ЛицевыеСчета)) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО ЛицевыеСчета.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И ЛицевыеСчета.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И ЛицевыеСчета.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|			И ЛицевыеСчета.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|			И ЛицевыеСчета.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КоличествоПроживающих,
	|			СУММА(ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КоличчествоПоНорме,
	|			бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	|		ИЗ
	|			РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|					&Момент,
	|					ЛицевойСчет В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Таб.ЛицевойСчет
	|						ИЗ
	|							ЛИцевыесчета КАК Таб)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ГДЕ
	|			(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|					ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет) КАК Проживающие
	|		ПО ЛицевыеСчета.ЛицевойСчет = Проживающие.ЛицевойСчет";
	Запрос.УстановитьПараметр("Момент"      ,КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Улица"       ,Объект.Объект.УлицаЛицевогоСчета);
	Запрос.УстановитьПараметр("Здание"      ,Объект.Объект.Здание);
	Запрос.УстановитьПараметр("СписокУслуг" ,СписокУслуг);
	Запрос.УстановитьПараметр("ЛицевойСчет" ,Объект.Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КолДнейВМесяце        = бит_ОбщегоНазначения.РазностьДатВДнях(КонецМесяца(Объект.Дата),НачалоМесяца(Объект.Дата))+1;		
	КолДнейОтНачалаМесяца = бит_ОбщегоНазначения.РазностьДатВДнях(Объект.Дата,НачалоМесяца(Объект.Дата));
	
	ТаблицаУслуг = Новый ТаблицаЗначений;
	ТаблицаУслуг.Колонки.Добавить("Услуга");
	ТаблицаУслуг.Колонки.Добавить("Сумма");
	
	мНорма      = 0;
	мСверхНорма = 0;
	
	Пока Выборка.Следующий()  цикл
		
		Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади тогда
			Если Выборка.мКоличествоПоНорме = 0 тогда
				мКоличествоПроживающихДляРасчета = 1;
			иначе
				мКоличествоПроживающихДляРасчета = Выборка.мКоличествоПоНорме / выборка.Количество();
			КонецЕсли; 	
			
			Если мКоличествоПроживающихДляРасчета = 1 тогда	
				мНорма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью,0);
			ИначеЕсли мКоличествоПроживающихДляРасчета = 2 тогда
				мНорма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;  
			ИначеЕсли мКоличествоПроживающихДляРасчета > 2 тогда
				мНорма  = Выборка.НаСемью * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
			КонецЕсли;	
			Если мНорма > Выборка.ОбщаяПлощадь тогда
				мНорма      = Выборка.ОбщаяПлощадь;
				мСверхНорма = 0; 
			иначе
				мСверхНорма = Выборка.ОбщаяПлощадь - мНорма; 
			КонецЕсли;	
			
		ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади тогда
			Если Выборка.мКоличествоПоНорме = 0 тогда
				мКоличествоПроживающихДляРасчета = 1;
			иначе
				мКоличествоПроживающихДляРасчета = Выборка.мКоличествоПоНорме / выборка.Количество();
			КонецЕсли; 	
			
			Если мКоличествоПроживающихДляРасчета = 1 тогда	
				мНорма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью,0);
			ИначеЕсли мКоличествоПроживающихДляРасчета = 2 тогда
				мНорма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;  
			ИначеЕсли мКоличествоПроживающихДляРасчета > 2 тогда
				мНорма  = Выборка.НаСемью * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
			КонецЕсли;
			
			Если мНорма > Выборка.ЖилаяПлощадь тогда
				мНорма      = Выборка.ЖилаяПлощадь;
				мСверхНорма = 0; 
			иначе
				мСверхНорма = Выборка.ЖилаяПлощадь - мНорма; 
			КонецЕсли;	
			
		ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади тогда
			Если Выборка.мКоличествоПоНорме = 0 тогда
				мКоличествоПроживающихДляРасчета = 1;
			иначе
				мКоличествоПроживающихДляРасчета = Выборка.мКоличествоПоНорме / Выборка.Количество();
			КонецЕсли; 	
			
			Если мКоличествоПроживающихДляРасчета = 1 тогда	
				мНорма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью,0);
			ИначеЕсли мКоличествоПроживающихДляРасчета = 2 тогда
				мНорма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;  
			ИначеЕсли мКоличествоПроживающихДляРасчета > 2 тогда
				мНорма  = Выборка.НаСемью * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
			КонецЕсли;
			
			Если мНорма > Выборка.ОтапливаемаяПлощадь тогда
				мНорма      = Выборка.ОтапливаемаяПлощадь;
				мСверхНорма = 0; 
			иначе
				мСверхНорма = Выборка.ОтапливаемаяПлощадь - мНорма; 
			КонецЕсли;	
			
		ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим тогда
			мНорма =  Выборка.мКоличествоПроживающих;
			мСверхНорма = 0;
			
		ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления тогда
			Если Выборка.мКоличествоПоНорме = 0 тогда
				мКоличествоПроживающихДляРасчета = 1;
			иначе
				мКоличествоПроживающихДляРасчета = Выборка.мКоличествоПоНорме/ Выборка.Количество();
			КонецЕсли; 	
			
			Если мКоличествоПроживающихДляРасчета = 1 тогда	
				мНорма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью,0);
			ИначеЕсли мКоличествоПроживающихДляРасчета = 2 тогда
				мНорма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;  
			ИначеЕсли мКоличествоПроживающихДляРасчета > 2 тогда
				мНорма  = Выборка.НаСемью * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
			КонецЕсли;
			Если мНорма > Выборка.КоличествоЕдиницПотребления тогда
				мНорма      = Выборка.КоличествоЕдиницПотребления;
				мСверхНорма = 0; 
			иначе
				мСверхНорма = Выборка.КоличествоЕдиницПотребления - мНорма; 
			КонецЕсли;	
			
		ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет тогда	
			мНорма = Выборка.НаЛицевойСчет;
			Если мНорма > Выборка.КоличествоЕдиницПотребления тогда
				мНорма      = Выборка.КоличествоЕдиницПотребления;
				мСверхНорма = 0; 
			иначе
				мСверхНорма = Выборка.КоличествоЕдиницПотребления - мНорма; 
			КонецЕсли;	
			
		КонецЕсли;	
		Начисления  = мНорма * Выборка.Ставка + мСверхНорма * Выборка.СверхномСтавка;
		
		Сумма = Начисления/КолДнейВМесяце*КолДнейОтНачалаМесяца;
		
		СтрокаТЗ = ТаблицаУслуг.Добавить();
		СтрокаТЗ.Услуга = Выборка.Услуга;
		СтрокаТЗ.Сумма  = Сумма;
		
	КонецЦикла;
	
	// БИТ_ЖКХ добавление кода Начало: 03.08.2010 
	ТаблицаУслуг.Свернуть("Услуга", "Сумма");
	// БИТ_ЖКХ добавление кода конец : 03.08.2010
	
	Возврат ТаблицаУслуг;
	
КонецФункции

&НаСервере
// Процедура создает и заполняет документ "Разовые по услугам ЖКХ".
//
Процедура СоздатьДокумент(СсылкаНаНовыйДокумент = Неопределено)
	
	ТаблУслуг = Объект.Услуги.Выгрузить();
	
	СписокУслуг = Новый СписокЗначений;
	СписокУслуг.ЗагрузитьЗначения(ТаблУслуг.ВыгрузитьКолонку("Услуга"));
	
	Если НЕ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.СнятиеСчетчика Тогда
		
		ПроверитьНаличиеСчетчиков(СписокУслуг);
		
	КонецЕсли; 
	
	Если СписокУслуг.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	НовДокумент = Документы.бит_РазовыеПоУслугамЖКХ.СоздатьДокумент();
	
	НовДокумент.Дата          = Объект.Дата;
	НовДокумент.ЛицевойСчет   = Объект.Объект;
	
	НовДокумент.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	НовДокумент.Документ      = Параметры.Ключ;
	
	// БИТ_ЖКХ 19.09.2016 15:48:39 Начало правки... 
	//НовДокумент.Организация   = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	НовДокумент.Организация   = Объект.Организация;
	// БИТ_ЖКХ 19.09.2016 15:48:40 Конец правки. 
	
	НачисленияПоТарифам   = НачисленияПоТарифам(СписокУслуг);
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(НачисленияПоТарифам);
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(НачисленияПоТарифам, НачисленияПоТарифам.Колонки, Объект.Объект, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация"), Объект.Дата);
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика Тогда
		
		НовДокумент.ВидОперации   = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПриУстановкеСчетчика;
		
		Для Каждого Строка из НачисленияПоТарифам Цикл
			
			Если НЕ Строка.Сумма = 0 Тогда
				
				НовСтрока        = НовДокумент.СписокУслуг.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
				НовСтрока.Услуга = Строка.Услуга;
				НовСтрока.Сумма  = Строка.Сумма;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		НовДокумент.ВидОперации   = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПриСнятииСчетчика;
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Дата"    , КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("Квартира", Объект.Объект.Квартира);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			
			НачисленияПоСчетчикам = НачисленияПоСчетчикам(Выборка.СтатусКвартиры,Выборка.ТипКвартиры,СписокУслуг);
			
			бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(НачисленияПоСчетчикам);
			
			бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(НачисленияПоСчетчикам, НачисленияПоСчетчикам.Колонки, Объект.Объект, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация"), Объект.Дата);
			
		КонецЕсли;
		
		Для Каждого Строка Из НачисленияПоСчетчикам Цикл
			
			СтрокаТарифа = НачисленияПоТарифам.Найти(Строка.Услуга,"Услуга");
			
			Если СтрокаТарифа <> Неопределено Тогда
				
				тмпСумма = Строка.Начисления - ?(Строка.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
				,0,СтрокаТарифа.Сумма);
				
				Если НЕ тмпСумма = 0 Тогда
					
					НовСтрока = НовДокумент.СписокУслуг.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
					
					НовСтрока.Услуга = Строка.Услуга;
					
					НовСтрока.Сумма  = тмпСумма;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НовДокумент, РежимЗаписиДокумента.Проведение,"Разовые по услугам ЖКХ.");
	
	Если ДействиеВыполнено Тогда
		
		СсылкаНаНовыйДокумент = НовДокумент.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция возвращает таблицу значений, которая содержит услуги и начисления по счетчикам.
//
Функция НачисленияПоСчетчикам(СтатусКвартиры,ТипКвартиры,СписокУслуг)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"           , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Момент"         , Новый МоментВремени(Объект.Дата - 2, Параметры.Ключ));
	Запрос.УстановитьПараметр("Объект"         , Объект.Объект);
	Запрос.УстановитьПараметр("СтатусКвартиры" , СтатусКвартиры);
	Запрос.УстановитьПараметр("ТипКвартиры"    , ТипКвартиры);
	Запрос.УстановитьПараметр("СписокУслуг"    , СписокУслуг);
	Запрос.УстановитьПараметр("Счетчик"        , Объект.Счетчик);
	// БИТ_ЖКХ 11.10.2010.              
	// Изменен запрос.
	// Запрос должен получать начсиления по счетчику до момента проведения документа.
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ПоказанияСчетчиков.КоличествоЕдиниц > ЕСТЬNULL(Услуги.Норма, 0)
	|				ТОГДА ПоказанияСчетчиков.КоличествоЕдиниц - ЕСТЬNULL(Услуги.Норма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) * Услуги.СверхНормативнаяСтавка + ЕСТЬNULL(ВЫБОР
	|			КОГДА Услуги.Норма > ПоказанияСчетчиков.КоличествоЕдиниц
	|				ТОГДА ПоказанияСчетчиков.КоличествоЕдиниц * Услуги.ОсновнаяСтавка
	|			ИНАЧЕ Услуги.ОсновнаяСтавка * Услуги.Норма
	|		КОНЕЦ, 0) КАК Начисления,
	|	Услуги.СпособРасчета,
	|	ПоказанияСчетчиков.Услуга
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) = ВЫБОР
	|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
	|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВЫБОР
	|									КОГДА ВЫБОР
	|											КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|												ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|											ИНАЧЕ ВЫБОР
	|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|														ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|													ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|												КОНЕЦ
	|										КОНЕЦ > ВЫБОР
	|											КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|												ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|											ИНАЧЕ ВЫБОР
	|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|														ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|													ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|												КОНЕЦ
	|										КОНЕЦ
	|										ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|									ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|								КОНЕЦ, 0)
	|					КОНЕЦ
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
	|										ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
	|												ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|											ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|										КОНЕЦ
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
	|										ИЛИ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
	|									ТОГДА ЕСТЬNULL(ВЫБОР
	|												КОГДА ВЫБОР
	|														КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|															ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|														ИНАЧЕ ВЫБОР
	|																КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|																	ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|																ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|															КОНЕЦ
	|													КОНЕЦ > ВЫБОР
	|														КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|															ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|														ИНАЧЕ ВЫБОР
	|																КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|																	ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|																ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|															КОНЕЦ
	|													КОНЕЦ
	|													ТОГДА ВЫБОР
	|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|																ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|															ИНАЧЕ ВЫБОР
	|																	КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|																		ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
	|																	ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|																КОНЕЦ
	|														КОНЕЦ
	|												ИНАЧЕ ВЫБОР
	|														КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|															ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|														ИНАЧЕ ВЫБОР
	|																КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|																	ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
	|																ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|															КОНЕЦ
	|													КОНЕЦ
	|											КОНЕЦ, 0)
	|								ИНАЧЕ бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ, 0) * бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток КАК КоличествоЕдиниц,
	|		бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга
	|	ИЗ
	|		РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|				&Момент,
	|				Объект = &Объект
	|					И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки) КАК ПоказанияСчетчиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка КАК ОсновнаяСтавка,
	|			бит_СтавкиНаУслугиСрезПоследних.Услуга КАК Услуга,
	|			ВЫБОР
	|				КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 1
	|					ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 2
	|							ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПроживающиеНачислятьПоНорме.КолПрожив > 2
	|									ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ * ПроживающиеНачислятьПоНорме.КолПрожив + ВЫБОР
	|				КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 1
	|						И бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного
	|					ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 2
	|							ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПроживающиеНачислятьПоНорме.КолПрожив > 2
	|									ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ * ПроживающиеНачислятьПоНорме.КолПрожив КАК Норма,
	|			бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка КАК СверхНормативнаяСтавка,
	|			бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета
	|		ИЗ
	|			РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|					&Дата,
	|					ТипКвартиры = &ТипКвартиры
	|						И СтатусКвартиры = &СтатусКвартиры
	|						И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_СтавкиНаУслугиСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_СведенияПоУслугамЛССрезПоследних
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|							&Дата,
	|							ТипКвартиры = &ТипКвартиры
	|								И СтатусКвартиры = &СтатусКвартиры
	|								И СпособРасчетаПоУслуге = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_НормыНаУслугиСрезПоследних
	|					ПО (бит_НормыНаУслугиСрезПоследних.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга)
	|						И (бит_НормыНаУслугиСрезПоследних.РежимПотребления = бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления)
	|				ПО бит_СтавкиНаУслугиСрезПоследних.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|					И бит_СтавкиНаУслугиСрезПоследних.РежимПотребления = бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления
	|					И бит_СтавкиНаУслугиСрезПоследних.Поставщик = бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|			(ВЫБРАТЬ
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо,
	|				СУММА(1) КАК КоличествоПроживающих
	|			ИЗ
	|				РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_ПроживающиеПоЛССрезПоследних
	|			ГДЕ
	|				бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|				И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
	|						ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))) КАК ПроживающиеПоЛСЛьготы,
	|			(ВЫБРАТЬ
	|				бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПрожив
	|			ИЗ
	|				РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_ПроживающиеПоЛССрезПоследних
	|			ГДЕ
	|				бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|			
	|			СГРУППИРОВАТЬ ПО
	|				бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет) КАК ПроживающиеНачислятьПоНорме
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка,
	|			бит_СтавкиНаУслугиСрезПоследних.Услуга,
	|			бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка,
	|			бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью,
	|			бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого,
	|			бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного,
	|			ВЫБОР
	|				КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 1
	|					ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 2
	|							ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПроживающиеНачислятьПоНорме.КолПрожив > 2
	|									ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ * ПроживающиеНачислятьПоНорме.КолПрожив + ВЫБОР
	|				КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 1
	|						И бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного
	|					ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПроживающиеНачислятьПоНорме.КолПрожив = 2
	|							ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПроживающиеНачислятьПоНорме.КолПрожив > 2
	|									ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ * ПроживающиеНачислятьПоНорме.КолПрожив,
	|			бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета) КАК Услуги
	|		ПО ПоказанияСчетчиков.Услуга = Услуги.Услуга";
	
	
	Результат = Запрос.Выполнить().Выгрузить();					  
	Возврат Результат;					  
	
КонецФункции

&НаСервере
// Функция возвращает ссылку на документ "Разовые по услугам ЖКХ".
//
Функция ПолучитьДокументРазовые()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ключ);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_РазовыеПоУслугамЖКХ.Ссылка КАК ДокументРазовые
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХ.Документ = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Разовые = Неопределено;
	
	Если Выборка.Следующий() Тогда
		
		Разовые = Выборка.ДокументРазовые;
		
	КонецЕсли; 
	
	Возврат Разовые;
	
КонецФункции // ()

&НаСервере
Процедура ОбработатьВыбранныеЗначения(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Отбор = Новый Структура;
	
	Дерево = РеквизитФормыВЗначение("ДеревоОбъектовУчета");
	
	Для каждого ЭлементКоллекции Из ТаблицаЛС Цикл
		
		Отбор.Вставить("Услуга"     , ЭлементКоллекции.Услуга);
		Отбор.Вставить("Здание"     , ЭлементКоллекции.Здание);
		
		Корень = Дерево.Строки.НайтиСтроки(Отбор);
		
		Если НЕ Корень.Количество() = 1 Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не найдено строк по зданию: " + ЭлементКоллекции.Здание + " и услуге: " + ЭлементКоллекции.Услуга);
			
			Продолжить;
			
		КонецЕсли; 
		
		Отбор.Очистить();
		
		ПоискЛС = Корень[0].Строки.Найти(ЭлементКоллекции.ЛицевойСчет, "ЛицевойСчет");
		
		Если НЕ ПоискЛС = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Отказ = Ложь;
		
		ОтветственноеЛицо    = Неопределено;
		Индивидуальный       = Ложь;
		
		ПроверитьВозможностьУстановкиСчетчикаНаЛицевойСчет(ЭлементКоллекции.Здание, 
		ЭлементКоллекции.ЛицевойСчет, 
		ЭлементКоллекции.Услуга, 
		,
		ОтветственноеЛицо, 
		Индивидуальный, 
		, 
		Отказ);
		
		Если НЕ Отказ Тогда
			
			НоваяСтрока = Корень[0].Строки.Добавить();
			
			НоваяСтрока.ПредставлениеЗдания = НоваяСтрока.Родитель.ПредставлениеЗдания;
			НоваяСтрока.Услуга              = НоваяСтрока.Родитель.Услуга;
			НоваяСтрока.ЛицевойСчет         = ЭлементКоллекции.ЛицевойСчет;
			НоваяСтрока.ОтветственноеЛицо   = ОтветственноеЛицо;
			НоваяСтрока.Индивидуальный      = Индивидуальный;
			НоваяСтрока.Здание              = ЭлементКоллекции.Здание;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОбъектовУчета");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКэшПоСчетчику()
	
	Результат = Документы.бит_УстановкаСчетчика.ОбновитьКэшДокумента(Объект);
	ЗаполнитьЗначенияСвойств(мКэшЗначений, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСпособРаспределенияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
		
		СтрокаТаблицы.СпособРаспределения =  ТекСтрока.СпособРаспределения;
		
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Услуги.Очистить();
	Объект.ЛицевыеСчета.Очистить();
	Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
	Корень.Очистить();
	
	Объект.НачальныеПоказания = 0;
	Объект.КонечныеПоказания  = 0;
	Объект.Счетчик            = Неопределено;
	Объект.СпособРасчета      = Неопределено;
	Объект.Объект             = Неопределено;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая",,Элемент);
	
	ОтборОрганизации = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборОрганизации.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
	ОтборОрганизации.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборОрганизации.ПравоеЗначение = Объект.Организация;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		
		Родитель = ТекущиеДанные;
		
	КонецЕсли;
	
	ВетвьДерева   = Родитель.ПолучитьЭлементы(); 
	ВторойУровень = ВетвьДерева.Добавить();
	
	ВторойУровень.Услуга              = Родитель.Услуга;
	ВторойУровень.Здание              = Родитель.Здание;
	ВторойУровень.ПредставлениеЗдания = Родитель.ПредставлениеЗдания;
	
	Элементы.ДеревоОбъектовУчета.ТекущаяСтрока  = ВторойУровень.ПолучитьИдентификатор();
	Элементы.ДеревоОбъектовУчета.ТекущийЭлемент = Элементы.ДеревоОбъектовУчетаЛицевойСчет;
	Элементы.ДеревоОбъектовУчета.ИзменитьСтроку();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗдание(Команда)
	
	Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
	ПервыйУровень = Корень.Добавить();
	ПервыйУровень.Родитель = Истина;
	
	Элементы.ДеревоОбъектовУчета.ТекущаяСтрока  = ПервыйУровень.ПолучитьИдентификатор();
	Элементы.ДеревоОбъектовУчета.ТекущийЭлемент = Элементы.ДеревоОбъектовУчетаУслуга;
	Элементы.ДеревоОбъектовУчета.ИзменитьСтроку();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЛСПоЗданию(Команда)
	
	// БИТ_ЖКХ 03.10.2014
	Объект.ПодборРазныеЗдания = Ложь;
	Элементы.ПодборРазныеЗдания.Видимость = Ложь;
	// БИТ_ЖКХ 03.10.2014
	
	ТекущиеДанные = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите строку дерева!");
		
		Возврат;
		
	КонецЕсли; 
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Данные = ?(Родитель = Неопределено, ТекущиеДанные, Родитель);
	
	ЗаполнитьСтрокиДереваПоЗданию(Данные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаПредставлениеЗданияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ВыбранноеЗначение = ТекущиеДанные.Здание Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Отказ = Ложь;
	ПроверитьВозможностьУстановкиСчетчикаНаЗдание(ВыбранноеЗначение, ТекущиеДанные.Услуга, Отказ);
	
	Если НЕ Отказ Тогда
		
		ПодчениеныеСтроки = ТекущиеДанные.ПолучитьЭлементы();
		ПодчениеныеСтроки.Очистить();
		
		ТекущиеДанные.Здание              = ВыбранноеЗначение;
		
		Улица = ПолучитьУлицуНаСервере(ВыбранноеЗначение);
		
		ТекущиеДанные.ПредставлениеЗдания = "ул. " + Улица + ", д. " + ВыбранноеЗначение;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУлицуНаСервере(ВыбранноеЗначение)
	
	Возврат	ВыбранноеЗначение.Улица;
	
КонецФункции

&НаСервере
Процедура ПроверитьВозможностьУстановкиСчетчикаНаЗдание(Здание, Услуга, Отказ = Ложь)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"  , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Улица" , Здание.Улица);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			&Дата,
	|			Улица = &Улица
	|				И Здание = &Здание
	|				И Услуга = &Услуга) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ШаблоныУслугСрезПоследних.Услуга";
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Услуга " + Услуга+ " не установлена на здании: " + Здание +", ул. " + Здание.Улица);
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ТекущиеДанные = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат
		
	КонецЕсли; 
	
	СписокЛС = Новый СписокЗначений;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Для каждого СтрокаТаблицы_Лицевыесчета Из Родитель.ПолучитьЭлементы() Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы_Лицевыесчета.ЛицевойСчет) Тогда
			
			СписокЛС.Добавить(СтрокаТаблицы_Лицевыесчета.ЛицевойСчет);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая",,Элемент, КлючУникальности);
	
	ОтборУслуг = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУслуг.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Здание");
	ОтборУслуг.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборУслуг.ПравоеЗначение = Родитель.Здание;
	
	Если СписокЛС.Количество() > 0 Тогда
		
		ОтборЛС = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЛС.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборЛС.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ОтборЛС.ПравоеЗначение = СписокЛС;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 02.12.2015 17:39:44 
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьЛицевыеСчетаСоСчетчика
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика Тогда
		
		ОтборЛС = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЛС.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборЛС.ВидСравнения   = ?(Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
									ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 02.12.2015 17:37:17 
									,ВидСравненияКомпоновкиДанных.НеВСписке
									,ВидСравненияКомпоновкиДанных.ВСписке);
		ОтборЛС.ПравоеЗначение = мКэшЗначений.СписокЛС;
		
	КонецЕсли; 
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаПредставлениеЗданияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ТекущиеДанные = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат
		
	КонецЕсли; 
	
	СписокЗданий = Новый СписокЗначений;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Для каждого СтрокаТаблицы_ДеревоОбъектов Из ДеревоОбъектовУчета.ПолучитьЭлементы() Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы_ДеревоОбъектов.Здание) И СтрокаТаблицы_ДеревоОбъектов.Услуга = ТекущиеДанные.Услуга Тогда
			
			СписокЗданий.Добавить(СтрокаТаблицы_ДеревоОбъектов.Здание);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",,Элемент);
	
	ОтборЗдания = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЗдания.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
	ОтборЗдания.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЗдания.ПравоеЗначение = Объект.Организация;
	
	Если СписокЗданий.Количество() > 0 Тогда
		
		ОтборЗдания = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЗдания.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборЗдания.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ОтборЗдания.ПравоеЗначение = СписокЗданий;
		
	КонецЕсли; 
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиДерева(Услуга)
	
	КолСтрок = ДеревоОбъектовУчета.ПолучитьЭлементы().Количество();
	
	Если КолСтрок = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Дерево = РеквизитФормыВЗначение("ДеревоОбъектовУчета");
	
	Отбор = Новый Структура;
	Отбор.Вставить("Услуга",Услуга);
	
	МассивСтрок = Дерево.Строки.НайтиСтроки(Отбор);
	
	Для каждого СтрокаНаУдаление Из МассивСтрок Цикл
		
		Дерево.Строки.Удалить(СтрокаНаУдаление);
		
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОбъектовУчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ВыбранноеЗначение = ТекущиеДанные.Услуга Тогда
		
		ПодчиненныеСтроки = ТекущиеДанные.ПолучитьЭлементы();
		ПодчиненныеСтроки.Очистить();
		
		ТекущиеДанные.Услуга = ВыбранноеЗначение;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ДеревоОбъектовУчета.ТекущиеДанные;
	
	Отказ = Ложь;
	
	Родитель = ТекСтрока.ПолучитьРодителя();
	
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.УдалитьЛицевыеСчетаСоСчетчика") Тогда
		
		ПроверитьВозможностьУстановкиСчетчикаНаЛицевойСчет(Родитель.Здание,
		ВыбранноеЗначение, 
		Родитель.Услуга, 
		, 
		ТекСтрока.ОтветственноеЛицо, 
		ТекСтрока.Индивидуальный, 
		, 
		Отказ);
		
		Если Отказ Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеУровни()
	
	Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
	
	Для каждого Строка Из Корень Цикл
		
		Элементы.ДеревоОбъектовУчета.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		
		ТекущийОбъект.ЛицевыеСчета.Очистить();
		
		ПервыйУровень = ДеревоОбъектовУчета.ПолучитьЭлементы();
		
		Для каждого ТекСтрокаПервогоУровня Из ПервыйУровень Цикл
			
			ВторойУровень = ТекСтрокаПервогоУровня.ПолучитьЭлементы();
			
			Для каждого ТекСтрокаВторогоУровня Из ВторойУровень Цикл
				
				НоваяСтрока = ТекущийОбъект.ЛицевыеСчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаВторогоУровня);
				
				// БИТ_ЖКХ 03.10.2014
				Если Объект.ПодборРазныеЗдания = Истина Тогда
					
					НоваяСтрока.Услуга = ТекСтрокаВторогоУровня.Услуга;
					НоваяСтрока.Здание = ТекСтрокаВторогоУровня.Здание;
					НоваяСтрока.Адрес  = ТекСтрокаВторогоУровня.ПредставлениеЗдания;
				Иначе
					НоваяСтрока.Услуга = ТекСтрокаПервогоУровня.Услуга;
					НоваяСтрока.Здание = ТекСтрокаПервогоУровня.Здание;
					НоваяСтрока.Адрес  = ТекСтрокаПервогоУровня.ПредставлениеЗдания;
					
				КонецЕсли;
				// БИТ_ЖКХ 03.10.2014
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДерево()
	
	ПервыйУровень = ДеревоОбъектовУчета.ПолучитьЭлементы();
	ПервыйУровень.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЛС", Объект.ЛицевыеСчета.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЛС.Услуга КАК Услуга,
	|	ТаблицаЛС.Здание КАК Здание,
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.ОтветственноеЛицо,
	|	ТаблицаЛС.Индивидуальный,
	|	ТаблицаЛС.Адрес КАК Адрес
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&ТаблицаЛС КАК ТаблицаЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Услуга КАК Услуга,
	|	Таблица.Здание КАК Здание,
	|	Таблица.ЛицевойСчет,
	|	Таблица.ОтветственноеЛицо,
	|	Таблица.Индивидуальный,
	|	Таблица.Адрес КАК Адрес
	|ИЗ
	|	Таблица КАК Таблица
	|ИТОГИ
	|	МАКСИМУМ(Адрес)
	|ПО
	|	Услуга,
	|	Здание";
	
	ВыборкаУслуга = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуга.Следующий() Цикл
		
		ВыборкаЗдания = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗдания.Следующий() Цикл
			
			НоваяСтрокаПервогоУровня = ПервыйУровень.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПервогоУровня,ВыборкаЗдания);
			
			// БИТ_ЖКХ 03.10.2014
			Если Объект.ПодборРазныеЗдания Тогда
				
			Иначе
				Элементы.ПодборРазныеЗдания.Видимость = Ложь;
				НоваяСтрокаПервогоУровня.ПредставлениеЗдания = ВыборкаЗдания.Адрес;
			КонецЕсли;
			// БИТ_ЖКХ 03.10.2014
			
			НоваяСтрокаПервогоУровня.Родитель            = Истина;
			
			Выборка = ВыборкаЗдания.Выбрать();
			
			ВторойУровень = НоваяСтрокаПервогоУровня.ПолучитьЭлементы();
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрокаВторогоУровня = ВторойУровень.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВторогоУровня,Выборка);
				
				НоваяСтрокаВторогоУровня.Услуга              = Выборка.Услуга;
				НоваяСтрокаВторогоУровня.ПредставлениеЗдания = Выборка.Адрес;
				
			КонецЦикла; 
			
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиДереваПоЗданию(ИдентификаторСтроки)
	
	ТекущиеДанные = ДеревоОбъектовУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СписокИсключений = Новый СписокЗначений;
	
	Корень = ТекущиеДанные.ПолучитьЭлементы();
	
	Для каждого СтрокаДерева Из Корень Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.ЛицевойСчет) Тогда
			
			СписокИсключений.Добавить(СтрокаДерева.ЛицевойСчет);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	ПостроительЗапроса.Параметры.Вставить("Дата"            , КонецДня(Объект.Дата));
	ПостроительЗапроса.Параметры.Вставить("Здание"          , ТекущиеДанные.Здание);
	ПостроительЗапроса.Параметры.Вставить("Услуга"          , ТекущиеДанные.Услуга);
	ПостроительЗапроса.Параметры.Вставить("СписокИсключений", СписокИсключений);
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|ПОМЕСТИТЬ ОтвЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, НЕ ЛицевойСчет В (&СписокИсключений)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование,
	|	ОтвЛицо.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			Услуга = &Услуга
	|				И ЛицевойСчет.Здание = &Здание
	|				И НЕ ЛицевойСчет В (&СписокИсключений)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвЛицо КАК ОтвЛицо
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ОтвЛицо.ЛицевойСчет
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Наименование,
	|	ОтвЛицо.ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчетНаименование";
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 03.12.2015 13:10:20 
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьЛицевыеСчетаСоСчетчика
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика Тогда
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = ?(Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
								ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 03.12.2015 13:10:36 
								,ВидСравнения.НеВСписке
								,ВидСравнения.ВСписке);
		ОтборЛС.Значение      = мКэшЗначений.СписокЛС;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли; 
	
	ПостроительЗапроса.Выполнить();
	
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Корень.Добавить();
		
		НоваяСтрока.Здание              = ТекущиеДанные.Здание;
		НоваяСтрока.Услуга              = ТекущиеДанные.Услуга;
		НоваяСтрока.ПредставлениеЗдания = ТекущиеДанные.ПредставлениеЗдания;
		НоваяСтрока.ЛицевойСчет         = Выборка.ЛицевойСчет;
		НоваяСтрока.ОтветственноеЛицо   = Выборка.ФизЛицо;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеСчетчиков(СписокУслуг)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Объект"     , Объект.Объект);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("Ссылка"     , Параметры.Ключ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И Услуга В (&СписокУслуг)
	|				И (НЕ Регистратор = &Ссылка)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|ИТОГИ ПО
	|	Услуга";
	
	ВыборкаУС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУС.Следующий() Цикл
		
		Выборка = ВыборкаУС.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Услуга = СписокУслуг.НайтиПоЗначению(ВыборкаУС.Услуга);
			
			Если НЕ Услуга = Неопределено Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По услуге: " + Услуга + " установлен другой счетчик начисление разовых не требуется.");
				
				СписокУслуг.Удалить(Услуга);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура МестоУстановкиСчетчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", мКэшЗначений.Квартира);
	
	ОткрытьФорму("Справочник.бит_Комнаты.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтавкуПоСчетчикуПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущаяСтрока.Услуга.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните услугу.");
		
		Возврат;
		
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь; 
	
	СписокПоставщиков = ПолучитьСписокПоставщиковНаСервере(ТекущаяСтрока.Услуга);
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Ссылка", СписокПоставщиков);
	
	ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("ОтобратьИзДокументаУстановкаСчетчика", Отбор), Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьКэшРеквизитовСчетчика(Ссылка, КэшЗначений)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_Счетчики.ТипСчетчика,
	|	бит_Счетчики.Разрядность
	|ИЗ
	|	Справочник.бит_Счетчики КАК бит_Счетчики
	|ГДЕ
	|	бит_Счетчики.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	КэшЗначений.Разрядность = Выборка.Разрядность;
	КэшЗначений.ТипСчетчика = Выборка.ТипСчетчика;
	
	// БИТ_ЖКХ 06.11.2014
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Регистратор,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = &Счетчик";
	
	Запрос.УстановитьПараметр("Счетчик", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		КэшЗначений.СчетчикСЗависимымиУслугами = ВыборкаДетальныеЗаписи.СчетчикСЗависимымиУслугами;
		
	КонецЦикла;
	// БИТ_ЖКХ 06.11.2014
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСчетчикаНаСервере()
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УстановкаСчетчика Тогда
		
		Если Объект.Счетчик.ТипСчетчика = мКэшЗначений.Перечисления.бит_ТипСчетчика.Групповой Тогда
			Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам;
		Иначе
			Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам;
		КонецЕсли;
		ЗаполнитьКэшРеквизитовСчетчика(Объект.Счетчик, мКэшЗначений);
	Иначе
		ОбновитьКэшПоСчетчику();
		
		Если Объект.Счетчик.ТипСчетчика = мКэшЗначений.Перечисления.бит_ТипСчетчика.Групповой Тогда
			ОбновитьДерево();
		КонецЕсли; 
		
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();
	
	ЗаполнитьКэшРеквизитовСчетчика(Объект.Счетчик, мКэшЗначений);
	
	// БИТ_ЖКХ 06.11.2014
	Объект.СчетчикСЗависимымиУслугами = мКэшЗначений.СчетчикСЗависимымиУслугами;
	// БИТ_ЖКХ 06.11.2014
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьКэшРеквизитовЛицевогоСчета(Ссылка, КэшЗначений)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	КэшЗначений.Квартира = Выборка.Квартира;
	
КонецПроцедуры

&НаСервере
Процедура ОбъектПриИзмененииНаСервере()
	
	УправлениеЭлементамиФормы();
	
	ЗаполнитьКэшРеквизитовЛицевогоСчета(Объект.Объект, мКэшЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(мКэшЗначений.Перечисления.бит_ВидыОпераций.УстановкаСчетчика);
	ДанныеВыбора.Добавить(мКэшЗначений.Перечисления.бит_ВидыОпераций.СнятиеСчетчика);
	ДанныеВыбора.Добавить(мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик);
	ДанныеВыбора.Добавить(мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик); // БИТ_ЖКХ 27.11.2015 15:28:41 
	ДанныеВыбора.Добавить(мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьЛицевыеСчетаСоСчетчика);
	ДанныеВыбора.Добавить(мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик);
	ДанныеВыбора.Добавить(мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	// БИТ_ЖКХ 27.11.2015 13:43:41 Начало правки... 
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик И ЗначениеЗаполнено(Объект.Счетчик) Тогда
		
		МассивУслугЖКХ = ПолучитьМассивУслугЖКХСервер(Объект.Счетчик);
		ДанныеВыбора.ЗагрузитьЗначения(МассивУслугЖКХ);
		
	Иначе		
		
		Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
			ДанныеВыбора.Добавить(СтрокаТаблицы.Услуга);
		КонецЦикла;
		
	КонецЕсли;
	//Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
	//	
	//	ДанныеВыбора.Добавить(СтрокаТаблицы.Услуга);
	//	
	//КонецЦикла;
	// БИТ_ЖКХ 27.11.2015 13:43:44 Конец правки. 
	
КонецПроцедуры

// БИТ_ЖКХ 27.11.2015 13:52:30 Начало правки...
&НаСервереБезКонтекста
Функция ПолучитьМассивУслугЖКХСервер(Счетчик)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = &Счетчик
	|	И бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать";
	
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга");
	
КонецФункции
// БИТ_ЖКХ 27.11.2015 13:52:30 Конец правки.

&НаКлиенте
Процедура ВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ВыбранноеЗначение Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗдания(Команда)
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьЗданияЗавершение", ЭтотОбъект), "Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗданияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьСписокЗданий();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьСписокЗданий()
	
	ПервыйУровень = ДеревоОбъектовУчета.ПолучитьЭлементы();
	ПервыйУровень.Очистить();
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика Тогда
		
		Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
			
			Для каждого ЭлементСписка Из мКэшЗначений.СписокЗданий Цикл
				
				Отказ = Ложь;
				
				Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик Тогда
					ПроверитьВозможностьУстановкиСчетчикаНаЗдание(ЭлементСписка.Значение, СтрокаТаблицы.Услуга, Отказ);
				КонецЕсли;
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли; 
				
				НоваяСтрокаПервогоУровня = ПервыйУровень.Добавить();
				НоваяСтрокаПервогоУровня.Услуга              = СтрокаТаблицы.Услуга;
				НоваяСтрокаПервогоУровня.Здание              = ЭлементСписка.Значение;
				НоваяСтрокаПервогоУровня.ПредставлениеЗдания = ЭлементСписка.Представление;
				НоваяСтрокаПервогоУровня.Родитель            = Истина;
				
				Для каждого ЭлементСпискаЛС Из мКэшЗначений.СписокЛС Цикл
					
					Если НЕ ЭлементСписка.Значение = ЭлементСпискаЛС.Значение.Здание Тогда
						Продолжить;
					КонецЕсли; 
					
					Отказ = Ложь;
					
					ОтветственноеЛицо    = ПолучитьОтвЛицо(ЭлементСпискаЛС.Значение);
					Индивидуальный       = Ложь;
					
					Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик Тогда
						
						ПроверитьВозможностьУстановкиСчетчикаНаЛицевойСчет(ЭлементСписка.Значение, 
						ЭлементСпискаЛС.Значение, 
						СтрокаТаблицы.Услуга, 
						,
						ОтветственноеЛицо, 
						Индивидуальный, 
						, 
						Отказ);
					КонецЕсли;
					
					Если Отказ Тогда
						Продолжить;
					КонецЕсли;
					
					ВторойУровень = НоваяСтрокаПервогоУровня.ПолучитьЭлементы();
					
					НоваяСтрокаВторогоУровня = ВторойУровень.Добавить();
					НоваяСтрокаВторогоУровня.Услуга              = СтрокаТаблицы.Услуга;
					НоваяСтрокаВторогоУровня.Здание              = ЭлементСписка.Значение;
					НоваяСтрокаВторогоУровня.ПредставлениеЗдания = ЭлементСписка.Представление;
					НоваяСтрокаВторогоУровня.ЛицевойСчет         = ЭлементСпискаЛС.Значение;
					НоваяСтрокаВторогоУровня.ОтветственноеЛицо   = ОтветственноеЛицо;
					
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЦикла;
		
	Иначе
		
		Для каждого ЭлементСпискаУС Из мКэшЗначений.СписокУС Цикл
			
			Для каждого ЭлементСписка Из мКэшЗначений.СписокЗданий Цикл
				
				НоваяСтрокаПервогоУровня = ПервыйУровень.Добавить();
				НоваяСтрокаПервогоУровня.Услуга              = ЭлементСпискаУС.Значение;
				НоваяСтрокаПервогоУровня.Здание              = ЭлементСписка.Значение;
				НоваяСтрокаПервогоУровня.ПредставлениеЗдания = ЭлементСписка.Представление;
				НоваяСтрокаПервогоУровня.Родитель            = Истина;
				
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры // () 

&НаКлиенте
Процедура УслугиРежимПотребленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущаяСтрока.Услуга.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните услугу.");
		
		Возврат;
		
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь; 
	// БИТ_ЖКХ 24.03.2014
	СписокРежимов = РежимыПотребленияУслугНаСервере(ТекущаяСтрока.Услуга);
	// БИТ_ЖКХ 24.03.2014
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_РежимыПотребленияУслуг.Форма.ФормаВыбораУправляемая",,Элемент);
	
	Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ПравоеЗначение = СписокРежимов;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

// БИТ_ЖКХ 24.03.2014
&НаСервере
Функция РежимыПотребленияУслугНаСервере(Услуга)
	
	СписокРежимов = Новый СписокЗначений;
	
	РежимыПотребленияУслуг = Услуга.РежимыПотребленияУслуг;	
	
	Для Каждого СтрокаТаблицы из РежимыПотребленияУслуг Цикл
		СписокРежимов.Добавить(СтрокаТаблицы.РежимПотребленияУслуг);
	КонецЦикла;
	
	Возврат СписокРежимов;
	
КонецФункции	
// БИТ_ЖКХ 24.03.2014

&НаКлиенте
Процедура СчетчикСЗависимымиУслугамиПриИзменении(Элемент)
	
	Если Объект.СчетчикСЗависимымиУслугами Тогда
		Объект.Многотарифный = Ложь;
		Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных");
		Объект.ИспользоватьПравилоУменьшения = Ложь;
		
	Иначе
		
		Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
			СтрокаТаблицы.ОсновнаяУслуга = Ложь;
		КонецЦикла; 
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиОсновнаяУслугаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
		
		СтрокаТаблицы.ОсновнаяУслуга = (СтрокаТаблицы.Услуга = ТекущиеДанные.Услуга);
		
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПравилоУменьшенияПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УслугиСпособРасчетаУменьшенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	Элемент.СписокВыбора.Очистить();
	
	// БИТ_ЖКХ 08.12.2014{{
	МассивСпособРасчета = СпособыРасчетаНаСервере(ТекущиеДанные.Услуга);
	// БИТ_ЖКХ 08.12.2014}}
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивСпособРасчета);
	
КонецПроцедуры

// БИТ_ЖКХ 08.12.2014{{
&НаСервере
Функция СпособыРасчетаНаСервере(Услуга)
	
	МассивСпособРасчета = Услуга.СпособыРасчета.ВыгрузитьКолонку("СпособРасчета");
	
	Для Индекс = 0 по МассивСпособРасчета.ВГраница() Цикл
		
		Значение = МассивСпособРасчета.Получить(Индекс);
		
		Если Значение = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам") Тогда
			
			МассивСпособРасчета.Удалить(Индекс);
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;		 
	
	Возврат МассивСпособРасчета;
	
КонецФункции 
// БИТ_ЖКХ 08.12.2014}}

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Объект.Услуги.Количество() = мКэшЗначений.СписокУС.Количество()
		И Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("УслугиПриОкончанииРедактированияЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), "Вы указали все подключенные услуги для удаления. Вы хотите снять счетчик?", РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриОкончанииРедактированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.СнятиеСчетчика;
		СчетчикПриИзменении(Элементы.Счетчик);
		
	Иначе
		
		СтрокаПоиск = Объект.Услуги.Индекс(Элемент.ТекущиеДанные);
		Объект.Услуги.Удалить(СтрокаПоиск);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСпособРаспределенияУменьшенияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Массив = Новый Массив;
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРаспределения.ПоСпособуРасчетаФакт"));
	
	ОчиститьСпособРасчета = Массив.Найти(ТекСтрока.СпособРаспределенияУменьшения) = Неопределено;
	
	Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
		
		СтрокаТаблицы.СпособРаспределенияУменьшения =  ТекСтрока.СпособРаспределенияУменьшения;
		
		Если ОчиститьСпособРасчета Тогда
			СтрокаТаблицы.СпособРасчетаУменьшения = Неопределено;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// БИТ_ЖКХ_27012014_начало_изменений
&НаСервере
Функция ПолучитьСписокПоставщиковНаСервере(Услуга)
	
	ТаблицаПоставщиков = Услуга.Поставщики;
	
	СписокПоставщиков = Новый СписокЗначений;
	
	СписокПоставщиков.ЗагрузитьЗначения(ТаблицаПоставщиков.ВыгрузитьКолонку("Поставщик"));
	
	Возврат СписокПоставщиков;
	
КонецФункции
// БИТ_ЖКХ_27012014_окончание_изменений

&НаКлиенте
Процедура ПодборРазныеЗдания(Команда)
	
	// БИТ_ЖКХ 03.10.2014
	Объект.ПодборРазныеЗдания = Истина;
	Элементы.ПодборРазныеЗдания.Видимость = Истина;
	// БИТ_ЖКХ 03.10.2014
	
	Если Объект.Проведен Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ проведен. Изменения невозможны!");
		
	ИначеЕсли Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.СнятиеСчетчика Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("При снятии счетчика изменения невозможны!");
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
		ПараметрыФормы.Вставить("Дата"              , Объект.Дата);
		ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
		
		СписокУслуг = Новый СписокЗначений;
		
		Корень = ДеревоОбъектовУчета.ПолучитьЭлементы();
		
		Для каждого СтрокаТаблицы Из Корень Цикл
			Если СписокУслуг.НайтиПоЗначению(СтрокаТаблицы.Услуга) = Неопределено Тогда
				СписокУслуг.Добавить(СтрокаТаблицы.Услуга);
			КонецЕсли; 
		КонецЦикла; 
		
		ПараметрыФормы.Вставить("СписокУслуг", СписокУслуг);
		
		СписокУлиц   = Новый СписокЗначений;
		СписокЗданий = Новый СписокЗначений;
		
		ПараметрыФормы.Вставить("СписокЗданий", СписокЗданий);
		ПараметрыФормы.Вставить("СписокУлиц"  , СписокУлиц);
		
		Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 02.12.2015 17:39:44 
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьЛицевыеСчетаСоСчетчика
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьУслугиНаСчетчик 
			ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.УдалитьУслугиСоСчетчика Тогда
			
			ПараметрыФормы.Вставить("СписокЛС"  , мКэшЗначений.СписокЛС);
			ПараметрыФормы.Вставить("ВСписке "  , (НЕ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЛицевыеСчетаНаСчетчик
													И НЕ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОпераций.ДобавитьЗданияНаСчетчик)); // БИТ_ЖКХ 03.12.2015 13:16:47 
			
		КонецЕсли; 
		
		ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыбранныеЗначенияУслуга(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Отбор = Новый Структура;
	
	Дерево = РеквизитФормыВЗначение("ДеревоОбъектовУчета");
	
	Для каждого ЭлементКоллекции Из ТаблицаЛС Цикл
		
		Отбор.Вставить("Услуга"     , ЭлементКоллекции.Услуга);
		
		// БИТ_ЖКХ 10.09.2014
		// Отбор.Вставить("Здание"     , ЭлементКоллекции.Здание);.
		// БИТ_ЖКХ 10.09.2014
		
		Корень = Дерево.Строки.НайтиСтроки(Отбор);
		
		Если НЕ Корень.Количество() = 1 Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не найдено строк по зданию: " + ЭлементКоллекции.Здание + " и услуге: " + ЭлементКоллекции.Услуга);
			
			Продолжить;
			
		КонецЕсли; 
		
		Отбор.Очистить();
		
		ПоискЛС = Корень[0].Строки.Найти(ЭлементКоллекции.ЛицевойСчет, "ЛицевойСчет");
		
		Если НЕ ПоискЛС = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Отказ = Ложь;
		
		ОтветственноеЛицо    = Неопределено;
		Индивидуальный       = Ложь;
		
		ПроверитьВозможностьУстановкиСчетчикаНаЛицевойСчет(ЭлементКоллекции.Здание, 
		ЭлементКоллекции.ЛицевойСчет, 
		ЭлементКоллекции.Услуга, 
		,
		ОтветственноеЛицо, 
		Индивидуальный, 
		, 
		Отказ);
		
		Если НЕ Отказ Тогда
			
			// БИТ_ЖКХ 03.10.2014
			Если Объект.ПодборРазныеЗдания = Истина Тогда
				Корень[0].ПредставлениеЗдания  = "";
			КонецЕсли;
			// БИТ_ЖКХ 03.10.2014
			
			НоваяСтрока = Корень[0].Строки.Добавить();
			
			НоваяСтрока.ПредставлениеЗдания = ЭлементКоллекции.Адрес;
			НоваяСтрока.Услуга              = ЭлементКоллекции.Услуга;
			НоваяСтрока.ЛицевойСчет         = ЭлементКоллекции.ЛицевойСчет;
			НоваяСтрока.ОтветственноеЛицо   = ОтветственноеЛицо;
			НоваяСтрока.Индивидуальный      = Индивидуальный;
			НоваяСтрока.Здание              = ЭлементКоллекции.Здание;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОбъектовУчета");
	
КонецПроцедуры

// БИТ_ЖКХ 08.12.2014{{ 
&НаСервере
Процедура СпособыПоГрупповым()
	
	Если Объект.СпособРасчета = мКэшЗначений.Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам Тогда
		
		Элементы.ИспользоватьПравилоУменьшения.Заголовок       = "Использовать способ расчета";
		Элементы.УслугиСпособРаспределения.Видимость           = Ложь;
		Элементы.УслугиСпособРаспределенияУменьшения.Видимость = Ложь;
		
		Если Объект.ИспользоватьПравилоУменьшения Тогда
			Элементы.УслугиСпособРасчетаУменьшения.Видимость       = Истина;
			Элементы.Услуги.ПодчиненныеЭлементы.УслугиСпособРасчетаУменьшения.Заголовок = "Способ расчета";
			Элементы.Услуги.ПодчиненныеЭлементы.УслугиСпособРасчетаУменьшения.Доступность = Истина;
		Иначе
			Элементы.УслугиСпособРасчетаУменьшения.Видимость       = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ИспользоватьПравилоУменьшения.Заголовок       = "Использовать правило уменьшения объема коммунального ресурса";
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 08.12.2014}}

#КонецОбласти