
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызов механизма разделения прав доступа.
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_СписокУлиц"));
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,СправочникОбъект,ЭтаФорма);	
	
КонецПроцедуры

// Изменяет старое наименование при замене наименования.
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.СтароеНаименование = Объект.Ссылка;
	
КонецПроцедуры

#КонецОбласти