
#Область ПроцедурыОбработчикиСобытийФормы

// БИТ_ЖКХ_03122013_начало_изменений
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ЭтаФорма.Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КоманднаяПанельФормаДействиеПодбор(Команда)
	
	ОткрытьФорму("Справочник.бит_СтепениРодстваФизЛиц.Форма.ФормаПодбораИзКлассификатораУправляемая",,Этаформа);
	
КонецПроцедуры
// БИТ_ЖКХ_03122013_окончание_изменений

#КонецОбласти