
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		
		Объект.НаименованиеПолное = Объект.Наименование;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда
		
		СтатьяОборотовПриИзмененииНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СтатьяОборотовПриИзмененииНаСервере()
	
	Объект.Наименование 	  = Объект.СтатьяОборотов.Наименование;
	Объект.НаименованиеПолное = Объект.СтатьяОборотов.НаименованиеПолное;
	Объект.Кодификатор 	      = Объект.СтатьяОборотов.Кодификатор;
	
КонецПроцедуры

#КонецОбласти