#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура сохраняет отбор в хранилище значения. 
//
// Параметры:
//  Настройки – Структура.
//
Процедура СохранитьНастройкиПостроителя(Настройки) Экспорт 

	НастройкиПостроителя = Новый ХранилищеЗначения(Настройки);

КонецПроцедуры // СохранитьНастройкиПостроителя()

// Функция извлекает из хранилища значения настройки отбора.
//
//
// Возвращаемое значение:
//  РезНастройки – Структура.
//
Функция ПолучитьНастройкиПостроителя() Экспорт

	РезНастройки = НастройкиПостроителя.Получить();

	Возврат РезНастройки;
	
КонецФункции // ПолучитьНастройкиПостроителя()

#КонецОбласти

#КонецЕсли