
#Область ПеременныеМодуля

Перем мВалютаРегламентированногоУчета Экспорт; // Хранит валюту регламентированного учета.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "" Тогда
		ТабДокумент = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура();
	
КонецФункции

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбеспечениеПроведенияДокумента

// Процедура выполняет проверку заполнения шапки и таб. частей.
//
// Параметры:
// Отказ - булево,
// Заголовок  – Строка.
Процедура ПроверкаРеквизитов(Отказ,Заголовок)
	
	// Проверим заполнение шапки.
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Услуга");
	СтруктураОбязательныхПолей.Вставить("Организация");
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,  СтруктураОбязательныхПолей,   Отказ, Заголовок);
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Адреса".
//
// Параметры: 
//  ТаблицаУслуги - результат запроса, содержащий данные для проведения и проверки ТЧ Адреса.
//  СтруктураШапкиДокумента   - структура, содержащая реквизиты шапки документа и результаты запроса по шапке.
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиАдреса(ТаблицаАдреса, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "Адреса";
	
	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура();
	СтруктураОбязательныхПолей.Вставить("Улица");
	СтруктураОбязательныхПолей.Вставить("Здание");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проверим остатки.
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ОтключениеУслуги Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
		|			&Период,
		|			УслугаЖКХ = &Услуга
		|				И ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						бит_ЛицевыеСчета.Ссылка
		|					ИЗ
		|						Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|					ГДЕ
		|						бит_ЛицевыеСчета.Ссылка.УлицаЛицевогоСчета В (&СписокУлиц)
		|						И бит_ЛицевыеСчета.Ссылка.Здание В (&СписокЗданий))) КАК бит_НачисленияПоУслугамЖКХОстатки";
		Запрос.УстановитьПараметр("Период", ?(ЭтоНовый(),Дата,МоментВремени()));
		Запрос.УстановитьПараметр("Услуга", Услуга);
		Запрос.УстановитьПараметр("СписокУлиц", Адреса.ВыгрузитьКолонку("Улица"));
		Запрос.УстановитьПараметр("СписокЗданий", Адреса.ВыгрузитьКолонку("Здание"));
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Отказ = Истина;

			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "По отключаемой услуге имеются остатки:";
			Сообщение.Сообщить();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Лицевой счет <"+Выборка.ЛицевойСчет+"> по улице <"+Выборка.ЛицевойСчет.УлицаЛицевогоСчета+"> здание <"+Выборка.ЛицевойСчет.Здание+">";
				Сообщение.Сообщить();
				
			КонецЦикла;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	бит_СведенияПоУслугамЛССрезПоследних.Период,
			|	бит_СведенияПоУслугамЛССрезПоследних.Регистратор,
			|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
			|ИЗ
			|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
			|			&Период,
			|			Услуга = &Услуга
			|				И ЛицевойСчет В
			|					(ВЫБРАТЬ
			|						бит_ЛицевыеСчета.Ссылка
			|					ИЗ
			|						Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
			|					ГДЕ
			|						бит_ЛицевыеСчета.Ссылка.УлицаЛицевогоСчета В (&СписокУлиц)
			|						И бит_ЛицевыеСчета.Ссылка.Здание В (&СписокЗданий))) КАК бит_СведенияПоУслугамЛССрезПоследних
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(бит_СведенияПоУслугамЛССрезПоследних.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ)";
			Запрос.УстановитьПараметр("Период", ?(ЭтоНовый(),Дата,МоментВремени()));
			Запрос.УстановитьПараметр("ДатаДокумента", Дата);
			Запрос.УстановитьПараметр("Услуга", Услуга);
			Запрос.УстановитьПараметр("СписокУлиц", ТаблицаАдреса.ВыгрузитьКолонку("Улица"));
			Запрос.УстановитьПараметр("СписокЗданий", ТаблицаАдреса.ВыгрузитьКолонку("Здание"));
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Отказ = Истина;
				Выборка = Результат.Выбрать();
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Услугу для конкретного лицевого счета можно редактировать не более одного раза в месяц. Попытка повторного редактирования услуги:";
				Сообщение.Сообщить();
				
				Пока Выборка.Следующий() Цикл
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "По адресу: улица <"+Выборка.ЛицевойСчет.УлицаЛицевогоСчета+
					"> здание <"+Выборка.ЛицевойСчет.Здание+
					"> - лицевой счет <"+Выборка.ЛицевойСчет+
					"> в текущем месяце редактировался документом <"+Выборка.Регистратор+">!";
					Сообщение.Сообщить();
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса по табличной части "Адреса",
//  СтруктураШапкиДокумента   - структура, содержащая реквизиты шапки документа и результаты запроса по шапке.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуАдресов(РезультатЗапросаПоАдресам, СтруктураШапкиДокумента)
	
	ТаблицаАдреса = РезультатЗапросаПоАдресам.Выгрузить();
	
	Возврат ТаблицаАдреса;
	
КонецФункции

// Выполняет подготовительное заполнение таблиц для документа.
//
// Параметры: 
//  ТаблицаАдреса             - пустая таблица  ТЧ Адреса.
//  СтруктураШапкиДокумента   - структура, содержащая реквизиты шапки документа и результаты запроса по шапке.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаАдреса) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Адреса".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Улица"	, "Улица");
	СтруктураПолей.Вставить("Здание"      	, "Здание");
	
	РезультатЗапросаПоАдресам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Адреса", СтруктураПолей);
	
	// Подготовим таблицы услуг для проведения.
	ТаблицаАдреса = ПодготовитьТаблицуАдресов(РезультатЗапросаПоАдресам, СтруктураШапкиДокумента);
	
КонецПроцедуры	

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаАдреса,Отказ,Заголовок)
	
	НаборЗаписейШаблоны = Движения.бит_ШаблоныУслуг;
	НаборЗаписейСведенияПоУслугам = Движения.бит_СведенияПоУслугамЛС;
	
	Для Каждого ТекСтрока Из ТаблицаАдреса Цикл
		СтрокаДвижений = НаборЗаписейШаблоны.Добавить();
		СтрокаДвижений.Период = СтруктураШапкиДокумента.Дата;
		СтрокаДвижений.Услуга = СтруктураШапкиДокумента.Услуга;
		СтрокаДвижений.Улица  = ТекСтрока.Улица;
		СтрокаДвижений.Здание = ТекСтрока.Здание;
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ПодключениеУслуги Тогда
			СтрокаДвижений.Использовать = Перечисления.ДаНет.Да;
		Иначе
			СтрокаДвижений.Использовать = Перечисления.ДаНет.Нет;
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ОтключениеУслуги Тогда
		// Надо отключить услуги в лицевых счетах.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.Период,
		|	бит_СведенияПоУслугамЛССрезПоследних.Регистратор,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
		|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|			&Период,
		|			Услуга = &Услуга
		|				И Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
		|				И ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						бит_ЛицевыеСчета.Ссылка
		|					ИЗ
		|						Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|					ГДЕ
		|						бит_ЛицевыеСчета.Ссылка.УлицаЛицевогоСчета В (&СписокУлиц)
		|						И бит_ЛицевыеСчета.Ссылка.Здание В (&СписокЗданий))) КАК бит_СведенияПоУслугамЛССрезПоследних";
		Запрос.УстановитьПараметр("Период", ?(ЭтоНовый(),Дата,МоментВремени()));
		Запрос.УстановитьПараметр("Услуга", Услуга);
		Запрос.УстановитьПараметр("СписокУлиц", ТаблицаАдреса.ВыгрузитьКолонку("Улица"));
		Запрос.УстановитьПараметр("СписокЗданий", ТаблицаАдреса.ВыгрузитьКолонку("Здание"));
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = НаборЗаписейСведенияПоУслугам.Добавить();
			Движение.Период 		= СтруктураШапкиДокумента.Дата;
			Движение.ЛицевойСчет 	= Выборка.ЛицевойСчет;
			Движение.Услуга 		= Выборка.Услуга;
			Движение.РежимПотребления = Выборка.РежимПотребления;
			Движение.Поставщик 		= Выборка.Поставщик;
			Движение.СпособРасчета 	= Выборка.СпособРасчета;
			Движение.КоличествоЕдиницПотребления = Выборка.КоличествоЕдиницПотребления;
			Движение.Использовать 	= Перечисления.ДаНет.Нет;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаАдреса; // Хранит адреса.
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	ПроверкаРеквизитов(Отказ,Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаАдреса);
	
	ПроверитьЗаполнениеТабличнойЧастиАдреса(ТаблицаАдреса, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Выполним движения.
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаАдреса,Отказ,Заголовок);
	КонецЕсли; 
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_ОбщегоНазначения.ПередЗаписьюДокументаДляУдаленияДвиженийПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			
			ВидОперации = ДанныеЗаполнения.ВидОперации;
			
		КонецЕсли;
		
	Иначе
		
		ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ПодключениеУслуги;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецОбласти

#КонецЕсли