
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Разделитель = ";";
	СпособДетализации = 1;
	ЗаполнитьНачисления();
	ЗаполнитьУчастки();
	ЗаполнитьТипыКвартир();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисления()
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УслугиЖКХ.Ссылка КАК Начисление
	|ИЗ
	|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|ГДЕ
	|	НЕ бит_УслугиЖКХ.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_УслугиЖКХ.Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаНачисления = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисления, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Участки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_АдминистративныеОкруга.Ссылка КАК Участок
	|ИЗ
	|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга
	|ГДЕ
	|	НЕ бит_АдминистративныеОкруга.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_АдминистративныеОкруга.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаУчастки = Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастки, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКвартир()
	
	ТипыКвартир.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ТипыКвартиры.Ссылка КАК ТипКвартиры
	|ИЗ
	|	Справочник.бит_ТипыКвартиры КАК бит_ТипыКвартиры
	|ГДЕ
	|	НЕ бит_ТипыКвартиры.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ТипыКвартиры.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаТК = ТипыКвартир.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТК, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", НачалоПериода, КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатВыбора, "НачалоПериода,КонецПериода");
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления_УстановитьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления_СнятьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_УстановитьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_СнятьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_УстановитьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_СнятьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлCSV(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Сообщить("Не заполнен каталог!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Сообщить("Не заполнено начало периода!");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщить("Не заполнен конец периода!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не заполнена организация!");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеНаСервере();
	Если Не ТаблицаИтог.Количество() = 0 Тогда
		СформироватьФайлCSVНаКлиенте();	
	Иначе	
		Сообщить("Не найдены данные для сохранения в файл csv!");	
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	
	ТаблицаИтог.Очистить();
	
	МассивНачислений = ПолучитьМассивНачислений();
	МассивУчастков = ПолучитьМассивУчастков();
	МассивАдресов = ПолучитьМассивАдресов();
	МассивТиповКвартир = ПолучитьМассивТиповКвартир();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.Период) КАК Период,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира
	|ПОМЕСТИТЬ ВТ_ДатыКвартир
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыКвартир.Квартира КАК Квартира
	|ПОМЕСТИТЬ ВТ_КвартирыПоТипу
	|ИЗ
	|	ВТ_ДатыКвартир КАК ВТ_ДатыКвартир
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
	|		ПО ВТ_ДатыКвартир.Период = бит_СведенияОКвартире.Период
	|			И ВТ_ДатыКвартир.Квартира = бит_СведенияОКвартире.Квартира
	|ГДЕ
	|	бит_СведенияОКвартире.ТипКвартиры В(&ТипыКвартир)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХ.Регистратор.Дата, МЕСЯЦ) КАК Период,
	|	СУММА(бит_НачисленияПоУслугамЖКХ.СуммаРасход) КАК Оплачено,
	|	бит_НачисленияПоУслугамЖКХ.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ОборотОплаты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И ЛицевойСчет.Квартира В
	|					(ВЫБРАТЬ
	|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
	|					ИЗ
	|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)) КАК бит_НачисленияПоУслугамЖКХ
	|ГДЕ
	|	НЕ(бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
	|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндексаОбщедомовыхЗатрат
	|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХ.Регистратор.Дата, МЕСЯЦ),
	|	бит_НачисленияПоУслугамЖКХ.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий) КАК Адрес,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК Участок,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ) КАК Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот КАК Сумма,
	|	0 КАК Изменение
	|ПОМЕСТИТЬ ВТ_ОборотНачисленияДоГруппировки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И ЛицевойСчет.Квартира В
	|					(ВЫБРАТЬ
	|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
	|					ИЗ
	|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|ГДЕ
	|	НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга),
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ),
	|	0,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И ЛицевойСчет.Квартира В
	|					(ВЫБРАТЬ
	|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
	|					ИЗ
	|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|	И НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотНачисленияДоГруппировки.Начисление КАК Начисление,
	|	ВТ_ОборотНачисленияДоГруппировки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ОборотНачисленияДоГруппировки.Адрес КАК Адрес,
	|	ВТ_ОборотНачисленияДоГруппировки.Участок КАК Участок,
	|	ВТ_ОборотНачисленияДоГруппировки.Период КАК Период,
	|	СУММА(ВТ_ОборотНачисленияДоГруппировки.Сумма) КАК Сумма,
	|	СУММА(ВТ_ОборотНачисленияДоГруппировки.Изменение) КАК Изменение
	|ПОМЕСТИТЬ ВТ_ОборотНачисления
	|ИЗ
	|	ВТ_ОборотНачисленияДоГруппировки КАК ВТ_ОборотНачисленияДоГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОборотНачисленияДоГруппировки.Начисление,
	|	ВТ_ОборотНачисленияДоГруппировки.ЛицевойСчет,
	|	ВТ_ОборотНачисленияДоГруппировки.Адрес,
	|	ВТ_ОборотНачисленияДоГруппировки.Участок,
	|	ВТ_ОборотНачисленияДоГруппировки.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Начисление,
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Начисление, ВТ_ОборотОплаты.Начисление) КАК Начисление,
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Период, ВТ_ОборотОплаты.Период) КАК Период,
	|	СУММА(ВТ_ОборотНачисления.Сумма - ЕСТЬNULL(ВТ_ОборотНачисления.Изменение, 0)) КАК НачисленоСИзменениями,
	|	СУММА(ЕСТЬNULL(ВТ_ОборотНачисления.Изменение, 0)) КАК Изменение,
	|	СУММА(ЕСТЬNULL(ВТ_ОборотНачисления.Сумма, 0)) КАК НачисленоОборот,
	|	СУММА(ЕСТЬNULL(ВТ_ОборотОплаты.Оплачено, 0)) КАК Оплачено,
	|	ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет, ВТ_ОборотОплаты.ЛицевойСчет) КАК ЛицевойСчет,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание, ВТ_ОборотОплаты.ЛицевойСчет.Здание) КАК Справочник.бит_СписокЗданий) КАК Адрес,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание.Район, ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район) КАК Справочник.бит_АдминистративныеОкруга) КАК Участок
	|ПОМЕСТИТЬ ВТ_Оборот
	|ИЗ
	|	ВТ_ОборотНачисления КАК ВТ_ОборотНачисления
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.Начисление КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
	|			НАЧАЛОПЕРИОДА(ВТ_ОборотОплаты.Регистратор.Дата, МЕСЯЦ) КАК Период,
	|			СУММА(ВТ_ОборотОплаты.Оплачено) КАК Оплачено,
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий) КАК Адрес,
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК Участок
	|		ИЗ
	|			ВТ_ОборотОплаты КАК ВТ_ОборотОплаты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.Начисление КАК Справочник.бит_УслугиЖКХ),
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
	|			НАЧАЛОПЕРИОДА(ВТ_ОборотОплаты.Регистратор.Дата, МЕСЯЦ),
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий),
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)) КАК ВТ_ОборотОплаты
	|		ПО ВТ_ОборотНачисления.Начисление = ВТ_ОборотОплаты.Начисление
	|			И ВТ_ОборотНачисления.ЛицевойСчет = ВТ_ОборотОплаты.ЛицевойСчет
	|			И ВТ_ОборотНачисления.Период = ВТ_ОборотОплаты.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Начисление, ВТ_ОборотОплаты.Начисление),
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Период, ВТ_ОборотОплаты.Период),
	|	ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет, ВТ_ОборотОплаты.ЛицевойСчет),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание.Район, ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район) КАК Справочник.бит_АдминистративныеОкруга),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание, ВТ_ОборотОплаты.ЛицевойСчет.Здание) КАК Справочник.бит_СписокЗданий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаУчета,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход - бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход) КАК ЗадолженностьНаНачало,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход, 0) > 0
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПереплатыНаНачало
	|ПОМЕСТИТЬ ВТ_НачальныеОстатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			,
	|			&ДатаНачалаК,
	|			,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И ЛицевойСчет.Квартира В
	|					(ВЫБРАТЬ
	|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
	|					ИЗ
	|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)
	|				И 1 = 1) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаУчета,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход - бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход) КАК ЗадолженностьНаКонец,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход, 0) > 0
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПереплатыНаКонец
	|ПОМЕСТИТЬ ВТ_КонечныеОстатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			,
	|			&ДатаОкончания,
	|			,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И ЛицевойСчет.Квартира В
	|					(ВЫБРАТЬ
	|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
	|					ИЗ
	|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)
	|				И 1 = 1) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВТ_Оборот.Участок
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВТ_Оборот.Адрес
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВТ_Оборот.ЛицевойСчет
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаУчета,
	|	ВТ_Оборот.Начисление КАК Начисление,
	|	ЕСТЬNULL(ВТ_Оборот.Период, НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)) КАК Период,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.НачисленоСИзменениями, 0)) КАК НачисленоСИзменениями,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.Изменение, 0)) КАК Изменение,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.НачисленоОборот, 0)) КАК НачисленоОборот,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.Оплачено, 0)) КАК Оплачено
	|ПОМЕСТИТЬ ВТ_ВТ
	|ИЗ
	|	ВТ_Оборот КАК ВТ_Оборот
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВТ_Оборот.Участок
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВТ_Оборот.Адрес
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВТ_Оборот.ЛицевойСчет
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_Оборот.Период, НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)),
	|	ВТ_Оборот.Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_НачальныеОстатки.ЗадолженностьНаНачало, 0) КАК НачалоНачислено,
	|	ЕСТЬNULL(ВТ_НачальныеОстатки.ПереплатыНаНачало, 0) КАК НачалоОплачено,
	|	ЕСТЬNULL(ВТ_НачальныеОстатки.ЗадолженностьНаНачало - ВТ_НачальныеОстатки.ПереплатыНаНачало, 0) КАК ИтогоНачало,
	|	ЕСТЬNULL(ВТ_ВТ.АналитикаУчета, ВТ_НачальныеОстатки.АналитикаУчета) КАК АналитикаУчета,
	|	ЕСТЬNULL(ВТ_ВТ.Начисление, ВТ_НачальныеОстатки.УслугаЖКХ) КАК Начисление,
	|	ЕСТЬNULL(ВТ_ВТ.Период, НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)) КАК Период,
	|	ЕСТЬNULL(ВТ_ВТ.НачисленоСИзменениями, 0) КАК НачисленоСИзменениями,
	|	ЕСТЬNULL(ВТ_ВТ.Изменение, 0) КАК Изменение,
	|	ЕСТЬNULL(ВТ_ВТ.НачисленоОборот, 0) КАК НачисленоОборот,
	|	ЕСТЬNULL(ВТ_ВТ.Оплачено, 0) КАК Оплачено
	|ПОМЕСТИТЬ ВТ_НачОб
	|ИЗ
	|	ВТ_НачальныеОстатки КАК ВТ_НачальныеОстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВТ КАК ВТ_ВТ
	|		ПО ВТ_НачальныеОстатки.АналитикаУчета = ВТ_ВТ.АналитикаУчета
	|			И ВТ_НачальныеОстатки.УслугаЖКХ = ВТ_ВТ.Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачОб.НачалоНачислено КАК НачалоНачислено,
	|	ВТ_НачОб.НачалоОплачено КАК НачалоОплачено,
	|	ВТ_НачОб.ИтогоНачало КАК ИтогоНачало,
	|	ВТ_НачОб.АналитикаУчета КАК АналитикаУчета,
	|	ВТ_НачОб.Начисление КАК Начисление,
	|	ВТ_НачОб.Период КАК Период,
	|	ВТ_НачОб.НачисленоСИзменениями КАК НачисленоСИзменениями,
	|	ВТ_НачОб.Изменение КАК Изменение,
	|	ВТ_НачОб.НачисленоОборот КАК НачисленоОборот,
	|	ВТ_НачОб.Оплачено КАК Оплачено,
	|	ЕСТЬNULL(ВТ_КонечныеОстатки.ЗадолженностьНаКонец, 0) КАК КонецНачислено,
	|	ЕСТЬNULL(ВТ_КонечныеОстатки.ПереплатыНаКонец, 0) КАК КонецОплачено,
	|	ЕСТЬNULL(ВТ_КонечныеОстатки.ЗадолженностьНаКонец - ВТ_КонечныеОстатки.ПереплатыНаКонец, 0) КАК ИтогоКонец
	|ПОМЕСТИТЬ ВТ_ОстаткиОбороты
	|ИЗ
	|	ВТ_НачОб КАК ВТ_НачОб
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонечныеОстатки КАК ВТ_КонечныеОстатки
	|		ПО ВТ_НачОб.АналитикаУчета = ВТ_КонечныеОстатки.АналитикаУчета
	|			И ВТ_НачОб.Начисление = ВТ_КонечныеОстатки.УслугаЖКХ
	|;
	|
	//++bit Melnik 07.09.22
	//Изменение получения ответственного лица. Установка отбора по степени родства после формирования среза последних 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_Ответ
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&ДатаОкончания,
	|			ВЫБОР
	|				КОГДА &СпособДетализации = ""3""
	|					ТОГДА ЛицевойСчет В
	|								(ВЫБРАТЬ
	|									ВТ_ОстаткиОбороты.АналитикаУчета КАК АналитикаУчета
	|								ИЗ
	|									ВТ_ОстаткиОбороты КАК ВТ_ОстаткиОбороты)
	//|							И СтепеньРодства = ЗНАЧЕНИЕ(справочник.бит_СтепениРодстваФизЛиц.бит_ответственноеЛицо)
	|			КОНЕЦ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &ДатаОкончанияБезВремени
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И ВЫБОР
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(справочник.бит_СтепениРодстваФизЛиц.бит_ответственноеЛицо)	
	|   КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	//|	МАКСИМУМ(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо
	//|ПОМЕСТИТЬ ВТ_Ответ
	//|ИЗ
	//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	//|			&ДатаОкончания,
	//|			ВЫБОР
	//|				КОГДА &СпособДетализации = ""3""
	//|					ТОГДА ЛицевойСчет В
	//|								(ВЫБРАТЬ
	//|									ВТ_ОстаткиОбороты.АналитикаУчета КАК АналитикаУчета
	//|								ИЗ
	//|									ВТ_ОстаткиОбороты КАК ВТ_ОстаткиОбороты)
	//|							И СтепеньРодства = ЗНАЧЕНИЕ(справочник.бит_СтепениРодстваФизЛиц.бит_ответственноеЛицо)
	//|			КОНЕЦ) КАК бит_ПроживающиеПоЛССрезПоследних
	//|ГДЕ
	//|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &ДатаОкончанияБезВремени
	//|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	//|;
	//|
	//--bit Melnik 07.09.22
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиОбороты.АналитикаУчета КАК АналитикаУчета,
	|	ВТ_Ответ.ФизЛицо КАК Ответственный
	|ПОМЕСТИТЬ ВТ_ПустыеОтвет
	|ИЗ
	|	ВТ_ОстаткиОбороты КАК ВТ_ОстаткиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ответ КАК ВТ_Ответ
	|		ПО (ВЫБОР
	|				КОГДА &СпособДетализации = ""3""
	|					ТОГДА ВТ_ОстаткиОбороты.АналитикаУчета = ВТ_Ответ.ЛицевойСчет
	|			КОНЕЦ)
	|ГДЕ
	|	ВТ_Ответ.ФизЛицо ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ответ.ФизЛицо КАК Ответственный,
	|	ВТ_Ответ.ЛицевойСчет КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВТ_ОтветПолный
	|ИЗ
	|	ВТ_Ответ КАК ВТ_Ответ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&ТекДата,
	|			ВЫБОР
	|				КОГДА &СпособДетализации = ""3""
	|					ТОГДА ЛицевойСчет В
	|								(ВЫБРАТЬ
	|									ВТ_ПустыеОтвет.АналитикаУчета КАК АналитикаУчета
	|								ИЗ
	|									ВТ_ПустыеОтвет КАК ВТ_ПустыеОтвет)
	//++bit Melnik 07.09.22
	//|							И СтепеньРодства = ЗНАЧЕНИЕ(справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	//--bit Melnik 07.09.22
	|			КОНЕЦ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &ДатаОкончанияБезВремени
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	//++bit Melnik 07.09.22
	|	И ВЫБОР
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(справочник.бит_СтепениРодстваФизЛиц.бит_ответственноеЛицо)	
	|   КОНЕЦ
	//--bit Melnik 07.09.22
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиОбороты.НачалоНачислено КАК НачалоНачислено,
	|	ВТ_ОстаткиОбороты.НачалоОплачено КАК НачалоОплачено,
	|	ВТ_ОстаткиОбороты.ИтогоНачало КАК ИтогоНачало,
	|	ВТ_ОстаткиОбороты.АналитикаУчета КАК АналитикаУчета,
	|	ВТ_ОстаткиОбороты.Начисление КАК Начисление,
	|	ВТ_ОстаткиОбороты.Период КАК Период,
	|	ВТ_ОстаткиОбороты.НачисленоСИзменениями КАК НачисленоСИзменениями,
	|	ВТ_ОстаткиОбороты.Изменение КАК Изменение,
	|	ВТ_ОстаткиОбороты.НачисленоОборот КАК НачисленоОборот,
	|	ВТ_ОстаткиОбороты.Оплачено КАК Оплачено,
	|	ВТ_ОстаткиОбороты.КонецНачислено КАК КонецНачислено,
	|	ВТ_ОстаткиОбороты.КонецОплачено КАК КонецОплачено,
	|	ВТ_ОстаткиОбороты.ИтогоКонец КАК ИтогоКонец,
	|	ВТ_ОтветПолный.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_ОстаткиОбороты КАК ВТ_ОстаткиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветПолный КАК ВТ_ОтветПолный
	|		ПО (ВЫБОР
	|				КОГДА &СпособДетализации = ""3""
	|					ТОГДА ВТ_ОстаткиОбороты.АналитикаУчета = ВТ_ОтветПолный.ЛицевойСчет
	|			КОНЕЦ)";
	
	Если Не МассивАдресов.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ЛицевойСчет.Здание В (&Адреса)");	
		Запрос.УстановитьПараметр("Адреса", МассивАдресов);	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончанияБезВремени", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ТекДата", Новый Граница(КонецДня(НачалоДня(ТекущаяДата())-1), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начисления", МассивНачислений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СпособДетализации", СпособДетализации);
	Запрос.УстановитьПараметр("Участки", МассивУчастков);
	Запрос.УстановитьПараметр("ТипыКвартир", МассивТиповКвартир);
	Запрос.УстановитьПараметр("ДатаНачалаК", Новый Граница(КонецДня(НачалоДня(НачалоПериода)-1), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаИтоговойТаблицы = ТаблицаИтог.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, ВыборкаДетальныеЗаписи);
		//+bit_semenov.v_24.06.22
		Если СпособДетализации = "2" Тогда	
			НоваяСтрокаИтоговойТаблицы.КодФИАС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.АналитикаУчета, "КодФИАС");
			НоваяСтрокаИтоговойТаблицы.СтепеньБлагоустройстваЗданий = ПолучитьБлагоустройствоЗдания(ВыборкаДетальныеЗаписи.АналитикаУчета, Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
			//-bit_semenov.v_24.06.22
		ИначеЕсли СпособДетализации = "3" Тогда
			НоваяСтрокаИтоговойТаблицы.Здание = ВыборкаДетальныеЗаписи.АналитикаУчета.Здание;
			//+bit_semenov.v_14.04.2021
			Квартира = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.АналитикаУчета, "Квартира");
			НоваяСтрокаИтоговойТаблицы.Квартира = Квартира;
			НоваяСтрокаИтоговойТаблицы.Площадь = РегистрыСведений.бит_СведенияОКвартире.СрезПоследних(Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая), Новый Структура("Квартира", Квартира))[0].ОбщаяПлощадь;
			НоваяСтрокаИтоговойТаблицы.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
			//-bit_semenov.v_14.04.2021
		КонецЕсли; 
	КонецЦикла;
	
	Если ЕстьПени(МассивНачислений) Тогда
		
		ДополнитьТаблицуИтоговПенями(МассивУчастков, МассивТиповКвартир, МассивАдресов);
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуИтоговПенями(МассивУчастков, МассивТиповКвартир, МассивАдресов)
	
	МассивНачислений = Новый Массив;
	МассивНачислений.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000001"));
	МассивНачислений.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000003"));
	МассивНачислений.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000004"));
	МассивНачислений.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ
	|ПОМЕСТИТЬ ВТ_ЛС
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(, &ДатаОкончания, , УслугаЖКХ В (&Начисления)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХ.Регистратор.Дата, МЕСЯЦ) КАК Период,
	|	СУММА(бит_НачисленияПоУслугамЖКХ.СуммаПениРасход) КАК Оплачено,
	|	бит_НачисленияПоУслугамЖКХ.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ОборотОплаты
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачисленияПоУслугамЖКХ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	НЕ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХ.Регистратор.Дата, МЕСЯЦ),
	|	бит_НачисленияПоУслугамЖКХ.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий) КАК Адрес,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК Участок,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ) КАК Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаПениОборот КАК Сумма,
	|	0 КАК Изменение
	|ПОМЕСТИТЬ ВТ_ОборотНачисленияДоГруппировки
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий),
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга),
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ),
	|	0,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаПениОборот
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|	И НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотНачисленияДоГруппировки.Начисление КАК Начисление,
	|	ВТ_ОборотНачисленияДоГруппировки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ОборотНачисленияДоГруппировки.Адрес КАК Адрес,
	|	ВТ_ОборотНачисленияДоГруппировки.Участок КАК Участок,
	|	ВТ_ОборотНачисленияДоГруппировки.Период КАК Период,
	|	СУММА(ВТ_ОборотНачисленияДоГруппировки.Сумма) КАК Сумма,
	|	СУММА(ВТ_ОборотНачисленияДоГруппировки.Изменение) КАК Изменение
	|ПОМЕСТИТЬ ВТ_ОборотНачисления
	|ИЗ
	|	ВТ_ОборотНачисленияДоГруппировки КАК ВТ_ОборотНачисленияДоГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОборотНачисленияДоГруппировки.Начисление,
	|	ВТ_ОборотНачисленияДоГруппировки.ЛицевойСчет,
	|	ВТ_ОборотНачисленияДоГруппировки.Адрес,
	|	ВТ_ОборотНачисленияДоГруппировки.Участок,
	|	ВТ_ОборотНачисленияДоГруппировки.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Начисление,
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Начисление, ВТ_ОборотОплаты.Начисление) КАК Начисление,
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Период, ВТ_ОборотОплаты.Период) КАК Период,
	|	СУММА(ВТ_ОборотНачисления.Сумма - ЕСТЬNULL(ВТ_ОборотНачисления.Изменение, 0)) КАК НачисленоСИзменениями,
	|	СУММА(ЕСТЬNULL(ВТ_ОборотНачисления.Изменение, 0)) КАК Изменение,
	|	СУММА(ЕСТЬNULL(ВТ_ОборотНачисления.Сумма, 0)) КАК НачисленоОборот,
	|	СУММА(ЕСТЬNULL(ВТ_ОборотОплаты.Оплачено, 0)) КАК Оплачено,
	|	ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет, ВТ_ОборотОплаты.ЛицевойСчет) КАК ЛицевойСчет,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание, ВТ_ОборотОплаты.ЛицевойСчет.Здание) КАК Справочник.бит_СписокЗданий) КАК Адрес,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание.Район, ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район) КАК Справочник.бит_АдминистративныеОкруга) КАК Участок
	|ПОМЕСТИТЬ ВТ_Оборот
	|ИЗ
	|	ВТ_ОборотНачисления КАК ВТ_ОборотНачисления
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.Начисление КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
	|			НАЧАЛОПЕРИОДА(ВТ_ОборотОплаты.Регистратор.Дата, МЕСЯЦ) КАК Период,
	|			СУММА(ВТ_ОборотОплаты.Оплачено) КАК Оплачено,
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий) КАК Адрес,
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК Участок
	|		ИЗ
	|			ВТ_ОборотОплаты КАК ВТ_ОборотОплаты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.Начисление КАК Справочник.бит_УслугиЖКХ),
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
	|			НАЧАЛОПЕРИОДА(ВТ_ОборотОплаты.Регистратор.Дата, МЕСЯЦ),
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий),
	|			ВЫРАЗИТЬ(ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)) КАК ВТ_ОборотОплаты
	|		ПО ВТ_ОборотНачисления.Начисление = ВТ_ОборотОплаты.Начисление
	|			И ВТ_ОборотНачисления.ЛицевойСчет = ВТ_ОборотОплаты.ЛицевойСчет
	|			И ВТ_ОборотНачисления.Период = ВТ_ОборотОплаты.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Начисление, ВТ_ОборотОплаты.Начисление),
	|	ЕСТЬNULL(ВТ_ОборотНачисления.Период, ВТ_ОборотОплаты.Период),
	|	ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет, ВТ_ОборотОплаты.ЛицевойСчет),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание.Район, ВТ_ОборотОплаты.ЛицевойСчет.Здание.Район) КАК Справочник.бит_АдминистративныеОкруга),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОборотНачисления.ЛицевойСчет.Здание, ВТ_ОборотОплаты.ЛицевойСчет.Здание) КАК Справочник.бит_СписокЗданий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаУчета,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениПриход - бит_НачисленияПоУслугамЖКХОбороты.СуммаПениРасход) КАК ЗадолженностьНаНачало,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениПриход, 0) > 0
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениПриход, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПереплатыНаНачало,
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|	КОНЕЦ КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВТ_НачальныеОстатки
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			,
	|			&ДатаНачалаК,
	|			,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И 1 = 1) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаУчета,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениПриход - бит_НачисленияПоУслугамЖКХОбороты.СуммаПениРасход) КАК ЗадолженностьНаКонец,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениПриход, 0) > 0
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениРасход, 0) - ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаПениПриход, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПереплатыНаКонец
	|ПОМЕСТИТЬ ВТ_КонечныеОстатки
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			,
	|			&ДатаОкончания,
	|			,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И 1 = 1) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга)
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий)
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВТ_Оборот.Участок
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВТ_Оборот.Адрес
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВТ_Оборот.ЛицевойСчет
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаУчета,
	|	ВТ_Оборот.Начисление КАК Начисление,
	|	ЕСТЬNULL(ВТ_Оборот.Период, НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)) КАК Период,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.НачисленоСИзменениями, 0)) КАК НачисленоСИзменениями,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.Изменение, 0)) КАК Изменение,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.НачисленоОборот, 0)) КАК НачисленоОборот,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.Оплачено, 0)) КАК Оплачено
	|ПОМЕСТИТЬ ВТ_ВТ
	|ИЗ
	|	ВТ_Оборот КАК ВТ_Оборот
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &СпособДетализации = ""1""
	|			ТОГДА ВТ_Оборот.Участок
	|		КОГДА &СпособДетализации = ""2""
	|			ТОГДА ВТ_Оборот.Адрес
	|		КОГДА &СпособДетализации = ""3""
	|			ТОГДА ВТ_Оборот.ЛицевойСчет
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_Оборот.Период, НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)),
	|	ВТ_Оборот.Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_НачальныеОстатки.ЗадолженностьНаНачало, 0) КАК НачалоНачислено,
	|	ЕСТЬNULL(ВТ_НачальныеОстатки.ПереплатыНаНачало, 0) КАК НачалоОплачено,
	|	ЕСТЬNULL(ВТ_НачальныеОстатки.ЗадолженностьНаНачало - ВТ_НачальныеОстатки.ПереплатыНаНачало, 0) КАК ИтогоНачало,
	|	ЕСТЬNULL(ВТ_ВТ.АналитикаУчета, ВТ_НачальныеОстатки.АналитикаУчета) КАК АналитикаУчета,
	|	ЕСТЬNULL(ВТ_ВТ.Начисление, ВТ_НачальныеОстатки.УслугаЖКХ) КАК Начисление,
	|	ЕСТЬNULL(ВТ_ВТ.Период, НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)) КАК Период,
	|	ЕСТЬNULL(ВТ_ВТ.НачисленоСИзменениями, 0) КАК НачисленоСИзменениями,
	|	ЕСТЬNULL(ВТ_ВТ.Изменение, 0) КАК Изменение,
	|	ЕСТЬNULL(ВТ_ВТ.НачисленоОборот, 0) КАК НачисленоОборот,
	|	ЕСТЬNULL(ВТ_ВТ.Оплачено, 0) КАК Оплачено
	|ПОМЕСТИТЬ ВТ_НачОб
	|ИЗ
	|	ВТ_НачальныеОстатки КАК ВТ_НачальныеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВТ КАК ВТ_ВТ
	|		ПО ВТ_НачальныеОстатки.АналитикаУчета = ВТ_ВТ.АналитикаУчета
	|			И ВТ_НачальныеОстатки.УслугаЖКХ = ВТ_ВТ.Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачОб.НачалоНачислено КАК НачалоНачислено,
	|	ВТ_НачОб.НачалоОплачено КАК НачалоОплачено,
	|	ВТ_НачОб.ИтогоНачало КАК ИтогоНачало,
	|	ВТ_НачОб.АналитикаУчета КАК АналитикаУчета,
	|	&УслугаПени КАК Начисление,
	|	ВТ_НачОб.Период КАК Период,
	|	ВТ_НачОб.НачисленоСИзменениями КАК НачисленоСИзменениями,
	|	ВТ_НачОб.Изменение КАК Изменение,
	|	ВТ_НачОб.НачисленоОборот КАК НачисленоОборот,
	|	ВТ_НачОб.Оплачено КАК Оплачено,
	|	ЕСТЬNULL(ВТ_КонечныеОстатки.ЗадолженностьНаКонец, 0) КАК КонецНачислено,
	|	ЕСТЬNULL(ВТ_КонечныеОстатки.ПереплатыНаКонец, 0) КАК КонецОплачено,
	|	ЕСТЬNULL(ВТ_КонечныеОстатки.ЗадолженностьНаКонец - ВТ_КонечныеОстатки.ПереплатыНаКонец, 0) КАК ИтогоКонец
	|ПОМЕСТИТЬ ВТ_НачисленияИОбороты
	|ИЗ
	|	ВТ_НачОб КАК ВТ_НачОб
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонечныеОстатки КАК ВТ_КонечныеОстатки
	|		ПО ВТ_НачОб.АналитикаУчета = ВТ_КонечныеОстатки.АналитикаУчета
	|			И ВТ_НачОб.Начисление = ВТ_КонечныеОстатки.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВТ_Ответ
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&ДатаОкончания,
	|			СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|				И ВЫБОР
	|					КОГДА &СпособДетализации = ""3""
	|						ТОГДА ЛицевойСчет В
	|								(ВЫБРАТЬ
	|									ВТ_НачисленияИОбороты.АналитикаУчета КАК АналитикаУчета
	|								ИЗ
	|									ВТ_НачисленияИОбороты КАК ВТ_НачисленияИОбороты)
	|				КОНЕЦ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &ДатаОкончанияБезВремени
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачисленияИОбороты.АналитикаУчета КАК АналитикаУчета,
	|	ВТ_Ответ.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_ПустыеОтвет
	|ИЗ
	|	ВТ_НачисленияИОбороты КАК ВТ_НачисленияИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ответ КАК ВТ_Ответ
	|		ПО (ВЫБОР
	|				КОГДА &СпособДетализации = ""3""
	|					ТОГДА ВТ_НачисленияИОбороты.ИтогоНачало = ВТ_Ответ.ЛицевойСчет
	|			КОНЕЦ)
	|ГДЕ
	|	ВТ_Ответ.ФизЛицо ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ответ.ФизЛицо КАК Ответственный,
	|	ВТ_Ответ.ЛицевойСчет КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВТ_ОтветПолный
	|ИЗ
	|	ВТ_Ответ КАК ВТ_Ответ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&ТекДата,
	|			ВЫБОР
	|				КОГДА &СпособДетализации = ""3""
	|					ТОГДА ЛицевойСчет В
	|								(ВЫБРАТЬ
	|									ВТ_ПустыеОтвет.АналитикаУчета КАК АналитикаУчета
	|								ИЗ
	|									ВТ_ПустыеОтвет КАК ВТ_ПустыеОтвет)
	|							И СтепеньРодства = ЗНАЧЕНИЕ(справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|			КОНЕЦ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &ДатаОкончанияБезВремени
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачисленияИОбороты.НачалоНачислено КАК НачалоНачислено,
	|	ВТ_НачисленияИОбороты.НачалоОплачено КАК НачалоОплачено,
	|	ВТ_НачисленияИОбороты.ИтогоНачало КАК ИтогоНачало,
	|	ВТ_НачисленияИОбороты.АналитикаУчета КАК АналитикаУчета,
	|	ВТ_НачисленияИОбороты.Начисление КАК Начисление,
	|	ВТ_НачисленияИОбороты.Период КАК Период,
	|	ВТ_НачисленияИОбороты.НачисленоСИзменениями КАК НачисленоСИзменениями,
	|	ВТ_НачисленияИОбороты.Изменение КАК Изменение,
	|	ВТ_НачисленияИОбороты.НачисленоОборот КАК НачисленоОборот,
	|	ВТ_НачисленияИОбороты.Оплачено КАК Оплачено,
	|	ВТ_НачисленияИОбороты.КонецНачислено КАК КонецНачислено,
	|	ВТ_НачисленияИОбороты.КонецОплачено КАК КонецОплачено,
	|	ВТ_НачисленияИОбороты.ИтогоКонец КАК ИтогоКонец,
	|	ВТ_ОтветПолный.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_НачисленияИОбороты КАК ВТ_НачисленияИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветПолный КАК ВТ_ОтветПолный
	|		ПО (ВЫБОР
	|				КОГДА &СпособДетализации = ""3""
	|					ТОГДА ВТ_НачисленияИОбороты.АналитикаУчета = ВТ_ОтветПолный.ЛицевойСчет
	|			КОНЕЦ)";
	
	Если Не МассивАдресов.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ЛицевойСчет.Здание В (&Адреса)");	
		Запрос.УстановитьПараметр("Адреса", МассивАдресов);	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончанияБезВремени", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ТекДата", Новый Граница(КонецДня(НачалоДня(ТекущаяДата())-1), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начисления", МассивНачислений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СпособДетализации", СпособДетализации);
	Запрос.УстановитьПараметр("Участки", МассивУчастков);
	Запрос.УстановитьПараметр("ТипыКвартир", МассивТиповКвартир);
	Запрос.УстановитьПараметр("ДатаНачалаК", Новый Граница(КонецДня(НачалоДня(НачалоПериода)-1), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("УслугаПени", Справочники.бит_УслугиЖКХ.Пени);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаИтоговойТаблицы = ТаблицаИтог.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, ВыборкаДетальныеЗаписи);
		//+bit_semenov.v_24.06.22
		Если СпособДетализации = "2" Тогда	
			НоваяСтрокаИтоговойТаблицы.КодФИАС =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.АналитикаУчета, "КодФИАС"); 
			НоваяСтрокаИтоговойТаблицы.СтепеньБлагоустройстваЗданий = ПолучитьБлагоустройствоЗдания(ВыборкаДетальныеЗаписи.АналитикаУчета, Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
			//-bit_semenov.v_24.06.22
		ИначеЕсли СпособДетализации = "3" Тогда
			НоваяСтрокаИтоговойТаблицы.Здание = ВыборкаДетальныеЗаписи.АналитикаУчета.Здание;
			//+bit_semenov.v_14.04.2021
			Квартира = ВыборкаДетальныеЗаписи.АналитикаУчета.Квартира; 
			НоваяСтрокаИтоговойТаблицы.Квартира = Квартира;
			НоваяСтрокаИтоговойТаблицы.Площадь = РегистрыСведений.бит_СведенияОКвартире.СрезПоследних(Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая), Новый Структура("Квартира", Квартира));
			НоваяСтрокаИтоговойТаблицы.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
			//-bit_semenov.v_14.04.2021
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьПени(МассивНачислений)
	
	Если Не МассивНачислений.Найти(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000001")) = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли Не МассивНачислений.Найти(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000003")) = Неопределено Тогда	
		Возврат Истина;
	ИначеЕсли Не МассивНачислений.Найти(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000004")) = Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СформироватьФайлCSVНаКлиенте()
	
	ПредставлениеСпособаДетализации = ПолучитьПредставлениеСпособаДетализации();
	ПолноеИмяФайла = Каталог + "\" + Формат(ТекущаяДата(),"ДФ='dd-MM-yyyy HH.mm.ss'") + " " + ПредставлениеСпособаДетализации + ".csv";
	ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".csv";  
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ПолноеИмяФайла = Каталог + "\" + ИмяФайла + ".csv";	
	КонецЕсли; 
	
	Попытка
		
		Кодировка = КодировкаТекста.Системная;
		ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяВременногоФайла, Кодировка);
		
		//+bit_semenov.v_14.04.2021
		//СтрокаШапки = "Период;Услуга;АналитикаУчета;+;-;Знаковое;НачисленоСИзменениями;Изменение;НачисленоЗаПериод;ОплаченоЗаПериод;+;-;Знаковое";
		Если  СпособДетализации = "2" Тогда //По адресам
			СтрокаШапки = "Период;Услуга;АналитикаУчета;КодФИАС;СтепеньБлагоустройстваЗданий;+;-;Знаковое;НачисленоСИзменениями;Изменение;НачисленоЗаПериод;ОплаченоЗаПериод;+;-;Знаковое";
		ИначеЕсли СпособДетализации = "3" Тогда  //По ЛС
			СтрокаШапки = "Период;Услуга;АналитикаУчета;Адрес;Квартира;Площадь;Ответственный;+;-;Знаковое;НачисленоСИзменениями;Изменение;НачисленоЗаПериод;ОплаченоЗаПериод;+;-;Знаковое";
		Иначе
			СтрокаШапки = "Период;Услуга;АналитикаУчета;+;-;Знаковое;НачисленоСИзменениями;Изменение;НачисленоЗаПериод;ОплаченоЗаПериод;+;-;Знаковое";
		КонецЕсли;
		//-bit_semenov.v_14.04.2021
		
		ТекстовыйФайлЗапись.ЗаписатьСтроку(СтрокаШапки);
		
		Для каждого Строка Из ТаблицаИтог Цикл
			ТекстовыйДокумент = "";
			
			//+bit_semenov.v_24.06.2022
			Если СпособДетализации = "2" Тогда
				
				ТекстовыйДокумент = ТекстовыйДокумент + 
								Формат(Строка.Период, "ДЛФ=D") + Разделитель + 
								Строка.Начисление + Разделитель + 
								Строка.АналитикаУчета + Разделитель +
								Строка.КодФИАС + Разделитель +
								Строка.СтепеньБлагоустройстваЗданий + Разделитель +
								
								//Формат(Строка.НачалоНачислено, "ЧГ=0") + Разделитель +          // +
								//Формат(Строка.НачалоОплачено, "ЧГ=0") + Разделитель +           // -
								//Формат(Строка.ИтогоНачало, "ЧГ=0") + Разделитель +              // знаковое
								
								Формат(Строка.НачалоНачислено + Строка.НачалоОплачено, "ЧГ=0") + Разделитель +          // +
								Формат(Строка.НачалоОплачено, "ЧГ=0") + Разделитель +           // -
								Формат(Строка.НачалоНачислено, "ЧГ=0") + Разделитель +              // знаковое
								
								Формат(Строка.НачисленоСИзменениями, "ЧГ=0") + Разделитель +
								Формат(Строка.Изменение, "ЧГ=0") + Разделитель +
								Формат(Строка.НачисленоОборот, "ЧГ=0") + Разделитель +
								Формат(Строка.Оплачено, "ЧГ=0") + Разделитель +
								
								//Формат(Строка.КонецНачислено, "ЧГ=0") + Разделитель +           // +
								//Формат(Строка.КонецОплачено, "ЧГ=0") + Разделитель +            // -
								//Формат(Строка.ИтогоКонец, "ЧГ=0") + Разделитель;			    // знаковое
								
								Формат(Строка.КонецНачислено + Строка.КонецОплачено, "ЧГ=0") + Разделитель +           // +
								Формат(Строка.КонецОплачено, "ЧГ=0") + Разделитель +            // -
								Формат(Строка.КонецНачислено, "ЧГ=0") + Разделитель;			    // знаковое

			ИначеЕсли СпособДетализации = "3" Тогда
				
				//Адрес = Строка.Здание + " , " + Строка.Квартира;
				
				ТекстовыйДокумент = ТекстовыйДокумент + 
								Формат(Строка.Период, "ДЛФ=D") + Разделитель + 
								Строка.Начисление + Разделитель + 
								Строка.АналитикаУчета + Разделитель +
								
								Строка.Здание + Разделитель +
								Строка.Квартира + Разделитель +
								Строка.Площадь + Разделитель +
								Строка.Ответственный + Разделитель +
								
								//Формат(Строка.НачалоНачислено, "ЧГ=0") + Разделитель +          // +
								//Формат(Строка.НачалоОплачено, "ЧГ=0") + Разделитель +           // -
								//Формат(Строка.ИтогоНачало, "ЧГ=0") + Разделитель +              // знаковое
								
								Формат(Строка.НачалоНачислено + Строка.НачалоОплачено, "ЧГ=0") + Разделитель +          // +
								Формат(Строка.НачалоОплачено, "ЧГ=0") + Разделитель +           // -
								Формат(Строка.НачалоНачислено, "ЧГ=0") + Разделитель +              // знаковое
								
								Формат(Строка.НачисленоСИзменениями, "ЧГ=0") + Разделитель +
								Формат(Строка.Изменение, "ЧГ=0") + Разделитель +
								Формат(Строка.НачисленоОборот, "ЧГ=0") + Разделитель +
								Формат(Строка.Оплачено, "ЧГ=0") + Разделитель +
								
								//Формат(Строка.КонецНачислено, "ЧГ=0") + Разделитель +           // +
								//Формат(Строка.КонецОплачено, "ЧГ=0") + Разделитель +            // -
								//Формат(Строка.ИтогоКонец, "ЧГ=0") + Разделитель;			    // знаковое
								
								Формат(Строка.КонецНачислено + Строка.КонецОплачено, "ЧГ=0") + Разделитель +           // +
								Формат(Строка.КонецОплачено, "ЧГ=0") + Разделитель +            // -
								Формат(Строка.КонецНачислено, "ЧГ=0") + Разделитель;			    // знаковое
			//-bit_semenov.v_24.06.2022
			Иначе	
				
				ТекстовыйДокумент = ТекстовыйДокумент + 
								Формат(Строка.Период, "ДЛФ=D") + Разделитель + 
								Строка.Начисление + Разделитель + 
								Строка.АналитикаУчета + Разделитель +
								
								//Формат(Строка.НачалоНачислено, "ЧГ=0") + Разделитель +          // +
								//Формат(Строка.НачалоОплачено, "ЧГ=0") + Разделитель +           // -
								//Формат(Строка.ИтогоНачало, "ЧГ=0") + Разделитель +              // знаковое
								
								Формат(Строка.НачалоНачислено + Строка.НачалоОплачено, "ЧГ=0") + Разделитель +          // +
								Формат(Строка.НачалоОплачено, "ЧГ=0") + Разделитель +           // -
								Формат(Строка.НачалоНачислено, "ЧГ=0") + Разделитель +              // знаковое
								
								Формат(Строка.НачисленоСИзменениями, "ЧГ=0") + Разделитель +
								Формат(Строка.Изменение, "ЧГ=0") + Разделитель +
								Формат(Строка.НачисленоОборот, "ЧГ=0") + Разделитель +
								Формат(Строка.Оплачено, "ЧГ=0") + Разделитель +
								
								//Формат(Строка.КонецНачислено, "ЧГ=0") + Разделитель +           // +
								//Формат(Строка.КонецОплачено, "ЧГ=0") + Разделитель +            // -
								//Формат(Строка.ИтогоКонец, "ЧГ=0") + Разделитель;			    // знаковое
								
								Формат(Строка.КонецНачислено + Строка.КонецОплачено, "ЧГ=0") + Разделитель +           // +
								Формат(Строка.КонецОплачено, "ЧГ=0") + Разделитель +            // -
								Формат(Строка.КонецНачислено, "ЧГ=0") + Разделитель;			    // знаковое
				
			КонецЕсли;
			ТекстовыйФайлЗапись.ЗаписатьСтроку(ТекстовыйДокумент);
		КонецЦикла;
		
		ТекстовыйФайлЗапись.Закрыть();
		АдресНаСервере = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
		
		ПолучитьФайл(АдресНаСервере, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеСпособаДетализации()
	
	Если СпособДетализации = "1" Тогда
		Возврат "по участкам";	
	ИначеЕсли СпособДетализации = "2" Тогда 
		Возврат "по адресам";	
	Иначе	
		Возврат "по лицевым счетам";	
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ПолучитьМассивНачислений()
	
	МассивНачислений = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Начисления.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивНачислений = Начисления.Выгрузить(,"Начисление").ВыгрузитьКолонку("Начисление");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивНачислений.Добавить(НайденнаяСтрока.Начисление);	
		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат МассивНачислений;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивУчастков()
	
	МассивУчастков = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Участки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивУчастков = Участки.Выгрузить(,"Участок").ВыгрузитьКолонку("Участок");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивУчастков.Добавить(НайденнаяСтрока.Участок);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивУчастков;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивАдресов()
	
	МассивАдресов = Новый Массив;
	
	МассивАдресов = Адреса.Выгрузить(,"Адрес").ВыгрузитьКолонку("Адрес");
	
	Возврат МассивАдресов;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивТиповКвартир()
	
	МассивТиповКвартир = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = ТипыКвартир.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивТиповКвартир = ТипыКвартир.Выгрузить(,"ТипКвартиры").ВыгрузитьКолонку("ТипКвартиры");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивТиповКвартир.Добавить(НайденнаяСтрока.ТипКвартиры);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивТиповКвартир;
	
КонецФункции

&НаСервере
Функция ПолучитьБлагоустройствоЗдания(Ссылка, Период)
	
	БлагоустройствоЗдания = "";
	
	Запрос = новый запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС.Значение КАК Значение,
		|	бит_СвойстваОбъектовУчета.Ссылка КАК ВидСвойства
		|ИЗ
		|	ПланВидовХарактеристик.бит_СвойстваОбъектовУчета КАК бит_СвойстваОбъектовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияСвойствОбъектовУчетаПериодические.СрезПоследних(
		|				&Период,
		|				ОбъектУчета = &Ссылка
		|					И ВидСвойства = &ВидСвойства) КАК РС
		|		ПО (РС.ВидСвойства = бит_СвойстваОбъектовУчета.Ссылка)
		|ГДЕ
		|	бит_СвойстваОбъектовУчета.Ссылка = &ВидСвойства";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидСвойства", ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.НайтиПоНаименованию("Степень благоустройства"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
	   Выборка.Следующий();
	   БлагоустройствоЗдания = Выборка.Значение;
	КонецЕсли;
	
	Возврат БлагоустройствоЗдания
	
КонецФункции 

// Старый запрос

//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
//|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХ.Регистратор.Дата, МЕСЯЦ) КАК Период,
//|	СУММА(бит_НачисленияПоУслугамЖКХ.СуммаРасход) КАК Оплачено
//|ПОМЕСТИТЬ ВТ_ОборотОплаты
//|ИЗ
//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
//|			&ДатаНачала,
//|			&ДатаОкончания,
//|			Регистратор,
//|			Организация = &Организация
//|				И УслугаЖКХ В (&Начисления)
//|				И 1 = 1
//|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХ
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_НачисленияПоУслугамЖКХ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|ГДЕ
//|	НЕ(бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
//|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
//|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндексаОбщедомовыхЗатрат
//|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
//|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//|				ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам)
//|
//|СГРУППИРОВАТЬ ПО
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
//|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХ.Регистратор.Дата, МЕСЯЦ)
//|
//|ИНДЕКСИРОВАТЬ ПО
//|	Начисление,
//|	ЛицевойСчет
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий) КАК Адрес,
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК Участок,
//|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ) КАК Период,
//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот КАК Сумма,
//|	0 КАК Изменение
//|ПОМЕСТИТЬ ВТ_ОборотНачисленияДоГруппировки
//|ИЗ
//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
//|			&ДатаНачала,
//|			&ДатаОкончания,
//|			Регистратор,
//|			Организация = &Организация
//|				И УслугаЖКХ В (&Начисления)
//|				И 1 = 1
//|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|
//|ОБЪЕДИНИТЬ
//|
//|ВЫБРАТЬ
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий),
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга),
//|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ),
//|	0,
//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//|ИЗ
//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
//|			&ДатаНачала,
//|			&ДатаОкончания,
//|			Регистратор,
//|			Организация = &Организация
//|				И УслугаЖКХ В (&Начисления)
//|				И 1 = 1
//|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|ГДЕ
//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ВТ_ОборотНачисленияДоГруппировки.Начисление КАК Начисление,
//|	ВТ_ОборотНачисленияДоГруппировки.ЛицевойСчет КАК ЛицевойСчет,
//|	ВТ_ОборотНачисленияДоГруппировки.Адрес КАК Адрес,
//|	ВТ_ОборотНачисленияДоГруппировки.Участок КАК Участок,
//|	ВТ_ОборотНачисленияДоГруппировки.Период КАК Период,
//|	СУММА(ВТ_ОборотНачисленияДоГруппировки.Сумма) КАК Сумма,
//|	СУММА(ВТ_ОборотНачисленияДоГруппировки.Изменение) КАК Изменение
//|ПОМЕСТИТЬ ВТ_ОборотНачисления
//|ИЗ
//|	ВТ_ОборотНачисленияДоГруппировки КАК ВТ_ОборотНачисленияДоГруппировки
//|
//|СГРУППИРОВАТЬ ПО
//|	ВТ_ОборотНачисленияДоГруппировки.Начисление,
//|	ВТ_ОборотНачисленияДоГруппировки.ЛицевойСчет,
//|	ВТ_ОборотНачисленияДоГруппировки.Адрес,
//|	ВТ_ОборотНачисленияДоГруппировки.Участок,
//|	ВТ_ОборотНачисленияДоГруппировки.Период
//|
//|ИНДЕКСИРОВАТЬ ПО
//|	Начисление,
//|	ЛицевойСчет
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
//|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.СуммаНачальныйОстаток КАК НачалоНачислено,
//|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.СуммаКонечныйОстаток КАК КонецНачислено
//|ПОМЕСТИТЬ ВТ_ОстатокНачисления
//|ИЗ
//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.ОстаткиИОбороты(
//|			&ДатаНачала,
//|			&ДатаОкончания,
//|			,
//|			,
//|			Организация = &Организация
//|				И УслугаЖКХ В (&Начисления)
//|				И ЛицевойСчет В
//|					(ВЫБРАТЬ
//|						ВТ_ОборотНачисления.ЛицевойСчет КАК ЛицевойСчет
//|					ИЗ
//|						ВТ_ОборотНачисления КАК ВТ_ОборотНачисления)
//|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|
//|ИНДЕКСИРОВАТЬ ПО
//|	Начисление,
//|	ЛицевойСчет
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
//|	СУММА(ЕСТЬNULL(-бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)) КАК НачалоОплачено
//|ПОМЕСТИТЬ ВТ_НачалоОстатокОплаты
//|ИЗ
//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
//|			,
//|			&ДатаНачала,
//|			Регистратор,
//|			Организация = &Организация
//|				И УслугаЖКХ В (&Начисления)
//|				И ЛицевойСчет В
//|					(ВЫБРАТЬ
//|						ВТ_ОборотНачисления.ЛицевойСчет КАК ЛицевойСчет
//|					ИЗ
//|						ВТ_ОборотНачисления КАК ВТ_ОборотНачисления)
//|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХОбороты
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|ГДЕ
//|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
//|
//|СГРУППИРОВАТЬ ПО
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
//|
//|ИНДЕКСИРОВАТЬ ПО
//|	Начисление,
//|	ЛицевойСчет
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
//|	СУММА(ЕСТЬNULL(-бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)) КАК КонецОплачено
//|ПОМЕСТИТЬ ВТ_КонецОстатокОплаты
//|ИЗ
//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
//|			,
//|			&ДатаОкончания,
//|			Регистратор,
//|			Организация = &Организация
//|				И УслугаЖКХ В (&Начисления)
//|				И ЛицевойСчет В
//|					(ВЫБРАТЬ
//|						ВТ_ОборотНачисления.ЛицевойСчет КАК ЛицевойСчет
//|					ИЗ
//|						ВТ_ОборотНачисления КАК ВТ_ОборотНачисления)
//|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХОбороты
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|ГДЕ
//|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
//|
//|СГРУППИРОВАТЬ ПО
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета)
//|
//|ИНДЕКСИРОВАТЬ ПО
//|	Начисление,
//|	ЛицевойСчет
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	СУММА(ВТ_ОстатокНачисления.НачалоНачислено) КАК НачалоНачислено,
//|	СУММА(ВТ_НачалоОстатокОплаты.НачалоОплачено) КАК НачалоОплачено,
//|	СУММА(ЕСТЬNULL(ВТ_ОстатокНачисления.НачалоНачислено, 0) - ЕСТЬNULL(ВТ_НачалоОстатокОплаты.НачалоОплачено, 0)) КАК ИтогоНачало,
//|	ВТ_ОборотНачисления.Начисление КАК Начисление,
//|	ВЫБОР
//|		КОГДА &СпособДетализации = ""1""
//|			ТОГДА ВТ_ОборотНачисления.Участок
//|		КОГДА &СпособДетализации = ""2""
//|			ТОГДА ВТ_ОборотНачисления.Адрес
//|		КОГДА &СпособДетализации = ""3""
//|			ТОГДА ВТ_ОборотНачисления.ЛицевойСчет
//|		ИНАЧЕ """"
//|	КОНЕЦ КАК АналитикаУчета,
//|	ВТ_ОборотНачисления.Период КАК Период,
//|	СУММА(ВТ_ОборотНачисления.Сумма - ЕСТЬNULL(ВТ_ОборотНачисления.Изменение, 0)) КАК НачисленоСИзменениями,
//|	СУММА(ВТ_ОборотНачисления.Изменение) КАК Изменение,
//|	СУММА(ВТ_ОборотНачисления.Сумма) КАК НачисленоОборот,
//|	СУММА(ВТ_ОборотОплаты.Оплачено) КАК Оплачено,
//|	СУММА(ВТ_ОстатокНачисления.КонецНачислено) КАК КонецНачислено,
//|	СУММА(ВТ_КонецОстатокОплаты.КонецОплачено) КАК КонецОплачено,
//|	СУММА(ЕСТЬNULL(ВТ_ОстатокНачисления.КонецНачислено, 0) - ЕСТЬNULL(ВТ_КонецОстатокОплаты.КонецОплачено, 0)) КАК ИтогоКонец
//|ИЗ
//|	ВТ_ОборотНачисления КАК ВТ_ОборотНачисления
//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотОплаты КАК ВТ_ОборотОплаты
//|		ПО ВТ_ОборотНачисления.Начисление = ВТ_ОборотОплаты.Начисление
//|			И ВТ_ОборотНачисления.ЛицевойСчет = ВТ_ОборотОплаты.ЛицевойСчет
//|			И ВТ_ОборотНачисления.Период = ВТ_ОборотОплаты.Период
//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстатокНачисления КАК ВТ_ОстатокНачисления
//|		ПО ВТ_ОборотНачисления.Начисление = ВТ_ОстатокНачисления.Начисление
//|			И ВТ_ОборотНачисления.ЛицевойСчет = ВТ_ОстатокНачисления.ЛицевойСчет
//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачалоОстатокОплаты КАК ВТ_НачалоОстатокОплаты
//|		ПО ВТ_ОборотНачисления.Начисление = ВТ_НачалоОстатокОплаты.Начисление
//|			И ВТ_ОборотНачисления.ЛицевойСчет = ВТ_НачалоОстатокОплаты.ЛицевойСчет
//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонецОстатокОплаты КАК ВТ_КонецОстатокОплаты
//|		ПО ВТ_ОборотНачисления.Начисление = ВТ_КонецОстатокОплаты.Начисление
//|			И ВТ_ОборотНачисления.ЛицевойСчет = ВТ_КонецОстатокОплаты.ЛицевойСчет
//|
//|СГРУППИРОВАТЬ ПО
//|	ВТ_ОборотНачисления.Начисление,
//|	ВТ_ОборотНачисления.Период,
//|	ВЫБОР
//|		КОГДА &СпособДетализации = ""1""
//|			ТОГДА ВТ_ОборотНачисления.Участок
//|		КОГДА &СпособДетализации = ""2""
//|			ТОГДА ВТ_ОборотНачисления.Адрес
//|		КОГДА &СпособДетализации = ""3""
//|			ТОГДА ВТ_ОборотНачисления.ЛицевойСчет
//|		ИНАЧЕ """"
//|	КОНЕЦ
//|
//|УПОРЯДОЧИТЬ ПО
//|	АналитикаУчета";