
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ") Тогда
				
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ.СписокУслугОтбора;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаУстановкаРаспределения") Тогда
				
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаУстановкаРаспределения.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
