
#Область ДействияКомандФормы

&НаКлиенте
Процедура ДействияФормыСформировать(Команда)
	
	ДействияФормыСформироватьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ДействияФормыСформироватьНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
	ОтчетОбъект.ОтчетВывести(ТабДок, Период, Услуга, Отбор, Здание);		
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПочтовыйРеестр(Команда)
	ОфисныеДокументы = СформироватьПочтовыйРеестрНаСервере(); 
	Для Каждого Стр Из ОфисныеДокументы Цикл              
		ВременныйПуть = КаталогВременныхФайлов();
		ИмяДокумента = ВременныйПуть + "РеестрИсполнительныхЛистов" + Формат(ТекущаяДата(),"ДФ=dd_MM_yyyy") + ".docx";
		
		Данные = ПолучитьИзВременногоХранилища(Стр.Ключ);   
		Данные.Записать(ИмяДокумента);
		Word = Новый COMОбъект("Word.Application"); 
		Документ =Word.Documents.ADD(ИмяДокумента);    
		//ДатаКон = ТекущаяДата() + 2;
		//Пока ТекущаяДата() < ДатаКон Цикл
		//	
		//КонецЦикла;	
		КоличетсвоЛистов = Документ.BuiltInDocumentProperties(14).Value;
		Замена = Документ.Content.Find;  
		Замена.Execute("[КоличествоЛистов]",,,,,,,,, КоличетсвоЛистов,2);       
		//Замена.Execute("[КоличествоЛистов]",,,,,,,,, КоличетсвоЛистов,2); 
		Word.ActiveWindow.View.ShowFieldCodes = False;
		Word.Visible = Истина;		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СформироватьПочтовыйРеестрНаСервере()
	МакетДокумента =УправлениеПечатью.МакетПечатнойФормы("Отчет.бит_СозданныеИсковыеИСудебныеПриказы.ПФ_DOC_МакетРеестра");;
	ОфисныеДокументы = Новый Соответствие;
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);     
	
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",         		   "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицы",         "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",         		   "Общая");

	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
	
	ТЧ = ПолучитьТЧ();
	
	ДанныеПоШапке = Новый Структура("Год,КоличествоСтрок,Листов","","","");
	ДанныеПоШапке.Вставить("Год", Год(ТекущаяДата()));
	ДанныеПоШапке.Вставить("КоличествоСтрок", ТЧ.Количество()); 
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеПоШапке);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["СтрокаТаблицы"]);
	УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ТЧ);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Подвал"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеПоШапке);
	
	АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	ОфисныеДокументы.Вставить(АдресХранилищаПечатнойФормы,"Реестр");
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	
	Возврат ОфисныеДокументы;
КонецФункции 

Функция ПолучитьТЧ() 
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");  
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Ном");
	Таблица.Колонки.Добавить("АдресДолжника");
	Таблица.Колонки.Добавить("ФИОДолжника");
	
	ОтчетОбъект.ОтчетВывестиВТЗ(Таблица, Период, Услуга, Отбор, Здание);		
	МассивТЧ = Новый Массив();
	Для Каждого Стр Из Таблица Цикл       
		ИндексАдреса = СтрНАйти(Стр.АдресДолжника,"=");      
		Если ИндексАдреса<> 0 Тогда
			Адрес = СтрЗаменить(Стр.АдресДолжника, Сред(Стр.АдресДолжника,ИндексАдреса), "");     
		Иначе
			Адрес = Стр.АдресДолжника;
		КонецЕсли;
		МассивТЧ.Добавить(Новый Структура("Ном,АдресДолжника,ФИОДолжника",Стр.Ном,Адрес,Стр.ФИОДолжника));
	КонецЦикла;
	
	Возврат МассивТЧ;
КонецФункции

#КонецОбласти