Функция СобратьДанныеЧеков(ДокументСсылка, НомерСекции = 0, ВерсияФормата, АдресУстановкиККТ, ПараметрыОбработчика = Неопределено, СообщениеОбОшибке = "") Экспорт
	
	МассивЧеков = Новый Массив;
	
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	
	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ДокументСсылка, ПараметрыОбработчика, СообщениеОбОшибке);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат МассивЧеков;
	КонецЕсли; 
	
	РеквизитыПечатиЧека = ПараметрыПечатиЧека.РеквизитыПечатиЧека;
	Если РеквизитыПечатиЧека.Количество() = 0 Тогда
		Возврат МассивЧеков;
	КонецЕсли;
	
	Для Каждого РеквизитПечатиЧека ИЗ РеквизитыПечатиЧека Цикл
		
		Реквизиты = НовыйРеквизитыПечатиЧека();
		
		ЗаполнитьЗначенияСвойств(Реквизиты, РеквизитПечатиЧека);
		
		ПрименяетсяУСНПатент                    = УчетнаяПолитика.ПрименяетсяУСНПатент(Реквизиты.Организация, Реквизиты.Дата);
		ПрименяетсяЕНВД                         = УчетнаяПолитика.ПлательщикЕНВД(Реквизиты.Организация, Реквизиты.Дата);
		ПрименяетсяОсобыйПорядокНалогообложения = УчетнаяПолитика.ПрименяетсяОсобыйПорядокНалогообложения(Реквизиты.Организация, Реквизиты.Дата);
		
		ПрименяетсяТолькоПатент                 = ПрименяетсяОсобыйПорядокНалогообложения И ПрименяетсяУСНПатент;
		ПрименяетсяТолькоЕНВД                   = ПрименяетсяОсобыйПорядокНалогообложения И ПрименяетсяЕНВД;
		
		Если ПрименяетсяТолькоПатент ИЛИ ЗначениеЗаполнено(Реквизиты.Патент) Тогда
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.Патент;
		ИначеЕсли ПрименяетсяТолькоЕНВД Тогда 
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
		ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
		ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
		Иначе
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
		КонецЕсли;
		
		Реквизиты.Вставить("НалоговыйРежим", НалоговыйРежим);
		Реквизиты.Вставить("НомерСекции",    НомерСекции);
		
		Если ПараметрыОбработчика.Свойство("ТипОбъекта") Тогда
			Если ПараметрыОбработчика.ТипОбъекта = "ОбщийМодуль" Тогда
				МодульОбработчика = ОбщегоНазначения.ОбщийМодуль(ПараметрыОбработчика.ИмяОбъекта);
			Иначе // документ
				МодульОбработчика = Документы[ПараметрыОбработчика.ИмяОбъекта];
			КонецЕсли;
		Иначе // документ по ссылке
			МодульОбработчика = Документы[ДокументСсылка.Метаданные().Имя];
		КонецЕсли;
		
		Реквизиты.Вставить("НаименованиеВСтрокеЧека", МодульОбработчика.НаименованиеВСтрокеЧека(Реквизиты));
		
		ПараметрыОперацииФискализацииЧека = ПараметрыОперацииФискализацииЧека(Реквизиты, ПараметрыПечатиЧека, ВерсияФормата, АдресУстановкиККТ);
		
		МассивЧеков.Добавить(ПараметрыОперацииФискализацииЧека);
		
	КонецЦикла;
	
	// БИТ ЖКХ 03.02.2021
	Для каждого Чек из МассивЧеков Цикл
		Для каждого Стр из Чек.ПозицииЧека цикл
		
			Стр.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Стр.Сумма, Истина, 
					УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Стр.СтавкаНДС));
			// БИТ ЖКХ 05.02.2021		
			если Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.Аванс тогда
				Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
				// БИТ ЖКХ 09.02.2021
				если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчетаАванс") тогда
				 Стр.ПризнакСпособаРасчетаАванс = перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
				конецесли; 
			иначе	
				// БИТ ЖКХ 08.02.2021		
			//	если Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ОплатаКредита тогда
					Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
				 // БИТ ЖКХ 10.02.2021
			     Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр, "ПризнакСпособаРасчетаОплатаКредита") тогда
					Стр.ПризнакСпособаРасчетаОплатаКредита = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;					
				 конецесли;	
			//	конецесли;

			конецесли;			
						
		КонецЦикла;				
	КонецЦикла;	
	
	Возврат МассивЧеков;
	
КонецФункции

Функция СобратьДанныеЧековСАвансом(ДокументСсылка, НомерСекции = 0, ВерсияФормата, АдресУстановкиККТ, ПараметрыОбработчика = Неопределено, СообщениеОбОшибке = "") Экспорт
	
	МассивЧеков = Новый Массив;
	
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	
	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧекаСАвансом(ДокументСсылка, ПараметрыОбработчика, СообщениеОбОшибке);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат МассивЧеков;
	КонецЕсли; 
	
	РеквизитыПечатиЧека = ПараметрыПечатиЧека.РеквизитыПечатиЧека;
	Если РеквизитыПечатиЧека.Количество() = 0 Тогда
		Возврат МассивЧеков;
	КонецЕсли;
	
	Для Каждого РеквизитПечатиЧека ИЗ РеквизитыПечатиЧека Цикл
		
		Реквизиты = НовыйРеквизитыПечатиЧека();
		
		ЗаполнитьЗначенияСвойств(Реквизиты, РеквизитПечатиЧека);
		
		ПрименяетсяУСНПатент                    = УчетнаяПолитика.ПрименяетсяУСНПатент(Реквизиты.Организация, Реквизиты.Дата);
		ПрименяетсяЕНВД                         = УчетнаяПолитика.ПлательщикЕНВД(Реквизиты.Организация, Реквизиты.Дата);
		ПрименяетсяОсобыйПорядокНалогообложения = УчетнаяПолитика.ПрименяетсяОсобыйПорядокНалогообложения(Реквизиты.Организация, Реквизиты.Дата);
		
		ПрименяетсяТолькоПатент                 = ПрименяетсяОсобыйПорядокНалогообложения И ПрименяетсяУСНПатент;
		ПрименяетсяТолькоЕНВД                   = ПрименяетсяОсобыйПорядокНалогообложения И ПрименяетсяЕНВД;
		
		Если ПрименяетсяТолькоПатент ИЛИ ЗначениеЗаполнено(Реквизиты.Патент) Тогда
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.Патент;
		ИначеЕсли ПрименяетсяТолькоЕНВД Тогда 
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
		ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
		ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
		Иначе
			НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
		КонецЕсли;
		
		Реквизиты.Вставить("НалоговыйРежим", НалоговыйРежим);
		Реквизиты.Вставить("НомерСекции",    НомерСекции);
		
		Если ПараметрыОбработчика.Свойство("ТипОбъекта") Тогда
			Если ПараметрыОбработчика.ТипОбъекта = "ОбщийМодуль" Тогда
				МодульОбработчика = ОбщегоНазначения.ОбщийМодуль(ПараметрыОбработчика.ИмяОбъекта);
			Иначе // документ
				МодульОбработчика = Документы[ПараметрыОбработчика.ИмяОбъекта];
			КонецЕсли;
		Иначе // документ по ссылке
			МодульОбработчика = Документы[ДокументСсылка.Метаданные().Имя];
		КонецЕсли;
		
		Реквизиты.Вставить("НаименованиеВСтрокеЧека", МодульОбработчика.НаименованиеВСтрокеЧека(Реквизиты));
		
		ПараметрыОперацииФискализацииЧека = ПараметрыОперацииФискализацииЧека(Реквизиты, ПараметрыПечатиЧека, ВерсияФормата, АдресУстановкиККТ);
		
		МассивЧеков.Добавить(ПараметрыОперацииФискализацииЧека);
		
	КонецЦикла;
	
	// БИТ ЖКХ 20.02.2021 
	Для каждого Чек из МассивЧеков Цикл
		Для каждого Стр из Чек.ПозицииЧека цикл			
			если стр.СтавкаНДС = неопределено И 
				  стр.СуммаНДС <> 0 тогда
				  
			 НомеклатураНДС = стр.Наименование;	  			 
			 для каждого стрНДС из Чек.ПозицииЧека цикл
				 если стрНДС.Наименование = НомеклатураНДС И
					   стрНДС.СтавкаНДС <> неопределено тогда
					стр.СтавкаНДС = стрНДС.СтавкаНДС;   
				 конецесли;	   
			 конеццикла;			 
			конецесли;			          						
		КонецЦикла;				
	КонецЦикла;	

	// БИТ ЖКХ 03.02.2021
    Для каждого Чек из МассивЧеков Цикл
		Для каждого Стр из Чек.ПозицииЧека цикл
		
			Стр.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Стр.Сумма, Истина, 
					УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Стр.СтавкаНДС));
			// БИТ ЖКХ 05.02.2021		
			если Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.Аванс тогда
				Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
				// БИТ ЖКХ 09.02.2021
				если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчетаАванс") тогда
				 Стр.ПризнакСпособаРасчетаАванс = перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
				конецесли; 
			иначе	
				// БИТ ЖКХ 08.02.2021		
				если Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ОплатаКредита тогда
					Стр.ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
				 // БИТ ЖКХ 10.02.2021
			     Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр, "ПризнакСпособаРасчетаОплатаКредита") тогда
					Стр.ПризнакСпособаРасчетаОплатаКредита = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;					
				 конецесли;	
				конецесли;

			конецесли;			
						
		КонецЦикла;				
	КонецЦикла;	
	
	Возврат МассивЧеков;
	
КонецФункции


Функция ПодготовитьПараметрыПечатиЧекаСАвансом(ДокументСсылка, ПараметрыОбработчика, СообщениеОбОшибке)
	
	Перем ТаблицаРезультата;
	
	ИменаТаблиц = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",                 ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	Запрос.УстановитьПараметр("ДатаОчереди", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаРасчета", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата"));
	
	Если ПараметрыОбработчика.Свойство("ТипОбъекта") Тогда
		Если ПараметрыОбработчика.ТипОбъекта = "ОбщийМодуль" Тогда
			МодульОбработчика = ОбщегоНазначения.ОбщийМодуль(ПараметрыОбработчика.ИмяОбъекта);
		Иначе // документ
			МодульОбработчика = Документы[ПараметрыОбработчика.ИмяОбъекта];
		КонецЕсли;
	Иначе // документ по ссылке
		МодульОбработчика = Документы[ДокументСсылка.Метаданные().Имя];
	КонецЕсли;
	
	СообщениеОбОшибке = "";
	
	Запрос.Текст = ТекстЗапросаПараметрыПечатиЧекаСАвансом(ДокументСсылка, ИменаТаблиц, СообщениеОбОшибке);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыПечатиЧека = Новый Структура;
	Для Индекс = 0 По ИменаТаблиц.Количество()-1 Цикл
		ИмяТаблицы = ИменаТаблиц[Индекс];
		
		Если ПараметрыПечатиЧека.Свойство(ИмяТаблицы, ТаблицаРезультата) Тогда
			// Документ может содержать товарные части как счета так и реализации
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[Индекс].Выгрузить(), ТаблицаРезультата);
		Иначе
			ТаблицаРезультата = Результат[Индекс].Выгрузить();
		КонецЕсли; 
		ПараметрыПечатиЧека.Вставить(ИмяТаблицы, ТаблицаРезультата);
	КонецЦикла; 
	                                                 
	// БИТ ЖКХ 08.02.2021
	попытка
	 если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыПечатиЧека, "ОплачиваемаяНоменклатура") И 
		  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка.ДокументОснование, "бит_ДокументОснование") И 
		    ЗначениеЗаполнено(ДокументСсылка.ДокументОснование.бит_ДокументОснование) тогда
			   если ПараметрыПечатиЧека.ОплачиваемаяНоменклатура.Количество() > 0 тогда			 
		    	    ПараметрыПечатиЧека.ОплачиваемаяНоменклатура = СкорректироватьСуммаСУчетомПени(ДокументСсылка.ДокументОснование.бит_ДокументОснование, ПараметрыПечатиЧека.ОплачиваемаяНоменклатура);
		       конецесли; 
	 конецесли; 
	исключение
	конецпопытки;		
	
	// БИТ ЖКХ 03.02.2021	   	
	если ПараметрыПечатиЧека.ОплачиваемаяНоменклатура = неопределено ИЛИ
		// БИТ ЖКХ 10.02.2021	
		    ПараметрыПечатиЧека.ОплачиваемаяНоменклатура.Количество() = 0 ИЛИ
		     ПараметрыПечатиЧека.ОплачиваемаяНоменклатура[0].Сумма = null тогда
	  // БИТ ЖКХ 10.02.2021	
	  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка.ДокументОснование, "Товары") тогда
		
		таблицаИзCчета = ПолучитьТаблицуИзСчета (ДокументСсылка.ДокументОснование.Товары);
	 	ПараметрыПечатиЧека.ОплачиваемаяНоменклатура.Очистить();
		
		для каждого стр из таблицаИзCчета цикл
			новаяСтрока = ПараметрыПечатиЧека.ОплачиваемаяНоменклатура.Добавить();
//			новаяСтрока.ВидНачисления = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.
			новаяСтрока.ДатаДокумента = ДокументСсылка.Дата; 
//			новаяСтрока.ДоговорПлатежногоАгента
			новаяСтрока.Документ = ДокументСсылка.ДокументОснование;
//			новаяСтрока.КодВидаНоменклатурнойКлассификации
//			новаяСтрока.КодСтраныПроисхожденияТовара
			новаяСтрока.Количество = 1;
			новаяСтрока.КоличествоОтгружено = 1;
			новаяСтрока.Наименование = стр.Номенклатура;
			новаяСтрока.Номенклатура = стр.Номенклатура;
//			новаяСтрока.НомерТаможеннойДекларации
//			новаяСтрока.ПлатежныйАгент
			новаяСтрока.СтавкаНДС = стр.СтавкаНДС;
			новаяСтрока.Сумма = стр.Сумма;
			новаяСтрока.СуммаНДС = стр.СуммаНДС;
			новаяСтрока.СуммаСкидок  = стр.СуммаСкидки;
			новаяСтрока.Цена = стр.Цена;
		конеццикла;	
	  иначе	
		
	  конецесли;	
	конецесли;	
	
	Возврат ПараметрыПечатиЧека;
	
КонецФункции

// БИТ ЖКХ 11.02.2021
Функция ПодготовитьПараметрыПечатиЧека(ДокументСсылка, ПараметрыОбработчика, СообщениеОбОшибке)
	
	Перем ТаблицаРезультата;
	
	ИменаТаблиц = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",                 ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	Запрос.УстановитьПараметр("ДатаОчереди", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаРасчета", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата"));
	
	Если ПараметрыОбработчика.Свойство("ТипОбъекта") Тогда
		Если ПараметрыОбработчика.ТипОбъекта = "ОбщийМодуль" Тогда
			МодульОбработчика = ОбщегоНазначения.ОбщийМодуль(ПараметрыОбработчика.ИмяОбъекта);
		Иначе // документ
			МодульОбработчика = Документы[ПараметрыОбработчика.ИмяОбъекта];
		КонецЕсли;
	Иначе // документ по ссылке
		МодульОбработчика = Документы[ДокументСсылка.Метаданные().Имя];
	КонецЕсли;
	
	СообщениеОбОшибке = "";
	
	Запрос.Текст = МодульОбработчика.ТекстЗапросаПараметрыПечатиЧека(ДокументСсылка, ИменаТаблиц, СообщениеОбОшибке);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыПечатиЧека = Новый Структура;
	Для Индекс = 0 По ИменаТаблиц.Количество()-1 Цикл
		ИмяТаблицы = ИменаТаблиц[Индекс];
		
		Если ПараметрыПечатиЧека.Свойство(ИмяТаблицы, ТаблицаРезультата) Тогда
			// Документ может содержать товарные части как счета так и реализации
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[Индекс].Выгрузить(), ТаблицаРезультата);
		Иначе
			ТаблицаРезультата = Результат[Индекс].Выгрузить();
		КонецЕсли; 
		ПараметрыПечатиЧека.Вставить(ИмяТаблицы, ТаблицаРезультата);
	КонецЦикла; 
	                                                 
	// БИТ ЖКХ 08.02.2021
	попытка
	 если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыПечатиЧека, "ОплачиваемаяНоменклатура") И 
		  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка.ДокументОснование, "бит_ДокументОснование") И 
		    ЗначениеЗаполнено(ДокументСсылка.ДокументОснование.бит_ДокументОснование) тогда
			   если ПараметрыПечатиЧека.ОплачиваемаяНоменклатура.Количество() > 0 тогда			 
		    	    ПараметрыПечатиЧека.ОплачиваемаяНоменклатура = СкорректироватьСуммаСУчетомПени(ДокументСсылка.ДокументОснование.бит_ДокументОснование, ПараметрыПечатиЧека.ОплачиваемаяНоменклатура);
		       конецесли; 
	 конецесли; 
	исключение
	конецпопытки;
	
	// БИТ ЖКХ 03.02.2021	   	
	если ПараметрыПечатиЧека.ОплачиваемаяНоменклатура[0].Сумма = null тогда
	  // БИТ ЖКХ 10.02.2021	
	  если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка.ДокументОснование, "Товары") тогда
		
		таблицаИзCчета = ПолучитьТаблицуИзСчета (ДокументСсылка.ДокументОснование.Товары);
	 	ПараметрыПечатиЧека.ОплачиваемаяНоменклатура.Очистить();
		
		для каждого стр из таблицаИзCчета цикл
			новаяСтрока = ПараметрыПечатиЧека.ОплачиваемаяНоменклатура.Добавить();
//			новаяСтрока.ВидНачисления = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.
			новаяСтрока.ДатаДокумента = ДокументСсылка.Дата; 
//			новаяСтрока.ДоговорПлатежногоАгента
			новаяСтрока.Документ = ДокументСсылка.ДокументОснование;
//			новаяСтрока.КодВидаНоменклатурнойКлассификации
//			новаяСтрока.КодСтраныПроисхожденияТовара
			новаяСтрока.Количество = 1;
			новаяСтрока.КоличествоОтгружено = 1;
			новаяСтрока.Наименование = стр.Номенклатура;
			новаяСтрока.Номенклатура = стр.Номенклатура;
//			новаяСтрока.НомерТаможеннойДекларации
//			новаяСтрока.ПлатежныйАгент
			новаяСтрока.СтавкаНДС = стр.СтавкаНДС;
			новаяСтрока.Сумма = стр.Сумма;
			новаяСтрока.СуммаНДС = стр.СуммаНДС;
			новаяСтрока.СуммаСкидок  = стр.СуммаСкидки;
			новаяСтрока.Цена = стр.Цена;
		конеццикла;	
	  иначе	
		
	  конецесли;	
	конецесли;	
	
	Возврат ПараметрыПечатиЧека;
	
КонецФункции

// БИТ ЖКХ 11.02.2021
Функция ТекстЗапросаПараметрыПечатиЧекаСАвансом(ДокументСсылка, ИменаТаблиц, СообщениеОбОшибке) Экспорт

   если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") тогда	
	ТекстЗапросаЧека = ТекстЗапросаРеквизитыПечатиЧекаПКО(ИменаТаблиц); 
   конецесли;

   если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") тогда	
	ТекстЗапросаЧека = ТекстЗапросаРеквизитыПечатиЧекаОплатаКартой(ИменаТаблиц); 
	ПараметрыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ДокументОснование, ВидОперации");
	
	Если ПараметрыДокумента.ВидОперации <> Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю Тогда
		// Чек на предоплату по счету
		ТекстЗапросаЧека = ТекстЗапросаЧека 
			+ ТекстЗапросаДанныеРасшифровкаПлатежаОплатаКартой(ИменаТаблиц)
			+ Документы.РеализацияТоваровУслуг.ТекстЗапросаРеализацииПоСчету(ИменаТаблиц)
			+ Документы.СчетНаОплатуПокупателю.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц)
			+ Документы.РеализацияТоваровУслуг.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц);
	ИначеЕсли ТипЗнч(ПараметрыДокумента.ДокументОснование) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") Тогда
		// Чек на возврат предоплаты по счету
		ТекстЗапросаЧека = ТекстЗапросаЧека
			+ Документы.РеализацияТоваровУслуг.ТекстЗапросаРеализацииПоСчету(ИменаТаблиц)
			+ ТекстЗапросаДанныеРасшифровкаПлатежаВозвратПоСчетуОплатаКартой(ИменаТаблиц) 
			+ Документы.СчетНаОплатуПокупателю.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц)
			+ Документы.РеализацияТоваровУслуг.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц);
	Иначе
		// Чек на возврат по документу "Возврат товаров от покупателя"
		ТекстЗапросаЧека = ТекстЗапросаЧека
			+ ТекстЗапросаДанныеРасшифровкаПлатежаОплатаКартой(ИменаТаблиц) 
			+ Документы.ВозвратТоваровОтПокупателя.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц);
	КонецЕсли;
    Возврат ТекстЗапросаЧека;
   конецесли;

   если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") тогда	
	ТекстЗапросаЧека = ТекстЗапросаРеквизитыПечатиЧекаПоступления(ИменаТаблиц); 
   конецесли;

   ТекстЗапросаЧека = ТекстЗапросаЧека + Документы.РеализацияТоваровУслуг.ТекстЗапросаРеализацииПоСчету(ИменаТаблиц)
		+ Документы.СчетНаОплатуПокупателю.ТекстЗапросаДанныеДляПечатиЧекаСАвансом(ИменаТаблиц)
		+ Документы.РеализацияТоваровУслуг.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц);
		
   Возврат ТекстЗапросаЧека;
	
КонецФункции


Функция ТекстЗапросаДанныеРасшифровкаПлатежаВозвратПоСчетуОплатаКартой(ИменаТаблиц)
	
	ИменаТаблиц.Добавить("ВТ_СуммыВозвратаПоСтавкамНДС");
	ИменаТаблиц.Добавить("ВТ_РасшифровкаПлатежаРеализация");
	ИменаТаблиц.Добавить("ВТ_СуммыРеализацииПоСтавкамНДС");
	ИменаТаблиц.Добавить("ВТ_РасшифровкаПлатежа");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОплатаПлатежнойКартойВозвратРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ОплатаПлатежнойКартойВозвратРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ОплатаПлатежнойКартойВозвратРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВТ_СуммыВозвратаПоСтавкамНДС
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаПлатежнойКартойВозвратРасшифровкаПлатежа
	|ГДЕ
	|	ОплатаПлатежнойКартойВозвратРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПлатежнойКартойВозвратРасшифровкаПлатежа.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.Сделка КАК Сделка,
	|	СУММА(ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.СчетНаОплату КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежаРеализация
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартойВозврат
	|		ПО (ОплатаПлатежнойКартойВозврат.ДокументОснование = ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.Ссылка)
	|ГДЕ
	|	ОплатаПлатежнойКартойВозврат.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.Ссылка,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.Сделка,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.СтавкаНДС,
	|	ОплатаПлатежнойКартойПоступлениеРасшифровкаПлатежа.СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасшифровкаПлатежаРеализация.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_РасшифровкаПлатежаРеализация.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВТ_РасшифровкаПлатежаРеализация.СуммаПлатежа) КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВТ_СуммыРеализацииПоСтавкамНДС
	|ИЗ
	|	ВТ_РасшифровкаПлатежаРеализация КАК ВТ_РасшифровкаПлатежаРеализация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасшифровкаПлатежаРеализация.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасшифровкаПлатежаРеализация.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_РасшифровкаПлатежаРеализация.СуммаПлатежа КАК СуммаПлатежа,
	|	ВТ_РасшифровкаПлатежаРеализация.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ВТ_РасшифровкаПлатежаРеализация.Сделка КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|			ТОГДА ВТ_РасшифровкаПлатежаРеализация.Сделка
	|		ИНАЧЕ ВТ_РасшифровкаПлатежаРеализация.СчетНаОплату
	|	КОНЕЦ КАК Сделка,
	|	ВТ_РасшифровкаПлатежаРеализация.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_РасшифровкаПлатежаРеализация.СуммаНДС КАК СуммаНДС,
	|	ВТ_РасшифровкаПлатежаРеализация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
	|ИЗ
	|	ВТ_РасшифровкаПлатежаРеализация КАК ВТ_РасшифровкаПлатежаРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СуммыВозвратаПоСтавкамНДС КАК ВТ_СуммыВозвратаПоСтавкамНДС
	|		ПО ВТ_РасшифровкаПлатежаРеализация.СтавкаНДС = ВТ_СуммыВозвратаПоСтавкамНДС.СтавкаНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СуммыРеализацииПоСтавкамНДС КАК ВТ_СуммыРеализацииПоСтавкамНДС
	|		ПО ВТ_РасшифровкаПлатежаРеализация.СтавкаНДС = ВТ_СуммыРеализацииПоСтавкамНДС.СтавкаНДС
	|ГДЕ // Делаем возврат по номенклатуре только в случае если сумма реализации и сумма возврата по номенклатуре совпадает с учетом сумм НДС
	|	ВТ_СуммыВозвратаПоСтавкамНДС.СуммаНДС = ВТ_СуммыРеализацииПоСтавкамНДС.СуммаНДС 
	|	И ВТ_СуммыВозвратаПоСтавкамНДС.СуммаПлатежа = ВТ_СуммыРеализацииПоСтавкамНДС.СуммаПлатежа";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

Функция ТекстЗапросаДанныеРасшифровкаПлатежаОплатаКартой(ИменаТаблиц)
	ИменаТаблиц.Добавить("ВТ_РасшифровкаПлатежа");
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.Ссылка,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.СтавкаНДС,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.СуммаНДС,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ОплатаПлатежнойКартойРасшифровкаПлатежа.Сделка КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|			ТОГДА ОплатаПлатежнойКартойРасшифровкаПлатежа.Сделка
	|		ИНАЧЕ ОплатаПлатежнойКартойРасшифровкаПлатежа.СчетНаОплату
	|	КОНЕЦ КАК Сделка,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.СуммаПлатежа,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаПлатежнойКартойРасшифровкаПлатежа
	|ГДЕ
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.Ссылка = &ДокументСсылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции
 
Функция ТекстЗапросаРеквизитыПечатиЧекаОплатаКартой(ИменаТаблиц)
	ИменаТаблиц.Добавить("ВТ_ДоговорПлатежногоАгента");
	ИменаТаблиц.Добавить("ВТ_ДоговорПлатежногоАгентаСводно");
	ИменаТаблиц.Добавить("ВТ_РеквизитыШапки");
	ИменаТаблиц.Добавить("ВТ_РеализацииПоСчету");
	ИменаТаблиц.Добавить("РеквизитыПечатиЧека");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорПлатежногоАгента,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента.Владелец КАК ПлатежныйАгент,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгента
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаПлатежнойКартойРасшифровкаПлатежа
	|ГДЕ
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|	И ОплатаПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента.ПлатежныйАгент
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.Ссылка,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговораПлатежногоАгента.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК ДоговорПлатежногоАгента,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК КоличествоДоговоров,
	|	ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент КАК ПлатежныйАгент
	|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгентаСводно
	|ИЗ
	|	ВТ_ДоговораПлатежногоАгента КАК ВТ_ДоговораПлатежногоАгента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговораПлатежногоАгента.Ссылка,
	|	ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатаПлатежнойКартой.Ссылка КАК Ссылка,
	|	ОплатаПлатежнойКартой.Организация КАК Организация,
	|	ОплатаПлатежнойКартой.ДокументОснование КАК ДокументОснование,
	|	ОплатаПлатежнойКартой.СуммаДокумента КАК СуммаДокумента,
	|	ОплатаПлатежнойКартой.Контрагент КАК Контрагент,
	|	ОплатаПлатежнойКартой.Дата КАК Дата,
	|	ОплатаПлатежнойКартой.Номер КАК Номер,
	|	ОплатаПлатежнойКартой.ВидОперации КАК ВидОперации,
	|	ОплатаПлатежнойКартой.Патент КАК Патент,
	|	ОплатаПлатежнойКартой.ВалютаДокумента КАК ВалютаДокумента,
	|	ОплатаПлатежнойКартой.СтавкаНДС КАК СтавкаНДС,
	|	ОплатаПлатежнойКартой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю) КАК ЭтоВозврат,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорПлатежногоАгента,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.КоличествоДоговоров, 0) > 1 КАК НесколькоДоговоровПлатежногоАгента,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПлатежныйАгент
	|ПОМЕСТИТЬ ВТ_РеквизитыШапки
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПлатежногоАгентаСводно КАК ВТ_ДоговораПлатежногоАгента
	|		ПО ОплатаПлатежнойКартой.Ссылка = ВТ_ДоговораПлатежногоАгента.Ссылка
	|ГДЕ
	|	ОплатаПлатежнойКартой.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров,
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.СчетНаОплату КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаПлатежнойКартойРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ОплатаПлатежнойКартойРасшифровкаПлатежа.СчетНаОплату = РеализацияТоваровУслуг.СчетНаОплатуПокупателю
	|ГДЕ
	|	ОплатаПлатежнойКартойРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|	И ЕСТЬNULL(РеализацияТоваровУслуг.Проведен, ЛОЖЬ)
	|	И ОплатаПлатежнойКартойРасшифровкаПлатежа.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РеквизитыШапки.Ссылка КАК Ссылка,
	|	ВТ_РеквизитыШапки.Организация КАК Организация,
	|	ВТ_РеквизитыШапки.СуммаДокумента КАК СуммаДокумента,
	|	ВТ_РеквизитыШапки.Контрагент КАК Контрагент,
	|	ИСТИНА КАК ВыводитьКонтрагентаВЧеке,
	|	ВТ_РеквизитыШапки.Дата КАК Дата,
	|	ВТ_РеквизитыШапки.Номер КАК Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Электронно) КАК ТипОплаты,
	|	ВЫБОР ВТ_РеквизитыШапки.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|	КОНЕЦ КАК ТипРасчета,
	|	ВТ_РеквизитыШапки.Патент КАК Патент,
	|	ВТ_РеквизитыШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ВТ_РеквизитыШапки.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_РеквизитыШапки.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ВТ_РеквизитыШапки.НесколькоДоговоровПлатежногоАгента КАК НесколькоДоговоровПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ПлатежныйАгент КАК ПлатежныйАгент,
	|	ВТ_РеквизитыШапки.ВидОперации КАК ВидОперации
	|ИЗ
	|	ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

Функция ТекстЗапросаРеквизитыПечатиЧекаПКО(ИменаТаблиц)
	
	ИменаТаблиц.Добавить("ВТ_РасшифровкаПлатежа");
	ИменаТаблиц.Добавить("ВТ_ДоговораПлатежногоАгента");
	ИменаТаблиц.Добавить("ВТ_РеквизитыШапки");
	ИменаТаблиц.Добавить("ВТ_РеализацииПоСчету");
	ИменаТаблиц.Добавить("РеквизитыПечатиЧека");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|			ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка
	|		ИНАЧЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату
	|	КОНЕЦ КАК Сделка,
	|	СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|			ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка
	|		ИНАЧЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорПлатежногоАгента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.Владелец КАК ПлатежныйАгент
	|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгента
	|ИЗ
	|	ВТ_РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.ПлатежныйАгент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.СубконтоКт2,
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.СубконтоКт1
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ВЫРАЗИТЬ(ПриходныйКассовыйОрдер.СубконтоКт2 КАК Справочник.ДоговорыКонтрагентов).ПлатежныйАгент
	|	И ПриходныйКассовыйОрдер.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдер.Дата КАК Дата,
	|	ПриходныйКассовыйОрдер.Номер КАК Номер,
	|	ПриходныйКассовыйОрдер.Организация КАК Организация,
	|	ПриходныйКассовыйОрдер.Патент КАК Патент,
	|	ПриходныйКассовыйОрдер.Основание КАК Основание,
	|	ПриходныйКассовыйОрдер.ВидОперации КАК ВидОперации,
	|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
	|	ПриходныйКассовыйОрдер.ПринятоОт КАК ПринятоОт,
	|	ПриходныйКассовыйОрдер.СтавкаНДС КАК СтавкаНДС,
	|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
	|	ПриходныйКассовыйОрдер.ВалютаДокумента КАК ВалютаДокумента,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорПлатежногоАгента,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПлатежныйАгент,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.КоличествоДоговоров, 0) > 1 КАК НесколькоДоговоровПлатежногоАгента
	|ПОМЕСТИТЬ ВТ_РеквизитыШапки
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ДоговораПлатежногоАгента.Ссылка КАК Ссылка,
	|			МАКСИМУМ(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК ДоговорПлатежногоАгента,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК КоличествоДоговоров,
	|			ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент КАК ПлатежныйАгент
	|		ИЗ
	|			ВТ_ДоговораПлатежногоАгента КАК ВТ_ДоговораПлатежногоАгента
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ДоговораПлатежногоАгента.Ссылка,
	|			ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент) КАК ВТ_ДоговораПлатежногоАгента
	|		ПО ПриходныйКассовыйОрдер.Ссылка = ВТ_ДоговораПлатежногоАгента.Ссылка
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров,
	|	ВТ_РасшифровкаПлатежа.Сделка КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
	|ИЗ
	|	ВТ_РасшифровкаПлатежа КАК ВТ_РасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_РасшифровкаПлатежа.Сделка = РеализацияТоваровУслуг.СчетНаОплатуПокупателю
	|ГДЕ
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Проведен, ЛОЖЬ)
	|	И ВТ_РасшифровкаПлатежа.Сделка <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РеквизитыШапки.Ссылка КАК Ссылка,
	|	ВТ_РеквизитыШапки.Организация КАК Организация,
	|	ВТ_РеквизитыШапки.СуммаДокумента КАК СуммаДокумента,
	|	ВТ_РеквизитыШапки.Контрагент КАК Контрагент,
	|	ИСТИНА КАК ВыводитьКонтрагентаВЧеке,
	|	ВТ_РеквизитыШапки.ПринятоОт КАК ПринятоОт,
	|	ВТ_РеквизитыШапки.Основание КАК Основание,
	|	ВТ_РеквизитыШапки.Дата КАК Дата,
	|	ВТ_РеквизитыШапки.Номер КАК Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Наличные) КАК ТипОплаты,
	|	ВЫБОР ВТ_РеквизитыШапки.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтПоставщика)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|	КОНЕЦ КАК ТипРасчета,
	|	ВТ_РеквизитыШапки.Патент КАК Патент,
	|	ВЫБОР
	|		КОГДА ВТ_РеквизитыШапки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтПоставщика)
	|				ИЛИ ВТ_РеквизитыШапки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ОплатаПокупателя)
	|			ТОГДА ВТ_РеквизитыШапки.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВТ_РеквизитыШапки.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ПлатежныйАгент КАК ПлатежныйАгент,
	|	ВТ_РеквизитыШапки.НесколькоДоговоровПлатежногоАгента КАК НесколькоДоговоровПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ВалютаДокумента КАК ВалютаДокумента
	|ИЗ
	|	ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

Функция ТекстЗапросаРеквизитыПечатиЧекаПоступления(ИменаТаблиц)
	
	ИменаТаблиц.Добавить("ВТ_РасшифровкаПлатежа");
	ИменаТаблиц.Добавить("ВТ_СтавкиНДС");
	ИменаТаблиц.Добавить("ВТ_ДоговораПлатежногоАгента");
	ИменаТаблиц.Добавить("ВТ_ДоговораПлатежногоАгентаСводная");
	ИменаТаблиц.Добавить("ВТ_РеквизитыШапки");
	ИменаТаблиц.Добавить("ВТ_РеализацииПоСчету");
	ИменаТаблиц.Добавить("РеквизитыПечатиЧека");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|			ТОГДА ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка
	|		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату
	|	КОНЕЦ КАК Сделка,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента.Владелец КАК Контрагент
	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|			ТОГДА ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка
	|		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_РасшифровкаПлатежа.СтавкаНДС) КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_СтавкиНДС
	|ИЗ
	|	ВТ_РасшифровкаПлатежа КАК ВТ_РасшифровкаПлатежа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасшифровкаПлатежа.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорПлатежногоАгента,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Контрагент КАК ПлатежныйАгент,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгента
	|ИЗ
	|	ВТ_РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента.ПлатежныйАгент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.СубконтоКт2,
	|	ПоступлениеНаРасчетныйСчет.СубконтоКт1,
	|	ПоступлениеНаРасчетныйСчет.Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ПоступлениеНаРасчетныйСчет.СубконтоКт2 КАК Справочник.ДоговорыКонтрагентов).ПлатежныйАгент, ЛОЖЬ)
	|	И ПоступлениеНаРасчетныйСчет.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговораПлатежногоАгента.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК ДоговорПлатежногоАгента,
	|	ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент КАК ПлатежныйАгент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК КоличествоДоговоров
	|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгентаСводная
	|ИЗ
	|	ВТ_ДоговораПлатежногоАгента КАК ВТ_ДоговораПлатежногоАгента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговораПлатежногоАгента.Ссылка,
	|	ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Дата КАК Дата,
	|	ПоступлениеНаРасчетныйСчет.Номер КАК Номер,
	|	ПоступлениеНаРасчетныйСчет.Организация КАК Организация,
	|	ПоступлениеНаРасчетныйСчет.Патент КАК Патент,
	|	ПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК Основание,
	|	ПоступлениеНаРасчетныйСчет.ВидОперации КАК ВидОперации,
	|	ПоступлениеНаРасчетныйСчет.Контрагент КАК Контрагент,
	|	ПоступлениеНаРасчетныйСчет.Контрагент КАК ПринятоОт,
	|	ВТ_СтавкиНДС.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеНаРасчетныйСчет.СуммаДокумента КАК СуммаДокумента,
	|	ПоступлениеНаРасчетныйСчет.ВалютаДокумента КАК ВалютаДокумента,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорПлатежногоАгента,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПлатежныйАгент,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.КоличествоДоговоров, 0) > 1 КАК НесколькоДоговоровПлатежногоАгента
	|ПОМЕСТИТЬ ВТ_РеквизитыШапки
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПлатежногоАгентаСводная КАК ВТ_ДоговораПлатежногоАгента
	|		ПО ПоступлениеНаРасчетныйСчет.Ссылка = ВТ_ДоговораПлатежногоАгента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК ВТ_СтавкиНДС
	|		ПО ПоступлениеНаРасчетныйСчет.Ссылка = ВТ_СтавкиНДС.Ссылка
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
	|ИЗ
	|	ВТ_РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка = РеализацияТоваровУслуг.СчетНаОплатуПокупателю
	|ГДЕ
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Проведен, ЛОЖЬ)
	|	И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РеквизитыШапки.Ссылка КАК Ссылка,
	|	ВТ_РеквизитыШапки.Организация КАК Организация,
	|	ВТ_РеквизитыШапки.СуммаДокумента КАК СуммаДокумента,
	|	ВТ_РеквизитыШапки.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК ВыводитьКонтрагентаВЧеке,
	|	ВТ_РеквизитыШапки.ПринятоОт КАК ПринятоОт,
	|	ВТ_РеквизитыШапки.Основание КАК Основание,
	|	ВТ_РеквизитыШапки.Дата КАК Дата,
	|	ВТ_РеквизитыШапки.Номер КАК Номер,
	|	ВТ_РеквизитыШапки.ВидОперации КАК ВидОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Электронно) КАК ТипОплаты,
	|	ВЫБОР ВТ_РеквизитыШапки.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|	КОНЕЦ КАК ТипРасчета,
	|	ВТ_РеквизитыШапки.Патент КАК Патент,
	|	ВЫБОР
	|		КОГДА ВТ_РеквизитыШапки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика)
	|				ИЛИ ВТ_РеквизитыШапки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	|			ТОГДА ВТ_РеквизитыШапки.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВТ_РеквизитыШапки.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ПлатежныйАгент КАК ПлатежныйАгент,
	|	ВТ_РеквизитыШапки.НесколькоДоговоровПлатежногоАгента КАК НесколькоДоговоровПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ВалютаДокумента КАК ВалютаДокумента
	|ИЗ
	|	ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

// БИТ ЖКХ 08.02.2021
функция СкорректироватьСуммаСУчетомПени (ДокументПени, ТаблицаСумм)
	
 ТаблицаСуммСПени = ТаблицаСумм.Скопировать();	
 запросПени	= новый Запрос;
 запросПени.Текст =   "ВЫБРАТЬ
                      |	бит_НачислениеПениПоУслугамЖКХ.Регистратор КАК Регистратор,
                      |	бит_НачислениеПениПоУслугамЖКХ.ЛицевойСчет КАК ЛицевойСчет,
                      |	бит_НачислениеПениПоУслугамЖКХ.УслугаЖКХ КАК УслугаЖКХ,
                      |	бит_НачислениеПениПоУслугамЖКХ.СуммаПени КАК СуммаПени,
                      |	бит_НачислениеПениПоУслугамЖКХ.УслугаЖКХ.Номенклатура КАК УслугаЖКХНоменклатура
                      |ИЗ
                      |	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ КАК бит_НачислениеПениПоУслугамЖКХ
                      |ГДЕ
                      |	бит_НачислениеПениПоУслугамЖКХ.Регистратор = &Регистратор";
 
 запросПени.УстановитьПараметр("Регистратор", ДокументПени);
 таблицаПени = запросПени.Выполнить().Выгрузить();
 таблицаПени.Свернуть("Регистратор, ЛицевойСчет, УслугаЖКХНоменклатура", "СуммаПени");
 если таблицаПени.Количество() > 0 тогда
	 
	 для каждого стр из ТаблицаСуммСПени цикл
		 
		 если стр.ВидНачисления <> перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс тогда
			 
			Отбор = Новый Структура();
			Отбор.Вставить("УслугаЖКХНоменклатура", стр.Номенклатура);						
            СтрокиПени = таблицаПени.НайтиСтроки(Отбор);        			
			
			Если СтрокиПени.Количество() > 0 Тогда
				стр.Сумма = стр.Сумма + СтрокиПени[0].СуммаПени;
			КонецЕсли;	 
			 
		 конецесли;	 
		 
	 конеццикла;	 
	 
 конецесли;	 
 
 возврат ТаблицаСуммСПени;	
 
конецфункции
функция ПолучитьТаблицуИзСчета (таблицаCчета)
 таблицаИзCчета = таблицаCчета.Выгрузить();	
 таблицаИзCчета.Свернуть("Номенклатура, Содержание, ПроцентСкидки, СтавкаНДС", "Сумма, Цена, СуммаСкидки, СуммаНДС"); 	
 возврат таблицаИзCчета;
КонецФункции	

Функция НовыйРеквизитыПечатиЧека()
	
	РеквизитыПечатиЧека = Новый Структура;
	
	РеквизитыПечатиЧека.Вставить("Ссылка",                             Неопределено);
	РеквизитыПечатиЧека.Вставить("Дата",                               ТекущаяДата());
	РеквизитыПечатиЧека.Вставить("Номер",                              "1");
	РеквизитыПечатиЧека.Вставить("Организация",                        Справочники.Организации.ПустаяСсылка());
	РеквизитыПечатиЧека.Вставить("Контрагент",                         Неопределено);
	РеквизитыПечатиЧека.Вставить("ВыводитьКонтрагентаВЧеке",           ЛОЖЬ);
	РеквизитыПечатиЧека.Вставить("ВидОперации",                        Неопределено);
	РеквизитыПечатиЧека.Вставить("Выдать",                             "");
	РеквизитыПечатиЧека.Вставить("ПринятоОт",                          "");
	РеквизитыПечатиЧека.Вставить("Основание",                          "");
	РеквизитыПечатиЧека.Вставить("Патент",                             Справочники.Патенты.ПустаяСсылка());
	РеквизитыПечатиЧека.Вставить("СтавкаНДС",                          Перечисления.СтавкиНДС.БезНДС);
	РеквизитыПечатиЧека.Вставить("СуммаДокумента",                     0);
	РеквизитыПечатиЧека.Вставить("ВалютаДокумента",                    ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	РеквизитыПечатиЧека.Вставить("ДоговорПлатежногоАгента",            Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	РеквизитыПечатиЧека.Вставить("ПлатежныйАгент",                     Справочники.Контрагенты.ПустаяСсылка());
	РеквизитыПечатиЧека.Вставить("НесколькоДоговоровПлатежногоАгента", ЛОЖЬ);
	РеквизитыПечатиЧека.Вставить("ТипОплаты",                          Неопределено);
	РеквизитыПечатиЧека.Вставить("ТипРасчета",                         Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств);
	РеквизитыПечатиЧека.Вставить("НалоговыйРежим",                     Перечисления.ТипыСистемНалогообложенияККТ.ОСН);
	РеквизитыПечатиЧека.Вставить("НаименованиеВСтрокеЧека",            "");
	РеквизитыПечатиЧека.Вставить("НомерСекции",                        0);
	РеквизитыПечатиЧека.Вставить("ОписаниеУдержанияДляЧека",           "");
	РеквизитыПечатиЧека.Вставить("ИдентификаторФискальнойЗаписи",      "");
	
	Возврат РеквизитыПечатиЧека;
КонецФункции

Функция ПараметрыОперацииФискализацииЧека(Реквизиты, ДанныеПечатиЧека, ВерсияФормата, АдресУстановкиККТ) Экспорт
	//Шапка чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	ОбщиеПараметры.ИндивидуальныйРежимПодготовкиДанныхКПередачеВОФД = Истина;
	
	ПодготовитьДанныеКПередачеВОФД = Константы.ПодготовитьДанныеКПередачеВОФД.Получить();
	
	// Сумма расчета - сумма всех позиций чека
	СуммаРасчетаПоЧеку = 0;
	СуммаПостоплатойПоЧеку = 0;
	СуммаПредоплатойПоЧеку = 0;
	
	ОбщиеПараметры.ТипРасчета = Реквизиты.ТипРасчета;
		
	ОбщиеПараметры.Электронно = Ложь;
	
	//Параметры принтера чеков ЕНВД
	ОбщиеПараметры.НомерКассы        = "00001";
	ОбщиеПараметры.НомерЧека         = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Истина);
	ОбщиеПараметры.НомерСмены        = 1;
	ОбщиеПараметры.ДатаВремя         = ТекущаяДатаСеанса();
	ОбщиеПараметры.ДокументОснование = Реквизиты.Ссылка;
	ОбщиеПараметры.Организация       = Реквизиты.Организация;
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, Реквизиты.Дата);
	
	ОбщиеПараметры.ОрганизацияНазвание       = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
	ОбщиеПараметры.ОрганизацияИНН            = СведенияОбОрганизации.ИНН;
	ОбщиеПараметры.ОрганизацияКПП            = СведенияОбОрганизации.КПП;
	ОбщиеПараметры.АдресМагазина             = ?(ЗначениеЗаполнено(АдресУстановкиККТ), АдресУстановкиККТ, СведенияОбОрганизации.ФактическийАдрес);
	
	Если ЗначениеЗаполнено(Реквизиты.Контрагент)
		И ТипЗнч(Реквизиты.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Контрагент, Реквизиты.Дата);
		
		Если Реквизиты.ВыводитьКонтрагентаВЧеке 
			И (СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо 
			ИЛИ ЗначениеЗаполнено(СведенияОКонтрагенте.ИНН)) Тогда
			
			ОбщиеПараметры.Получатель    = СведенияОКонтрагенте.НаименованиеДляПечатныхФорм;
			ОбщиеПараметры.ПолучательИНН = СведенияОКонтрагенте.ИНН;
			
		КонецЕсли; 
		
		ОбщиеПараметры.ПокупательEmail = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Реквизиты.Контрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
		ОбщиеПараметры.ПокупательНомер = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(
			УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Реквизиты.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
			
	ИначеЕсли ЗначениеЗаполнено(Реквизиты.Контрагент)
			и ТипЗнч(Реквизиты.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			
		ОбщиеПараметры.ЕстьПерсональныеДанные = Истина;
		ОбщиеПараметры.СубъектПерсональныхДанных = Реквизиты.Контрагент;
		ОбщиеПараметры.ПокупательEmail = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Реквизиты.Контрагент, Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
		ОбщиеПараметры.ПокупательНомер = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(
			УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Реквизиты.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица));
		
	КонецЕсли;
		
	Если НЕ ПустаяСтрока(ОбщиеПараметры.ПокупательНомер) Тогда
		// Номер покупателя передается в формате +{Ц}
		ОбщиеПараметры.ПокупательНомер = "+"+ОбщиеПараметры.ПокупательНомер;
	КонецЕсли;

	ОбщиеПараметры.СистемаНалогообложения = Реквизиты.НалоговыйРежим;
	
	ДанныеКассира = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛицаТекущегоПользователя(Реквизиты.Организация, Реквизиты.Дата);
	
	Если ДанныеКассира.Представление <> Неопределено Тогда
		ОбщиеПараметры.Кассир = СокрЛП(СтрШаблон("%1 %2", Строка(ДанныеКассира.Должность), ДанныеКассира.Представление));
	Иначе
		ОбщиеПараметры.Кассир = НСтр("ru = 'Администратор'");
	КонецЕсли;
	
	ОбщиеПараметры.КассирИНН = ДанныеКассира.ИНН;
	
	Если Реквизиты.Свойство("ИдентификаторФискальнойЗаписи") и НЕ ПустаяСтрока(Реквизиты.ИдентификаторФискальнойЗаписи) Тогда
		ОбщиеПараметры.ИдентификаторФискальнойЗаписи = Реквизиты.ИдентификаторФискальнойЗаписи;
		ОплачиваемыеДокументы = ДанныеПечатиЧека.ОплачиваемыеДокументы.Скопировать(Новый Структура("ИдентификаторФискальнойЗаписи", Реквизиты.ИдентификаторФискальнойЗаписи));
		ОплачиваемаяНоменклатура = ДанныеПечатиЧека.ОплачиваемаяНоменклатура.Скопировать(Новый Структура("ИдентификаторФискальнойЗаписи", Реквизиты.ИдентификаторФискальнойЗаписи));
	Иначе
		ОплачиваемыеДокументы = ДанныеПечатиЧека.ОплачиваемыеДокументы;
		ОплачиваемаяНоменклатура = ДанныеПечатиЧека.ОплачиваемаяНоменклатура;
	КонецЕсли;

	//Строки чека
	ОплачиваемаяНоменклатура.Индексы.Добавить("Документ");
	ОплачиваемаяНоменклатура.Индексы.Добавить("СтавкаНДС");
	
	ЭтоВерсия105 = ЗначениеЗаполнено(ВерсияФормата) И НЕ (ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.5.0", ВерсияФормата) > 0);
	ЭтоВерсия110 = ЗначениеЗаполнено(ВерсияФормата) И НЕ (ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.1.0.0", ВерсияФормата) > 0);
	
	СписокНоменклатуры          = ОбщегоНазначения.ВыгрузитьКолонку(ОплачиваемаяНоменклатура, "Номенклатура", Истина);
	ОбщегоНазначенияБПКлиентСервер.УдалитьНеЗаполненныеЭлементыМассива(СписокНоменклатуры);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Реквизиты);
	
	СведенияОСпискеНоменклатуры = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(СписокНоменклатуры, ПараметрыОбъекта, Истина, Ложь);
	
	ЕстьОбщийКомитентПоЧеку       = Неопределено;
	ЕстьОбщийПлатежныйАгентПоЧеку = Неопределено;
	
	ДоговорПлатежногоАгента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ПлатежныйАгент          = Справочники.Контрагенты.ПустаяСсылка();
	КомитентПоЧеку          = НовыйСведенияОКомитенте();
	
	//Платежный агент
	Если ЗначениеЗаполнено(Реквизиты.ДоговорПлатежногоАгента)
		ИЛИ ЗначениеЗаполнено(Реквизиты.ПлатежныйАгент) Тогда
		Если Реквизиты.НесколькоДоговоровПлатежногоАгента И НЕ ЭтоВерсия105 Тогда
			ТекстСообщения = НСтр("ru = 'В чеке может быть указан только один договор платежного агента.'");
			Возврат Неопределено;
		КонецЕсли;
		
		ЕстьОбщийПлатежныйАгентПоЧеку = Истина;
		ДоговорПлатежногоАгента       = Реквизиты.ДоговорПлатежногоАгента;
		ПлатежныйАгент                = Реквизиты.ПлатежныйАгент;
		
	ИначеЕсли ОплачиваемаяНоменклатура.Количество() > 0 И ЭтоВерсия105 Тогда 
		
		МассивТоваровНаКомиссии = Новый Массив;
		
		Для каждого СведенияОНоменклатуре Из СведенияОСпискеНоменклатуры Цикл
			Если СведенияОНоменклатуре.Значение.Комиссионный Тогда
				МассивТоваровНаКомиссии.Добавить(СведенияОНоменклатуре.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		ОплачиваемаяНоменклатура.Сортировать("ДатаДокумента");
		
		СведенияОКомитентах = ПолучитьСведенияОКомитентах(МассивТоваровНаКомиссии, Реквизиты.Организация, ОплачиваемаяНоменклатура[0].ДатаДокумента);
	КонецЕсли;
	
	Отбор = Новый Структура("Документ, СтавкаНДС");
	Для каждого ОплачиваемыйДокумент Из ОплачиваемыеДокументы Цикл
		ЗаполнитьЗначенияСвойств(Отбор, ОплачиваемыйДокумент);
		Если ОплачиваемыйДокумент.СуммаСкидкиПоДокументу <> 0 Тогда
			ТаблицаСчетаНаОплату = ОплачиваемаяНоменклатура.Скопировать(Новый Структура("Документ", ОплачиваемыйДокумент.Документ));
			
			СуммаСоСкидкой    = ТаблицаСчетаНаОплату.Итог("Сумма") - ОплачиваемыйДокумент.СуммаСкидкиПоДокументу;
			СуммаНДССоСкидкой = ?(ТаблицаСчетаНаОплату.Итог("Сумма") = 0, 0, Окр(ТаблицаСчетаНаОплату.Итог("СуммаНДС") * СуммаСоСкидкой / ТаблицаСчетаНаОплату.Итог("Сумма"), 2));
			
			ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(ОплачиваемыйДокумент.СуммаСкидкиПоДокументу, ТаблицаСчетаНаОплату, "СуммаСкидок", "Сумма");
			ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СуммаСоСкидкой, ТаблицаСчетаНаОплату, "Сумма");
			ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СуммаНДССоСкидкой, ТаблицаСчетаНаОплату, "СуммаНДС");
			
			ОплачиваемыеПозицииСчета = ТаблицаСчетаНаОплату.Скопировать(Отбор);
		Иначе
			ОплачиваемыеПозицииСчета = ОплачиваемаяНоменклатура.Скопировать(Отбор);
		КонецЕсли; 
		
		СуммаВзаиморасчетов = ?(ОплачиваемыйДокумент.РасчетыВУсловныхЕдиницах, ОплачиваемыйДокумент.СуммаВзаиморасчетов, ОплачиваемыйДокумент.СуммаОплаты);
		
		Если ОплачиваемыеПозицииСчета.Количество() = 0  ИЛИ (ОплачиваемыеПозицииСчета.Итог("Сумма") <> СуммаВзаиморасчетов И НЕ ЭтоВерсия105) Тогда
			
			Если ЗначениеЗаполнено(ОплачиваемыйДокумент.СтавкаНДС) Тогда
				СтавкаНДС = УчетНДСВызовСервераПовтИсп.РасчетнаяСтавкаНДС(ОплачиваемыйДокумент.СтавкаНДС);
			Иначе
				СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли; 
			
			// Оплата без номенклатуры
			СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
			СтрокаПозицииЧека.Наименование           = Реквизиты.НаименованиеВСтрокеЧека;
			СтрокаПозицииЧека.Количество             = 1;
			СтрокаПозицииЧека.Цена                   = ОплачиваемыйДокумент.СуммаОплаты;
			СтрокаПозицииЧека.ЦенаСоСкидками         = ОплачиваемыйДокумент.СуммаОплаты;
			СтрокаПозицииЧека.Сумма                  = ОплачиваемыйДокумент.СуммаОплаты;
			СтрокаПозицииЧека.СтавкаНДС              = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДСдляККТ(СтавкаНДС, ЭтоВерсия105);
			
			СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(ОплачиваемыйДокумент.СуммаОплаты, Истина, 
			УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
			
			СтрокаПозицииЧека.СуммаНДС = Окр(СуммаНДС, 2);
			
			СтрокаПозицииЧека.ПризнакСпособаРасчета  = ?(ЭтоВерсия105,Перечисления.ПризнакиСпособаРасчета.Аванс, Неопределено);
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ?(ЭтоВерсия105,Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата, Неопределено);
			СтрокаПозицииЧека.НомерСекции            = Реквизиты.НомерСекции;
			СтрокаПозицииЧека.НомерСтрокиТовара      = ОбщиеПараметры.ПозицииЧека.Количество()+1;
			ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
			
			СуммаРасчетаПоЧеку = СуммаРасчетаПоЧеку + ОплачиваемыйДокумент.СуммаОплаты;
		Иначе
			// Оплата счета в уе
			Если ОплачиваемыйДокумент.РасчетыВУсловныхЕдиницах Тогда
				КурсОплаты = ОплачиваемыйДокумент.СуммаОплаты/СуммаВзаиморасчетов;
				
				// Используем распределение сумм по строкам документа вместо построчного расчета, чтобы избежать проблем с форматологическим контролем из-за ошибок округления.
				ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(ОплачиваемыеПозицииСчета.Итог("Сумма") * КурсОплаты, ОплачиваемыеПозицииСчета, "Сумма");
				ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(ОплачиваемыеПозицииСчета.Итог("СуммаНДС") * КурсОплаты, ОплачиваемыеПозицииСчета, "СуммаНДС");
				
				Для каждого СтрокаСчета Из ОплачиваемыеПозицииСчета Цикл
					// Если по строке есть скидка - то пересчитываем цену по курсу, иначе используем более точный метод расчета от суммы в рублях.
					СтрокаСчета.Цена = ?(
					ОплачиваемыйДокумент.СуммаСкидкиПоДокументу <> 0 ИЛИ СтрокаСчета.СуммаСкидок <> 0, 
					Окр(СтрокаСчета.Цена * КурсОплаты, 2), 
					Окр(СтрокаСчета.Сумма/СтрокаСчета.Количество, 2));
				КонецЦикла; 
			КонецЕсли; 
			
			// Признак предоплаты устанавливается по всем позициям счета под одну ставку
			// Сравниваем сумму по счету и сумму оплаты поступившую на текущий момент
			ОстатокКОплате = ОплачиваемыеПозицииСчета.Итог("Сумма") - ОплачиваемыйДокумент.СуммаОплатыВсего;
			Если ОстатокКОплате > 0   Тогда 
				ПризнакПредоплатыПоСчету = Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
			Иначе
				ПризнакПредоплатыПоСчету = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
			КонецЕсли;
			
			Если НЕ ПодготовитьДанныеКПередачеВОФД ИЛИ ОплачиваемыйДокумент.СуммаОплаты = 0 Тогда
				СуммаПостоплатойПоЧеку = СуммаПостоплатойПоЧеку + ОстатокКОплате;
				СуммаПредоплатойПоЧеку = СуммаПредоплатойПоЧеку + (ОплачиваемыйДокумент.СуммаОплатыВсего - ОплачиваемыйДокумент.СуммаОплаты);
			Иначе
				// Постоплату и предоплату считаем только для передачи товара (в соответствии с методическими указаниями ФНС). 
				// В случаях приема или выдачи денежных средств постоплата не указывается.
				СуммаСчета = ОплачиваемыеПозицииСчета.Итог("Сумма");
				Если ОплачиваемыйДокумент.СуммаОплаты <> СуммаСчета Тогда
					СуммыДокумента = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ОплачиваемыйДокумент.СуммаОплаты, ОбщегоНазначения.ВыгрузитьКолонку(ОплачиваемыеПозицииСчета, "Сумма"), 2);
					
					
					ОплачиваемыеПозицииСчета.ЗагрузитьКолонку(СуммыДокумента, "Сумма");
					ОплачиваемыеПозицииСчета.ЗагрузитьКолонку(СуммыДокумента, "Цена");
					
					СуммаСкидок = ?(СуммаСчета = 0, 0, Окр(ОплачиваемыеПозицииСчета.Итог("СуммаСкидок") * ОплачиваемыйДокумент.СуммаОплаты/СуммаСчета, 2));
					ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СуммаСкидок, ОплачиваемыеПозицииСчета, "СуммаСкидок");
					
					СуммаНДСДокумента = ?(СуммаСчета = 0, 0, Окр(ОплачиваемыеПозицииСчета.Итог("СуммаНДС") * ОплачиваемыйДокумент.СуммаОплаты/СуммаСчета, 2));
					ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СуммаНДСДокумента, ОплачиваемыеПозицииСчета, "СуммаНДС");
				КонецЕсли;
				
				// БИТ ЖКХ 28.01.2021
				//+МРЦ
				// Количество всегда 1 при предоплате и оплате кредита (в соответствии с методуказаниями)
				ОплачиваемыеПозицииСчета.ЗаполнитьЗначения(1, "Количество");
				Для каждого ОплачиваемыеПозицииСчетаСтр из ОплачиваемыеПозицииСчета Цикл
					ОплачиваемыеПозицииСчетаСтр.Количество = ОплачиваемыеПозицииСчетаСтр.Сумма / ОплачиваемыеПозицииСчетаСтр.Цена;
				КонецЦикла;
				//-МРЦ

			КонецЕсли; 
			
			// БИТ ЖКХ 28.01.2021
			// Оплата в разрезе номенклатуры счета
			//+МРЦ
			флгВидНачисления = (ОплачиваемыеПозицииСчета.Колонки.Найти("ВидНачисления") <> Неопределено);
			//-МРЦ
            Для каждого СтрокаСчета Из ОплачиваемыеПозицииСчета Цикл
				СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
				
				Если НЕ ЭтоВерсия105 Тогда
					ПризнакСпособаРасчета = Неопределено;
				ИначеЕсли СтрокаСчета.КоличествоОтгружено >= СтрокаСчета.Количество Тогда
					// Если передача не сопровождается оплатой
					Если ОплачиваемыйДокумент.СуммаОплаты = 0 Тогда
						Если ОплачиваемыйДокумент.СуммаОплатыВсего = 0 Тогда
							// Товар не был оплачен ранее.
							ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты;
						ИначеЕсли ОстатокКОплате = 0 Тогда
							// Товар был ранее оплачен полностью (нет остатка к оплате по ставке).
							ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
						Иначе
							// Товар был оплачен ранее частично.
							ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой;
						КонецЕсли
					Иначе
						// Если передача сопровождается оплатой
						ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
					КонецЕсли; 
				Иначе
					ПризнакСпособаРасчета = ПризнакПредоплатыПоСчету;
				КонецЕсли;
				
				// БИТ ЖКХ 28.01.2021
				//+МРЦ
				Если флгВидНачисления Тогда
					Если СтрокаСчета.ВидНачисления = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс Тогда
						// БИТ ЖКХ 5.02.2021
						ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.Аванс;
						//ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой;
						СтрокаПозицииЧека.Вставить("ПризнакСпособаРасчетаАванс", ПризнакСпособаРасчета);
					Иначе
						ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
						СтрокаПозицииЧека.Вставить("ПризнакСпособаРасчетаОплатаКредита", ПризнакСпособаРасчета);
					КонецЕсли;
				КонецЕсли;
				//-МРЦ

				
				СтрокаПозицииЧека.ПризнакСпособаРасчета  = ПризнакСпособаРасчета;
				Если ПризнакСпособаРасчета = Неопределено Тогда
					ПризнакПредметаРасчета = Неопределено;
				ИначеЕсли ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой 
					ИЛИ ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой
					ИЛИ ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты Тогда
					
					СведенияОНоменклатуре = СведенияОСпискеНоменклатуры[СтрокаСчета.Номенклатура];
					
					Если СтрокаСчета.ЭтоУслуга Тогда
						
						ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
					ИначеЕсли СведенияОНоменклатуре.ТабачнаяПродукция 
						ИЛИ СведенияОНоменклатуре.АлкогольнаяПродукция Тогда
						
						ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПодакцизныйТовар;
					Иначе
						
						ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
					КонецЕсли; 
				Иначе
					
					ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
				КонецЕсли;
				
				СтрокаПозицииЧека.ПризнакПредметаРасчета = ПризнакПредметаРасчета;
				
				ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, СтрокаСчета);
				
				// Цену со скидкой получаем расчетным путем
				СтрокаПозицииЧека.ЦенаСоСкидками = ?(СтрокаСчета.СуммаСкидок = 0, СтрокаСчета.Цена, Окр(СтрокаСчета.Сумма/СтрокаСчета.Количество,2));
				
				СтавкаНДС = СтрокаСчета.СтавкаНДС;
				СуммаНДС  = СтрокаСчета.СуммаНДС;
				
				Если ПодготовитьДанныеКПередачеВОФД Тогда
					Если ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита Тогда 
						// БИТ ЖКХ 05.02.2021
						//СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						//СуммаНДС  = 0;
						// БИТ ЖКХ 04.02.2021
						//СтавкаНДС = УчетНДСВызовСервераПовтИсп.РасчетнаяСтавкаНДС(ОплачиваемыйДокумент.СтавкаНДС);
						//СуммаНДС = СтрокаСчета.СуммаНДС;

					//ИначеЕсли ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная 
					//	ИЛИ ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная Тогда 
					//	
					//	СтавкаНДС = УчетНДСВызовСервераПовтИсп.РасчетнаяСтавкаНДС(ОплачиваемыйДокумент.СтавкаНДС);
					//	СуммаНДС = СтрокаСчета.СуммаНДС;
					КонецЕсли;
				КонецЕсли;
				
				Если флгВидНачисления и СтрокаСчета.ВидНачисления = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс Тогда
					// БИТ ЖКХ 10.02.2021
					СтрокаПозицииЧека.СтавкаНДС = неопределено;//Перечисления.СтавкиНДС.НДС20_120;
				Иначе
					СтрокаПозицииЧека.СтавкаНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДСдляККТ(СтавкаНДС, ЭтоВерсия105);
				КонецЕсли;
				
				СтрокаПозицииЧека.СуммаНДС  = СуммаНДС;
				
				СтрокаПозицииЧека.НомерСекции            = Реквизиты.НомерСекции;
				СтрокаПозицииЧека.НомерСтрокиТовара      = ОбщиеПараметры.ПозицииЧека.Количество()+1;
				
				// Определяем общего комитента по чеку для записи в шапку
				Если ЭтоВерсия105 Тогда
					Если ЗначениеЗаполнено(СтрокаСчета.ДоговорПлатежногоАгента)
						ИЛИ ЗначениеЗаполнено(СтрокаСчета.ПлатежныйАгент) Тогда
						// Комиссионная услуга - общего комитента по чеку указать нельзя.
						ЕстьОбщийКомитентПоЧеку = Ложь;
						
						РеквизитыАгента = РеквизитыПлатежногоАгента(СтрокаСчета.ДоговорПлатежногоАгента, СтрокаСчета.ПлатежныйАгент, Реквизиты.Дата);
						ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, РеквизитыАгента, "ДанныеАгента, ДанныеПоставщика, ПризнакАгентаПоПредметуРасчета");
						Если ЕстьОбщийПлатежныйАгентПоЧеку = Неопределено Тогда
							
							// Общего платежного агента нет и никогда не было
							ДоговорПлатежногоАгента       = СтрокаСчета.ДоговорПлатежногоАгента;
							ПлатежныйАгент                = СтрокаСчета.ПлатежныйАгент;
							ЕстьОбщийПлатежныйАгентПоЧеку = Истина;
							
						ИначеЕсли ЕстьОбщийПлатежныйАгентПоЧеку = Истина
							И ДоговорПлатежногоАгента <> СтрокаСчета.ДоговорПлатежногоАгента Тогда
							
							// Платежный агент по текущей строке не равен общему платежному агента
							ЕстьОбщийПлатежныйАгентПоЧеку = Ложь;
						КонецЕсли; 
					Иначе
						ЕстьОбщийПлатежныйАгентПоЧеку = Ложь;
						
						СведенияОКомитенте = СведенияОКомитентах[СтрокаСчета.Номенклатура];
						Если СведенияОКомитенте <> Неопределено Тогда
							// Комиссионный товар
							СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = Перечисления.ПризнакиАгента.Комиссионер;
							ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека.ДанныеПоставщика, СведенияОКомитенте);
							
							Если ЕстьОбщийКомитентПоЧеку = Неопределено Тогда
								
								// Общего комитента нет и никогда не было
								КомитентПоЧеку          = СведенияОКомитенте;
								ЕстьОбщийКомитентПоЧеку = Истина;
								
							ИначеЕсли ЕстьОбщийКомитентПоЧеку = Истина 
								И СведенияОКомитенте.Контрагент <> КомитентПоЧеку.Контрагент Тогда 
								
								// Комитент по строке не равен общему комитенту по чеку
								ЕстьОбщийКомитентПоЧеку = Ложь;
							КонецЕсли; 
						Иначе
							// Некомиссионный товар или услуга - общего комитента по чеку указать нельзя.
							ЕстьОбщийКомитентПоЧеку = Ложь;
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
				
				ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
				
				СуммаРасчетаПоЧеку = СуммаРасчетаПоЧеку + СтрокаСчета.Сумма;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Договор агента устанавливаем только если он совпадает в шапке и по строкам, или в шапке не задан а по строкам одинаковый.
	Если ЕстьОбщийПлатежныйАгентПоЧеку = Истина Тогда
		СтруктураРеквизитов = РеквизитыПлатежногоАгента(ДоговорПлатежногоАгента, ПлатежныйАгент, Реквизиты.Дата);
		ЗаполнитьЗначенияСвойств(ОбщиеПараметры, СтруктураРеквизитов, "ДанныеАгента, ДанныеПоставщика, ПризнакАгента");
	ИначеЕсли ЕстьОбщийКомитентПоЧеку = Истина Тогда 
		ОбщиеПараметры.ПризнакАгента = Перечисления.ПризнакиАгента.Комиссионер;
		ЗаполнитьЗначенияСвойств(ОбщиеПараметры.ДанныеПоставщика, КомитентПоЧеку);
	КонецЕсли; 
	
	Если Реквизиты.СуммаДокумента <> 0 Тогда
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", Реквизиты.ТипОплаты);
		СтрокаОплаты.Вставить("Сумма", Реквизиты.СуммаДокумента);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли; 
	
	Если СуммаРасчетаПоЧеку <> Реквизиты.СуммаДокумента Тогда
		// Для ФФД 1.0, документов без табличной части, а также случаев когда заплатили больше чем сумма по счетам добавляем служебную строку в чек 
		Если НЕ ЭтоВерсия105 ИЛИ Реквизиты.СуммаДокумента > СуммаРасчетаПоЧеку Тогда
			СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
			
			Если ЗначениеЗаполнено(Реквизиты.СтавкаНДС) Тогда
				СтавкаНДСПоУмолчанию = Реквизиты.СтавкаНДС;
			Иначе
				ЭтоПлательщикНДС     = УчетнаяПолитика.ПлательщикНДС(Реквизиты.Организация, Реквизиты.Дата);
				СтавкаНДСПоУмолчанию = УчетНДСКлиентСервер.СтавкаНДСПоУмолчанию(Реквизиты.Дата, ЭтоПлательщикНДС);
			КонецЕсли;
			
			СтавкаНДС = УчетНДСВызовСервераПовтИсп.РасчетнаяСтавкаНДС(СтавкаНДСПоУмолчанию);
			
			СтрокаПозицииЧека.Наименование      = Реквизиты.НаименованиеВСтрокеЧека;
			СтрокаПозицииЧека.Количество        = 1;
			СтрокаПозицииЧека.Цена              = Реквизиты.СуммаДокумента - СуммаРасчетаПоЧеку;
			СтрокаПозицииЧека.ЦенаСоСкидками    = Реквизиты.СуммаДокумента - СуммаРасчетаПоЧеку;
			СтрокаПозицииЧека.Сумма             = Реквизиты.СуммаДокумента - СуммаРасчетаПоЧеку;
			СтрокаПозицииЧека.СтавкаНДС         = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДСдляККТ(СтавкаНДС, ЭтоВерсия105);
			
			СуммаНДС  = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаПозицииЧека.Сумма, Истина, 
							УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
			
			СтрокаПозицииЧека.СуммаНДС          = Окр(СуммаНДС, 2);
			СтрокаПозицииЧека.НомерСекции       = Реквизиты.НомерСекции;
			СтрокаПозицииЧека.НомерСтрокиТовара = ОбщиеПараметры.ПозицииЧека.Количество()+1;
			
			СтрокаПозицииЧека.ПризнакСпособаРасчета  = ?(ЭтоВерсия105, Перечисления.ПризнакиСпособаРасчета.Аванс, Неопределено);
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ?(ЭтоВерсия105, Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата, Неопределено);
			
			ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
			
		Иначе
			Если СуммаПредоплатойПоЧеку > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Предоплата);
				СтрокаОплаты.Вставить("Сумма", СуммаПредоплатойПоЧеку);
				ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
			
			Если СуммаПостоплатойПоЧеку > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Постоплата);
				СтрокаОплаты.Вставить("Сумма", СуммаПостоплатойПоЧеку);
				ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщиеПараметры;
КонецФункции

Функция НовыйСведенияОКомитенте() Экспорт
	СведенияОКомитенте = МенеджерОборудованияКлиентСервер.ПараметрыДанныеПоставщика();
	
	СведенияОКомитенте.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	
	Возврат СведенияОКомитенте;
КонецФункции

Функция ПолучитьСведенияОКомитентах(СписокНоменклатуры, Организация, ДатаСведений) Экспорт
	Результат = Новый Соответствие;
	
	Если СписокНоменклатуры.Количество() = 0 
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ОсуществляетсяРеализацияТоваровУслугКомитентов") Тогда
		Возврат Результат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПоступлениеТоваровУслуг.Контрагент, Партия.Контрагент) КАК Комитент,
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	ЕСТЬNULL(ПоступлениеТоваровУслуг.Дата, Партия.Дата) КАК ДатаОперации
	|ПОМЕСТИТЬ ВТ_Комитенты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаСведений,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладе),
	|			&ВидыСубконто,
	|			Субконто1 В (&СписокНоменклатуры)
	|				И Организация = &Организация) КАК ХозрасчетныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ХозрасчетныйОстатки.Субконто2 = ПоступлениеТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Партия КАК Партия
	|		ПО ХозрасчетныйОстатки.Субконто2 = Партия.Ссылка
	|ГДЕ
	|	ХозрасчетныйОстатки.КоличествоОстаток > 0
	|	И (ХозрасчетныйОстатки.Субконто2 ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ ХозрасчетныйОстатки.Субконто2 ССЫЛКА Документ.Партия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Комитенты.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ВТ_Комитенты.ДатаОперации) КАК ДатаОперации
	|ПОМЕСТИТЬ ВТ_КомитентыПоДатам
	|ИЗ
	|	ВТ_Комитенты КАК ВТ_Комитенты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Комитенты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Комитенты.Комитент КАК Контрагент,
	|	ВТ_Комитенты.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Комитенты КАК ВТ_Комитенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомитентыПоДатам КАК КомитентыПоДатам
	|		ПО ВТ_Комитенты.Номенклатура = КомитентыПоДатам.Номенклатура
	|			И ВТ_Комитенты.ДатаОперации = КомитентыПоДатам.ДатаОперации
	|ГДЕ
	|	НЕ КомитентыПоДатам.Номенклатура ЕСТЬ NULL";
	
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	
	Запрос.УстановитьПараметр("ВидыСубконто",       ВидыСубконто);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("Организация",        Организация);
	Запрос.УстановитьПараметр("ДатаСведений",       ДатаСведений);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияОКомитенте = НовыйСведенияОКомитенте();
		
		ЗаполнитьЗначенияСвойств(СведенияОКомитенте, Выборка);
		ЗаполнитьЗначенияСвойств(СведенияОКомитенте, СведенияОКонтрагенте(Выборка.Контрагент, ДатаСведений));
		
		Результат.Вставить(Выборка.Номенклатура, СведенияОКомитенте);
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции

Функция РеквизитыПлатежногоАгента(ДоговорПлатежногоАгента, ПлатежныйАгент, ДатаСведений) Экспорт
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(ДоговорПлатежногоАгента) Тогда
		
		СписокПараметров = "ТелефонПлатежногоАгента, ТелефонОператораПоПриемуПлатежей, ТелефонОператораПеревода, 
			|ТелефонПоставщика, АдресОператораПеревода, ИННОператораПеревода, НаименованиеОператораПеревода, ОперацияПлатежногоАгента, ПризнакАгента, Владелец";
		
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорПлатежногоАгента, СписокПараметров);
		
		ДанныеАгента = МенеджерОборудованияКлиентСервер.ПараметрыДанныеАгента();
		
		ДанныеАгента.ПлатежныйАгент.Операция = СтруктураРеквизитов.ОперацияПлатежногоАгента;
		ДанныеАгента.ПлатежныйАгент.Телефон  = СтруктураРеквизитов.ТелефонПлатежногоАгента;
		
		ДанныеАгента.ОператорПеревода.Наименование = СтруктураРеквизитов.НаименованиеОператораПеревода;
		ДанныеАгента.ОператорПеревода.Телефон = СтруктураРеквизитов.ТелефонОператораПеревода;
		ДанныеАгента.ОператорПеревода.Адрес = СтруктураРеквизитов.АдресОператораПеревода;
		ДанныеАгента.ОператорПеревода.ИНН = СтруктураРеквизитов.ИННОператораПеревода;
		
		ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = СтруктураРеквизитов.ТелефонОператораПоПриемуПлатежей;
		
		Результат.Вставить("ДанныеАгента", ДанныеАгента);
		
		ДанныеПоставщика = МенеджерОборудованияКлиентСервер.ПараметрыДанныеПоставщика();
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СтруктураРеквизитов.Владелец, ДатаСведений);
		
		ДанныеПоставщика.Телефон      = СтруктураРеквизитов.ТелефонПоставщика;
		ДанныеПоставщика.Наименование = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
		ДанныеПоставщика.ИНН          = ИННКонтрагента(СведенияОбОрганизации);
		Результат.Вставить("ДанныеПоставщика", ДанныеПоставщика);
		
		ПризнакАгента = ?(ЗначениеЗаполнено(СтруктураРеквизитов.ПризнакАгента), СтруктураРеквизитов.ПризнакАгента, Перечисления.ПризнакиАгента.Агент);
		
		Результат.Вставить("ПризнакАгента", ПризнакАгента);
		Результат.Вставить("ПризнакАгентаПоПредметуРасчета", ПризнакАгента);
		
	ИначеЕсли ЗначениеЗаполнено(ПлатежныйАгент) Тогда
		
		Телефон = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(
			УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ПлатежныйАгент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
			
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ПлатежныйАгент, ДатаСведений);
		
		ДанныеАгента = МенеджерОборудованияКлиентСервер.ПараметрыДанныеАгента();
		ДанныеАгента.ПлатежныйАгент.Телефон           = Телефон;
		ДанныеАгента.ОператорПеревода.Наименование    = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
		ДанныеАгента.ОператорПеревода.Телефон         = Телефон;
		ДанныеАгента.ОператорПеревода.Адрес           = СведенияОбОрганизации.ЮридическийАдрес;
		ДанныеАгента.ОператорПеревода.ИНН             = ИННКонтрагента(СведенияОбОрганизации);
		ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = Телефон;
		Результат.Вставить("ДанныеАгента", ДанныеАгента);
		
		ДанныеПоставщика = МенеджерОборудованияКлиентСервер.ПараметрыДанныеПоставщика();
		ДанныеПоставщика.Телефон      = Телефон;
		ДанныеПоставщика.Наименование = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
		ДанныеПоставщика.ИНН          = ИННКонтрагента(СведенияОбОрганизации);
		Результат.Вставить("ДанныеПоставщика", ДанныеПоставщика);
		
		ПризнакАгента = Перечисления.ПризнакиАгента.ПлатежныйАгент;
		
		Результат.Вставить("ПризнакАгента", ПризнакАгента);
		Результат.Вставить("ПризнакАгентаПоПредметуРасчета", ПризнакАгента);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияОКонтрагенте(Контрагент, ДатаСведений) Экспорт
	СведенияОЮрФизЛице = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Контрагент, ДатаСведений);
	
	Результат = НовыйСведенияОКомитенте();
	
	Результат.Вставить("Контрагент",   Контрагент);
	
	Результат.Вставить("Наименование", СведенияОЮрФизЛице.НаименованиеДляПечатныхФорм);
	Результат.Вставить("Телефон",      СведенияОЮрФизЛице.Телефоны);
	Результат.Вставить("ИНН",          ИННКонтрагента(СведенияОЮрФизЛице));
	
	Возврат Результат;
КонецФункции

Функция ИННКонтрагента(СведенияОЮрФизЛице)
	Если НЕ ЗначениеЗаполнено(СведенияОЮрФизЛице.ИНН)
		И ЗначениеЗаполнено(СведенияОЮрФизЛице.СтранаРегистрации) 
		И СведенияОЮрФизЛице.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда 
		
		Возврат "000000000000";
	Иначе
		Возврат СведенияОЮрФизЛице.ИНН;
	КонецЕсли; 
КонецФункции
