
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		Отбор = Список.Отбор.Элементы;
		
		УсловиеОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ответственный");
		УсловиеОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		
		УсловиеОтбора.ПравоеЗначение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти