#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Правило = Новый Структура;
	
	Правило.Вставить("Период");
	Правило.Вставить("Организация");
	
	Поля = Метаданные.Справочники.НастройкиУчетаЗатрат.ТабличныеЧасти.ОсобыеПравилаРаспределения.Реквизиты;
	Для Каждого ОписаниеПоля Из Поля Цикл
		Правило.Вставить(ОписаниеПоля.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Правило, Параметры);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Правило);
	
	НастроитьОграниченияСчетовУчета();
	ПрименитьФункциональныеОпции();
	
	НастроитьМодификаторы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если БазаРаспределения <> Перечисления.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "СписокСтатейЗатрат");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура БазаРаспределенияПриИзменении(Элемент)
	
	НастроитьМодификаторы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БазаРаспределенияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если БазаРаспределения <> ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат") Тогда
		СписокСтатейЗатрат = Неопределено;
	ИначеЕсли БазаРаспределения <> ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.Выручка") Тогда
		СчетПрямыхЗатрат    = Неопределено;
		ПодразделениеЗатрат = Неопределено;
	КонецЕсли;
	
	Правило = НастройкиУчетаКлиент.ПоляПравилаРаспределения();
	ЗаполнитьЗначенияСвойств(Правило, ЭтотОбъект);
	
	Закрыть(Правило);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьОграниченияСчетовУчета()
	
	БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(
		Элементы.Счет,
		Справочники.НастройкиУчетаЗатрат.НастраиваемыеСчетаОсобыеПравилаРаспределения(),
		Неопределено,
		Неопределено,
		Неопределено);
	
	УчетПроизводства.ОграничитьВыборСчетамиПрямыхРасходов(Элементы.СчетПрямыхЗатрат);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьФункциональныеОпции()
	
	ЗначениеОпции = ПолучитьФункциональнуюОпцию("ВестиУчетЗатратПоПодразделениям");
	Элементы.Подразделение.Видимость       = ЗначениеОпции;
	Элементы.ПодразделениеЗатрат.Видимость = ЗначениеОпции;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьМодификаторы(Форма)
	
	ПоляМодификаторов = Новый Соответствие;
	
	ПоляМодификаторов.Вставить(
		ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.Выручка"),
		Форма.Элементы.МодификаторыВыручка);
	ПоляМодификаторов.Вставить(
		ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат"),
		Форма.Элементы.МодификаторыСписокПрямыхЗатрат);
	
	Для Каждого ОписаниеПоля Из ПоляМодификаторов Цикл
		ОписаниеПоля.Значение.Видимость = (Форма.БазаРаспределения = ОписаниеПоля.Ключ);
	КонецЦикла;
	
	Форма.КлючСохраненияПоложенияОкна = Форма.БазаРаспределения; // чтобы восстанавливался размер формы, соответствующий контенту
	
КонецПроцедуры

#КонецОбласти
