#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьЗаводскиеНомераСчетчиков() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_Счетчики.Ссылка,
	|	бит_Счетчики.Наименование
	|ИЗ
	|	Справочник.бит_Счетчики КАК бит_Счетчики
	|ГДЕ
	|	НЕ бит_Счетчики.ПометкаУдаления
	|	И бит_Счетчики.ЗаводскойСерийныйНомерПУ = """"
	|	И НЕ бит_Счетчики.Наименование = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Об = Выборка.Ссылка.ПолучитьОбъект();
			Об.ЗаводскойСерийныйНомерПУ = Выборка.Наименование;
			Об.Записать();
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаполнитьДатуПоверкиСчетчиков() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"   ,КонецДня(ТекущаяДата()));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_Счетчики.Ссылка КАК Счетчик
	|ПОМЕСТИТЬ ВТ_Счетчики
	|ИЗ
	|	Справочник.бит_Счетчики КАК бит_Счетчики
	|ГДЕ
	|	НЕ бит_Счетчики.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки
	|ИЗ
	|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(
	|			&Дата,
	|			Счетчик В
	|				(ВЫБРАТЬ
	|					ВТ_Счетчики.Счетчик
	|				ИЗ
	|					ВТ_Счетчики)) КАК бит_ПоверкаСчетчиковСрезПоследних
	|ГДЕ
	|	НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку";

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Об = Выборка.Счетчик.ПолучитьОбъект();
			Об.ДатаПоверки = Выборка.ДатаПоверки;
			Об.Записать();
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли