#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	бит_Счетчики.Наименование
		|ИЗ
		|	Справочник.бит_Счетчики КАК бит_Счетчики
		|ГДЕ
		|	бит_Счетчики.Наименование = &СерийныйНомер";
		
		Запрос.УстановитьПараметр("СерийныйНомер",Наименование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Счетчик с таким серийным номером уже зарегистрирован!");
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// БИТ_ЖКХ 22.12.2016 11:14:22 Начало правки...
	Если ЗначениеЗаполнено(ЗаводскойСерийныйНомерПУ) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	бит_Счетчики.ЗаводскойСерийныйНомерПУ
		|ИЗ
		|	Справочник.бит_Счетчики КАК бит_Счетчики
		|ГДЕ
		|	НЕ бит_Счетчики.Ссылка = &Ссылка
		|	И бит_Счетчики.ЗаводскойСерийныйНомерПУ = &ЗаводскойСерийныйНомерПУ";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ЗаводскойСерийныйНомерПУ", ЗаводскойСерийныйНомерПУ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Счетчик с таким заводской (серийный) номер прибора учета уже зарегистрирован!");
		КонецЕсли;
	КонецЕсли;
	// БИТ_ЖКХ 22.12.2016 11:14:22 Конец правки.
	
	Если ПустаяСтрока(Наименование) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнен серийный номер!");
		
		Отказ = Истина;
	Иначе
		
		// Проверим заполнение реквизитов шапки.
		// Укажем, что надо проверить:
		СтруктураРеквизитов = Новый Структура();
		СтруктураРеквизитов.Вставить("Разрядность");
		СтруктураРеквизитов.Вставить("ВидСчетчика");
		СтруктураРеквизитов.Вставить("ТипСчетчика");

		// Теперь вызовем общую процедуру проверки.
		бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ
		, "Проверка заполнения обязательных реквизитов элемента справочника ""Счетчики"".");
		
		// БИТ_ЖКХ 29.07.2010. 
		// Удалены закоментированые участки кода.			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли