#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// БИТ_ЖКХ 14.09.2016 17:00:39 Начало правки... 
	Если ДополнительныеСвойства.Свойство("Администрирование") Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 14.09.2016 17:00:41 Конец правки. 
	
	ЗаполнитьИД();
	
	Если Не ЭтоНовый() тогда
		Если  Наименование <> Ссылка.Наименование
			ИЛИ Сальдо <> Ссылка.Сальдо 
			ИЛИ Кредит <> Ссылка.Кредит
			// БИТ_ЖКХ 25.12.2015 17:02:32 Начало правки... 
			//ИЛИ ПолучательПлатежа <> Ссылка.ПолучательПлатежа
			// БИТ_ЖКХ 25.12.2015 17:02:35 Конец правки. 
			Тогда
			МассивДокументов = КритерииОтбора.бит_ДокументыПоШаблонуИзвещений.Найти(Ссылка);
			ЕстьПроведенныеДокументы = Ложь;
			
			Для каждого Документ из МассивДокументов Цикл
				
				ЕстьПроведенныеДокументы = Документ.Проведен;
				
				Если ЕстьПроведенныеДокументы тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьПроведенныеДокументы Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют документы, проведенные по шаблону извещений """ + Ссылка.Наименование + """.
				|Реквизиты ""Сальдо"", ""Кредит"", ""Получатель платежа"" не могут быть изменены.
				|Элемент не записан.");
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

Процедура ЗаполнитьИД() Экспорт
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
		
		ГСЧ = Новый ГенераторСлучайныхЧисел;
		Число = ГСЧ.СлучайноеЧисло(100000000,999999999);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	бит_ШаблоныИзвещений.Ссылка
		|ИЗ
		|	Справочник.бит_ШаблоныИзвещений КАК бит_ШаблоныИзвещений
		|ГДЕ
		|	бит_ШаблоныИзвещений.Идентификатор = &Идентификатор";
		Запрос.УстановитьПараметр("Идентификатор", Число);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			ЗаполнитьИД();
			
		Иначе
			Идентификатор = Формат(Число, "ЧГ=0") ;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли