#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мВидОтчета Экспорт;  // Хранит текущий вид отчета.

Перем мВыгрузка  Экспорт;  // Хранит формат выгрузки.

Перем мИмяФайла  Экспорт;  // Хранит имя Файла выгрузки.

Перем мПутьВыгрузки Экспорт; // Хранит путь выгрузки.

Перем мТаблицаОтчета Экспорт; // Хранит таблицу отчета.

Перем мСтруктураИтоговОтчета Экспорт; // Хранитт структуру итогов отчета.

Перем мАдресТаблицыВоВременномХранилище Экспорт; // Хранитт адрес таблицы во временном хранилище.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Процедура формирует данные для отчета.
//
Процедура СформироватьОтчет(ДокументРезультат,мВидОтчета) Экспорт
	
	Если мВидОтчета = "НачисленияПоЛС" Тогда
		СформироватьСведенияОНачислениях(ДокументРезультат,мВидОтчета);
	ИначеЕсли мВидОтчета = "СведенияОПРоживающих" Тогда
		СформироватьСведенияОПроживающих(ДокументРезультат,мВидОтчета);
	ИначеЕсли мВидОтчета = "ВыпадающиеДоходы" Тогда
		СформироватьОтчетОВыпадающихДоходах(ДокументРезультат,мВидОтчета);
	ИначеЕсли мВидОтчета = "РасшифровкаПоЛьготе" Тогда
		СформироватьОтчетРасшифровкаПоЛьготе(ДокументРезультат,мВидОтчета);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура выгружает таблицу в Excel или DBF.
//
Процедура Выгрузить(КодОрганизацииНастройка,ИмяФайлаНастройка,ФорматНастройка,ПутьДляВыгрузкиНастройка,ТаблицаО) Экспорт
	
	КодОрганизацииПоГЦЖС = КодОрганизацииНастройка;
	ИмяФайла = КодОрганизацииНастройка;
	Формат = ФорматНастройка;
	ПутьДляВыгрузки = ПутьДляВыгрузкиНастройка;
	
	мВыгрузка = ФорматНастройка;
	мПутьВыгрузки = ПутьДляВыгрузкиНастройка;
	мИмяФайла = ИмяФайлаНастройка;
	
	Если КодОрганизацииПоГЦЖС <> "" И ТаблицаО <> Неопределено Тогда
		
		ТаблицаО.ЗаполнитьЗначения(КодОрганизацииПоГЦЖС, "КодОрганизации"); 
		
	КонецЕсли;  
	
	Если мВыгрузка = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТаблицаО = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Перед выгрузкой сформеруйте отчет.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли; 
	
	Если мВыгрузка = "Excel" Тогда
		ВыгрузитьДанныеВExcel(ТаблицаО);
	ИначеЕсли мВыгрузка = "DBF" Тогда
		ВыгрузитьДанныеВDBF(ТаблицаО);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция формирует таблицу лицевых счетов и их свойств.
//
// Параметры
//    Нет.
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - Хранит список лицевых счетов и их свойства. 
//
Функция СформироватьТаблицуЛС()
	
	Если ПоВсемЛС Тогда
		Условие = "";
	Иначе
		Условие = "
		|				И ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						Таб.ЛицевойСчет
		|					ИЗ
		|						ЛицевыеСчета КАК Таб)";
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет
	|ПОМЕСТИТЬ ЛицевыеСчета
	|ИЗ
	|	РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&КонецПериода, ) КАК бит_ЛьготыПоЛССрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|			И бит_ЛьготыПоЛССрезПоследних.ФизЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ГДЕ
	|	(бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &КонецПериода
	|			ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1))
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	|	КоличествоЕдиницПоСчетчикамСрезПоследних.Счетчик,
	|	СУММА(КоличествоЕдиницПоСчетчикамСрезПоследних.КоличествоЕдиницПоЛС) КАК КоличествоЕдиницПоЛС,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПоСчетчикам,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПоЛС,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЛьготам,
	|   МАКСИМУМ(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПоОбщедомовымСчетчикам
	|ПОМЕСТИТЬ ВыборкаНачислений
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет.Организация = &Организация "+Условие+") КАК НачисленияПоУслугамЖКХОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_КолЕдПоСчетчикам.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК КоличествоЕдиницПоСчетчикамСрезПоследних
	|		ПО НачисленияПоУслугамЖКХОбороты.ЛицевойСчет = КоличествоЕдиницПоСчетчикамСрезПоследних.ЛицевойСчет
	|			И НачисленияПоУслугамЖКХОбороты.УслугаЖКХ = КоличествоЕдиницПоСчетчикамСрезПоследних.УслугаЖКХ
	|ГДЕ
	|	НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание.ТипУправляющейОрганизации = &ТипУО
	|
	|СГРУППИРОВАТЬ ПО
	|	КоличествоЕдиницПоСчетчикамСрезПоследних.Счетчик,
	|	НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыборкаНачислений.ЛицевойСчет,
	|	ВыборкаНачислений.Услуга,
	|	СУММА(ВыборкаНачислений.КоличествоЕдиницПоЛС) КАК КоличествоЕдиницПоЛС,
	|	МАКСИМУМ(ВыборкаНачислений.СуммаПоСчетчикам) КАК СуммаПоСчетчикам,
	|	МАКСИМУМ(ВыборкаНачислений.СуммаПоЛС) КАК СуммаПоЛС,
	|	МАКСИМУМ(ВыборкаНачислений.СуммаЛьготам) КАК СуммаЛьготам,
	|	МАКСИМУМ(ВыборкаНачислений.СуммаПоОбщедомовымСчетчикам) КАК СуммаПоОбщедомовымСчетчикам
	|ПОМЕСТИТЬ Начисления
	|ИЗ
	|	ВыборкаНачислений КАК ВыборкаНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыборкаНачислений.ЛицевойСчет,
	|	ВыборкаНачислений.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Начисления.ЛицевойСчет,
	|	Начисления.ЛицевойСчет.Наименование КАК НаименованиеЛС,
	|	Начисления.Услуга,	
	|	Начисления.КоличествоЕдиницПоЛС,
	// БИТ_ЖКХ 15.05.2017 14:59:44 Начало правки... 
	//|	Начисления.Услуга.Приоритет КАК Приоритет,
	|	Начисления.Услуга.ОбщедомовыеНачисления КАК ОбщедомовыеНачисления,
	// БИТ_ЖКХ 15.05.2017 14:59:45 Конец правки. 
	|	ЕСТЬNULL(Начисления.СуммаПоСчетчикам, 0) + ЕСТЬNULL(Начисления.СуммаПоЛС, 0) КАК Сумма,
	|	ЕСТЬNULL(Начисления.СуммаПоСчетчикам, 0) + ЕСТЬNULL(Начисления.СуммаПоЛС, 0) - ЕСТЬNULL(Начисления.СуммаЛьготам, 0) КАК СуммаБезЛьгот,
	|	ЕСТЬNULL(Начисления.СуммаПоОбщедомовымСчетчикам, 0) КАК СуммаОбщедомовых,
	|	СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	|	СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства,
	|	Начисления.ЛицевойСчет.Здание КАК Здание,
	|	Начисления.ЛицевойСчет.Квартира КАК Квартира,
	|	Начисления.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица
	|ИЗ
	|	Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК СведенияПоУслугамЛССрезПоследних
	|		ПО Начисления.ЛицевойСчет = СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|			И Начисления.Услуга = СведенияПоУслугамЛССрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК СведенияОКвартиреСрезПоследних
	|		ПО Начисления.ЛицевойСчет.Квартира = СведенияОКвартиреСрезПоследних.Квартира";
	
	Запрос.УстановитьПараметр("Организация"   , Организация);
	Запрос.УстановитьПараметр("ТипУО"         , УправляющаяОрганизация);
	Запрос.УстановитьПараметр("НачалоПериода" , НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода"  , КонецМесяца(КонецПериода));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // СформироватьТаблицуЛС()

// Процедура производит расчет долей по техобслуживанию и отоплению.
//
Процедура РасчетДолей(Выборка, СтруктураНорм, Льгота = Ложь)
	
	Факт   = 0;
	Норма  = 0;
	ДНорма = 0;
	СНорма = 0;
	
	СуммаНорма      = 0;
	СуммаДопНорма   = 0;
	СуммаСверхНорма = 0;
	
	// Расчет факта.
	Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
		Факт = Выборка.ОбщаяПлощадь;
	ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади Тогда
		Факт = Выборка.ОтапливаемаяПлощадь;
	ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
		Факт = Выборка.ЖилаяПлощадь;
	ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления Тогда
		Факт = Выборка.КоличествоЕдиницПотребления;
	ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда
		Факт = Выборка.КоличествоПроживающих;
	ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам Тогда
		Факт = Выборка.КоличествоЕдиницПоЛС; // ПоказанияСчетчиков(Выборка.ЛицевойСчет, Выборка.Услуга, Выборка.Здание, Выборка.Улица ,ТаблицаЛС);.
	ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
		Факт = Выборка.КоличествоЕдиницПотребления;
		// БИТ_ЖКХ добавление кода Начало: 18.07.2011 
	ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению Тогда
		Факт = Выборка.КоличествоЕдиницПоЛС; // ПоказанияСчетчиков(Выборка.ЛицевойСчет, Выборка.Услуга, Выборка.Здание, Выборка.Улица ,ТаблицаЛС);.
		// БИТ_ЖКХ добавление кода конец : 18.07.2011
		
	КонецЕсли;
	
	// Норма.
	Если Льгота Тогда
		
		Если Выборка.КоличествоПроживающих = 1 Тогда
			Норма = Выборка.НаОдного;
		ИначеЕсли Выборка.КоличествоПроживающих = 2 Тогда
			Норма = Выборка.НаДвоих * 2;
			// БИТ_ЖКХ изменение кода. Начало. 21.05.2012{{
		ИначеЕсли Выборка.КоличествоПроживающих = 3 Тогда
			Норма = Выборка.НаСемью * Выборка.КоличествоПроживающих;
		ИначеЕсли Выборка.КоличествоПроживающих = 4 Тогда
			Норма = Выборка.НаСемью4 * Выборка.КоличествоПроживающих;
		ИначеЕсли Выборка.КоличествоПроживающих = 5 Тогда
			Норма = Выборка.НаСемью5 * Выборка.КоличествоПроживающих;
		ИначеЕсли Выборка.КоличествоПроживающих > 5 Тогда
			Норма = Выборка.НаСемью6 * Выборка.КоличествоПроживающих;
			// БИТ_ЖКХ изменение кода. Конец. 21.05.2012}}
		КонецЕсли;
		
		Если Выборка.ИспользоватьДопНормуНаЛьготника Тогда
			
			Если Выборка.КоличествоПроживающих = 1 тогда
				ДНорма  = ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
			ИначеЕсли Выборка.КоличествоПроживающих = 2 тогда
				ДНорма  = Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;  
			ИначеЕсли Выборка.КоличествоПроживающих > 2 тогда
				ДНорма  = Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * Выборка.КоличествоПроживающих;  
			КонецЕсли;
			
		КонецЕсли; 
		
	Иначе
		
		Если Выборка.КоличествоПроживающих = 1 Тогда
			Норма = Выборка.НаОдного;
		ИначеЕсли Выборка.КоличествоПроживающих = 2 Тогда
			Норма = Выборка.НаДвоих * 2;
		ИначеЕсли Выборка.КоличествоПроживающих > 2 Тогда
			Норма = Выборка.НаСемью * Выборка.КоличествоПроживающих;
		КонецЕсли; 
		
		Если Выборка.КоличествоПроживающих = 1 тогда
			ДНорма  = ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
		ИначеЕсли Выборка.КоличествоПроживающих = 2 тогда
			ДНорма  = Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;  
		ИначеЕсли Выборка.КоличествоПроживающих > 2 тогда
			ДНорма  = Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * Выборка.КоличествоПроживающих;  
		КонецЕсли;
		
	КонецЕсли; 
	
	Норма = ?(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет, Выборка.КоличествоЕдиницПотребления, Норма);
	
	Норма  = ?(Норма >= Факт, Факт, Норма);
	
	ДНорма = ?(ДНорма >= (Факт - Норма),(Факт - Норма),ДНорма);  
	
	СНорма = ?(Норма + ДНорма >= Факт, 0, Факт - (Норма+ДНорма));
	
	ОбщНорма = Норма + ДНорма + СНорма;
	
	СуммаНорма      = ?(ОбщНорма = 0,0,(Выборка.Сумма* Норма)/ ОбщНорма);
	СуммаДопНорма   = ?(ОбщНорма = 0,0,(Выборка.Сумма* ДНорма)/ ОбщНорма);
	СуммаСверхНорма = ?(ОбщНорма = 0,0,(Выборка.Сумма* СНорма)/ ОбщНорма);
	
	СтруктураНорм.ОснНорма = СуммаНорма;
	СтруктураНорм.ДопНорма = СуммаДопНорма;
	СтруктураНорм.ОбщНорма = СуммаСверхНорма;
	
КонецПроцедуры

// Функция производит расчет долга лс.
//
// Параметры:
//  <ЛицевойСчет>  - <СправочникСсылка>. 
//                   Текущий лицевой счет для расчета долга.
//
// Возвращаемое значение:
//   <Число>   - <Суммадолга>.
//
Функция СуммаДолга(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОстатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(НачисленияПоУслугамЖКХОстатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0)
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	|			&ДатаНачала,
	|			ЛицевойСчет = &ЛицевойСчет) КАК НачисленияПоУслугамЖКХОстатки,
	|	(ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|					КОНЕЦ < 0
	|					ТОГДА ВЫБОР
	|							КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|								ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|						КОНЕЦ * -1
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|					КОНЕЦ
	|			КОНЕЦ) КАК Оплата
	|	ИЗ
	|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|				&ДатаНачала,
	|				&ДатаКонца,
	|				Регистратор,
	|				ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты) КАК ТаблицаОплаты";
	
	Запрос.УстановитьПараметр("ДатаНачала"  , НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("ДатаКонца"   , КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Долг = Результат.Получить(Результат.Количество()-1).Долг;
		
	Иначе
		
		Долг = 0;
		
	КонецЕсли;
	
	Возврат Долг;
	
КонецФункции // ()

// Функция получает имя руководителя.
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//  <Параметр2>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>.
//
Функция ПолучитьИмяРуководителя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|				ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|		КОНЕЦ) КАК Руководитель,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница";
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Результат = Запрос.Выполнить().Выгрузить();
		Возврат Результат[0].Руководитель;
		
	Иначе
		
		Возврат "Руководитель не назначен";
		
	КонецЕсли; 
	
КонецФункции // ()

// Функция получает количество месяцев долга.
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//  <Параметр2>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>.
//
Функция ПолучитьКолМесяцевДолга(СуммаДолга, ЛицевойСчет)
	
	Если СуммаДолга = 0 Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_НачислениеПоЛицевымСчетам.Ссылка,
	|	бит_НачислениеПоЛицевымСчетам.Дата КАК Дата
	|ИЗ
	|	Документ.бит_НачислениеПоЛицевымСчетам КАК бит_НачислениеПоЛицевымСчетам
	|ГДЕ
	|	бит_НачислениеПоЛицевымСчетам.Дата < &НачалоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(КонецПериода));
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Результат = Запрос.Выполнить().Выгрузить();
		ДатаДокумента = Результат[0].Дата;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВЫБОР
	|					КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|						ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|						ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ, 0) > 0
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|							ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ + ВЫБОР
	|						КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|							ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ + ВЫБОР
	|						КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|							ТОГДА НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНачислений
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК НачисленияПоУслугамЖКХОбороты";
	Запрос.УстановитьПараметр("НачалоПериода" , НачалоМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("КонецПериода"  , КонецМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("ЛицевойСчет"   , ЛицевойСчет);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Результат = Запрос.Выполнить().Выгрузить();
		СуммаНачислений = Результат[0].СуммаНачислений;
		
		Если СуммаНачислений <> 0 Тогда
			КолМесяцев = Окр(СуммаДолга/Результат[0].СуммаНачислений);
		Иначе
			Возврат 0;
		КонецЕсли; 
		
		Возврат КолМесяцев;
		
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции // ()

// Процедура формирует отчет Сведения о Начисленийх.
//
Процедура СформироватьСведенияОНачислениях(ДокументРезультат,мВидОтчета)
	
	ТаблицаЛС = СформироватьТаблицуЛС();
	
	Если ТаблицаЛС.Количество() = 0 Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По заданным настройкам не было начислений.");
		
		Возврат;
		
	КонецЕсли;
	
	мТаблицаОтчета         = СформироватьТаблицуДанных();
	мСтруктураИтоговОтчета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.НаименованиеЛС,
	|	ТаблицаЛС.Услуга,
	|	ТаблицаЛС.ОбщедомовыеНачисления,
	|	ТаблицаЛС.Сумма,
	|	ТаблицаЛС.СуммаОбщедомовых,
	|	ТаблицаЛС.Здание,
	|	ТаблицаЛС.Квартира,
	|	ТаблицаЛС.Улица,
	|	ТаблицаЛС.СпособРасчета,
	|	ТаблицаЛС.ОбщаяПлощадь,
	|	ТаблицаЛС.ТипКвартиры,
	|	ТаблицаЛС.СтатусКвартиры,
	|	ТаблицаЛС.РежимПотребления,
	|	ТаблицаЛС.ОтапливаемаяПлощадь,
	|	ТаблицаЛС.ЖилаяПлощадь,
	|	ТаблицаЛС.КоличествоЕдиницПотребления,
	|	ТаблицаЛС.КоличествоЕдиницПоЛС,
	|	ТаблицаЛС.Поставщик,
	|	ТаблицаЛС.ТипПлиты,
	|	ТаблицаЛС.ТипЗапирающегоУстройства,
	|	ТаблицаЛС.СуммаБезЛьгот
	|ПОМЕСТИТЬ ИнформацияПоЛС
	|ИЗ
	|	&ТаблицаЛС КАК ТаблицаЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	КОЛИЧЕСТВО(ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КоличествоПроживающих,
	|	ОтветсвеноеЛицо.ФизЛицо КАК ОтветсвенноеЛицо,
	|	КОЛИЧЕСТВО(ВЫБОР
	|			КОГДА ПроживающиеПоЛССрезПоследних.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация)
	|				ТОГДА ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		КОНЕЦ) КАК КоличествоПостоянноПроживающих
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ДатаСнятияСРегистрации > &КонецПериода
	|				ИЛИ ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|			бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|		ИЗ
	|			РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ГДЕ
	|			(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|					ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|			И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|			бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ОтветсвеноеЛицо
	|		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет = ОтветсвеноеЛицо.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	ОтветсвеноеЛицо.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнформацияПоЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ИнформацияПоЛС.НаименованиеЛС КАК НаименованиеЛС,
	|	ИнформацияПоЛС.Услуга,
	|	ИнформацияПоЛС.ОбщедомовыеНачисления,
	|	ЕСТЬNULL(ИнформацияПоЛС.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ИнформацияПоЛС.СуммаОбщедомовых, 0) КАК СуммаОбщедомовых,
	|	ИнформацияПоЛС.Здание КАК Здание,
	|	ИнформацияПоЛС.Здание.ТипЖилФонда КАК ТипЖилФонда,
	|	ИнформацияПоЛС.Квартира КАК Квартира,
	|	ИнформацияПоЛС.Улица КАК Улица,
	|	ИнформацияПоЛС.СпособРасчета,
	|	ИнформацияПоЛС.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ИнформацияПоЛС.ТипКвартиры,
	|	ИнформацияПоЛС.СтатусКвартиры КАК СтатусКвартиры,
	|	ИнформацияПоЛС.РежимПотребления,
	|	ИнформацияПоЛС.ОтапливаемаяПлощадь,
	|	ИнформацияПоЛС.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	ЕСТЬNULL(ИнформацияПоЛС.КоличествоЕдиницПотребления, 0) КАК КоличествоЕдиницПотребления,
	|	ЕСТЬNULL(ИнформацияПоЛС.КоличествоЕдиницПоЛС, 0) КАК КоличествоЕдиницПоЛС,
	|	ИнформацияПоЛС.Поставщик,
	|	ИнформацияПоЛС.ТипПлиты КАК ТипПлиты,
	|	ИнформацияПоЛС.ТипЗапирающегоУстройства КАК ТипЗапирающегоУстройства,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(Проживающие.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
	|	Проживающие.ОтветсвенноеЛицо КАК ОтветсвенноеЛицо,
	|	ЕСТЬNULL(Проживающие.КоличествоПостоянноПроживающих, 0) КАК КоличествоПостоянноПроживающих,
	|	ЕСТЬNULL(СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	|	ЕСТЬNULL(СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка, 0) КАК СверхНормативнаяСтавка,
	|	ЕСТЬNULL(НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	ЕСТЬNULL(ИнформацияПоЛС.СуммаБезЛьгот, 0) КАК СуммаБезЛьгот
	|ИЗ
	|	ИнформацияПоЛС КАК ИнформацияПоЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&КонецПериода, ) КАК НормыНаУслугиСрезПоследних
	|		ПО ИнформацияПоЛС.Услуга = НормыНаУслугиСрезПоследних.Услуга
	|			И ИнформацияПоЛС.СпособРасчета = НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И ИнформацияПоЛС.ТипКвартиры = НормыНаУслугиСрезПоследних.ТипКвартиры
	|			И ИнформацияПоЛС.СтатусКвартиры = НормыНаУслугиСрезПоследних.СтатусКвартиры
	|			И ИнформацияПоЛС.РежимПотребления = НормыНаУслугиСрезПоследних.РежимПотребления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&КонецПериода, ) КАК СтавкиНаУслугиСрезПоследних
	|		ПО ИнформацияПоЛС.Услуга = СтавкиНаУслугиСрезПоследних.Услуга
	|			И ИнформацияПоЛС.СпособРасчета = СтавкиНаУслугиСрезПоследних.СпособРасчета
	|			И ИнформацияПоЛС.Поставщик = СтавкиНаУслугиСрезПоследних.Поставщик
	|			И ИнформацияПоЛС.ТипКвартиры = СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|			И ИнформацияПоЛС.СтатусКвартиры = СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|			И ИнформацияПоЛС.РежимПотребления = СтавкиНаУслугиСрезПоследних.РежимПотребления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО ИнформацияПоЛС.ЛицевойСчет = Проживающие.ЛицевойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеЛС
	|ИТОГИ
	|	СУММА(Сумма),
	|	МАКСИМУМ(Здание),
	|	МАКСИМУМ(ТипЖилФонда),
	|	МАКСИМУМ(Квартира),
	|	МАКСИМУМ(Улица),
	|	МАКСИМУМ(ОбщаяПлощадь),
	|	МАКСИМУМ(ЖилаяПлощадь),
	|	МАКСИМУМ(ТипПлиты),
	|	МАКСИМУМ(ТипЗапирающегоУстройства),
	|	МАКСИМУМ(КоличествоПроживающих),
	|	МАКСИМУМ(ОтветсвенноеЛицо),
	|	МАКСИМУМ(СтатусКвартиры),
	|	МАКСИМУМ(КоличествоПостоянноПроживающих),
	|	СУММА(СуммаБезЛьгот)
	|ПО
	|	Здание,
	|	ЛицевойСчет";
	Запрос.УстановитьПараметр("ТаблицаЛС"     , ТаблицаЛС);
	Запрос.УстановитьПараметр("НачалоПериода" , НачалоДня(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода"  , КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация"   , Организация);
	
	СтруктураНорм = Новый Структура;
	СтруктураНорм.Вставить("ОснНорма",0);
	СтруктураНорм.Вставить("ДопНорма",0);
	СтруктураНорм.Вставить("ОбщНорма",0);
	
	ВыборкаЗдание = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = ПолучитьМакет("НачисленияЛС");
	
	Шапка         = Макет.ПолучитьОбласть("ШапкаОтчета");
	ШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	СтрокаАдрес   = Макет.ПолучитьОбласть("СтрокаАдрес");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Итог          = Макет.ПолучитьОбласть("Итог");
	Подвал        = Макет.ПолучитьОбласть("Подвал");
	
	Период = Строка(Формат(НачалоМесяца(КонецПериода), "ДЛФ=DD")) +" - "+ Строка(Формат(КонецМесяца(КонецПериода), "ДЛФ=DD"));
	
	Шапка.Параметры.Период      = Период;
	Шапка.Параметры.Организация = Организация;
	Шапка.Параметры.ТПО         = УправляющаяОрганизация;
	
	ПоОбщейПлощади                      = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади;
	ПоЕдиницамПотребленияНаЛицевойСчет = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет;
	ПоЕдиницамПотребления               = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления;
	ПоЖилойПлощади                      = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади;
	ПоОтапливаемойПлощади               = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади;
	РасчетПоСчетчикам                   = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам;
	ПоПроживающим                       = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим;
	
	ДокументРезультат.Вывести(Шапка);
	ДокументРезультат.Вывести(ШапкаТаблицы);
	
	// БИТ_ЖКХ 27.05.2014
	мКоличествоПостоянноПроживающих = 0;	
	мКоличествоПроживающих = 0;
	мКоличествоНеПроживающих= 0;	
	// БИТ_ЖКХ 27.05.2014
	
	Пока ВыборкаЗдание.Следующий() Цикл
		
		Адрес = Строка(ВыборкаЗдание.Улица) + ", д." + Строка(ВыборкаЗдание.Здание) ;
		СтрокаАдрес.Параметры.Адрес = Адрес;
		
		ДокументРезультат.Вывести(СтрокаАдрес);
		
		НомерПП = 0;
		ВыборкаЛС = ВыборкаЗдание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЛС.Следующий() Цикл
			
			// БИТ_ЖКХ 27.05.2014
			мКоличествоПостоянноПроживающих = 0;	
			мКоличествоПроживающих = 0;
			мКоличествоНеПроживающих= 0;	
			// БИТ_ЖКХ 27.05.2014
			
			НомерПП = НомерПП + 1;
			
			СтрокаТаблицы.Параметры.НомерПП                 = НомерПП;
			СтрокаТаблицы.Параметры.НомерЛС                 = Строка(ВыборкаЛС.ЛицевойСчет) + ", кв." + Строка(ВыборкаЛС.Квартира);
			СтрокаТаблицы.Параметры.ФИО                     = ВыборкаЛС.ОтветсвенноеЛицо;
			
			// БИТ_ЖКХ 27.05.2014
			СтрокаТаблицы.Параметры.КолвоПроживающих          = 0;
			
			Запрос2 = Новый Запрос;
			
			Запрос2.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
			|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
			|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
			|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
			|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
			|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
			|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
			|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
			|	ПроживающиеПоЛССрезПоследних.ДоляПлощади,
			|	ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
			|ГДЕ
			|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
			|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
			
			// БИТ_ЖКХ 06.08.2014
			// Запрос2.УстановитьПараметр("Момент"		, КонецПериода);.
			Запрос2.УстановитьПараметр("Момент"		, КонецМесяца(КонецПериода));
			// БИТ_ЖКХ 06.08.2014
			
			Запрос2.УстановитьПараметр("ЛицевойСчет"	, ВыборкаЛС.ЛицевойСчет);
			Выборка2 = Запрос2.Выполнить().Выбрать();
			
			Пока Выборка2.Следующий() Цикл 
				
				СтатусФизЛица    = Выборка2.СтатусФизЛица; 
				
				// БИТ_ЖКХ 21.05.2014
				Если Выборка2.СтатусПроживания <> ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
					
					мКоличествоПроживающих = мКоличествоПроживающих + 1; 
					
				КонецЕсли;
				// БИТ_ЖКХ 21.05.2014
				
				СтрокаТаблицы.Параметры.КолвоЗарегистрированных = мКоличествоПроживающих;
				
				Если СтатусФизЛица.ПроживаниеВДанныйМомент и НЕ СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан") тогда
					
					мКоличествоПостоянноПроживающих = мКоличествоПостоянноПроживающих +1;
					
					СтрокаТаблицы.Параметры.КолвоПроживающих          = мКоличествоПостоянноПроживающих;
				КонецЕсли;		
				
				Если НЕ СтатусФизЛица.ПроживаниеВДанныйМомент и НЕ СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан") тогда	
					
					// БИТ_ЖКХ 21.05.2014
					Если Выборка2.СтатусПроживания <> ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
						мКоличествоНеПроживающих = мКоличествоНеПроживающих +1;
					КонецЕсли;			
					// БИТ_ЖКХ 21.05.2014
					
					СтрокаТаблицы.Параметры.КолвоНеПроживающих   = мКоличествоНеПроживающих;
				КонецЕсли;			
				
				Если мКоличествоНеПроживающих <> СтрокаТаблицы.Параметры.КолвоНеПроживающих Тогда
					
					СтрокаТаблицы.Параметры.КолвоНеПроживающих   = мКоличествоНеПроживающих;
					
				КонецЕсли;	
				
			КонецЦикла;		
			// БИТ_ЖКХ 27.05.2014					
			
			СтрокаТаблицы.Параметры.ОбщаяПлощадь            = ВыборкаЛС.ОбщаяПлощадь;
			СтрокаТаблицы.Параметры.ЖилаяПлощадь            = ВыборкаЛС.ЖилаяПлощадь;
			СтрокаТаблицы.Параметры.ТипЗУ                   = ВыборкаЛС.ТипЗапирающегоУстройства;
			СтрокаТаблицы.Параметры.ТипПлиты                = ВыборкаЛС.ТипПлиты;
			СтрокаТаблицы.Параметры.ОбщаяПлощадь            = ВыборкаЛС.ОбщаяПлощадь;
			
			// Переменные для посчета сумму по графам ГЦЖС.
			Водопровод            = 0;
			ВывозБытовыхОтходов   = 0;
			Газ                   = 0;
			ГорячееВодоснобжение  = 0;
			ПлатаЗаНайм           = 0;
			Электроэнергия        = 0;
			Техобслуживание       = 0;
			Отопление             = 0;
			ХолодноеВодоснабжение = 0;
			// БИТ ЖКХ 20.04.2021
			ХолодноеВодоснабжениеДляГВС = 0;

			
			// Переменные для расчета долей. 
			ОбщТО = 0;
			ДопТО = 0;
			ОснТО = 0;
			
			ОбщОТПЛ = 0;
			ДопОТПЛ = 0;
			ОснОТПЛ = 0;
			
			
			//// Переменные для выгрузки{.
			
			// Ставки.
			ВЫГРУЗКА_СтавкаТОПоОбщейПлощади = 0;
			ВЫГРУЗКА_СтавкаТОПоПроживающим  = 0;
			ВЫГРУЗКА_СтавкаНайм             = 0;
			ВЫГРУЗКА_СтавкаОтопление        = 0;
			// БИТ ЖКХ 20.04.2021
			ВЫГРУЗКА_СтавкаХолВодаДляГВС    = 0;
			ВЫГРУЗКА_СтавкаХолВода          = 0;
			ВЫГРУЗКА_СтавкаГорВода          = 0;
			ВЫГРУЗКА_СтавкаВодоотвод        = 0;
			ВЫГРУЗКА_СтавкаГаз              = 0;
			ВЫГРУЗКА_СтавкаЭлектроэнергия   = 0;
			// БИТ_ЖКХ 09.02.2016 14:51:34 Начало правки... 
			ВЫГРУЗКА_СтавкаКапРемонт		= 0;
			// БИТ_ЖКХ 09.02.2016 14:51:36 Конец правки. 
			// БИТ_ЖКХ 15.05.2017 15:08:43 Начало правки...
			ВЫГРУЗКА_СтавкаЭлектроэнергияОДН	= 0;
			ВЫГРУЗКА_СтавкаХолВодаОДН			= 0;
			ВЫГРУЗКА_СтавкаХВСдляГВСОДН			= 0;
			ВЫГРУЗКА_СтавкаВодоотводОДН			= 0;
			ВЫГРУЗКА_СтавкаПодогревОДН			= 0;
			// БИТ_ЖКХ 15.05.2017 15:08:43 Конец правки.
			
			// Начисления.
			ВЫГРУЗКА_ТОПоОбщейПлощади = 0;
			ВЫГРУЗКА_ТОПоПроживающим  = 0;
			ВЫГРУЗКА_Найм             = 0;
			ВЫГРУЗКА_Отопление        = 0;
			// БИТ ЖКХ 26.11.2020
			ВЫГРУЗКА_ОтоплениеОбщедомовое = 0;

			ВЫГРУЗКА_ХолВода          = 0;
			// БИТ ЖКХ 20.04.2021
			ВЫГРУЗКА_ХолВодаДляГВС    = 0;
			ВЫГРУЗКА_ГорВода          = 0;
			ВЫГРУЗКА_Водоотвод        = 0;
			ВЫГРУЗКА_Газ              = 0;
			ВЫГРУЗКА_Электроэнергия   = 0;
			// БИТ_ЖКХ 09.02.2016 14:51:57 Начало правки...
			ВЫГРУЗКА_КапРемонт        = 0;
			// БИТ_ЖКХ 09.02.2016 14:51:58 Конец правки. 
			// БИТ_ЖКХ 15.05.2017 15:08:57 Начало правки...
			ВЫГРУЗКА_ЭлектроэнергияОДН	= 0;
			ВЫГРУЗКА_ХолВодаОДН			= 0;
			ВЫГРУЗКА_ХВСдляГВСОДН		= 0;
			ВЫГРУЗКА_ВодоотводОДН		= 0;
			ВЫГРУЗКА_ПодогревОДН		= 0;
			// БИТ_ЖКХ 15.05.2017 15:08:57 Конец правки. 
			
			// Нормы.
			ВЫГРУЗКА_НормаГорВода        = 0;
			ВЫГРУЗКА_НормаХолВода        = 0;
			// БИТ ЖКХ 20.04.2021
			ВЫГРУЗКА_НормаХолВодаДляГВС  = 0;
			ВЫГРУЗКА_НормаВодоотвод      = 0;
			ВЫГРУЗКА_НормаГаз            = 0;
			ВЫГРУЗКА_НормаЭлектроэнергия = 0;
			
			// Признаки наличия счетчиков.
			ВЫГРУЗКА_СЧ_ГорВода       = 0;
			// БИТ ЖКХ 20.04.2021
			ВЫГРУЗКА_СЧ_ХолВодаДляГВС = 0;
			ВЫГРУЗКА_СЧ_ХолВода       = 0;
			ВЫГРУЗКА_СЧ_Водоотвод     = 0;
			ВЫГРУЗКА_СЧ_Газ           = 0;
			// }Переменные для выгрузки;.
			
		    ВЫГРУЗКА_БытОтходы	      = 0;
			ВЫГРУЗКА_СтавкаБытОтходы  = 0;
			ВЫГРУЗКА_НормаБытОтходы   = 0;
			
			Итого         = 0;
			ИтогоБезЛьгот = 0;
			
			Выборка = ВыборкаЛС.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.Услуга.ГрафаОтчетаГЦЖС) Тогда
					
					Итого         = Итого + Выборка.Сумма;
					ИтогоБезЛьгот = ИтогоБезЛьгот + Выборка.СуммаБезЛьгот
					
				КонецЕсли; 								
								
				
				Если Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда
					
					// БИТ_ЖКХ 15.05.2017 16:04:41 Начало правки...
					Если Выборка.ОбщедомовыеНачисления Тогда
						ВЫГРУЗКА_ВодоотводОДН		= ВЫГРУЗКА_ВодоотводОДН + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаВодоотводОДН	= ВЫГРУЗКА_СтавкаВодоотводОДН + Выборка.ОсновнаяСтавка;
					Иначе	
						Водопровод               = Водопровод + Выборка.Сумма;
						ВЫГРУЗКА_Водоотвод       = ВЫГРУЗКА_Водоотвод + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаВодоотвод = ВЫГРУЗКА_СтавкаВодоотвод + Выборка.ОсновнаяСтавка;
						ВЫГРУЗКА_НормаВодоотвод = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, Выборка.НаОдного,ВЫГРУЗКА_НормаВодоотвод);
					КонецЕсли;
					ВЫГРУЗКА_СЧ_Водоотвод    = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, 1,0);
					// БИТ_ЖКХ 15.05.2017 16:04:41 Конец правки.
					
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда
					
					ВывозБытовыхОтходов = ВывозБытовыхОтходов + Выборка.Сумма;
					ВЫГРУЗКА_БытОтходы	= ВЫГРУЗКА_БытОтходы + Выборка.Сумма;
					ВЫГРУЗКА_СтавкаБытОтходы	= ВЫГРУЗКА_СтавкаБытОтходы + Выборка.ОсновнаяСтавка;    					
					ВЫГРУЗКА_НормаБытОтходы = ?(Выборка.СпособРасчета = ПоПроживающим, ПолучитьНормуНаПроживающих(Выборка),ВЫГРУЗКА_НормаБытОтходы);
					
				// БИТ_ЖКХ 15.05.2017 16:09:16 Начало правки...
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение	Тогда
					
					// БИТ_ЖКХ 15.05.2017 16:16:51 Начало правки...
					Если Выборка.ОбщедомовыеНачисления Тогда
						ВЫГРУЗКА_ХолВодаОДН			= ВЫГРУЗКА_ХолВодаОДН + Выборка.Сумма;	
						ВЫГРУЗКА_СтавкаХолВодаОДН	= ВЫГРУЗКА_СтавкаХолВодаОДН + Выборка.ОсновнаяСтавка;
					Иначе
						ХолодноеВодоснабжение = ХолодноеВодоснабжение + Выборка.Сумма;
						ВЫГРУЗКА_ХолВода       = ВЫГРУЗКА_ХолВода + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаХолВода = ВЫГРУЗКА_СтавкаХолВода + Выборка.ОсновнаяСтавка;
						ВЫГРУЗКА_НормаХолВода = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, Выборка.НаОдного,ВЫГРУЗКА_НормаХолВода);
					КонецЕсли;
					ВЫГРУЗКА_СЧ_ХолВода    = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, 1,0);
					// БИТ_ЖКХ 15.05.2017 16:16:51 Конец правки.
						
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС	Тогда
					
					// БИТ_ЖКХ 15.05.2017 16:16:48 Начало правки...
					Если Выборка.ОбщедомовыеНачисления Тогда
						ВЫГРУЗКА_ХВСдляГВСОДН		= ВЫГРУЗКА_ХВСдляГВСОДН + Выборка.Сумма;	
						ВЫГРУЗКА_СтавкаХВСдляГВСОДН	= ВЫГРУЗКА_СтавкаХВСдляГВСОДН + Выборка.ОсновнаяСтавка;
					Иначе
						// БИТ ЖКХ 20.04.2021   
						ХолодноеВодоснабжениеДляГВС = ХолодноеВодоснабжениеДляГВС + Выборка.Сумма;
						ВЫГРУЗКА_ХолВодаДляГВС = ВЫГРУЗКА_ХолВодаДляГВС + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаХолВодаДляГВС = ВЫГРУЗКА_СтавкаХолВодаДляГВС + Выборка.ОсновнаяСтавка;
						ВЫГРУЗКА_НормаХолВодаДляГВС = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, Выборка.НаОдного,ВЫГРУЗКА_НормаХолВодаДляГВС);

						//ВЫГРУЗКА_ХолВода       = ВЫГРУЗКА_ХолВода + Выборка.Сумма;
						//ВЫГРУЗКА_СтавкаХолВода = ВЫГРУЗКА_СтавкаХолВода + Выборка.ОсновнаяСтавка;
						//ВЫГРУЗКА_НормаХолВода = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, Выборка.НаОдного,ВЫГРУЗКА_НормаХолВода);
					КонецЕсли;
					// БИТ ЖКХ 20.04.2021
					ВЫГРУЗКА_СЧ_ХолВодаДляГВС = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, 1,0);
					//ВЫГРУЗКА_СЧ_ХолВода    = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, 1,0);
					// БИТ_ЖКХ 15.05.2017 16:16:48 Конец правки.
					
				// БИТ_ЖКХ 15.05.2017 16:09:16 Конец правки.	
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда
					
					Газ             = Газ + Выборка.Сумма;
					
					ВЫГРУЗКА_Газ       = ВЫГРУЗКА_Газ + Выборка.Сумма;
					ВЫГРУЗКА_СЧ_Газ    = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, 1,0);
					ВЫГРУЗКА_СтавкаГаз = ВЫГРУЗКА_СтавкаГаз + Выборка.ОсновнаяСтавка;
					
					ВЫГРУЗКА_НормаГаз = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, Выборка.НаОдного,ВЫГРУЗКА_НормаГаз);
					
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда
					
					// БИТ_ЖКХ 15.05.2017 16:25:14 Начало правки...
					Если Выборка.ОбщедомовыеНачисления Тогда
						ВЫГРУЗКА_ПодогревОДН		= ВЫГРУЗКА_ПодогревОДН + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаПодогревОДН	= ВЫГРУЗКА_СтавкаПодогревОДН + Выборка.ОсновнаяСтавка;
					Иначе	
						ГорячееВодоснобжение   = ГорячееВодоснобжение + Выборка.Сумма;
						ВЫГРУЗКА_ГорВода       = ВЫГРУЗКА_ГорВода + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаГорВода = ВЫГРУЗКА_СтавкаГорВода + Выборка.ОсновнаяСтавка;
						ВЫГРУЗКА_НормаГорВода = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, Выборка.НаОдного,ВЫГРУЗКА_НормаГорВода);
					КонецЕсли;
					ВЫГРУЗКА_СЧ_ГорВода    = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, 1,0);
					// БИТ_ЖКХ 15.05.2017 16:25:14 Конец правки. 
					
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда
					
					ПлатаЗаНайм   = ПлатаЗаНайм + Выборка.Сумма;
					
					ВЫГРУЗКА_Найм       = ВЫГРУЗКА_Найм + Выборка.Сумма;
					ВЫГРУЗКА_СтавкаНайм = ВЫГРУЗКА_СтавкаНайм + Выборка.ОсновнаяСтавка;
					
				// БИТ_ЖКХ 09.02.2016 14:55:28 Начало правки...
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда
					
					ВЫГРУЗКА_КапРемонт       = ВЫГРУЗКА_КапРемонт + Выборка.Сумма;
					ВЫГРУЗКА_СтавкаКапРемонт = ВЫГРУЗКА_СтавкаКапРемонт + Выборка.ОсновнаяСтавка;

				// БИТ_ЖКХ 09.02.2016 14:55:28 Конец правки.	
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда
					
					// БИТ_ЖКХ 15.05.2017 16:37:34 Начало правки...
					Если Выборка.ОбщедомовыеНачисления Тогда
						ВЫГРУЗКА_ЭлектроэнергияОДН			= ВЫГРУЗКА_ЭлектроэнергияОДН + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаЭлектроэнергияОДН	= ВЫГРУЗКА_СтавкаЭлектроэнергияОДН + Выборка.ОсновнаяСтавка;
					Иначе	
						Электроэнергия = Электроэнергия + Выборка.Сумма;
						ВЫГРУЗКА_Электроэнергия       = ВЫГРУЗКА_Электроэнергия + Выборка.Сумма;
						ВЫГРУЗКА_СтавкаЭлектроэнергия = ВЫГРУЗКА_СтавкаЭлектроэнергия + Выборка.ОсновнаяСтавка;
						ВЫГРУЗКА_НормаЭлектроэнергия = ?(Выборка.СпособРасчета = РасчетПоСчетчикам, Выборка.НаОдного,ВЫГРУЗКА_НормаЭлектроэнергия);
					КонецЕсли;
					// БИТ_ЖКХ 15.05.2017 16:37:34 Конец правки.
					
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда
					
					Техобслуживание = Техобслуживание + Выборка.Сумма;
					
					ОснНорма = 0;
					ДопНорма = 0;
					ОбщНорма = 0;
					
					РасчетДолей(Выборка,СтруктураНорм);
					
					// Итог по перемены долей.
					ОснТО = ОснТО + СтруктураНорм.ОснНорма;
					ДопТо = ДопТО + СтруктураНорм.ДопНорма;
					ОбщТО = ОбщТО + СтруктураНорм.ОбщНорма;
					
					//до 07.11.2019
					//Если Выборка.СпособРасчета = ПоОбщейПлощади Тогда
					//	
					//	ВЫГРУЗКА_ТОПоОбщейПлощади       = ВЫГРУЗКА_ТОПоОбщейПлощади + Выборка.Сумма;
					//	ВЫГРУЗКА_СтавкаТОПоОбщейПлощади = ВЫГРУЗКА_СтавкаТОПоОбщейПлощади + Выборка.ОсновнаяСтавка;
					//	
					//ИначеЕсли Выборка.СпособРасчета = ПоПроживающим Тогда
					//	
					//	ВЫГРУЗКА_ТОПоПроживающим       = ВЫГРУЗКА_ТОПоПроживающим + Выборка.Сумма;
					//	ВЫГРУЗКА_СтавкаТОПоПроживающим = ВЫГРУЗКА_СтавкаТОПоПроживающим + Выборка.Сумма;
					//	
					//КонецЕсли; 					
					//13.11.2019 
					//07.11.2019 СпособРасчета = ПРОЖИВАЮЩИЕ ---> ПоПроживающим
					//Если Выборка.СпособРасчета = ПоПроживающим Тогда
					//	
					//	ВЫГРУЗКА_ТОПоПроживающим       = ВЫГРУЗКА_ТОПоПроживающим + Выборка.Сумма;
					//	ВЫГРУЗКА_СтавкаТОПоПроживающим = ВЫГРУЗКА_СтавкаТОПоПроживающим + Выборка.Сумма;
					//	
					//иначе // все остальные ---> ПоОбщейПлощади 
					//	
					//	ВЫГРУЗКА_ТОПоОбщейПлощади       = ВЫГРУЗКА_ТОПоОбщейПлощади + Выборка.Сумма;
					//	ВЫГРУЗКА_СтавкаТОПоОбщейПлощади = ВЫГРУЗКА_СтавкаТОПоОбщейПлощади + Выборка.ОсновнаяСтавка;
					//	
					//КонецЕсли; 
					
					//27.11.2019
					если Выборка.ОбщедомовыеНачисления = Истина тогда
						
						 если ЭтотОбъект.ВыводитьОДН = Истина тогда	
							//13.11.2019
							Если Выборка.СпособРасчета = ПоОбщейПлощади или Выборка.СпособРасчета = ПоОтапливаемойПлощади  Тогда						
														
								ВЫГРУЗКА_ТОПоОбщейПлощади       = ВЫГРУЗКА_ТОПоОбщейПлощади + Выборка.Сумма;
								ВЫГРУЗКА_СтавкаТОПоОбщейПлощади = ВЫГРУЗКА_СтавкаТОПоОбщейПлощади + Выборка.ОсновнаяСтавка;
								
							ИначеЕсли Выборка.СпособРасчета = ПоПроживающим Тогда
								
								ВЫГРУЗКА_ТОПоПроживающим       = ВЫГРУЗКА_ТОПоПроживающим + Выборка.Сумма;
								ВЫГРУЗКА_СтавкаТОПоПроживающим = ВЫГРУЗКА_СтавкаТОПоПроживающим + Выборка.Сумма;
								
							КонецЕсли; 	

						 конецесли;	
						 
					 иначе	 
						 
						 Если Выборка.СпособРасчета = ПоОбщейПлощади или Выборка.СпособРасчета = ПоОтапливаемойПлощади  Тогда						
														
								ВЫГРУЗКА_ТОПоОбщейПлощади       = ВЫГРУЗКА_ТОПоОбщейПлощади + Выборка.Сумма;
								ВЫГРУЗКА_СтавкаТОПоОбщейПлощади = ВЫГРУЗКА_СтавкаТОПоОбщейПлощади + Выборка.ОсновнаяСтавка;
								
						 ИначеЕсли Выборка.СпособРасчета = ПоПроживающим Тогда
								
								ВЫГРУЗКА_ТОПоПроживающим       = ВЫГРУЗКА_ТОПоПроживающим + Выборка.Сумма;
								ВЫГРУЗКА_СтавкаТОПоПроживающим = ВЫГРУЗКА_СтавкаТОПоПроживающим + Выборка.Сумма;
								
						КонецЕсли; 	

					конецесли;	
					
				ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда
					
					Отопление          = Отопление + Выборка.Сумма;
					
					ВЫГРУЗКА_Отопление       = ВЫГРУЗКА_Отопление + Выборка.Сумма;
					ВЫГРУЗКА_СтавкаОтопление = ВЫГРУЗКА_СтавкаОтопление + Выборка.ОсновнаяСтавка;
					
					// БИТ ЖКХ 26.11.2020
			        ВЫГРУЗКА_ОтоплениеОбщедомовое = Выборка.СуммаОбщедомовых + Выборка.Сумма;
					
					ОснНорма = 0;
					ДопНорма = 0;
					ОбщНорма = 0;
					
					РасчетДолей(Выборка, СтруктураНорм);
					
					// Итог по перемены долей.
					ОснОТПЛ = ОснОТПЛ + СтруктураНорм.ОснНорма;
					ДопОТПЛ = ДопОТПЛ + СтруктураНорм.ДопНорма;
					ОбщОТПЛ = ОбщОТПЛ + СтруктураНорм.ОбщНорма;
					
				КонецЕсли; 
				
				
			КонецЦикла; 
			
			СтрокаТаблицы.Параметры.Водоотведение         = Водопровод;
			СтрокаТаблицы.Параметры.Газ                   = Газ;
			СтрокаТаблицы.Параметры.ГорячееВодоснобжение  = ГорячееВодоснобжение;
			СтрокаТаблицы.Параметры.ПлатаЗаНайм           = ПлатаЗаНайм;
			СтрокаТаблицы.Параметры.Электроэнергия        = Электроэнергия;
			СтрокаТаблицы.Параметры.ХолодноеВодоснабжение = ХолодноеВодоснабжение;
			// БИТ ЖКХ 20.04.2021
			СтрокаТаблицы.Параметры.ХолодноеВодоснабжениеДляГВС = ХолодноеВодоснабжениеДляГВС;

			
			ТехобслуживаниеОСН = ОснТО;
			ТехобслуживаниеДОП = ДопТО;
			ТехобслуживаниеИЛЗ = ОбщТО;
			
			ОтоплениеОСН = ОснОТПЛ;
			ОтоплениеДОП = ДопОТПЛ;
			ОтоплениеИЛЗ = ОбщОТПЛ;
			
			СтрокаТаблицы.Параметры.ТехобслуживаниеОСН = ТехобслуживаниеОСН;
			СтрокаТаблицы.Параметры.ТехобслуживаниеДОП = ТехобслуживаниеДОП;
			СтрокаТаблицы.Параметры.ТехобслуживаниеИЛЗ = ТехобслуживаниеИЛЗ;
			СтрокаТаблицы.Параметры.ОтоплениеОСН       = ОтоплениеОСН;
			СтрокаТаблицы.Параметры.ОтоплениеДОП       = ОтоплениеДОП;
			СтрокаТаблицы.Параметры.ОтоплениеИЛЗ       = ОтоплениеИЛЗ;
			
			СтрокаТаблицы.Параметры.ИтогоНачислено              = Итого;
			СтрокаТаблицы.Параметры.ИтогоНачисленоБезУчетаЛьгот = ИтогоБезЛьгот;
			
			СуммаДолга = СуммаДолга(ВыборкаЛС.ЛицевойСчет);
			СтрокаТаблицы.Параметры.СуммаЗадолженности = СуммаДолга;
			
			КолМесяцевДолга = ПолучитьКолМесяцевДолга(СуммаДолга, ВыборкаЛС.ЛицевойСчет);
			СтрокаТаблицы.Параметры.КолМесяцевДолга = КолМесяцевДолга;
			ДокументРезультат.Вывести(СтрокаТаблицы);
			
			
			// Заполнение таблицы.
			НоваяСтрока = мТаблицаОтчета.Добавить();
			НоваяСтрока.КодОрганизации            = КодОрганизацииПоГЦЖС;
			НоваяСтрока.Организация               = Организация.НаименованиеПолное;
			НоваяСтрока.Год                       = Год(КонецПериода);
			НоваяСтрока.Месяц                     = Месяц(КонецПериода);
			
			// БИТ_ЖКХ 23.01.2015{{
			НоваяСтрока.КоличествоКомнат = ВыборкаЛС.Квартира.КоличествоКомнат;
			НоваяСтрока.Этаж = ВыборкаЛС.Квартира.Этаж;
			
			Если ВыборкаЛС.СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Неприватизированная Тогда
				НоваяСтрока.КодТипЖилья               = 1;
				НоваяСтрока.ТипЖилищногоФонда         = 1;
			ИначеЕсли  ВыборкаЛС.СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Приватизированная  Тогда
				НоваяСтрока.КодТипЖилья               = 2;
				НоваяСтрока.ТипЖилищногоФонда         = 2;
			ИначеЕсли  ВыборкаЛС.СтатусКвартиры = Справочники.бит_СтатусыКвартиры.ОбщественныйГосударственный  Тогда
				НоваяСтрока.КодТипЖилья               = 6;
				НоваяСтрока.ТипЖилищногоФонда         = 6;
			ИначеЕсли  ВыборкаЛС.СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Государственный  Тогда
				НоваяСтрока.КодТипЖилья               = 7;
				НоваяСтрока.ТипЖилищногоФонда         = 7;
			Иначе
				НоваяСтрока.КодТипЖилья               = 0;
				НоваяСтрока.ТипЖилищногоФонда         = 0;
			КонецЕсли; 
			// БИТ_ЖКХ 23.01.2015}}
			
			НоваяСтрока.НомерЛС                   = ВыборкаЛС.ЛицевойСчет.Наименование;
			НоваяСтрока.ФИО                       = ВыборкаЛС.ОтветсвенноеЛицо;
			
			// БИТ_ЖКХ 16.05.2014	
			Запрос2 = Новый Запрос;
			
			Запрос2.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
			|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
			|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
			|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
			|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
			|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
			|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
			|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
			|	ПроживающиеПоЛССрезПоследних.ДоляПлощади,
			|	ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
			|ГДЕ
			|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
			|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
			
			// БИТ_ЖКХ 06.08.2014
			// Запрос2.УстановитьПараметр("Момент"		, КонецПериода);.
			Запрос2.УстановитьПараметр("Момент"		, КонецМесяца(КонецПериода));
			// БИТ_ЖКХ 06.08.2014
			
			Запрос2.УстановитьПараметр("ЛицевойСчет"	, ВыборкаЛС.ЛицевойСчет);
			Выборка2 = Запрос2.Выполнить().Выбрать();
			
			// БИТ_ЖКХ 16.05.2014
			мКоличествоПостоянноПроживающих2 = 0;	
			мКоличествоПроживающих2 = 0;
			мКоличествоНеПроживающих2= 0;	
			// БИТ_ЖКХ 16.05.2014
			
			Пока Выборка2.Следующий() Цикл 
				
				СтатусФизЛица    = Выборка2.СтатусФизЛица; 
				
				// БИТ_ЖКХ 21.05.2014
				Если Выборка2.СтатусПроживания <> ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
					
					мКоличествоПроживающих2 = мКоличествоПроживающих2 + 1; 
					
				КонецЕсли;
				
				НоваяСтрока.КолвоЗарегистрированных   = мКоличествоПроживающих2;
				
				// БИТ_ЖКХ 21.05.2014
				
				Если СтатусФизЛица.ПроживаниеВДанныйМомент и НЕ СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан") тогда
					
					мКоличествоПостоянноПроживающих2 = мКоличествоПостоянноПроживающих2 +1;
					
					НоваяСтрока.КолвоПроживающих          = мКоличествоПостоянноПроживающих2;
				КонецЕсли;		
				
				Если НЕ СтатусФизЛица.ПроживаниеВДанныйМомент и НЕ СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан") тогда	
					
					// БИТ_ЖКХ 21.05.2014
					Если Выборка2.СтатусПроживания <> ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
						мКоличествоНеПроживающих2 = мКоличествоНеПроживающих2 +1;
					КонецЕсли;			
					
					НоваяСтрока.КолвоНеПроживающих   = мКоличествоНеПроживающих2;
				КонецЕсли;			
				
				Если мКоличествоНеПроживающих2 <> НоваяСтрока.КолвоНеПроживающих Тогда
					
					НоваяСтрока.КолвоНеПроживающих   = мКоличествоНеПроживающих2;
					
				КонецЕсли;	
				// БИТ_ЖКХ 21.05.2014
				
			КонецЦикла;		
			// БИТ_ЖКХ 16.05.2014		
			
			НоваяСтрока.ОбщаяПлощадь              = ВыборкаЛС.ОбщаяПлощадь;
			НоваяСтрока.ЖилаяПлощадь              = ВыборкаЛС.ЖилаяПлощадь;
			НоваяСтрока.ТипЗУ                     = ВыборкаЛС.ТипЗапирающегоУстройства;
			НоваяСтрока.ТипПлиты                  = ВыборкаЛС.ТипПлиты;
			Если ВыборкаЛС.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
				НоваяСтрока.КодПлиты = 2;
			ИначеЕсли ВыборкаЛС.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда 
				НоваяСтрока.КодПлиты = 1;
			Иначе
				НоваяСтрока.КодПлиты = 3;
			КонецЕсли; 
			НоваяСтрока.КоличествоСемей           = 0;
			НоваяСтрока.АдресЛС                   = "ул. " + ВыборкаЛС.Улица +" д. " + ВыборкаЛС.Здание + " кв." + ВыборкаЛС.Квартира;
			НоваяСтрока.Учитываемых               = 0;
			
			НоваяСтрока.ВЫГРУЗКА_СтавкаТОПоОбщейПлощади = ВЫГРУЗКА_СтавкаТОПоОбщейПлощади;
			НоваяСтрока.ВЫГРУЗКА_СтавкаТОПоПроживающим  = ВЫГРУЗКА_СтавкаТОПоПроживающим;
			НоваяСтрока.ВЫГРУЗКА_СтавкаНайм        		= ВЫГРУЗКА_СтавкаНайм;
			// БИТ_ЖКХ 09.02.2016 15:02:25 Начало правки...
			НоваяСтрока.ВЫГРУЗКА_СтавкаКапРемонт        = ВЫГРУЗКА_СтавкаКапРемонт;
			// БИТ_ЖКХ 09.02.2016 15:02:25 Конец правки.
			НоваяСтрока.ВЫГРУЗКА_СтавкаОтопление        = ВЫГРУЗКА_СтавкаОтопление;
			НоваяСтрока.ВЫГРУЗКА_СтавкаХолВода          = ВЫГРУЗКА_СтавкаХолВода;
			// БИТ ЖКХ 20.04.2021
			НоваяСтрока.ВЫГРУЗКА_СтавкаХолВодаДляГВС    = ВЫГРУЗКА_СтавкаХолВодаДляГВС;
			НоваяСтрока.ВЫГРУЗКА_СтавкаГорВода          = ВЫГРУЗКА_СтавкаГорВода;
			НоваяСтрока.ВЫГРУЗКА_СтавкаВодоотвод        = ВЫГРУЗКА_СтавкаВодоотвод;
			НоваяСтрока.ВЫГРУЗКА_СтавкаГаз              = ВЫГРУЗКА_СтавкаГаз;
			НоваяСтрока.ВЫГРУЗКА_СтавкаЭлектроэнергия   = ВЫГРУЗКА_СтавкаЭлектроэнергия;
			// БИТ_ЖКХ 15.05.2017 15:12:10 Начало правки...
			НоваяСтрока.ВЫГРУЗКА_СтавкаЭлектроэнергияОДН	= ВЫГРУЗКА_СтавкаЭлектроэнергияОДН;
			НоваяСтрока.ВЫГРУЗКА_СтавкаХолВодаОДН			= ВЫГРУЗКА_СтавкаХолВодаОДН;
			НоваяСтрока.ВЫГРУЗКА_СтавкаХВСдляГВСОДН			= ВЫГРУЗКА_СтавкаХВСдляГВСОДН;
			НоваяСтрока.ВЫГРУЗКА_СтавкаВодоотводОДН			= ВЫГРУЗКА_СтавкаВодоотводОДН;
			НоваяСтрока.ВЫГРУЗКА_СтавкаПодогревОДН			= ВЫГРУЗКА_СтавкаПодогревОДН;
			// БИТ_ЖКХ 15.05.2017 15:12:10 Конец правки. 
			
			НоваяСтрока.ВЫГРУЗКА_ТОПоОбщейПлощади = ВЫГРУЗКА_ТОПоОбщейПлощади;
			НоваяСтрока.ВЫГРУЗКА_ТОПоПроживающим  = ВЫГРУЗКА_ТОПоПроживающим;
			НоваяСтрока.ВЫГРУЗКА_Найм             = ВЫГРУЗКА_Найм;
			// БИТ_ЖКХ 09.02.2016 15:02:53 Начало правки...
			НоваяСтрока.ВЫГРУЗКА_КапРемонт             = ВЫГРУЗКА_КапРемонт;
			// БИТ_ЖКХ 09.02.2016 15:02:53 Конец правки.
			НоваяСтрока.ВЫГРУЗКА_Отопление        = ВЫГРУЗКА_Отопление;
			НоваяСтрока.ВЫГРУЗКА_ХолВода          = ВЫГРУЗКА_ХолВода;
			// БИТ ЖКХ 20.04.2021
			НоваяСтрока.ВЫГРУЗКА_ХолВодаДляГВС    = ВЫГРУЗКА_ХолВодаДляГВС;
			НоваяСтрока.ВЫГРУЗКА_ГорВода          = ВЫГРУЗКА_ГорВода;
			НоваяСтрока.ВЫГРУЗКА_Газ              = ВЫГРУЗКА_Газ;
			НоваяСтрока.ВЫГРУЗКА_Электроэнергия   = ВЫГРУЗКА_Электроэнергия;
			НоваяСтрока.ВЫГРУЗКА_Водоотвод        = ВЫГРУЗКА_Водоотвод;
			// БИТ_ЖКХ 15.05.2017 15:12:13 Начало правки...
			НоваяСтрока.ВЫГРУЗКА_ЭлектроэнергияОДН	= ВЫГРУЗКА_ЭлектроэнергияОДН;
			НоваяСтрока.ВЫГРУЗКА_ХолВодаОДН			= ВЫГРУЗКА_ХолВодаОДН;
			НоваяСтрока.ВЫГРУЗКА_ХВСдляГВСОДН		= ВЫГРУЗКА_ХВСдляГВСОДН;
			НоваяСтрока.ВЫГРУЗКА_ВодоотводОДН		= ВЫГРУЗКА_ВодоотводОДН;
			НоваяСтрока.ВЫГРУЗКА_ПодогревОДН		= ВЫГРУЗКА_ПодогревОДН;
			// БИТ_ЖКХ 15.05.2017 15:12:13 Конец правки. 
			
			НоваяСтрока.ВЫГРУЗКА_НормаГорВода        = ВЫГРУЗКА_НормаГорВода;
			НоваяСтрока.ВЫГРУЗКА_НормаХолВода        = ВЫГРУЗКА_НормаХолВода;
			// БИТ ЖКХ 20.04.2021
			НоваяСтрока.ВЫГРУЗКА_НормаХолВодаДляГВС  = ВЫГРУЗКА_НормаХолВодаДляГВС;
			НоваяСтрока.ВЫГРУЗКА_НормаВодоотвод      = ВЫГРУЗКА_НормаВодоотвод;
			НоваяСтрока.ВЫГРУЗКА_НормаГаз            = ВЫГРУЗКА_НормаГаз;
			НоваяСтрока.ВЫГРУЗКА_НормаЭлектроэнергия = ВЫГРУЗКА_НормаЭлектроэнергия;
			
			НоваяСтрока.ВЫГРУЗКА_СЧ_ХолВода   = ВЫГРУЗКА_СЧ_ХолВода;
			// БИТ ЖКХ 20.04.2021   
			НоваяСтрока.ВЫГРУЗКА_СЧ_ХолВодаДляГВС = ВЫГРУЗКА_СЧ_ХолВодаДляГВС;
			НоваяСтрока.ВЫГРУЗКА_СЧ_ГорВода   = ВЫГРУЗКА_СЧ_ГорВода;
			НоваяСтрока.ВЫГРУЗКА_СЧ_Водоотвод = ВЫГРУЗКА_СЧ_Водоотвод;
			НоваяСтрока.ВЫГРУЗКА_СЧ_Газ       = ВЫГРУЗКА_СЧ_Газ;
			
			НоваяСтрока.ТехобслуживаниеОСН          = ТехобслуживаниеОСН;
			НоваяСтрока.ТехобслуживаниеДОП          = ТехобслуживаниеДОП;
			НоваяСтрока.ТехобслуживаниеИЛЗ          = ТехобслуживаниеИЛЗ;
			НоваяСтрока.ПлатаЗаНайм                 = ПлатаЗаНайм;
			НоваяСтрока.ОтоплениеОСН                = ОтоплениеОСН;
			НоваяСтрока.ОтоплениеДОП                = ОтоплениеДОП;
			НоваяСтрока.ОтоплениеИЛЗ                = ОтоплениеИЛЗ;
			// БИТ ЖКХ 26.11.2020
			НоваяСтрока.ВЫГРУЗКА_ОтоплениеОбщедомовое = ВЫГРУЗКА_ОтоплениеОбщедомовое;
			НоваяСтрока.ХолодноеВодоснабжение       = ХолодноеВодоснабжение;
			// БИТ ЖКХ 20.04.2021
			НоваяСтрока.ХолодноеВодоснабжениеДляГВС = ХолодноеВодоснабжениеДляГВС;
			НоваяСтрока.Водоотведение               = Водопровод;
			НоваяСтрока.ГорячееВодоснобжение        = ГорячееВодоснобжение;
			НоваяСтрока.Электроэнергия              = Электроэнергия;
			НоваяСтрока.Газ                         = Газ;
			НоваяСтрока.ИтогоНачислено              = Итого;
			НоваяСтрока.ИтогоНачисленоБезУчетаЛьгот = ИтогоБезЛьгот;
			
			НоваяСтрока.СуммаЗадолженности          = СуммаДолга; 
			
			// БИТ ЖКХ 29.01.2020 
			НоваяСтрока.ВЫГРУЗКА_БытОтходы          = ВЫГРУЗКА_БытОтходы;
			НоваяСтрока.ВЫГРУЗКА_СтавкаБытОтходы    = ВЫГРУЗКА_СтавкаБытОтходы;
			НоваяСтрока.ВЫГРУЗКА_НормаБытОтходы     = ВЫГРУЗКА_НормаБытОтходы;
			
		КонецЦикла;
		
	КонецЦикла;
	
	мСтруктураИтоговОтчета.Вставить("Организация"           , Организация);
	мСтруктураИтоговОтчета.Вставить("УправляющаяОрганизация", УправляющаяОрганизация);
	мСтруктураИтоговОтчета.Вставить("НачалоПериода"         , НачалоПериода);
	мСтруктураИтоговОтчета.Вставить("КонецПериода"          , КонецПериода);
	
	Итог.Параметры.КолвоЗарегистрированных = мТаблицаОтчета.Итог("КолвоЗарегистрированных");
	Итог.Параметры.КолвоПроживающих        = мТаблицаОтчета.Итог("КолвоПроживающих");
	
	// БИТ_ЖКХ 27.05.2014
	Итог.Параметры.КолвоНеПроживающих      = мТаблицаОтчета.Итог("КолвоНеПроживающих");
	// БИТ_ЖКХ 27.05.2014
	
	Итог.Параметры.ОбщаяПлощадь            = мТаблицаОтчета.Итог("ОбщаяПлощадь");
	Итог.Параметры.ЖилаяПлощадь            = мТаблицаОтчета.Итог("ЖилаяПлощадь");
	Итог.Параметры.ТехобслуживаниеОСН      = мТаблицаОтчета.Итог("ТехобслуживаниеОСН");
	Итог.Параметры.ТехобслуживаниеДОП      = мТаблицаОтчета.Итог("ТехобслуживаниеДОП");
	Итог.Параметры.ТехобслуживаниеИЛЗ      = мТаблицаОтчета.Итог("ТехобслуживаниеИЛЗ");
	Итог.Параметры.ПлатаЗаНайм             = мТаблицаОтчета.Итог("ПлатаЗаНайм");
	Итог.Параметры.ОтоплениеОСН            = мТаблицаОтчета.Итог("ОтоплениеОСН");
	Итог.Параметры.ОтоплениеДОП            = мТаблицаОтчета.Итог("ОтоплениеДОП");
	Итог.Параметры.ОтоплениеИЛЗ            = мТаблицаОтчета.Итог("ОтоплениеИЛЗ");
	Итог.Параметры.ХолодноеВодоснабжение   = мТаблицаОтчета.Итог("ХолодноеВодоснабжение");
	// БИТ ЖКХ 20.04.2021
	Итог.Параметры.ХолодноеВодоснабжениеДляГВС = мТаблицаОтчета.Итог("ХолодноеВодоснабжениеДляГВС");
	Итог.Параметры.Водоотведение           = мТаблицаОтчета.Итог("Водоотведение");
	Итог.Параметры.ГорячееВодоснобжение    = мТаблицаОтчета.Итог("ГорячееВодоснобжение");
	Итог.Параметры.Электроэнергия          = мТаблицаОтчета.Итог("Электроэнергия");
	Итог.Параметры.Газ                     = мТаблицаОтчета.Итог("Газ");
	
	Итог.Параметры.ИтогоНачислено              = мТаблицаОтчета.Итог("ИтогоНачислено");
	Итог.Параметры.ИтогоНачисленоБезУчетаЛьгот = мТаблицаОтчета.Итог("ИтогоНачисленоБезУчетаЛьгот");
	
	Подвал.Параметры.ФИОРуководителя = ПолучитьИмяРуководителя();
	
	ДокументРезультат.Вывести(Итог);
	ДокументРезультат.Вывести(Подвал);	
	
	// БИТ_ЖКХ 22.07.2014
	ТаблицаОтчета = мТаблицаОтчета;
	// БИТ_ЖКХ 22.07.2014
	
КонецПроцедуры

// Процедура формирует отчет СведенияОПроживающих.
//
Процедура СформироватьСведенияОПроживающих(ДокументРезультат,мВидОтчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание КАК Здание,
	|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира КАК Квартира,
	|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	ВЫБОР
	|		КОГДА ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ЕСТЬNULL(ПроживающиеПоЛССрезПоследних.ДоляПлощади, 0) КАК ДоляПлощади
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет.Организация = &Организация
	|				И ЛицевойСчет.Здание.ТипУправляющейОрганизации = &ТипУО) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|ИТОГИ
	|	МАКСИМУМ(Улица)
	|ПО
	|	Здание,
	|	ЛицевойСчет";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("ТипУО"       , УправляющаяОрганизация);
	
	Макет = ПолучитьМакет("СведенияОПроживающих");
	
	Шапка    = Макет.ПолучитьОбласть("Шапка");
	Адрес    = Макет.ПолучитьОбласть("Адрес");
	СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	Шапка.Параметры.Период      = Строка(Формат(НачалоМесяца(КонецПериода), "ДЛФ=DD")) +" - "+ Строка(Формат(КонецМесяца(КонецПериода), "ДЛФ=DD"));
	Шапка.Параметры.Организация = Организация;
	Шапка.Параметры.ТипУО       = УправляющаяОрганизация;
	
	ДокументРезультат.Вывести(Шапка);
	
	
	ВыборкаЗдание = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗдание.Следующий() Цикл
		
		Адрес.Параметры.Здание     = Строка(ВыборкаЗдание.Улица) + ", д." + Строка(ВыборкаЗдание.Здание);
		
		НомерПП = 0;
		ДокументРезультат.Вывести(Адрес);
		
		ВыборкаЛС = ВыборкаЗдание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЛС.Следующий() Цикл
			
			НомерПП = НомерПП + 1;
			СтрокаТЧ.Параметры.НомерПП = НомерПП;
			
			НомерПроживающего = 0;
			
			Выборка = ВыборкаЛС.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НомерПроживающего = НомерПроживающего + 1;
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ.Параметры,Выборка);
				
				Площадь = ПолучитьОбщуюПлощадь(Выборка.Квартира);
				
				СтрокаТЧ.Параметры.НомерПроживающего = НомерПроживающего;
				СтрокаТЧ.Параметры.ДоляПлощади  = Площадь * Выборка.ДоляПлощади;
				
				ДокументРезультат.Вывести(СтрокаТЧ);
				
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

// Процедура формирует отчет ОтчетОВыпадающихДоходах.
//
Процедура СформироватьОтчетОВыпадающихДоходах(ДокументРезультат,мВидОтчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо,
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу,
	|	бит_ЛьготыПоЛССрезПоследних.НомерДокумента,
	|	бит_ЛьготыПоЛССрезПоследних.ДатаВыдачи,
	|	бит_ЛьготыПоЛССрезПоследних.КемВыдан,
	|	МАКСИМУМ(бит_НачислениеПоЛьготамОбороты.СуммаОборот) КАК СуммаОборот,
	|	МАКСИМУМ(бит_НачислениеПоЛьготамОбороты.СуммаРазовыхОборот) КАК СуммаРазовыхОборот,
	|	МАКСИМУМ(бит_НачислениеПоЛьготамОбороты.СуммаСемейнойОборот) КАК СуммаСемейнойОборот,
	|	бит_НачислениеПоЛьготамОбороты.Услуга.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь) КАК ОбщаяПлощадь,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Здание КАК Здание,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Квартира КАК Квартира,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь) КАК ЖилаяПлощадь,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь) КАК ОтапливаемаяПлощадь,
	|	МАКСИМУМ(бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления) КАК КоличествоЕдиницПотребления,
	|	СУММА(бит_КолЕдПоСчетчикамСрезПоследних.КоличествоЕдиницПоЛС) КАК КоличествоЕдиницПоЛС,
	|	бит_УстановкаЛьготСрезПоследних.Распространение
	|ПОМЕСТИТЬ СведенияОЛьготниках
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПоЛьготамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ЛьготыПоЛССрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.ЛицевойСчет = бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет
	|			И бит_НачислениеПоЛьготамОбороты.Льгота = бит_ЛьготыПоЛССрезПоследних.Льготы
	|			И бит_НачислениеПоЛьготамОбороты.ФизЛицо = бит_ЛьготыПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|			И бит_НачислениеПоЛьготамОбороты.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_КолЕдПоСчетчикам.СрезПоследних(&КонецПериода, ) КАК бит_КолЕдПоСчетчикамСрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.ЛицевойСчет = бит_КолЕдПоСчетчикамСрезПоследних.ЛицевойСчет
	|			И бит_НачислениеПоЛьготамОбороты.Услуга = бит_КолЕдПоСчетчикамСрезПоследних.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановкаЛьгот.СрезПоследних(&КонецПериода, ) КАК бит_УстановкаЛьготСрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.Услуга = бит_УстановкаЛьготСрезПоследних.Услуга
	|			И бит_НачислениеПоЛьготамОбороты.Льгота = бит_УстановкаЛьготСрезПоследних.Льгота
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо,
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу,
	|	бит_ЛьготыПоЛССрезПоследних.НомерДокумента,
	|	бит_ЛьготыПоЛССрезПоследних.ДатаВыдачи,
	|	бит_ЛьготыПоЛССрезПоследних.КемВыдан,
	|	бит_НачислениеПоЛьготамОбороты.Услуга.ГрафаОтчетаГЦЖС,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Здание,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Квартира,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.УлицаЛицевогоСчета,
	|	бит_УстановкаЛьготСрезПоследних.Распространение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КоличествоПроживающих
	|ПОМЕСТИТЬ ПроживающиеИмеющиеПравоНаЛьготы
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					Таб.ЛицевойСчет КАК ЛицевойСчет
	|				ИЗ
	|					СведенияОЛьготниках КАК Таб)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОЛьготниках.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияОЛьготниках.Услуга,
	|	СведенияОЛьготниках.ФизЛицо КАК ФизЛицо,
	|	СведенияОЛьготниках.Льгота КАК Льгота,
	|	СведенияОЛьготниках.ДокументНаЛьготу КАК ДокументНаЛьготу,
	|	СведенияОЛьготниках.НомерДокумента КАК НомерДокумента,
	|	СведенияОЛьготниках.ДатаВыдачи КАК ДатаВыдачи,
	|	СведенияОЛьготниках.КемВыдан КАК КемВыдан,
	|	СведенияОЛьготниках.СуммаОборот + СведенияОЛьготниках.СуммаСемейнойОборот КАК Сумма,
	|	СведенияОЛьготниках.СуммаРазовыхОборот КАК СуммаРазовых,
	|	СведенияОЛьготниках.ГрафаОтчетаГЦЖС,
	|	РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК КоличествоМесяцевРасчета,
	|	ЕСТЬNULL(СведенияОЛьготниках.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	|	СведенияОЛьготниках.Здание КАК Здание,
	|	СведенияОЛьготниках.Квартира КАК Квартира,
	|	СведенияОЛьготниках.Улица КАК Улица,
	|	СведенияОЛьготниках.ТипКвартиры,
	|	СведенияОЛьготниках.СтатусКвартиры,
	|	СведенияОЛьготниках.РежимПотребления,
	|	СведенияОЛьготниках.СпособРасчета,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ) КАК ИспользоватьДопНормуНаЛьготника,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
	|	ЕСТЬNULL(СведенияОЛьготниках.ЖилаяПлощадь, 0) КАК ЖилаяПлощадь,
	|	ЕСТЬNULL(СведенияОЛьготниках.ОтапливаемаяПлощадь, 0) КАК ОтапливаемаяПлощадь,
	|	ЕСТЬNULL(СведенияОЛьготниках.КоличествоЕдиницПотребления, 0) КАК КоличествоЕдиницПотребления,
	|	ЕСТЬNULL(СведенияОЛьготниках.КоличествоЕдиницПоЛС, 0) КАК КоличествоЕдиницПоЛС,
	|	СведенияОЛьготниках.ЛицевойСчет.Наименование КАК Наименование,
	|	СведенияОЛьготниках.Распространение,
	|	ВЫБОР
	|		КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание)
	|			ТОГДА ВЫБОР
	|					КОГДА СведенияОЛьготниках.Распространение = ЗНАЧЕНИЕ(Перечисление.бит_РаспространениеЛьготы.ПоНорме)
	|						ТОГДА ВЫБОР
	|								КОГДА СведенияОЛьготниках.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|									ТОГДА бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) = 1
	|											ТОГДА ВЫБОР
	|													КОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ)
	|														ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) + ВЫБОР
	|																КОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ)
	|																	ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|																ИНАЧЕ 0
	|															КОНЕЦ
	|													ИНАЧЕ ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0)
	|												КОНЕЦ
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) = 2
	|													ТОГДА ВЫБОР
	|															КОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ)
	|																ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) * 2 + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) * 2
	|															ИНАЧЕ ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) * 2
	|														КОНЕЦ
	|												ИНАЧЕ ВЫБОР
	|														КОГДА ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) = 3
	|															ТОГДА ВЫБОР
	|																	КОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ)
	|																		ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																	ИНАЧЕ ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																КОНЕЦ
	|														ИНАЧЕ ВЫБОР
	|																КОГДА ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) = 4
	|																	ТОГДА ВЫБОР
	|																			КОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ)
	|																				ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																			ИНАЧЕ ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																		КОНЕЦ
	|																ИНАЧЕ ВЫБОР
	|																		КОГДА ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) = 5
	|																			ТОГДА ВЫБОР
	|																					КОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ)
	|																						ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																					ИНАЧЕ ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																				КОНЕЦ
	|																		ИНАЧЕ ВЫБОР
	|																				КОГДА ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) > 5
	|																					ТОГДА ВЫБОР
	|																							КОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ)
	|																								ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																							ИНАЧЕ ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) * ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоПроживающих, 0)
	|																						КОНЕЦ
	|																			КОНЕЦ
	|																	КОНЕЦ
	|															КОНЕЦ
	|													КОНЕЦ
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ЕСТЬNULL(СведенияОЛьготниках.ОбщаяПлощадь, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасчетнаяПлощадь
	|ИЗ
	|	СведенияОЛьготниках КАК СведенияОЛьготниках
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&КонецПериода, ) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО СведенияОЛьготниках.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И СведенияОЛьготниках.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И СведенияОЛьготниках.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И СведенияОЛьготниках.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|			И СведенияОЛьготниках.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеИмеющиеПравоНаЛьготы КАК ПроживающиеИмеющиеПравоНаЛьготы
	|		ПО СведенияОЛьготниках.ЛицевойСчет = ПроживающиеИмеющиеПравоНаЛьготы.ЛицевойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ
	|	МАКСИМУМ(ДокументНаЛьготу),
	|	МАКСИМУМ(НомерДокумента),
	|	МАКСИМУМ(ДатаВыдачи),
	|	МАКСИМУМ(КемВыдан),
	|	СУММА(Сумма),
	|	СУММА(СуммаРазовых),
	|	МАКСИМУМ(КоличествоМесяцевРасчета),
	|	МАКСИМУМ(ОбщаяПлощадь),
	|	МАКСИМУМ(Здание),
	|	МАКСИМУМ(Квартира),
	|	МАКСИМУМ(Улица),
	|	МАКСИМУМ(КоличествоПроживающих),
	|	СУММА(КоличествоЕдиницПотребления),
	|	МАКСИМУМ(РасчетнаяПлощадь)
	|ПО
	|	Льгота,
	|	ЛицевойСчет,
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("НачалоПериода" , НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода"  , КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация"   , Организация);
	
	СтруктураНорм = Новый Структура;
	СтруктураНорм.Вставить("ОснНорма",0);
	СтруктураНорм.Вставить("ДопНорма",0);
	СтруктураНорм.Вставить("ОбщНорма",0);
	
	Макет = ПолучитьМакет("ВыпадающиеДоходы");
	
	Шапка         = Макет.ПолучитьОбласть("ШапкаОтчета");
	ШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	СтрокаЛьгота  = Макет.ПолучитьОбласть("Льгота");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Итог          = Макет.ПолучитьОбласть("Итог");
	Подвал        = Макет.ПолучитьОбласть("Подвал");
	
	Период = Строка(Формат(НачалоМесяца(КонецПериода), "ДЛФ=DD")) +" - "+ Строка(Формат(КонецМесяца(КонецПериода), "ДЛФ=DD"));
	
	Шапка.Параметры.Период      = Период;
	Шапка.Параметры.Организация = Организация;
	
	ВыборкаЛьгота = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПоОбщейПлощади                      = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади;
	ПоЕдиницамПотребленияНаЛицевойСчет = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет;
	ПоЕдиницамПотребления               = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления;
	ПоЖилойПлощади                      = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади;
	ПоОтапливаемойПлощади               = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади;
	РасчетПоСчетчикам                   = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам;
	ПоПроживающим                       = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим;
	
	ДокументРезультат.Вывести(Шапка);
	ДокументРезультат.Вывести(ШапкаТаблицы);
	
	НомерПП = 0;
	
	Пока ВыборкаЛьгота.Следующий() Цикл
		
		СтрокаЛьгота.Параметры.Льгота = ВыборкаЛьгота.Льгота;
		ДокументРезультат.Вывести(СтрокаЛьгота);
		
		ВыборкаЛицевойСчет = ВыборкаЛьгота.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ИтогВодопровод            = 0;
		ИтогВывозБытовыхОтходов   = 0;
		ИтогГаз                   = 0;
		ИтогГорячееВодоснобжение  = 0;
		ИтогПлатаЗаНайм           = 0;
		ИтогЭлектроэнергия        = 0;
		ИтогТехобслуживание       = 0;
		ИтогОтопление             = 0;
		ИтогХолодноеВодоснабжение = 0;
		
		// Переменные для расчета долей. 
		ИтогОбщТО = 0;
		ИтогДопТО = 0;
		ИтогОснТО = 0;
		
		ИтогОбщОТПЛ = 0;
		ИтогДопОТПЛ = 0;
		ИтогОснОТПЛ = 0;
		
		ИтогИтогоНачислено     = 0;
		ИтогСуммаКомпенсации   = 0;
		
		Пока ВыборкаЛицевойСчет.Следующий() Цикл
			
			ВыборкаФизЛиц = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаФизЛиц.Следующий() Цикл
				
				// Переменные для посчета сумму по графам ГЦЖС.
				Водопровод            = 0;
				ВывозБытовыхОтходов   = 0;
				Газ                   = 0;
				ГорячееВодоснобжение  = 0;
				ПлатаЗаНайм           = 0;
				Электроэнергия        = 0;
				Техобслуживание       = 0;
				Отопление             = 0;
				ХолодноеВодоснабжение = 0;
				
				// Переменные для расчета долей 
				ОбщТО = 0;
				ДопТО = 0;
				ОснТО = 0;
				
				ОбщОТПЛ = 0;
				ДопОТПЛ = 0;
				ОснОТПЛ = 0;
				
				ИтогоНачислено     = 0;
				СуммаКомпенсации   = 0;
				
				РасчетПлощадь = 0;
				
				НомерПП = НомерПП + 1;
				Адрес ="" + ВыборкаФизЛиц.Улица + ", д. " + ВыборкаФизЛиц.Здание + " кв. " + ВыборкаФизЛиц.Квартира;
				
				СтрокаТаблицы.Параметры.Адрес       = Адрес;
				СтрокаТаблицы.Параметры.НомерЛС     = ВыборкаФизЛиц.ЛицевойСчет;
				
				Выборка = ВыборкаФизЛиц.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Если ЗначениеЗаполнено(Выборка.ГрафаОтчетаГЦЖС) Тогда
						
						ИтогоНачислено   = ИтогоНачислено + Выборка.Сумма;
						СуммаКомпенсации = СуммаКомпенсации + (Выборка.Сумма - Выборка.СуммаРазовых);
						
					КонецЕсли; 
					
					Если Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда
						
						Водопровод               = Водопровод + Выборка.Сумма;
						ИтогВодопровод           = ИтогВодопровод + Выборка.Сумма;
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда
						
						ВывозБытовыхОтходов     = ВывозБытовыхОтходов + Выборка.Сумма;
						ИтогВывозБытовыхОтходов = ИтогВывозБытовыхОтходов + Выборка.Сумма; 
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение 
						// БИТ_ЖКХ 25.01.2016 10:14:55 Начало правки...
						ИЛИ Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС
						// БИТ_ЖКХ 25.01.2016 10:14:57 Конец правки.
						Тогда
						
						ХолодноеВодоснабжение = ХолодноеВодоснабжение + Выборка.Сумма;
						ИтогХолодноеВодоснабжение = ИтогХолодноеВодоснабжение + Выборка.Сумма;
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда
						
						Газ     = Газ + Выборка.Сумма;
						ИтогГаз = ИтогГаз + Выборка.Сумма;
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда
						
						ГорячееВодоснобжение     = ГорячееВодоснобжение + Выборка.Сумма;
						ИтогГорячееВодоснобжение = ИтогГорячееВодоснобжение + Выборка.Сумма;
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда
						
						ПлатаЗаНайм     = ПлатаЗаНайм + Выборка.Сумма;
						ИтогПлатаЗаНайм = ИтогПлатаЗаНайм + Выборка.Сумма;
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда
						
						Электроэнергия     = Электроэнергия + Выборка.Сумма;
						ИтогЭлектроэнергия = ИтогЭлектроэнергия + Выборка.Сумма;
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда
						
						Техобслуживание     = Техобслуживание + Выборка.Сумма;
						ИтогТехобслуживание = ИтогТехобслуживание + Выборка.Сумма;
						
						РасчетДолей(Выборка, СтруктураНорм, Истина);
						
						// Итог по перемены долей.
						ОснТО = ОснТО + СтруктураНорм.ОснНорма;
						ДопТо = ДопТО + СтруктураНорм.ДопНорма;
						ОбщТО = ОбщТО + СтруктураНорм.ОбщНорма;
						
					ИначеЕсли Выборка.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда
						
						Отопление          = Отопление + Выборка.Сумма;
						ИтогОтопление      = ИтогОтопление + Выборка.Сумма;
						
						РасчетДолей(Выборка, СтруктураНорм, Истина);
						
						// Итог по перемены долей.
						ОснОТПЛ = ОснОТПЛ + СтруктураНорм.ОснНорма;
						ДопОТПЛ = ДопОТПЛ + СтруктураНорм.ДопНорма;
						ОбщОТПЛ = ОбщОТПЛ + СтруктураНорм.ОбщНорма;
						
					КонецЕсли; 
					
				КонецЦикла; 
				
				СтрокаТаблицы.Параметры.НомерПП                    = НомерПП;
				СтрокаТаблицы.Параметры.ФИО                        = ВыборкаФизЛиц.ФизЛицо;
				СтрокаТаблицы.Параметры.КоличествоЧеловекИспЛьготу = ВыборкаФизЛиц.КоличествоПроживающих;
				СтрокаТаблицы.Параметры.ФактПлощадь                = ВыборкаФизЛиц.ОбщаяПлощадь;
				СтрокаТаблицы.Параметры.ОснованиеЛьгот             = "" + ВыборкаФизЛиц.ДокументНаЛьготу + "(№ " + ВыборкаФизЛиц.НомерДокумента + ", " + Формат(ВыборкаФизЛиц.ДатаВыдачи, "ДФ=dd.MM.yyyy") + ", " + ВыборкаФизЛиц.КемВыдан + ")";
				СтрокаТаблицы.Параметры.КолМесяцевДолга            = ВыборкаФизЛиц.КоличествоМесяцевРасчета;
				
				СтрокаТаблицы.Параметры.РасчетнаяПлощадь           = ?(ВыборкаФизЛиц.ОбщаяПлощадь >= ВыборкаФизЛиц.РасчетнаяПлощадь, ВыборкаФизЛиц.РасчетнаяПлощадь,ВыборкаФизЛиц.ОбщаяПлощадь);
				
				СтрокаТаблицы.Параметры.Водоотведение         = Водопровод;
				СтрокаТаблицы.Параметры.Газ                   = Газ;
				СтрокаТаблицы.Параметры.ГорячееВодоснобжение  = ГорячееВодоснобжение;
				СтрокаТаблицы.Параметры.ПлатаЗаНайм           = ПлатаЗаНайм;
				СтрокаТаблицы.Параметры.Электроэнергия        = Электроэнергия;
				СтрокаТаблицы.Параметры.ХолодноеВодоснабжение = ХолодноеВодоснабжение;
				
				СтрокаТаблицы.Параметры.ТехобслуживаниеОСН = ОснТО;
				СтрокаТаблицы.Параметры.ТехобслуживаниеДОП = ДопТО;
				СтрокаТаблицы.Параметры.ТехобслуживаниеИЛЗ = ОбщТО;
				СтрокаТаблицы.Параметры.ОтоплениеОСН       = ОснОТПЛ;
				СтрокаТаблицы.Параметры.ОтоплениеДОП       = ДопОТПЛ;
				СтрокаТаблицы.Параметры.ОтоплениеИЛЗ       = ОбщОТПЛ;
				
				ИтогОснТО   = ИтогОснТО + ОснТО;
				ИтогДопТо   = ИтогДопТО + ДопТО;
				ИтогОбщТО   = ИтогОбщТО + ОбщТО;
				ИтогОснОТПЛ = ИтогОснОТПЛ + ОснОТПЛ;
				ИтогДопОТПЛ = ИтогДопОТПЛ + ДопОТПЛ;
				ИтогОбщОТПЛ = ИтогОбщОТПЛ + ОбщОТПЛ;
				
				СтрокаТаблицы.Параметры.ИтогоНачислено     = ИтогоНачислено;
				СтрокаТаблицы.Параметры.СуммаКомпенсации   = СуммаКомпенсации;
				
				ИтогИтогоНачислено     = ИтогИтогоНачислено + ИтогоНачислено;
				ИтогСуммаКомпенсации   = ИтогСуммаКомпенсации + СуммаКомпенсации;
				
				ДокументРезультат.Вывести(СтрокаТаблицы);
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		Итог.Параметры.Водоотведение         = ИтогВодопровод;
		Итог.Параметры.Газ                   = ИтогГаз;
		Итог.Параметры.ГорячееВодоснобжение  = ИтогГорячееВодоснобжение;
		Итог.Параметры.ПлатаЗаНайм           = ИтогПлатаЗаНайм;
		Итог.Параметры.Электроэнергия        = ИтогЭлектроэнергия;
		Итог.Параметры.ХолодноеВодоснабжение = ИтогХолодноеВодоснабжение;
		
		Итог.Параметры.ТехобслуживаниеОСН = ИтогОснТО;
		Итог.Параметры.ТехобслуживаниеДОП = ИтогДопТО;
		Итог.Параметры.ТехобслуживаниеИЛЗ = ИтогОбщТО;
		Итог.Параметры.ОтоплениеОСН       = ИтогОснОТПЛ;
		Итог.Параметры.ОтоплениеДОП       = ИтогДопОТПЛ;
		Итог.Параметры.ОтоплениеИЛЗ       = ИтогОбщОТПЛ;
		
		Итог.Параметры.ИтогоНачислено     = ИтогИтогоНачислено;
		
		ДокументРезультат.Вывести(Итог);
		
	КонецЦикла; 
	
	ДокументРезультат.Вывести(Подвал);
КонецПроцедуры

Процедура СформироватьОтчетРасшифровкаПоЛьготе(ДокументРезультат,мВидОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода" , НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода"  , КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация"   , Организация);
	Запрос.УстановитьПараметр("Льгота"        , Льгота);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо,
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу,
	|	бит_ЛьготыПоЛССрезПоследних.НомерДокумента,
	|	бит_ЛьготыПоЛССрезПоследних.ДатаВыдачи,
	|	бит_ЛьготыПоЛССрезПоследних.КемВыдан,
	|	бит_НачислениеПоЛьготамОбороты.Услуга.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Здание КАК Здание,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Квартира КАК Квартира,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	бит_УстановкаЛьготСрезПоследних.Распространение,
	|	СУММА(бит_НачислениеПоЛьготамОбороты.СуммаОборот + бит_НачислениеПоЛьготамОбороты.СуммаСемейнойОборот) КАК Сумма,
	|	бит_ЛьготыПоЛССрезПоследних.СерияДокумента,
	|	СУММА(бит_НачислениеПоЛьготамОбороты.НормаЛьготыОборот) КАК НормаЛьготыОборот
	|ПОМЕСТИТЬ СведенияОЛьготниках
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ЛицевойСчет.Организация = &Организация
	|				И Льгота = &Льгота) КАК бит_НачислениеПоЛьготамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(
	|				&КонецПериода,
	|				ЛицевойСчет.Организация = &Организация
	|					И Льготы = &Льгота) КАК бит_ЛьготыПоЛССрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.ЛицевойСчет = бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет
	|			И бит_НачислениеПоЛьготамОбороты.Льгота = бит_ЛьготыПоЛССрезПоследних.Льготы
	|			И бит_НачислениеПоЛьготамОбороты.ФизЛицо = бит_ЛьготыПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановкаЛьгот.СрезПоследних(&КонецПериода, Льгота = &Льгота) КАК бит_УстановкаЛьготСрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.Услуга = бит_УстановкаЛьготСрезПоследних.Услуга
	|			И бит_НачислениеПоЛьготамОбороты.Льгота = бит_УстановкаЛьготСрезПоследних.Льгота
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо,
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу,
	|	бит_ЛьготыПоЛССрезПоследних.НомерДокумента,
	|	бит_ЛьготыПоЛССрезПоследних.ДатаВыдачи,
	|	бит_ЛьготыПоЛССрезПоследних.КемВыдан,
	|	бит_НачислениеПоЛьготамОбороты.Услуга.ГрафаОтчетаГЦЖС,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Здание,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.Квартира,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет.УлицаЛицевогоСчета,
	|	бит_УстановкаЛьготСрезПоследних.Распространение,
	|	бит_ЛьготыПоЛССрезПоследних.СерияДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|					ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоИмеющихПравоНаЛьготу
	|ПОМЕСТИТЬ ПроживающиеИмеющиеПравоНаЛьготы
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					Таб.ЛицевойСчет КАК ЛицевойСчет
	|				ИЗ
	|					СведенияОЛьготниках КАК Таб)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОЛьготниках.ФизЛицо КАК ФизЛицо,
	|	МАКСИМУМ(бит_ФИОПроживающихСрезПоследних.Фамилия) КАК Фамилия,
	|	МАКСИМУМ(бит_ФИОПроживающихСрезПоследних.Имя) КАК Имя,
	|	МАКСИМУМ(бит_ФИОПроживающихСрезПоследних.Отчество) КАК Отчество,
	|	МАКСИМУМ(СведенияОЛьготниках.Улица) КАК Улица,
	|	МАКСИМУМ(СведенияОЛьготниках.Здание) КАК Дом,
	|	МАКСИМУМ(СведенияОЛьготниках.Квартира) КАК Кв,
	|	МАКСИМУМ(СведенияОЛьготниках.СерияДокумента) КАК СерияДокумента,
	|	МАКСИМУМ(СведенияОЛьготниках.НомерДокумента) КАК НомерДокумента,
	|	МАКСИМУМ(СведенияОЛьготниках.ДатаВыдачи) КАК ДатаВыдачи,
	|	МАКСИМУМ(ЕСТЬNULL(ПроживающиеИмеющиеПравоНаЛьготы.КоличествоИмеющихПравоНаЛьготу, 0)) КАК КолПроживающих,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь) КАК ОбщаяПлощадь,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Водопровод)
	|				ТОГДА СведенияОЛьготниках.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КАНАЛ,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение)
	|					ИЛИ СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС)
	|				ТОГДА СведенияОЛьготниках.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ХВ,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение)
	|				ТОГДА СведенияОЛьготниках.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГВ,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия)
	|				ТОГДА СведенияОЛьготниках.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЭлЭнергия,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Отопление)
	|				ТОГДА СведенияОЛьготниках.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОТОПЛ,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание)
	|					ИЛИ СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм)
	|					ИЛИ СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов)
	// БИТ_ЖКХ 25.01.2016 10:40:07 Начало правки...
	|					ИЛИ СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт)
	// БИТ_ЖКХ 25.01.2016 10:40:07 Конец правки.
	|				ТОГДА СведенияОЛьготниках.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СОДЕРЖ,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОЛьготниках.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание)
	|				ТОГДА СведенияОЛьготниках.НормаЛьготыОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Норма,
	|	МАКСИМУМ(1) КАК КолЛьготников
	|ИЗ
	|	СведенияОЛьготниках КАК СведенияОЛьготниках
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеИмеющиеПравоНаЛьготы КАК ПроживающиеИмеющиеПравоНаЛьготы
	|		ПО СведенияОЛьготниках.ЛицевойСчет = ПроживающиеИмеющиеПравоНаЛьготы.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО СведенияОЛьготниках.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&КонецПериода, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО СведенияОЛьготниках.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОЛьготниках.ФизЛицо
	|ИТОГИ
	|	СУММА(КолПроживающих),
	|	СУММА(КАНАЛ),
	|	СУММА(ХВ),
	|	СУММА(ГВ),
	|	СУММА(ЭлЭнергия),
	|	СУММА(ОТОПЛ),
	|	СУММА(СОДЕРЖ),
	|	СУММА(Норма),
	|	СУММА(КолЛьготников)
	|ПО
	|	ОБЩИЕ";
	
	Макет = ПолучитьМакет(мВидОтчета);
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог   = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Организация  = Организация;
	ОбластьШапка.Параметры.Период       = Формат(КонецПериода, "ДФ=MMММ.yyyy");
	ОбластьШапка.Параметры.ЗаконОЛьготе = Льгота.ПостановлениеОЛьготе;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ВыборкаОбщ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СуммаОтчета = 0;
	
	Пока ВыборкаОбщ.Следующий() Цикл
		
		Выборка = ВыборкаОбщ.Выбрать();
		
		СуммаОтчета = ВыборкаОбщ.КАНАЛ + ВыборкаОбщ.ХВ + ВыборкаОбщ.ГВ + ВыборкаОбщ.ЭлЭнергия + ВыборкаОбщ.ОТОПЛ + ВыборкаОбщ.СОДЕРЖ;
		
		НомерСтроки = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Итого = Выборка.КАНАЛ + Выборка.ХВ + Выборка.ГВ + Выборка.ЭлЭнергия + Выборка.ОТОПЛ + Выборка.СОДЕРЖ;
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			ОбластьСтрока.Параметры.ДатаВыдачи  = Формат(Выборка.ДатаВыдачи, "ДФ=dd.MM.yyyy"); 
			ОбластьСтрока.Параметры.Итого       = Итого;
			
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьИтог.Параметры.Заполнить(ВыборкаОбщ);
		ОбластьИтог.Параметры.Итого = СуммаОтчета;
		
		ДокументРезультат.Вывести(ОбластьИтог);
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|				ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ГлаынйБухгалтер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|				ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Директор
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&КонецПериода,
	|			СтруктурнаяЕдиница = &организация
	|				И (ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|					ИЛИ ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель))) КАК ОтветственныеЛицаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.СуммаИтогоПрописью = ЧислоПрописью(СуммаОтчета,"Л = ru_RU","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	ДокументРезультат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

// Функция получает общую площадь.
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//  <Параметр2>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>.
//
Функция ПолучитьОбщуюПлощадь(Квартира)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	ЕСТЬNULL(бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Квартира"    , Квартира);
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		Возврат 0;
	Иначе
		Результат = ЗАпрос.Выполнить().Выгрузить();
		Возврат ?(Результат[0].ОбщаяПлощадь = 0, 0, Результат[0].ОбщаяПлощадь);
	КонецЕсли; 
	
	
КонецФункции // ()

// Функция формирует таблицу данных.
//
Функция СформироватьТаблицуДанных()
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("КодОрганизации"             , ОбщегоНазначения.ОписаниеТипаСтрока(9));
	Таблица.Колонки.Добавить("Организация"                , ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Год"                        , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	Таблица.Колонки.Добавить("Месяц"                      , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	Таблица.Колонки.Добавить("ТипЖилищногоФонда"          , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	Таблица.Колонки.Добавить("НомерЛС"                    , ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Таблица.Колонки.Добавить("ФИО"                        , ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("КолвоЗарегистрированных"    , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	Таблица.Колонки.Добавить("КолвоПроживающих"           , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	
	// БИТ_ЖКХ 27.05.2014
	Таблица.Колонки.Добавить("КолвоНеПроживающих"         , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	// БИТ_ЖКХ 27.05.2014
	
	Таблица.Колонки.Добавить("ОбщаяПлощадь"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ЖилаяПлощадь"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ТипЗУ"                      , ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("ТипПлиты"                   , ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("КодПлиты"                   , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	Таблица.Колонки.Добавить("КоличествоСемей"            , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	
	// БИТ_ЖКХ 27.05.2014
	Таблица.Колонки.Добавить("КоличествоСемейГаз"         , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	// БИТ_ЖКХ 27.05.2014
	
	Таблица.Колонки.Добавить("АдресЛС"                    , ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Учитываемых"                , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	
	// БИТ_ЖКХ 27.05.2014
	Таблица.Колонки.Добавить("КодТипЖилья"                    , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	Таблица.Колонки.Добавить("Водонагреватель"                , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	Таблица.Колонки.Добавить("ОтоплениеГазом"                 , ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	Таблица.Колонки.Добавить("ЦентральноеГорячееВодоснабжение", ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	// БИТ_ЖКХ 27.05.2014
	
	// БИТ_ЖКХ 23.01.2015{{	
	Таблица.Колонки.Добавить("КоличествоКомнат", ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	// БИТ_ЖКХ 23.01.2015}}
	
	// БИТ ЖКх 31.01.2020
	Таблица.Колонки.Добавить("Этаж", ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	
	// Тарифы.
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаТОПоОбщейПлощади", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаТОПоПроживающим" , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаНайм"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 09.02.2016 15:00:31 Начало правки... 
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаКапРемонт"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 09.02.2016 15:00:34 Конец правки. 
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаОтопление"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаХолВода"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 20.04.2021
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаХолВодаДляГВС"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаГорВода"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаВодоотвод"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаГаз"             , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 29.01.2020
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаБытОтходы"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаЭлектроэнергия"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 15.05.2017 13:21:33 Начало правки...
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаЭлектроэнергияОДН"	, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаХолВодаОДН"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаХВСдляГВСОДН"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаВодоотводОДН"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СтавкаПодогревОДН"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 15.05.2017 13:21:33 Конец правки.
	
	// Начисления.
	Таблица.Колонки.Добавить("ТехобслуживаниеОСН"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ТехобслуживаниеДОП"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ТехобслуживаниеИЛЗ"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ПлатаЗаНайм"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ОтоплениеОСН"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ОтоплениеДОП"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ОтоплениеИЛЗ"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 26.11.2020
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ОтоплениеОбщедомовое" , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Таблица.Колонки.Добавить("ХолодноеВодоснабжение"      , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 20.04.2021
	Таблица.Колонки.Добавить("ХолодноеВодоснабжениеДляГВС"    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("Водоотведение"              , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ГорячееВодоснобжение"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("Электроэнергия"             , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));	
	Таблица.Колонки.Добавить("Газ"                        , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 29.01.2020
	Таблица.Колонки.Добавить("БытОтходы"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ИтогоНачислено"             , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ИтогоНачисленоБезУчетаЛьгот", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("КолМесяцевДолга"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ТОПоОбщейПлощади"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ТОПоПроживающим"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_Найм"              , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 09.02.2016 15:01:09 Начало правки... 
	Таблица.Колонки.Добавить("ВЫГРУЗКА_КапРемонт"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 09.02.2016 15:01:12 Конец правки. 
	Таблица.Колонки.Добавить("ВЫГРУЗКА_Отопление"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ХолВода"           , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 20.04.2021
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ХолВодаДляГВС"     , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ГорВода"           , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_Водоотвод"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_Газ"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_БытОтходы"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_Электроэнергия"    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 15.05.2017 13:22:00 Начало правки...
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ЭлектроэнергияОДН"	, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ХолВодаОДН"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ХВСдляГВСОДН"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ВодоотводОДН"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_ПодогревОДН"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ_ЖКХ 15.05.2017 13:22:00 Конец правки.
	
	// Нормы.
	Таблица.Колонки.Добавить("ВЫГРУЗКА_НормаГорВода"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_НормаХолВода"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 20.04.2021
    Таблица.Колонки.Добавить("ВЫГРУЗКА_НормаХолВодаДляГВС" , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_НормаВодоотвод"     , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_НормаГаз"           , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	// БИТ ЖКХ 29.01.2020
    Таблица.Колонки.Добавить("ВЫГРУЗКА_НормаБытОтходы"     , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_НормаЭлектроэнергия", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	// Долг.
	Таблица.Колонки.Добавить("СуммаЗадолженности"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	// Признаки наличия счетчиков.
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СЧ_ХолВода"         , ОбщегоНазначения.ОписаниеТипаЧисло(1,0));
	// БИТ ЖКХ 20.04.2021
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СЧ_ХолВодаДляГВС"   , ОбщегоНазначения.ОписаниеТипаЧисло(1,0));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СЧ_ГорВода"         , ОбщегоНазначения.ОписаниеТипаЧисло(1,0));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СЧ_Водоотвод"       , ОбщегоНазначения.ОписаниеТипаЧисло(1,0));
	Таблица.Колонки.Добавить("ВЫГРУЗКА_СЧ_Газ"             , ОбщегоНазначения.ОписаниеТипаЧисло(1,0));
	
	Возврат Таблица;
	
КонецФункции // СформироватьТаблицуДанных()                                    

// Процедура выгружает данные в Excel.
//
Процедура ВыгрузитьДанныеВExcel(ТаблицаОтчета) Экспорт
	
	ЕстьОшибки = Ложь;
	
	// Создадим приложение Excel.
	Excel = бит_Выгрузка.СоздатьПриложениеExcel();
	
	Если Excel = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		бит_ОбщегоНазначения.бит_Состояние("Создание файла Excel для заполнения...");
		
		Книга          = Excel.Application.WorkBooks.Add(1);
		ExcelЛист	   = Excel.ActiveSheet;
		
		// БИТ_ЖКХ 16.04.2021
		//РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ЗаполнениеПоУмолчанию();
	    таблицаНастроек = ПолучитьТаблицуНастроек();

		бит_ОбщегоНазначения.бит_Состояние("Установка формата колонок листа Excel...");
		Для каждого СтрокаНастроек Из таблицаНастроек Цикл			
			бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, СтрокаНастроек.ФорматКолонки   , СтрокаНастроек.НомерПоляExcel , Истина);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, СтрокаНастроек.ФорматКолонки, СтрокаНастроек.ИмяПоляExcel		, СтрокаНастроек.НомерПоляExcel , 1);
		конеццикла;
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 1 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 2 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 3 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 4 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 5 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 6 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 7 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 8 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 9 , Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 10, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 11, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 12, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 13, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 14, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 15, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 16, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 17, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 18, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 19, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 20, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 21, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 22, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 23, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 24, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 25, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 26, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 27, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 28, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 29, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 30, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 31, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 32, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 33, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 34, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 35, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 36, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 37, Истина);
		//
		//// БИТ_ЖКХ 15.05.2014
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 38, Истина);
		//// БИТ_ЖКХ 15.05.2014
		//
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 39, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 40, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 41, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 42, Истина);
		//
		//// БИТ_ЖКХ 15.05.2014
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 39, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 40, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 41, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 42, Истина);
		//// БИТ_ЖКХ 15.05.2014
		//
		//// БИТ_ЖКХ 09.02.2016 15:08:55 Начало правки...
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 48, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 49, Истина);
		//// БИТ_ЖКХ 09.02.2016 15:08:55 Конец правки.
		//
		//// БИТ_ЖКХ 15.05.2017 16:49:07 Начало правки...
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 50, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 51, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 52, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 53, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 54, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 55, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 56, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 57, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 58, Истина);
		//бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 59, Истина);
		// БИТ_ЖКХ 15.05.2017 16:49:07 Конец правки.
		
		бит_ОбщегоНазначения.бит_Состояние("Заполнение заголовка листа Excel...");
		
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KODORG"		, 1 , 1); // Код Организации.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAZVORG"	, 2 , 1); // Наименование Организации.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "GOD"		, 3 , 1); // Год.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "MES"		, 4 , 1); // Месяц.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NUMLS"		, 5 , 1); // Номер лицевойго счета.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SOB"		, 6 , 1); // Общая площадь лицевого счета.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TIPZF"		, 7 , 1); // Тип жилищного фонда.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLCHLS"		, 8 , 1); // Количество жильцов.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFTO"		, 9 , 1); // Тариф технического обслуживания по общей площади.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFKR"		, 10, 1); // Тариф за кап. ремонт.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFTO2"		, 11, 1); // Тариф ТО по проживающим.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFOTOP"	, 12, 1); // Тариф за отопление.
		//// БИТ_ЖКХ 15.05.2017 11:51:41 Начало правки...  
		////бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TarNKR"   , 12, 1); // Тариф за найм жилья.
		//
		////бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFNAIM"	, 13, 1); // Тариф за найм жилья.
		//// БИТ_ЖКХ 15.05.2017 11:51:47 Конец правки. 
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFHV"		, 13, 1); // Тариф за холодную воду.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFGV"		, 14, 1); // Тариф за горячую  воду.
		//
		//// БИТ_ЖКХ 14.04.2021
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARGV_VD"	, 15, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARGV_PG"	, 16, 1); // Тариф за водоотвод.
		//

		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFSTOKI"	, 17, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFGAZ"		, 18, 1); // Тариф за газ.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFEE"		, 19, 1); // Тариф за электричество.
		//// БИТ_ЖКХ 29.01.2020
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARTKO"		, 20, 1); // Тариф за вывоз ТБО.			

		//// БИТ_ЖКХ 14.04.2021
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TAR_ODNGV"	, 21, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TAR_ODNHV"	, 22, 1); // Тариф за водоотвод.

		//
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMTO"		, 23, 1); // Начисления технического обслуживания по общей площади.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMKR"		, 24, 1); // Начисления за кап. ремонт.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMTO2"		, 25, 1); // Начисления ТО по проживающим.
		//// БИТ_ЖКХ 09.02.2016 15:06:38 Начало правки... 
		////бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NacNKR"   , 20, 1); // Начисления за найм жилья.
		//
		////бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NACNAIM"    , 22, 1); // Начисления за найм жилья.
		//// БИТ_ЖКХ 09.02.2016 15:06:39 Конец правки. 
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMOTOP"	, 26, 1); // Начисления за отопление.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMHV"		, 27, 1); // Начисления за холодную воду.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGV"		, 28, 1); // Начисления за горячую  воду.
		//
		//// БИТ_ЖКХ 14.04.2021
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGV_VD"	, 29, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGV_PG"	, 30, 1); // Тариф за водоотвод.

		//
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMSTOKI"	, 31, 1); // Начисления за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGAZ"		, 32, 1); // Начисления за газ.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMEE"		, 33, 1); // Начисления за электричество.		
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMTKO"		, 34, 1); // Начисления за вывоз ТБО
		//
		//// БИТ_ЖКХ 14.04.2021
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMODNGV"	, 35, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMODNHV"	, 36, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMOEL"	, 37, 1); // Тариф за водоотвод.
		//		
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHHV"		, 38, 1); // Признак счетчика на холодную воду.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGV"		, 39, 1); // Признак счетчика на горячую воду.
		//
		//// БИТ_ЖКХ 14.04.2021
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGV_VD"	, 40, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGV_PG"	, 41, 1); // Тариф за водоотвод.

		//
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHSTOKI"	, 42, 1); // Признак счетчика на водооведение.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGAZ"		, 43, 1); // Признак счетчика на газ.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMHV"		, 44, 1); // Норма потребления по холодной воде.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGV"		, 45, 1); // Норма потребления по горячей воде.
		//		
		//// БИТ_ЖКХ 14.04.2021
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGV_VD"	, 46, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGV_PG"	, 47, 1); // Тариф за водоотвод.

		//
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMSTOKI"	, 48, 1); // Норма потребления по водоотведению.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGAZ"	, 49, 1); // Норма потребления на газ.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMEE"		, 50, 1); // Норма потребления электричества.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMTKO"	, 51, 1); // Норма потребления на вывоз ТБО.
		//
		//// БИТ_ЖКХ 14.04.2021
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORM_OGV"	, 52, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORM_OHV"	, 53, 1); // Тариф за водоотвод.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMOEL"	, 54, 1); // Тариф за водоотвод.
		//
		//
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLTKO"		, 55, 1); // Т
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KODPLITA"	, 56, 1); // Код плиты.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLFML"		, 57, 1); // Количество семей.
		//
		//// БИТ_ЖКХ 27.05.2014
		////бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLFMLGAZ"	, 42, 1); // Количество семей, совместно пользующихся газом(больше 1, если несколько семей).
		//// БИТ_ЖКХ 27.05.2014
		//
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "FIO"		, 58, 1); // Ответсченное лицо.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "ADRES"		, 59, 1); // Адрес.		
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NUMROOM"    , 60, 1);
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NUMFLOOR"   , 61, 1);
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "DOLG"		, 62, 1); // Задолженность на начало месяца.

		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KNOTKU"		, 63, 1); // Кол проживающих но не зарегистрированых.
		//
		//// БИТ_ЖКХ 27.05.2014
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KODTIPZF"	, 64, 1); // Код жилья: 1-муниципальный, 2-приватизированный, 6-общественный-государственный.
		//// БИТ_ЖКХ 27.20.2020
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "VODONAGR"	, 65, 1); // Признак наличия водонагревателя(1-есть, 0-нет).
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "GAZOTOP"	, 66, 1); // Признак отопления газом(1-отапливается газом, 0-нет).
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "CENTRGV"	, 67, 1); // Признак центрального горячего водоснабжения(1-центральное горячее водоснабжение, 0-нет).
		//// БИТ_ЖКХ 27.05.2014
		//
		//// БИТ_ЖКХ 23.01.2015{{
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOMNAT"		, 68, 1); // Количество комнат.
		//// БИТ_ЖКХ 23.01.2015}}
		//
		//// БИТ_ЖКХ 15.05.2017 16:50:17 Начало правки...
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAEE_O"	, 69, 1); // Начисления за электричество ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFEE_O"	, 70, 1); // Тариф за электричество ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAHV_O"	, 71, 1); // Начисления за холодную воду ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFHV_O"	, 72, 1); // Тариф за холодную воду ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAGV_O"	, 73, 1); // Начисления за ХВС для ГВС ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFGV_O"	, 74, 1); // Тариф за ХВС для ГВС ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NASTOK_O"	, 75, 1); // Начисления за водоотвод ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFSTOK_O"	, 76, 1); // Тариф за водоотвод ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAGV_PGO"	, 77, 1); // Начисления за горячую воду ОДН.
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARGV_PGO"	, 78, 1); // Тариф за горячую воду ОДН.
		//// БИТ_ЖКХ 15.05.2017 16:50:17 Конец правки.
		
		бит_ОбщегоНазначения.бит_Состояние("Заполнение листа Excel...");
		
		НомерСтроки = 2;
		
		Для каждого СтрокаДанных Из ТаблицаОтчета Цикл
			Для каждого СтрокаНастроек Из таблицаНастроек Цикл
			 если ЗначениеЗаполнено(СтрокаНастроек.ПолеДанных) = истина тогда	
			  бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных[СтрокаНастроек.ПолеДанных] , СтрокаНастроек.НомерПоляExcel , НомерСтроки);
			 конецесли; 
		 конеццикла;
		 НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
//		Для каждого СтрокаДанных Из ТаблицаОтчета Цикл
//			
//////			Поле = "КодОрганизации";
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных[Поле] , 1 , НомерСтроки); 
////////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодОрганизации                 , 1 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Организация                    , 2 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Год                            , 3 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Месяц                          , 4 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.НомерЛС                        , 5 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ОбщаяПлощадь                   , 6 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ТипЖилищногоФонда              , 7 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КолвоЗарегистрированных        , 8 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоОбщейПлощади, 9 , НомерСтроки);
//////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаКапРемонт		, 10, НомерСтроки);
//			// БИТ ЖКХ 31.01.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоПроживающим , 11, НомерСтроки);
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаОтопление       , 12, НомерСтроки);
//			// БИТ_ЖКХ 09.02.2016 15:30:30 Начало правки...
//						// БИТ_ЖКХ 09.02.2016 15:30:30 Конец правки.
////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаНайм            , 13, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХолВода         , 13, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаГорВода         , 16, НомерСтроки);
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотвод       , 17, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаГаз             , 18, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергия  , 19, НомерСтроки);			
//			// БИТ_ЖКХ 29.01.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаБытОтходы       , 20, НомерСтроки);					
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ТОПоОбщейПлощади      , 21, НомерСтроки);
//			// БИТ_ЖКХ 29.01.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_КапРемонт				, 22, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ТОПоПроживающим       , 23, НомерСтроки);
//			// БИТ_ЖКХ 09.02.2016 15:30:36 Начало правки...
//						// БИТ_ЖКХ 09.02.2016 15:30:36 Конец правки.
//			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Найм                  , 22, НомерСтроки);
//			// БИТ ЖКХ 26.11.2020
//			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Отопление             , 22, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ОтоплениеОбщедомовое  , 24, НомерСтроки);
//						
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХолВода               , 25, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ГорВода               , 30, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Водоотвод             , 31, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Газ                   , 32, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Электроэнергия        , 33, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_БытОтходы             , 34, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_ХолВода            , 35, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_ГорВода            , 36, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_Водоотвод          , 37, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_Газ                , 38, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаХолВода          , 39, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаГорВода          , 47, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаВодоотвод        , 48, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаГаз              , 49, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаЭлектроэнергия   , 50, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаБытОтходы        , 51, НомерСтроки);			
////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_БытОтходы             , 39, НомерСтроки);	
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодПлиты                       , 52, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоСемей                , 53, НомерСтроки);			
//			// БИТ_ЖКХ 27.05.2014
//			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоСемейГаз             , 42, НомерСтроки);
//			// БИТ_ЖКХ 27.05.2014
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ФИО                            , 54, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.АдресЛС                        , 55, НомерСтроки);			
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоКомнат               , 56, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Этаж                           , 57, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.СуммаЗадолженности             , 58, НомерСтроки);
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КолвоНеПроживающих             , 59, НомерСтроки);
//			
//			// БИТ_ЖКХ 27.05.2014
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодТипЖилья                    , 60, НомерСтроки);
//			// БИТ_ЖКХ 27.20.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Водонагреватель                , 61, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ОтоплениеГазом                 , 62, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ЦентральноеГорячееВодоснабжение, 63, НомерСтроки);
//			// БИТ_ЖКХ 27.05.2014
//			
//			// БИТ_ЖКХ 1.04.2020{{			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоКомнат, 64, НомерСтроки);
//			// БИТ_ЖКХ 23.01.2015}}
//			
//			// БИТ_ЖКХ 15.05.2017 17:23:09 Начало правки...
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ЭлектроэнергияОДН			, 65, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергияОДН	, 66, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХолВодаОДН				, 67, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХолВодаОДН			, 68, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХВСдляГВСОДН				, 69, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХВСдляГВСОДН		, 70, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ВодоотводОДН				, 71, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотводОДН		, 72, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ПодогревОДН				, 73, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаПодогревОДН			, 74, НомерСтроки);
//			// БИТ_ЖКХ 15.05.2017 17:23:09 Конец правки.
//			
//			НомерСтроки = НомерСтроки + 1;
//			
//		КонецЦикла; 
		
		бит_Выгрузка.УстановитьШиринуКолонкиExcel(ExcelЛист, 2);
		бит_Выгрузка.УстановитьШиринуКолонкиExcel(ExcelЛист, 40);
		бит_Выгрузка.УстановитьШиринуКолонкиExcel(ExcelЛист, 41);
		
		ПутьВыгрузки = мПутьВыгрузки;
		ИмяФайла     = мИмяФайла + ".xls";
		Книга.ConflictResolution = 1;
		Книга.SaveAs(ПутьВыгрузки + ИмяФайла);
		Excel.Quit();
		
	Исключение
		ЕстьОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Не удалось заполнить лист Excel!
									|%1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		
		бит_Выгрузка.ЗакрытьПриложениеExcel(Excel);
	иначе
		// БИТ ЖКХ 02.04.2020
		ТекстСообщения = "Файл " + строка(ПутьВыгрузки + ИмяФайла) + " сохранен.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыгрузитьДанныеВExcelОлдовая(ТаблицаОтчета) Экспорт
	
	ЕстьОшибки = Ложь;
	
	// Создадим приложение Excel.
	Excel = бит_Выгрузка.СоздатьПриложениеExcel();
	
	Если Excel = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		бит_ОбщегоНазначения.бит_Состояние("Создание файла Excel для заполнения...");
		
		Книга          = Excel.Application.WorkBooks.Add(1);
		ExcelЛист	   = Excel.ActiveSheet;
		
		бит_ОбщегоНазначения.бит_Состояние("Установка формата колонок листа Excel...");
		
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 1 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 2 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 3 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 4 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 5 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 6 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 7 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 8 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 9 , Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 10, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 11, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 12, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 13, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 14, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 15, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 16, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 17, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 18, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 19, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 20, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 21, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 22, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 23, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 24, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 25, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 26, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 27, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 28, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 29, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 30, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 31, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 32, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 33, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 34, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 35, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 36, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 37, Истина);
		
		// БИТ_ЖКХ 15.05.2014
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 38, Истина);
		// БИТ_ЖКХ 15.05.2014
		
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 39, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "@"   , 40, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 41, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 42, Истина);
		
		// БИТ_ЖКХ 15.05.2014
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 39, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 40, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 41, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0"   , 42, Истина);
		// БИТ_ЖКХ 15.05.2014
		
		// БИТ_ЖКХ 09.02.2016 15:08:55 Начало правки...
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 48, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 49, Истина);
		// БИТ_ЖКХ 09.02.2016 15:08:55 Конец правки.
		
		// БИТ_ЖКХ 15.05.2017 16:49:07 Начало правки...
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 50, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 51, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 52, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 53, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 54, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 55, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 56, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 57, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 58, Истина);
		бит_Выгрузка.УстановитьФорматКолонкиExcel(ExcelЛист, "0,00", 59, Истина);
		// БИТ_ЖКХ 15.05.2017 16:49:07 Конец правки.
		
		бит_ОбщегоНазначения.бит_Состояние("Заполнение заголовка листа Excel...");
		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KODORG"		, 1 , 1); // Код Организации.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAZVORG"	, 2 , 1); // Наименование Организации.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "GOD"		, 3 , 1); // Год.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "MES"		, 4 , 1); // Месяц.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NUMLS"		, 5 , 1); // Номер лицевойго счета.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SOB"		, 6 , 1); // Общая площадь лицевого счета.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TIPZF"		, 7 , 1); // Тип жилищного фонда.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLCHLS"		, 8 , 1); // Количество жильцов.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFTO"		, 9 , 1); // Тариф технического обслуживания по общей площади.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFKR"		, 10, 1); // Тариф за кап. ремонт.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFTO2"		, 11, 1); // Тариф ТО по проживающим.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFOTOP"	, 12, 1); // Тариф за отопление.
		// БИТ_ЖКХ 15.05.2017 11:51:41 Начало правки...  
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TarNKR"   , 12, 1); // Тариф за найм жилья.
		
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFNAIM"	, 13, 1); // Тариф за найм жилья.
		// БИТ_ЖКХ 15.05.2017 11:51:47 Конец правки. 
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFHV"		, 13, 1); // Тариф за холодную воду.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFGV"		, 14, 1); // Тариф за горячую  воду.
		
		// БИТ_ЖКХ 14.04.2021
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARGV_VD"	, 15, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARGV_PG"	, 16, 1); // Тариф за водоотвод.
		

		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFSTOKI"	, 17, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFGAZ"		, 18, 1); // Тариф за газ.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFEE"		, 19, 1); // Тариф за электричество.
		// БИТ_ЖКХ 29.01.2020
        бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARTKO"		, 20, 1); // Тариф за вывоз ТБО.			

		// БИТ_ЖКХ 14.04.2021
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TAR_ODNGV"	, 21, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TAR_ODNHV"	, 22, 1); // Тариф за водоотвод.

		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMTO"		, 23, 1); // Начисления технического обслуживания по общей площади.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMKR"		, 24, 1); // Начисления за кап. ремонт.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMTO2"		, 25, 1); // Начисления ТО по проживающим.
		// БИТ_ЖКХ 09.02.2016 15:06:38 Начало правки... 
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NacNKR"   , 20, 1); // Начисления за найм жилья.
		
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NACNAIM"    , 22, 1); // Начисления за найм жилья.
		// БИТ_ЖКХ 09.02.2016 15:06:39 Конец правки. 
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMOTOP"	, 26, 1); // Начисления за отопление.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMHV"		, 27, 1); // Начисления за холодную воду.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGV"		, 28, 1); // Начисления за горячую  воду.
		
		// БИТ_ЖКХ 14.04.2021
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGV_VD"	, 29, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGV_PG"	, 30, 1); // Тариф за водоотвод.

		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMSTOKI"	, 31, 1); // Начисления за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMGAZ"		, 32, 1); // Начисления за газ.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMEE"		, 33, 1); // Начисления за электричество.		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMTKO"		, 34, 1); // Начисления за вывоз ТБО
		
		// БИТ_ЖКХ 14.04.2021
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMODNGV"	, 35, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMODNHV"	, 36, 1); // Тариф за водоотвод.
        бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SUMOEL"	, 37, 1); // Тариф за водоотвод.
				
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHHV"		, 38, 1); // Признак счетчика на холодную воду.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGV"		, 39, 1); // Признак счетчика на горячую воду.
		
		// БИТ_ЖКХ 14.04.2021
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGV_VD"	, 40, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGV_PG"	, 41, 1); // Тариф за водоотвод.

		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHSTOKI"	, 42, 1); // Признак счетчика на водооведение.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "SCHGAZ"		, 43, 1); // Признак счетчика на газ.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMHV"		, 44, 1); // Норма потребления по холодной воде.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGV"		, 45, 1); // Норма потребления по горячей воде.
				
		// БИТ_ЖКХ 14.04.2021
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGV_VD"	, 46, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGV_PG"	, 47, 1); // Тариф за водоотвод.

		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMSTOKI"	, 48, 1); // Норма потребления по водоотведению.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMGAZ"	, 49, 1); // Норма потребления на газ.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMEE"		, 50, 1); // Норма потребления электричества.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMTKO"	, 51, 1); // Норма потребления на вывоз ТБО.
		
		// БИТ_ЖКХ 14.04.2021
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORM_OGV"	, 52, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORM_OHV"	, 53, 1); // Тариф за водоотвод.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NORMOEL"	, 54, 1); // Тариф за водоотвод.
		
		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLTKO"		, 55, 1); // Т
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KODPLITA"	, 56, 1); // Код плиты.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLFML"		, 57, 1); // Количество семей.
		
		// БИТ_ЖКХ 27.05.2014
		//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOLFMLGAZ"	, 42, 1); // Количество семей, совместно пользующихся газом(больше 1, если несколько семей).
		// БИТ_ЖКХ 27.05.2014
		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "FIO"		, 58, 1); // Ответсченное лицо.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "ADRES"		, 59, 1); // Адрес.		
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NUMROOM"    , 60, 1);
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NUMFLOOR"   , 61, 1);
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "DOLG"		, 62, 1); // Задолженность на начало месяца.

		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KNOTKU"		, 63, 1); // Кол проживающих но не зарегистрированых.
		
		// БИТ_ЖКХ 27.05.2014
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KODTIPZF"	, 64, 1); // Код жилья: 1-муниципальный, 2-приватизированный, 6-общественный-государственный.
		// БИТ_ЖКХ 27.20.2020
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "VODONAGR"	, 65, 1); // Признак наличия водонагревателя(1-есть, 0-нет).
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "GAZOTOP"	, 66, 1); // Признак отопления газом(1-отапливается газом, 0-нет).
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "CENTRGV"	, 67, 1); // Признак центрального горячего водоснабжения(1-центральное горячее водоснабжение, 0-нет).
		// БИТ_ЖКХ 27.05.2014
		
		// БИТ_ЖКХ 23.01.2015{{
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "KOMNAT"		, 68, 1); // Количество комнат.
		// БИТ_ЖКХ 23.01.2015}}
		
		// БИТ_ЖКХ 15.05.2017 16:50:17 Начало правки...
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAEE_O"	, 69, 1); // Начисления за электричество ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFEE_O"	, 70, 1); // Тариф за электричество ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAHV_O"	, 71, 1); // Начисления за холодную воду ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFHV_O"	, 72, 1); // Тариф за холодную воду ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAGV_O"	, 73, 1); // Начисления за ХВС для ГВС ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFGV_O"	, 74, 1); // Тариф за ХВС для ГВС ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NASTOK_O"	, 75, 1); // Начисления за водоотвод ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARIFSTOK_O"	, 76, 1); // Тариф за водоотвод ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "NAGV_PGO"	, 77, 1); // Начисления за горячую воду ОДН.
		бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, "@", "TARGV_PGO"	, 78, 1); // Тариф за горячую воду ОДН.
		// БИТ_ЖКХ 15.05.2017 16:50:17 Конец правки.
		
		бит_ОбщегоНазначения.бит_Состояние("Заполнение листа Excel...");
		
		НомерСтроки = 2;		
			
		Для каждого СтрокаДанных Из ТаблицаОтчета Цикл
			
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодОрганизации                 , 1 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Организация                    , 2 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Год                            , 3 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Месяц                          , 4 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.НомерЛС                        , 5 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ОбщаяПлощадь                   , 6 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ТипЖилищногоФонда              , 7 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КолвоЗарегистрированных        , 8 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоОбщейПлощади, 9 , НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаКапРемонт		, 10, НомерСтроки);
			// БИТ ЖКХ 31.01.2020
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоПроживающим , 11, НомерСтроки);
			
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаОтопление       , 12, НомерСтроки);
			// БИТ_ЖКХ 09.02.2016 15:30:30 Начало правки...
						// БИТ_ЖКХ 09.02.2016 15:30:30 Конец правки.
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаНайм            , 13, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХолВода         , 13, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаГорВода         , 16, НомерСтроки);
			
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотвод       , 17, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаГаз             , 18, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергия  , 19, НомерСтроки);			
			// БИТ_ЖКХ 29.01.2020
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаБытОтходы       , 20, НомерСтроки);					
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ТОПоОбщейПлощади      , 21, НомерСтроки);
			// БИТ_ЖКХ 29.01.2020
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_КапРемонт				, 22, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ТОПоПроживающим       , 23, НомерСтроки);
			// БИТ_ЖКХ 09.02.2016 15:30:36 Начало правки...
						// БИТ_ЖКХ 09.02.2016 15:30:36 Конец правки.
			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Найм                  , 22, НомерСтроки);
			// БИТ ЖКХ 26.11.2020
			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Отопление             , 22, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ОтоплениеОбщедомовое  , 24, НомерСтроки);
						
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХолВода               , 25, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ГорВода               , 30, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Водоотвод             , 31, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Газ                   , 32, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Электроэнергия        , 33, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_БытОтходы             , 34, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_ХолВода            , 35, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_ГорВода            , 36, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_Водоотвод          , 37, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_Газ                , 38, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаХолВода          , 39, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаГорВода          , 47, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаВодоотвод        , 48, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаГаз              , 49, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаЭлектроэнергия   , 50, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаБытОтходы        , 51, НомерСтроки);			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_БытОтходы             , 39, НомерСтроки);	
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодПлиты                       , 52, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоСемей                , 53, НомерСтроки);			
			// БИТ_ЖКХ 27.05.2014
			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоСемейГаз             , 42, НомерСтроки);
			// БИТ_ЖКХ 27.05.2014
			
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ФИО                            , 54, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.АдресЛС                        , 55, НомерСтроки);			
			
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоКомнат               , 56, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Этаж                           , 57, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.СуммаЗадолженности             , 58, НомерСтроки);
			
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КолвоНеПроживающих             , 59, НомерСтроки);
			
			// БИТ_ЖКХ 27.05.2014
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодТипЖилья                    , 60, НомерСтроки);
			// БИТ_ЖКХ 27.20.2020
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Водонагреватель                , 61, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ОтоплениеГазом                 , 62, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ЦентральноеГорячееВодоснабжение, 63, НомерСтроки);
			// БИТ_ЖКХ 27.05.2014
			
			// БИТ_ЖКХ 1.04.2020{{			
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоКомнат, 64, НомерСтроки);
			// БИТ_ЖКХ 23.01.2015}}
			
			// БИТ_ЖКХ 15.05.2017 17:23:09 Начало правки...
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ЭлектроэнергияОДН			, 65, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергияОДН	, 66, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХолВодаОДН				, 67, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХолВодаОДН			, 68, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХВСдляГВСОДН				, 69, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХВСдляГВСОДН		, 70, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ВодоотводОДН				, 71, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотводОДН		, 72, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ПодогревОДН				, 73, НомерСтроки);
			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаПодогревОДН			, 74, НомерСтроки);
			// БИТ_ЖКХ 15.05.2017 17:23:09 Конец правки.
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла; 
		
		бит_Выгрузка.УстановитьШиринуКолонкиExcel(ExcelЛист, 2);
		бит_Выгрузка.УстановитьШиринуКолонкиExcel(ExcelЛист, 40);
		бит_Выгрузка.УстановитьШиринуКолонкиExcel(ExcelЛист, 41);
		
		ПутьВыгрузки = мПутьВыгрузки;
		ИмяФайла     = мИмяФайла + ".xls";
		Книга.ConflictResolution = 1;
		Книга.SaveAs(ПутьВыгрузки + ИмяФайла);
		Excel.Quit();
		
	Исключение
		ЕстьОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Не удалось заполнить лист Excel!
									|%1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		
		бит_Выгрузка.ЗакрытьПриложениеExcel(Excel);
	иначе
		// БИТ ЖКХ 02.04.2020
		ТекстСообщения = "Файл " + строка(ПутьВыгрузки + ИмяФайла) + " сохранен.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли; 
	
КонецПроцедуры


функция ПолучитьТаблицуНастроек()
	
 запрос = новый Запрос;
 запрос.Текст = "ВЫБРАТЬ
                |	бит_НастройкаОтчетаГЦЖС.ПолеДанных КАК ПолеДанных,
                |	бит_НастройкаОтчетаГЦЖС.НомерПоляExcel КАК НомерПоляExcel,
                |	бит_НастройкаОтчетаГЦЖС.ИмяПоляExcel КАК ИмяПоляExcel,
                |	бит_НастройкаОтчетаГЦЖС.ФорматКолонки КАК ФорматКолонки
                |ИЗ
                |	РегистрСведений.бит_НастройкаОтчетаГЦЖС КАК бит_НастройкаОтчетаГЦЖС";
 
 возврат запрос.Выполнить().Выгрузить();
	
конецфункции

// Процедура выгружает данные в DBF.
//
Процедура ВыгрузитьДанныеВDBF(ТаблицаОтчета) Экспорт
	
	ФайлDBF = Новый XBase();
	
	ПутьВыгрузки = мПутьВыгрузки;
	ИмяФайла     = мИмяФайла+".dbf";
	
	ФайлDBF.Кодировка = КодировкаXBase.OEM;
	
	бит_ОбщегоНазначения.бит_Состояние("Создание структуры файла DBF...");
	
	ФайлDBF.Поля.Добавить("KodOrg"   , "N", 9);     // Код Организации.
	ФайлDBF.Поля.Добавить("NazvOrg"  , "S", 50);    // Наименование Организации.
	ФайлDBF.Поля.Добавить("God"      , "N", 4);     // Год.
	ФайлDBF.Поля.Добавить("Mes"      , "N", 2);     // Месяц.
	ФайлDBF.Поля.Добавить("NumLs"    , "S", 9);     // Номер лицевойго счета.
	ФайлDBF.Поля.Добавить("Sob"      , "N", 15, 2); // Общая площадь лицевого счета.
	ФайлDBF.Поля.Добавить("TipZf"    , "N", 1);     // Тип жилищного фонда.
	ФайлDBF.Поля.Добавить("KolChLS"    , "N", 3);     // Количество жильцов.
	ФайлDBF.Поля.Добавить("TarifTO"    , "N", 15, 2); // Тариф технического обслуживания по общей площади.
	ФайлDBF.Поля.Добавить("TARIFKR"		, "N", 15, 2); // Тариф за кап. ремонт.
	ФайлDBF.Поля.Добавить("TarifTO2"   , "N", 15, 2); // Тариф ТО по проживающим.
	// БИТ_ЖКХ 15.05.2017 11:59:42 Начало правки...  
	//ФайлDBF.Поля.Добавить("TarNKR"   , "N", 15, 2); // Тариф за найм жилья.
	
//	ФайлDBF.Поля.Добавить("TARIFNAIM"		, "N", 15, 2); // Тариф за найм жилья.
	// БИТ_ЖКХ 15.05.2017 11:59:45 Конец правки.  
	ФайлDBF.Поля.Добавить("TarifOtop"  , "N", 15, 2); // Тариф за отопление.
	ФайлDBF.Поля.Добавить("TarifHV"    , "N", 15, 2); // Тариф за холодную воду.
	ФайлDBF.Поля.Добавить("TarifGV"    , "N", 15, 2); // Тариф за горячую  воду.
	
	// БИТ_ЖКХ 19.04.2021
	ФайлDBF.Поля.Добавить("TARGV_VD"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("TARGV_PG"   , "N", 15, 2); // Тариф за горячую  воду
	
	ФайлDBF.Поля.Добавить("TarifStoki" , "N", 15, 2); // Тариф за водоотвод.
	ФайлDBF.Поля.Добавить("TarifGaz"   , "N", 15, 2); // Тариф за газ.
	ФайлDBF.Поля.Добавить("TarifEe"    , "N", 15, 2); // Тариф за электричество.	
	
	// БИТ_ЖКХ 29.01.2020
	ФайлDBF.Поля.Добавить("TARTKO"    , "N", 15, 2); // Тариф за вывоз ТБО		
	
	// БИТ_ЖКХ 19.04.2021
	ФайлDBF.Поля.Добавить("TAR_ODNGV"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("TAR_ODNHV"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("TARIFOEL"   , "N", 15, 2); // Тариф за горячую  воду
	
	ФайлDBF.Поля.Добавить("SumTO"    , "N", 15, 2); // Начисления технического обслуживания по общей площади.
	ФайлDBF.Поля.Добавить("SumKR"		, "N", 15, 2); // Начисления за кап. ремонт.
	ФайлDBF.Поля.Добавить("SumTO2"   , "N", 15, 2); // Начисления ТО по проживающим.
	ФайлDBF.Поля.Добавить("SumOtop"  , "N", 15, 2); // Начисления за отопление.
	// БИТ_ЖКХ 09.02.2016 15:43:03 Начало правки... 
	//ФайлDBF.Поля.Добавить("NacNKR"   , "N", 15, 2); // Начисления за найм жилья.

//	ФайлDBF.Поля.Добавить("NACNAIM"		, "N", 15, 2); // Начисления за найм жилья.
	// БИТ_ЖКХ 09.02.2016 15:43:04 Конец правки. 
	ФайлDBF.Поля.Добавить("SumHV"    , "N", 15, 2); // Начисления за холодную воду.
	ФайлDBF.Поля.Добавить("SumGV"    , "N", 15, 2); // Начисления за горячую  воду.
	
	// БИТ_ЖКХ 19.04.2021
	ФайлDBF.Поля.Добавить("SUMGV_VD"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("SUMGV_PG"   , "N", 15, 2); // Тариф за горячую  воду	
	
	ФайлDBF.Поля.Добавить("SumStoki" , "N", 15, 2); // Начисления за водоотвод.
	ФайлDBF.Поля.Добавить("SumGaz"   , "N", 15, 2); // Начисления за газ.
	ФайлDBF.Поля.Добавить("SumEe"    , "N", 15, 2); // Начисления за электричество.
	ФайлDBF.Поля.Добавить("SUMTKO"    , "N", 15, 2); // Начисления за вывоз ТБО
	
	// БИТ_ЖКХ 19.04.2021
	ФайлDBF.Поля.Добавить("SUMODNGV"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("SUMODNHV"   , "N", 15, 2); // Тариф за горячую  воду		
	ФайлDBF.Поля.Добавить("SUMOEL"   , "N", 15, 2); // Тариф за горячую  воду	
	
	ФайлDBF.Поля.Добавить("SchHV"    , "N", 1);     // Признак счетчика на холодную воду.
	ФайлDBF.Поля.Добавить("SchGV"    , "N", 3);     // Признак счетчика на горячую воду.
	
	// БИТ_ЖКХ 19.04.2021
	ФайлDBF.Поля.Добавить("SCHGV_VD"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("SCHGV_PG"   , "N", 15, 2); // Тариф за горячую  воду		
	

	ФайлDBF.Поля.Добавить("SchStoki" , "N", 3);     // Признак счетчика на водооведение.
	ФайлDBF.Поля.Добавить("SchGaz"   , "N", 3);     // Признак счетчика на газ.
	ФайлDBF.Поля.Добавить("NormHV"   , "N", 15, 2); // Норма потребления по холодной воде.
	ФайлDBF.Поля.Добавить("NormGV"   , "N", 15, 2); // Норма потребления по горячей воде.
	
	// БИТ_ЖКХ 19.04.2021
	ФайлDBF.Поля.Добавить("NORMGV_VD"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("NORMGV_PG"   , "N", 15, 2); // Тариф за горячую  воду		

	
	ФайлDBF.Поля.Добавить("NormStoki", "N", 15, 2); // Норма потребления по водоотведению.
	ФайлDBF.Поля.Добавить("NormGaz"  , "N", 15, 2); // Норма потребления на газ.
	ФайлDBF.Поля.Добавить("NormEe"   , "N", 15, 2); // Норма потребления электричества.
	ФайлDBF.Поля.Добавить("NORMTKO"    , "N", 15, 2); // Норма потребления на вывоз ТБО
	
	// БИТ_ЖКХ 19.04.2021
	ФайлDBF.Поля.Добавить("NORM_OGV"   , "N", 15, 2); // Тариф за горячую  воду
	ФайлDBF.Поля.Добавить("NORM_OHV"   , "N", 15, 2); // Тариф за горячую  воду		
    ФайлDBF.Поля.Добавить("NORMOEL"   , "N", 15, 2); // Тариф за горячую  воду

	ФайлDBF.Поля.Добавить("KOLTKO"    , "N", 15, 2); // колво ?

	ФайлDBF.Поля.Добавить("KodPlita" , "N", 1);     // Код плиты.
	ФайлDBF.Поля.Добавить("KolFml"   , "N", 3);     // Количество семей.
	
	// БИТ_ЖКХ 27.05.2014
	//ФайлDBF.Поля.Добавить("KolFmlGaz", "N", 3);     // Количество семей, совместно пользующихся газом(больше 1, если несколько семей).
	// БИТ_ЖКХ 27.05.2014
	
	ФайлDBF.Поля.Добавить("FIO"      , "S", 128);   // Ответсченное лицо.
	ФайлDBF.Поля.Добавить("Adres"    , "S", 128);   // Адрес.
	ФайлDBF.Поля.Добавить("NUMROOM"  , "N", 3);     // Колво комнат
	ФайлDBF.Поля.Добавить("NUMFLOOR" , "N", 3);     // Этаж.
	ФайлDBF.Поля.Добавить("Dolg"     , "N", 15, 2); // Задолженность на начало месяца.
	ФайлDBF.Поля.Добавить("KnotKU"   , "N", 3);     // Кол проживающих но не зарегистрированых.
	
	// БИТ_ЖКХ 27.05.2014
	ФайлDBF.Поля.Добавить("KodTipZF" , "N", 3);     // Код жилья: 1-муниципальный, 2-приватизированный, 6-общественный-государственный.
	
	// БИТ_ЖКХ 19.04.2021
	
	
	//// БИТ_ЖКХ 27.20.2020
	//ФайлDBF.Поля.Добавить("VodoNagr" , "N", 3);     // Признак наличия водонагревателя(1-есть, 0-нет).
	//ФайлDBF.Поля.Добавить("GazOtop"  , "N", 3);     // Признак отопления газом(1-отапливается газом, 0-нет).
	//ФайлDBF.Поля.Добавить("CentrGV"  , "N", 3);     // Признак центрального горячего водоснабжения(1-центральное горячее водоснабжение, 0-нет).
	//// БИТ_ЖКХ 27.05.2014
	//
	//// БИТ_ЖКХ 23.01.2015{{
	//ФайлDBF.Поля.Добавить("KOMNAT"  , "N", 3);     // Количество комнат.
	//// БИТ_ЖКХ 23.01.2015}}
	//
	//// БИТ_ЖКХ 15.05.2017 17:30:33 Начало правки...
	//// БИТ_ЖКХ 29.01.2020
	//ФайлDBF.Поля.Добавить("SumEE_O"		, "N", 15, 2); // Начисления за электричество ОДН.
	//ФайлDBF.Поля.Добавить("TARIFEE_O"		, "N", 15, 2); // Тариф за электричество ОДН.
	//// БИТ_ЖКХ 29.01.2020
	//ФайлDBF.Поля.Добавить("SumHV_O"		, "N", 15, 2); // Начисления за холодную воду ОДН.
	//ФайлDBF.Поля.Добавить("TARIFHV_O"		, "N", 15, 2); // Тариф за холодную воду ОДН.
	//// БИТ_ЖКХ 29.01.2020
	//ФайлDBF.Поля.Добавить("SumGV_O"		, "N", 15, 2); // Начисления за ХВС для ГВС ОДН.
	//ФайлDBF.Поля.Добавить("TARIFGV_O"		, "N", 15, 2); // Тариф за ХВС для ГВС ОДН.
	//// БИТ_ЖКХ 29.01.2020
	//ФайлDBF.Поля.Добавить("SumSTOK_O"	, "N", 15, 2); // Начисления за водоотвод ОДН.
	//ФайлDBF.Поля.Добавить("TARSTOK_O"	, "N", 15, 2); // Тариф за водоотвод ОДН.
	//// БИТ_ЖКХ 29.01.2020
	//ФайлDBF.Поля.Добавить("SumGV_PGO"	, "N", 15, 2); // Начисления за горячую воду ОДН.
	//ФайлDBF.Поля.Добавить("TARGV_PGO"	, "N", 15, 2); // Тариф за горячую воду ОДН.
	//// БИТ_ЖКХ 15.05.2017 17:30:33 Конец правки. 
	
	ФайлDBF.СоздатьФайл(ПутьВыгрузки +""+ ИмяФайла);
	
	бит_ОбщегоНазначения.бит_Состояние("Заполнение структуры файла DBF...");
	
	Для каждого СтрокаДанных Из ТаблицаОтчета Цикл
		
		ФайлDBF.Добавить();
		ФайлDBF.KodOrg    = СтрокаДанных.КодОрганизации;
		ФайлDBF.NazvOrg   = СтрокаДанных.Организация;
		ФайлDBF.God       = СтрокаДанных.Год;
		ФайлDBF.Mes       = СтрокаДанных.Месяц;
		ФайлDBF.NumLs     = СтрокаДанных.НомерЛС;
		ФайлDBF.Sob       = СтрокаДанных.ОбщаяПлощадь;
		ФайлDBF.TipZf     = СтрокаДанных.ТипЖилищногоФонда;
		ФайлDBF.KolChLS     = СтрокаДанных.КолвоЗарегистрированных;
		ФайлDBF.TarifTO     = СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоОбщейПлощади;
		ФайлDBF.TarifTO2    = СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоПроживающим;
		ФайлDBF.TarifOtop   = СтрокаДанных.ВЫГРУЗКА_СтавкаОтопление;
		// БИТ_ЖКХ 15.05.2017 12:00:50 Начало правки...  
		//ФайлDBF.TarNKR    = СтрокаДанных.ВЫГРУЗКА_СтавкаНайм;
		ФайлDBF.TARIFKR		= СтрокаДанных.ВЫГРУЗКА_СтавкаКапРемонт;
//		ФайлDBF.TARIFNAIM		= СтрокаДанных.ВЫГРУЗКА_СтавкаНайм;
		// БИТ_ЖКХ 15.05.2017 12:00:54 Конец правки.  
		// БИТ ЖКХ 20.04.2021
		ФайлDBF.TarifHV     = СтрокаДанных.ВЫГРУЗКА_СтавкаХолВода;
		//ФайлDBF.TarifGV     = СтрокаДанных.ВЫГРУЗКА_СтавкаГорВода;
		
		ФайлDBF.TARGV_VD     = СтрокаДанных.ВЫГРУЗКА_СтавкаХолВодаДляГВС;
		ФайлDBF.TAR_ODNHV     = СтрокаДанных.ВЫГРУЗКА_СтавкаГорВода;

		
		ФайлDBF.TarifStoki  = СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотвод;
		ФайлDBF.TarifGaz    = СтрокаДанных.ВЫГРУЗКА_СтавкаГаз;
		// БИТ ЖКХ  29.01.2020		
		ФайлDBF.TARTKO      = СтрокаДанных.ВЫГРУЗКА_СтавкаБытОтходы;		
		ФайлDBF.SumTKO       = СтрокаДанных.ВЫГРУЗКА_БытОтходы;		
		ФайлDBF.NORMTKO     = СтрокаДанных.ВЫГРУЗКА_НормаБытОтходы;		
//		ФайлDBF.KOLTKO      = СтрокаДанных.ВЫГРУЗКА_БытОтходы;   
		
		ФайлDBF.TarifEe     = СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергия;
		ФайлDBF.SumTO     = СтрокаДанных.ВЫГРУЗКА_ТОПоОбщейПлощади;
		ФайлDBF.SumTO2    = СтрокаДанных.ВЫГРУЗКА_ТОПоПроживающим;
		// БИТ_ЖКХ 09.02.2016 15:45:19 Начало правки... 
		//ФайлDBF.NacNKR    = СтрокаДанных.ВЫГРУЗКА_Найм;
		ФайлDBF.SumKR		= СтрокаДанных.ВЫГРУЗКА_КапРемонт;
//		ФайлDBF.NACNAIM		= СтрокаДанных.ВЫГРУЗКА_Найм;
		// БИТ_ЖКХ 09.02.2016 15:45:21 Конец правки. 
		// БИТ ЖКХ 26.11.2020
		//ФайлDBF.SumOtop   = СтрокаДанных.ВЫГРУЗКА_Отопление;
		ФайлDBF.SumOtop   = СтрокаДанных.ВЫГРУЗКА_ОтоплениеОбщедомовое;
		
		// БИТ ЖКХ 20.04.2021
		ФайлDBF.SumHV     = СтрокаДанных.ВЫГРУЗКА_ХолВода;
		//ФайлDBF.SumGV     = СтрокаДанных.ВЫГРУЗКА_ГорВода;		
		ФайлDBF.SUMGV_VD     = СтрокаДанных.ВЫГРУЗКА_ХолВодаДляГВС;
		ФайлDBF.SUMGV_PG     = СтрокаДанных.ВЫГРУЗКА_ГорВода;

		ФайлDBF.SumStoki  = СтрокаДанных.ВЫГРУЗКА_Водоотвод;
		ФайлDBF.SumGaz    = СтрокаДанных.ВЫГРУЗКА_Газ;
		ФайлDBF.SumEe     = СтрокаДанных.ВЫГРУЗКА_Электроэнергия;
		// БИТ ЖКХ 20.04.2021
		ФайлDBF.SchHV     = СтрокаДанных.ВЫГРУЗКА_СЧ_ХолВода;
		//ФайлDBF.SchGV     = СтрокаДанных.ВЫГРУЗКА_СЧ_ГорВода;
		ФайлDBF.SCHGV_VD     = СтрокаДанных.ВЫГРУЗКА_СЧ_ХолВодаДляГВС;
		ФайлDBF.SCHGV_PG     = СтрокаДанных.ВЫГРУЗКА_СЧ_ГорВода;
	
		
		ФайлDBF.SchStoki  = СтрокаДанных.ВЫГРУЗКА_СЧ_Водоотвод;
		ФайлDBF.SchGaz    = СтрокаДанных.ВЫГРУЗКА_СЧ_Газ;
		// БИТ ЖКХ 20.04.2021
		ФайлDBF.NormHV    = СтрокаДанных.ВЫГРУЗКА_НормаХолВода;
		//ФайлDBF.NormGV    = СтрокаДанных.ВЫГРУЗКА_НормаГорВода;
		ФайлDBF.NORMGV_VD    = СтрокаДанных.ВЫГРУЗКА_НормаХолВодаДляГВС;
		ФайлDBF.NORMGV_PG    = СтрокаДанных.ВЫГРУЗКА_НормаГорВода;

		ФайлDBF.NormStoki = СтрокаДанных.ВЫГРУЗКА_НормаВодоотвод;
		ФайлDBF.NormGaz   = СтрокаДанных.ВЫГРУЗКА_НормаГаз;
		ФайлDBF.NormEe    = СтрокаДанных.ВЫГРУЗКА_НормаЭлектроэнергия;
		ФайлDBF.KodPlita  = СтрокаДанных.КодПлиты;
		ФайлDBF.KolFml    = СтрокаДанных.КоличествоСемей;
		
		// БИТ_ЖКХ 27.05.2014
		//ФайлDBF.KolFmlGaz = СтрокаДанных.КоличествоСемейГаз;
		// БИТ_ЖКХ 27.05.2014
		
		ФайлDBF.FIO       = СтрокаДанных.ФИО;
		ФайлDBF.Adres     = СтрокаДанных.АдресЛС;
		
		ФайлDBF.NUMROOM   = СтрокаДанных.КоличествоКомнат;
	    ФайлDBF.NUMFLOOR  =  СтрокаДанных.Этаж;
		
		ФайлDBF.Dolg      = СтрокаДанных.СуммаЗадолженности;
		ФайлDBF.KnotKU    = СтрокаДанных.КолвоНеПроживающих;
		
		// БИТ_ЖКХ 27.05.2014
		ФайлDBF.KodTipZF  = СтрокаДанных.КодТипЖилья;
		
		// БИТ_ЖКХ 19.04.2021
		// БИТ_ЖКХ 27.20.2020
		//ФайлDBF.VodoNagr  = СтрокаДанных.Водонагреватель;
		//ФайлDBF.GazOtop   = СтрокаДанных.ОтоплениеГазом;
		//ФайлDBF.CentrGV   = СтрокаДанных.ЦентральноеГорячееВодоснабжение;
		//// БИТ_ЖКХ 27.05.2014
		//
		//// БИТ_ЖКХ 23.01.2015{{}}
		//ФайлDBF.KOMNAT   = СтрокаДанных.КоличествоКомнат;
		//// БИТ_ЖКХ 23.01.2015{{}}
		//
		//// БИТ_ЖКХ 15.05.2017 17:34:17 Начало правки...
		//// БИТ_ЖКХ 29.01.2020
		//ФайлDBF.SUMEE_O		= СтрокаДанных.ВЫГРУЗКА_ЭлектроэнергияОДН;
		//ФайлDBF.TARIFEE_O		= СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергияОДН;
		//// БИТ_ЖКХ 29.01.2020
		//ФайлDBF.SUMHV_O		= СтрокаДанных.ВЫГРУЗКА_ХолВодаОДН;
		//ФайлDBF.TARIFHV_O		= СтрокаДанных.ВЫГРУЗКА_СтавкаХолВодаОДН;
		//// БИТ_ЖКХ 29.01.2020
		//ФайлDBF.SUMGV_O		= СтрокаДанных.ВЫГРУЗКА_ХВСдляГВСОДН;
		//ФайлDBF.TARIFGV_O		= СтрокаДанных.ВЫГРУЗКА_СтавкаХВСдляГВСОДН;
		//// БИТ_ЖКХ 29.01.2020
		//ФайлDBF.SUMSTOK_O	= СтрокаДанных.ВЫГРУЗКА_ВодоотводОДН;
		//ФайлDBF.TARSTOK_O 	= СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотводОДН;
		//// БИТ_ЖКХ 29.01.2020
		//ФайлDBF.SUMGV_PGO	= СтрокаДанных.ВЫГРУЗКА_ПодогревОДН;
		//ФайлDBF.TARGV_PGO	= СтрокаДанных.ВЫГРУЗКА_СтавкаПодогревОДН;
		// БИТ_ЖКХ 15.05.2017 17:34:17 Конец правки.
		//
		ФайлDBF.Записать();
		
	КонецЦикла; 
	
	Если ФайлDBF.Открыта() Тогда
		
		ФайлDBF.ЗакрытьФайл();
		
	КонецЕсли;
	
	// БИТ ЖКХ 02.04.2020
	ТекстСообщения = "Файл " + строка(ПутьВыгрузки + ИмяФайла) + " сохранен.";
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// БИТ ЖКх 30.01.2020

Функция ПолучитьНормуНаПроживающих(Выборка)   
	
	если Выборка.КоличествоПроживающих = 1 тогда
	  возврат Выборка.НаОдного;
    конецесли;  
  
    если Выборка.КоличествоПроживающих = 2 тогда
	  возврат Выборка.НаДвоих;
	конецесли; 
	
    если Выборка.КоличествоПроживающих = 3 тогда
	  возврат Выборка.НаСемью;
    конецесли; 
  
    если Выборка.КоличествоПроживающих = 4 тогда
	  возврат Выборка.НаСемью4;
	конецесли; 
	
    если Выборка.КоличествоПроживающих = 5 тогда
	  возврат Выборка.НаСемью5;
	конецесли; 

	если Выборка.КоличествоПроживающих >= 6 тогда
	  возврат Выборка.НаСемью6;
	конецесли; 

КонецФункции // ПолучитьНормуНаПроживающих(Выборка.КоличествоПроживающих)()


#КонецОбласти

#КонецЕсли 
