#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПеременныеМодуля

// Кэш настроек основных параметров.
Перем мКэшОрганизации  Экспорт;          // Структура                   - хранит информацию по организации.
Перем мКэшПолучателяПлатежа  Экспорт;    // Структура                   - хранит информацию по организации.
Перем мКэшПараметрыЖКХ Экспорт;          // Структура                   - хранит параметры учета ЖУХ и настройки печати.
Перем мНастройкиМакета Экспорт;          // СправочникСсылка, Структура - Хранит настройки печати макета.
Перем мОсновнойВариантМакета Экспорт ;   // Хранит основной вариант макета.

// Внешние компаненты.
Перем мВнешняяКомпонента;                // COMОбъект - хранит внешнюю компоненту.

// Текущие данные для печати.
Перем мСтруктураДанных;                  // Структура        - хранит данные шапки печатных документов.
Перем мТаблицаПечати;                    // Таблица значений - Таблица начислений по лицевому счету.
Перем мТаблицаПечатиСчетчиков;           // Таблица значений - Таблица приборов учета.
Перем мТаблицаПерерасчетов;              // Таблица значений - Таблица перерасчетов по лицевому счету.
Перем мТаблицаСвойств;                   // Таблица дополнительны сведений по лицевому счету.
Перем мТаблицаОбщедомовыхСчетчиков;      // Таблица общедомовых счетчиков.

// Выгрузка ГИС ЖКХ.
Перем мТаблицаПлатежиГИСЖКХ12;			// Таблица платежей ГИС ЖКХ 1-2.
Перем мТаблицаПлатежиГИСЖКХ36;			// Таблица платежей ГИС ЖКХ 3-6.
Перем мТаблицаПлатежиГИСЖКХДПД;			// Таблица платежей ГИС ЖКХ ДПД.
Перем мТаблицаПлатежиГИСЖКХНеустойки;	// Таблица платежей ГИС ЖКХ неустойки.

// БИТ ЖКХ 23.02.2020
Перем мТаблицаПлощадейСчетчиков;

Перем мМакет;							// Табличный документ - Текущиймакет печати.

// БИТ ЖКХ 15.04.2020
Перем мТаблицаСчетчиковНаУслугах;
Перем мТаблицаГрупповыхСчетчиковНаУслугах;


#КонецОбласти

#Область ПроцедурыИФункцииФормированияДанных

// Процедура устанавливает макет.
//
// Параметры:
//  Нет.
//
Функция УстановитьМакет() Экспорт
	
	Попытка
		
		Если МакетКв.Предопределенный Тогда
			мОсновнойВариантМакета = МакетКВ;
			мМакет = ПолучитьМакет(МакетКв.ПутьКМакету);
		Иначе
			мОсновнойВариантМакета = МакетКВ.ОсновнойВариант;
			мМакет = МакетКв.ШаблонПечатнойФормы.Получить();
		КонецЕсли; 
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось получить макет.'"));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции 

// Функция получает лицевой счет по отбору.
//
// Параметры:
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьЛСПоОтбору() Экспорт
	
	мЕстьПечатьЗависимых = Ложь;
	
	Отбор = Новый Структура("ПечатьЗависимыхЛС", Истина);
	
	МассивСтрок = СписокЛС.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() > 0  Тогда
		мЕстьПечатьЗависимых = Истина;
	КонецЕсли;
	
	тмпСписокЛС = СписокЛС.Выгрузить();
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Параметры.Вставить("КонецПериода", КонецМесяца(Период));
	ПостроительЗапроса.Параметры.Вставить("Организация" , Организация);
	ПостроительЗапроса.Параметры.Вставить("ТипКвартиры" , ТипКвартиры);
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица,
	|	бит_ЛицевыеСчета.Здание.Участок КАК Участок,
	|	бит_ЛицевыеСчета.Здание.Район КАК Район,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_ЛицевыеСчета.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА НЕ &ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.ПустаяСсылка)
	|				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры = &ТипКвартиры
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если СписокРайонов.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(СписокРайонов.ВыгрузитьКолонку("Район"));
		
		ОтборРайоны = ПостроительЗапроса.Отбор.Добавить("Район");
		ОтборРайоны.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборРайоны.Значение      = Значение;
		ОтборРайоны.Использование = Истина;
		
	КонецЕсли; 
	
	Если СписокУчастков.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(СписокУчастков.ВыгрузитьКолонку("Участок"));
		
		ОтборУчасток = ПостроительЗапроса.Отбор.Добавить("Участок");
		ОтборУчасток.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборУчасток.Значение      = Значение;
		ОтборУчасток.Использование = Истина;
		
	КонецЕсли;
	
	Если СписокУлиц.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(СписокУлиц.ВыгрузитьКолонку("Улица"));
		
		ОтборУлиц = ПостроительЗапроса.Отбор.Добавить("Улица");
		ОтборУлиц.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборУлиц.Значение      = Значение;
		ОтборУлиц.Использование = Истина;
		
	КонецЕсли; 
	
	Если СписокЗданий.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(СписокЗданий.ВыгрузитьКолонку("Здание"));
		
		ОтборЗданий = ПостроительЗапроса.Отбор.Добавить("Здание");
		ОтборЗданий.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборЗданий.Значение      = Значение;
		ОтборЗданий.Использование = Истина;
		
	КонецЕсли;
	
	Если СписокЛС.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(СписокЛС.ВыгрузитьКолонку("ЛицевойСчет"));
		
		Если мЕстьПечатьЗависимых Тогда
			ДобавитьЗависимыеВОсновнойСписок(Значение, тмпСписокЛС);
		КонецЕсли; 
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборЛС.Значение      = Значение;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	
	Результат = ПостроительЗапроса.Результат.Выгрузить();
	
	КоличествоПакетов = Окр((Результат.Количество()/РазмерПакетаПросмотра), 0, РежимОкругления.Окр15как20);
	КоличествоПакетов = ?(КоличествоПакетов <= 0, 1,КоличествоПакетов);
	
	КоличествоПакетовПечати = Окр((Результат.Количество()/РазмерПакетаПечати), 0, РежимОкругления.Окр15как20);
	КоличествоПакетовПечати = ?(КоличествоПакетовПечати <= 0, 1,КоличествоПакетовПечати);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьЗависимыеВОсновнойСписок(СписокЛицевыйСчетов, ТаблицаЛС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЛС", ТаблицаЛС);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.ПечатьЗависимыхЛС
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	&ТаблицаЛС КАК ТаблицаЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗависимыеЛС.ЛицевойСчетЗависимый,
	|	ОсновнаяТаблица.ЛицевойСчет
	|ИЗ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	|		ПО ОсновнаяТаблица.ЛицевойСчет = бит_ЗависимыеЛС.ЛицевойСчет
	|ГДЕ
	|	ОсновнаяТаблица.ПечатьЗависимыхЛС
	|	И НЕ бит_ЗависимыеЛС.ЛицевойСчетЗависимый ЕСТЬ NULL ";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокЛицевыйСчетов.Добавить(Выборка.ЛицевойСчетЗависимый);
		
	КонецЦикла; 
	
КонецФункции

// Фукнция возрващает таблицу содеражащую данные для печати квитанций по Лицевым счета.
//
// Параметры:
//    ТолькоПоОтбору - Булево - Флаг определеяет количество лицевых счетов по отбору либо по размеру пакета просмотра.
//
Функция СформироватьДанныеПечати(ТолькоПоОтбору = Ложь, Печать = Ложь) Экспорт
	
	// Кэширование основных параметров.
	
	Если НЕ УстановитьМакет() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаДанных = Новый ТаблицаЗначений;        
	ТаблицаДанных.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаДанных.Колонки.Добавить("ВладелецЛС" , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаДанных.Колонки.Добавить("Значение");
	
	ОбновитьНастройкиЖКХ();
	ОбновитьКэшОрганизации();
	ОбновитьКэшПолучателяПлатежа();
	
	ПолучитьНастройкуМакета();
	
	// Отбор лицевых счетов.
	
	тмпСписокЛС = СписокЛС.Выгрузить();
	
	ТекущийПакет = ?(ТекущийПакет  = 0 ,1,ТекущийПакет);
	
	тмпТаблицаОтбор =  ПолучитьЛСПоОтбору();
	
	ТекущийПакет       = ?(ТекущийПакет > КоличествоПакетов      , 1, ТекущийПакет);
	ТекущийПакетПечати = ?(ТекущийПакетПечати > КоличествоПакетов, 1, ТекущийПакетПечати);
	
	Если ТолькоПоОтбору Тогда
		
		ОтборЛС = тмпТаблицаОтбор.ВыгрузитьКолонку("ЛицевойСчет");
		
	Иначе
		
		РазмерПакета = ?(Печать, РазмерПакетаПечати     , РазмерПакетаПросмотра);
		НомерПакета  = ?(Печать, ТекущийПакетПечати     , ТекущийПакет);
		КолПакетов   = ?(Печать, КоличествоПакетовПечати,КоличествоПакетов);
		
		МаксимальныйЭлемент = НомерПакета * РазмерПакета;
		МинимальныйЭлемент  = МаксимальныйЭлемент - РазмерПакета;
		МаксимальныйЭлемент = ?(НомерПакета = КолПакетов, тмпТаблицаОтбор.Количество(), МаксимальныйЭлемент);
		
		ОтборЛС = Новый СписокЗначений;
		
		Для Значение = МинимальныйЭлемент По МаксимальныйЭлемент - 1 Цикл
			ОтборЛС.Добавить(тмпТаблицаОтбор[Значение].ЛицевойСчет);
		КонецЦикла;
		
	КонецЕсли;
	
	// БИТ ЖКХ 22.01.2020
	мТаблицаПлощадейСчетчиков = ПолучитьТаблицуПлощадейСчетчиков(ЭтотОбъект.Период);
	
	// БИТ ЖКХ 13.04.2020
    мТаблицаГрупповыхСчетчиковНаУслугах = ПолучитьТаблицуГрупповыхСчетчиковНаУслугах(ЭтотОбъект.Период);	
	мТаблицаСчетчиковНаУслугах = ПолучитьТаблицуСчетчиковНаУслугах(ЭтотОбъект.Период);
	

	// Получение данных по отбору. 
	
	Сальдо = ШаблонИзвещений.Сальдо;
	Кредит = ШаблонИзвещений.Кредит;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("НачалоПериода"			, НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода"			, КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация"				, Организация);
	Запрос.УстановитьПараметр("ДатаНачалаВеденияПоКУ"	, мКэшПараметрыЖКХ.ДатаНачалаВеденияПоКУ);
	Запрос.УстановитьПараметр("ВыводитьЗависимыеЛС"		, мКэшПараметрыЖКХ.ВыводитьЗависимыеЛС);
	Запрос.УстановитьПараметр("ТаблицаНостроек"			, тмпСписокЛС);
	Запрос.УстановитьПараметр("СписокЛС"				, ОтборЛС);
	Запрос.УстановитьПараметр("ШаблонИзвещений"			, ШаблонИзвещений);
	
	ЕстьОтборУслуг = Ложь;
	
	СписокУС = Новый СписокЗначений;
	
	Если НЕ ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам Тогда
		СписокУС.ЗагрузитьЗначения(ШаблонИзвещений.Услуги.ВыгрузитьКолонку("Услуга"));
		ЕстьОтборУслуг = СписокУС.Количество() > 0;
	КонецЕсли;
	
	дополнительныйТекстЗапроса = "";
	если мОсновнойВариантМакета.Наименование = "Единый платежный документ №761/32" тогда 
	
	  дополнительныйТекстЗапроса = " И 
	      | // 21.11.2018
	      |                   (бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно) ИЛИ
	      |                      бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)) ";   
	  
	конецесли;

	
	Запрос.УстановитьПараметр("СписокУС"      , СписокУС);
	Запрос.УстановитьПараметр("ЕстьОтборУслуг", ЕстьОтборУслуг);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНостроек.ЛицевойСчет КАК ЛицевойСчет,
	|	ТаблицаНостроек.ГруппироватьУслуги КАК ГруппироватьУслуги,
	|	ТаблицаНостроек.ПечатьЗависимыхЛС КАК ПечатьЗависимыхЛС
	|ПОМЕСТИТЬ НастройкиЛС
	|ИЗ
	|	&ТаблицаНостроек КАК ТаблицаНостроек
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЗависимыеЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НастройкиЛС.ПечатьЗависимыхЛС, ЛОЖЬ)
	|				ИЛИ &ВыводитьЗависимыеЛС
	|			ТОГДА бит_ЗависимыеЛС.ЛицевойСчетЗависимый
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЛицевойСчетЗависимый,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НастройкиЛС.ПечатьЗависимыхЛС, ЛОЖЬ)
	|				ИЛИ &ВыводитьЗависимыеЛС
	|			ТОГДА бит_ЗависимыеЛС.ЛицевойСчет.Наименование
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК НаименованиеВладелец
	|ПОМЕСТИТЬ ЗависимыеЛС
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиЛС КАК НастройкиЛС
	|		ПО бит_ЗависимыеЛС.ЛицевойСчет = НастройкиЛС.ЛицевойСчет
	|ГДЕ
	|	бит_ЗависимыеЛС.ЛицевойСчет В(&СписокЛС)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_ЗависимыеЛС.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПлатежныеДокументыГИСЖКХ.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПлатежныеДокументыГИСЖКХ.ИдентификаторПД КАК ИдентификаторПД
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПД
	|ИЗ
	|	Справочник.бит_ПлатежныеДокументыГИСЖКХ КАК бит_ПлатежныеДокументыГИСЖКХ
	|ГДЕ
	|	бит_ПлатежныеДокументыГИСЖКХ.ПометкаУдаления = ЛОЖЬ
	|	И бит_ПлатежныеДокументыГИСЖКХ.Отозван = ЛОЖЬ
	|	И бит_ПлатежныеДокументыГИСЖКХ.ШаблонИзвещений = &ШаблонИзвещений
	|	И бит_ПлатежныеДокументыГИСЖКХ.РасчетныйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бит_ПлатежныеДокументыГИСЖКХ.ИдентификаторПД <> """"
	|ИНДЕКСИРОВАТЬ ПО 
	|	бит_ПлатежныеДокументыГИСЖКХ.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.ЕЛСГИСЖКХ КАК ЕЛСГИСЖКХ,
	|	бит_ЛицевыеСчета.ИдентификаторЖКУ КАК ИдентификаторЖКУ,
	|	бит_ЛицевыеСчета.КапРемЕЛСГИСЖКХ КАК КапРемЕЛСГИСЖКХ,
	|	бит_ЛицевыеСчета.КапРемИдентификаторЖКУ КАК КапРемИдентификаторЖКУ,
	|	бит_ЛицевыеСчета.Здание.Участок.Наименование КАК Участок,
	|	бит_ЛицевыеСчета.Здание.Район.Наименование КАК Район,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета.Наименование КАК Улица,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира.Наименование КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	ЕСТЬNULL(бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	|	ЕСТЬNULL(бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь, 0) КАК ЖилаяПлощадь,
	|	ЕСТЬNULL(бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь, 0) КАК ОтапливаемаяПлощадь,
	//Дауров 24.1.1+
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
	//Дауров 24.1.1+
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	ЕСТЬNULL(бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления, 0) КАК КоличествоЕдиницПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_ЛицевыеСчета.Наименование КАК Наименование,
	|	бит_ЛицевыеСчета.Квартира.КоличествоКомнат КАК КоличествоКомнат,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГруппаУслуги КАК ГруппаУслуги,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГруппаУслуги.Приоритет КАК ПриоритетГруп,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ОбщедомовыеНачисления КАК ОбщедомовыеНачисления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
	|	ЕСТЬNULL(ЗависимыеЛС.НаименованиеВладелец, бит_ЛицевыеСчета.Наименование) КАК НаименованиеВладелецЛС,
	|	НастройкиЛС.ГруппироватьУслуги КАК ГруппироватьУслуги,
	|	НастройкиЛС.ПечатьЗависимыхЛС КАК ПечатьЗависимыхЛС,
	|	ЕСТЬNULL(ЗависимыеЛС.ЛицевойСчет, бит_ЛицевыеСчета.Ссылка) КАК ВладелецЛС,
	|	ВЫБОР
	|		КОГДА ЗависимыеЛС.ЛицевойСчетЗависимый ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетЗависимые,
	|	ЕСТЬNULL(ВТ_ИдентификаторыПД.ИдентификаторПД, """") КАК ИдентификаторПД
	|ПОМЕСТИТЬ СведенияПоЛС
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|				&КонецПериода,
	|				ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА Услуга В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ПО бит_ЛицевыеСчета.Ссылка = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиЛС КАК НастройкиЛС
	|		ПО бит_ЛицевыеСчета.Ссылка = НастройкиЛС.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗависимыеЛС КАК ЗависимыеЛС
	|		ПО бит_ЛицевыеСчета.Ссылка = ЗависимыеЛС.ЛицевойСчетЗависимый
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПД КАК ВТ_ИдентификаторыПД
	|		ПО бит_ЛицевыеСчета.Ссылка = ВТ_ИдентификаторыПД.ЛицевойСчет
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И бит_ЛицевыеСчета.Ссылка В(&СписокЛС)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(бит_НачисленияПоУслугамЖКХОбороты.Период) КАК ДатаОплаты,
	|	ВЫБОР
	|		КОГДА бит_УслугиЖКХ.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КапРемонт
	|ПОМЕСТИТЬ ВсеДатаОплат
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&ДатаНачалаВеденияПоКУ,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет В (&СписокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА УслугаЖКХ В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ = бит_УслугиЖКХ.Ссылка
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА бит_УслугиЖКХ.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.Период КАК ДатаОплаты,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход) КАК СуммаОплаты
	|ПОМЕСТИТЬ ВТ_ВсеОплаты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&ДатаНачалаВеденияПоКУ,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет В (&СписокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА УслугаЖКХ В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ = бит_УслугиЖКХ.Ссылка
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	ДатаОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеДатаОплат.ЛицевойСчет КАК ЛицевойСчет,
	|	ВсеДатаОплат.ДатаОплаты КАК ДатаОплатыНеКапРем
	|ПОМЕСТИТЬ ДатаОплатыУслугНеКапРем
	|ИЗ
	|	ВсеДатаОплат КАК ВсеДатаОплат
	|ГДЕ
	|	НЕ ВсеДатаОплат.КапРемонт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеДатаОплат.ЛицевойСчет КАК ЛицевойСчет,
	|	ВсеДатаОплат.ДатаОплаты КАК ДатаОплатыКапРем
	|ПОМЕСТИТЬ ДатаОплатыУслугКапРем
	|ИЗ
	|	ВсеДатаОплат КАК ВсеДатаОплат
	|ГДЕ
	|	ВсеДатаОплат.КапРемонт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеДатаОплат.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(ВсеДатаОплат.ДатаОплаты) КАК ДатаОплаты,
	|	ЕСТЬNULL(ДатаОплатыУслугКапРем.ДатаОплатыКапРем, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплатыКапРем,
	|	ЕСТЬNULL(ДатаОплатыУслугНеКапРем.ДатаОплатыНеКапРем, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплатыНеКапРем
	|ПОМЕСТИТЬ ВТ_ДатыОплатыУслуг
	|ИЗ
	|	ВсеДатаОплат КАК ВсеДатаОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаОплатыУслугНеКапРем КАК ДатаОплатыУслугНеКапРем
	|		ПО ВсеДатаОплат.ЛицевойСчет = ДатаОплатыУслугНеКапРем.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаОплатыУслугКапРем КАК ДатаОплатыУслугКапРем
	|		ПО ВсеДатаОплат.ЛицевойСчет = ДатаОплатыУслугКапРем.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДатаОплат.ЛицевойСчет,
	|	ДатаОплатыУслугКапРем.ДатаОплатыКапРем,
	|	ДатаОплатыУслугНеКапРем.ДатаОплатыНеКапРем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыОплатыУслуг.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ДатыОплатыУслуг.ДатаОплаты КАК ДатаОплаты,
	|	ВТ_ДатыОплатыУслуг.ДатаОплатыКапРем КАК ДатаОплатыКапРем,
	|	ВТ_ДатыОплатыУслуг.ДатаОплатыНеКапРем КАК ДатаОплатыНеКапРем,
	|	ВТ_ВсеОплаты.СуммаОплаты КАК СуммаОплаты
	|ПОМЕСТИТЬ ДатаОплатыУслуг
	|ИЗ
	|	ВТ_ДатыОплатыУслуг КАК ВТ_ДатыОплатыУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеОплаты КАК ВТ_ВсеОплаты
	|		ПО ВТ_ДатыОплатыУслуг.ЛицевойСчет = ВТ_ВсеОплаты.ЛицевойСчет
	|			И ВТ_ДатыОплатыУслуг.ДатаОплаты = ВТ_ВсеОплаты.ДатаОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ПоставщикиУслуг.Ссылка КАК Поставщик,
	|	бит_ПоставщикиУслуг.ПолучательДенежныхСредств КАК ПолучательДенежныхСредств,
	|	бит_ПоставщикиУслуг.ПолучательДенежныхСредств КАК ПолучательПлатежа,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА бит_ПоставщикиУслуг.ПолучательДенежныхСредств ССЫЛКА Справочник.Контрагенты
	|				ТОГДА Контрагенты.Наименование
	|			ИНАЧЕ Организации.Наименование
	|		КОНЕЦ, """") КАК ПолучательПлатежаИмя,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА бит_ПоставщикиУслуг.ПолучательДенежныхСредств ССЫЛКА Справочник.Контрагенты
	|				ТОГДА Контрагенты.ИНН
	|			ИНАЧЕ Организации.ИНН
	|		КОНЕЦ, """") КАК ИНН,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА бит_ПоставщикиУслуг.ПолучательДенежныхСредств ССЫЛКА Справочник.Контрагенты
	|				ТОГДА Контрагенты.КПП
	|			ИНАЧЕ Организации.КПП
	|		КОНЕЦ, """") КАК КПП,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА бит_ПоставщикиУслуг.ПолучательДенежныхСредств ССЫЛКА Справочник.Контрагенты
	|				ТОГДА Контрагенты.ОсновнойБанковскийСчет
	|			ИНАЧЕ Организации.ОсновнойБанковскийСчет
	|		КОНЕЦ, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) КАК ОсновнойБанковскийСчет
	|ПОМЕСТИТЬ ВТ_ВсеСчета
	|ИЗ
	|	Справочник.бит_ПоставщикиУслуг КАК бит_ПоставщикиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО бит_ПоставщикиУслуг.ПолучательДенежныхСредств = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО бит_ПоставщикиУслуг.ПолучательДенежныхСредств = Организации.Ссылка
	|ГДЕ
	|	НЕ(бит_ПоставщикиУслуг.ПолучательДенежныхСредств = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ИЛИ бит_ПоставщикиУслуг.ПолучательДенежныхСредств = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ИЛИ бит_ПоставщикиУслуг.ПолучательДенежныхСредств = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчета.Поставщик КАК Поставщик,
	|	ВТ_ВсеСчета.ПолучательПлатежа КАК ПолучательПлатежа,
	|	ВТ_ВсеСчета.ПолучательПлатежаИмя КАК ПолучательПлатежаИмя,
	|	ВТ_ВсеСчета.ИНН КАК ПолучательИНН,
	|	ВТ_ВсеСчета.КПП КАК ПолучательКПП,
	|	ЕСТЬNULL(БанковскиеСчета.НомерСчета, """") КАК ПолучательРС,
	|	ЕСТЬNULL(Банки.КоррСчет, """") КАК ПолучательКоррСчет,
	|	ЕСТЬNULL(Банки.Код, """") КАК ПолучательБИК,
	|	ЕСТЬNULL(Банки.Наименование, """") КАК ПолучательБанк
	|ПОМЕСТИТЬ ВТ_БанковскиеРеквизитыПоставщиков
	|ИЗ
	|	ВТ_ВсеСчета КАК ВТ_ВсеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО ВТ_ВсеСчета.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО (БанковскиеСчета.Банк = Банки.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет.Здание КАК Здание,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК ОбъемОборот,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемЗданиеИнд,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемЗданиеОбщДом,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемЗданиеИндНорматив,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемЗданиеИндИПУ
	|ПОМЕСТИТЬ ОбъемПоЗданиям
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет.Организация = &Организация
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА Услуга В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет.Здание,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Здание,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент"  + 
	дополнительныйТекстЗапроса + " ТОГДА бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК КоличествоПроживающих,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &НачалоПериода
	|					ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)" + 
	//10.01.2019 58
	дополнительныйТекстЗапроса +
					"ТОГДА бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК КоличествоЗарегистрированных,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|				ТОГДА бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК КоличчествоПоНорме,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|				ТОГДА бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		КОНЕЦ) КАК ОтветсвенноеЛицо,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ЛьготыПоЛССрезПоследних.ФизЛицо) КАК КоличествоЛьготников
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет В (&СписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&КонецПериода, ) КАК бит_ЛьготыПоЛССрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет
	|			И бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ЛьготыПоЛССрезПоследних.ФизЛицо
	|			И (бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &КонецПериода
	|				ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемИнд,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемОбщДом
	|ПОМЕСТИТЬ ОбъемыПоЛС
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет В (&СписокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА Услуга В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга,
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Льгота,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК СубсидияПИ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|					И НЕ бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ.ОбщедомовыеНачисления
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоИнд,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ (бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|						И бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ.ОбщедомовыеНачисления
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоОбщДом,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начислено
	|ПОМЕСТИТЬ ОборотыПоЛС
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет В (&СписокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА УслугаЖКХ В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_КолЕдиницПоСчетчикамОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_КолЕдиницПоСчетчикамОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ЕСТЬNULL(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдиницПоЛСОборот + бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдПодкруткаОборот, 0)) КАК КоличествоЕдиницПоЛС
	|ПОМЕСТИТЬ ФактПоСчетчикам
	|ИЗ
	|	РегистрНакопления.бит_КолЕдиницПоСчетчикам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ЛицевойСчет В (&СписокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА УслугаЖКХ В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_КолЕдиницПоСчетчикамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_КолЕдиницПоСчетчикамОбороты.ЛицевойСчет,
	|	бит_КолЕдиницПоСчетчикамОбороты.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга КАК Услуга,
	|	СУММА(бит_НачислениеПоЛьготамОбороты.СуммаОборот + бит_НачислениеПоЛьготамОбороты.СуммаСемейнойОборот) КАК СуммаЛьгота
	|ПОМЕСТИТЬ ОборотыПоЛьготам
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет В (&СписокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА Услуга В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_НачислениеПоЛьготамОбороты
	|ГДЕ
	|	бит_НачислениеПоЛьготамОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК ОплатаПени,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПениПоЛицевымСчетам
	|				ТОГДА бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоПениЗаПериод
	|ПОМЕСТИТЬ ОборотыПоПени
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет В (&СписокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА УслугаЖКХ В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_НачислениеПениПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот) КАК Сумма,
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.ВидОперации КАК Основание,
	|	ПОДСТРОКА(бит_НачисленияПоУслугамЖКХОбороты.Регистратор.Комментарий, 1, 999) КАК Комментарий,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Перерасчеты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&Началопериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЛицевойСчет В (&СПисокЛС)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА УслугаЖКХ В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОбороты
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	ПОДСТРОКА(бит_НачисленияПоУслугамЖКХОбороты.Регистратор.Комментарий, 1, 999),
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.ВидОперации,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ.Приоритет";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияПоЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияПоЛС.ЕЛСГИСЖКХ КАК ЕЛСГИСЖКХ,
	|	СведенияПоЛС.ИдентификаторЖКУ КАК ИдентификаторЖКУ,
	|	СведенияПоЛС.КапРемЕЛСГИСЖКХ КАК КапРемЕЛСГИСЖКХ,
	|	СведенияПоЛС.КапРемИдентификаторЖКУ КАК КапРемИдентификаторЖКУ,
	|	СведенияПоЛС.ИдентификаторПД КАК ИдентификаторПД,
	//Дауров 24.1.1+
	|	СведенияПоЛС.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
	//Дауров 24.1.1-
	|	СведенияПоЛС.Участок КАК Участок,
	|	СведенияПоЛС.Район КАК Район,
	|	СведенияПоЛС.Улица КАК Улица,
	|	СведенияПоЛС.Здание КАК Здание,
	|	СведенияПоЛС.Корпус КАК Корпус,
	|	СведенияПоЛС.Квартира КАК Квартира,
	|	СведенияПоЛС.ТипКвартиры КАК ТипКвартиры,
	|	СведенияПоЛС.СтатусКвартиры КАК СтатусКвартиры,
	|	СведенияПоЛС.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	СведенияПоЛС.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	СведенияПоЛС.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	СведенияПоЛС.Услуга КАК Услуга,
	|	СведенияПоЛС.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	СведенияПоЛС.ОбщедомовыеНачисления КАК ОбщедомовыеНачисления,
	|	СведенияПоЛС.РежимПотребления КАК РежимПотребления,
	|	СведенияПоЛС.Поставщик КАК Поставщик,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательПлатежа, """") КАК ПолучательПлатежа,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательПлатежаИмя, """") КАК ПолучательПлатежаИмя,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательИНН, """") КАК ПолучательИНН,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательКПП, """") КАК ПолучательКПП,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательРС, """") КАК ПолучательРС,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательКоррСчет, """") КАК ПолучательКоррСчет,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательБИК, """") КАК ПолучательБИК,
	|	ЕСТЬNULL(ВТ_БанковскиеРеквизитыПоставщиков.ПолучательБанк, """") КАК ПолучательБанк,
	|	ЕСТЬNULL(БанковскиеСчета.Владелец, """") КАК КапПолучательПлатежа,
	|	ЕСТЬNULL(БанковскиеСчета.Владелец.Наименование, """") КАК КапПолучательПлатежаИмя,
	|	ЕСТЬNULL(БанковскиеСчета.Владелец.ИНН, """") КАК КапПолучательИНН,
	|	ЕСТЬNULL(БанковскиеСчета.Владелец.КПП, """") КАК КапПолучательКПП,
	|	ЕСТЬNULL(БанковскиеСчета.НомерСчета, """") КАК КапПолучательРС,
	|	ЕСТЬNULL(Банки.КоррСчет, """") КАК КапПолучательКоррСчет,
	|	ЕСТЬNULL(Банки.Код, """") КАК КапПолучательБИК,
	|	ЕСТЬNULL(Банки.Наименование, """") КАК КапПолучательБанк,
	|	СведенияПоЛС.СпособРасчета КАК СпособРасчета,
	|	СведенияПоЛС.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
	|	СведенияПоЛС.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	|	СведенияПоЛС.Приоритет КАК Приоритет,
	|	СведенияПоЛС.ГруппаУслуги КАК ГруппаУслуги,
	|	СведенияПоЛС.ПриоритетГруп КАК ПриоритетГруп,
	|	ЕСТЬNULL(СведенияПоЛС.ГруппироватьУслуги, ЛОЖЬ) КАК ГруппироватьУслуги,
	|	ЕСТЬNULL(СведенияПоЛС.ПечатьЗависимыхЛС, ЛОЖЬ) КАК ПечатьЗависимыхЛС,
	|	ЕСТЬNULL(ОборотыПоЛС.Льгота, 0) КАК Льгота,
	|	ЕСТЬNULL(ОборотыПоЛС.СубсидияПИ, 0) КАК СубсидияПИ,
	|	ЕСТЬNULL(ОборотыПоЛС.Разовые, 0) КАК Разовые,
	|	ЕСТЬNULL(ОборотыПоЛС.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ОборотыПоЛС.Начислено, 0) КАК Начислено,
	|	ЕСТЬNULL(ОборотыПоЛС.НачисленоИНД, 0) КАК НачисленоИНД,
	|	ЕСТЬNULL(ОборотыПоЛС.НачисленоОбщДом, 0) КАК НачисленоОбщДом,
	|	ЕСТЬNULL(ОбъемыПоЛС.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(ОбъемыПоЛС.ОбъемИНД, 0) КАК ОбъемИНД,
	|	ЕСТЬNULL(ОбъемыПоЛС.ОбъемОбщДом, 0) КАК ОбъемОбщДом,
	|	ЕСТЬNULL(Проживающие.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
	|	ЕСТЬNULL(Проживающие.КоличествоЗарегистрированных, 0) КАК КоличествоЗарегистрированных,
	|	ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0) КАК КоличествоПоНорме,
	|	ЕСТЬNULL(Проживающие.КоличествоЛьготников, 0) КАК КоличествоЛьготников,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ПлановаяСтавка, 0) КАК ПлановаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка, 0) КАК СверхНормативнаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.Тариф, 0) КАК Тариф,
	|	Проживающие.ОтветсвенноеЛицо КАК ОтветсвенноеЛицо,
	|	ФактПоСчетчикам.КоличествоЕдиницПоЛС КАК ФактПоСчетчикам,
	|	ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток, 0) КАК СальдоПени,
	|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток, 0) КАК Сальдо,
	|	СведенияПоЛС.Наименование КАК Наименование,
	|	СведенияПоЛС.НаименованиеВладелецЛС КАК НаименованиеВладелецЛС,
	|	ЕСТЬNULL(ОборотыПоЛьготам.СуммаЛьгота, 0) КАК СуммаЛьгота,
	|	СведенияПоЛС.КоличествоКомнат КАК КоличествоКомнат,
	|	бит_УслугиЖКХСпособыРасчета.ЕдИзм КАК ЕдИзм,
	|	ДатаОплатыУслуг.ДатаОплаты КАК ДатаОплаты,
	|	ЕСТЬNULL(ДатаОплатыУслуг.СуммаОплаты, 0) КАК СуммаПоследнейОплаты,
	|	ДатаОплатыУслуг.ДатаОплатыКапРем КАК ДатаОплатыКапРем,
	|	ДатаОплатыУслуг.ДатаОплатыНеКапРем КАК ДатаОплатыНеКапРем,
	|	ЕСТЬNULL(НормыПоУслугам.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(НормыПоУслугам.НормативПотребленияПоКу, 0) КАК НормативИНД,
	|	ЕСТЬNULL(НормыПоУслугамОбщДом.НормативОДН, 0) КАК НормативОбщДом,
	|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеИнд, 0) КАК ОбъемЗданиеИнд,
	|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеОбщДом, 0) КАК ОбъемЗданиеОбщДом,
	|	СведенияПоЛС.ВладелецЛС КАК ВладелецЛС,
	|	ЕСТЬNULL(бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Норма, 0) КАК Норма,
	|	ЕСТЬNULL(бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.СверхНорма, 0) КАК СверхНорма,
	|	СведенияПоЛС.ПриоритетЗависимые КАК ПриоритетЗависимые,
	|	ЕСТЬNULL(ОборотыПоПени.ОплатаПени, 0) КАК ОплатаПени,
	|	ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОстатки1.СуммаПениОстаток, 0) КАК ДолгПени,
	|	ЕСТЬNULL(ОборотыПоПени.НачисленоПениЗаПериод, 0) КАК НачисленоПениЗаПериод,
	|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеИндИПУ, 0) КАК ОбъемЗданиеИндИПУ,
	|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеИндНорматив, 0) КАК ОбъемЗданиеИндНорматив
	|ИЗ
	|	СведенияПоЛС КАК СведенияПоЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемПоЗданиям КАК ОбъемПоЗданиям
	|		ПО СведенияПоЛС.Услуга = ОбъемПоЗданиям.Услуга
	|			И СведенияПоЛС.Здание = ОбъемПоЗданиям.Здание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаОплатыУслуг КАК ДатаОплатыУслуг
	|		ПО СведенияПоЛС.ЛицевойСчет = ДатаОплатыУслуг.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПоЛС КАК ОборотыПоЛС
	|		ПО СведенияПоЛС.ЛицевойСчет = ОборотыПоЛС.ЛицевойСчет
	|			И СведенияПоЛС.Услуга = ОборотыПоЛС.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО СведенияПоЛС.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|				&КонецПериода,
	|				ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА Услуга В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО СведенияПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И СведенияПоЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			И СведенияПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И СведенияПоЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	|			И СведенияПоЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|			И СведенияПоЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактПоСчетчикам КАК ФактПоСчетчикам
	|		ПО СведенияПоЛС.Услуга = ФактПоСчетчикам.Услуга
	|			И СведенияПоЛС.ЛицевойСчет = ФактПоСчетчикам.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(
	|				&КонецПериода,
	|				ЛицевойСчет В (&СписокЛС)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА УслугаЖКХ В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	|		ПО СведенияПоЛС.ЛицевойСчет = бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет
	|			И СведенияПоЛС.Услуга = бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	|				&НачалоПериода,
	|				ЛицевойСчет В (&СписокЛС)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА УслугаЖКХ В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОстатки
	|		ПО СведенияПоЛС.ЛицевойСчет = бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет
	|			И СведенияПоЛС.Услуга = бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПоЛьготам КАК ОборотыПоЛьготам
	|		ПО СведенияПоЛС.ЛицевойСчет = ОборотыПоЛьготам.ЛицевойСчет
	|			И СведенияПоЛС.Услуга = ОборотыПоЛьготам.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|		ПО СведенияПоЛС.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|			И СведенияПоЛС.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|				&КонецПериода,
	|				ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА Услуга В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК НормыПоУслугам
	|		ПО СведенияПоЛС.Услуга = НормыПоУслугам.Услуга
	|			И СведенияПоЛС.СпособРасчета = НормыПоУслугам.СпособРасчетаПоУслуге
	|			И СведенияПоЛС.РежимПотребления = НормыПоУслугам.РежимПотребления
	|			И СведенияПоЛС.СтатусКвартиры = НормыПоУслугам.СтатусКвартиры
	|			И СведенияПоЛС.ТипКвартиры = НормыПоУслугам.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|				&КонецПериода,
	|				ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
	|					И СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
	|					И СпособРасчетаПоУслуге = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА Услуга В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК НормыПоУслугамОбщДом
	|		ПО СведенияПоЛС.Услуга = НормыПоУслугамОбщДом.Услуга
	|			И СведенияПоЛС.РежимПотребления = НормыПоУслугамОбщДом.РежимПотребления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыПоЛС КАК ОбъемыПоЛС
	|		ПО СведенияПоЛС.ЛицевойСчет = ОбъемыПоЛС.ЛицевойСчет
	|			И СведенияПоЛС.Услуга = ОбъемыПоЛС.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОНормативахНачисленийЗакрытогоПериода.СрезПоследних(
	|				&КонецПериода,
	|				ЛицевойСчет В (&СписокЛС)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА Услуга В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И Период >= &НачалоПериода) КАК бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних
	|		ПО СведенияПоЛС.ЛицевойСчет = бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет
	|			И СведенияПоЛС.Услуга = бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПоПени КАК ОборотыПоПени
	|		ПО СведенияПоЛС.Услуга = ОборотыПоПени.Услуга
	|			И СведенияПоЛС.ЛицевойСчет = ОборотыПоПени.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(
	|				&НачалоПериода,
	|				ЛицевойСчет В (&СписокЛС)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА УслугаЖКХ В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК бит_НачислениеПениПоУслугамЖКХОстатки1
	|		ПО СведенияПоЛС.ЛицевойСчет = бит_НачислениеПениПоУслугамЖКХОстатки1.ЛицевойСчет
	|			И СведенияПоЛС.Услуга = бит_НачислениеПениПоУслугамЖКХОстатки1.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БанковскиеРеквизитыПоставщиков КАК ВТ_БанковскиеРеквизитыПоставщиков
	|		ПО СведенияПоЛС.Поставщик = ВТ_БанковскиеРеквизитыПоставщиков.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО СведенияПоЛС.Здание = бит_СписокЗданий.Ссылка
	|			И (СведенияПоЛС.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО (БанковскиеСчета.Ссылка = бит_СписокЗданий.БанковскийСчетКапРемонт)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО (Банки.Ссылка = БанковскиеСчета.Банк)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеВладелецЛС,
	|	ПриоритетЗависимые,
	|	Наименование,
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(ЕЛСГИСЖКХ),
	|	МАКСИМУМ(ИдентификаторЖКУ),
	|	МАКСИМУМ(КапРемЕЛСГИСЖКХ),
	|	МАКСИМУМ(КапРемИдентификаторЖКУ),
	|	МАКСИМУМ(ИдентификаторПД),
	//Дауров 24.1.1+
	|	МАКСИМУМ(лб_ПредставлениеКвартиры),
	//Дауров 24.1.1-
	|	МАКСИМУМ(Участок),
	|	МАКСИМУМ(Район),
	|	МАКСИМУМ(Улица),
	|	МАКСИМУМ(Здание),
	|	МАКСИМУМ(Корпус),
	|	МАКСИМУМ(Квартира),
	|	МАКСИМУМ(ТипКвартиры),
	|	МАКСИМУМ(СтатусКвартиры),
	|	МАКСИМУМ(ОбщаяПлощадь),
	|	МАКСИМУМ(ЖилаяПлощадь),
	|	МАКСИМУМ(ОтапливаемаяПлощадь),
	|	МАКСИМУМ(РежимПотребления),
	|	МАКСИМУМ(Поставщик),
	|	МАКСИМУМ(СпособРасчета),
	|	МАКСИМУМ(КоличествоЕдиницПотребления),
	|	МАКСИМУМ(Приоритет),
	|	МАКСИМУМ(ГруппироватьУслуги),
	|	МАКСИМУМ(ПечатьЗависимыхЛС),
	|	СУММА(Льгота),
	|	СУММА(СубсидияПИ),
	|	СУММА(Разовые),
	|	СУММА(Оплата),
	|	СУММА(Начислено),
	|	СУММА(НачисленоОбщДом),
	|	МАКСИМУМ(КоличествоПроживающих),
	|	МАКСИМУМ(КоличествоЗарегистрированных),
	|	МАКСИМУМ(КоличествоПоНорме),
	|	МАКСИМУМ(КоличествоЛьготников),
	|	МАКСИМУМ(ПлановаяСтавка),
	|	МАКСИМУМ(ОсновнаяСтавка),
	|	МАКСИМУМ(СверхНормативнаяСтавка),
	|	МАКСИМУМ(Тариф),
	|	МАКСИМУМ(ОтветсвенноеЛицо),
	|	СУММА(ФактПоСчетчикам),
	|	СУММА(СальдоПени),
	|	СУММА(Сальдо),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(НаименованиеВладелецЛС),
	|	СУММА(СуммаЛьгота),
	|	МАКСИМУМ(КоличествоКомнат),
	|	МАКСИМУМ(ДатаОплаты),
	|	МАКСИМУМ(СуммаПоследнейОплаты),
	|	МАКСИМУМ(ДатаОплатыКапРем),
	|	МАКСИМУМ(ДатаОплатыНеКапРем),
	|	МАКСИМУМ(ВладелецЛС),
	|	МАКСИМУМ(ПриоритетЗависимые),
	|	СУММА(ОплатаПени),
	|	СУММА(ДолгПени),
	|	СУММА(НачисленоПениЗаПериод)
	|ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) = 0
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) = 0
	|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|						ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|					КОНЕЦ
	|			ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|		КОНЕЦ) КАК ДоПоказаний,
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК ЛицевойСчет,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный КАК Многотарифный,
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки,
	|	СУММА(ЕСТЬNULL(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдиницПоЛСОборот, 0) + ЕСТЬNULL(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдПодкруткаОборот, 0)) КАК КоличествоЕдиниц,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект.Наименование КАК Наименование,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.НаименованиеСокращенное КАК СокрНаименование,
	|	ВЫРАЗИТЬ(бит_СчетчикиНаУслугахСрезПоследних.Услуга.НаименованиеПолное КАК СТРОКА(150)) КАК НаименованиеПолное,
	|	ЕСТЬNULL(бит_УслугиЖКХСпособыРасчета.ЕдИзм, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяССылка)) КАК ЕдИзм,
	|	МАКСИМУМ(бит_НормыНаУслугиИнд.НормативПотребленияПоКу) КАК НормативИнд,
	|	МАКСИМУМ(ЕСТЬNULL(бит_НормыНаУслугиОбщДом.НормативОДН, 0)) КАК НормативОбщДом,
	|	МАКСИМУМ(ОбъемПоЗданиям.ОбъемЗданиеОбщДом) КАК ОбъемОбщДом,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ бит_СчетчикиНаУслугахСрезПоследних.Услуга.ОбщедомовыеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) = 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) = 0
	|										ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|									ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|								КОНЕЦ
	|						ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоПоказанийИнд,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_СчетчикиНаУслугахСрезПоследних.Услуга.ОбщедомовыеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) = 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) = 0
	|										ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|									ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|								КОНЕЦ
	|						ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоПоказанийОбщДом,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_СчетчикиНаУслугахСрезПоследних.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемИнд
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&КонецПериода,
	|			Объект В (&СписокЛС)
	|				И ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборУслуг
	|						ТОГДА Услуга В (&СписокУС)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бит_СчетчикиНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|				&КонецПериода,
	|				Объект В (&СписокЛС)
	|					И Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА Услуга В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО (бит_ПоказанияСчетчиковОстатки.Объект = бит_СчетчикиНаУслугахСрезПоследних.Объект)
	|			И (бит_ПоказанияСчетчиковОстатки.Услуга = бит_СчетчикиНаУслугахСрезПоследних.Услуга)
	|			И (бит_ПоказанияСчетчиковОстатки.Счетчик = бит_СчетчикиНаУслугахСрезПоследних.Счетчик)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&КонецПериода, ) КАК бит_ПоверкаСчетчиковСрезПоследних
	|		ПО (бит_ПоверкаСчетчиковСрезПоследних.Счетчик = бит_СчетчикиНаУслугахСрезПоследних.Счетчик)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_КолЕдиницПоСчетчикам.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				ЛицевойСчет В (&СписокЛС)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА УслугаЖКХ В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК бит_КолЕдиницПоСчетчикамОбороты
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_КолЕдиницПоСчетчикамОбороты.ЛицевойСчет
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_КолЕдиницПоСчетчикамОбороты.УслугаЖКХ
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_КолЕдиницПоСчетчикамОбороты.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоЛС КАК СведенияПоЛС
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|					&КонецПериода,
	|					ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА Услуга В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК бит_НормыНаУслугиИнд
	|			ПО СведенияПоЛС.Услуга = бит_НормыНаУслугиИнд.Услуга
	|				И СведенияПоЛС.СпособРасчета = бит_НормыНаУслугиИнд.СпособРасчетаПоУслуге
	|				И СведенияПоЛС.РежимПотребления = бит_НормыНаУслугиИнд.РежимПотребления
	|				И СведенияПоЛС.СтатусКвартиры = бит_НормыНаУслугиИнд.СтатусКвартиры
	|				И СведенияПоЛС.ТипКвартиры = бит_НормыНаУслугиИнд.ТипКвартиры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|					&КонецПериода,
	|					ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
	|						И СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
	|						И СпособРасчетаПоУслуге = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|						И ВЫБОР
	|							КОГДА &ЕстьОтборУслуг
	|								ТОГДА Услуга В (&СписокУС)
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ) КАК бит_НормыНаУслугиОбщДом
	|			ПО СведенияПоЛС.Услуга = бит_НормыНаУслугиОбщДом.Услуга
	|				И СведенияПоЛС.РежимПотребления = бит_НормыНаУслугиОбщДом.РежимПотребления
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|			ПО СведенияПоЛС.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|				И СведенияПоЛС.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = СведенияПоЛС.ЛицевойСчет
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = СведенияПоЛС.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемПоЗданиям КАК ОбъемПоЗданиям
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Услуга = ОбъемПоЗданиям.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Объект.Здание = ОбъемПоЗданиям.Здание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				ЛицевойСчет В (&СписокЛС)
	|					И ВЫБОР
	|						КОГДА &ЕстьОтборУслуг
	|							ТОГДА Услуга В (&СписокУС)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ОбъемыПоУслугамЖКХОбороты.Счетчик
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный) И
	|   бит_СчетчикиНаУслугахСрезПоследних.Использовать = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга,
	|	ЕСТЬNULL(бит_УслугиЖКХСпособыРасчета.ЕдИзм, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяССылка)),
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет,
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект.Наименование,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность,
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.НаименованиеСокращенное,
	|	ВЫРАЗИТЬ(бит_СчетчикиНаУслугахСрезПоследних.Услуга.НаименованиеПолное КАК СТРОКА(150))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Многотарифный,
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(ДоПоказаний),
	|	МАКСИМУМ(Многотарифный),
	|	МАКСИМУМ(КоличествоЕдиниц),
	|	МАКСИМУМ(НормативИнд),
	|	МАКСИМУМ(НормативОбщДом),
	|	МАКСИМУМ(ОбъемОбщДом),
	|	МАКСИМУМ(ДоПоказанийИнд),
	|	МАКСИМУМ(ДоПоказанийОбщДом),
	|	МАКСИМУМ(ОбъемИнд)
	|ПО
	|	ЛицевойСчет,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Перерасчеты.Регистратор КАК Регистратор,
	|	ВТ_Перерасчеты.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Перерасчеты.Сумма КАК Сумма,
	|	ВТ_Перерасчеты.Основание КАК Основание,
	|	ВТ_Перерасчеты.Комментарий КАК Комментарий,
	|	ВТ_Перерасчеты.Услуга КАК Услуга,
	|	ВТ_Перерасчеты.Приоритет КАК Приоритет,
	|	СведенияПоЛС.Поставщик КАК Поставщик
	|ИЗ
	|	ВТ_Перерасчеты КАК ВТ_Перерасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоЛС КАК СведенияПоЛС
	|		ПО (СведенияПоЛС.ЛицевойСчет = ВТ_Перерасчеты.ЛицевойСчет)
	|			И (СведенияПоЛС.Услуга = ВТ_Перерасчеты.Услуга)
	|ИТОГИ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачислениеПоЛьготамОбороты.Льгота.Наименование КАК Льгота,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет В (&СписокЛС)) КАК бит_НачислениеПоЛьготамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Льгота.Наименование";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаЛьгот = РезультатЗапроса[3].Выгрузить();
	
	ВыборкаЛС = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		Район    = ВыборкаЛС.Район;
		Улица    = ВыборкаЛС.Улица;
		Здание   = ВыборкаЛС.Здание;
		Корпус   = ВыборкаЛС.Корпус;
		Квартира = ВыборкаЛС.Квартира;
		
		Если ИспользоватьНастройкиПечатиАдреса Тогда
			
			НеПечататьРайон    = НеПечататьРайон;
			НеПечататьУлицу    = НеПечататьУлицу;
			НеПечататьДом      = НеПечататьДом;
			НеПечататьКорпус   = НеПечататьКорпус;
			НеПечататьКвартиру = НеПечататьКвартиру;
			
			ПрефиксРайон    = ПрефиксРайон;
			ПрефиксУлица    = ПрефиксУлица;
			ПрефиксДом      = ПрефиксДом;
			ПрефиксКорпус   = ПрефиксКорпус;
			ПрефиксКвартира = ПрефиксКвартира;
			
		Иначе
			
			НеПечататьРайон    = мКэшПараметрыЖКХ.НеПечататьРайон;
			НеПечататьУлицу    = мКэшПараметрыЖКХ.НеПечататьУлица;
			НеПечататьДом      = мКэшПараметрыЖКХ.НеПечататьДом;                 
			НеПечататьКорпус   = мКэшПараметрыЖКХ.НеПечататьКорпус;
			НеПечататьКвартиру = мКэшПараметрыЖКХ.НеПечататьКвартира;
			
			ПрефиксРайон    = мКэшПараметрыЖКХ.ПрефиксРайон;
			ПрефиксУлица    = мКэшПараметрыЖКХ.ПрефиксУлица;
			ПрефиксДом      = мКэшПараметрыЖКХ.ПрефиксДом;
			ПрефиксКорпус   = мКэшПараметрыЖКХ.ПрефиксКорпус;
			ПрефиксКвартира = мКэшПараметрыЖКХ.ПрефиксКвартира;
			
		КонецЕсли;
		
		Если ЭтотОбъект.БезПрефиксаНежилогоПомещения И
			ВыборкаЛС.ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение Тогда
			ПрефиксКвартира = "";
		КонецЕсли;
		
		СтрРайон    = ?(НеПечататьРайон   , "", ""+ ПрефиксРайон +" "+ СокрЛП(Строка(Район)) + ",");
		СтрУлица    = ?(НеПечататьУлицу   , "", ""+ ПрефиксУлица +" "+ СокрЛП(Строка(Улица)) + ",");
		СтрДом      = ?(НеПечататьДом     , "", " " + ПрефиксДом +" "+ СокрЛП(Строка(Здание))+",") ;
		СтрКорпус   = ?(НеПечататьКорпус  , "", ?(ЗначениеЗаполнено(Корпус)," "+ПрефиксКорпус+ " " +СокрЛП(Строка(Корпус)) + ",",""));
		СтрКвартира = ?(НеПечататьКвартиру, "", " " + ПрефиксКвартира +" "+ СокрЛП(Строка(Квартира)));
		
		Адрес = "" + СтрРайон + СтрУлица + СтрДом + СтрКорпус + СтрКвартира;
		
		СложнаяЛьгота = Ложь;
		ОписаниеЛьгот = "";
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", ВыборкаЛС.ЛицевойСчет);
		ПоискЛьготы = ТаблицаЛьгот.НайтиСтроки(Отбор);
		
		СложнаяЛьгота = ПоискЛьготы.Количество() > 1;
		
		Для каждого СтрокаЛьготы Из ПоискЛьготы Цикл
			ОписаниеЛьгот = ОписаниеЛьгот + "" + ?(ОписаниеЛьгот = "","",", ") + СокрЛП(СтрокаЛьготы.Льгота);
		КонецЦикла; 
		
		СтруктураДанных = ПолучитьСтруктуруДанных();
		ЗаполнитьСтруктураДанных(СтруктураДанных);
		
		#Если НЕ ВнешнееСоединение Тогда
			// Заполнение таблицы значений свойств.
			ЗначенияСвойств = ЗаполнитьТаблицуЗначенийСвойств(ВыборкаЛС.ЛицевойСчет);
		#Иначе
			ЗначенияСвойств = Новый ТаблицаЗначений;
		#КонецЕсли
		
		ПолучательПредставление = ?(мНастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации,
		мКэшОрганизации.НаименованиеСокращенное,
		мКэшОрганизации.НаименованиеПолное);
		
		СтруктураДанных.ПолучательПредставление		= ПолучательПредставление;
		СтруктураДанных.ГруппироватьУслуги			= ВыборкаЛС.ГруппироватьУслуги;
		СтруктураДанных.ПечатьЗависимыхЛС			= ВыборкаЛС.ПечатьЗависимыхЛС;
		СтруктураДанных.ЛицевойСчетФио				= ВыборкаЛС.ОтветсвенноеЛицо;
		СтруктураДанных.ЛицевойСчетНомер			= ВыборкаЛС.Наименование;
		СтруктураДанных.ЛицевойСчетАдрес			= Адрес;
		СтруктураДанных.КоличествоПроживающих		= ВыборкаЛС.КоличествоПроживающих;
		СтруктураДанных.КоличествоЗарегистрированных= ВыборкаЛС.КоличествоЗарегистрированных;
		СтруктураДанных.ОписаниеОбщейПлощади		= ВыборкаЛС.ОбщаяПлощадь;
		СтруктураДанных.ОписаниеЖилойПлощади		= ВыборкаЛС.ЖилаяПлощадь;
		СтруктураДанных.ОписаниеОтапливаемойПлощади	= ВыборкаЛС.ОтапливаемаяПлощадь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета,
		|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства,
		|	ЕСТЬNULL(бит_ЗначениеСвойствОбъектовУчета.Значение, 0) КАК Значение
		|ИЗ
		|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
		|ГДЕ
		|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета = &Здание";
		
		Запрос.УстановитьПараметр("Здание", ВыборкаЛС.ЛицевойСчет.Здание);
		
		РезультатЗначениеСвойств = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗначениеСвойств.Выбрать();
		
		ПлощадьЖилыхНежилых = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания") Тогда
				
				СтруктураДанных.ОбщаяПлощадьЖилогоЗдания             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений") Тогда
				
				СтруктураДанных.ОбщаяПлощадьЖилыхПомещений             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьНежилыхПомещений") Тогда
				
				СтруктураДанных.ОбщаяПлощадьНежилыхПомещений             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьПридомовойТерритории") Тогда
				
				СтруктураДанных.ОбщаяПлощадьПридомовойТерритории             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьГрунта") Тогда
				
				СтруктураДанных.ОбщаяПлощадьГрунта             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования") Тогда
				
				СтруктураДанных.МестОбщегоПользования             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ПлощадьПринадлежащаяЧленамТСЖ") Тогда
				
				СтруктураДанных.ПлощадьПринадлежащаяЧленамТСЖ             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.КоличествоПодъездов") Тогда
				
				СтруктураДанных.КоличествоПодъездов             = ВыборкаДетальныеЗаписи.Значение;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.КоличествоЭтажей") Тогда
				
				СтруктураДанных.КоличествоЭтажей             = ВыборкаДетальныеЗаписи.Значение;
				
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьНежилыхПомещений")
				Или ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений") Тогда
				ПлощадьЖилыхНежилых = ПлощадьЖилыхНежилых + ВыборкаДетальныеЗаписи.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураДанных.ПлощадьЖилыхНежилых = ПлощадьЖилыхНежилых;
		
		СтруктураДанных.Сальдо                           = ВыборкаЛС.Сальдо;
		СтруктураДанных.Начислено                        = ВыборкаЛС.Начислено;
		СтруктураДанных.Оплата                           = ВыборкаЛС.Оплата;
		СтруктураДанных.Разовые                          = ВыборкаЛС.Разовые;
		СтруктураДанных.ЛицевойСчет                      = ВыборкаЛС.ЛицевойСчет;
		СтруктураДанных.ИтогПени                         = ВыборкаЛС.СальдоПени;
		СтруктураДанных.КолЛьготников                    = ВыборкаЛС.КоличествоЛьготников;
		СтруктураДанных.СтатусКвартиры                   = ВыборкаЛС.СтатусКвартиры;
		СтруктураДанных.КоличествоКомнат                 = ВыборкаЛС.КоличествоКомнат;
		СтруктураДанных.Оплата                           = ВыборкаЛС.Оплата;
		СтруктураДанных.Начислено                        = ВыборкаЛС.Начислено;
		СтруктураДанных.Сальдо                           = ?(ШаблонИзвещений.Кредит = Перечисления.ДаНет.Нет 
		И ШаблонИзвещений.Сальдо = Перечисления.ДаНет.Нет, 0 ,ВыборкаЛС.Сальдо);
		СтруктураДанных.Разовые                          = ВыборкаЛС.Разовые;
		СтруктураДанных.ТипКвартиры                      = ВыборкаЛС.ТипКвартиры;
		СтруктураДанных.ОписаниеЛьгот                    = ?(СложнаяЛьгота, "Сложная льгота", ОписаниеЛьгот);
		СтруктураДанных.ОписаниеСложнойЛьготы            = ОписаниеЛьгот;
		СтруктураДанных.ГруппироватьУслуги               = ВыборкаЛС.ГруппироватьУслуги;
		СтруктураДанных.ПечатьЗависимыхЛС                = ВыборкаЛС.ПечатьЗависимыхЛС;
		СтруктураДанных.ДатаПоследнейОплаты              = Формат(ВыборкаЛС.ДатаОплаты, "ДФ=dd.MM.yyyy");
		СтруктураДанных.ДатаПоследнейОплатыГИСЖКХ        = ВыборкаЛС.ДатаОплаты;
		СтруктураДанных.СуммаПоследнейОплаты         	 = ВыборкаЛС.СуммаПоследнейОплаты;
		СтруктураДанных.ДатаПоследнейОплатыКапРем	     = Формат(ВыборкаЛС.ДатаОплатыКапРем, "ДФ=dd.MM.yyyy");
		СтруктураДанных.ДатаПоследнейОплатыКапРемГИСЖКХ  = ВыборкаЛС.ДатаОплатыКапРем;
		СтруктураДанных.ДатаПоследнейОплатыНеКапРем      = Формат(ВыборкаЛС.ДатаОплатыНеКапРем, "ДФ=dd.MM.yyyy");
		СтруктураДанных.ДатаПоследнейОплатыНеКапРемГИСЖКХ= ВыборкаЛС.ДатаОплатыНеКапРем;
		СтруктураДанных.РежимРаботы                      = мКэшПараметрыЖКХ.РежимРаботы;
		
		СтруктураДанных.ОплатаСУчетомПени                = ВыборкаЛС.Оплата + ВыборкаЛС.ОплатаПени;
		СтруктураДанных.ОплатаПени                       = ВыборкаЛС.ОплатаПени;
		СтруктураДанных.СубсидияПИ                       = ВыборкаЛС.СубсидияПИ;
	
		
		СтруктураДанных.ВходящееСальдоПени               = ВыборкаЛС.ДолгПени;
		СтруктураДанных.НачисленоПениЗаПериод            = ВыборкаЛС.НачисленоПениЗаПериод;
		
		
		//21.02.2019
		СтруктураДанных.ВходящееСальдоПлюсНачисленоЗаПериодПени = СтруктураДанных.ВходящееСальдоПени + СтруктураДанных.НачисленоПениЗаПериод; 
		
		СтруктураДанных.ЕЛСГИСЖКХ						 = ВыборкаЛС.ЕЛСГИСЖКХ;
		СтруктураДанных.ИдентификаторЖКУ				 = ВыборкаЛС.ИдентификаторЖКУ;
		СтруктураДанных.КапРемЕЛСГИСЖКХ					 = ВыборкаЛС.КапРемЕЛСГИСЖКХ;
		СтруктураДанных.КапРемИдентификаторЖКУ			 = ВыборкаЛС.КапРемИдентификаторЖКУ;
		СтруктураДанных.ИдентификаторПД					 = ВыборкаЛС.ИдентификаторПД;
		
		Если ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.КапитальныйРемонт Тогда
			СтруктураДанных.ЕЛС = ВыборкаЛС.КапРемЕЛСГИСЖКХ;
		Иначе
			СтруктураДанных.ЕЛС = ВыборкаЛС.ЕЛСГИСЖКХ;
		КонецЕсли;
		
		Если  Строка(ЭтотОбъект.ДатаПечатиКвитанций) <> "01.01.0001 0:00:00"  Тогда
			СтруктураДанных.ДатаПечатиКвитанций          = Формат(ЭтотОбъект.ДатаПечатиКвитанций, "ДФ=dd.MM.yyyy");
		Иначе
			СтруктураДанных.ДатаПечатиКвитанций              = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(СтруктураДанных.Дата) Тогда
			МесяцПечатиКвитанций   = Месяц(СтруктураДанных.Дата);
			ГодДатаПечатиКвитанций = Год(СтруктураДанных.Дата);
			ПоследнийДеньМесяца	   = День(КонецМесяца(СтруктураДанных.Дата));
		Иначе
			ТекДата				   = ТекущаяДата(); 
			МесяцПечатиКвитанций   = Месяц(ТекДата);
			ГодДатаПечатиКвитанций = Год(ТекДата);
			ПоследнийДеньМесяца	   = День(КонецМесяца(ТекДата));
		КонецЕсли;
		
		Если мКэшПараметрыЖКХ.ПоследнийДеньПриемаПлатежей = 0 Тогда
			ПоследнийДеньПриемаПлатежей = 1;
		ИначеЕсли мКэшПараметрыЖКХ.ПоследнийДеньПриемаПлатежей > ПоследнийДеньМесяца Тогда
			ПоследнийДеньПриемаПлатежей = ПоследнийДеньМесяца;
		Иначе
			ПоследнийДеньПриемаПлатежей = мКэшПараметрыЖКХ.ПоследнийДеньПриемаПлатежей;
		КонецЕсли;
		
		ОплатитьДо = ДобавитьМесяц(Дата(ГодДатаПечатиКвитанций, МесяцПечатиКвитанций, ПоследнийДеньПриемаПлатежей)
									, (мКэшПараметрыЖКХ.КоличествоМесяцевОтсрочкиНачисленияПени + 1));
		СтруктураДанных.ОплатитьДо = Формат(ОплатитьДо, "ДФ = дд.ММ.гггг");
		
		ВыборкаУС = ВыборкаЛС.Выбрать();
		
		ТаблицаПечати = ПолучитьТаблицуПечати();
		
		ТаблицаОбщедомовыхСчетчиков = ПолучитьТаблицуОбщедомовыхСчетчиков();
		
		ИтогоЛьгота            = 0;
		ИтогоКОплате           = 0;
		ИтогоДолг              = 0;
		ИтогоПереплата         = 0;
		ИтогоПереплатаНаНачало = 0;
		ИтогоКОплатеЗаМесяц    = 0;
		ИтогоТекСальдо         = 0;
		ИтогоЗакрытиеВхДолга   = 0;
		
		ИтогоЗакрытиеВхДолгаБезШаблона = 0;	
		
		ИтогоСубсидияПИ        = 0;
		
		Пока ВыборкаУС.Следующий() Цикл
			
			Количество        = 0;
			Долг              = 0;
			ПереплатаНаНачало = 0;
			Переплата         = 0;
			Коплате           = 0;
			КОплатеЗаМесяц    = 0;
			Льгота            = 0;
			ТекСальдо         = 0;
			ЗакрытиеВхДолга   = 0;
			
			ЗакрытиеВхДолгаБезШаблона = 0;
			
			СубсидияПИ        = 0;
			
			Если 
				
				ВыборкаУС.СальдоПени <> 0 или ПечатьУслРежимНет ИЛИ ВыборкаУС.РежимПотребления <> Справочники.бит_РежимыПотребленияУслуг.Нет И ( 
				
				// Печатаем без начислений но с оплатой, только когда стоит флаг "Печатать услуги с оплатой без начислений".
				ВыборкаУС.Сальдо <> 0 ИЛИ ВыборкаУС.Начислено <> 0 ИЛИ ВыборкаУС.Разовые <> 0 ИЛИ ВыборкаУС.Оплата <> 0 И ПечататьУслугиСОплатой 
				
				// Исключение печати без начисления и оплат.
				ИЛИ (ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
				И (мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение6 
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение5))
				
				// Выводить нулевые услуги с режимомо потребления "Да", на зависимо от начислений.
				ИЛИ (ВыборкаУС.Сальдо = 0 И ВыборкаУС.Начислено = 0 И ВыборкаУС.Разовые = 0			
				И ВыборкаУС.РежимПотребления <> Справочники.бит_РежимыПотребленияУслуг.Нет И ВыводВсехУслугЛС))
				
			Тогда	
				
				Льгота = ВыборкаУС.Льгота;
				
				СубсидияПИ = ВыборкаУС.СубсидияПИ;
				
				Если мКэшПараметрыЖКХ.ЛьготаПерсонифицированная Тогда
					Льгота = 0;
				КонецЕсли;				
							
				Если ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам Тогда
					Количество = ВыборкаУС.ФактПоСчетчикам;
				ИначеЕсли ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
					Количество = ВыборкаУС.ОбщаяПлощадь;
				ИначеЕсли ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
					Количество = ВыборкаУС.ЖилаяПлощадь;
				ИначеЕсли ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади Тогда
					Количество = ВыборкаУС.ОтапливаемаяПлощадь;
				ИначеЕсли ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим  Тогда
					Количество = ВыборкаУС.КоличествоПроживающих;
				ИначеЕсли ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления Тогда
					Количество = ВыборкаУС.КоличествоЕдиницПотребления;
				ИначеЕсли ВыборкаУС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
					Количество = ВыборкаУС.КоличествоЕдиницПотребления;
				КонецЕсли;
				
				// Заполнение таблицы печати.
				НоваяСтрока = ТаблицаПечати.Добавить();
				
				УслугаПредставление = ?(мНастройкиМакета.ИспользоватьСокращенноеНаименованиеУслуги,
				ВыборкаУС.Услуга.НаименованиеСокращенное,
				ВыборкаУС.Услуга.НаименованиеПолное);
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаУС);
				НоваяСтрока.УслугаПредставление = УслугаПредставление;
				
				ТекСальдо = ВыборкаУС.Сальдо;
				
				ЗакрытиеВхДолгаБезШаблона = ВыборкаУС.Сальдо - ВыборкаУС.Оплата;
				
				// Учет настроек шаблона извещений.
				Если Сальдо = Перечисления.ДаНет.Да И Кредит = Перечисления.ДаНет.Да Тогда
					
					ЗакрытиеВхДолга = ВыборкаУС.Сальдо - ВыборкаУС.Оплата;
					НоваяСтрока.ЗакрытиеВхДолга = ЗакрытиеВхДолга;  
					
					Долг              = ?(ВыборкаУС.Сальдо > 0,ВыборкаУС.Сальдо,0);
					
					ПереплатаНаНачало = ?(ВыборкаУС.Сальдо < 0,ВыборкаУС.Сальдо * -1,0);
					Переплата         = ВыборкаУС.Сальдо + ВыборкаУС.Начислено +  ВыборкаУС.Разовые - ВыборкаУС.Оплата - Льгота;
					Переплата         = ?(Переплата < 0, Переплата * -1, 0);
					
					Коплате = ?(мНастройкиМакета.СальдоКОплате    ,ВыборкаУС.Сальдо,0) + 
					?(мНастройкиМакета.НачисленияКОплате,ВыборкаУС.Начислено,0)+
					?(мНастройкиМакета.РазовыеКОплате   ,ВыборкаУС.Разовые,0)-
					?(мНастройкиМакета.СубсидияПИКОплате,СубсидияПИ,0)-
					?(мНастройкиМакета.ЛьготаКОплате    ,Льгота,0)-
					?(мНастройкиМакета.ОплатаКОплате    ,ВыборкаУС.Оплата,0);
					
					Если НЕ мНастройкиМакета.СУчетомПереплатыКОплате Тогда
						Коплате = ?(Коплате >= 0, Коплате, 0);
					КонецЕсли; 
					
					Если мНастройкиМакета.СальдоКОплатеБезУчетаДолга Тогда
						Если ЗакрытиеВхДолга > 0 Тогда
							Коплате = ?(Коплате - ЗакрытиеВхДолга > 0, Коплате - ЗакрытиеВхДолга, 0);
						КонецЕсли;
					КонецЕсли;
					
					КОплатеЗаМесяц = ?(мНастройкиМакета.СальдоЗаМесяц    ,ВыборкаУС.Сальдо,0) + 
					?(мНастройкиМакета.НачисленияЗаМесяц,ВыборкаУС.Начислено,0)+
					?(мНастройкиМакета.РазовыеЗаМесяц   ,ВыборкаУС.Разовые,0)-
					?(мНастройкиМакета.СубсидияПИЗаМесяц,СубсидияПИ,0)-
					?(мНастройкиМакета.ЛьготаЗаМесяц    ,Льгота,0)-
					?(мНастройкиМакета.ОплатаЗаМесяц    ,ВыборкаУС.Оплата,0);
					
					Если НЕ мНастройкиМакета.СУчетомПереплатыЗаМесяц Тогда
						КОплатеЗаМесяц = ?(КОплатеЗаМесяц >= 0, КОплатеЗаМесяц, 0);
					КонецЕсли;
					
					ТекСальдо = ТекСальдо + ?(мНастройкиМакета.СальдоВключаетОплату, ВыборкаУС.Оплата * -1,0);
					
				ИначеЕсли Сальдо = Перечисления.ДаНет.Нет И Кредит = Перечисления.ДаНет.Да Тогда
					
					ЗакрытиеВхДолга = ВыборкаУС.Оплата;
					НоваяСтрока.ЗакрытиеВхДолга = ЗакрытиеВхДолга; 
					
					ПереплатаНаНачало = ?(ВыборкаУС.Сальдо < 0,ВыборкаУС.Сальдо * -1,0);

					Если СтруктураДанных.Сальдо > 0 Тогда
						
						Коплате = ?(мНастройкиМакета.НачисленияКОплате,ВыборкаУС.Начислено,0)+
						?(мНастройкиМакета.РазовыеКОплате   ,ВыборкаУС.Разовые,0)-
						?(мНастройкиМакета.СубсидияПИКОплате,СубсидияПИ,0)-
						?(мНастройкиМакета.ЛьготаКОплате    ,Льгота,0)-
						?(мНастройкиМакета.ОплатаКОплате    ,ВыборкаУС.Оплата,0);
						
						Если НЕ мНастройкиМакета.СУчетомПереплатыКОплате Тогда
							Коплате = ?(Коплате >= 0, Коплате, 0);
						КонецЕсли;
						
						КОплатеЗаМесяц = ?(мНастройкиМакета.НачисленияЗаМесяц,ВыборкаУС.Начислено,0)+
						?(мНастройкиМакета.РазовыеЗаМесяц   ,ВыборкаУС.Разовые,0)- 
						?(мНастройкиМакета.СубсидияПИЗаМесяц,СубсидияПИ,0)-
						?(мНастройкиМакета.ЛьготаЗаМесяц    ,Льгота,0)-
						?(мНастройкиМакета.ОплатаЗаМесяц    ,ВыборкаУС.Оплата,0);
						
						Если НЕ мНастройкиМакета.СУчетомПереплатыЗаМесяц Тогда
							КОплатеЗаМесяц = ?(КОплатеЗаМесяц >= 0, КОплатеЗаМесяц, 0);
						КонецЕсли;
						
						ТекСальдо = ?(мНастройкиМакета.СальдоВключаетОплату, ВыборкаУС.Оплата * -1,0);
						
					Иначе
						
						Коплате = ?(мНастройкиМакета.СальдоКОплате    ,ВыборкаУС.Сальдо,0) + 
						?(мНастройкиМакета.НачисленияКОплате,ВыборкаУС.Начислено,0)+
						?(мНастройкиМакета.РазовыеКОплате   ,ВыборкаУС.Разовые,0)-
						?(мНастройкиМакета.СубсидияПИКОплате,СубсидияПИ,0)-
						?(мНастройкиМакета.ЛьготаКОплате    ,Льгота,0)-
						?(мНастройкиМакета.ОплатаКОплате    ,ВыборкаУС.Оплата,0);
						
						Если НЕ мНастройкиМакета.СУчетомПереплатыКОплате Тогда
							Коплате = ?(Коплате >= 0, Коплате, 0);
						КонецЕсли;
						
						КОплатеЗаМесяц = ?(мНастройкиМакета.СальдоЗаМесяц    ,ВыборкаУС.Сальдо,0) + 
						?(мНастройкиМакета.НачисленияЗаМесяц,ВыборкаУС.Начислено,0)+
						?(мНастройкиМакета.РазовыеЗаМесяц   ,ВыборкаУС.Разовые,0)- 
						?(мНастройкиМакета.СубсидияПИЗаМесяц,СубсидияПИ,0)-
						?(мНастройкиМакета.ЛьготаЗаМесяц    ,Льгота,0)-
						?(мНастройкиМакета.ОплатаЗаМесяц    ,ВыборкаУС.Оплата,0);
						
						Если НЕ мНастройкиМакета.СУчетомПереплатыЗаМесяц Тогда
							КОплатеЗаМесяц = ?(КОплатеЗаМесяц >= 0, КОплатеЗаМесяц, 0);
						КонецЕсли;
						
						ТекСальдо = ТекСальдо + ?(мНастройкиМакета.СальдоВключаетОплату, ВыборкаУС.Оплата * -1,0);
						
					КонецЕсли;
					
				ИначеЕсли Сальдо = Перечисления.ДаНет.Да И Кредит = Перечисления.ДаНет.Нет Тогда
					
					ЗакрытиеВхДолга = ВыборкаУС.Сальдо - ВыборкаУС.Оплата;
					НоваяСтрока.ЗакрытиеВхДолга = ЗакрытиеВхДолга; // БИТ_ЖКХ 19.08.2016 18:35:49 
					
					Долг    = ?(ВыборкаУС.Сальдо > 0,ВыборкаУС.Сальдо,0);

					Коплате = ?(мНастройкиМакета.СальдоКОплате    ,Долг,0) + 
					?(мНастройкиМакета.НачисленияКОплате,ВыборкаУС.Начислено,0)+
					?(мНастройкиМакета.РазовыеКОплате   ,ВыборкаУС.Разовые,0)-
					?(мНастройкиМакета.СубсидияПИКОплате,СубсидияПИ,0)-
					?(мНастройкиМакета.ЛьготаКОплате    ,Льгота,0)-
					?(мНастройкиМакета.ОплатаКОплате    ,ВыборкаУС.Оплата,0);
					
					Если НЕ мНастройкиМакета.СУчетомПереплатыКОплате Тогда
						Коплате = ?(Коплате >= 0, Коплате, 0);
					КонецЕсли;
					
					Если мНастройкиМакета.СальдоКОплатеБезУчетаДолга Тогда
						Если ЗакрытиеВхДолга > 0 Тогда
							Коплате = ?(Коплате - ЗакрытиеВхДолга > 0, Коплате - ЗакрытиеВхДолга, 0);
						КонецЕсли;
					КонецЕсли;
					
					КОплатеЗаМесяц = ?(мНастройкиМакета.СальдоЗаМесяц    ,Долг,0) + 
					?(мНастройкиМакета.НачисленияЗаМесяц,ВыборкаУС.Начислено,0)+
					?(мНастройкиМакета.РазовыеЗаМесяц   ,ВыборкаУС.Разовые,0)- 
					?(мНастройкиМакета.СубсидияПИЗаМесяц,СубсидияПИ,0)-
					?(мНастройкиМакета.ЛьготаЗаМесяц    ,Льгота,0)-
					?(мНастройкиМакета.ОплатаЗаМесяц    ,ВыборкаУС.Оплата,0);
					
					Если НЕ мНастройкиМакета.СУчетомПереплатыЗаМесяц Тогда
						КОплатеЗаМесяц = ?(КОплатеЗаМесяц >= 0, КОплатеЗаМесяц, 0);
					КонецЕсли;
					
					ТекСальдо = Долг + ?(мНастройкиМакета.СальдоВключаетОплату, ВыборкаУС.Оплата * -1,0);
					
				ИначеЕсли Сальдо = Перечисления.ДаНет.Нет И Кредит = Перечисления.ДаНет.Нет Тогда
					
					ЗакрытиеВхДолга = ВыборкаУС.Оплата;
					НоваяСтрока.ЗакрытиеВхДолга = ЗакрытиеВхДолга; // БИТ_ЖКХ 19.08.2016 18:35:52 
					
					Коплате = ?(мНастройкиМакета.НачисленияКОплате,ВыборкаУС.Начислено,0)+
					?(мНастройкиМакета.РазовыеКОплате   ,ВыборкаУС.Разовые,0)-
					?(мНастройкиМакета.СубсидияПИКОплате,СубсидияПИ,0)-
					?(мНастройкиМакета.ЛьготаКОплате    ,Льгота,0);
					
					Если НЕ мНастройкиМакета.СУчетомПереплатыКОплате Тогда
						Коплате = ?(Коплате >= 0, Коплате, 0);
					КонецЕсли;
					
					КОплатеЗаМесяц = ?(мНастройкиМакета.НачисленияЗаМесяц,ВыборкаУС.Начислено,0)+
					?(мНастройкиМакета.РазовыеЗаМесяц   ,ВыборкаУС.Разовые,0)- 
					?(мНастройкиМакета.СубсидияПИЗаМесяц,СубсидияПИ,0)-
					?(мНастройкиМакета.ЛьготаЗаМесяц    ,Льгота,0);
					
					Если НЕ мНастройкиМакета.СУчетомПереплатыЗаМесяц Тогда
						КОплатеЗаМесяц = ?(КОплатеЗаМесяц >= 0, КОплатеЗаМесяц, 0);
					КонецЕсли;
					
					ТекСальдо = ?(мНастройкиМакета.СальдоВключаетОплату, ВыборкаУС.Оплата * -1,0);
					
				КонецЕсли;
				
				Если мКэшПараметрыЖКХ.ЛьготаПерсонифицированная И мКэшПараметрыЖКХ.ВыводитьЛьготыНаСчетИзвещение Тогда
					Льгота = ВыборкаУС.СуммаЛьгота;
				КонецЕсли;
				
				НоваяСтрока.Пени              = ВыборкаУС.СальдоПени;
				НоваяСтрока.Сальдо            = ТекСальдо;
				НоваяСтрока.Льгота            = Льгота;
				
				//19.03.2019
				если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "СубсидияПИ") = истина тогда
				 НоваяСтрока.СубсидияПИ        = ВыборкаУС.СубсидияПИ;
			    конецесли;
			 
			    если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "ЛьготаСубсидия") = истина тогда
				 НоваяСтрока.ЛьготаСубсидия    = НоваяСтрока.Льгота + НоваяСтрока.СубсидияПИ; 
				конецесли; 
				
				НоваяСтрока.Долг              = Долг;
				НоваяСтрока.Коплате           = Коплате;
				НоваяСтрока.ПереплатаНаНачало = ПереплатаНаНачало;
				НоваяСтрока.Ставка            = Окр(ВыборкаУС.ОсновнаяСтавка,4);
				НоваяСтрока.КОплатеЗаМесяц    = КОплатеЗаМесяц;
				
								
				// Заполнение для Платежного документа Начало.
				Факт = 0;
				
				Если ВыборкаУС.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
					Факт = ВыборкаУС.ЖилаяПлощадь;
				ИначеЕсли ВыборкаУС.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
					Факт = ВыборкаУС.ОбщаяПлощадь;
				ИначеЕсли ВыборкаУС.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади Тогда
					Факт = ВыборкаУС.ОтапливаемаяПлощадь;
				ИначеЕсли ВыборкаУС.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда
					Факт = ВыборкаУС.КоличествоПроживающих;
				ИначеЕсли ВыборкаУС.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления Тогда
					Факт = ВыборкаУС.КоличествоЕдиницПотребления;
				ИначеЕсли ВыборкаУС.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
					Факт = ВыборкаУС.КоличествоЕдиницПотребления;
				КонецЕсли;
				
				Если ВыборкаУС.НормативИНД = 0 Тогда
					НоваяСтрока.ОбъемИнд = Факт;
					НоваяСтрока.Объем    = Факт;
				КонецЕсли; 
				
				Если ВыборкаУС.ОбщедомовыеНачисления Тогда
					
					НоваяСтрока.НачисленоИнд     = 0;
					НоваяСтрока.НачисленоОбщДом = ВыборкаУС.НачисленоИНД + ВыборкаУС.НачисленоОбщДом;
					
					НоваяСтрока.ОбъемИнд     = 0;
					НоваяСтрока.ОбъемОбщДом = ВыборкаУС.ОбъемИНД + ВыборкаУС.ОбъемОбщДом;
					
					НоваяСтрока.Норматив        = 0;
					НоваяСтрока.НормативОбщДом = ВыборкаУС.НормативОбщДом;
					
					Если НоваяСтрока.НормативОбщДом = 0 Тогда
						НоваяСтрока.ОбъемОбщДом = НоваяСтрока.ОбъемОбщДом + Факт;
					КонецЕсли; 
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(мНастройкиМакета.НастройкаСтавки) 
					ИЛИ мНастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТарифСтавка Тогда
					
					НоваяСтрока.НастройкаСтавки = ВыборкаУС.Тариф;
					
					Если ВыборкаУС.Тариф = 0 Тогда
						
						НоваяСтрока.НастройкаСтавки = НоваяСтрока.Ставка;
						
						Если НЕ ЗначениеЗаполнено(НоваяСтрока.Ставка) Тогда
							НоваяСтрока.НастройкаСтавки = НоваяСтрока.СверхНормативнаяСтавка;
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли мНастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТолькоТариф Тогда
					
					НоваяСтрока.НастройкаСтавки = ВыборкаУС.Тариф;
					
				ИначеЕсли мНастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТолькоСтавка Тогда 
					
					НоваяСтрока.НастройкаСтавки = НоваяСтрока.Ставка;

					Если НЕ ЗначениеЗаполнено(НоваяСтрока.Ставка) Тогда
						НоваяСтрока.НастройкаСтавки = НоваяСтрока.СверхНормативнаяСтавка;
					КонецЕсли; 
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(НоваяСтрока.Ставка) И НЕ ЗначениеЗаполнено(НоваяСтрока.СверхНормативнаяСтавка) Тогда
					Количество = НоваяСтрока.Норма;
				ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.Ставка) И ЗначениеЗаполнено(НоваяСтрока.СверхНормативнаяСтавка) Тогда
					Количество = НоваяСтрока.СверхНорма;
				КонецЕсли; 
				
				НоваяСтрока.Количество = Количество;
				
				Если НЕ ВыборкаУС.ОбщедомовыеНачисления Тогда
					
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.Объем) Тогда
						НоваяСтрока.Объем = НоваяСтрока.Количество;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.ОбъемИнд) Тогда
						НоваяСтрока.ОбъемИнд = НоваяСтрока.Количество;
					КонецЕсли;
					
				КонецЕсли;
				
				НоваяСтрока.ИтогоОбъемИнд        = ВыборкаУС.ОбъемЗданиеИнд;
				НоваяСтрока.ИтогоОбъемОбщедомовых = ВыборкаУС.ОбъемЗданиеОбщДом;
				
				
				НоваяСтрока.ИтогоОбъемИндИПУ        = ВыборкаУС.ОбъемЗданиеИндИПУ;
				НоваяСтрока.ИтогоОбъемИндНорматив        = ВыборкаУС.ОбъемЗданиеИндНорматив;
				
				Попытка
					// БИТ ЖКХ 22.01.2020
					Если ЕстьСчетчикНаУслуге(ВыборкаЛС.ЛицевойСчет.Здание, НоваяСтрока.Услуга) = истина или НоваяСтрока.ИтогоОбъемОбщедомовых <> 0 Тогда
						
						//СтрокаОбщедомовыхСчетчиков							= ТаблицаОбщедомовыхСчетчиков.Добавить();
						//СтрокаОбщедомовыхСчетчиков.Услуга					= НоваяСтрока.Услуга;
						//СтрокаОбщедомовыхСчетчиков.СокрНаименование			= НоваяСтрока.Услуга.НаименованиеСокращенное;
						//СтрокаОбщедомовыхСчетчиков.ЕдИзм					= НоваяСтрока.ЕдИзм;
						//СтрокаОбщедомовыхСчетчиков.ИтогоОбъемИндИПУ		= НоваяСтрока.ИтогоОбъемИндИПУ;
						//СтрокаОбщедомовыхСчетчиков.ИтогоОбъемИндНорматив	= НоваяСтрока.ИтогоОбъемИндНорматив;
						//СтрокаОбщедомовыхСчетчиков.ДоПоказаний				= 0;
						//СтрокаОбщедомовыхСчетчиков.КодПоставщика			= Прав(Строка(НоваяСтрока.Поставщик.Код),3);
						
						Запрос = Новый Запрос;
						Запрос.УстановитьПараметр("Дата"   ,КонецДня(Период));
						
						Запрос.УстановитьПараметр("Здание",ВыборкаЛС.ЛицевойСчет.Здание);
						Запрос.УстановитьПараметр("Услуга", НоваяСтрока.Услуга);
						Запрос.УстановитьПараметр("Групповой", ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Групповой"));
						
						ЕстьОтборУслуг = Ложь;
						
						СписокУС = Новый СписокЗначений;
						
						Если НЕ ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам Тогда
							СписокУС.ЗагрузитьЗначения(ШаблонИзвещений.Услуги.ВыгрузитьКолонку("Услуга"));
							ЕстьОтборУслуг = СписокУС.Количество() > 0;
						КонецЕсли;
						
						Запрос.УстановитьПараметр("СписокУС"      , СписокУС);
						Запрос.УстановитьПараметр("ЕстьОтборУслуг", ЕстьОтборУслуг);
						Запрос.УстановитьПараметр("НачалоПериода"        , НачалоМесяца(Период));
						Запрос.УстановитьПараметр("КонецПериода"         , КонецМесяца(Период));
						Запрос.УстановитьПараметр("Организация"          , Организация);
						
						Запрос.Текст = 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	бит_ПоказанияСчетчиковОстатки.Объект КАК Объект,
						|	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
						|	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
						|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК НачальныеПоказания,
						|	ВЫБОР
						|		КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0
						|			ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
						|		ИНАЧЕ ВЫБОР
						|				КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0
						|					ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
						|				ИНАЧЕ ВЫБОР
						|						КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток = 0
						|							ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
						|						ИНАЧЕ 0
						|					КОНЕЦ
						|			КОНЕЦ
						|	КОНЕЦ КАК КонечныеПоказания
						|ПОМЕСТИТЬ Показания
						|ИЗ
						|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
						|			&Дата,
						|			Объект = &Здание
						|				И Счетчик.ТипСчетчика = &Групповой) КАК бит_ПоказанияСчетчиковОстатки
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	бит_ПоказанияСчетчиковОбороты.Объект КАК Объект,
						|	бит_ПоказанияСчетчиковОбороты.Услуга КАК Услуга,
						|	бит_ПоказанияСчетчиковОбороты.Счетчик КАК Счетчик,
						|	бит_ПоказанияСчетчиковОбороты.ПоследниеПоказанияОборот КАК ОбъемИнд
						|ПОМЕСТИТЬ ВТ_ПоказанияОбороты
						|ИЗ
						|	РегистрНакопления.бит_ПоказанияСчетчиков.Обороты(
						|			&НачалоПериода,
						|			&КонецПериода,
						|			,
						|			Объект = &Здание
						|				И Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)) КАК бит_ПоказанияСчетчиковОбороты
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
						|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки
						|ПОМЕСТИТЬ ПоверкаСчетчика
						|ИЗ
						|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, Счетчик.ТипСчетчика = &Групповой) КАК бит_ПоверкаСчетчиковСрезПоследних
						|ГДЕ
						|	НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	СУММА(ВЫБОР
						|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
						|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
						|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
						|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
						|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
						|			ИНАЧЕ 0
						|		КОНЕЦ) КАК ОбъемЗданиеОбщДом,
						|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
						|	бит_ОбъемыПоУслугамЖКХОбороты.Счетчик КАК Счетчик
						|ПОМЕСТИТЬ ОбъемПоЗданиям
						|ИЗ
						|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
						|			&НачалоПериода,
						|			&КонецПериода,
						|			Регистратор,
						|			ЛицевойСчет.Организация = &Организация
						|				И ВЫБОР
						|					КОГДА &ЕстьОтборУслуг
						|						ТОГДА Услуга В (&СписокУС)
						|					ИНАЧЕ ИСТИНА
						|				КОНЕЦ) КАК бит_ОбъемыПоУслугамЖКХОбороты
						|ГДЕ
						|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет.Здание = &Здание
						|
						|СГРУППИРОВАТЬ ПО
						|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга,
						|	бит_ОбъемыПоУслугамЖКХОбороты.Счетчик
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.НаименованиеСокращенное КАК СокрНаименование,
						|	ВЫРАЗИТЬ(бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.НаименованиеПолное КАК СТРОКА(150)) КАК НаименованиеПолное,
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать КАК Использовать,
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период КАК Период,
						|	ЕСТЬNULL(Показания.НачальныеПоказания, 0) КАК НачальныеПоказания,
						|	ЕСТЬNULL(Показания.КонечныеПоказания, 0) КАК КонечныеПоказания,
						|	ПоверкаСчетчика.ДатаПоверки КАК ДатаПоверки,
						|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеОбщДом, 0) КАК ОбъемЗданиеОбщДом,
						|	ОбъемПоЗданиям.Счетчик КАК Счетчик,
						|	ЕСТЬNULL(ВТ_ПоказанияОбороты.ОбъемИнд, 0) КАК ОбъемИнд
						|ИЗ
						|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
						|			&Дата,
						|			Объект = &Здание
						|				И ТипСчетчика = &Групповой) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
						|		ЛЕВОЕ СОЕДИНЕНИЕ Показания КАК Показания
						|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = Показания.Объект
						|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = Показания.Услуга
						|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = Показания.Счетчик
						|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказанияОбороты КАК ВТ_ПоказанияОбороты
						|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = ВТ_ПоказанияОбороты.Объект
						|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = ВТ_ПоказанияОбороты.Услуга
						|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = ВТ_ПоказанияОбороты.Счетчик
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПоверкаСчетчика КАК ПоверкаСчетчика
						|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = ПоверкаСчетчика.Счетчик
						|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемПоЗданиям КАК ОбъемПоЗданиям
						|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = ОбъемПоЗданиям.Счетчик
						|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = ОбъемПоЗданиям.Услуга
						|ГДЕ
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = &Услуга
						|
						|СГРУППИРОВАТЬ ПО
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать,
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период,
						|	ПоверкаСчетчика.ДатаПоверки,
						|	ЕСТЬNULL(Показания.НачальныеПоказания, 0),
						|	ЕСТЬNULL(Показания.КонечныеПоказания, 0),
						|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеОбщДом, 0),
						|	ОбъемПоЗданиям.Счетчик,
						|	ЕСТЬNULL(ВТ_ПоказанияОбороты.ОбъемИнд, 0),
						|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.НаименованиеСокращенное,
						|	ВЫРАЗИТЬ(бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.НаименованиеПолное КАК СТРОКА(150))
						|
						|УПОРЯДОЧИТЬ ПО
						|	Период УБЫВ
						|ИТОГИ
						|	МАКСИМУМ(Использовать),
						|	МАКСИМУМ(ДатаПоверки)
						|ПО
						|	Период,
						|	Объект";		
						
						РезультатЗапросаОбщДом = Запрос.Выполнить();
						
						ТЗ = Запрос.Выполнить().Выгрузить();
						
						Если ТЗ.Количество() > 0 Тогда
							Для каждого строкаТЗ из ТЗ Цикл
								// БИТ ЖКХ 22.01.2020
								Если НЕ строкаТЗ.Услуга = Null И ЗначениеЗаполнено(строкаТЗ.Счетчик) и СчетчикНаЛС(НоваяСтрока.Услуга, строкаТЗ.Счетчик, ВыборкаЛС.ЛицевойСчет) = истина
									//и НЕ строкаТЗ.ОбъемЗданиеОбщДом = 0 
									Тогда 
									
									СтрокаОбщедомовыхСчетчиков							= ТаблицаОбщедомовыхСчетчиков.Добавить();
									СтрокаОбщедомовыхСчетчиков.Услуга					= НоваяСтрока.Услуга;
                                    //14.11.2018
									//СтрокаОбщедомовыхСчетчиков.СокрНаименование			= НоваяСтрока.СокрНаименование;
									СтрокаОбщедомовыхСчетчиков.СокрНаименование			= строкаТЗ.Счетчик.Наименование;

									СтрокаОбщедомовыхСчетчиков.УслугаПредставление		= ?(мНастройкиМакета.ИспользоватьСокращенноеНаименованиеУслуги,
																							НоваяСтрока.УслугаПредставление,
																							НоваяСтрока.НаименованиеПолное);
									СтрокаОбщедомовыхСчетчиков.ЕдИзм					= НоваяСтрока.ЕдИзм;
									СтрокаОбщедомовыхСчетчиков.ИтогоОбъемИндИПУ		= НоваяСтрока.ИтогоОбъемИндИПУ;
									СтрокаОбщедомовыхСчетчиков.ИтогоОбъемИндНорматив	= НоваяСтрока.ИтогоОбъемИндНорматив;
									СтрокаОбщедомовыхСчетчиков.ДоПоказаний				= 0;
									СтрокаОбщедомовыхСчетчиков.КодПоставщика			= Прав(Строка(НоваяСтрока.Поставщик.Код),3);
									
									СтрокаОбщедомовыхСчетчиков.Счетчик					= строкаТЗ.Счетчик;
									СтрокаОбщедомовыхСчетчиков.ДоПоказаний				= строкаТЗ.КонечныеПоказания;
									СтрокаОбщедомовыхСчетчиков.ОтПоказаний				= строкаТЗ.КонечныеПоказания - строкаТЗ.ОбъемИнд;
									СтрокаОбщедомовыхСчетчиков.ОбъемИнд					= строкаТЗ.ОбъемИнд;
									СтрокаОбщедомовыхСчетчиков.ИтогоОбъемОбщедомовых	= строкаТЗ.ОбъемЗданиеОбщДом;
									
									// БИТ ЖКХ 23.01.2020
									площади = ПолучитьДанныеПлощадиПоСчетчику(СтрокаОбщедомовыхСчетчиков.Счетчик);
									если  площади <> неопределено тогда
									 СтрокаОбщедомовыхСчетчиков.ИтогоОбщаяПлощадь        =  площади.ОбщаяПлощадь;
									 СтрокаОбщедомовыхСчетчиков.ИтогоОтапливаемаяПлощадь =  площади.ОтапливаемаяПлощадь;
									конецесли;   
									
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЕсли;
				Исключение

				КонецПопытки;

				// Заполнение для Платежного документа Конец.
				
				// Пересчет итогов.
				ИтогоТекСальдо         = ИтогоТекСальдо         + ТекСальдо;
				ИтогоЛьгота            = ИтогоЛьгота            + Льгота;
				ИтогоСубсидияПИ        = ИтогоСубсидияПИ        + СубсидияПИ;
				ИтогоКОплате           = ИтогоКОплате           + Коплате;
				ИтогоДолг              = ИтогоДолг              + Долг;
				ИтогоПереплата         = ИтогоПереплата         + Переплата;
				ИтогоПереплатаНаНачало = ИтогоПереплатаНаНачало + ПереплатаНаНачало;
				ИтогоКОплатеЗаМесяц    = ИтогоКОплатеЗаМесяц    + КОплатеЗаМесяц;
				ИтогоЗакрытиеВхДолга   = ИтогоЗакрытиеВхДолга   + ЗакрытиеВхДолга;
				
				ИтогоЗакрытиеВхДолгаБезШаблона   = ИтогоЗакрытиеВхДолгаБезШаблона   + ЗакрытиеВхДолгаБезШаблона;
				
				НоваяСтрока.Объем_точность3 = Окр(НоваяСтрока.Объем, 3, РежимОкругления.Окр15как10);
				НоваяСтрока.Объем_точность2 = Окр(НоваяСтрока.Объем, 2, РежимОкругления.Окр15как10);
				
				НоваяСтрока.ОбъемИНД_точность3 = Окр(НоваяСтрока.ОбъемИНД, 3, РежимОкругления.Окр15как10);
				НоваяСтрока.ОбъемИНД_точность2 = Окр(НоваяСтрока.ОбъемИНД, 2, РежимОкругления.Окр15как10);
				
				НоваяСтрока.ОбъемОбщДом_точность3 = Окр(НоваяСтрока.ОбъемОбщДом_точность3, 3, РежимОкругления.Окр15как10);
				НоваяСтрока.ОбъемОбщДом_точность2 = Окр(НоваяСтрока.ОбъемОбщДом_точность3, 2, РежимОкругления.Окр15как10);
				
				НоваяСтрока.ИтогоОбъемИнд_точность3 = Окр(НоваяСтрока.ИтогоОбъемИнд, 3, РежимОкругления.Окр15как10);
				НоваяСтрока.ИтогоОбъемИнд_точность2 = Окр(НоваяСтрока.ИтогоОбъемИнд, 2, РежимОкругления.Окр15как10);
				
				НоваяСтрока.ИтогоОбъемОбщедомовых_точность3 = Окр(НоваяСтрока.ИтогоОбъемОбщедомовых, 3, РежимОкругления.Окр15как10);
				НоваяСтрока.ИтогоОбъемОбщедомовых_точность2 = Окр(НоваяСтрока.ИтогоОбъемОбщедомовых, 2, РежимОкругления.Окр15как10);
				
				// 16.01.2019 59
				если НоваяСтрока.НачисленоИНД = 0 тогда
					НоваяСтрока.ОбъемИНД = 0;
				конецесли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПроцентОтОплаты   = 0;
		
		СуммаДляРасчетаПроцента = ИтогоКОплате + ?(УчетПениКассовыйСбор, СтруктураДанных.ИтогПени, 0);
		
		Если ЗначениеЗаполнено(Процент) И  ИтогоКОплате > 0 Тогда
			
			Если ПростойПроцент Тогда
				ПроцентОтОплаты = Окр(СуммаДляРасчетаПроцента * Процент / 100, 2);
			Иначе
				ПроцентОтОплаты = Окр((СуммаДляРасчетаПроцента * 100 / (100 - Процент )) - СуммаДляРасчетаПроцента, 2);
			КонецЕсли; 
			
		КонецЕсли;
		
		СтруктураДанных.ДолгНач           = ИтогоДолг * -1;
		СтруктураДанных.ДолгКон           = ИтогоКОплате * -1;
		СтруктураДанных.Льгота            = ИтогоЛьгота;
		СтруктураДанных.СубсидияПИ        = ИтогоСубсидияПИ;
		СтруктураДанных.Коплате           = ИтогоКОплате;
		СтруктураДанных.Долг              = ИтогоДолг;
		СтруктураДанных.Переплата         = ИтогоПереплата;
		СтруктураДанных.ПереплатаНаНачало = ИтогоПереплатаНаНачало;
		СтруктураДанных.ПроцентОтОплаты   = ПроцентОтОплаты;
		СтруктураДанных.КОплатеЗаМесяц    = ИтогоКОплатеЗаМесяц;
		СтруктураДанных.Сальдо            = ИтогоТекСальдо;
		СтруктураДанных.НачисленоИнд      = ТаблицаПечати.Итог("НачисленоИнд");
		СтруктураДанных.НачисленоОбщДом   = ТаблицаПечати.Итог("НачисленоОбщДом");
		
		СтруктураДанных.ИтогоКОплатеСУчетомПредоплаты = ИтогоКОплате + ПроцентОтОплаты;
		СтруктураДанных.ИтогоКОплатеСУчетомПени       = СтруктураДанных.ИтогоКОплатеСУчетомПредоплаты + СтруктураДанных.ИтогПени;
		
		//19.03.2019
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураДанных, "ЛьготаСубсидия") = истина тогда
			СтруктураДанных.ЛьготаСубсидия = СтруктураДанных.Льгота + СтруктураДанных.СубсидияПИ;
		конецесли;		
		
		Если ИтогоЗакрытиеВхДолга >= 0 Тогда
			СтруктураДанных.ДолгСУчетомОплаты = ИтогоЗакрытиеВхДолга;
		Иначе
			СтруктураДанных.Авансы = ИтогоЗакрытиеВхДолга * -1;
		КонецЕсли;
		
		Если ИтогоЗакрытиеВхДолгаБезШаблона >= 0 Тогда
			СтруктураДанных.ДолгСУчетомОплатыБезШаблона = ИтогоЗакрытиеВхДолгаБезШаблона;
		КонецЕсли;
		
		Если ИтогоТекСальдо < 0 Тогда
			СтруктураДанных.СальдоЗнак = "переплата";
			СтруктураДанных.СальдоСоЗнаком = СтруктураДанных.Сальдо * -1;
		Иначе
			СтруктураДанных.СальдоЗнак = "долг";
			СтруктураДанных.СальдоСоЗнаком = СтруктураДанных.Сальдо;
		КонецЕсли; 
		
		Если  Строка(ЭтотОбъект.ДатаПечатиКвитанций) <> "01.01.0001 0:00:00"  Тогда
			ДатаПечатиКв          = ЭтотОбъект.ДатаПечатиКвитанций;
		Иначе
			ДатаПечатиКв              = ТекущаяДата();
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУ.Ссылка,
		|	бит_ОплатаКУ.СуммаДокумента,
		|	бит_ОплатаКУ.Дата,
		|	бит_ОплатаКУСписокЛС.ЛицевойСчет,
		|	бит_ОплатаКУСписокЛС.Сумма
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ КАК бит_ОплатаКУ
		|		ПО бит_ОплатаКУСписокЛС.Ссылка = бит_ОплатаКУ.Ссылка
		|ГДЕ
		|	бит_ОплатаКУ.Дата > &КонецМесяца
		|	И бит_ОплатаКУ.Дата < &ДатаПечатиКвитанций
		|	И бит_ОплатаКУСписокЛС.ЛицевойСчет = &ЛицевойСчет";
		
		Запрос.УстановитьПараметр("ДатаПечатиКвитанций", ДатаПечатиКв);
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
		Запрос.УстановитьПараметр("ЛицевойСчет", ВыборкаЛС.ЛицевойСчет);
		
		Рез = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Рез.Выбрать();
		
		СуммаОплат = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СуммаОплат = СуммаОплат + ВыборкаДетальныеЗаписи.Сумма;
			
		КонецЦикла;
		
		СтруктураДанных.КОплатеНаМоментПечати = СтруктураДанных.КОплате - СуммаОплат;
		
		Если СтруктураДанных.КОплатеНаМоментПечати < 0 Тогда
			
			СтруктураДанных.КОплатеНаМоментПечати = 0;
			
		КонецЕсли;	
		
		СтруктураДанных.ИтогоКОплатеСУчетомПредоплатыНаМоментПечати = СтруктураДанных.ИтогоКОплатеСУчетомПредоплаты - СуммаОплат;
		
		Если СтруктураДанных.ИтогоКОплатеСУчетомПредоплатыНаМоментПечати < 0 Тогда
			
			СтруктураДанных.ИтогоКОплатеСУчетомПредоплатыНаМоментПечати = 0;
			
		КонецЕсли;	
		
		СтруктураДанных.ИтогоКОплатеСУчетомПениНаМоментПечати = СтруктураДанных.ИтогоКОплатеСУчетомПени - СуммаОплат;
		
		Если СтруктураДанных.ИтогоКОплатеСУчетомПениНаМоментПечати < 0 Тогда
			
			СтруктураДанных.ИтогоКОплатеСУчетомПениНаМоментПечати = 0;
			
		КонецЕсли;	
		
		Попытка
			СуммаШтрихКода = СтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
		Исключение
			СуммаШтрихКода = 0;
		КонецПопытки;
		
		СтруктураДанных.ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
																						ВыборкаЛС.Наименование,
																						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонИзвещений, "Идентификатор"),
																						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаЛС.ЛицевойСчет, "Идентификатор"),
																						мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
																						мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);

		//БИТ ЖКХ 13.05.2020
		СтруктураДанных.СальдоСПени                      =  СтруктураДанных.ВходящееСальдоПени + СтруктураДанных.Сальдо;//СтруктураДанных.Долг;    
        //БИТ ЖКХ 26.02.2021
		СтруктураДанных.КОплатеЗаМесяцСПени =  СтруктураДанных.КОплатеЗаМесяц + СтруктураДанных.НачисленоПениЗаПериод;    
		
		Если ТаблицаПечати.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		ДанныеПоЛС = Новый Структура;
		ДанныеПоЛС.Вставить("СтруктураДанных"       , СтруктураДанных);
		ДанныеПоЛС.Вставить("ТаблицаПечати"         , ТаблицаПечати);
		ДанныеПоЛС.Вставить("ТаблицаПечатиСчетчиков", ПолучитьТаблицуПечатиСчетчиков());
		ДанныеПоЛС.Вставить("ТаблицаПерерасчетов"   , ПолучитьТаблицуПерерасчетов());
		ДанныеПоЛС.Вставить("ТаблицаСвойств"   , ЗначенияСвойств);
		ДанныеПоЛС.Вставить("ТаблицаОбщедомовыхСчетчиков"   , ТаблицаОбщедомовыхСчетчиков);
		
		СтрокаДанных = ТаблицаДанных.Добавить();
		СтрокаДанных.ЛицевойСчет = ВыборкаЛС.ЛицевойСчет;
		СтрокаДанных.ВладелецЛС  = ВыборкаЛС.ВладелецЛС;
		СтрокаДанных.Значение    = ДанныеПоЛС;
		
	КонецЦикла; 
	
	// Заполнение счетчиков.
	ВыборкаЛС = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ТаблицаПечатиСчетчиков = ПолучитьТаблицуПечатиСчетчиков();
		
		ВыборкаСЧ = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСЧ.Следующий() Цикл
			
			Выборка = ВыборкаСЧ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = ТаблицаПечатиСчетчиков.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				Если ЗначениеЗаполнено(Выборка.Счетчик.КоэффициентУмножения) Тогда
					ОтПоказаний             = Выборка.ДоПоказаний - Выборка.КоличествоЕдиниц/Выборка.Счетчик.КоэффициентУмножения;
				Иначе
					ОтПоказаний             = Выборка.ДоПоказаний - Выборка.КоличествоЕдиниц;
				КонецЕсли;
				
				НоваяСтрока.ОтПоказаний = ?(ОтПоказаний < 0, ОтПоказаний + Выборка.Разрядность + 1, ОтПоказаний);
				
				НоваяСтрока.ДатаПоверки = ?(ЗначениеЗаполнено(Выборка.ДатаПоверки),Формат(Выборка.ДатаПоверки,"ДФ=dd.MM.yyyy"),"");
				
				НоваяСтрока.УслугаПредставление = ?(мНастройкиМакета.ИспользоватьСокращенноеНаименованиеУслуги,
													Выборка.СокрНаименование,
													Выборка.НаименованиеПолное);
				
				Если НЕ Выборка.Многотарифный Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		СтрокаТаблицыДанных = ТаблицаДанных.Найти(ВыборкаЛС.ЛицевойСчет, "ЛицевойСчет");
		
		Если НЕ СтрокаТаблицыДанных = Неопределено Тогда
			
			СтрокаТаблицыДанных.Значение.ТаблицаПечатиСчетчиков = ТаблицаПечатиСчетчиков;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Заполнение информации о перерасчетах.
	ВыборкаЛС = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ТаблицаПерерасчетов = ПолучитьТаблицуПерерасчетов();
		Выборка = ВыборкаЛС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ТаблицаПерерасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
		СтрокаТаблицыДанных = ТаблицаДанных.Найти(ВыборкаЛС.ЛицевойСчет, "ЛицевойСчет");
		
		Если НЕ СтрокаТаблицыДанных = Неопределено Тогда
			
			СтрокаТаблицыДанных.Значение.ТаблицаПерерасчетов = ТаблицаПерерасчетов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МВТ.Закрыть();
	
	Возврат ТаблицаДанных;
	
КонецФункции

// БИТ ЖКХ 13.04.2020
функция ПолучитьТаблицуГрупповыхСчетчиковНаУслугах(ПериодЗапроса)
  запрос = новый запрос;
  
  запрос.Текст = "ВЫБРАТЬ
                 |	бит_ГрупповыеСчетчикиСрезПоследних.Услуга КАК Услуга,
                 |	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК ГрупповойСчетчик,
                 |	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
                 |	бит_ГрупповыеСчетчикиСрезПоследних.Использовать КАК Использовать
                 |ИЗ
                 |	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&ПериодЗапроса,) КАК бит_ГрупповыеСчетчикиСрезПоследних";	
	
  запрос.УстановитьПараметр("ПериодЗапроса", ПериодЗапроса);

  возврат запрос.Выполнить().Выгрузить();
	
КонецФункции

функция ПолучитьТаблицуСчетчиковНаУслугах(ПериодЗапроса)
  запрос = новый запрос;
  
  запрос.Текст = "ВЫБРАТЬ
                 |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
                 |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
                 |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
                 |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Активность КАК Активность
                 |ИЗ
                 |	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&ПериодЗапроса,) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних";

  
  //запрос.Текст = "ВЫБРАТЬ
  //               |	бит_ГрупповыеСчетчикиСрезПоследних.Услуга КАК Услуга,
  //               |	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК ГрупповойСчетчик,
  //               |	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
  //               |	бит_ГрупповыеСчетчикиСрезПоследних.Использовать КАК Использовать
  //               |ИЗ
  //               |	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&ПериодЗапроса,) КАК бит_ГрупповыеСчетчикиСрезПоследних";	
  //  
  запрос.УстановитьПараметр("ПериодЗапроса", ПериодЗапроса);

  возврат запрос.Выполнить().Выгрузить();
	
КонецФункции

// БИТ ЖКХ 23.01.2020
функция ПолучитьДанныеПлощадиПоСчетчику (счетчик)
	
  площадьСчетчика = мТаблицаПлощадейСчетчиков.Найти(счетчик, "ГрупповойСчетчик"); 	
  
  возврат площадьСчетчика;
  
КонецФункции

// БИТ ЖКХ 22.01.2020
функция СчетчикНаЛССтарая (услуга, счетчик, ЛС)
	
  //запрос = новый запрос;
  //
  //запрос.Текст = "ВЫБРАТЬ
  //               |	бит_ГрупповыеСчетчики.Услуга КАК Услуга,
  //               |	бит_ГрупповыеСчетчики.ЛицевойСчет КАК ЛицевойСчет,
  //               |	бит_ГрупповыеСчетчики.Использовать КАК Использовать
  //               |ИЗ
  //               |	РегистрСведений.бит_ГрупповыеСчетчики КАК бит_ГрупповыеСчетчики
  //               |ГДЕ
  //               |	бит_ГрупповыеСчетчики.Услуга = &Услуга
  //               |	И бит_ГрупповыеСчетчики.ЛицевойСчет = &ЛицевойСчет
  //               |	И бит_ГрупповыеСчетчики.Использовать = истина
  //               |	И бит_ГрупповыеСчетчики.ГрупповойСчетчик = &Счетчик";	
  //  
  //  			 
  //запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
  //запрос.УстановитьПараметр("Услуга", услуга);
  //запрос.УстановитьПараметр("Счетчик", счетчик);

  //табСчетчиков = запрос.Выполнить().Выгрузить();
  //   
  //возврат табСчетчиков.Количество() > 0;
  
  
  Отбор = Новый Структура;
  Отбор.Вставить("ГрупповойСчетчик", счетчик);
  Отбор.Вставить("ЛицевойСчет", ЛС);
  Отбор.Вставить("Услуга", услуга);

  Строки = мТаблицаГрупповыхСчетчиковНаУслугах.НайтиСтроки(Отбор);
  
  //Построитель = Новый ПостроительЗапроса;
  //Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(мТаблицаСчетчиковНаУслугах);
 
////  тОтбор = Построитель.Отбор.Добавить("ГрупповойСчетчик");
  //тОтбор.ВидСравнения = ВидСравнения.Равно;
  //тОтбор.Значение = счетчик;
  //тОтбор.Использование = Истина;
 
////  Построитель.Выполнить();
  //ТабРезультат = Построитель.Результат.Выгрузить();

  возврат Строки.Количество() > 0;
  
конецфункции	

// БИТ ЖКХ 13.04.2020
функция СчетчикНаЛС (услуга, счетчик, ЛС)    
  
  Отбор = Новый Структура;
  Отбор.Вставить("ГрупповойСчетчик", счетчик);
  Отбор.Вставить("ЛицевойСчет", ЛС);
  Отбор.Вставить("Услуга", услуга);

  Строки = мТаблицаГрупповыхСчетчиковНаУслугах.НайтиСтроки(Отбор);  
 
  возврат Строки.Количество() > 0;
  
конецфункции	
// БИТ ЖКХ 22.01.2020
функция ПолучитьТаблицуПлощадейСчетчиков (Период)
	
  запросСчетчиков = новый запрос;
  
  запросСчетчиков.Текст = "ВЫБРАТЬ
                          |	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
                          |	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК ГрупповойСчетчик,
                          |	бит_ГрупповыеСчетчикиСрезПоследних.Услуга КАК Услуга,
                          |	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Квартира КАК ЛицевойСчетКвартира,
                          |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
                          |	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь
                          |ИЗ
                          |	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Период, ) КАК бит_ГрупповыеСчетчикиСрезПоследних
                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Период, ) КАК бит_СведенияОКвартиреСрезПоследних
                          |		ПО бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира";	
	

  запросСчетчиков.УстановитьПараметр("Период", Период);
  табСчетчиков = запросСчетчиков.Выполнить().Выгрузить();
  табСчетчиковЛС = табСчетчиков.Скопировать();
  
  // БИТ ЖКХ 20.02.2020
  таблицаСумм = новый ТаблицаЗначений;
  таблицаСумм.Колонки.Добавить("ГрупповойСчетчик", Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
  таблицаСумм.Колонки.Добавить("ОбщаяПлощадь", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, 2)));
  таблицаСумм.Колонки.Добавить("ОтапливаемаяПлощадь", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, 2)));

  для каждого стр из табСчетчиков цикл
	  
	  стрСумм = таблицаСумм.Добавить();
	  стрСумм.ГрупповойСчетчик = стр.ГрупповойСчетчик;
	  стрСумм.ОбщаяПлощадь = стр.ОбщаяПлощадь;
	  стрСумм.ОтапливаемаяПлощадь = стр.ОтапливаемаяПлощадь; 
	  
  конеццикла;	  
  
  таблицаСумм.Свернуть("ГрупповойСчетчик", "ОбщаяПлощадь, ОтапливаемаяПлощадь");
  КвартирыЛС = табСчетчиков.ВыгрузитьКолонку("ЛицевойСчетКвартира");         
     
  возврат таблицаСумм;

конецфункции

//функция ПолучитьТаблицуПлощадейСчетчиков ()
//	
//  запросСчетчиков = новый запрос;
//  
//  запросСчетчиков.Текст = "ВЫБРАТЬ
//                 |	бит_ГрупповыеСчетчики.ЛицевойСчет КАК ЛицевойСчет,
//                 |	бит_ГрупповыеСчетчики.ГрупповойСчетчик КАК ГрупповойСчетчик
//                 |ИЗ
//                 |	РегистрСведений.бит_ГрупповыеСчетчики КАК бит_ГрупповыеСчетчики
//                 |ГДЕ
//                 |	бит_ГрупповыеСчетчики.Использовать = ИСТИНА";	
//	

//  табСчетчиков = запросСчетчиков.Выполнить().Выгрузить();
//  
//  запросКвартир = новый запрос;
//  
//  запросКвартир.Текст = "ВЫБРАТЬ
//                        |	бит_СведенияОКвартиреСрезПоследних.Период КАК Период,
//                        |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
//                        |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
//                        |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
//                        |	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира
//                        |ИЗ
//                        |	РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних";	
//	

//  табКвартир = запросКвартир.Выполнить().Выгрузить();

//     
//  возврат табСчетчиков.Количество() > 0;

//конецфункции


// БИТ ЖКХ 22.01.2020
функция ЕстьСчетчикНаУслуге(здание, услуга)
	
  //запрос = новый запрос;
  //
  //запрос.Текст = "ВЫБРАТЬ
  //               |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
  //               |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
  //               |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
  //               |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Активность КАК Активность
  //               |ИЗ
  //               |	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
  //               |ГДЕ
  //               |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = &Объект
  //               |	И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = &Услуга";
  //
  //запрос.УстановитьПараметр("Объект", здание);
  //запрос.УстановитьПараметр("Услуга", услуга);

  //табСчетчиков = запрос.Выполнить().Выгрузить();
  //   
  //возврат табСчетчиков.Количество() > 0;
  Отбор = Новый Структура;
  Отбор.Вставить("Объект", здание);
  Отбор.Вставить("Услуга", услуга);

  Строки = мТаблицаСчетчиковНаУслугах.НайтиСтроки(Отбор);  
 
  возврат Строки.Количество() > 0;

конецфункции	


Функция ПолучитьКвитанциюПоЛС(Источник, Пеня = ложь) Экспорт
	
	
	Если ТипЗнч(Источник) = Тип("СтрокаТаблицыЗначений") Тогда
		
		мСтруктураДанных        = Источник.Значение.СтруктураДанных;
		мТаблицаПечати          = Источник.Значение.ТаблицаПечати;
		мТаблицаПечатиСчетчиков = Источник.Значение.ТаблицаПечатиСчетчиков;
		мТаблицаПерерасчетов    = Источник.Значение.ТаблицаПерерасчетов;
		мТаблицаСвойств			= Источник.Значение.ТаблицаСвойств;
		мТаблицаОбщедомовыхСчетчиков = Источник.Значение.ТаблицаОбщедомовыхСчетчиков;
		
	Иначе
		
		Структура = ПолучитьИзВременногоХранилища(Источник);
		
		мСтруктураДанных        = Структура.СтруктураДанных;
		мТаблицаПечати          = Структура.ТаблицаПечати;
		мТаблицаПечатиСчетчиков = Структура.ТаблицаПечатиСчетчиков;
		мТаблицаПерерасчетов    = Структура.ТаблицаПерерасчетов;
		мТаблицаСвойств			= Структура.ТаблицаСвойств;
		мТаблицаОбщедомовыхСчетчиков = Структура.ТаблицаОбщедомовыхСчетчиков;
		
	КонецЕсли;	
	
	
	Если ГруппироватьУслуги ИЛИ мСтруктураДанных.ГруппироватьУслуги Тогда
		
		Если НЕ (мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция // Квитанция №1.  
			ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция2	// Квитанция №1 чек слева.
			ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция6	// Квитанция №4.
			ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.КвитанцияСПБ // Квитанция №1 СПБ.
			ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение
			ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент1) Тогда // Платежный документ РК БИТ.
			
			ПерезаполнитьПоГруппа();

		КонецЕсли;
		
	КонецЕсли;
	
	//23.05.2019
	Если Пеня = истина тогда
		
		мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокументПеня;
		
	КонецЕсли;	
	
	Если НЕ МакетКв.Предопределенный И МакетКв.ИспользоватьПользовательскуюФункцию Тогда
		
		Квитанция = ВыполнитьПользовательскуюФункцию(); 
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение2 Тогда
		
		ДляКиева  = мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение2;
		Квитанция = ПечатьСчетИзвещение(ДляКиева);
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение1 Тогда
		
		Квитанция = ПечатьСчетИзвещение1();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение3 Тогда
		
		Квитанция = ПечатьСчетИзвещение2();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение4 Тогда
		
		Квитанция = ПечатьСчетИзвещение3();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение5 ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение7 Тогда
		
		УчетОплатыВСальдо = (мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение5);
		
		Квитанция = ПечатьСчетИзвещение4(УчетОплатыВСальдо);
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение6 Тогда
		
		Квитанция = ПечатьСчетИзвещение5();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция2 Тогда
		
		Квитанция = ПечатьКвитанция();
		
    ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.КвитанцияСПБ Тогда
		
		Квитанция = ПечатьКвитанцияСПБ();		
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция3 Тогда
		
		Квитанция = ПечатьКвитанция2();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция4 ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция5 Тогда
		
		УчетПени = мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция5;
		
		Квитанция = ПечатьКвитанция3(УчетПени);
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция6 Тогда
		
		Квитанция = ПечатьКвитанция4();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение8 Тогда
		
		Квитанция = ПечатьСчетИзвещение6();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещениеРСК Тогда
		
		Квитанция = ПечатьСчетИзвещениеРСК();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент Тогда
		
		Квитанция = ПечатьПлатежныйДокумент();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент1 Тогда
		
		Квитанция = ПечатьПлатежныйДокументРКБИТ();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент Тогда
		
		Квитанция = ПечатьЕдиныйПлатежныйДокумент();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументПени Тогда
		
		Квитанция = СформироватьПлатежныйДокументПени(мСтруктураДанных.ВходящееСальдоПени,мСтруктураДанных.НачисленоПениЗаПериод,мСтруктураДанных.ПолучательКоррСчет,мСтруктураДанных.ПолучательБанк,мСтруктураДанных.ИтогПени,мСтруктураДанных.ПолучательТелефон,мСтруктураДанных.ПолучательПредставление,мСтруктураДанных.ПолучательКПП,мСтруктураДанных.ПолучательИНН,мСтруктураДанных.ПолучательРС,мСтруктураДанных.ПолучательАдрес,мСтруктураДанных.ЛицевойСчет, мСтруктураДанных.ЛицевойСчетФио, мСтруктураДанных.Дата);
		
	ИначеЕсли  мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924 Тогда
		Квитанция = ПечатьПлатежныйДокументРК924();
		
	ИначеЕсли  мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ Тогда
		Квитанция = ПечатьПлатежныйДокументРК924ГИСЖКХ();
		
	ИначеЕсли  мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43 Тогда
		Квитанция = ПечатьПлатежныйДокументРК43();
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент679_30 Тогда
		Квитанция = ПечатьЕдиныйПлатежныйДокумент679_30();
	
	ИначеЕсли Пеня = ложь и мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32
		            ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32_Новый 
					ИЛИ	мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32_НовыйСПени Тогда
		Квитанция = ПечатьЕдиныйПлатежныйДокумент761_32();
		
	//23.05.2019
	ИначеЕсли Пеня = истина Тогда
		Квитанция = ПечатьЕдиныйПлатежныйДокумент();
	КонецЕсли; 
	
	Если ТипЗнч(Квитанция) = Тип("ТабличныйДокумент")Тогда
		
		Квитанция.АвтоМасштаб = Истина;
		Квитанция.ПолеСверху  = 0;
		Квитанция.ПолеСнизу   = 0;
		
		Если Не МакетКв.ИспользоватьПользовательскуюФункцию Тогда
			Если мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43 Тогда 
				Квитанция.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			Иначе
				Квитанция.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			КонецЕсли;
		КонецЕсли;
		
		Если ПечататьСрочноеДонесениеОПоказанияхВодосчетчиков Тогда
			
			Донесение = СформироватьДонесениеОПоказанияхВодосчетчиков(мСтруктураДанных.ЛицевойСчет, мСтруктураДанных.ЛицевойСчетФио, мСтруктураДанных.Дата);
			
			Если НЕ Донесение = Неопределено Тогда
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, Донесение) Тогда
					Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
					Квитанция.Вывести(Донесение);
					Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Иначе
					Квитанция.Вывести(Донесение);
				КонецЕсли;  
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ПечататьПлатежныйДокументПени Тогда
			
			Если мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент 
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент1 
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент  
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32  
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924 
				ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ Тогда 
				
				ДокументПени = СформироватьПлатежныйДокументПени(мСтруктураДанных.ВходящееСальдоПени,мСтруктураДанных.НачисленоПениЗаПериод,мСтруктураДанных.ПолучательКоррСчет,мСтруктураДанных.ПолучательБанк,мСтруктураДанных.ИтогПени,мСтруктураДанных.ПолучательТелефон,мСтруктураДанных.ПолучательПредставление,мСтруктураДанных.ПолучательКПП,мСтруктураДанных.ПолучательИНН,мСтруктураДанных.ПолучательРС,мСтруктураДанных.ПолучательАдрес,мСтруктураДанных.ЛицевойСчет, мСтруктураДанных.ЛицевойСчетФио, мСтруктураДанных.Дата);
				
				Если НЕ ДокументПени = Неопределено Тогда
					
					Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ДокументПени) Тогда
						Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
						Квитанция.Вывести(ДокументПени);
						Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
					Иначе
						Квитанция.Вывести(ДокументПени);
					КонецЕсли;  
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

Функция ПечатьКвитанций(Знач ТаблицаДанных, ПервыйЭлемент = 0, ПоследнийЭлемент = 0, АдресХранилщаДанных = Неопределено) Экспорт
	
	Если ПоследнийЭлемент = 0 Тогда
		ПоследнийЭлемент = ТаблицаДанных.Количество() -1;
	КонецЕсли; 
	
	мТаблицаПлатежиГИСЖКХ12			= ПолучитьТаблицаПлатежиГИСЖКХ12();
	мТаблицаПлатежиГИСЖКХ36			= ПолучитьТаблицаПлатежиГИСЖКХ36();
	мТаблицаПлатежиГИСЖКХДПД		= ПолучитьТаблицаПлатежиГИСЖКХДПД();
	мТаблицаПлатежиГИСЖКХНеустойки	= ПолучитьТаблицаПлатежиГИСЖКХНеустойки();
	
	ТабличнйДокумент = Новый ТабличныйДокумент;
	
	УстановитьНастройкиТабличногоДокумена(ТабличнйДокумент);
	
	ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	
	Отказ = Ложь;
	Для Значение = ПервыйЭлемент По ПоследнийЭлемент  Цикл
		
		СтрокаТаблица = ТаблицаДанных[Значение];
		
		//23.05.2019
		ВывестиНаПечатьКвитанцию(ТабличнйДокумент, СтрокаТаблица, ложь, Отказ);
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Попытка
		СтруктураПД = Новый Структура();
		СтруктураПД.Вставить("ТаблицаПлатежиГИСЖКХ12"		, мТаблицаПлатежиГИСЖКХ12);
		СтруктураПД.Вставить("ТаблицаПлатежиГИСЖКХ36"		, мТаблицаПлатежиГИСЖКХ36);
		СтруктураПД.Вставить("ТаблицаПлатежиГИСЖКХДПД"		, мТаблицаПлатежиГИСЖКХДПД);
		СтруктураПД.Вставить("ТаблицаПлатежиГИСЖКХНеустойки", мТаблицаПлатежиГИСЖКХНеустойки);
		АдресХранилщаДанных = ПоместитьВоВременноеХранилище(СтруктураПД, Новый УникальныйИдентификатор);
	Исключение
	КонецПопытки;
	
	Возврат ТабличнйДокумент;
	
КонецФункции

// Процедура устанавливает настройки табличного документа. 
//
Процедура УстановитьНастройкиТабличногоДокумена(ТабличныйДокумент) Экспорт
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху  = 0;
	ТабличныйДокумент.ПолеСнизу   = 0;
	
	Если НЕ ЗначениеЗаполнено(мОсновнойВариантМакета) Тогда
		
	ИначеЕсли (мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ) 
		И НЕ ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт Тогда
		
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ИначеЕсли НЕ (мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ) 
		И ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт Тогда
		
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиНаПечатьКвитанцию(ТабличнйДокумент, Знач Источник, Пеня = ложь, Отказ = Ложь) Экспорт
	
	//23.05.2019
	Квитанция = ПолучитьКвитанциюПоЛС(Источник, Пеня);
	
	Если Квитанция = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Квитанция.ОриентацияСтраницы <> ТабличнйДокумент.ОриентацияСтраницы Тогда
		ТабличнйДокумент.ОриентацияСтраницы = Квитанция.ОриентацияСтраницы;
	КонецЕсли;
	
	ТабличнйДокумент.Вывести(Квитанция);
	
	// Вывод разделителя для квитанций.
	ВывестиРазделитель = Истина;
	
	Если  мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция  
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция2
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.КвитанцияСПБ
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция3
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция4
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция5
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.Квитанция6 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументПени Тогда
		Если НЕ ПечатьКвитанцийНаКаждойСтанице Тогда
			Попытка
				ВывестиРазделитель = НЕ ТабличнйДокумент.ПроверитьВывод(Квитанция);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Установите принтер, пожалуйста!'"));
			КонецПопытки;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ВывестиРазделитель Тогда
		ТабличнйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПерезаполнитьПоГруппа()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПечати", мТаблицаПечати);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПечати.ГруппаУслуги,
	|	ТаблицаПечати.Услуга,
	|	ТаблицаПечати.Сальдо,
	|	ТаблицаПечати.Пени,
	|	ТаблицаПечати.Начислено,
	|	ТаблицаПечати.Льгота,
	|	ТаблицаПечати.Оплата,
	|	ТаблицаПечати.Разовые,
	|	ТаблицаПечати.КОплате,
	|	ТаблицаПечати.КОплатеЗаМесяц,
	|	ТаблицаПечати.Долг,
	|	ТаблицаПечати.ПереплатаНаНачало,
	|	ТаблицаПечати.ПриоритетГруп,
	|	ТаблицаПечати.УслугаПредставление,
	|	ТаблицаПечати.НастройкаСтавки,
	|	ТаблицаПечати.Количество,
	|	ТаблицаПечати.ЕдИзм,
	|	ТаблицаПечати.Объем,
	|	ТаблицаПечати.ОбъемИНД,
	|	ТаблицаПечати.ОбъемОбщДом,
	|	ТаблицаПечати.НачисленоИНД,
	|	ТаблицаПечати.НачисленоОбщДом
	|ПОМЕСТИТЬ ТМП
	|ИЗ
	|	&ТаблицаПечати КАК ТаблицаПечати
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТМП.ГруппаУслуги КАК Услуга,
	|	ТМП.Услуга КАК УслугаСтар,
	|	ТМП.Пени КАК Пени,
	|	ТМП.Начислено КАК Начислено,
	|	ТМП.Льгота КАК Льгота,
	|	ТМП.Оплата КАК Оплата,
	|	ТМП.Разовые КАК Разовые,
	|	ТМП.КОплате КАК КОплате,
	|	ТМП.КОплатеЗаМесяц КАК КОплатеЗаМесяц,
	|	ТМП.Долг КАК Долг,
	|	ТМП.ПереплатаНаНачало КАК ПереплатаНаНачало,
	|	ТМП.ПриоритетГруп КАК ПриоритетГруп,
	|	ТМП.Сальдо КАК Сальдо,
	|	ТМП.УслугаПредставление КАК УслугаПредставление,
	|	ТМП.НастройкаСтавки,
	|	ТМП.Количество,
	|	ТМП.ЕдИзм,
	|	ТМП.Объем,
	|	ТМП.ОбъемИНД,
	|	ТМП.ОбъемОбщДом,
	|	ТМП.НачисленоИНД,
	|	ТМП.НачисленоОбщДом
	|ИЗ
	|	ТМП КАК ТМП
	|ИТОГИ
	|	СУММА(Пени),
	|	СУММА(Начислено),
	|	СУММА(Льгота),
	|	СУММА(Оплата),
	|	СУММА(Разовые),
	|	СУММА(КОплате),
	|	СУММА(КОплатеЗаМесяц),
	|	СУММА(Долг),
	|	СУММА(ПереплатаНаНачало),
	|	МАКСИМУМ(ПриоритетГруп),
	|	СУММА(Сальдо)
	|ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТМП";
	
	Результат   = Запрос.Выполнить();
	ВыборкаГруп = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	мТаблицаПечати.Очистить();
	
	Пока ВыборкаГруп.Следующий() Цикл
		
		НоваяСтрока = мТаблицаПечати.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаГруп);
		НоваяСтрока.УслугаПредставление = ВыборкаГруп.Услуга.Наименование;
		
		Выборка = ВыборкаГруп.Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Услуга              = Выборка.УслугаСтар;
			НоваяСтрока.УслугаПредставление = Выборка.УслугаПредставление; 
			
		ИначеЕсли ВыборкаГруп.Услуга.Пустая() Тогда 
			
			мТаблицаПечати.Удалить(НоваяСтрока);
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрокаУслуги = мТаблицаПечати.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаУслуги, Выборка);
				НоваяСтрокаУслуги.Услуга = Выборка.УслугаСтар;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФормированияСтруктурыДанных

Процедура ОбновитьНастройкиЖКХ() Экспорт
	
	мКэшПараметрыЖКХ = Новый Структура;
	мКэшПараметрыЖКХ.Вставить("ВыводитьЗамечанияЖКХ"					, Ложь);
	мКэшПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"				, Ложь);
	мКэшПараметрыЖКХ.Вставить("ВыводитьЛьготыНаСчетИзвещение"			, Ложь);
	мКэшПараметрыЖКХ.Вставить("НачислятьПени"							, Ложь);
	мКэшПараметрыЖКХ.Вставить("НеПечататьУлица"							, Ложь);
	мКэшПараметрыЖКХ.Вставить("НеПечататьДом"							, Ложь);
	мКэшПараметрыЖКХ.Вставить("НеПечататьКорпус"						, Ложь);
	мКэшПараметрыЖКХ.Вставить("НеПечататьКвартира"						, Ложь);
	мКэшПараметрыЖКХ.Вставить("НеПечататьРайон"							, Истина);
	мКэшПараметрыЖКХ.Вставить("ПрефиксУлица"							, "ул.");
	мКэшПараметрыЖКХ.Вставить("ПрефиксДом"								, "д.");
	мКэшПараметрыЖКХ.Вставить("ПрефиксКорпус"							, "корп.");
	мКэшПараметрыЖКХ.Вставить("ПрефиксКвартира"							, "кв.");
	мКэшПараметрыЖКХ.Вставить("ПрефиксРайон"							, "");
	мКэшПараметрыЖКХ.Вставить("ВыводитьЗависимыеЛС"						, Ложь);
	мКэшПараметрыЖКХ.Вставить("НомерПолучателяПоБанку"					, 0);
	мКэшПараметрыЖКХ.Вставить("ИспользоватьНомерПолучателяВШК"			, Ложь);
	мКэшПараметрыЖКХ.Вставить("ДатаНачалаВеденияПоКУ"					, НачалоГода(Период));
	мКэшПараметрыЖКХ.Вставить("РежимРаботы"								, "");
	мКэшПараметрыЖКХ.Вставить("КоличествоМесяцевОтсрочкиНачисленияПени" , "");
	мКэшПараметрыЖКХ.Вставить("ПоследнийДеньПриемаПлатежей"             , "");
	мКэшПараметрыЖКХ.Вставить("РаздельныйУчетКапРемонта"				, Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(Период), Организация, мКэшПараметрыЖКХ);
	
КонецПроцедуры

// Процедура Обновляет кэш организации.
//
// Параметры:
//  Нет.
//
Процедура ОбновитьКэшОрганизации() Экспорт
	
	мКэшОрганизации = Новый Структура;
	мКэшОрганизации.Вставить("Организация", Организация);
	мКэшОрганизации.Вставить("НаименованиеПолное"                , "");
	мКэшОрганизации.Вставить("НаименованиеСокращенное"           , "");
	мКэшОрганизации.Вставить("ВариантНаименованияДляПечатныхФорм", Перечисления.ВариантыНаименованияДляПечатныхФорм.ПустаяСсылка());
	мКэшОрганизации.Вставить("БИК"                               , "");
	мКэшОрганизации.Вставить("ПолучательИНН"                     , "");
	мКэшОрганизации.Вставить("ПолучательКПП"                     , "");
	мКэшОрганизации.Вставить("КоррСчет"                          , "");
	мКэшОрганизации.Вставить("НомерСчета"                        , "");
	мКэшОрганизации.Вставить("ПолучательБанк"                    , "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.ОсновнойБанковскийСчет,
	|	Организации.НаименованиеПолное,
	|	Организации.НаименованиеСокращенное,
	|	Организации.ВариантНаименованияДляПечатныхФорм,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК ПолучательБанк,
	|	Организации.ИНН КАК ПолучательИНН,
	|	Организации.КПП КАК ПолучательКПП
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		мКэшОрганизации.НаименованиеПолное                 = Выборка.НаименованиеПолное;
		мКэшОрганизации.НаименованиеСокращенное            = Выборка.НаименованиеСокращенное;
		мКэшОрганизации.ВариантНаименованияДляПечатныхФорм = Выборка.ВариантНаименованияДляПечатныхФорм;
		мКэшОрганизации.БИК                                = Выборка.БИК;
		мКэшОрганизации.ПолучательИНН                      = Выборка.ПолучательИНН;
		мКэшОрганизации.ПолучательКПП                      = Выборка.ПолучательКПП;
		мКэшОрганизации.КоррСчет                           = Выборка.КоррСчет;
		мКэшОрганизации.НомерСчета                         = Выборка.НомерСчета;
		мКэшОрганизации.ПолучательБанк                     = Выборка.ПолучательБанк;
		
	КонецЕсли;
	
	мКэшОрганизации.НаименованиеСокращенное = ПолучитьПоследнееНаименование(ЭтотОбъект.Период);
	
	
	Запрос.УстановитьПараметр("РС", РС);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка,
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет,
	|	БанковскиеСчета.НомерСчета,
	|	БанковскиеСчета.Банк.Наименование КАК ПолучательБанк
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Организация
	|	И БанковскиеСчета.Ссылка = &РС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		мКэшОрганизации.БИК            = Выборка.БИК;
		мКэшОрганизации.КоррСчет       = Выборка.КоррСчет;
		мКэшОрганизации.НомерСчета     = Выборка.НомерСчета;
		мКэшОрганизации.ПолучательБанк = Выборка.ПолучательБанк;
		
	КонецЕсли;
	
	мКэшОрганизации.Вставить("ПолучательДопИнформация", "");
	мКэшОрганизации.Вставить("ПолучательТелефон"      , "");
	
	Если НЕ ЗначениеЗаполнено(Организация.ИндивидуальныйПредприниматель) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Ссылка,
		|	ОрганизацииКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + "Тел: " + Выборка.Представление;
			мКэшОрганизации.ПолучательТелефон       = "Тел: " + Выборка.Представление;
		КонецЕсли;
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ИндивидуальныйПредприниматель
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица)
		|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
		
		Запрос.УстановитьПараметр("ИндивидуальныйПредприниматель", Организация.ИндивидуальныйПредприниматель);
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + "Тел: " + Выборка.Представление;
			мКэшОрганизации.ПолучательТелефон       = "Тел: " + Выборка.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация.ИндивидуальныйПредприниматель) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Ссылка,
		|	ОрганизацииКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации)
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + " Факс: " + Выборка.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация.ИндивидуальныйПредприниматель) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Ссылка,
		|	ОрганизацииКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + " Email: "+ Выборка.Представление;
		КонецЕсли;
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ИндивидуальныйПредприниматель
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
		|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
		
		Запрос.УстановитьПараметр("ИндивидуальныйПредприниматель", Организация.ИндивидуальныйПредприниматель);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + " Email: "+ Выборка.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация.ИндивидуальныйПредприниматель) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Ссылка,
		|	ОрганизацииКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации)
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + " Доп: " + Выборка.Представление;
		КонецЕсли;
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ИндивидуальныйПредприниматель
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации)
		|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое)";
		
		Запрос.УстановитьПараметр("ИндивидуальныйПредприниматель", Организация.ИндивидуальныйПредприниматель);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + " Доп: " + Выборка.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация.ИндивидуальныйПредприниматель) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + " Сайт: " + Выборка.Представление;
		КонецЕсли;
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ИндивидуальныйПредприниматель
		|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)";
		
		Запрос.УстановитьПараметр("ИндивидуальныйПредприниматель", Организация.ИндивидуальныйПредприниматель);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			мКэшОрганизации.ПолучательДопИнформация = мКэшОрганизации.ПолучательДопИнформация + " Сайт: " + Выборка.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	мКэшОрганизации.Вставить("ПолучательАдрес"  , УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации));
	
	// 17.10.2018
	мКэшОрганизации.Вставить("ПолучательСайт"  , Строка("www." + Строка(Выборка.Представление)));
	//---

КонецПроцедуры

функция ПолучитьПоследнееНаименование(датаОбработки)
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Организация, датаОбработки);
	Возврат НаименованияОрганизации.НаименованиеДляПечатныхФорм;
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Организация", Организация);
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Организации.ИсторияНаименований.(
	//|		Ссылка КАК Ссылка,
	//|		НомерСтроки КАК НомерСтроки,
	//|		Период КАК Период,
	//|		НаименованиеСокращенное КАК НаименованиеСокращенное,
	//|		НаименованиеПолное КАК НаименованиеПолное,
	//|		ФамилияИП КАК ФамилияИП,
	//|		ИмяИП КАК ИмяИП,
	//|		ОтчествоИП КАК ОтчествоИП
	//|	) КАК ИсторияНаименований
	//|ИЗ
	//|	Справочник.Организации КАК Организации
	//|ГДЕ
	//|	Организации.Ссылка = &Организация";
	//
	//таблицаНаименований = Запрос.Выполнить().Выгрузить();
	//таблицаНаименований[0].ИсторияНаименований.Сортировать("Период");
	//последнееИмя = строка(таблицаНаименований[0].ИсторияНаименований[0].Ссылка);	
	//для каждого стр из таблицаНаименований[0].ИсторияНаименований цикл
	//	
	//	если стр.Период <= датаОбработки тогда
	//		последнееИмя = строка(стр.НаименованиеСокращенное);
	//	конецесли;	
	//	
	//конеццикла;	
	//
	//возврат последнееИмя;
	
конецфункции	

// Процедура Обновляет кэш получателя платежа.
Процедура ОбновитьКэшПолучателяПлатежа() Экспорт
	
	мКэшПолучателяПлатежа = Новый Структура;
	мКэшПолучателяПлатежа.Вставить("НаименованиеПолное"					, "");
	мКэшПолучателяПлатежа.Вставить("НаименованиеСокращенное"			, "");
	мКэшПолучателяПлатежа.Вставить("ВариантНаименованияДляПечатныхФорм"	, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательПредставление"			, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательАдрес"					, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательРС"						, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательИНН"						, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательКПП"						, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательБанк"						, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательКоррСчет"					, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательБИК"						, "");
	мКэшПолучателяПлатежа.Вставить("ПолучательКоррСчетБИК"				, "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);
	
	Если ТипЗнч(ПолучательПлатежа) = Тип("СправочникСсылка.Организации") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	Организации.ВариантНаименованияДляПечатныхФорм КАК ВариантНаименованияДляПечатныхФорм,
		|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК ПолучательРС,
		|	Организации.ИНН КАК ПолучательИНН,
		|	Организации.КПП КАК ПолучательКПП,
		|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК ПолучательБанк,
		|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
		|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &ПолучательПлатежа";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.Наименование КАК НаименованиеСокращенное,
		|	"""" КАК ВариантНаименованияДляПечатныхФорм,
		|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК ПолучательРС,
		|	Контрагенты.ИНН КАК ПолучательИНН,
		|	Контрагенты.КПП КАК ПолучательКПП,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК ПолучательБанк,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &ПолучательПлатежа";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//мКэшПолучателяПлатежа.НаименованиеПолное				= Выборка.НаименованиеПолное;
		//мКэшПолучателяПлатежа.НаименованиеСокращенное			= Выборка.НаименованиеСокращенное;
		Если ТипЗнч(Выборка.Ссылка) =Тип("СправочникСсылка.Организации") Тогда
			НаименованияПолучателяПлатежа = Справочники.Организации.НаименованияНаДату(Выборка.Ссылка, ЭтотОбъект.Период);
		Иначе
			НаименованияПолучателяПлатежа = Справочники.Контрагенты.НаименованияНаДату(Выборка.Ссылка, ЭтотОбъект.Период);
		КонецЕсли;

		мКэшПолучателяПлатежа.НаименованиеПолное				= НаименованияПолучателяПлатежа.ПолноеНаименование;
		мКэшПолучателяПлатежа.НаименованиеСокращенное			= НаименованияПолучателяПлатежа.СокращенноеНаименование;
		мКэшПолучателяПлатежа.ВариантНаименованияДляПечатныхФорм= Выборка.ВариантНаименованияДляПечатныхФорм;
		мКэшПолучателяПлатежа.ПолучательРС						= Выборка.ПолучательРС;
		мКэшПолучателяПлатежа.ПолучательИНН						= Выборка.ПолучательИНН;
		мКэшПолучателяПлатежа.ПолучательКПП						= Выборка.ПолучательКПП;
		мКэшПолучателяПлатежа.ПолучательБанк					= Выборка.ПолучательБанк;
		мКэшПолучателяПлатежа.ПолучательКоррСчет				= Строка(Выборка.КоррСчет);
		мКэшПолучателяПлатежа.ПолучательБИК						= Строка(Выборка.БИК);
		мКэшПолучателяПлатежа.ПолучательКоррСчетБИК				= Строка(Выборка.КоррСчет)+" \ "+Строка(Выборка.БИК);
		
	КонецЕсли;
	
	// Перезаполнение выбранным Расчетным счетом.
	Запрос.УстановитьПараметр("РС", РС);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК ПолучательРС,
	|	БанковскиеСчета.Банк.Наименование КАК ПолучательБанк,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет,
	|	БанковскиеСчета.Банк.Код КАК БИК
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &ПолучательПлатежа
	|	И БанковскиеСчета.Ссылка = &РС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		мКэшПолучателяПлатежа.ПолучательРС			= Выборка.ПолучательРС;
		мКэшПолучателяПлатежа.ПолучательБанк		= Выборка.ПолучательБанк;
		мКэшПолучателяПлатежа.ПолучательКоррСчет	= Строка(Выборка.КоррСчет);
		мКэшПолучателяПлатежа.ПолучательБИК			= Строка(Выборка.БИК);
		мКэшПолучателяПлатежа.ПолучательКоррСчетБИК	= Строка(Выборка.КоррСчет)+" \ "+Строка(Выборка.БИК);
		
	КонецЕсли;
	
	Если ТипЗнч(ПолучательПлатежа) = Тип("СправочникСсылка.Организации") Тогда
		мКэшПолучателяПлатежа.ПолучательАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ПолучательПлатежа, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	Иначе
		мКэшПолучателяПлатежа.ПолучательАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ПолучательПлатежа, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	КонецЕсли;
	
КонецПроцедуры	

// Процедура получает настройку макета.
//
// Параметры:
//  Нет.
//
Процедура ПолучитьНастройкуМакета() Экспорт
	
	мНастройкиМакета = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МакетКвитанции", МакетКв);
	
	Запрос.УстановитьПараметр("Пользователь"  , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.МакетКвитанции,
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Ссылка КАК Настройка
	|ПОМЕСТИТЬ ПредопределенныеНастройки
	|ИЗ
	|	Справочник.бит_НастройкиПечатиМакетовСчетИзвещений КАК бит_НастройкиПечатиМакетовСчетИзвещений
	|ГДЕ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.МакетКвитанции КАК МакетКвитанции,
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.НастройкаМакета
	|ПОМЕСТИТЬ НастройкиПользователя
	|ИЗ
	|	РегистрСведений.бит_ТекущиеНастройкиМакетовСчетИзвещений КАК бит_ТекущиеНастройкиМакетовСчетИзвещений
	|ГДЕ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ВариантыСчетовИзвещений.Ссылка КАК МакетКвитанции,
	|	ВЫБОР
	|		КОГДА НастройкиПользователя.НастройкаМакета ЕСТЬ NULL 
	|			ТОГДА ПредопределенныеНастройки.Настройка
	|		ИНАЧЕ НастройкиПользователя.НастройкаМакета
	|	КОНЕЦ КАК НастройкаМакета,
	|	бит_ВариантыСчетовИзвещений.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ВариантыСчетовИзвещений КАК бит_ВариантыСчетовИзвещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредопределенныеНастройки КАК ПредопределенныеНастройки
	|		ПО (ПредопределенныеНастройки.МакетКвитанции = бит_ВариантыСчетовИзвещений.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиПользователя КАК НастройкиПользователя
	|		ПО бит_ВариантыСчетовИзвещений.Ссылка = НастройкиПользователя.МакетКвитанции
	|ГДЕ
	|	бит_ВариантыСчетовИзвещений.Ссылка = &МакетКвитанции
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПредопределенныеНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиПользователя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		мНастройкиМакета = Выборка.НастройкаМакета;
	КонецЕсли; 
	
	// Стандартные настройки для макетов.
	Если НЕ ЗначениеЗаполнено(мНастройкиМакета) Тогда
		
		мНастройкиМакета = ПолучитьСтандартныеНастройкуМакета(мОсновнойВариантМакета);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура получает стандартную настройку макета.
//
Функция ПолучитьСтандартныеНастройкуМакета(ВариантСЧ = Неопределено) Экспорт
	
	НастройкиМакета = Новый Структура;
	
	НастройкиМакета.Вставить("СальдоЗаМесяц"          , Истина);
	НастройкиМакета.Вставить("НачисленияЗаМесяц"      , Истина);
	НастройкиМакета.Вставить("ЛьготаЗаМесяц"          , Истина);
	НастройкиМакета.Вставить("РазовыеЗаМесяц"         , Истина);
	НастройкиМакета.Вставить("ОплатаЗаМесяц"          , Истина);
	
	НастройкиМакета.Вставить("СальдоКОплате"          , Истина);
	
	НастройкиМакета.Вставить("СальдоКОплатеБезУчетаДолга", Ложь);
	
	НастройкиМакета.Вставить("НачисленияКОплате"      , Истина);
	НастройкиМакета.Вставить("ЛьготаКОплате"          , Истина);
	НастройкиМакета.Вставить("РазовыеКОплате"         , Истина);
	НастройкиМакета.Вставить("ОплатаКОплате"          , Истина);
	
	НастройкиМакета.Вставить("ПолеСуммыШК"            ,"ИтогоКОплатеСУчетомПени");
	
	НастройкиМакета.Вставить("ИспользоватьСокращенноеНаименованиеОрганизации", Ложь);
	НастройкиМакета.Вставить("ИспользоватьСокращенноеНаименованиеУслуги"     , Истина);
	
	НастройкиМакета.Вставить("ФормироватьШтрихКод", Истина);
	НастройкиМакета.Вставить("БезОтрывнойЧасти"   , Ложь);
	
	НастройкиМакета.Вставить("СУчетомПереплатыЗаМесяц", Ложь);
	НастройкиМакета.Вставить("СУчетомПереплатыКОплате", Ложь);
	
	НастройкиМакета.Вставить("СальдоВключаетОплату", Ложь);
	
	НастройкиМакета.Вставить("НастройкаСтавки", Перечисления.бит_НастройкиПоляСтавки.ТолькоСтавка);
	
	НастройкиМакета.Вставить("СубсидияПИЗаМесяц"          , Истина);
	НастройкиМакета.Вставить("СубсидияПИКОплате"          , Истина);
	
	// Счет извещения.
	Если ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СчетИзвещение5 Тогда
		
		НастройкиМакета.СальдоВключаетОплату    = Истина;
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		НастройкиМакета.СУчетомПереплатыКОплате = Истина;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СчетИзвещение3 Тогда
		
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СчетИзвещение4 Тогда
		
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		
	ИначеЕсли МакетКв = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СчетИзвещение6 Тогда
		
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СчетИзвещение7 Тогда
		
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		НастройкиМакета.СУчетомПереплатыКОплате = Истина;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СчетИзвещениеРСК Тогда
		
		НастройкиМакета.СальдоВключаетОплату = Истина;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СчетИзвещение8 Тогда
		
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;   
		НастройкиМакета.СУчетомПереплатыКОплате = Истина;
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		
		НастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТарифСтавка;
		
		// Квитанции.
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.КвитанцияСПБ Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		
		НастройкиМакета.СальдоВключаетОплату    = Истина;
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.Квитанция Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.Квитанция2 Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		НастройкиМакета.СальдоЗаМесяц     = Ложь;
		НастройкиМакета.ОплатаЗаМесяц     = Ложь;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.Квитанция3 Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.Квитанция4 Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		НастройкиМакета.СУчетомПереплатыКОплате = Истина;
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		НастройкиМакета.ПолеСуммыШК             = "ИтогоКОплатеСУчетомПредоплаты";
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.Квитанция5 Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		НастройкиМакета.СУчетомПереплатыКОплате = Истина;
		НастройкиМакета.СУчетомПереплатыЗаМесяц = Истина;
		НастройкиМакета.СальдоЗаМесяц           = Ложь;
		НастройкиМакета.ОплатаЗаМесяц           = Ложь;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.Квитанция6 Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		НастройкиМакета.СУчетомПереплатыКОплате  = Истина;
		НастройкиМакета.СУчетомПереплатыЗаМесяц  = Истина;
		НастройкиМакета.СальдоЗаМесяц            = Ложь;
		НастройкиМакета.ОплатаЗаМесяц            = Ложь;
		
		НастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТарифСтавка;
		
		// Платежные документы.
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.ПлатежныйДокумент Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		НастройкиМакета.СУчетомПереплатыЗаМесяц                        = Истина;
		
		НастройкиМакета.СальдоЗаМесяц     = Ложь;
		НастройкиМакета.ОплатаЗаМесяц     = Ложь;
		
		НастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТарифСтавка;
		
	ИначеЕсли ВариантСЧ = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.ПлатежныйДокумент1 Тогда
		
		НастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации = Истина;
		НастройкиМакета.СУчетомПереплатыЗаМесяц                        = Истина;
		
		НастройкиМакета.СальдоЗаМесяц     = Ложь;
		НастройкиМакета.ОплатаЗаМесяц     = Ложь;
		
		НастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТарифСтавка;
		
	КонецЕсли;
	
	Возврат  НастройкиМакета;
	
КонецФункции 

Функция ПолучитьСтруктуруДанных() Экспорт
	
	СтруктураДанных = Новый Структура;
	
	// Данные общие для печати.
	СтруктураДанных.Вставить("ПолучательПредставление"          , "");
	СтруктураДанных.Вставить("ПолучательСокращенноеНаименование", "");
	СтруктураДанных.Вставить("ПолучательРС"                     , Справочники.БанковскиеСчета.ПустаяСсылка());
	СтруктураДанных.Вставить("ПолучательБанк"                   , "");
	СтруктураДанных.Вставить("ПолучательКоррСчет"               , "");
	СтруктураДанных.Вставить("ПолучательИНН"                    , "");
	СтруктураДанных.Вставить("ПолучательКПП"                    , "");
	СтруктураДанных.Вставить("Период"                           , "");
	СтруктураДанных.Вставить("ПолучательАдрес"                  , "");
	СтруктураДанных.Вставить("ПолучательТелефон"                , "");
	
	// 17.10.2018
	СтруктураДанных.Вставить("ПолучательСайт"                   , "");
	//---

	СтруктураДанных.Вставить("ПолучательДопИнформация"          , "");
	СтруктураДанных.Вставить("ПолучательКоррСчет2"              , "");
	СтруктураДанных.Вставить("ПолучательБИК"                    , "");
	СтруктураДанных.Вставить("Дата"                             , КонецМесяца(ТекущаяДата()));
	СтруктураДанных.Вставить("ДатаПечатиКвитанций"              , "");
	СтруктураДанных.Вставить("ПериодМесяц"                      , "");
	СтруктураДанных.Вставить("ПериодГод"                        , "");
	СтруктураДанных.Вставить("ДатаНачалоМесяца"                 , НачалоМесяца(ТекущаяДата()));
	СтруктураДанных.Вставить("ДатаОкончанияМесяца"              , КонецМесяца(ТекущаяДата()));
	СтруктураДанных.Вставить("ПолучательПлатежа");
	СтруктураДанных.Вставить("ПроцентОтОплаты"                  , 0);
	// Данные заполняемы по ЛС.
	СтруктураДанных.Вставить("ЛицевойСчетФио"                   , Справочники.бит_Проживающие.ПустаяСсылка());
	СтруктураДанных.Вставить("ЛицевойСчетНомер"                 , "");
	СтруктураДанных.Вставить("ЛицевойСчетАдрес"                 , "");
	СтруктураДанных.Вставить("ЕЛСГИСЖКХ"						, "");
	СтруктураДанных.Вставить("ИдентификаторЖКУ"					, "");
	СтруктураДанных.Вставить("КапРемЕЛСГИСЖКХ"					, "");
	СтруктураДанных.Вставить("КапРемИдентификаторЖКУ"			, "");
	СтруктураДанных.Вставить("ЕЛС"								, "");
	СтруктураДанных.Вставить("ИдентификаторПД"					, "");
	СтруктураДанных.Вставить("КоличествоПроживающих"            , 0);
	СтруктураДанных.Вставить("КоличествоЗарегистрированных"     , 0);
	СтруктураДанных.Вставить("ОписаниеОбщейПлощади"             , 0);
	СтруктураДанных.Вставить("ОписаниеЖилойПлощади"             , 0);
	СтруктураДанных.Вставить("ОписаниеОтапливаемойПлощади"      , 0);
	
	СтруктураДанных.Вставить("Сальдо"                           , 0);
	СтруктураДанных.Вставить("СальдоЗнак"                       , "");
	СтруктураДанных.Вставить("СальдоСоЗнаком"                   , 0);
	СтруктураДанных.Вставить("Оплата"                           , 0);
	СтруктураДанных.Вставить("Льгота"                           , 0);
	СтруктураДанных.Вставить("Разовые"                          , 0);
	СтруктураДанных.Вставить("ЛицевойСчет"                      , Справочники.бит_ЛицевыеСчета.ПустаяСсылка());
	СтруктураДанных.Вставить("ИтогПени"                         , 0);
	СтруктураДанных.Вставить("КолЛьготников"                    , 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплаты"              , 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплатыГИСЖКХ"        , 0);
	СтруктураДанных.Вставить("СуммаПоследнейОплаты"				, 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплатыКапРем"        , 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплатыКапРемГИСЖКХ"  , 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплатыНеКапРем"      , 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплатыНеКапРемГИСЖКХ", 0);
	СтруктураДанных.Вставить("СтатусКвартиры"                   , Справочники.бит_СтатусыКвартиры.ПустаяСсылка());
	СтруктураДанных.Вставить("КоличествоКомнат"                 , 0);
	СтруктураДанных.Вставить("Переплата"                        , 0);
	СтруктураДанных.Вставить("Долг"                             , 0);
	СтруктураДанных.Вставить("Авансы"                           , 0);
	СтруктураДанных.Вставить("ПереплатаНаНачало"                , 0);
	СтруктураДанных.Вставить("Оплата"                           , 0);
	СтруктураДанных.Вставить("Начислено"                        , 0);
	СтруктураДанных.Вставить("НачисленоИнд"                     , 0);
	СтруктураДанных.Вставить("НачисленоОбщДом"                  , 0);
	СтруктураДанных.Вставить("КОплате"                          , 0);
	СтруктураДанных.Вставить("КОплатеЗаМесяц"                   , 0);
	СтруктураДанных.Вставить("Сальдо"                           , 0);
	СтруктураДанных.Вставить("ДолгНач"                          , 0);
	СтруктураДанных.Вставить("ДолгКон"                          , 0);
	СтруктураДанных.Вставить("Разовые"                          , 0);
	СтруктураДанных.Вставить("ТипКвартиры"                      , Справочники.бит_ТипыКвартиры.ПустаяСсылка());
	СтруктураДанных.Вставить("ОписаниеЛьгот"                    , "");
	СтруктураДанных.Вставить("ОписаниеСложнойЛьготы"            , "");
	СтруктураДанных.Вставить("ГруппироватьУслуги"               , Ложь);
	СтруктураДанных.Вставить("ПечатьЗависимыхЛС"                , Ложь);
	СтруктураДанных.Вставить("ДолгСУчетомОплаты"                , 0);
	СтруктураДанных.Вставить("РежимРаботы"                      ,"");
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПредоплаты"    ,0);
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПени"          ,0);
	// Добавлены данные об оплате пени.
	СтруктураДанных.Вставить("ОплатаСУчетомПени"                , 0);
	СтруктураДанных.Вставить("ОплатаПени"                       , 0);
	СтруктураДанных.Вставить("СубсидияПИ"                       , 0);
	СтруктураДанных.Вставить("ВходящееСальдоПени"               , 0);
	СтруктураДанных.Вставить("НачисленоПениЗаПериод"            , 0);
	СтруктураДанных.Вставить("ОплатитьДо"                       , "");
	СтруктураДанных.Вставить("КОплатеНаМоментПечати"            , "");
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПредоплатыНаМоментПечати"            , "");
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПениНаМоментПечати"            , "");
	СтруктураДанных.Вставить("ОбщаяПлощадьЖилогоЗдания"         , 0);
	СтруктураДанных.Вставить("МестОбщегоПользования"            , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьЖилыхПомещений"       , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьНежилыхПомещений"     , 0);
	СтруктураДанных.Вставить("ПлощадьЖилыхНежилых"              , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьПридомовойТерритории" , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьГрунта"               , 0);
	СтруктураДанных.Вставить("ПлощадьПринадлежащаяЧленамТСЖ"    , 0);
	СтруктураДанных.Вставить("КоличествоПодъездов"              , 0);
	СтруктураДанных.Вставить("КоличествоЭтажей"                 , 0);
	СтруктураДанных.Вставить("ДолгСУчетомОплатыБезШаблона"      , 0);
	СтруктураДанных.Вставить("ЗначениеШтрихкода"				, "");
	//21.02.2019
	СтруктураДанных.Вставить("ВходящееСальдоПлюсНачисленоЗаПериодПени"  , 0);
//	СтруктураДанных.Вставить("ЛьготаСубсидия"				 , 0);
	СтруктураДанных.Вставить("СубсидияПИ"					 , 0);
    СтруктураДанных.Вставить("СальдоСПени"					 , 0);
	// БИТ ЖКХ 26.02.2021
	СтруктураДанных.Вставить("КОплатеЗаМесяцСПени"           , 0);
	// БИТ ЖКХ 14.04.2021
	СтруктураДанных.Вставить("ВсегоПениЗаПериод"           , 0);
	СтруктураДанных.Вставить("ВсегоПени"                   , 0);
	СтруктураДанных.Вставить("КОплатеБезСтрахования"       , 0);
	СтруктураДанных.Вставить("КОплатеСоСтрахованием"       , 0);
	
	Возврат СтруктураДанных
	
КонецФункции

// Процедура заполняет структуру данных.
//
Процедура ЗаполнитьСтруктураДанных(СтруктураДанных) Экспорт
	
	СтруктураДанных.ПолучательПредставление           = мКэшОрганизации.НаименованиеСокращенное;
	СтруктураДанных.ПолучательРС                      = мКэшОрганизации.НомерСчета;
	СтруктураДанных.ПолучательБанк                    = мКэшОрганизации.ПолучательБанк;
	СтруктураДанных.ПолучательКоррСчет                = Строка(мКэшОрганизации.КоррСчет)+" \ "+Строка(мКэшОрганизации.БИК);
	СтруктураДанных.ПолучательИНН                     = мКэшОрганизации.ПолучательИНН;
	СтруктураДанных.ПолучательКПП                     = мКэшОрганизации.ПолучательКПП;
	СтруктураДанных.Период                            = Формат(Период,"ДФ='MMММ yyyy'")+" г.";
	СтруктураДанных.ПолучательАдрес                   = мКэшОрганизации.ПолучательАдрес;
	СтруктураДанных.ПолучательТелефон                 = мКэшОрганизации.ПолучательТелефон;
	// 17.10.2018
	СтруктураДанных.ПолучательСайт                    = мКэшОрганизации.ПолучательСайт;
	//---
	СтруктураДанных.ПолучательДопИнформация           = мКэшОрганизации.ПолучательДопИнформация;
	СтруктураДанных.ПолучательКоррСчет2               = Строка(мКэшОрганизации.КоррСчет);
	СтруктураДанных.ПолучательБИК                     = Строка(мКэшОрганизации.БИК);
	СтруктураДанных.Дата                              = Период;
	СтруктураДанных.ДатаПечатиКвитанций               = Формат(ДатаПечатиКвитанций,"ДФ=dd.MM.yyyy");
	СтруктураДанных.ПериодМесяц                       = Формат(Период,"ДФ=MM");
	СтруктураДанных.ПериодГод                         = Формат(Период,"ДФ=yyyy");
	СтруктураДанных.ДатаНачалоМесяца                  = Формат(НачалоМесяца(Период),"ДФ=dd.MM.yyyy");
	СтруктураДанных.ДатаОкончанияМесяца               = Формат(КонецМесяца(Период),"ДФ=dd.MM.yyyy");
	СтруктураДанных.ПолучательПлатежа                 = ПолучательПлатежа;
	
КонецПроцедуры

Функция ПолучитьТаблицуПечати() Экспорт
	
	ОписаниеЧисла_15_2 = ОбщегоНазначения.ОписаниеТипаЧисло(15,2);
	ОписаниеЧисла_16_4 = ОбщегоНазначения.ОписаниеТипаЧисло(16,4);
	ОписаниеЧисла_16_6 = ОбщегоНазначения.ОписаниеТипаЧисло(16,6);
	
	// Таблица печати услуг - содержит информацию по услугам.
	ТаблицаПечати = Новый ТаблицаЗначений;
	ТаблицаПечати.Колонки.Добавить("Услуга"						,Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ, СправочникСсылка.бит_ГруппыУслуг"));
	ТаблицаПечати.Колонки.Добавить("ГруппаУслуги"				,Новый ОписаниеТипов("СправочникСсылка.бит_ГруппыУслуг"));
	ТаблицаПечати.Колонки.Добавить("ГрафаОтчетаГЦЖС"			,Новый ОписаниеТипов("ПеречислениеСсылка.бит_ГрафыОтчетаПоГЦЖС"));
	ТаблицаПечати.Колонки.Добавить("Сальдо"						,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("ЕдИзм"						,Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаПечати.Колонки.Добавить("Количество"					,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечати.Колонки.Добавить("Пени"						,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Норма"						,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("СверхНорма"					,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Ставка"						,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("СверхНормативнаяСтавка"		,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("Начислено"					,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Льгота"						,ОписаниеЧисла_15_2);
	//19.03.2019
	ТаблицаПечати.Колонки.Добавить("ЛьготаСубсидия"				,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("СубсидияПИ"				    ,ОписаниеЧисла_15_2);  
	ТаблицаПечати.Колонки.Добавить("Оплата"						,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Разовые"					,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("КОплатеЗаМесяц"				,ОписаниеЧисла_15_2);
	
	// БИТ ЖКХ 14.04.2021
	ТаблицаПечати.Колонки.Добавить("ВсегоПениЗаПериод"			,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("ВсегоПени"   			    ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("КОплатеБезСтрахования"		,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("КОплатеСоСтрахованием"		,ОписаниеЧисла_15_2);
	
	//30.05.2019
	ТаблицаПечати.Колонки.Добавить("ИтогоКОплатеСУчетомПени"	,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("КОплате"					,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Долг"						,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("ПереплатаНаНачало"			,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Поставщик"					,Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	ТаблицаПечати.Колонки.Добавить("ПолучательПлатежа"			,Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.Организации"));
	ТаблицаПечати.Колонки.Добавить("ПолучательПлатежаИмя"		,ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПечати.Колонки.Добавить("ПолучательИНН"				,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПечати.Колонки.Добавить("ПолучательКПП"				,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("ПолучательРС"				,ОбщегоНазначения.ОписаниеТипаСтрока(34));
	ТаблицаПечати.Колонки.Добавить("ПолучательКоррСчет"			,ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаПечати.Колонки.Добавить("ПолучательБИК"				,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("ПолучательБанк"				,ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаПечати.Колонки.Добавить("КапПолучательПлатежа"		,Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.Организации"));
	ТаблицаПечати.Колонки.Добавить("КапПолучательПлатежаИмя"	,ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПечати.Колонки.Добавить("КапПолучательИНН"			,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПечати.Колонки.Добавить("КапПолучательКПП"			,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("КапПолучательРС"			,ОбщегоНазначения.ОписаниеТипаСтрока(34));
	ТаблицаПечати.Колонки.Добавить("КапПолучательКоррСчет"		,ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаПечати.Колонки.Добавить("КапПолучательБИК"			,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("КапПолучательБанк"			,ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаПечати.Колонки.Добавить("ЗакрытиеВхДолга"			,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Приоритет"					,ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПечати.Колонки.Добавить("ПриоритетГруп"				,ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПечати.Колонки.Добавить("Тариф"						,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечати.Колонки.Добавить("НастройкаСтавки"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечати.Колонки.Добавить("Объем"						,ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаПечати.Колонки.Добавить("Объем_точность3"			,ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("Объем_точность2"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПечати.Колонки.Добавить("Норматив"					,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("УслугаПредставление"		,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПечати.Колонки.Добавить("ОбщедомовыеНачисления"		,Новый ОписаниеТипов("Булево"));
	
	// Колонки Платежного документа.
	ТаблицаПечати.Колонки.Добавить("ОбъемИНД"							,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ОбъемИНД_точность3"					,ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ОбъемИНД_точность2"					,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПечати.Колонки.Добавить("ОбъемОбщДом"						,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ОбъемОбщДом_точность3"				,ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ОбъемОбщДом_точность2"				,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПечати.Колонки.Добавить("НачисленоИНД"						,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("НачисленоОбщДом"					,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("НормативИНД"						,ОписаниеЧисла_16_6);
	ТаблицаПечати.Колонки.Добавить("НормативОбщДом"						,ОписаниеЧисла_16_6);
	ТаблицаПечати.Колонки.Добавить("КоличествоЕдиницИНД"				,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("КоличествоЕдиницГУРП"				,ОписаниеЧисла_16_4);
	
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИнд"          			,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИнд_точность3"			,ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИнд_точность2"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемОбщедомовых"				,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемОбщедомовых_точность3"	,ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемОбщедомовых_точность2"	,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	ТаблицаПечати.Колонки.Добавить("АдресИТелефонПоставщика"			,ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИндИПУ"					,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИндНорматив"				,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("СпособРасчета"						,Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
			
	Возврат ТаблицаПечати;
	
КонецФункции

Функция ПолучитьТаблицуПечатиСчетчиков() Экспорт
	
	// Таблица печати счетчиков - содержит информацию по счетчикам на лс.
	ТаблицаПечатиСчетчиков = Новый ТаблицаЗначений;
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ЛицевойСчет"			,Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Счетчик"				,Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Услуга"				,Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Приоритет"				,ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДоПоказаний"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ОтПоказаний"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("КоличествоЕдиниц"		,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));	
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Многотарифный"			,Новый ОписаниеТипов("Булево"));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДатаПоверки"			,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("СокрНаименование"		,ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("НормативИнд"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,6));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("НормативОбщДом"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,6));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ОбъемОбщДом"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,4)); 
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДоПоказанийИнд"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДоПоказанийОбщДом"		,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ОбъемИнд"				, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("УслугаПредставление"	,ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ЕдИзм"					,Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	
	Возврат ТаблицаПечатиСчетчиков;
	
КонецФункции

Функция ПолучитьТаблицуПерерасчетов() Экспорт
	
	// Таблица печати счетчиков - содержит информацию по счетчикам на лс.
	ТаблицаПерерасчетов = Новый ТаблицаЗначений;
	ТаблицаПерерасчетов.Колонки.Добавить("Услуга"     , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПерерасчетов.Колонки.Добавить("Основание"  , ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПерерасчетов.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(999));
	ТаблицаПерерасчетов.Колонки.Добавить("Сумма"      , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПерерасчетов.Колонки.Добавить("Поставщик"  , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	
	Возврат ТаблицаПерерасчетов;
	
КонецФункции 

Функция ПолучитьТаблицаПлатежиГИСЖКХ12() Экспорт
	
	ТаблицаПлатежиГИСЖКХ12 = Новый ТаблицаЗначений;
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ЛицевойСчет"						, Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ИдентификаторЖКУ"					, ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ТипПД"								, ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("РасчетныйПериод"					, Новый ОписаниеТипов("Дата"));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("КОплатеЗаМесяц"					, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ЗадолженностьЗаПредыдущиеПериоды"	, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("АвансНаНачалоПериода"				, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("Оплачено"							, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ЧислоРасчетногоПериода"			, ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ДатаПоследнейОплаты"				, Новый ОписаниеТипов("Дата"));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ДатаПоследнейОплатыКапРем"			, Новый ОписаниеТипов("Дата"));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ИтогоКОплатеЗаРС"					, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ИтогоКОплатеЗаРССальдо"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("БИКБанка"							, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("РасчетныйСчет"						, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("РазмерВзносаНаКвМ"					, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ВсегоНачислено"					, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ПерерасчетыВсего"					, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ЛьготыСубсидии"					, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ПорядокРасчетов"					, ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ИтогоКОплате"						, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ИтогПени"							, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ТабличнйДокумент"					, Новый ОписаниеТипов("ТабличныйДокумент"));
	ТаблицаПлатежиГИСЖКХ12.Колонки.Добавить("ОснованиеПересчетов"	, ОбщегоНазначения.ОписаниеТипаСтрока(500));

	Возврат ТаблицаПлатежиГИСЖКХ12;

КонецФункции

Функция ПолучитьТаблицаПлатежиГИСЖКХ12Получатели() Экспорт
	
	МассивПолучателейПлатежа = Новый Массив;
	МассивПолучателейПлатежа.Добавить(Тип("СправочникСсылка.Организации"));
	МассивПолучателейПлатежа.Добавить(Тип("СправочникСсылка.Контрагенты"));
	
	ТаблицаПлатежиГИСЖКХ12Получатели = Новый ТаблицаЗначений;
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("ПолучательПлатежа" , Новый ОписаниеТипов(МассивПолучателейПлатежа));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("БИКБанка"		  , ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("РасчетныйСчет"	  , ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("РазмерВзносаНаКвМ" , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("ВсегоНачислено"	  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("ПерерасчетыВсего"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("ЛьготыСубсидии"	  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("ПорядокРасчетов"	  , ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("ИтогоКОплате"	  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("КОплатеЗаМесяц"	  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	ТаблицаПлатежиГИСЖКХ12Получатели.Колонки.Добавить("ОснованиеПересчетов"	, ОбщегоНазначения.ОписаниеТипаСтрока(500));

	Возврат ТаблицаПлатежиГИСЖКХ12Получатели;
	
КонецФункции

Процедура ОбновитьТаблицаПлатежиГИСЖКХ12Получатели(ТаблицаПлатежиГИСЖКХ12Получатели, Строка)
	
	// Только по графе ГЦЖС кап. рем. (Суммируем).
	Если ЭтотОбъект.ПолучательПлатежа924 Тогда
		
		МассивСтрок = ТаблицаПлатежиГИСЖКХ12Получатели.НайтиСтроки(Новый Структура("ПолучательПлатежа", Строка.ПолучательПлатежа));
		Для Каждого Элт Из МассивСтрок Цикл
			Элт.РазмерВзносаНаКвМ = Строка.НастройкаСтавки;
			Элт.ВсегоНачислено	  = Элт.ВсегоНачислено + Строка.Начислено;
			Элт.ПерерасчетыВсего  = Элт.ПерерасчетыВсего + Строка.Разовые;
			Элт.ЛьготыСубсидии	  = Элт.ЛьготыСубсидии + Строка.Льгота;
			Элт.ПорядокРасчетов	  = ""; // Свободный комментарий 500 символов, не используется!.
			Элт.ИтогоКОплате	  = Элт.ИтогоКОплате + Строка.КОплатеЗаМесяц;
		КонецЦикла;
		
	Иначе
		//мТаблицаПерерасчетов
		
		Для Каждого Элт Из ТаблицаПлатежиГИСЖКХ12Получатели Цикл
			Элт.РазмерВзносаНаКвМ = Строка.НастройкаСтавки;
			Элт.ВсегоНачислено	  = Элт.ВсегоНачислено + Строка.Начислено;
			Элт.ПерерасчетыВсего  = Элт.ПерерасчетыВсего + Строка.Разовые;
			Элт.ЛьготыСубсидии	  = Элт.ЛьготыСубсидии + Строка.Льгота;
			Элт.ПорядокРасчетов	  = ""; // Свободный комментарий 500 символов, не используется!.
			Элт.ИтогоКОплате	  = Элт.ИтогоКОплате + Строка.КОплатеЗаМесяц;
			
			//25.10.2019
			если мТаблицаПерерасчетов.Количество() > 0 тогда				
			  Элт.ОснованиеПересчетов = НайтиОснованиеДляКапРемонта(мТаблицаПерерасчетов);            		     		  
			конецесли; 
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры	

//25.10.2019
функция НайтиОснованиеДляКапРемонта(ТаблицаПерерасчетов)
	
	для каждого стр из ТаблицаПерерасчетов цикл
		
	  если стр.Услуга.ГрафаОтчетаГЦЖС = перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт тогда	
		  
		  возврат стр.Основание;
		  
	  конецесли;	  
		  
	конеццикла;	
	
	возврат "";
	
конецфункции	

Функция ПолучитьТаблицаПлатежиГИСЖКХ36() Экспорт
	
	ТаблицаПлатежиГИСЖКХ36 = Новый ТаблицаЗначений;
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ЛицевойСчет"			, Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("Услуга"				, Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ГрафаОтчетаПоГЦЖС"		, Новый ОписаниеТипов("ПеречислениеСсылка.бит_ГрафыОтчетаПоГЦЖС"));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ОбъемКомУслугИнд"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ОбъемКомУслугОбщ"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("СпособРасчета"			, Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("Тариф"					, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("Перерасчеты"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("Льготы"				, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ПорядокРасчетов"		, ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("НормативИнд"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("НормативОбщ"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ТекПоказанияИнд"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ТекПоказанияОбщ"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("СуммарныйОбъемИнд"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("СуммарныйОбъемОбщ"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ОснованиеПересчетов"	, ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("СуммаПересчетов"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ИтогоКОплатеВсего"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("НачисленоИнд"			, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("НачисленоОбщДом"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
    // БИТ ЖКХ 26.12.2019
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ЗадолженностьЗаПредыдущиеПериоды"	, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("АвансНаНачалоПериода"				, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ИтогоКОплате"						, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ИтогПени"							, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	 // БИТ ЖКХ 17.02.2020
	ТаблицаПлатежиГИСЖКХ36.Колонки.Добавить("ЗакрытиеВхДолга"	, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Возврат ТаблицаПлатежиГИСЖКХ36;

КонецФункции

Процедура ЗаполнитьТаблицаПлатежиГИСЖКХ36(ЛС, Источник)
	
	//// Если долговой, не заполняем таблицу.
	//Если ШаблонИзвещений.Сальдо = Перечисления.ДаНет.Да Тогда
	//	Возврат;	
	//КонецЕсли;
	
	НоваяСтр = мТаблицаПлатежиГИСЖКХ36.Добавить();
	НоваяСтр.ЛицевойСчет		= ЛС;
	НоваяСтр.Услуга				= Источник.Услуга;
	НоваяСтр.ГрафаОтчетаПоГЦЖС	= Источник.ГрафаОтчетаГЦЖС;
	НоваяСтр.ОбъемКомУслугИнд	= Источник.ОбъемИНД;
	НоваяСтр.ОбъемКомУслугОбщ	= Источник.ОбъемОбщДом;
	НоваяСтр.СпособРасчета		= Источник.СпособРасчета;
	НоваяСтр.Тариф				= Источник.НастройкаСтавки;
	НоваяСтр.Перерасчеты		= Источник.Разовые;
	НоваяСтр.Льготы				= Источник.Льгота;
	НоваяСтр.ПорядокРасчетов	= "";
	НоваяСтр.НормативИнд		= Источник.НормативИНД;
	НоваяСтр.НормативОбщ		= Источник.НормативОбщДом;
	Если Источник.ОбщедомовыеНачисления Тогда
		НоваяСтр.ТекПоказанияИнд	= Источник.КоличествоЕдиницИНД;
		НоваяСтр.ТекПоказанияОбщ	= Источник.КоличествоЕдиницГУРП;
	Иначе
		НоваяСтр.ТекПоказанияИнд	= Источник.КоличествоЕдиницИНД + Источник.КоличествоЕдиницГУРП;
		НоваяСтр.ТекПоказанияОбщ	= 0;
	КонецЕсли;
	НоваяСтр.СуммарныйОбъемИнд	= Источник.ИтогоОбъемИнд;
	НоваяСтр.СуммарныйОбъемОбщ	= Источник.ИтогоОбъемОбщедомовых;
	НоваяСтр.ИтогоКОплатеВсего	= Источник.КОплатеЗаМесяц;
	НоваяСтр.НачисленоИнд		= Источник.НачисленоИнд;
	НоваяСтр.НачисленоОбщДом	= Источник.НачисленоОбщДом;
	
// БИТ ЖКХ 26.12.2019	
	НоваяСтр.АвансНаНачалоПериода = Источник.Сальдо;
	НоваяСтр.ЗадолженностьЗаПредыдущиеПериоды = Источник.Долг;
	НоваяСтр.ИтогПени = Источник.Пени;
	НоваяСтр.ИтогоКОплате = Источник.КОплате;
	
	// БИТ ЖКХ 17.2.2020	
	НоваяСтр.ЗакрытиеВхДолга = Источник.ЗакрытиеВхДолга;

	
КонецПроцедуры

Процедура ОбновитьТаблицаПлатежиГИСЖКХ36(ЛС, Источник, ИспользоватьКомментарийКакОснование)
	
	МассивСтрок = мТаблицаПлатежиГИСЖКХ36.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", ЛС, Источник.Услуга));
	Для Каждого Элт Из МассивСтрок Цикл
		Если ИспользоватьКомментарийКакОснование Тогда
			Элт.ОснованиеПересчетов	= Источник.Комментарий;
		Иначе	
			Элт.ОснованиеПересчетов	= Источник.Основание;
		КонецЕсли;
		Элт.СуммаПересчетов	= Источник.Сумма;
	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьТаблицаПлатежиГИСЖКХДПД() Экспорт
	
	ТаблицаПлатежиГИСЖКХДПД = Новый ТаблицаЗначений;
	ТаблицаПлатежиГИСЖКХДПД.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПлатежиГИСЖКХДПД.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПлатежиГИСЖКХДПД.Колонки.Добавить("ИтогоКОплате", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));

	Возврат ТаблицаПлатежиГИСЖКХДПД;

КонецФункции

Процедура ЗаполнитьТаблицаПлатежиГИСЖКХДПД(ЛС, Источник)
	
	//// Если текущий (не долговой) и нулевая сумма, не заполняем таблицу.
	//Если НЕ ШаблонИзвещений.Сальдо = Перечисления.ДаНет.Да Тогда
	//	Возврат;	
	//КонецЕсли;
	
	НоваяСтр = мТаблицаПлатежиГИСЖКХДПД.Добавить();
	НоваяСтр.ЛицевойСчет  = ЛС;
	НоваяСтр.Услуга		  = Источник.Услуга;
	НоваяСтр.ИтогоКОплате = Источник.ЗакрытиеВхДолга;
	
КонецПроцедуры

Функция ПолучитьТаблицаПлатежиГИСЖКХНеустойки() Экспорт
	
	ТаблицаПлатежиГИСЖКХНеустойки = Новый ТаблицаЗначений;
	ТаблицаПлатежиГИСЖКХНеустойки.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПлатежиГИСЖКХНеустойки.Колонки.Добавить("ПениЗаПериод"	, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПлатежиГИСЖКХНеустойки.Колонки.Добавить("ПениИтого"		, ОбщегоНазначения.ОписаниеТипаЧисло(15,2));

	Возврат ТаблицаПлатежиГИСЖКХНеустойки;

КонецФункции

Процедура ЗаполнитьТаблицаПлатежиГИСЖКХНеустойки(ЛС, ПениЗаПериод, ПениИтого)
	
	Если ПениЗаПериод <= 0 И ПениИтого <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтр = мТаблицаПлатежиГИСЖКХНеустойки.Добавить();
	НоваяСтр.ЛицевойСчет	= ЛС;
	НоваяСтр.ПениЗаПериод	= ПениЗаПериод;
	НоваяСтр.ПениИтого		= ПениИтого;
	
КонецПроцедуры

// Возвращает запрос для группировки услуг при заполнении макетов печатных форм.
Функция ПолучитьЗапросГруппировки(ТаблицаОбхода)
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ТаблицаПечати", ТаблицаОбхода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПечати.ГруппаУслуги,
	|	ТаблицаПечати.Услуга,
	|	ТаблицаПечати.АдресИТелефонПоставщика,
	|	ТаблицаПечати.ГрафаОтчетаГЦЖС,
	|	ТаблицаПечати.Долг,
	|	ТаблицаПечати.ЕдИзм,
	|	ТаблицаПечати.ЗакрытиеВхДолга,
	|	ТаблицаПечати.ИтогоОбъемИнд,
	|	ТаблицаПечати.ИтогоОбъемИнд_точность2,
	|	ТаблицаПечати.ИтогоОбъемИнд_точность3,
	|	ТаблицаПечати.ИтогоОбъемИндИПУ,
	|	ТаблицаПечати.ИтогоОбъемИндНорматив,
	|	ТаблицаПечати.ИтогоОбъемОбщедомовых,
	|	ТаблицаПечати.ИтогоОбъемОбщедомовых_точность2,
	|	ТаблицаПечати.ИтогоОбъемОбщедомовых_точность3,
	|	ТаблицаПечати.КОплате,
	|	ТаблицаПечати.КОплатеЗаМесяц,
	|	ТаблицаПечати.КапПолучательБИК,
	|	ТаблицаПечати.КапПолучательБанк,
	|	ТаблицаПечати.КапПолучательИНН,
	|	ТаблицаПечати.КапПолучательКПП,
	|	ТаблицаПечати.КапПолучательКоррСчет,
	|	ТаблицаПечати.КапПолучательПлатежа,
	|	ТаблицаПечати.КапПолучательПлатежаИмя,
	|	ТаблицаПечати.КапПолучательРС,
	|	ТаблицаПечати.Количество,
	|	ТаблицаПечати.КоличествоЕдиницГУРП,
	|	ТаблицаПечати.КоличествоЕдиницИНД,
	|	ТаблицаПечати.Льгота,
	|	ТаблицаПечати.НастройкаСтавки,
	|	ТаблицаПечати.Начислено,
	|	ТаблицаПечати.НачисленоИНД,
	|	ТаблицаПечати.НачисленоОбщДом,
	|	ТаблицаПечати.Норма,
	|	ТаблицаПечати.Норматив,
	|	ТаблицаПечати.НормативИНД,
	|	ТаблицаПечати.НормативОбщДом,
	|	ТаблицаПечати.Объем,
	|	ТаблицаПечати.Объем_точность2,
	|	ТаблицаПечати.Объем_точность3,
	|	ТаблицаПечати.ОбъемИНД,
	|	ТаблицаПечати.ОбъемИНД_точность2,
	|	ТаблицаПечати.ОбъемИНД_точность3,
	|	ТаблицаПечати.ОбъемОбщДом,
	|	ТаблицаПечати.ОбъемОбщДом_точность2,
	|	ТаблицаПечати.ОбъемОбщДом_точность3,
	|	ТаблицаПечати.Оплата,
	|	ТаблицаПечати.Пени,
	|	ТаблицаПечати.ПереплатаНаНачало,
	|	ТаблицаПечати.ПолучательБИК,
	|	ТаблицаПечати.ПолучательБанк,
	|	ТаблицаПечати.ПолучательИНН,
	|	ТаблицаПечати.ПолучательКПП,
	|	ТаблицаПечати.ПолучательКоррСчет,
	|	ТаблицаПечати.ПолучательПлатежа,
	|	ТаблицаПечати.ПолучательПлатежаИмя,
	|	ТаблицаПечати.ПолучательРС,
	|	ТаблицаПечати.Поставщик,
	|	ТаблицаПечати.Приоритет,
	|	ТаблицаПечати.ПриоритетГруп,
	|	ТаблицаПечати.Разовые,
	|	ТаблицаПечати.Сальдо,
	|	ТаблицаПечати.СверхНорма,
	|	ТаблицаПечати.СверхНормативнаяСтавка,
	|	ТаблицаПечати.Ставка,
	|	ТаблицаПечати.СубсидияПИ,
	|	ТаблицаПечати.Тариф,
	|	ТаблицаПечати.УслугаПредставление
	|ПОМЕСТИТЬ ТМП
	|ИЗ
	|	&ТаблицаПечати КАК ТаблицаПечати
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТМП.ГруппаУслуги КАК Услуга,
	|	ТМП.Услуга КАК УслугаСтар,
	|	ТМП.АдресИТелефонПоставщика,
	|	ТМП.ГрафаОтчетаГЦЖС,
	|	ТМП.Долг КАК Долг,
	|	ТМП.ЕдИзм,
	|	ТМП.ЗакрытиеВхДолга,
	|	ТМП.ИтогоОбъемИнд,
	|	ТМП.ИтогоОбъемИнд_точность2,
	|	ТМП.ИтогоОбъемИнд_точность3,
	|	ТМП.ИтогоОбъемИндИПУ,
	|	ТМП.ИтогоОбъемИндНорматив,
	|	ТМП.ИтогоОбъемОбщедомовых,
	|	ТМП.ИтогоОбъемОбщедомовых_точность2,
	|	ТМП.ИтогоОбъемОбщедомовых_точность3,
	|	ТМП.КОплате КАК КОплате,
	|	ТМП.КОплатеЗаМесяц КАК КОплатеЗаМесяц,
	|	ТМП.КапПолучательБИК,
	|	ТМП.КапПолучательБанк,
	|	ТМП.КапПолучательИНН,
	|	ТМП.КапПолучательКПП,
	|	ТМП.КапПолучательКоррСчет,
	|	ТМП.КапПолучательПлатежа,
	|	ТМП.КапПолучательПлатежаИмя,
	|	ТМП.КапПолучательРС,
	|	ТМП.Количество,
	|	ТМП.КоличествоЕдиницГУРП,
	|	ТМП.КоличествоЕдиницИНД,
	|	ТМП.Льгота КАК Льгота,
	|	ТМП.НастройкаСтавки,
	|	ТМП.Начислено КАК Начислено,
	|	ТМП.НачисленоИНД,
	|	ТМП.НачисленоОбщДом,
	|	ТМП.Норма,
	|	ТМП.Норматив,
	|	ТМП.НормативИНД,
	|	ТМП.НормативОбщДом,
	|	ТМП.Объем,
	|	ТМП.Объем_точность2,
	|	ТМП.Объем_точность3,
	|	ТМП.ОбъемИНД,
	|	ТМП.ОбъемИНД_точность2,
	|	ТМП.ОбъемИНД_точность3,
	|	ТМП.ОбъемОбщДом,
	|	ТМП.ОбъемОбщДом_точность2,
	|	ТМП.ОбъемОбщДом_точность3,
	|	ТМП.Оплата КАК Оплата,
	|	ТМП.Пени КАК Пени,
	|	ТМП.ПереплатаНаНачало КАК ПереплатаНаНачало,
	|	ТМП.ПолучательБИК,
	|	ТМП.ПолучательБанк,
	|	ТМП.ПолучательИНН,
	|	ТМП.ПолучательКПП,
	|	ТМП.ПолучательКоррСчет,
	|	ТМП.ПолучательПлатежа,
	|	ТМП.ПолучательПлатежаИмя,
	|	ТМП.ПолучательРС,
	|	ТМП.Поставщик,
	|	ТМП.Приоритет,
	|	ТМП.ПриоритетГруп КАК ПриоритетГруп,
	|	ТМП.Разовые КАК Разовые,
	|	ТМП.Сальдо КАК Сальдо,
	|	ТМП.СверхНорма,
	|	ТМП.СверхНормативнаяСтавка,
	|	ТМП.Ставка,
	|	ТМП.СубсидияПИ,
	|	ТМП.Тариф,
	|	ТМП.УслугаПредставление,
	|	ВЫРАЗИТЬ(ТМП.ГруппаУслуги КАК Справочник.бит_ГруппыУслуг).Наименование КАК ГруппаУслугиПредставление
	|ИЗ
	|	ТМП КАК ТМП
	|ИТОГИ
	|	СУММА(Долг),
	|	СУММА(КОплате),
	|	СУММА(КОплатеЗаМесяц),
	|	СУММА(Льгота),
	|	СУММА(Начислено),
	|	СУММА(Оплата),
	|	СУММА(Пени),
	|	СУММА(ПереплатаНаНачало),
	|	МАКСИМУМ(ПриоритетГруп),
	|	СУММА(Разовые),
	|	СУММА(Сальдо),
	|	МАКСИМУМ(ГруппаУслугиПредставление)
	|ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТМП";
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечатиКвитанций

// Печать макета по алгоритму пользовательской функции.
//
// Параметры:
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ВыполнитьПользовательскуюФункцию()
	
	Результат = Неопределено;
	
	Попытка
		Выполнить(МакетКв.КодФункции);
	Исключение	
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Ошибка выполнения пользовательской функции:
									|%1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Печать макета Счет - извещение.
//
Функция ПечатьСчетИзвещение(ДляКиева = Ложь) Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	// Области отрвной части.
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	
	// Основные области печати.
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	Попытка
		СтрокаРасшифровкиГр = мМакет.ПолучитьОбласть("СтрокаРасшифровкиГр");
	Исключение
		СтрокаРасшифровкиГр = Неопределено;
	КонецПопытки;
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого"); 
	СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ШапкаПриборыУчета   = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьКассовыйСбор     = мМакет.ПолучитьОбласть("КассовыйСбор");
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	Если ДляКиева Тогда
		СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета_2");
	КонецЕсли; 
	
	СчВывода = ?(мТаблицаПечатиСчетчиков.Количество() > 0,4,5);
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате        + мСтруктураДанных.ПроцентОтОплаты;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		Квитанция.Вывести(ОбластьПолучатель);
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШтрихКод.Рисунки.очистить();
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьПлательщик);
		
		Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
			Квитанция.Вывести(ШапкаПриборыУчета);
		КонецЕсли; 
		
		Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
			
			Если СчВывода = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			
			Квитанция.Вывести(СтрокаПриборовУчета);
			
			СчВывода = СчВывода - 1;
			
		КонецЦикла; 
		
		Пока НЕ СчВывода = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПриборыУчета);
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
		ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);

		Квитанция.Вывести(СтрокаПриборовУчета);
		
		СчВывода = СчВывода - 1;
		
	КонецЦикла;
	
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Если НЕ СтрокаРасшифровкиГр = Неопределено
		И (ГруппироватьУслуги ИЛИ мСтруктураДанных.ГруппироватьУслуги) Тогда
		
		Запрос = ПолучитьзапросГруппировки(мТаблицаПечати);
		ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГруп.Следующий() Цикл
			
			СтрокаРасшифровкиГр.Параметры.Заполнить(ВыборкаГруп);
			СтрокаРасшифровкиГр.Параметры.УслугаПредставление = ВРег(ВыборкаГруп.ГруппаУслугиПредставление);
			
			Выборка = ВыборкаГруп.Выбрать();
			
			Если Выборка.Количество() = 1 Тогда // Едсинственная услуга в группировки.
				
				Выборка.Следующий();
				
				СтрокаРасшифровкиГр.Параметры.Заполнить(Выборка);
				СтрокаРасшифровкиГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
				Квитанция.Вывести(СтрокаРасшифровкиГр);
				
			ИначеЕсли Выборка.Количество() > 1 Тогда 
				
				Квитанция.Вывести(СтрокаРасшифровкиГр);
				
				Пока Выборка.Следующий() И РасскрытьСоставГрупп Цикл
					СтрокаРасшифровки.Параметры.Заполнить(Выборка);
					Квитанция.Вывести(СтрокаРасшифровки);
				КонецЦикла; 
				
			ИначеЕсли ВыборкаГруп.Услуга.Пустая() Тогда 
				
				Пока Выборка.Следующий() Цикл
					СтрокаРасшифровкиГр.Параметры.Заполнить(Выборка);
					СтрокаРасшифровкиГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
					Квитанция.Вывести(СтрокаРасшифровкиГр);
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
			СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
			Квитанция.Вывести(СтрокаРасшифровки);
		КонецЦикла;
	
	КонецЕсли;
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		
		// Вывод информации о кассовом сборе.
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "ПроцентОтОплаты", мСтруктураДанных.ПроцентОтОплаты);
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "Процент"        , Процент);
		
		Если мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплате Тогда
			мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплатеЗаМесяц + мСтруктураДанных.ПроцентОтОплаты;
		КонецЕсли; 
		
		Квитанция.Вывести(ОбластьКассовыйСбор);
		
	КонецЕсли;
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьИтого);
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Квитанция, ОбластьШтрихкодQR);
	Иначе
	    УбратьQRКод(Квитанция)
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Счет - извещение с 8-мью счетчиками.
//
Функция ПечатьСчетИзвещение1() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого"); 
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьКассовыйСбор     = мМакет.ПолучитьОбласть("КассовыйСбор");
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	ШапкаПриборыУчетаЛево    = мМакет.ПолучитьОбласть("ШапкаПриборыУчетаЛево");
	СтрокаПриборовУчетаЛево  = мМакет.ПолучитьОбласть("СтрокаПриборовУчетаЛево");
	ШапкаПриборыУчетаПраво   = мМакет.ПолучитьОбласть("ШапкаПриборыУчетаПраво");
	СтрокаПриборовУчетаПраво = мМакет.ПолучитьОбласть("СтрокаПриборовУчетаПраво");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате + мСтруктураДанных.ПроцентОтОплаты;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	КолВоСч       = мТаблицаПечатиСчетчиков.Количество();
	СчВыводаЛево  = ?(КолВоСч > 0, 4, 5);
	СчВыводаПраво = 0;
	Если КолВоСч > 4 Тогда
		СчВыводаПраво = Мин(КолВоСч - 4, 4);
	КонецЕсли;
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		// Вывод информаци о получателе.
		Квитанция.Вывести(ОбластьПолучатель);
		
		// Формирование картинки штрихкода.
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШтрихКод.Рисунки.очистить();
		КонецЕсли;
		
		// Вывод информации о плательщике.
		Квитанция.Вывести(ОбластьПлательщик);
		
		// Вывод счетчиков в машинопечатный блок.
		
		Если КолВоСч > 0 Тогда
			Квитанция.Вывести(ШапкаПриборыУчетаЛево);
		КонецЕсли;
		
		Если КолВоСч > 4 Тогда
			Квитанция.Присоединить(ШапкаПриборыУчетаПраво);
		КонецЕсли; 
		
		Для Значение = 1 По КолВоСч Цикл
			
			Если СчВыводаЛево = 0 И СчВыводаПраво = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если НЕ СчВыводаЛево = 0 Тогда
				
				СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение-1];
				
				СтрокаПриборовУчетаЛево.Параметры.Заполнить(СтрокаТаблицы);
				ЗаполнитьПараметр(СтрокаПриборовУчетаЛево, "Услуга", СтрокаТаблицы.СокрНаименование);
				Квитанция.Вывести(СтрокаПриборовУчетаЛево);
				
				СчВыводаЛево = СчВыводаЛево - 1;
				
			КонецЕсли;
			
			Если НЕ СчВыводаПраво = 0 Тогда
				
				СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение+4-1];
				
				СтрокаПриборовУчетаПраво.Параметры.Заполнить(СтрокаТаблицы);
				ЗаполнитьПараметр(СтрокаПриборовУчетаПраво, "Услуга", СтрокаТаблицы.СокрНаименование);
				Квитанция.Присоединить(СтрокаПриборовУчетаПраво);
				
				СчВыводаПраво = СчВыводаПраво - 1;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		Пока НЕ СчВыводаЛево = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВыводаЛево = СчВыводаЛево - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	// Вывод счетчиков в отрывной блок.
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПриборыУчетаЛево);
	КонецЕсли;
	
	СчВыводаЛево  = КолВоСч;
	СчВыводаПраво = 0;
	Половина      = 0;
	
	Если КолВоСч > 4 Тогда
		
		Квитанция.Присоединить(ШапкаПриборыУчетаПраво);
		
		Половина = Окр(КолВоСч/2,0, РежимОкругления.Окр15как20);
		СчВыводаЛево  = Макс(4,Половина);
		СчВыводаПраво = КолВоСч - СчВыводаЛево;
		Половина      = СчВыводаЛево;
		
	КонецЕсли; 
	
	Для Значение = 1 По КолВоСч Цикл
		
		Если СчВыводаЛево = 0 И СчВыводаПраво = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ СчВыводаЛево = 0 Тогда
			
			СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение-1];
			
			СтрокаПриборовУчетаЛево.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчетаЛево, "Услуга", СтрокаТаблицы.СокрНаименование);
			Квитанция.Вывести(СтрокаПриборовУчетаЛево);
			
			СчВыводаЛево = СчВыводаЛево - 1;
			
		КонецЕсли;
		
		Если НЕ СчВыводаПраво = 0 Тогда
			
			СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение+Половина-1];
			
			СтрокаПриборовУчетаПраво.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчетаПраво, "Услуга", СтрокаТаблицы.СокрНаименование);
			Квитанция.Присоединить(СтрокаПриборовУчетаПраво);
			
			СчВыводаПраво = СчВыводаПраво - 1;
			
		КонецЕсли;
		
	КонецЦикла;
	// Вывод таблицы с данными о начислениях.
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаРасшифровки);
		
	КонецЦикла; 
	
	// Вывод итоговой информации.
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		
		// Вывод информации о кассовом сборе.
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "ПроцентОтОплаты", мСтруктураДанных.ПроцентОтОплаты);
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "Процент", Процент);
		
		Если мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплате Тогда
			мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплатеЗаМесяц + мСтруктураДанных.ПроцентОтОплаты;
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьКассовыйСбор);
		
	КонецЕсли;
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьИтого);
	
	// Вывод произвольного сообщения.
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		Квитанция.Вывести(ОбластьЛиния);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
		Квитанция.Вывести(ОбластьЛиния);
	КонецЕсли; 
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Счет - извещение №2.
//
Функция ПечатьСчетИзвещение2() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого");
	ОбластьИтогоПени    = мМакет.ПолучитьОбласть("ИтогоПени");
	СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ШапкаПриборыУчета   = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	СчВывода = ?(мТаблицаПечатиСчетчиков.Количество() > 0,4,5);
	
	// Блок отрывной печати начало:
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		Квитанция.Вывести(ОбластьПолучатель);
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШтрихКод.Рисунки.очистить();
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьПлательщик);
		
		Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
			Квитанция.Вывести(ШапкаПриборыУчета);
		КонецЕсли; 
		
		Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
			
			Если СчВывода = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			Квитанция.Вывести(СтрокаПриборовУчета);
			
			СчВывода = СчВывода - 1;
			
		КонецЦикла; 
		
		Пока НЕ СчВывода = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПриборыУчета);
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
		ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
		Квитанция.Вывести(СтрокаПриборовУчета);
		
		СчВывода = СчВывода - 1;
		
	КонецЦикла;
	
	ШапкаЗаголовки.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаРасшифровки);
		
	КонецЦикла; 
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	
	Если мСтруктураДанных.ИтогПени > 0 Тогда
		
		ОбластьИтогоПени.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьИтогоПени);
		
	КонецЕсли;
	
	Квитанция.Вывести(ОбластьИтого);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Счет - извещение №3.
//
Функция ПечатьСчетИзвещение3() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого");
	ОбластьИтогоПени    = мМакет.ПолучитьОбласть("ИтогоПени");
	СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ШапкаПриборыУчета   = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	СчВывода = ?(мТаблицаПечатиСчетчиков.Количество() > 0,4,5);
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		Квитанция.Вывести(ОбластьПолучатель);
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШтрихКод.Рисунки.очистить();
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьПлательщик);
		
		Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
			Квитанция.Вывести(ШапкаПриборыУчета);
		КонецЕсли;
		
		Квитанция.Вывести(ШапкаПриборыУчета);
		
		Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
			
			Если СчВывода = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			Квитанция.Вывести(СтрокаПриборовУчета);
			
			СчВывода = СчВывода - 1;
			
		КонецЦикла; 
		
		Пока НЕ СчВывода = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПриборыУчета);
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаПриборовУчета);
		
		СчВывода = СчВывода - 1;
		
	КонецЦикла;
	
	ШапкаЗаголовки.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаРасшифровки);
		
	КонецЦикла; 
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	
	Если мСтруктураДанных.ИтогПени > 0 Тогда
		
		ОбластьИтогоПени.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьИтогоПени);
		
	КонецЕсли;
	
	Квитанция.Вывести(ОбластьИтого);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Счет - извещение №4 Счет - извещение №5.
//
Функция ПечатьСчетИзвещение4(УчетОплатыВСальдо = Ложь) Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого"); 
	СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ШапкаПриборыУчета   = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	СчВывода = ?(мТаблицаПечатиСчетчиков.Количество() > 0, 4, 5);
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		Квитанция.Вывести(ОбластьПолучатель);
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШтрихКод.Рисунки.очистить();
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьПлательщик);
		
		Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
			Квитанция.Вывести(ШапкаПриборыУчета);
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
			
			Если СчВывода = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			Квитанция.Вывести(СтрокаПриборовУчета);
			
			СчВывода = СчВывода - 1;
			
		КонецЦикла; 
		
		Пока НЕ СчВывода = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПриборыУчета);
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаПриборовУчета);
		
		СчВывода = СчВывода - 1;
		
	КонецЦикла;
	
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаРасшифровки);
		
	КонецЦикла; 
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьИтого);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Квитанция, ОбластьШтрихкодQR);
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Счет - извещение №4 с 8-мью счетчиками.
//
Функция ПечатьСчетИзвещение5() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого"); 
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	ШапкаПриборыУчетаЛево    = мМакет.ПолучитьОбласть("ШапкаПриборыУчетаЛево");
	СтрокаПриборовУчетаЛево  = мМакет.ПолучитьОбласть("СтрокаПриборовУчетаЛево");
	ШапкаПриборыУчетаПраво   = мМакет.ПолучитьОбласть("ШапкаПриборыУчетаПраво");
	СтрокаПриборовУчетаПраво = мМакет.ПолучитьОбласть("СтрокаПриборовУчетаПраво");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	КолВоСч = мТаблицаПечатиСчетчиков.Количество();
	СчВыводаЛево = ?(КолВоСч > 0, 4, 5);
	
	СчВыводаПраво = 0;
	
	Если КолВоСч > 4 Тогда
		СчВыводаПраво = Мин(КолВоСч - 4, 4);
	КонецЕсли;
	
	// Блок отрывной печати начало:.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		// Вывод информаци о получателе.
		Квитанция.Вывести(ОбластьПолучатель);
		
		// Формирование картинки штрихкода.
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0,0,СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШтрихКод.Рисунки.очистить();
		КонецЕсли;
		
		// Вывод информации о плательщике.
		Квитанция.Вывести(ОбластьПлательщик);
		
		// Вывод счетчиков в машинопечатный блок.
		
		Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда

			Квитанция.Вывести(ШапкаПриборыУчетаЛево);

		КонецЕсли;
		
		Если КолВоСч > 4 Тогда
			Квитанция.Присоединить(ШапкаПриборыУчетаПраво);
		КонецЕсли; 
		
		Для Значение = 1 По КолВоСч Цикл
			
			Если СчВыводаЛево = 0 И СчВыводаПраво = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если НЕ СчВыводаЛево = 0 Тогда
				
				СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение-1];
				
				СтрокаПриборовУчетаЛево.Параметры.Заполнить(СтрокаТаблицы);
				ЗаполнитьПараметр(СтрокаПриборовУчетаЛево, "Услуга", СтрокаТаблицы.СокрНаименование);
				Квитанция.Вывести(СтрокаПриборовУчетаЛево);
				
				СчВыводаЛево = СчВыводаЛево - 1;
				
			КонецЕсли;
			
			Если НЕ СчВыводаПраво = 0 Тогда
				
				СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение+4-1];
				
				СтрокаПриборовУчетаПраво.Параметры.Заполнить(СтрокаТаблицы);
				ЗаполнитьПараметр(СтрокаПриборовУчетаПраво, "Услуга", СтрокаТаблицы.СокрНаименование);
				Квитанция.Присоединить(СтрокаПриборовУчетаПраво);
				
				СчВыводаПраво = СчВыводаПраво - 1;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		Пока НЕ СчВыводаЛево = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВыводаЛево = СчВыводаЛево - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	// Вывод счетчиков в отрывной блок.
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПриборыУчетаЛево);
	КонецЕсли;
	
	СчВыводаЛево  = КолВоСч;
	СчВыводаПраво = 0;
	Половина      = 0;
	
	Если КолВоСч > 4 Тогда
		
		Квитанция.Присоединить(ШапкаПриборыУчетаПраво);
		
		Половина = Окр(КолВоСч/2,0, РежимОкругления.Окр15как20);
		СчВыводаЛево  = Макс(4,Половина);
		СчВыводаПраво = КолВоСч - СчВыводаЛево;
		Половина      = СчВыводаЛево;
		
	КонецЕсли; 
	
	Для Значение = 1 По КолВоСч Цикл
		
		Если СчВыводаЛево = 0 И СчВыводаПраво = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ СчВыводаЛево = 0 Тогда
			
			СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение-1];
			
			СтрокаПриборовУчетаЛево.Параметры.Заполнить(СтрокаТаблицы);
			Квитанция.Вывести(СтрокаПриборовУчетаЛево);
			
			СчВыводаЛево = СчВыводаЛево - 1;
			
		КонецЕсли;
		
		Если НЕ СчВыводаПраво = 0 Тогда
			
			СтрокаТаблицы = мТаблицаПечатиСчетчиков[Значение+Половина-1];
			
			СтрокаПриборовУчетаПраво.Параметры.Заполнить(СтрокаТаблицы);
			Квитанция.Присоединить(СтрокаПриборовУчетаПраво);
			
			СчВыводаПраво = СчВыводаПраво - 1;
			
		КонецЕсли;
		
	КонецЦикла;
	// Вывод таблицы с данными о начислениях.
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаРасшифровки);
		
	КонецЦикла; 
	
	// Вывод итоговой информации.
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьИтого);
	
	// Вывод произвольного сообщения.
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		Квитанция.Вывести(ОбластьЛиния);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
		Квитанция.Вывести(ОбластьЛиния);
	КонецЕсли; 
	
	Возврат Квитанция;
	
КонецФункции

// Печать макет Квитанции #1 Квитанции #1 чек слева.
//
Функция ПечатьКвитанция()
	
	Квитанция = Новый ТабличныйДокумент;

	ОбластьКассовыйСбор    = мМакет.ПолучитьОбласть("КассовыйСбор");
	ОбластьШапка           = мМакет.ПолучитьОбласть("Шапка");
	ОбластьШапка2          = мМакет.ПолучитьОбласть("Шапка2");
	Попытка
		ОбластьСтрокаГр = мМакет.ПолучитьОбласть("СтрокаГр");
	Исключение
		ОбластьСтрокаГр = Неопределено;
	КонецПопытки;
	ОбластьСтрока          = мМакет.ПолучитьОбласть("Строка");
	ОбластьВсего           = мМакет.ПолучитьОбласть("Всего");
	ОбластьПодвал          = мМакет.ПолучитьОбласть("Подвал");
	ОбластьПодвал2         = мМакет.ПолучитьОбласть("Подвал2");
	ПустаяСтрока           = мМакет.ПолучитьОбласть("ПустаяСтрока");
	СтрокаПРиборы          = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ОбластьСтрокаОбращение = мМакет.ПолучитьОбласть("СтрокаОбращение");
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		мСтруктураДанных.КОплате = мСтруктураДанных.КОплате + мСтруктураДанных.ПроцентОтОплаты;
	КонецЕсли;
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШапка.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
		Иначе
			ОбластьШапка.Рисунки.очистить();
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ЗаполнитьПараметр(ОбластьШапка, "ПолучательПредставление", мСтруктураДанных.ПолучательПредставление);
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизации", мСтруктураДанных.ПолучательАдрес);
		ЗаполнитьПараметр(ОбластьШапка, "ИННОрганизации", мСтруктураДанных.ПолучательИНН);
		
		Квитанция.Вывести(ОбластьШапка);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьШапка2);
	
	Отбор = Новый Структура;
	
	Если НЕ ОбластьСтрокаГр = Неопределено
		И (ГруппироватьУслуги ИЛИ мСтруктураДанных.ГруппироватьУслуги) Тогда
		
		Запрос = ПолучитьзапросГруппировки(мТаблицаПечати);
		ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
		Пока ВыборкаГруп.Следующий() Цикл
			
			ОбластьСтрокаГр.Параметры.Заполнить(ВыборкаГруп);
			ОбластьСтрокаГр.Параметры.УслугаПредставление = ВРег(ВыборкаГруп.ГруппаУслугиПредставление);
			
			Выборка = ВыборкаГруп.Выбрать();
			
			Если Выборка.Количество() = 1 Тогда // Едсинственная услуга в группировки
				
				Выборка.Следующий();
				
				ОбластьСтрокаГр.Параметры.Заполнить(Выборка);
				ОбластьСтрокаГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
				
				Отбор.Очистить();
				Отбор.Вставить("Услуга"     , Выборка.Услуга);
				СтрокиСЧ = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
				
				Если СтрокиСЧ.Количество() = 1 Тогда
					ОбластьСтрокаГр.Параметры.Заполнить(СтрокиСЧ[0]);
					Если СтрокиСЧ[0].ОтПоказаний = СтрокиСЧ[0].ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
						ПоказанияОт = СтрокиСЧ[0].ДоПоказаний - ВыборкаГруп.Количество;
						Если ПоказанияОт < 0 Тогда
							ПоказанияОт = СтрокиСЧ[0].Счетчик.Разрядность - СтрокиСЧ[0].ДоПоказаний;
						КонецЕсли;
						ЗаполнитьПараметр(ОбластьСтрокаГр, "ОтПоказаний", ПоказанияОт);
					КонецЕсли; 
				КонецЕсли;
				
				ОбластьСтрокаГр.Параметры.Заполнить(Выборка);
				Квитанция.Вывести(ОбластьСтрокаГр);
				
				Для Значение=0 по ОбластьСтрокаГр.Параметры.Количество() - 1 Цикл
					ОбластьСтрокаГр.Параметры.Установить(Значение, "");
				КонецЦикла;
				
				Если СтрокиСЧ.Количество() > 1 Тогда
					Для каждого СЧ Из СтрокиСЧ Цикл
						СтрокаПРиборы.Параметры.Заполнить(СЧ);
						Если СЧ.ОтПоказаний = СЧ.ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
							ПоказанияОт = СЧ.ДоПоказаний - ВыборкаГруп.Количество;
							Если ПоказанияОт < 0 Тогда
								ПоказанияОт = СЧ.Счетчик.Разрядность - СЧ.ДоПоказаний;
							КонецЕсли;
						КонецЕсли; 
						Квитанция.Вывести(СтрокаПРиборы);
					КонецЦикла;
				КонецЕсли;
				
				Для Значение=0 по СтрокаПРиборы.Параметры.Количество() - 1 Цикл
					СтрокаПРиборы.Параметры.Установить(Значение, "");
				КонецЦикла;
				
			ИначеЕсли Выборка.Количество() > 1 Тогда 
				
				Квитанция.Вывести(ОбластьСтрокаГр);
				
				Пока Выборка.Следующий() Цикл
					
					ОбластьСтрока.Параметры.Заполнить(Выборка);
					
					Отбор.Очистить();
					Отбор.Вставить("Услуга"     , Выборка.Услуга);
					СтрокиСЧ = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
					
					Если РасскрытьСоставГрупп Тогда
						
						Если СтрокиСЧ.Количество() = 1 Тогда
							ОбластьСтрока.Параметры.Заполнить(СтрокиСЧ[0]);
							Если СтрокиСЧ[0].ОтПоказаний = СтрокиСЧ[0].ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
								ПоказанияОт = СтрокиСЧ[0].ДоПоказаний - ВыборкаГруп.Количество;
								Если ПоказанияОт < 0 Тогда
									ПоказанияОт = СтрокиСЧ[0].Счетчик.Разрядность - СтрокиСЧ[0].ДоПоказаний;
								КонецЕсли;
								ЗаполнитьПараметр(ОбластьСтрока, "ОтПоказаний", ПоказанияОт);
							КонецЕсли; 
						КонецЕсли;
						
						ОбластьСтрока.Параметры.Заполнить(Выборка);
						Квитанция.Вывести(ОбластьСтрока);
						
						Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
							ОбластьСтрока.Параметры.Установить(Значение, "");
						КонецЦикла;
						
					КонецЕсли; // РасскрытьСоставГрупп.
					
					Если СтрокиСЧ.Количество() > 1 Тогда
						Для каждого СЧ Из СтрокиСЧ Цикл
							СтрокаПРиборы.Параметры.Заполнить(СЧ);
							Если СЧ.ОтПоказаний = СЧ.ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
								ПоказанияОт = СЧ.ДоПоказаний - ВыборкаГруп.Количество;
								Если ПоказанияОт < 0 Тогда
									ПоказанияОт = СЧ.Счетчик.Разрядность - СЧ.ДоПоказаний;
								КонецЕсли;
							КонецЕсли; 
							Квитанция.Вывести(СтрокаПРиборы);
						КонецЦикла;
					КонецЕсли;
					
					Для Значение=0 по СтрокаПРиборы.Параметры.Количество() - 1 Цикл
						СтрокаПРиборы.Параметры.Установить(Значение, "");
					КонецЦикла;
					
				КонецЦикла; 
				
			ИначеЕсли ВыборкаГруп.Услуга.Пустая() Тогда 
				
				Пока Выборка.Следующий() Цикл
					ОбластьСтрокаГр.Параметры.Заполнить(Выборка);
					ОбластьСтрокаГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
					Квитанция.Вывести(ОбластьСтрокаГр);
					
					Для Значение=0 по ОбластьСтрокаГр.Параметры.Количество() - 1 Цикл
						ОбластьСтрокаГр.Параметры.Установить(Значение, "");
					КонецЦикла;
					
				КонецЦикла; 
				
			КонецЕсли;			
			
		КонецЦикла;
		
	Иначе
		Для каждого Строка Из мТаблицаПечати Цикл
			
			Отбор.Очистить();
			Отбор.Вставить("Услуга"     , Строка.Услуга);
			СтрокиСЧ = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
			
			Если СтрокиСЧ.Количество() = 1 Тогда
				ОбластьСтрока.Параметры.Заполнить(СтрокиСЧ[0]);
				Если СтрокиСЧ[0].ОтПоказаний = СтрокиСЧ[0].ДоПоказаний и Строка.Количество <> 0 Тогда
					
					ПоказанияОт = СтрокиСЧ[0].ДоПоказаний - Строка.Количество;
					Если ПоказанияОт < 0 Тогда
						
						ПоказанияОт = СтрокиСЧ[0].Счетчик.Разрядность - СтрокиСЧ[0].ДоПоказаний;
						
					КонецЕсли;
					ЗаполнитьПараметр(ОбластьСтрока, "ОтПоказаний", ПоказанияОт);
				КонецЕсли; 
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(Строка);
			Квитанция.Вывести(ОбластьСтрока);
			
			Если СтрокиСЧ.Количество() > 1 Тогда
				Для каждого СЧ Из СтрокиСЧ Цикл
					
					СтрокаПРиборы.Параметры.Заполнить(СЧ);
					Если СЧ.ОтПоказаний = СЧ.ДоПоказаний и Строка.Количество <> 0 Тогда
						
						ПоказанияОт = СЧ.ДоПоказаний - Строка.Количество;
						Если ПоказанияОт < 0 Тогда
							
							ПоказанияОт = СЧ.Счетчик.Разрядность - СЧ.ДоПоказаний;
							
						КонецЕсли;
						ЗаполнитьПараметр(ОбластьСтрока, "ОтПоказаний", ПоказанияОт);
					КонецЕсли; 
					
					Квитанция.Вывести(СтрокаПРиборы);
					
				КонецЦикла;
			КонецЕсли;
			
			Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
				
				ОбластьСтрока.Параметры.Установить(Значение, "");
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		
		// Вывод информации о кассовом сборе.
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "ПроцентОтОплаты", мСтруктураДанных.ПроцентОтОплаты);
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "Процент"        , Процент);
		
		Квитанция.Вывести(ОбластьКассовыйСбор);
		
	КонецЕсли;
	
	ОбластьВсего.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьВсего);
	
	КолПустСтрок = 12;
	
	Если КолПустСтрок > мТаблицаПечати.Количество() Тогда
		
		КолПустСтрок = КолПустСтрок - мТаблицаПечати.Количество();
		Пока КолПустСтрок <> 0 Цикл
			
			Квитанция.Вывести(ПустаяСтрока);
			КолПустСтрок = КолПустСтрок - 1;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьПодвал);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли;
	
	Квитанция.Вывести(ОбластьПодвал2);		
	
	Возврат Квитанция;
	
КонецФункции

Функция ПечатьКвитанцияСПБ()
	
	Квитанция = Новый ТабличныйДокумент;

	ОбластьКассовыйСбор    = мМакет.ПолучитьОбласть("КассовыйСбор");
	ОбластьШапка           = мМакет.ПолучитьОбласть("Шапка");
	ОбластьШапка2          = мМакет.ПолучитьОбласть("Шапка2");
	Попытка
		ОбластьСтрокаГр = мМакет.ПолучитьОбласть("СтрокаГр");
	Исключение
		ОбластьСтрокаГр = Неопределено;
	КонецПопытки;
	ОбластьСтрока          = мМакет.ПолучитьОбласть("Строка");
	ОбластьВсего           = мМакет.ПолучитьОбласть("Всего");
	ОбластьПодвал          = мМакет.ПолучитьОбласть("Подвал");
	ОбластьПодвал2         = мМакет.ПолучитьОбласть("Подвал2");
	ПустаяСтрока           = мМакет.ПолучитьОбласть("ПустаяСтрока");
	СтрокаПРиборы          = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ОбластьСтрокаОбращение = мМакет.ПолучитьОбласть("СтрокаОбращение");
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		мСтруктураДанных.КОплате = мСтруктураДанных.КОплате + мСтруктураДанных.ПроцентОтОплаты;
	КонецЕсли;
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
		
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШапка.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
		Иначе
			//ОбластьШапка.Рисунки.очистить();
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ЗаполнитьПараметр(ОбластьШапка, "ПолучательПредставление", мСтруктураДанных.ПолучательПредставление);
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизации", мСтруктураДанных.ПолучательАдрес);
		ЗаполнитьПараметр(ОбластьШапка, "ИННОрганизации", мСтруктураДанных.ПолучательИНН);
		
		Квитанция.Вывести(ОбластьШапка);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьШапка2);
	
	Отбор = Новый Структура;
	
	Если НЕ ОбластьСтрокаГр = Неопределено
		И (ГруппироватьУслуги ИЛИ мСтруктураДанных.ГруппироватьУслуги) Тогда
		
		Запрос = ПолучитьзапросГруппировки(мТаблицаПечати);
		ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
		Пока ВыборкаГруп.Следующий() Цикл
			
			ОбластьСтрокаГр.Параметры.Заполнить(ВыборкаГруп);
			ОбластьСтрокаГр.Параметры.УслугаПредставление = ВРег(ВыборкаГруп.ГруппаУслугиПредставление);
			
			Выборка = ВыборкаГруп.Выбрать();
			
			Если Выборка.Количество() = 1 Тогда // Едсинственная услуга в группировки
				
				Выборка.Следующий();
				
				ОбластьСтрокаГр.Параметры.Заполнить(Выборка);
				ОбластьСтрокаГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
				
				Отбор.Очистить();
				Отбор.Вставить("Услуга"     , Выборка.Услуга);
				СтрокиСЧ = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
				
				Если СтрокиСЧ.Количество() = 1 Тогда
					ОбластьСтрокаГр.Параметры.Заполнить(СтрокиСЧ[0]);
					Если СтрокиСЧ[0].ОтПоказаний = СтрокиСЧ[0].ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
						ПоказанияОт = СтрокиСЧ[0].ДоПоказаний - ВыборкаГруп.Количество;
						Если ПоказанияОт < 0 Тогда
							ПоказанияОт = СтрокиСЧ[0].Счетчик.Разрядность - СтрокиСЧ[0].ДоПоказаний;
						КонецЕсли;
						ЗаполнитьПараметр(ОбластьСтрокаГр, "ОтПоказаний", ПоказанияОт);
					КонецЕсли; 
				КонецЕсли;
				
				ОбластьСтрокаГр.Параметры.Заполнить(Выборка);
				Квитанция.Вывести(ОбластьСтрокаГр);
				
				Для Значение=0 по ОбластьСтрокаГр.Параметры.Количество() - 1 Цикл
					ОбластьСтрокаГр.Параметры.Установить(Значение, "");
				КонецЦикла;
				
				Если СтрокиСЧ.Количество() > 1 Тогда
					Для каждого СЧ Из СтрокиСЧ Цикл
						СтрокаПРиборы.Параметры.Заполнить(СЧ);
						Если СЧ.ОтПоказаний = СЧ.ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
							ПоказанияОт = СЧ.ДоПоказаний - ВыборкаГруп.Количество;
							Если ПоказанияОт < 0 Тогда
								ПоказанияОт = СЧ.Счетчик.Разрядность - СЧ.ДоПоказаний;
							КонецЕсли;
						КонецЕсли; 
						Квитанция.Вывести(СтрокаПРиборы);
					КонецЦикла;
				КонецЕсли;
				
				Для Значение=0 по СтрокаПРиборы.Параметры.Количество() - 1 Цикл
					СтрокаПРиборы.Параметры.Установить(Значение, "");
				КонецЦикла;
				
			ИначеЕсли Выборка.Количество() > 1 Тогда 
				
				Квитанция.Вывести(ОбластьСтрокаГр);
				
				Пока Выборка.Следующий() Цикл
					
					ОбластьСтрока.Параметры.Заполнить(Выборка);
					
					Отбор.Очистить();
					Отбор.Вставить("Услуга"     , Выборка.Услуга);
					СтрокиСЧ = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
					
					Если РасскрытьСоставГрупп Тогда
						
						Если СтрокиСЧ.Количество() = 1 Тогда
							ОбластьСтрока.Параметры.Заполнить(СтрокиСЧ[0]);
							Если СтрокиСЧ[0].ОтПоказаний = СтрокиСЧ[0].ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
								ПоказанияОт = СтрокиСЧ[0].ДоПоказаний - ВыборкаГруп.Количество;
								Если ПоказанияОт < 0 Тогда
									ПоказанияОт = СтрокиСЧ[0].Счетчик.Разрядность - СтрокиСЧ[0].ДоПоказаний;
								КонецЕсли;
								ЗаполнитьПараметр(ОбластьСтрока, "ОтПоказаний", ПоказанияОт);
							КонецЕсли; 
						КонецЕсли;
						
						ОбластьСтрока.Параметры.Заполнить(Выборка);
						Квитанция.Вывести(ОбластьСтрока);
						
						Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
							ОбластьСтрока.Параметры.Установить(Значение, "");
						КонецЦикла;
						
					КонецЕсли; // РасскрытьСоставГрупп.
					
					Если СтрокиСЧ.Количество() > 1 Тогда
						Для каждого СЧ Из СтрокиСЧ Цикл
							СтрокаПРиборы.Параметры.Заполнить(СЧ);
							Если СЧ.ОтПоказаний = СЧ.ДоПоказаний и ВыборкаГруп.Количество <> 0 Тогда
								ПоказанияОт = СЧ.ДоПоказаний - ВыборкаГруп.Количество;
								Если ПоказанияОт < 0 Тогда
									ПоказанияОт = СЧ.Счетчик.Разрядность - СЧ.ДоПоказаний;
								КонецЕсли;
							КонецЕсли; 
							Квитанция.Вывести(СтрокаПРиборы);
						КонецЦикла;
					КонецЕсли;
					
					Для Значение=0 по СтрокаПРиборы.Параметры.Количество() - 1 Цикл
						СтрокаПРиборы.Параметры.Установить(Значение, "");
					КонецЦикла;
					
				КонецЦикла; 
				
			ИначеЕсли ВыборкаГруп.Услуга.Пустая() Тогда 
				
				Пока Выборка.Следующий() Цикл
					ОбластьСтрокаГр.Параметры.Заполнить(Выборка);
					ОбластьСтрокаГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
					Квитанция.Вывести(ОбластьСтрокаГр);
					
					Для Значение=0 по ОбластьСтрокаГр.Параметры.Количество() - 1 Цикл
						ОбластьСтрокаГр.Параметры.Установить(Значение, "");
					КонецЦикла;
					
				КонецЦикла; 
				
			КонецЕсли;			
			
		КонецЦикла;
		
	Иначе
		Для каждого Строка Из мТаблицаПечати Цикл
			
			Отбор.Очистить();
			Отбор.Вставить("Услуга"     , Строка.Услуга);
			СтрокиСЧ = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
			
			Если СтрокиСЧ.Количество() = 1 Тогда
				ОбластьСтрока.Параметры.Заполнить(СтрокиСЧ[0]);
				Если СтрокиСЧ[0].ОтПоказаний = СтрокиСЧ[0].ДоПоказаний и Строка.Количество <> 0 Тогда
					
					ПоказанияОт = СтрокиСЧ[0].ДоПоказаний - Строка.Количество;
					Если ПоказанияОт < 0 Тогда
						
						ПоказанияОт = СтрокиСЧ[0].Счетчик.Разрядность - СтрокиСЧ[0].ДоПоказаний;
						
					КонецЕсли;
					ЗаполнитьПараметр(ОбластьСтрока, "ОтПоказаний", ПоказанияОт);
				КонецЕсли; 
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(Строка);
			Квитанция.Вывести(ОбластьСтрока);
			
			Если СтрокиСЧ.Количество() > 1 Тогда
				Для каждого СЧ Из СтрокиСЧ Цикл
					
					СтрокаПРиборы.Параметры.Заполнить(СЧ);
					Если СЧ.ОтПоказаний = СЧ.ДоПоказаний и Строка.Количество <> 0 Тогда
						
						ПоказанияОт = СЧ.ДоПоказаний - Строка.Количество;
						Если ПоказанияОт < 0 Тогда
							
							ПоказанияОт = СЧ.Счетчик.Разрядность - СЧ.ДоПоказаний;
							
						КонецЕсли;
						ЗаполнитьПараметр(ОбластьСтрока, "ОтПоказаний", ПоказанияОт);
					КонецЕсли; 
					
					Квитанция.Вывести(СтрокаПРиборы);
					
				КонецЦикла;
			КонецЕсли;
			
			Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
				
				ОбластьСтрока.Параметры.Установить(Значение, "");
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		
		// Вывод информации о кассовом сборе.
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "ПроцентОтОплаты", мСтруктураДанных.ПроцентОтОплаты);
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "Процент"        , Процент);
		
		Квитанция.Вывести(ОбластьКассовыйСбор);
		
	КонецЕсли;
	
	ОбластьВсего.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьВсего);
	
	КолПустСтрок = 12;
	
	Если КолПустСтрок > мТаблицаПечати.Количество() Тогда
		
		КолПустСтрок = КолПустСтрок - мТаблицаПечати.Количество();
		Пока КолПустСтрок <> 0 Цикл
			
			Квитанция.Вывести(ПустаяСтрока);
			КолПустСтрок = КолПустСтрок - 1;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьПодвал);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли;
	
	Квитанция.Вывести(ОбластьПодвал2);	
	
	
	Если ИспользоватьQR = Истина Тогда
		
		//Попытка	
		//	ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		//Исключение
		//КонецПопытки;
		
		НапечататьQRКод(Квитанция);
	Иначе
	    УбратьQRКод(Квитанция)
	КонецЕсли;

	Возврат Квитанция;
	
КонецФункции

// Печать макет Квитанции #2.
//
Функция ПечатьКвитанция2()
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьШапка       = мМакет.ПолучитьОбласть("Шапка");
	ОбластьШапка2      = мМакет.ПолучитьОбласть("Шапка2");
	ОбластьСтрока      = мМакет.ПолучитьОбласть("Строка|Часть1");
	ДопСтрока          = мМакет.ПолучитьОбласть("Строка|Часть2");
	ОбластьВсего       = мМакет.ПолучитьОбласть("Всего");
	ОбластьПодвал      = мМакет.ПолучитьОбласть("Подвал");
	ПустаяСтрока       = мМакет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьСтрокаОбращение = мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния           = мМакет.ПолучитьОбласть("Линия");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	// Блок отрывной печати начало:.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШапка.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
		Иначе
			ОбластьШапка.Рисунки.очистить();
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизации", мСтруктураДанных.ПолучательАдрес);
		ЗаполнитьПараметр(ОбластьШапка, "ИННОрганизации", мСтруктураДанных.ПолучательИНН);
		ЗаполнитьПараметр(ОбластьШапка, "Месяц", мСтруктураДанных.ПериодМесяц);
		ЗаполнитьПараметр(ОбластьШапка, "Год", мСтруктураДанных.ПериодГод);
		ЗаполнитьПараметр(ОбластьШапка, "ДатаПоследнейОплаты", ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты),Формат(мСтруктураДанных.ДатаПоследнейОплаты,"ДФ=dd.MM.yyyy"),""));
		
		Квитанция.Вывести(ОбластьШапка);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
	ЗаполнитьПараметр(ОбластьШапка2, "Месяц", мСтруктураДанных.ПериодМесяц);
	ЗаполнитьПараметр(ОбластьШапка2, "Год"	, мСтруктураДанных.ПериодГод);
	Квитанция.Вывести(ОбластьШапка2);
	
	ИндексСтроки   = 0;
	КолПустыхСтрок = 12;
	Вывести        = Истина;
	
	Для каждого Строка Из мТаблицаПечати Цикл
		
		ИндексСтроки = ИндексСтроки + 1;
		
		Если ИндексСтроки <> 23 Тогда
			
			Если Вывести Тогда
				
				ОбластьСтрока.Параметры.Заполнить(Строка);
				Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") Тогда
					ЗаполнитьПараметр(ОбластьСтрока, "Количество", Null);
				КонецЕсли;
				Квитанция.Вывести(ОбластьСтрока);
				
			Иначе 
				
				ДопСтрока.Параметры.Заполнить(Строка);
				Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") Тогда
					ЗаполнитьПараметр(ДопСтрока, "Количество", Null);
				КонецЕсли;
				Квитанция.Присоединить(ДопСтрока);
				
			КонецЕсли;
			
			Вывести = ?(Вывести, ложь,Истина);
			
		КонецЕсли;
		
	КонецЦикла;   
	
	Если Вывести Тогда
		
		ИндексСтроки = ИндексСтроки + 2;
		
		Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
			
			ОбластьСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;
		Квитанция.Вывести(ОбластьСтрока);
		
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			ДопСтрока.Параметры.Установить(Значение, "");
		КонецЦикла;  
		
		ЗаполнитьПараметр(ДопСтрока, "УслугаПредставление", "ИТОГО");
		ЗаполнитьПараметр(ДопСтрока, "Начислено", мТаблицаПечати.итог("Начислено"));
		ЗаполнитьПараметр(ДопСтрока, "КОплатеЗаМесяц", мТаблицаПечати.итог("КОплатеЗаМесяц"));
		
		Квитанция.Присоединить(ДопСтрока);
		
	Иначе
		
		ИндексСтроки = ИндексСтроки + 1;
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			ДопСтрока.Параметры.Установить(Значение, "");
		КонецЦикла;
		
		ЗаполнитьПараметр(ДопСтрока, "УслугаПредставление", "ИТОГО");
		ЗаполнитьПараметр(ДопСтрока, "Начислено", мТаблицаПечати.итог("Начислено"));
		ЗаполнитьПараметр(ДопСтрока, "КОплатеЗаМесяц", мТаблицаПечати.итог("КОплатеЗаМесяц"));
		
		Квитанция.Присоединить(ДопСтрока);
		
	КонецЕсли; 
	
	КолПустыхСтрок = КолПустыхСтрок - (ИндексСтроки/2);
	
	Пока КолПустыхСтрок > 0 Цикл
		КолПустыхСтрок = КолПустыхСтрок - 1;
		Квитанция.Присоединить(ПустаяСтрока);
	КонецЦикла;
	
	НомерСчетчика  = 0;
	КолвоСчетчиков = 6;
	
	Для каждого СтрокаСЧ Из мТаблицаПечатиСчетчиков Цикл
		
		Если КолвоСчетчиков = НомерСчетчика Тогда
			Прервать;
		КонецЕсли; 
		
		НомерСчетчика    =  НомерСчетчика + 1;
		
		НазваниеСчетчика = "НазваниеСчетчика" + НомерСчетчика;
		ЕдИзмСч          = "ЕдИзмСч"          + НомерСчетчика;
		ДоПоказаний      = "ДоПоказаний"      + НомерСчетчика;
		
		Если СтрокаСЧ.Многотарифный Тогда
			Если НомерСчетчика > 4 Тогда
				ЗаполнитьПараметр(ОбластьВсего, НазваниеСчетчика, Лев(Строка(СтрокаСЧ.Счетчик) +" "+ Строка(СтрокаСЧ.СокрНаименование), 15));
			Иначе
				ЗаполнитьПараметр(ОбластьВсего, НазваниеСчетчика, Лев(Строка(СтрокаСЧ.Счетчик) +" "+ Строка(СтрокаСЧ.СокрНаименование), 22));
			КонецЕсли; 
		Иначе
			ЗаполнитьПараметр(ОбластьВсего, НазваниеСчетчика, СтрокаСЧ.Счетчик);
		КонецЕсли; 
		
		СтрокаУслуга = мТаблицаПечати.Найти(СтрокаСЧ.Услуга, "Услуга");
		Если НЕ СтрокаУслуга = Неопределено Тогда
			ЗаполнитьПараметр(ОбластьВсего, ЕдИзмСч, СтрокаУслуга.ЕдИзм);
		КонецЕсли; 
		
		ЗаполнитьПараметр(ОбластьВсего, ДоПоказаний, СтрокаСЧ.ДоПоказаний);
		
	КонецЦикла; 
	
	ЗаполнитьПараметр(ОбластьВсего, "ИтогоКОплатеСУчетомПени", "ИТОГО: " + мСтруктураДанных.ИтогоКОплатеСУчетомПени +" "+
	?(мСтруктураДанных.ИтогПени<> 0,"в т. ч. Пени: " + мСтруктураДанных.ИтогПени,""));

	Квитанция.Вывести(ОбластьВсего);
	
	ЗаполнитьПараметр(ОбластьПодвал, "СтрЗадолженность", "Задолженность на " + мСтруктураДанных.Период + " : " + мСтруктураДанных.Долг);
	ЗаполнитьПараметр(ОбластьПодвал, "СтрОплата", "Оплачено после "+ мСтруктураДанных.Период + " : " + мСтруктураДанных.Оплата);
	
	Текст = "Вид собственности: " + мСтруктураДанных.СтатусКвартиры+ " К-во комнат: " + мСтруктураДанных.КоличествоКомнат
	+ " Площадь общ.: " + мСтруктураДанных.ОписаниеОбщейПлощади + " жилая: " 
	+ мСтруктураДанных.ОписаниеЖилойПлощади + " К-во проживающих:" + мСтруктураДанных.КоличествоПроживающих + "; льготников: " 
	+ мСтруктураДанных.КолЛьготников + " "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты), "Дата последней оплаты: "+мСтруктураДанных.ДатаПоследнейОплаты, "") 
	+"  Дата создания: "+ Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
	ЗаполнитьПараметр(ОбластьПодвал, "СтрИнфо", Текст);
	
	Квитанция.Вывести(ОбластьПодвал);
	
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макет Квитанция №3 и Квитанция №3 с учетов пени.
//
Функция ПечатьКвитанция3(УчетПени = Ложь)
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьШапка       = мМакет.ПолучитьОбласть("Шапка");
	ОбластьШапка2      = мМакет.ПолучитьОбласть("Шапка2");
	ОбластьСтрока      = мМакет.ПолучитьОбласть("Строка|Часть1");
	ДопСтрока          = мМакет.ПолучитьОбласть("Строка|Часть2");
	ОбластьВсего       = мМакет.ПолучитьОбласть("Всего");
	ОбластьПодвал      = мМакет.ПолучитьОбласть("Подвал");
	ПустаяСтрока       = мМакет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния 			= мМакет.ПолучитьОбласть("Линия");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШапка.Рисунки.Шк;
			
			СуммаШК = ?(СуммаШтрихКода < 0, 0, СуммаШтрихКода);
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(СуммаШК,
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
		Иначе
			ОбластьШапка.Рисунки.очистить();
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизации", мСтруктураДанных.ПолучательАдрес);
		ЗаполнитьПараметр(ОбластьШапка, "ИННОрганизации", мСтруктураДанных.ПолучательИНН);
		ЗаполнитьПараметр(ОбластьШапка, "Месяц", мСтруктураДанных.ПериодМесяц);
		ЗаполнитьПараметр(ОбластьШапка, "Год", мСтруктураДанных.ПериодГод);
		ЗаполнитьПараметр(ОбластьШапка, "ДатаПоследнейОплаты", ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты),Формат(мСтруктураДанных.ДатаПоследнейОплаты,"ДФ=dd.MM.yyyy"),""));
		ЗаполнитьПараметр(ОбластьШапка, "ДатаПечатиКвитанций", ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПечатиКвитанций),Формат(мСтруктураДанных.ДатаПечатиКвитанций,"ДФ=dd.MM.yyyy"),""));
		
		Квитанция.Вывести(ОбластьШапка);
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
	ЗаполнитьПараметр(ОбластьШапка2, "Месяц", мСтруктураДанных.ПериодМесяц);
	ЗаполнитьПараметр(ОбластьШапка2, "Год", мСтруктураДанных.ПериодГод);
	Квитанция.Вывести(ОбластьШапка2);
	
	ИндексСтроки = 0;
	КолПустыхСтрок = 12;
	Вывести = Истина;
	
	Для каждого Строка Из мТаблицаПечати Цикл
		
		ИндексСтроки = ИндексСтроки + 1;
		
		Если ИндексСтроки <> 23 Тогда
			
			Если Вывести Тогда
				
				ОбластьСтрока.Параметры.Заполнить(Строка);
				Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг")ИЛИ Строка.Количество = 0  Тогда
					ЗаполнитьПараметр(ОбластьСтрока, "Количество", Null);
				КонецЕсли;
				
				// БИТ ЖКХ 20.10.2020
				Если НеПечататьУслугиБезНачислений
					И Строка.Начислено = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Квитанция.Вывести(ОбластьСтрока);
				
			Иначе 
				
				ДопСтрока.Параметры.Заполнить(Строка);
				Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг")ИЛИ Строка.Количество = 0 Тогда
					ЗаполнитьПараметр(ДопСтрока, "Количество", Null);
				КонецЕсли;
				Квитанция.Присоединить(ДопСтрока);
				
			КонецЕсли;
			
			Вывести = ?(Вывести, ложь,Истина);
			
		КонецЕсли;
		
	КонецЦикла;   
	
	Если Вывести Тогда
		
		ИндексСтроки = ИндексСтроки + 2;
		
		Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
			
			ОбластьСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;
		Квитанция.Вывести(ОбластьСтрока);
		
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			ДопСтрока.Параметры.Установить(Значение, "");
		КонецЦикла;  
		
		ЗаполнитьПараметр(ДопСтрока, "УслугаПредставление", "ИТОГО");
		ЗаполнитьПараметр(ДопСтрока, "Начислено", мСтруктураДанных.Начислено);
		ЗаполнитьПараметр(ДопСтрока, "КОплатеЗаМесяц", мСтруктураДанных.КОплатеЗаМесяц);
		ЗаполнитьПараметр(ДопСтрока, "Разовые", мСтруктураДанных.Разовые);
		ЗаполнитьПараметр(ДопСтрока, "Льгота", мСтруктураДанных.Льгота);
		
		Квитанция.Присоединить(ДопСтрока);
		
	Иначе
		
		ИндексСтроки = ИндексСтроки + 1;
		
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			ДопСтрока.Параметры.Установить(Значение, "");
		КонецЦикла;  
		
		ЗаполнитьПараметр(ДопСтрока, "УслугаПредставление", "ИТОГО");
		ЗаполнитьПараметр(ДопСтрока, "Начислено", мСтруктураДанных.Начислено);
		ЗаполнитьПараметр(ДопСтрока, "КОплатеЗаМесяц", мСтруктураДанных.КОплатеЗаМесяц);
		ЗаполнитьПараметр(ДопСтрока, "Разовые", мСтруктураДанных.Разовые);
		ЗаполнитьПараметр(ДопСтрока, "Льгота", мСтруктураДанных.Льгота);
		
		Квитанция.Присоединить(ДопСтрока);
		
	КонецЕсли; 
	
	КолПустыхСтрок = КолПустыхСтрок - (ИндексСтроки/2);
	
	Пока КолПустыхСтрок > 0 Цикл
		КолПустыхСтрок = КолПустыхСтрок - 1;
		Квитанция.Присоединить(ПустаяСтрока);
	КонецЦикла;
	
	НомерСчетчика  = 0;
	КолвоСчетчиков = 6;
	
	Для каждого СтрокаСЧ Из мТаблицаПечатиСчетчиков Цикл
		
		Если КолвоСчетчиков = НомерСчетчика Тогда
			Прервать;
		КонецЕсли; 
		
		НомерСчетчика =  НомерСчетчика + 1;
		
		НазваниеСчетчика = "НазваниеСчетчика" +НомерСчетчика;
		ЕдИзмСч = "ЕдИзмСч" + НомерСчетчика;
		
		ДоПоказаний  = "ДоПоказаний" + НомерСчетчика;
		
		Если СтрокаСЧ.Многотарифный Тогда
			Если НомерСчетчика > 4 Тогда
				ЗаполнитьПараметр(ОбластьВсего, НазваниеСчетчика, Лев(Строка(СтрокаСЧ.Счетчик) +" "+ Строка(СтрокаСЧ.СокрНаименование), 15));
			Иначе
				ЗаполнитьПараметр(ОбластьВсего, НазваниеСчетчика, Лев(Строка(СтрокаСЧ.Счетчик) +" "+ Строка(СтрокаСЧ.СокрНаименование), 22));
			КонецЕсли; 
		Иначе
			ЗаполнитьПараметр(ОбластьВсего, НазваниеСчетчика, СтрокаСЧ.Счетчик);
		КонецЕсли; 
		
		СтрокаУслуга = мТаблицаПечати.Найти(СтрокаСЧ.Услуга, "Услуга");
		Если НЕ СтрокаУслуга = Неопределено Тогда
			ЗаполнитьПараметр(ОбластьВсего, ЕдИзмСч, СтрокаУслуга.ЕдИзм);
		КонецЕсли; 
		
		ЗаполнитьПараметр(ОбластьВсего, ДоПоказаний, СтрокаСЧ.ДоПоказаний);
		
	КонецЦикла; 
	
	Если УчетПени Тогда
		ЗаполнитьПараметр(ОбластьВсего, "КОплате", Строка(мСтруктураДанных.ИтогоКОплатеСУчетомПени)+ ", в т.ч. пени " + Строка(мСтруктураДанных.ИтогПени));
	Иначе
		ЗаполнитьПараметр(ОбластьВсего, "КОплате", мСтруктураДанных.КОплате);
	КонецЕсли; 
	
	Квитанция.Вывести(ОбластьВсего);
	
	Если УчетПени Тогда
		ЗаполнитьПараметр(ОбластьПодвал, "СтрЗадолженность", "Задолженность на "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаНачалоМесяца),Формат(мСтруктураДанных.ДатаНачалоМесяца,"ДФ=dd.MM.yyyy"),"") 
			+ " : " + мСтруктураДанных.Сальдо + ", пени: " + мСтруктураДанных.ИтогПени);
		
		ЗаполнитьПараметр(ОбластьПодвал, "СтрОплата", "Оплачено за период: с "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаНачалоМесяца),Формат(мСтруктураДанных.ДатаНачалоМесяца,"ДФ=dd.MM.yyyy"),"") 
			+ " по " + ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаОкончанияМесяца),Формат(мСтруктураДанных.ДатаОкончанияМесяца,"ДФ=dd.MM.yyyy"),"") + " : " + мСтруктураДанных.Оплата + ", в т.ч. пени: " + мСтруктураДанных.ОплатаПени);
		
	Иначе	
		ЗаполнитьПараметр(ОбластьПодвал, "СтрЗадолженность", "Задолженность на "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаНачалоМесяца),Формат(мСтруктураДанных.ДатаНачалоМесяца,"ДФ=dd.MM.yyyy"),"") 
			+ " : " + мСтруктураДанных.Сальдо);
		
		ЗаполнитьПараметр(ОбластьПодвал, "СтрОплата", "Оплачено за период: с "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаНачалоМесяца),Формат(мСтруктураДанных.ДатаНачалоМесяца,"ДФ=dd.MM.yyyy"),"") 
			+ " по " + ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаОкончанияМесяца),Формат(мСтруктураДанных.ДатаОкончанияМесяца,"ДФ=dd.MM.yyyy"),"") + " : " + мСтруктураДанных.Оплата);
		
	КонецЕсли;
	
	Текст = "Вид собственности: " + мСтруктураДанных.СтатусКвартиры+ " К-во комнат: " + мСтруктураДанных.КоличествоКомнат
	+ " Площадь общ.: " + мСтруктураДанных.ОписаниеОбщейПлощади + " жилая: " 
	+ мСтруктураДанных.ОписаниеЖилойПлощади + " К-во проживающих:" + мСтруктураДанных.КоличествоПроживающих + "; льготников: " 
	+ мСтруктураДанных.КолЛьготников + " "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты), "Дата последней оплаты: "+мСтруктураДанных.ДатаПоследнейОплаты, "") 
	+"  Дата создания: "+ Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
	ЗаполнитьПараметр(ОбластьПодвал, "СтрИнфо", Текст);
	ЗаполнитьПараметр(ОбластьПодвал, "ДатаПечатиКвитанций", ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПечатиКвитанций),Формат(мСтруктураДанных.ДатаПечатиКвитанций,"ДФ=dd.MM.yyyy"),""));
	
	Квитанция.Вывести(ОбластьПодвал);
	
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли;
	
	Если УчетПени Тогда
		
		Секция = мМакет.ПолучитьОбласть("ОбластьПени");
		ЗаполнитьПараметр(Секция, "КОплате", мСтруктураДанных.ИтогоКОплатеСУчетомПени);
		
		Квитанция.ВставитьОбласть(Секция.Область(), Квитанция.Область("R14C2:R14C8"),,Истина);
		
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макет Квитанция №4.
//
Функция ПечатьКвитанция4() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	Шапка                    = мМакет.ПолучитьОбласть("Шапка");
	ЛеваяЧасть               = мМакет.ПолучитьОбласть("ЛеваяЧасть");
	ЛеваяЧастьПустаяСтрока   = мМакет.ПолучитьОбласть("ЛеваяЧастьПустаяСтрока");
	
	ЛеваяЧастьПодвал         = мМакет.ПолучитьОбласть("ЛеваяЧастьПодвал");
	
	ОбластьШК                = мМакет.ПолучитьОбласть("ОбластьШК");
	
	ТаблицаСЧПустаяСтрока    = мМакет.ПолучитьОбласть("ТаблицаСЧПустаяСтрока");
	ТаблицаСЧСтрока          = мМакет.ПолучитьОбласть("ТаблицаСЧСтрока");
	ТаблицаСЧШапка           = мМакет.ПолучитьОбласть("ТаблицаСЧШапка");
	
	Середина                 = мМакет.ПолучитьОбласть("Середина");
	Середина2                = мМакет.ПолучитьОбласть("Середина2");
	
	ИнфШапка                 = мМакет.ПолучитьОбласть("ИнфШапка");
	
	ИнфОПлатежеПустаяСтрока  = мМакет.ПолучитьОбласть("ИнфОПлатежеПустаяСтрока");
	ИнфОПлатежеПодвал        = мМакет.ПолучитьОбласть("ИнфОПлатежеПодвал");
	
	ТаблицаУслугШапка        = мМакет.ПолучитьОбласть("ТаблицаУслугШапка");
	ТаблицаУслугСтрока       = мМакет.ПолучитьОбласть("ТаблицаУслугСтрока");
	Попытка
		ТаблицаГрУслугСтрока	= мМакет.ПолучитьОбласть("ТаблицаГрУслугСтрока");
	Исключение
		ТаблицаГрУслугСтрока	= Неопределено;
	КонецПопытки;
	
	ТаблицаУслугИтого        = мМакет.ПолучитьОбласть("ТаблицаУслугИтого");
	ТаблицаУслугПустаяСтрока = мМакет.ПолучитьОбласть("ТаблицаУслугПустаяСтрока");
	ТаблицаУслугПодвал       = мМакет.ПолучитьОбласть("ТаблицаУслугПодвал");
	
	Разделитель              = мМакет.ПолучитьОбласть("Разделитель");
	
	ОбращениеКГражданам      = мМакет.ПолучитьОбласть("Обращение");
	
	ОбластьКассовыйСбор      = мМакет.ПолучитьОбласть("КассовыйСбор");
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		мСтруктураДанных.КОплате = мСтруктураДанных.КОплате + мСтруктураДанных.ПроцентОтОплаты;
	КонецЕсли;
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате;
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	СтруктураСтрокаИнф = Новый Структура;
	
	Для Значение = 1 По 13 Цикл
		
		ИмяОбласти = "ИнфСтр" + Значение;
		СтруктураСтрокаИнф.Вставить(ИмяОбласти, мМакет.ПолучитьОбласть(ИмяОбласти));
		
	КонецЦикла; 
	
	ТаблицаСЧ          = Новый ТабличныйДокумент;
	ТаблицаНаПечать    = Новый ТабличныйДокумент;
	
	тмпТаблица = мТаблицаПечати.Скопировать();
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		// Разбить адрес.
		ЛицевойСчетАдрес_1 = "";
		ЛицевойСчетАдрес_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ЛицевойСчетАдрес, 30, ЛицевойСчетАдрес_1 , ЛицевойСчетАдрес_2 );
		
		мСтруктураДанных.Вставить("ЛицевойСчетАдрес_1", ЛицевойСчетАдрес_1);
		мСтруктураДанных.Вставить("ЛицевойСчетАдрес_2", ЛицевойСчетАдрес_2);
		
		// Разбить описание льготы.
		ОписаниеЛьгот_1 = "";
		ОписаниеЛьгот_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ОписаниеЛьгот, 30, ОписаниеЛьгот_1 , ОписаниеЛьгот_2 );
		
		мСтруктураДанных.Вставить("ОписаниеЛьгот_1", ОписаниеЛьгот_1);
		мСтруктураДанных.Вставить("ОписаниеЛьгот_2", ОписаниеЛьгот_2);
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Попытка
				Рисунок = ОбластьШК.Рисунки.Шк;
				
				ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0, 0, СуммаШтрихКода),
				мСтруктураДанных.ЛицевойСчетНомер,
				ШаблонИзвещений.Идентификатор,
				мСтруктураДанных.ЛицевойСчет.Идентификатор,
				мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
				мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
				
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
				ПараметрыШтрихкода.Вставить("ТипКода",         4);
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
				ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
				
				Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			Исключение
			КонецПопытки
		Иначе
			ОбластьШК.Рисунки.очистить();
		КонецЕсли;
		
		Шапка.Параметры.Заполнить(мСтруктураДанных);
		
		ТаблицаНаПечать.Вывести(Шапка);
		
		ТаблицаНаПечать.Вывести(ОбластьШК);
		
		ТаблицаСЧ.Вывести(ТаблицаСЧШапка);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаСчетчиков", мТаблицаПечатиСчетчиков);
		Запрос.УстановитьПараметр("ЛицевойСчет"     , мСтруктураДанных.ЛицевойСчет);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСчетчиков.Счетчик,
		|	ТаблицаСчетчиков.Услуга,
		|	ТаблицаСчетчиков.ОтПоказаний,
		|	ТаблицаСчетчиков.ДоПоказаний,
		|	ТаблицаСчетчиков.Многотарифный,
		|	ТаблицаСчетчиков.ДатаПоверки,
		|	ТаблицаСчетчиков.Приоритет,
		|	ТаблицаСчетчиков.СокрНаименование
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Счетчики.Счетчик,
		|	МАКСИМУМ(Счетчики.ОтПоказаний) КАК ОтПоказаний,
		|	МАКСИМУМ(Счетчики.ДоПоказаний) КАК ДоПоказаний,
		|	Счетчики.Многотарифный,
		|	МАКСИМУМ(Счетчики.ДатаПоверки),
		|	СУММА(0) КАК Приоритет,
		|	СУММА(0) КАК Услуга,
		|	СУММА(0) КАК СокрНаименование
		|ИЗ
		|	Счетчики КАК Счетчики
		|ГДЕ
		|	НЕ Счетчики.Многотарифный
		|
		|СГРУППИРОВАТЬ ПО
		|	Счетчики.Счетчик,
		|	Счетчики.Многотарифный
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Счетчики.Счетчик,
		|	Счетчики.ОтПоказаний,
		|	Счетчики.ДоПоказаний,
		|	Счетчики.Многотарифный,
		|	Счетчики.ДатаПоверки,
		|	Счетчики.Приоритет,
		|	Счетчики.Услуга,
		|	Счетчики.СокрНаименование
		|ИЗ
		|	Счетчики КАК Счетчики
		|ГДЕ
		|	Счетчики.Многотарифный
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СчетчикСЧ = 1;
		Пока Выборка.Следующий() Цикл
			
			Если СчетчикСЧ > 8 Тогда
				Прервать;
			КонецЕсли;
			
			ТаблицаСЧСтрока.Параметры.Заполнить(Выборка);
			Если Выборка.Многотарифный Тогда
				
				ЗаполнитьПараметр(ТаблицаСЧСтрока, "Счетчик", "" + Выборка.СокрНаименование);
				
			КонецЕсли;
			
			ТаблицаСЧ.Вывести(ТаблицаСЧСтрока);
			
			СчетчикСЧ = СчетчикСЧ + 1;
			
		КонецЦикла;
		
		ДобавитьПустыхСтрокСч = 9 - СчетчикСЧ;
		
		Если ДобавитьПустыхСтрокСч > 0 Тогда
			
			Для Значение = 1 По ДобавитьПустыхСтрокСч Цикл
				ТаблицаСЧ.Вывести(ТаблицаСЧПустаяСтрока);
			КонецЦикла;
			
		КонецЕсли;
		
		ТаблицаНаПечать.Присоединить(ТаблицаСЧ);
		Середина.Параметры.Заполнить(мСтруктураДанных);
		
		ЛеваяЧасть.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ЛеваяЧасть);
		Квитанция.Присоединить(ТаблицаНаПечать);
		
		Квитанция.Вывести(Середина);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	Середина2.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(Середина2);
	Квитанция.Вывести(ТаблицаУслугШапка);
	
	ИнфШапка.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Присоединить(ИнфШапка);
	
	КоличествоСтрокУс =  мТаблицаПечати.Количество();
	
	ОдинокийЛьготник = (мСтруктураДанных.КолЛьготников = 1 И мСтруктураДанных.КоличествоПроживающих = 1);
	
	СчетчикСтрокУс = 1;
	
	Если НеПечататьУслугиБезНачислений Тогда
		Индекс = тмпТаблица.Количество() - 1;
		
		Пока Индекс >=0 Цикл
			
			СтрокаТаблицы=тмпТаблица.Получить(Индекс);
			
			Если СтрокаТаблицы.Начислено = 0
				И СтрокаТаблицы.Разовые = 0
				И СтрокаТаблицы.Льгота = 0
				И (СтрокаТаблицы.Оплата = 0 ИЛИ НЕ ПечататьУслугиСОплатой) Тогда 
				
				тмпТаблица.удалить(СтрокаТаблицы);	
				
			КонецЕсли;
			Индекс = Индекс - 1;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если НЕ ТаблицаГрУслугСтрока = Неопределено
		И (ГруппироватьУслуги ИЛИ мСтруктураДанных.ГруппироватьУслуги) Тогда
		
		Запрос = ПолучитьзапросГруппировки(тмпТаблица);
		ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГруп.Следующий() Цикл
			
			ТаблицаГрУслугСтрока.Параметры.Заполнить(ВыборкаГруп);
			ТаблицаГрУслугСтрока.Параметры.УслугаПредставление = ВРег(ВыборкаГруп.ГруппаУслугиПредставление);
			ЗаполнитьПараметр(ТаблицаГрУслугСтрока, "Объем", "" + ВыборкаГруп.Объем + "" + ВыборкаГруп.ЕдИзм);
			ЗаполнитьПараметр(ТаблицаГрУслугСтрока, "Объем_точность3", "" + ВыборкаГруп.Объем_точность3 + "" + ВыборкаГруп.ЕдИзм);
			ЗаполнитьПараметр(ТаблицаГрУслугСтрока, "Объем_точность2", "" + ВыборкаГруп.Объем_точность2 + "" + ВыборкаГруп.ЕдИзм);
			
			Выборка = ВыборкаГруп.Выбрать();
			
			Если Выборка.Количество() = 1 Тогда // Едсинственная услуга в группировки.
				
				Выборка.Следующий();
				ТаблицаГрУслугСтрока.Параметры.Заполнить(Выборка);
				ТаблицаГрУслугСтрока.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
				ЗаполнитьПараметр(ТаблицаГрУслугСтрока, "Объем", "" + Выборка.Объем + "" + Выборка.ЕдИзм);
				ЗаполнитьПараметр(ТаблицаГрУслугСтрока, "Объем_точность3", "" + Выборка.Объем_точность3 + "" + Выборка.ЕдИзм);
				ЗаполнитьПараметр(ТаблицаГрУслугСтрока, "Объем_точность2", "" + Выборка.Объем_точность2 + "" + Выборка.ЕдИзм);
				
				Квитанция.Вывести(ТаблицаГрУслугСтрока);
				Если СчетчикСтрокУс < 13 Тогда
					СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
					Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
				Иначе
					Квитанция.Присоединить(ИнфОПлатежеПустаяСтрока);
				КонецЕсли;
				СчетчикСтрокУс = СчетчикСтрокУс + 1;
				
			ИначеЕсли Выборка.Количество() > 1 Тогда 
				
				Квитанция.Вывести(ТаблицаГрУслугСтрока);
				
				Пока Выборка.Следующий() И РасскрытьСоставГрупп Цикл
					
					ТаблицаУслугСтрока.Параметры.Заполнить(Выборка);
					ЗаполнитьПараметр(ТаблицаУслугСтрока, "Объем", "" + Выборка.Объем + "" + Выборка.ЕдИзм);
					ЗаполнитьПараметр(ТаблицаУслугСтрока, "Объем_точность3", "" + Выборка.Объем_точность3 + "" + Выборка.ЕдИзм);
					ЗаполнитьПараметр(ТаблицаУслугСтрока, "Объем_точность2", "" + Выборка.Объем_точность2 + "" + Выборка.ЕдИзм);
					
					Квитанция.Вывести(ТаблицаУслугСтрока);
					Если СчетчикСтрокУс < 13 Тогда
						СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
						Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
					Иначе
						Квитанция.Присоединить(ИнфОПлатежеПустаяСтрока);
					КонецЕсли;
					СчетчикСтрокУс = СчетчикСтрокУс + 1;
				КонецЦикла; 
				
			ИначеЕсли ВыборкаГруп.Услуга.Пустая() Тогда 
				
				Пока Выборка.Следующий() Цикл
					
					ТаблицаГрУслугСтрока.Параметры.Заполнить(Выборка);
					ТаблицаГрУслугСтрока.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
					
					Квитанция.Вывести(ТаблицаГрУслугСтрока);
					
					Если СчетчикСтрокУс < 13 Тогда
						СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
						Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
					Иначе
						Квитанция.Присоединить(ИнфОПлатежеПустаяСтрока);
					КонецЕсли;
					СчетчикСтрокУс = СчетчикСтрокУс + 1;
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе
		Для каждого СтрокаТаблицы Из тмпТаблица Цикл
			
			ТаблицаУслугСтрока.Параметры.Заполнить(СтрокаТаблицы);
			
			ЗаполнитьПараметр(ТаблицаУслугСтрока, "Объем", "" + СтрокаТаблицы.Объем + "" + СтрокаТаблицы.ЕдИзм);
			
			ЗаполнитьПараметр(ТаблицаУслугСтрока, "Объем_точность3", "" + СтрокаТаблицы.Объем_точность3 + "" + СтрокаТаблицы.ЕдИзм);
			ЗаполнитьПараметр(ТаблицаУслугСтрока, "Объем_точность2", "" + СтрокаТаблицы.Объем_точность2 + "" + СтрокаТаблицы.ЕдИзм);
			
			Квитанция.Вывести(ТаблицаУслугСтрока);
			
			Если СчетчикСтрокУс < 13 Тогда
				
				СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
				Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
				
			Иначе
				
				Квитанция.Присоединить(ИнфОПлатежеПустаяСтрока);
				
			КонецЕсли;
			
			СчетчикСтрокУс = СчетчикСтрокУс + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		
		Квитанция.Вывести(ЛеваяЧастьПустаяСтрока);
		
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "ПроцентОтОплаты", мСтруктураДанных.ПроцентОтОплаты);
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "Процент"        , Процент);
		
		Квитанция.Присоединить(ОбластьКассовыйСбор);
		
		Если КоличествоСтрокУс < 13 Тогда
			
			СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
			Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
			
			СчетчикСтрокУс = СчетчикСтрокУс + 1;
			
		Иначе
			
			Квитанция.Присоединить(ИнфОПлатежеПустаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СчетчикСтрокУс < 13 Тогда
		
		Квитанция.Вывести(ЛеваяЧастьПустаяСтрока);
		
		ТаблицаУслугИтого.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Присоединить(ТаблицаУслугИтого);
		
		СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
		
		СчетчикСтрокУс = СчетчикСтрокУс + 1;
		
		Для Значение = СчетчикСтрокУс По 13  Цикл
			
			Квитанция.Вывести(ЛеваяЧастьПустаяСтрока);
			Квитанция.Присоединить(ТаблицаУслугПустаяСтрока);
			
			СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
			Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
			
			СчетчикСтрокУс = СчетчикСтрокУс + 1;
			
		КонецЦикла;
		
		ЛеваяЧастьПодвал.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ЛеваяЧастьПодвал);
		Квитанция.Присоединить(ТаблицаУслугПодвал);
		Квитанция.Присоединить(ИнфОПлатежеПодвал);
		
	Иначе
		
		Если СчетчикСтрокУс = 13 Тогда
			
			Квитанция.Вывести(ЛеваяЧастьПустаяСтрока);
			
			ТаблицаУслугИтого.Параметры.Заполнить(мСтруктураДанных);
			Квитанция.Присоединить(ТаблицаУслугИтого);
			
			СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
			Квитанция.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
			
			ЛеваяЧастьПодвал.Параметры.Заполнить(мСтруктураДанных);
			Квитанция.Вывести(ЛеваяЧастьПодвал);
			Квитанция.Присоединить(ТаблицаУслугПодвал);
			Квитанция.Присоединить(ИнфОПлатежеПодвал);
			
		Иначе
			
			ЛеваяЧастьПодвал.Параметры.Заполнить(мСтруктураДанных);
			Квитанция.Вывести(ЛеваяЧастьПодвал);
			
			ТаблицаУслугИтого.Параметры.Заполнить(мСтруктураДанных);
			Квитанция.Присоединить(ТаблицаУслугИтого);
			
			Квитанция.Присоединить(ИнфОПлатежеПодвал);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли; 
	
	
	Квитанция.Вывести(Разделитель);
	
	Если ИспользоватьQR = Истина Тогда
		
		//Попытка	
		//	ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		//Исключение
		//КонецПопытки;
		
        НапечататьQRКод(Квитанция);
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Счет - извещение №6.
//
Функция ПечатьСчетИзвещение6() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого"); 
	СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ШапкаПриборыУчета   = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьКассовыйСбор     = мМакет.ПолучитьОбласть("КассовыйСбор");
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате + мСтруктураДанных.ПроцентОтОплаты;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	СчВывода = ?(мТаблицаПечатиСчетчиков.Количество() > 0, 4, 5);
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		Квитанция.Вывести(ОбластьПолучатель);
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШапка.Рисунки.очистить();
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьПлательщик);
		
		Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
			СчВывода = 4;
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
			
			Если СчВывода = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(ОбластьПлательщик, "Услуга", СтрокаТаблицы.СокрНаименование);
			Квитанция.Вывести(СтрокаПриборовУчета);
			
			СчВывода = СчВывода - 1;
			
		КонецЦикла; 
		
		Пока НЕ СчВывода = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПриборыУчета);
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
		ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
		Квитанция.Вывести(СтрокаПриборовУчета);
		
		СчВывода = СчВывода - 1;
		
	КонецЦикла;
	
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		Если НеПечататьУслугиБезНачислений(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		Квитанция.Вывести(СтрокаРасшифровки);
		
	КонецЦикла; 
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		
		// Вывод информации о кассовом сборе.
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "ПроцентОтОплаты", мСтруктураДанных.ПроцентОтОплаты);
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "Процент", Процент);
		
		Если мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплате Тогда
			мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплатеЗаМесяц + мСтруктураДанных.ПроцентОтОплаты;
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьКассовыйСбор);
		
	КонецЕсли;
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьИтого);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Возврат Квитанция;
	
КонецФункции

Функция ПечатьСчетИзвещениеРСК() Экспорт
	
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого"); 
	СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ШапкаПриборыУчета   = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	ЗаполнитьПараметр(ОбластьШапка, "Сальдо", мСтруктураДанных.Сальдо);
	ЗаполнитьПараметр(ОбластьШапка, "ИтогоКОплатеСУчетомПредоплаты", мСтруктураДанных.Сальдо + мСтруктураДанных.Начислено - мСтруктураДанных.Оплата);
	ЗаполнитьПараметр(ОбластьШапка, "ИтогоКОплатеСУчетомПени", мСтруктураДанных.Сальдо + мСтруктураДанных.Начислено + мСтруктураДанных.ИтогПени - мСтруктураДанных.Оплата);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		
		ЗаполнитьПараметр(СтрокаРасшифровки, "ЕдИзм", Строка(СтрокаТаблицы.количество)+" "+Строка(СтрокаТаблицы.ЕдИзм));
		
		тмпРазовые = 0;
		тмпВозврат = 0;
		
		Если СтрокаТаблицы.Разовые > 0 Тогда
			тмпРазовые = СтрокаТаблицы.Разовые;
			ЗаполнитьПараметр(СтрокаРасшифровки, "Разовые", тмпРазовые);
		ИначеЕсли СтрокаТаблицы.Разовые < 0 Тогда
			тмпВозврат = СтрокаТаблицы.Разовые;
			ЗаполнитьПараметр(СтрокаРасшифровки, "Разовые", 0);
			ЗаполнитьПараметр(СтрокаРасшифровки, "Возврат", тмпВозврат);
		Иначе
			ЗаполнитьПараметр(СтрокаРасшифровки, "Разовые", 0);
			ЗаполнитьПараметр(СтрокаРасшифровки, "Возврат", 0);
		КонецЕсли;
		
		Если СтрокаТаблицы.НачисленоОбщДом > 0 Тогда
			
			тмпРазовые = тмпРазовые + СтрокаТаблицы.НачисленоОбщДом;
			ЗаполнитьПараметр(СтрокаРасшифровки, "Разовые", тмпРазовые);
			мСтруктураДанных.Разовые             = мСтруктураДанных.Разовые + СтрокаТаблицы.НачисленоОбщДом;
			
		ИначеЕсли СтрокаТаблицы.НачисленоОбщДом < 0 Тогда
			
			тмпВозврат = тмпВозврат + СтрокаТаблицы.НачисленоОбщДом;
			ЗаполнитьПараметр(СтрокаРасшифровки, "Разовые", тмпВозврат);
			мСтруктураДанных.Разовые = мСтруктураДанных.Разовые + СтрокаТаблицы.НачисленоОбщДом;
			
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Услуга", СтрокаТаблицы.Услуга);
		Посик = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
		
		Если Посик.количество() = 1 Тогда
			
			ЗаполнитьПараметр(СтрокаРасшифровки, "Нач", Посик[0].ОтПоказаний);
			ЗаполнитьПараметр(СтрокаРасшифровки, "Кон", Посик[0].ДоПоказаний);
			
			Квитанция.Вывести(СтрокаРасшифровки);
			
		ИначеЕсли Посик.количество() > 1 Тогда
			
			Для ЭлемМасс = 0 ПО Посик.количество() - 1 Цикл
				
				Если ЭлемМасс = 0 Тогда
					
					ЗаполнитьПараметр(СтрокаРасшифровки, "Нач", Посик[ЭлемМасс].ОтПоказаний);
					ЗаполнитьПараметр(СтрокаРасшифровки, "Кон", Посик[ЭлемМасс].ДоПоказаний);
					Квитанция.Вывести(СтрокаРасшифровки);
					
				Иначе
					
					ЗаполнитьПараметр(СтрокаРасшифровки, "Нач", Посик[ЭлемМасс].ОтПоказаний);
					ЗаполнитьПараметр(СтрокаРасшифровки, "Кон", Посик[ЭлемМасс].ДоПоказаний);
					
					ЗаполнитьПараметр(СтрокаРасшифровки, "Разовые", 0);
					ЗаполнитьПараметр(СтрокаРасшифровки, "Возврат", 0);
					ЗаполнитьПараметр(СтрокаРасшифровки, "ЕдИзм", 0);
					ЗаполнитьПараметр(СтрокаРасшифровки, "Норматив", 0);
					ЗаполнитьПараметр(СтрокаРасшифровки, "НастройкаСтавки", 0);
					ЗаполнитьПараметр(СтрокаРасшифровки, "Начислено", 0);
					
					Квитанция.Вывести(СтрокаРасшифровки);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			
			ЗаполнитьПараметр(СтрокаРасшифровки, "Нач", 0);
			ЗаполнитьПараметр(СтрокаРасшифровки, "Кон", 0);
			Квитанция.Вывести(СтрокаРасшифровки);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	
	Если мСтруктураДанных.Разовые > 0 Тогда
		ЗаполнитьПараметр(ОбластьИтого, "Разовые", мСтруктураДанных.Разовые);
	ИначеЕсли мСтруктураДанных.Разовые < 0 Тогда
		ЗаполнитьПараметр(ОбластьИтого, "Разовые", 0);
		ЗаполнитьПараметр(ОбластьИтого, "Возврат", мСтруктураДанных.Разовые);
	Иначе
		ЗаполнитьПараметр(ОбластьИтого, "Разовые", 0);
		ЗаполнитьПараметр(ОбластьИтого, "Возврат", 0);
	КонецЕсли;
	
	Квитанция.Вывести(ОбластьИтого);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Квитанция, ОбластьШтрихкодQR);
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Платежный документ РК 354.
//
Функция ПечатьПлатежныйДокумент() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьЗаголовок = мМакет.ПолучитьОбласть("Заголовок");
	ОбластьШапка     = мМакет.ПолучитьОбласть("Шапка");
	ОбластьСтрока    = мМакет.ПолучитьОбласть("Строка");
	ОбластьИтог      = мМакет.ПолучитьОбласть("Итого");
	ОбластьУказания  = мМакет.ПолучитьОбласть("Указания");
	
	ОбластьПустаяСтрока  = мМакет.ПолучитьОбласть("ПустаяСтрока");
	
	ОбластьРаздел5Заголовок  = мМакет.ПолучитьОбласть("Раздел5Заголовок");
	ОбластьРаздел5Шапка      = мМакет.ПолучитьОбласть("Раздел5Шапка");
	ОбластьРаздел5НомКолонок = мМакет.ПолучитьОбласть("Раздел5НомКолонок");
	ОбластьРаздел5Строка     = мМакет.ПолучитьОбласть("Раздел5Строка");
	
	ОбластьРаздел6Шапка    = мМакет.ПолучитьОбласть("Раздел6Шапка");
	ОбластьРаздел6Строка   = мМакет.ПолучитьОбласть("Раздел6Строка");
	ОбластьРаздел6Итого    = мМакет.ПолучитьОбласть("Раздел6Итого");
	
	Попытка
		
		ОбластьСправочнаяИнформацияСтрока    = мМакет.ПолучитьОбласть("СправочнаяИнформацияСтрока");
		
	Исключение
		
	КонецПопытки;
	
	мСтруктураДанных.ПереплатаНаНачало = мСтруктураДанных.ПереплатаНаНачало + мСтруктураДанных.Оплата;
	
	Квитанция.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	ОбластьШапка.Параметры.Заполнить(мКэшПолучателяПлатежа);
	
	//14.12.2018
	ОбластьШапка.Параметры.ПолучательКоррСчет = мКэшПолучателяПлатежа.ПолучательКоррСчетБИК;

	Организация_1 = "";
	Организация_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательПредставление, 59, Организация_1 , Организация_2 );
	
	ЗаполнитьПараметр(ОбластьШапка, "Организация_1", Организация_1);
	ЗаполнитьПараметр(ОбластьШапка, "Организация_2", Организация_2);
	
	АдресОрганизация_1 = "";
	АдресОрганизация_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательАдрес, 65, АдресОрганизация_1 , АдресОрганизация_2 );
	
	ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_1", АдресОрганизация_1);
	ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_2", АдресОрганизация_2);
	
	ДопИнформацияОрганизация_1 = "";
	ДопИнформацияОрганизация_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательДопИнформация, 20, ДопИнформацияОрганизация_1 , ДопИнформацияОрганизация_2);
	
	ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_1", ДопИнформацияОрганизация_1);
	ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_2", ДопИнформацияОрганизация_2);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Для каждого СтрокаПечати Из мТаблицаПечати Цикл
		
		Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда 
			Продолжить;
		КонецЕсли;
		ОбластьСтрока.Параметры.Заполнить(СтрокаПечати);
		Квитанция.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	ОбластьИтог.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьИтог);
	
	Квитанция.Вывести(ОбластьУказания);
	
	Если мТаблицаПерерасчетов.Количество() > 0 Тогда
		
		Квитанция.Вывести(ОбластьПустаяСтрока);
		Квитанция.Вывести(ОбластьРаздел5Заголовок);
		Квитанция.Вывести(ОбластьРаздел5Шапка);
		Квитанция.Вывести(ОбластьРаздел5НомКолонок);
		
		Для каждого СтрокаСведений Из мТаблицаПерерасчетов Цикл
			
			ОбластьРаздел5Строка.Параметры.Заполнить(СтрокаСведений);
			Если ИспользоватьКомментарийКакОснование Тогда
				ОбластьРаздел5Строка.Параметры.Основание = СтрокаСведений.Комментарий;
			КонецЕсли; 
			Квитанция.Вывести(ОбластьРаздел5Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		
		Для каждого строка из мТаблицаПечати Цикл
			
			Если строка.ИтогоОбъемОбщедомовых <> 0  Тогда
				ОбластьСправочнаяИнформацияСтрока.Параметры.Услуга = строка.Услуга;
				
				ОбластьСправочнаяИнформацияСтрока.Параметры.ЕдИзм = строка.ЕдИзм;
				
				ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемИндИПУ = строка.ИтогоОбъемИндИПУ;
				ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемИндНорматив = строка.ИтогоОбъемИндНорматив;
				ОбластьСправочнаяИнформацияСтрока.Параметры.ДоПоказаний = 0;
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Дата"   ,КонецДня(Период));
				
				Запрос.УстановитьПараметр("Здание",мСтруктураДанных.ЛицевойСчет.Здание);
				Запрос.УстановитьПараметр("Услуга", строка.Услуга);
				Запрос.УстановитьПараметр("Групповой", ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Групповой"));
				
				ЕстьОтборУслуг = Ложь;
				
				СписокУС = Новый СписокЗначений;
				
				Если НЕ ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам Тогда
					СписокУС.ЗагрузитьЗначения(ШаблонИзвещений.Услуги.ВыгрузитьКолонку("Услуга"));
					ЕстьОтборУслуг = СписокУС.Количество() > 0;
				КонецЕсли;
				
				Запрос.УстановитьПараметр("СписокУС"      , СписокУС);
				Запрос.УстановитьПараметр("ЕстьОтборУслуг", ЕстьОтборУслуг);
				Запрос.УстановитьПараметр("НачалоПериода"        , НачалоМесяца(Период));
				Запрос.УстановитьПараметр("КонецПериода"         , КонецМесяца(Период));
				Запрос.УстановитьПараметр("Организация"          , Организация);
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	бит_ПоказанияСчетчиковОстатки.Объект,
				|	бит_ПоказанияСчетчиковОстатки.Услуга,
				|	бит_ПоказанияСчетчиковОстатки.Счетчик,
				|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК НачальныеПоказания,
				|	ВЫБОР
				|		КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0
				|			ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0
				|					ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
				|				ИНАЧЕ ВЫБОР
				|						КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток = 0
				|							ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
				|						ИНАЧЕ 0
				|					КОНЕЦ
				|			КОНЕЦ
				|	КОНЕЦ КАК КонечныеПоказания
				|ПОМЕСТИТЬ Показания
				|ИЗ
				|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
				|			&Дата,
				|			Объект = &Здание
				|				И Счетчик.ТипСчетчика = &Групповой) КАК бит_ПоказанияСчетчиковОстатки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик,
				|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки
				|ПОМЕСТИТЬ ПоверкаСчетчика
				|ИЗ
				|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, Счетчик.ТипСчетчика = &Групповой) КАК бит_ПоверкаСчетчиковСрезПоследних
				|ГДЕ
				|	НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СУММА(ВЫБОР
				|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
				|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
				|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
				|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
				|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК ОбъемЗданиеОбщДом,
				|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга,
				|	бит_ОбъемыПоУслугамЖКХОбороты.Счетчик
				|ПОМЕСТИТЬ ОбъемПоЗданиям
				|ИЗ
				|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Регистратор,
				|			ЛицевойСчет.Организация = &Организация
				|				И ВЫБОР
				|					КОГДА &ЕстьОтборУслуг
				|						ТОГДА Услуга В (&СписокУС)
				|					ИНАЧЕ ИСТИНА
				|				КОНЕЦ) КАК бит_ОбъемыПоУслугамЖКХОбороты
				|ГДЕ
				|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет.Здание = &Здание
				|
				|СГРУППИРОВАТЬ ПО
				|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга,
				|	бит_ОбъемыПоУслугамЖКХОбороты.Счетчик
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать КАК Использовать,
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период КАК Период,
				|	ЕСТЬNULL(Показания.НачальныеПоказания, 0) КАК НачальныеПоказания,
				|	ЕСТЬNULL(Показания.КонечныеПоказания, 0) КАК КонечныеПоказания,
				|	ПоверкаСчетчика.ДатаПоверки КАК ДатаПоверки,
				|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеОбщДом, 0) КАК ОбъемЗданиеОбщДом,
				|	ОбъемПоЗданиям.Счетчик
				|ИЗ
				|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
				|			&Дата,
				|			Объект = &Здание
				|				И ТипСчетчика = &Групповой) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ Показания КАК Показания
				|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = Показания.Объект
				|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = Показания.Услуга
				|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = Показания.Счетчик
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПоверкаСчетчика КАК ПоверкаСчетчика
				|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = ПоверкаСчетчика.Счетчик
				|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемПоЗданиям КАК ОбъемПоЗданиям
				|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = ОбъемПоЗданиям.Счетчик
				|ГДЕ
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = &Услуга
				|
				|СГРУППИРОВАТЬ ПО
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать,
				|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период,
				|	ПоверкаСчетчика.ДатаПоверки,
				|	ЕСТЬNULL(Показания.НачальныеПоказания, 0),
				|	ЕСТЬNULL(Показания.КонечныеПоказания, 0),
				|	ЕСТЬNULL(ОбъемПоЗданиям.ОбъемЗданиеОбщДом, 0),
				|	ОбъемПоЗданиям.Счетчик
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период УБЫВ
				|ИТОГИ
				|	МАКСИМУМ(Использовать),
				|	МАКСИМУМ(ДатаПоверки)
				|ПО
				|	Период,
				|	Объект";		
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ТЗ = Запрос.Выполнить().Выгрузить();
				
				Если ТЗ.Количество() > 0 Тогда
					Для каждого строкаТЗ из ТЗ Цикл
						Если НЕ строкаТЗ.Услуга = Null и НЕ строкаТЗ.ОбъемЗданиеОбщДом = 0 Тогда 
							
							ОбластьСправочнаяИнформацияСтрока.Параметры.Счетчик	= строкаТЗ.Счетчик;
							
							ОбластьСправочнаяИнформацияСтрока.Параметры.ДоПоказаний = строкаТЗ.КонечныеПоказания;
							
							ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемОбщедомовых = строкаТЗ.ОбъемЗданиеОбщДом;
							
							Квитанция.Вывести(ОбластьСправочнаяИнформацияСтрока);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
	КонецПопытки;
	
	Если ИспользоватьQR = Истина Тогда
		
		//Попытка	
		//	ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		//Исключение
		//КонецПопытки;
		
		НапечататьQRКод(Квитанция);
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

Функция ПечатьПлатежныйДокументРК924() Экспорт
	
	//20.03.2019
	Если мТаблицаПлатежиГИСЖКХ36 = Неопределено тогда
		мТаблицаПлатежиГИСЖКХ36			= ПолучитьТаблицаПлатежиГИСЖКХ36();
	конецесли;	
	
	Если мТаблицаПлатежиГИСЖКХДПД = Неопределено тогда
	    мТаблицаПлатежиГИСЖКХДПД		= ПолучитьТаблицаПлатежиГИСЖКХДПД();
	конецесли;  
    //--------

	
	Квитанция = Новый ТабличныйДокумент;
	ОбластьЗаголовок			= мМакет.ПолучитьОбласть("Заголовок");
	ОбластьШапка				= мМакет.ПолучитьОбласть("Шапка");
	ОбластьРаздел2Шапка			= мМакет.ПолучитьОбласть("Раздел2Шапка");
	ОбластьРаздел2Строка		= мМакет.ПолучитьОбласть("Раздел2Строка");
	ОбластьРаздел2Итог			= мМакет.ПолучитьОбласть("Раздел2Итог");
	ОбластьРаздел34Шапка		= мМакет.ПолучитьОбласть("Раздел34Шапка");
	ОбластьСтрокаГрСодержание	= мМакет.ПолучитьОбласть("ГруппаСодержание");
	ОбластьСтрокаГрКоммунальные	= мМакет.ПолучитьОбласть("ГруппаКоммунальные");
	ОбластьСтрокаГрПрочие		= мМакет.ПолучитьОбласть("ГруппаПрочие");
	ОбластьСтрока				= мМакет.ПолучитьОбласть("Строка");
	ОбластьИтог					= мМакет.ПолучитьОбласть("Итого");
	ОбластьУказания				= мМакет.ПолучитьОбласть("Указания");
	ОбластьПустаяСтрока			= мМакет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьРаздел5Заголовок		= мМакет.ПолучитьОбласть("Раздел5Заголовок");
	ОбластьРаздел5Шапка			= мМакет.ПолучитьОбласть("Раздел5Шапка");
	ОбластьРаздел5НомКолонок	= мМакет.ПолучитьОбласть("Раздел5НомКолонок");
	ОбластьРаздел5Строка		= мМакет.ПолучитьОбласть("Раздел5Строка");
	ОбластьРаздел6Шапка			= мМакет.ПолучитьОбласть("Раздел6Шапка");
	ОбластьРаздел6Строка		= мМакет.ПолучитьОбласть("Раздел6Строка");
	ОбластьРаздел6Итого			= мМакет.ПолучитьОбласть("Раздел6Итого");
	
	ТаблицаПлатежиГИСЖКХ12Получатели = ПолучитьТаблицаПлатежиГИСЖКХ12Получатели();
	
	Если мКэшПараметрыЖКХ.РаздельныйУчетКапРемонта Тогда
		
		ОбластьРаздел7Шапка			= мМакет.ПолучитьОбласть("Раздел7Шапка");
		ОбластьРаздел7Строка		= мМакет.ПолучитьОбласть("Раздел7Строка");
		ОбластьРаздел8Шапка			= мМакет.ПолучитьОбласть("Раздел8Шапка");
		ОбластьРаздел8Строка		= мМакет.ПолучитьОбласть("Раздел8Строка");
		ОбластьРаздел8Итог			= мМакет.ПолучитьОбласть("Раздел8Итог");
		ИтогоКапКОплате				= 0;
		ИтогоКапКОплатеЗаМесяц		= 0;
		ИтогоКапЗакрытиеВхДолга		= 0;
		
		// Кэш итогов кап. ремонта, для корректировки.
		ТабПечатиКап = мТаблицаПечати.Скопировать(Новый Структура("ГрафаОтчетаГЦЖС", ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт")));
		Если ТабПечатиКап.Количество() > 0 Тогда
			ИтогоКапКОплате = ТабПечатиКап.Итог("КОплате");
			ИтогоКапКОплатеЗаМесяц = ТабПечатиКап.Итог("КОплатеЗаМесяц");
			ИтогоКапЗакрытиеВхДолга = ТабПечатиКап.Итог("ЗакрытиеВхДолга");
		КонецЕсли;
		
		мСтруктураДанных.ПереплатаНаНачало = мСтруктураДанных.ПереплатаНаНачало + мСтруктураДанных.Оплата;
		ОбластьЗаголовок.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьЗаголовок);
		
		// ОбластьШапка.
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ОбластьШапка.Параметры.Заполнить(мКэшПолучателяПлатежа);
		Организация_1 = "";
		Организация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательПредставление, 59, Организация_1 , Организация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "Организация_1", Организация_1);
		ЗаполнитьПараметр(ОбластьШапка, "Организация_2", Организация_2);
		АдресОрганизация_1 = "";
		АдресОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательАдрес, 65, АдресОрганизация_1 , АдресОрганизация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_1", АдресОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_2", АдресОрганизация_2);
		ДопИнформацияОрганизация_1 = "";
		ДопИнформацияОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательДопИнформация, 20, ДопИнформацияОрганизация_1 , ДопИнформацияОрганизация_2);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_1", ДопИнформацияОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_2", ДопИнформацияОрганизация_2);
		Квитанция.Вывести(ОбластьШапка);
		
		// ОбластьРаздел2Шапка.
		ТабДокуРаздел2 = Новый ТабличныйДокумент;
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Шапка);

		// ОбластьРаздел2Строка.
		Если ПолучательПлатежа924 Тогда
			
			ТабПечатиПолучатели = мТаблицаПечати.Скопировать(,
			"ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			ТабПечатиПолучатели.Свернуть("ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			Для Каждого Стр Из ТабПечатиПолучатели Цикл	// Обход Получателей.
				МассивУслугиПоставщика =  мТаблицаПечати.НайтиСтроки(Новый Структура("ПолучательПлатежа",Стр.ПолучательПлатежа));
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа = Стр.ПолучательПлатежаИмя;
				
				ТекстПолучательСчет = "";
				Если ЗначениеЗаполнено(Стр.ПолучательРС)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательИНН)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКПП)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБанк)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКоррСчет)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБИК) Тогда
					
					ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
					|Банк: %4
					|Корр.счет.\БИК: %5'");
					
					ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
													Стр.ПолучательРС,
													Стр.ПолучательИНН,
													Стр.ПолучательКПП,
													Стр.ПолучательБанк,
													Стр.ПолучательКоррСчет + " \ " + Стр.ПолучательБИК);
					
				КонецЕсли;
				
				ОбластьРаздел2Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
				
				КОплатеЗаМесяц = 0;
				ВидУслуги	   = "";
				
				Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
					Если СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
						Продолжить;
					КонецЕсли;
					КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
					ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
				КонецЦикла;
				ОбластьРаздел2Строка.Параметры.ВидУслуги	  = ВидУслуги;
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если НеПечататьУслугиБезНачислений
					И КОплатеЗаМесяц = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Стр.ПолучательБИК) И ЗначениеЗаполнено(Стр.ПолучательРС) Тогда
					НовыйПлучатель = ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа = Стр.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка			 = Стр.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет	 = Стр.ПолучательРС;
					НовыйПлучатель.КОплатеЗаМесяц	 = Стр.КОплатеЗаМесяц;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
			КонецЦикла;
			
		Иначе
				ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
				|Банк: %4
				|Корр.счет.\БИК: %5'");
				ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
												мСтруктураДанных.ПолучательРС,
												мСтруктураДанных.ПолучательИНН,
												мСтруктураДанных.ПолучательКПП,
												мСтруктураДанных.ПолучательБанк,
												мСтруктураДанных.ПолучательКоррСчет2 + " \ " + мСтруктураДанных.ПолучательБИК);
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ПолучательПлатежа,"Наименование");
				ОбластьРаздел2Строка.Параметры.ПолучательСчет		= ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет			= Строка(мСтруктураДанных.ЛицевойСчет); 
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц		= Формат(мСтруктураДанных.КОплатеЗаМесяц - ИтогоКапКОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если ЗначениеЗаполнено(мСтруктураДанных.ПолучательБИК) И ЗначениеЗаполнено(мСтруктураДанных.ПолучательРС) Тогда
					НовыйПлучатель						= ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа	= ЭтотОбъект.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка				= мСтруктураДанных.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет		= мСтруктураДанных.ПолучательРС;
					НовыйПлучатель.КОплатеЗаМесяц		= мСтруктураДанных.КОплатеЗаМесяц - ИтогоКапКОплатеЗаМесяц;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
		КонецЕсли; //ПолучательПлатежа924.
		
		// ОбластьРаздел2Итог.
		ОбластьРаздел2Итог.Параметры.Заполнить(мСтруктураДанных);
		ОбластьРаздел2Итог.Параметры.ДатаПоследнейОплаты = мСтруктураДанных.ДатаПоследнейОплатыНеКапРем;
		ОбластьРаздел2Итог.Параметры.Коплате = мСтруктураДанных.Коплате - ИтогоКапКОплате;	// Корректировка итогов за вычетом кап ремонта.
		
		Если ИтогоКапЗакрытиеВхДолга <> 0 Тогда
			ДолгСУчетомОплаты = 0;
			Авансы			  = 0;
			Если мСтруктураДанных.ДолгСУчетомОплаты > 0 Тогда
				ДолгСУчетомОплаты = мСтруктураДанных.ДолгСУчетомОплаты - ИтогоКапЗакрытиеВхДолга;
			ИначеЕсли мСтруктураДанных.Авансы > 0 Тогда
				Авансы = мСтруктураДанных.Авансы + ИтогоКапЗакрытиеВхДолга;
			КонецЕсли;
			
			Если ДолгСУчетомОплаты > 0 Тогда
				ОбластьРаздел2Итог.Параметры.ДолгСУчетомОплаты = ДолгСУчетомОплаты;
				ОбластьРаздел2Итог.Параметры.Авансы = 0;
			ИначеЕсли Авансы > 0 Тогда
				ОбластьРаздел2Итог.Параметры.ДолгСУчетомОплаты = 0;
				ОбластьРаздел2Итог.Параметры.Авансы = Авансы;
			КонецЕсли;
		КонецЕсли; 
		
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Итог);
		
		Квитанция.Присоединить(ТабДокуРаздел2);
		
		// ОбластьРаздел34Шапка.
		Квитанция.Вывести(ОбластьРаздел34Шапка);
		
		// Строки Раздел3.
		ТабДокСодержаниеРемонтУсл = Новый ТабличныйДокумент;
		ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрокаГрСодержание);
		ТабДокКоммунальныеУсл = Новый ТабличныйДокумент;
		ТабДокКоммунальныеУсл.Вывести(ОбластьСтрокаГрКоммунальные);
		ТабДокПрочиеУсл	= Новый ТабличныйДокумент;
		ТабДокПрочиеУсл.Вывести(ОбластьСтрокаГрПрочие);
		Для каждого СтрокаПечати Из мТаблицаПечати Цикл
			
			Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаПечати);
			
			Если НЕ (мТаблицаПлатежиГИСЖКХ36 = Неопределено
				ИЛИ мТаблицаПлатежиГИСЖКХДПД = Неопределено) Тогда
				ЗаполнитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
				ЗаполнитьТаблицаПлатежиГИСЖКХДПД(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
			КонецЕсли;
			
			Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
				
				Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
					ОбновитьТаблицаПлатежиГИСЖКХ12Получатели(ТаблицаПлатежиГИСЖКХ12Получатели, СтрокаПечати);
				КонецЕсли;
				
				Продолжить;
			ИначеЕсли СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание")
				ИЛИ СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм") Тогда
				
				ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрока);
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПечати.ГрафаОтчетаГЦЖС) Тогда	
				
				ТабДокПрочиеУсл.Вывести(ОбластьСтрока);
			Иначе 
				
				ТабДокКоммунальныеУсл.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ТабДокСодержаниеРемонтУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокСодержаниеРемонтУсл);
		КонецЕсли;
		Если  ТабДокКоммунальныеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокКоммунальныеУсл);
		КонецЕсли;
		Если ТабДокПрочиеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокПрочиеУсл);
		КонецЕсли;
		
		ОбластьИтог.Параметры.Заполнить(мСтруктураДанных);
		ОбластьИтог.Параметры.КОплатеЗаМесяц = мСтруктураДанных.КОплатеЗаМесяц - ИтогоКапКОплатеЗаМесяц;	// Корректировка итогов за вычетом кап ремонта.
		
		Квитанция.Вывести(ОбластьИтог);
		Квитанция.Вывести(ОбластьУказания);
		
		// ОбластьРаздел5.
		ТабДокуРаздел5 = Неопределено;
		Если мТаблицаПерерасчетов.Количество() > 0 Тогда
			
			ТабДокуРаздел5 = Новый ТабличныйДокумент;
			ТабДокуРаздел5.Вывести(ОбластьПустаяСтрока);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Заголовок);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Шапка);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5НомКолонок);
			
			Для каждого СтрокаСведений Из мТаблицаПерерасчетов Цикл
				
				ОбластьРаздел5Строка.Параметры.Заполнить(СтрокаСведений);
				Если ИспользоватьКомментарийКакОснование Тогда
					ОбластьРаздел5Строка.Параметры.Основание = СтрокаСведений.Комментарий;
				КонецЕсли; 
				
				ОбновитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаСведений, ИспользоватьКомментарийКакОснование);
				
				ТабДокуРаздел5.Вывести(ОбластьРаздел5Строка);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ ТабДокуРаздел5 = Неопределено Тогда
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел5) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел5);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел5);
			КонецЕсли;  
		КонецЕсли; 
		
		// ОбластьРаздел7.
		ТабДокуРаздел7 = Неопределено;
		Если ТабПечатиКап.Количество() > 0 Тогда
			
			ТабДокуРаздел7 = Новый ТабличныйДокумент;
			ТабДокуРаздел7.Вывести(ОбластьРаздел7Шапка);
			Для каждого СтрокаПечати Из ТабПечатиКап Цикл
				
				Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьРаздел7Строка.Параметры.Заполнить(СтрокаПечати);
				ТабДокуРаздел7.Вывести(ОбластьРаздел7Строка);
				
			КонецЦикла; 
		КонецЕсли;
		
		Если НЕ ТабДокуРаздел7 = Неопределено 
			И ТабДокуРаздел7.ВысотаТаблицы > 7 Тогда // Есть записи.
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел7) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел7);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел7);
			КонецЕсли;  
		КонецЕсли; 
		
		// ОбластьРаздел8.
		ТабДокуРаздел8 = Неопределено;
		Если ТабПечатиКап.Количество() > 0 Тогда
			ТабДокуРаздел8 = Новый ТабличныйДокумент;
			ТабДокуРаздел8.Вывести(ОбластьРаздел8Шапка);
			
			ТабПечатиПолучателиКап = ТабПечатиКап.Скопировать(,
				"КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
			
			ТабПечатиПолучателиКап.Свернуть("КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
			
			Для Каждого Стр Из ТабПечатиПолучателиКап Цикл	// Обход Получателей.
				МассивУслугиПоставщика =  ТабПечатиКап.НайтиСтроки(Новый Структура("КапПолучательПлатежа",Стр.КапПолучательПлатежа));
				
				ОбластьРаздел8Строка.Параметры.ПолучательПлатежа = Стр.КапПолучательПлатежаИмя;
				
				ТекстПолучательСчет = "";
				Если ЗначениеЗаполнено(Стр.КапПолучательРС)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательИНН)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКПП)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБанк)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКоррСчет)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБИК) Тогда
					
					ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
					|Банк: %4
					|Корр.счет.\БИК: %5'");
					
					ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
													Стр.КапПолучательРС,
													Стр.КапПолучательИНН,
													Стр.КапПолучательКПП,
													Стр.КапПолучательБанк,
													Стр.КапПолучательКоррСчет + " \ " + Стр.КапПолучательБИК);
					
				КонецЕсли;
				
				ОбластьРаздел8Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
				ОбластьРаздел8Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
				
				КОплатеЗаМесяц = 0;
				ВидУслуги	   = "";
				
				Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
					Если НЕ СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
						Продолжить;
					КонецЕсли;
					КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
					ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
				КонецЦикла;
				ОбластьРаздел8Строка.Параметры.ВидУслуги	  = ВидУслуги;
				ОбластьРаздел8Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если НеПечататьУслугиБезНачислений
					И КОплатеЗаМесяц = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ТабДокуРаздел8.Вывести(ОбластьРаздел8Строка);
			КонецЦикла;
			
			ОбластьРаздел8Итог.Параметры.ДатаПоследнейОплаты = мСтруктураДанных.ДатаПоследнейОплатыКапРем;
			ОбластьРаздел8Итог.Параметры.Коплате = ИтогоКапКОплате;
			Если ИтогоКапЗакрытиеВхДолга >= 0 Тогда
				ОбластьРаздел8Итог.Параметры.ДолгСУчетомОплаты = ИтогоКапЗакрытиеВхДолга;
			Иначе
				ОбластьРаздел8Итог.Параметры.Авансы = ИтогоКапЗакрытиеВхДолга * -1;
			КонецЕсли;
			
			ТабДокуРаздел8.Вывести(ОбластьРаздел8Итог);
		КонецЕсли;
	
		Если НЕ ТабДокуРаздел8 = Неопределено 
			И ТабДокуРаздел8.ВысотаТаблицы > 14 Тогда
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел8) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел8);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел8);
			КонецЕсли;  
		КонецЕсли; 
		
		
	Иначе	// НЕ мКэшПараметрыЖКХ.РаздельныйУчетКапРемонта.
		
		ТабПечатиКап = мТаблицаПечати.Скопировать(Новый Структура("ГрафаОтчетаГЦЖС", ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт")));
		мСтруктураДанных.ПереплатаНаНачало = мСтруктураДанных.ПереплатаНаНачало + мСтруктураДанных.Оплата;
		ОбластьЗаголовок.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьЗаголовок);
		
		// ОбластьШапка.
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ОбластьШапка.Параметры.Заполнить(мКэшПолучателяПлатежа);
		Организация_1 = "";
		Организация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательПредставление, 59, Организация_1 , Организация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "Организация_1", Организация_1);
		ЗаполнитьПараметр(ОбластьШапка, "Организация_2", Организация_2);
		АдресОрганизация_1 = "";
		АдресОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательАдрес, 65, АдресОрганизация_1 , АдресОрганизация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_1", АдресОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_2", АдресОрганизация_2);
		ДопИнформацияОрганизация_1 = "";
		ДопИнформацияОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательДопИнформация, 20, ДопИнформацияОрганизация_1 , ДопИнформацияОрганизация_2);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_1", ДопИнформацияОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_2", ДопИнформацияОрганизация_2);
		Квитанция.Вывести(ОбластьШапка);
		
		// ОбластьРаздел2Шапка.
		ТабДокуРаздел2 = Новый ТабличныйДокумент;
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Шапка);

		// ОбластьРаздел2Строка.
		Если ПолучательПлатежа924 Тогда
			
			ТабПечатиПолучатели = мТаблицаПечати.Скопировать(,
			"ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			ТабПечатиПолучатели.Свернуть("ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			Для Каждого Стр Из ТабПечатиПолучатели Цикл	// Обход Получателей.
				МассивУслугиПоставщика =  мТаблицаПечати.НайтиСтроки(Новый Структура("ПолучательПлатежа",Стр.ПолучательПлатежа));
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа = Стр.ПолучательПлатежаИмя;
				
				ТекстПолучательСчет = "";
				Если ЗначениеЗаполнено(Стр.ПолучательРС)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательИНН)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКПП)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБанк)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКоррСчет)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБИК) Тогда
					
					ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
					|Банк: %4
					|Корр.счет.\БИК: %5'");
					
					ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
													Стр.ПолучательРС,
													Стр.ПолучательИНН,
													Стр.ПолучательКПП,
													Стр.ПолучательБанк,
													Стр.ПолучательКоррСчет + " \ " + Стр.ПолучательБИК);
					
				КонецЕсли;
				
				ОбластьРаздел2Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
				
				КОплатеЗаМесяц = 0;
				ВидУслуги	   = "";
				
				Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
					Если СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
						Продолжить;
					КонецЕсли;
					КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
					ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
				КонецЦикла;
				ОбластьРаздел2Строка.Параметры.ВидУслуги	  = ВидУслуги;
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если ЗначениеЗаполнено(Стр.ПолучательБИК) И ЗначениеЗаполнено(Стр.ПолучательРС) Тогда
					НовыйПлучатель = ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа= Стр.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка			= Стр.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет	= Стр.ПолучательРС;
					НовыйПлучатель.КОплатеЗаМесяц	= КОплатеЗаМесяц;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
			КонецЦикла;
			
			Если ТабПечатиКап.Количество() > 0 Тогда // Данные по кап ремонту.
				
				ТабПечатиПолучателиКап = ТабПечатиКап.Скопировать(,
				"КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
				
				ТабПечатиПолучателиКап.Свернуть("КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
				
				Для Каждого Стр Из ТабПечатиПолучателиКап Цикл	// Обход Получателей.
					МассивУслугиПоставщика =  ТабПечатиКап.НайтиСтроки(Новый Структура("КапПолучательПлатежа",Стр.КапПолучательПлатежа));
					
					ОбластьРаздел2Строка.Параметры.ПолучательПлатежа = Стр.КапПолучательПлатежаИмя;
					
					ТекстПолучательСчет = "";
					Если ЗначениеЗаполнено(Стр.КапПолучательРС)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательИНН)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКПП)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБанк)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКоррСчет)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБИК) Тогда
						
						ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
						|Банк: %4
						|Корр.счет.\БИК: %5'");
						
						ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
														Стр.КапПолучательРС,
														Стр.КапПолучательИНН,
														Стр.КапПолучательКПП,
														Стр.КапПолучательБанк,
														Стр.КапПолучательКоррСчет + " \ " + Стр.КапПолучательБИК);
						
					КонецЕсли;
					
					ОбластьРаздел2Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
					ОбластьРаздел2Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
					
					КОплатеЗаМесяц = 0;
					ВидУслуги	   = "";
					
					Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
						Если НЕ СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
							Продолжить;
						КонецЕсли;
						КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
						ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
					КонецЦикла;
					ОбластьРаздел2Строка.Параметры.ВидУслуги	  = ВидУслуги;
					ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
					
					Если ЗначениеЗаполнено(Стр.КапПолучательБИК) И ЗначениеЗаполнено(Стр.КапПолучательРС) Тогда
						НовыйПлучатель = ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
						НовыйПлучатель.ПолучательПлатежа= Стр.КапПолучательПлатежа;
						НовыйПлучатель.БИКБанка			= Стр.КапПолучательБИК;
						НовыйПлучатель.РасчетныйСчет	= Стр.КапПолучательРС;
						НовыйПлучатель.КОплатеЗаМесяц	= КОплатеЗаМесяц;
					КонецЕсли;
					
					ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
				КонецЦикла;
			КонецЕсли;
			
		Иначе
				ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
				|Банк: %4
				|Корр.счет.\БИК: %5'");
				ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
												мСтруктураДанных.ПолучательРС,
												мСтруктураДанных.ПолучательИНН,
												мСтруктураДанных.ПолучательКПП,
												мСтруктураДанных.ПолучательБанк,
												мСтруктураДанных.ПолучательКоррСчет2 + " \ " + мСтруктураДанных.ПолучательБИК);
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ПолучательПлатежа,"Наименование");
				ОбластьРаздел2Строка.Параметры.ПолучательСчет		= ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет			= Строка(мСтруктураДанных.ЛицевойСчет); 
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц		= Формат(мСтруктураДанных.КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если ЗначениеЗаполнено(мСтруктураДанных.ПолучательБИК) И ЗначениеЗаполнено(мСтруктураДанных.ПолучательРС) Тогда
					НовыйПлучатель						= ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа	= ЭтотОбъект.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка				= мСтруктураДанных.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет		= мСтруктураДанных.ПолучательРС;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
		КонецЕсли; //ПолучательПлатежа924
	
		// ОбластьРаздел2Итог.
		ОбластьРаздел2Итог.Параметры.Заполнить(мСтруктураДанных);
		ОбластьРаздел2Итог.Параметры.ДатаПоследнейОплаты = мСтруктураДанных.ДатаПоследнейОплаты;
		
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Итог);
		
		Квитанция.Присоединить(ТабДокуРаздел2);
		
		// ОбластьРаздел34Шапка.
		Квитанция.Вывести(ОбластьРаздел34Шапка);
		
		// Строки Раздел34.

		ТабДокСодержаниеРемонтУсл = Новый ТабличныйДокумент;
		ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрокаГрСодержание);

		ТабДокКоммунальныеУсл = Новый ТабличныйДокумент;
		ТабДокКоммунальныеУсл.Вывести(ОбластьСтрокаГрКоммунальные);

		ТабДокПрочиеУсл	= Новый ТабличныйДокумент;
		ТабДокПрочиеУсл.Вывести(ОбластьСтрокаГрПрочие);

		Для каждого СтрокаПечати Из мТаблицаПечати Цикл
			
			Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаПечати);
			
			Если НЕ (мТаблицаПлатежиГИСЖКХ36 = Неопределено
				ИЛИ мТаблицаПлатежиГИСЖКХДПД = Неопределено) Тогда
				ЗаполнитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
				ЗаполнитьТаблицаПлатежиГИСЖКХДПД(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
			КонецЕсли;
			
			Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание")
				ИЛИ СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм")
				ИЛИ СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
				
				ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрока);
				
				Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
					ОбновитьТаблицаПлатежиГИСЖКХ12Получатели(ТаблицаПлатежиГИСЖКХ12Получатели, СтрокаПечати);
				КонецЕсли;
				
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПечати.ГрафаОтчетаГЦЖС) Тогда	
				
				ТабДокПрочиеУсл.Вывести(ОбластьСтрока);
			Иначе 
				
				ТабДокКоммунальныеУсл.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ТабДокСодержаниеРемонтУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокСодержаниеРемонтУсл);
		КонецЕсли;
		
		Если ТабДокКоммунальныеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокКоммунальныеУсл);
		КонецЕсли;
		
		Если ТабДокПрочиеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокПрочиеУсл);
		КонецЕсли;
		
		ОбластьИтог.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьИтог);
		Квитанция.Вывести(ОбластьУказания);
		
		// ОбластьРаздел5.
		ТабДокуРаздел5 = Неопределено;
		Если мТаблицаПерерасчетов.Количество() > 0 Тогда
			
			ТабДокуРаздел5 = Новый ТабличныйДокумент;
			ТабДокуРаздел5.Вывести(ОбластьПустаяСтрока);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Заголовок);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Шапка);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5НомКолонок);
			
			Для каждого СтрокаСведений Из мТаблицаПерерасчетов Цикл
				
				ОбластьРаздел5Строка.Параметры.Заполнить(СтрокаСведений);
				Если ИспользоватьКомментарийКакОснование Тогда
					ОбластьРаздел5Строка.Параметры.Основание = СтрокаСведений.Комментарий;
				КонецЕсли; 
				
				ОбновитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаСведений, ИспользоватьКомментарийКакОснование);
				
				ТабДокуРаздел5.Вывести(ОбластьРаздел5Строка);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ ТабДокуРаздел5 = Неопределено Тогда
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел5) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел5);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел5);
			КонецЕсли;  
		КонецЕсли; 

	КонецЕсли; //Конец условия мКэшПараметрыЖКХ.РаздельныйУчетКапРемонта.

	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Квитанция, ОбластьШтрихкодQR);
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	// Платежные документы ГИС ЖКХ 1-2.
	Если мТаблицаПлатежиГИСЖКХ12 = Неопределено Тогда
		Возврат Квитанция;	
	КонецЕсли;
	
	Для Каждого Стр Из ТаблицаПлатежиГИСЖКХ12Получатели Цикл
				
		ЗадолженностьЗаПредыдущиеПериоды= ОбластьРаздел2Итог.Параметры.ДолгСУчетомОплаты; 
		АвансНаНачалоПериода			= ОбластьРаздел2Итог.Параметры.Авансы;
		ИтогоКОплатеЗаРС				= ОбластьИтог.Параметры.КОплатеЗаМесяц;
		ИтогоКОплатеЗаРССальдо			= ОбластьРаздел2Итог.Параметры.Коплате;
		
		СтрПлатежГИСЖКХ = мТаблицаПлатежиГИСЖКХ12.Добавить();
		СтрПлатежГИСЖКХ.ЛицевойСчет						= мСтруктураДанных.ЛицевойСчет;
		СтрПлатежГИСЖКХ.ИдентификаторЖКУ				= мСтруктураДанных.ИдентификаторЖКУ;
		//СтрПлатежГИСЖКХ.ТипПД							= ?(ШаблонИзвещений.Сальдо = Перечисления.ДаНет.Да, "Долговой", "Текущий");
		СтрПлатежГИСЖКХ.РасчетныйПериод					= мСтруктураДанных.Дата;
		СтрПлатежГИСЖКХ.ЗадолженностьЗаПредыдущиеПериоды= ?(ЗначениеЗаполнено(ЗадолженностьЗаПредыдущиеПериоды), ЗадолженностьЗаПредыдущиеПериоды, 0);
		СтрПлатежГИСЖКХ.АвансНаНачалоПериода	 		= ?(ЗначениеЗаполнено(АвансНаНачалоПериода), АвансНаНачалоПериода, 0);
		СтрПлатежГИСЖКХ.Оплачено						= мСтруктураДанных.Оплата;
		СтрПлатежГИСЖКХ.ЧислоРасчетногоПериода			= День(КонецМесяца(мСтруктураДанных.Дата));
		СтрПлатежГИСЖКХ.ДатаПоследнейОплаты				= мСтруктураДанных.ДатаПоследнейОплатыНеКапРемГИСЖКХ;
		СтрПлатежГИСЖКХ.ДатаПоследнейОплатыКапРем		= мСтруктураДанных.ДатаПоследнейОплатыКапРемГИСЖКХ;
		СтрПлатежГИСЖКХ.ИтогоКОплатеЗаРС				= ?(ЗначениеЗаполнено(ИтогоКОплатеЗаРС), ИтогоКОплатеЗаРС, 0);
		СтрПлатежГИСЖКХ.ИтогоКОплатеЗаРССальдо			= ?(ЗначениеЗаполнено(ИтогоКОплатеЗаРССальдо), ИтогоКОплатеЗаРССальдо, 0);
		
		ЗаполнитьЗначенияСвойств(СтрПлатежГИСЖКХ, Стр);
		СтрПлатежГИСЖКХ.ТабличнйДокумент = Квитанция;
		
	КонецЦикла;
	
	ЗаполнитьТаблицаПлатежиГИСЖКХНеустойки(мСтруктураДанных.ЛицевойСчет, мСтруктураДанных.НачисленоПениЗаПериод, мСтруктураДанных.ИтогПени);
	
	Возврат Квитанция;
	
КонецФункции

Функция ПечатьПлатежныйДокументРК924ГИСЖКХ() Экспорт
	
	//20.03.2019
	Если мТаблицаПлатежиГИСЖКХ36 = Неопределено тогда
		мТаблицаПлатежиГИСЖКХ36			= ПолучитьТаблицаПлатежиГИСЖКХ36();
	конецесли;	
	
	Если мТаблицаПлатежиГИСЖКХДПД = Неопределено тогда
	    мТаблицаПлатежиГИСЖКХДПД		= ПолучитьТаблицаПлатежиГИСЖКХДПД();
	конецесли;  
    //--------
	
	
	Квитанция = Новый ТабличныйДокумент;
	ОбластьЗаголовок			= мМакет.ПолучитьОбласть("Заголовок");
	ОбластьШапка				= мМакет.ПолучитьОбласть("Шапка");
	ОбластьРаздел2Шапка			= мМакет.ПолучитьОбласть("Раздел2Шапка");
	ОбластьРаздел2Строка		= мМакет.ПолучитьОбласть("Раздел2Строка");
	ОбластьРаздел2Итог			= мМакет.ПолучитьОбласть("Раздел2Итог");
	ОбластьРаздел34Шапка		= мМакет.ПолучитьОбласть("Раздел34Шапка");
	ОбластьСтрокаГрСодержание	= мМакет.ПолучитьОбласть("ГруппаСодержание");
	ОбластьСтрокаГрКоммунальные	= мМакет.ПолучитьОбласть("ГруппаКоммунальные");
	ОбластьСтрокаГрПрочие		= мМакет.ПолучитьОбласть("ГруппаПрочие");
	ОбластьСтрока				= мМакет.ПолучитьОбласть("Строка");
	ОбластьИтог					= мМакет.ПолучитьОбласть("Итого");
	ОбластьУказания				= мМакет.ПолучитьОбласть("Указания");
	ОбластьПустаяСтрока			= мМакет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьРаздел5Заголовок		= мМакет.ПолучитьОбласть("Раздел5Заголовок");
	ОбластьРаздел5Шапка			= мМакет.ПолучитьОбласть("Раздел5Шапка");
	ОбластьРаздел5НомКолонок	= мМакет.ПолучитьОбласть("Раздел5НомКолонок");
	ОбластьРаздел5Строка		= мМакет.ПолучитьОбласть("Раздел5Строка");
	ОбластьРаздел6Шапка			= мМакет.ПолучитьОбласть("Раздел6Шапка");
	ОбластьРаздел6Строка		= мМакет.ПолучитьОбласть("Раздел6Строка");
	ОбластьРаздел6Итого			= мМакет.ПолучитьОбласть("Раздел6Итого");
	
	ТаблицаПлатежиГИСЖКХ12Получатели = ПолучитьТаблицаПлатежиГИСЖКХ12Получатели();
	
	Если мКэшПараметрыЖКХ.РаздельныйУчетКапРемонта Тогда
		
		ОбластьРаздел7Шапка			= мМакет.ПолучитьОбласть("Раздел7Шапка");
		ОбластьРаздел7Строка		= мМакет.ПолучитьОбласть("Раздел7Строка");
		ОбластьРаздел8Шапка			= мМакет.ПолучитьОбласть("Раздел8Шапка");
		ОбластьРаздел8Строка		= мМакет.ПолучитьОбласть("Раздел8Строка");
		ОбластьРаздел8Итог			= мМакет.ПолучитьОбласть("Раздел8Итог");
		ИтогоКапКОплате				= 0;
		ИтогоКапКОплатеЗаМесяц		= 0;
		ИтогоКапЗакрытиеВхДолга		= 0;
		
		// Кэш итогов кап. ремонта, для корректировки.
		ТабПечатиКап = мТаблицаПечати.Скопировать(Новый Структура("ГрафаОтчетаГЦЖС", ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт")));
		Если ТабПечатиКап.Количество() > 0 Тогда
			ИтогоКапКОплате = ТабПечатиКап.Итог("КОплате");
			ИтогоКапКОплатеЗаМесяц = ТабПечатиКап.Итог("КОплатеЗаМесяц");
			ИтогоКапЗакрытиеВхДолга = ТабПечатиКап.Итог("ЗакрытиеВхДолга");
		КонецЕсли;
		
		мСтруктураДанных.ПереплатаНаНачало = мСтруктураДанных.ПереплатаНаНачало + мСтруктураДанных.Оплата;
		ОбластьЗаголовок.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьЗаголовок);
		
		// ОбластьШапка.
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ОбластьШапка.Параметры.Заполнить(мКэшПолучателяПлатежа);
		Организация_1 = "";
		Организация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательПредставление, 59, Организация_1 , Организация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "Организация_1", Организация_1);
		ЗаполнитьПараметр(ОбластьШапка, "Организация_2", Организация_2);
		АдресОрганизация_1 = "";
		АдресОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательАдрес, 65, АдресОрганизация_1 , АдресОрганизация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_1", АдресОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_2", АдресОрганизация_2);
		ДопИнформацияОрганизация_1 = "";
		ДопИнформацияОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательДопИнформация, 20, ДопИнформацияОрганизация_1 , ДопИнформацияОрганизация_2);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_1", ДопИнформацияОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_2", ДопИнформацияОрганизация_2);
		Квитанция.Вывести(ОбластьШапка);
		
		// ОбластьРаздел2Шапка.
		ТабДокуРаздел2 = Новый ТабличныйДокумент;
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Шапка);

		// ОбластьРаздел2Строка.
		Если ПолучательПлатежа924 Тогда
			
			ТабПечатиПолучатели = мТаблицаПечати.Скопировать(,
			"ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			ТабПечатиПолучатели.Свернуть("ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			Для Каждого Стр Из ТабПечатиПолучатели Цикл	// Обход Получателей.
				МассивУслугиПоставщика =  мТаблицаПечати.НайтиСтроки(Новый Структура("ПолучательПлатежа",Стр.ПолучательПлатежа));
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа = Стр.ПолучательПлатежаИмя;
				
				ТекстПолучательСчет = "";
				Если ЗначениеЗаполнено(Стр.ПолучательРС)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательИНН)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКПП)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБанк)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКоррСчет)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБИК) Тогда
					
					ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
					|Банк: %4
					|Корр.счет.\БИК: %5'");
					
					ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
													Стр.ПолучательРС,
													Стр.ПолучательИНН,
													Стр.ПолучательКПП,
													Стр.ПолучательБанк,
													Стр.ПолучательКоррСчет + " \ " + Стр.ПолучательБИК);
					
				КонецЕсли;
				
				ОбластьРаздел2Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
				
				КОплатеЗаМесяц = 0;
				ВидУслуги	   = "";
				
				Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
					Если СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
						Продолжить;
					КонецЕсли;
					КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
					ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
				КонецЦикла;
				ОбластьРаздел2Строка.Параметры.ВидУслуги	  = ВидУслуги;
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если НеПечататьУслугиБезНачислений
					И КОплатеЗаМесяц = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Стр.ПолучательБИК) И ЗначениеЗаполнено(Стр.ПолучательРС) Тогда
					НовыйПлучатель = ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа = Стр.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка			 = Стр.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет	 = Стр.ПолучательРС;
					НовыйПлучатель.КОплатеЗаМесяц	 = Стр.КОплатеЗаМесяц;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
			КонецЦикла;
			
		Иначе
				ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
				|Банк: %4
				|Корр.счет.\БИК: %5'");
				ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
												мСтруктураДанных.ПолучательРС,
												мСтруктураДанных.ПолучательИНН,
												мСтруктураДанных.ПолучательКПП,
												мСтруктураДанных.ПолучательБанк,
												мСтруктураДанных.ПолучательКоррСчет2 + " \ " + мСтруктураДанных.ПолучательБИК);
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ПолучательПлатежа,"Наименование");
				ОбластьРаздел2Строка.Параметры.ПолучательСчет		= ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет			= Строка(мСтруктураДанных.ЛицевойСчет); 
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц		= Формат(мСтруктураДанных.КОплатеЗаМесяц - ИтогоКапКОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если ЗначениеЗаполнено(мСтруктураДанных.ПолучательБИК) И ЗначениеЗаполнено(мСтруктураДанных.ПолучательРС) Тогда
					НовыйПлучатель						= ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа	= ЭтотОбъект.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка				= мСтруктураДанных.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет		= мСтруктураДанных.ПолучательРС;
					НовыйПлучатель.КОплатеЗаМесяц		= мСтруктураДанных.КОплатеЗаМесяц - ИтогоКапКОплатеЗаМесяц;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
		КонецЕсли; //ПолучательПлатежа924.
		
		// ОбластьРаздел2Итог.
		ОбластьРаздел2Итог.Параметры.Заполнить(мСтруктураДанных);
		ОбластьРаздел2Итог.Параметры.ДатаПоследнейОплаты = мСтруктураДанных.ДатаПоследнейОплатыНеКапРем;
		ОбластьРаздел2Итог.Параметры.Коплате = мСтруктураДанных.Коплате - ИтогоКапКОплате;	// Корректировка итогов за вычетом кап ремонта.
		
		Если мСтруктураДанных.Сальдо > 0 Тогда
			ОбластьРаздел2Итог.Параметры.Авансы = 0;
			ОбластьРаздел2Итог.Параметры.Долг	= мСтруктураДанных.Сальдо;
		ИначеЕсли мСтруктураДанных.Сальдо < 0 Тогда
			ОбластьРаздел2Итог.Параметры.Авансы = -мСтруктураДанных.Сальдо;
			ОбластьРаздел2Итог.Параметры.Долг	= 0;
		Иначе
			ОбластьРаздел2Итог.Параметры.Авансы = 0;
			ОбластьРаздел2Итог.Параметры.Долг	= 0;
		КонецЕсли;
		
		Если ИтогоКапЗакрытиеВхДолга <> 0 Тогда
			Долг	= 0;
			Авансы	= 0;
			Если мСтруктураДанных.Сальдо > 0 Тогда
				Долг = мСтруктураДанных.Сальдо - ИтогоКапЗакрытиеВхДолга;
			ИначеЕсли мСтруктураДанных.Сальдо < 0 Тогда
				Авансы = -мСтруктураДанных.Сальдо + ИтогоКапЗакрытиеВхДолга;
			КонецЕсли;
			
			Если Долг > 0 Тогда
				ОбластьРаздел2Итог.Параметры.Долг = Долг;
				ОбластьРаздел2Итог.Параметры.Авансы = 0;
			ИначеЕсли Авансы > 0 Тогда
				ОбластьРаздел2Итог.Параметры.Долг = 0;
				ОбластьРаздел2Итог.Параметры.Авансы = Авансы;
			КонецЕсли;
		КонецЕсли; 
	
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Итог);
		
		Квитанция.Присоединить(ТабДокуРаздел2);
		
		// ОбластьРаздел34Шапка.
		Квитанция.Вывести(ОбластьРаздел34Шапка);
		
		// Строки Раздел34.
		ТабДокСодержаниеРемонтУсл = Новый ТабличныйДокумент;
		ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрокаГрСодержание);
		
		ТабДокКоммунальныеУсл = Новый ТабличныйДокумент;
		ТабДокКоммунальныеУсл.Вывести(ОбластьСтрокаГрКоммунальные);
		
		ТабДокПрочиеУсл	= Новый ТабличныйДокумент;
		ТабДокПрочиеУсл.Вывести(ОбластьСтрокаГрПрочие);
		
		Для каждого СтрокаПечати Из мТаблицаПечати Цикл
			
			Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ СтрокаПечати.ОбщедомовыеНачисления Тогда
				
				СтрокаПечати.ОбъемИнд = СтрокаПечати.ОбъемИнд + СтрокаПечати.ОбъемОбщДом;
				СтрокаПечати.ОбъемОбщДом = 0;
				
				СтрокаПечати.НачисленоИнд = СтрокаПечати.НачисленоИнд + СтрокаПечати.НачисленоОбщДом;
				СтрокаПечати.НачисленоОбщДом = 0;
				
				СтрокаПечати.ИтогоОбъемИнд = СтрокаПечати.ИтогоОбъемИнд + СтрокаПечати.ИтогоОбъемОбщедомовых;
				СтрокаПечати.ИтогоОбъемОбщедомовых = 0;
				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаПечати);
			
			Если НЕ (мТаблицаПлатежиГИСЖКХ36 = Неопределено
				ИЛИ мТаблицаПлатежиГИСЖКХДПД = Неопределено) Тогда
				ЗаполнитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
				ЗаполнитьТаблицаПлатежиГИСЖКХДПД(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
			КонецЕсли;
			
			Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
				
				Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
					ОбновитьТаблицаПлатежиГИСЖКХ12Получатели(ТаблицаПлатежиГИСЖКХ12Получатели, СтрокаПечати);
				КонецЕсли;
				
				Продолжить;
			ИначеЕсли СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание")
				ИЛИ СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм") Тогда
				
				ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрока);
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПечати.ГрафаОтчетаГЦЖС) Тогда	
				
				ТабДокПрочиеУсл.Вывести(ОбластьСтрока);
			Иначе 
				
				ТабДокКоммунальныеУсл.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ТабДокСодержаниеРемонтУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокСодержаниеРемонтУсл);
		КонецЕсли;
		Если  ТабДокКоммунальныеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокКоммунальныеУсл);
		КонецЕсли;
		Если ТабДокПрочиеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокПрочиеУсл);
		КонецЕсли;
		
		ОбластьИтог.Параметры.Заполнить(мСтруктураДанных);
		ОбластьИтог.Параметры.КОплатеЗаМесяц = мСтруктураДанных.КОплатеЗаМесяц - ИтогоКапКОплатеЗаМесяц;	// Корректировка итогов за вычетом кап ремонта.
		
		Квитанция.Вывести(ОбластьИтог);
		Квитанция.Вывести(ОбластьУказания);
		
		// ОбластьРаздел5.
		ТабДокуРаздел5 = Неопределено;
		Если мТаблицаПерерасчетов.Количество() > 0 Тогда
			
			ТабДокуРаздел5 = Новый ТабличныйДокумент;
			ТабДокуРаздел5.Вывести(ОбластьПустаяСтрока);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Заголовок);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Шапка);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5НомКолонок);
			
			Для каждого СтрокаСведений Из мТаблицаПерерасчетов Цикл
				
				ОбластьРаздел5Строка.Параметры.Заполнить(СтрокаСведений);
				Если ИспользоватьКомментарийКакОснование Тогда
					ОбластьРаздел5Строка.Параметры.Основание = СтрокаСведений.Комментарий;
				КонецЕсли; 
				
				ОбновитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаСведений, ИспользоватьКомментарийКакОснование);
				
				ТабДокуРаздел5.Вывести(ОбластьРаздел5Строка);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ ТабДокуРаздел5 = Неопределено Тогда
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел5) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел5);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел5);
			КонецЕсли;  
		КонецЕсли; 
		
		// ОбластьРаздел7.
		ТабДокуРаздел7 = Неопределено;
		Если ТабПечатиКап.Количество() > 0 Тогда
			
			ТабДокуРаздел7 = Новый ТабличныйДокумент;
			ТабДокуРаздел7.Вывести(ОбластьРаздел7Шапка);
			Для каждого СтрокаПечати Из ТабПечатиКап Цикл
				
				Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьРаздел7Строка.Параметры.Заполнить(СтрокаПечати);
				ТабДокуРаздел7.Вывести(ОбластьРаздел7Строка);
				
			КонецЦикла; 
		КонецЕсли;
		
		Если НЕ ТабДокуРаздел7 = Неопределено 
			И ТабДокуРаздел7.ВысотаТаблицы > 7 Тогда // Есть записи.
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел7) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел7);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел7);
			КонецЕсли;  
		КонецЕсли; 
		
		// ОбластьРаздел8.
		ТабДокуРаздел8 = Неопределено;
		Если ТабПечатиКап.Количество() > 0 Тогда
			ТабДокуРаздел8 = Новый ТабличныйДокумент;
			ТабДокуРаздел8.Вывести(ОбластьРаздел8Шапка);
			
			ТабПечатиПолучателиКап = ТабПечатиКап.Скопировать(,
				"КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
			
			ТабПечатиПолучателиКап.Свернуть("КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
			
			Для Каждого Стр Из ТабПечатиПолучателиКап Цикл	// Обход Получателей.
				МассивУслугиПоставщика =  ТабПечатиКап.НайтиСтроки(Новый Структура("КапПолучательПлатежа",Стр.КапПолучательПлатежа));
				
				ОбластьРаздел8Строка.Параметры.ПолучательПлатежа = Стр.КапПолучательПлатежаИмя;
				
				ТекстПолучательСчет = "";
				Если ЗначениеЗаполнено(Стр.КапПолучательРС)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательИНН)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКПП)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБанк)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКоррСчет)
					ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБИК) Тогда
					
					ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
					|Банк: %4
					|Корр.счет.\БИК: %5'");
					
					ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
													Стр.КапПолучательРС,
													Стр.КапПолучательИНН,
													Стр.КапПолучательКПП,
													Стр.КапПолучательБанк,
													Стр.КапПолучательКоррСчет + " \ " + Стр.КапПолучательБИК);
					
				КонецЕсли;
				
				ОбластьРаздел8Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
				ОбластьРаздел8Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
				
				КОплатеЗаМесяц = 0;
				ВидУслуги	   = "";
				
				Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
					Если НЕ СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
						Продолжить;
					КонецЕсли;
					КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
					ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
				КонецЦикла;
				ОбластьРаздел8Строка.Параметры.ВидУслуги	  = ВидУслуги;
				ОбластьРаздел8Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если НеПечататьУслугиБезНачислений
					И КОплатеЗаМесяц = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ТабДокуРаздел8.Вывести(ОбластьРаздел8Строка);
			КонецЦикла;
			
			ОбластьРаздел8Итог.Параметры.ДатаПоследнейОплаты = мСтруктураДанных.ДатаПоследнейОплатыКапРем;
			ОбластьРаздел8Итог.Параметры.Коплате = ИтогоКапКОплате;
			Если ИтогоКапЗакрытиеВхДолга >= 0 Тогда
				ОбластьРаздел8Итог.Параметры.ДолгСУчетомОплаты = ИтогоКапЗакрытиеВхДолга;
			Иначе
				ОбластьРаздел8Итог.Параметры.Авансы = ИтогоКапЗакрытиеВхДолга * -1;
			КонецЕсли;
			
			ТабДокуРаздел8.Вывести(ОбластьРаздел8Итог);
		КонецЕсли;
	
		Если НЕ ТабДокуРаздел8 = Неопределено 
			И ТабДокуРаздел8.ВысотаТаблицы > 14 Тогда
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел8) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел8);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел8);
			КонецЕсли;  
		КонецЕсли; 
		
		
	Иначе	// НЕ мКэшПараметрыЖКХ.РаздельныйУчетКапРемонта.
		
		ТабПечатиКап = мТаблицаПечати.Скопировать(Новый Структура("ГрафаОтчетаГЦЖС", ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт")));
		мСтруктураДанных.ПереплатаНаНачало = мСтруктураДанных.ПереплатаНаНачало + мСтруктураДанных.Оплата;
		ОбластьЗаголовок.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьЗаголовок);
		
		// ОбластьШапка.
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ОбластьШапка.Параметры.Заполнить(мКэшПолучателяПлатежа);
		Организация_1 = "";
		Организация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательПредставление, 59, Организация_1 , Организация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "Организация_1", Организация_1);
		ЗаполнитьПараметр(ОбластьШапка, "Организация_2", Организация_2);
		АдресОрганизация_1 = "";
		АдресОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательАдрес, 65, АдресОрганизация_1 , АдресОрганизация_2 );
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_1", АдресОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "АдресОрганизация_2", АдресОрганизация_2);
		ДопИнформацияОрганизация_1 = "";
		ДопИнформацияОрганизация_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ПолучательДопИнформация, 20, ДопИнформацияОрганизация_1 , ДопИнформацияОрганизация_2);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_1", ДопИнформацияОрганизация_1);
		ЗаполнитьПараметр(ОбластьШапка, "ДопИнформацияОрганизация_2", ДопИнформацияОрганизация_2);
		Квитанция.Вывести(ОбластьШапка);
		
		// ОбластьРаздел2Шапка.
		ТабДокуРаздел2 = Новый ТабличныйДокумент;
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Шапка);

		// ОбластьРаздел2Строка.
		Если ПолучательПлатежа924 Тогда
			
			ТабПечатиПолучатели = мТаблицаПечати.Скопировать(,
			"ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			ТабПечатиПолучатели.Свернуть("ПолучательПлатежа, ПолучательПлатежаИмя,ПолучательИНН,ПолучательКПП,ПолучательРС,ПолучательКоррСчет,ПолучательБИК,ПолучательБанк");
			
			Для Каждого Стр Из ТабПечатиПолучатели Цикл	// Обход Получателей.
				МассивУслугиПоставщика =  мТаблицаПечати.НайтиСтроки(Новый Структура("ПолучательПлатежа",Стр.ПолучательПлатежа));
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа = Стр.ПолучательПлатежаИмя;
				
				ТекстПолучательСчет = "";
				Если ЗначениеЗаполнено(Стр.ПолучательРС)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательИНН)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКПП)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБанк)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательКоррСчет)
					ИЛИ ЗначениеЗаполнено(Стр.ПолучательБИК) Тогда
					
					ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
					|Банк: %4
					|Корр.счет.\БИК: %5'");
					
					ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
													Стр.ПолучательРС,
													Стр.ПолучательИНН,
													Стр.ПолучательКПП,
													Стр.ПолучательБанк,
													Стр.ПолучательКоррСчет + " \ " + Стр.ПолучательБИК);
					
				КонецЕсли;
				
				ОбластьРаздел2Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
				
				КОплатеЗаМесяц = 0;
				ВидУслуги	   = "";
				
				Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
					Если СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
						Продолжить;
					КонецЕсли;
					КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
					ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
				КонецЦикла;
				ОбластьРаздел2Строка.Параметры.ВидУслуги	  = ВидУслуги;
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если ЗначениеЗаполнено(Стр.ПолучательБИК) И ЗначениеЗаполнено(Стр.ПолучательРС) Тогда
					НовыйПлучатель = ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа= Стр.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка			= Стр.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет	= Стр.ПолучательРС;
					НовыйПлучатель.КОплатеЗаМесяц	= КОплатеЗаМесяц;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
			КонецЦикла;
			
			Если ТабПечатиКап.Количество() > 0 Тогда // Данные по кап ремонту.
				
				ТабПечатиПолучателиКап = ТабПечатиКап.Скопировать(,
				"КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
				
				ТабПечатиПолучателиКап.Свернуть("КапПолучательПлатежа,КапПолучательПлатежаИмя,КапПолучательИНН,КапПолучательКПП,КапПолучательРС,КапПолучательКоррСчет,КапПолучательБИК,КапПолучательБанк");
				
				Для Каждого Стр Из ТабПечатиПолучателиКап Цикл	// Обход Получателей.
					МассивУслугиПоставщика =  ТабПечатиКап.НайтиСтроки(Новый Структура("КапПолучательПлатежа",Стр.КапПолучательПлатежа));
					
					ОбластьРаздел2Строка.Параметры.ПолучательПлатежа = Стр.КапПолучательПлатежаИмя;
					
					ТекстПолучательСчет = "";
					Если ЗначениеЗаполнено(Стр.КапПолучательРС)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательИНН)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКПП)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБанк)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательКоррСчет)
						ИЛИ ЗначениеЗаполнено(Стр.КапПолучательБИК) Тогда
						
						ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
						|Банк: %4
						|Корр.счет.\БИК: %5'");
						
						ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
														Стр.КапПолучательРС,
														Стр.КапПолучательИНН,
														Стр.КапПолучательКПП,
														Стр.КапПолучательБанк,
														Стр.КапПолучательКоррСчет + " \ " + Стр.КапПолучательБИК);
						
					КонецЕсли;
					
					ОбластьРаздел2Строка.Параметры.ПолучательСчет = ТекстПолучательСчет;
					ОбластьРаздел2Строка.Параметры.ЛицевойСчет = Строка(мСтруктураДанных.ЛицевойСчет); 
					
					КОплатеЗаМесяц = 0;
					ВидУслуги	   = "";
					
					Для Каждого СтрУслуга Из МассивУслугиПоставщика Цикл	// Группировка  услуг поставщиков.
						Если НЕ СтрУслуга.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
							Продолжить;
						КонецЕсли;
						КОплатеЗаМесяц = КОплатеЗаМесяц + СтрУслуга.КОплатеЗаМесяц;
						ВидУслуги = ?(ПустаяСтрока(ВидУслуги),ВидУслуги, ВидУслуги + ", ") + Строка(СтрУслуга.УслугаПредставление);  
					КонецЦикла;
					ОбластьРаздел2Строка.Параметры.ВидУслуги	  = ВидУслуги;
					ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц = Формат(КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
					
					Если ЗначениеЗаполнено(Стр.КапПолучательБИК) И ЗначениеЗаполнено(Стр.КапПолучательРС) Тогда
						НовыйПлучатель = ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
						НовыйПлучатель.ПолучательПлатежа= Стр.КапПолучательПлатежа;
						НовыйПлучатель.БИКБанка			= Стр.КапПолучательБИК;
						НовыйПлучатель.РасчетныйСчет	= Стр.КапПолучательРС;
						НовыйПлучатель.КОплатеЗаМесяц	= КОплатеЗаМесяц;
					КонецЕсли;
					
					ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
				КонецЦикла;
			КонецЕсли;
			
		Иначе
				ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
				|Банк: %4
				|Корр.счет.\БИК: %5'");
				ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
												мСтруктураДанных.ПолучательРС,
												мСтруктураДанных.ПолучательИНН,
												мСтруктураДанных.ПолучательКПП,
												мСтруктураДанных.ПолучательБанк,
												мСтруктураДанных.ПолучательКоррСчет2 + " \ " + мСтруктураДанных.ПолучательБИК);
				
				ОбластьРаздел2Строка.Параметры.ПолучательПлатежа	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ПолучательПлатежа,"Наименование");
				ОбластьРаздел2Строка.Параметры.ПолучательСчет		= ТекстПолучательСчет;
				ОбластьРаздел2Строка.Параметры.ЛицевойСчет			= Строка(мСтруктураДанных.ЛицевойСчет); 
				ОбластьРаздел2Строка.Параметры.КОплатеЗаМесяц		= Формат(мСтруктураДанных.КОплатеЗаМесяц, "ЧДЦ=2; ЧН=0,00");
				
				Если ЗначениеЗаполнено(мСтруктураДанных.ПолучательБИК) И ЗначениеЗаполнено(мСтруктураДанных.ПолучательРС) Тогда
					НовыйПлучатель						= ТаблицаПлатежиГИСЖКХ12Получатели.Добавить();
					НовыйПлучатель.ПолучательПлатежа	= ЭтотОбъект.ПолучательПлатежа;
					НовыйПлучатель.БИКБанка				= мСтруктураДанных.ПолучательБИК;
					НовыйПлучатель.РасчетныйСчет		= мСтруктураДанных.ПолучательРС;
				КонецЕсли;
				
				ТабДокуРаздел2.Вывести(ОбластьРаздел2Строка);
		КонецЕсли; //ПолучательПлатежа924
	
		// ОбластьРаздел2Итог.
		ОбластьРаздел2Итог.Параметры.Заполнить(мСтруктураДанных);
		ОбластьРаздел2Итог.Параметры.ДатаПоследнейОплаты = мСтруктураДанных.ДатаПоследнейОплаты;
		
		Если мСтруктураДанных.Сальдо > 0 Тогда
			ОбластьРаздел2Итог.Параметры.Авансы = 0;
			ОбластьРаздел2Итог.Параметры.Долг	= мСтруктураДанных.Сальдо;
		ИначеЕсли мСтруктураДанных.Сальдо < 0 Тогда
			ОбластьРаздел2Итог.Параметры.Авансы = -мСтруктураДанных.Сальдо;
			ОбластьРаздел2Итог.Параметры.Долг	= 0;
		Иначе
			ОбластьРаздел2Итог.Параметры.Авансы = 0;
			ОбластьРаздел2Итог.Параметры.Долг	= 0;
		КонецЕсли;
		
		ТабДокуРаздел2.Вывести(ОбластьРаздел2Итог);
		
		Квитанция.Присоединить(ТабДокуРаздел2);
		
		// ОбластьРаздел34Шапка.
		Квитанция.Вывести(ОбластьРаздел34Шапка);
		
		// Строки Раздел34.
		ТабДокСодержаниеРемонтУсл = Новый ТабличныйДокумент;
		ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрокаГрСодержание);

		ТабДокКоммунальныеУсл = Новый ТабличныйДокумент;
		ТабДокКоммунальныеУсл.Вывести(ОбластьСтрокаГрКоммунальные);

		ТабДокПрочиеУсл	= Новый ТабличныйДокумент;
		ТабДокПрочиеУсл.Вывести(ОбластьСтрокаГрПрочие);

		Для каждого СтрокаПечати Из мТаблицаПечати Цикл
			
			Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ СтрокаПечати.ОбщедомовыеНачисления Тогда
				
				СтрокаПечати.ОбъемИнд = СтрокаПечати.ОбъемИнд + СтрокаПечати.ОбъемОбщДом;
				СтрокаПечати.ОбъемОбщДом = 0;
				
				СтрокаПечати.НачисленоИнд = СтрокаПечати.НачисленоИнд + СтрокаПечати.НачисленоОбщДом;
				СтрокаПечати.НачисленоОбщДом = 0;
				
				СтрокаПечати.ИтогоОбъемИнд = СтрокаПечати.ИтогоОбъемИнд + СтрокаПечати.ИтогоОбъемОбщедомовых;
				СтрокаПечати.ИтогоОбъемОбщедомовых = 0;
				
				СтрокаПечати.НачисленоОбщДом = 0;     				 
				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаПечати);
			
			Если НЕ (мТаблицаПлатежиГИСЖКХ36 = Неопределено
				ИЛИ мТаблицаПлатежиГИСЖКХДПД = Неопределено) Тогда
				ЗаполнитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
				ЗаполнитьТаблицаПлатежиГИСЖКХДПД(мСтруктураДанных.ЛицевойСчет, СтрокаПечати);
			КонецЕсли;
			
			Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание")
				ИЛИ СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм")
				ИЛИ СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
				
				ТабДокСодержаниеРемонтУсл.Вывести(ОбластьСтрока);
				
				Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
					ОбновитьТаблицаПлатежиГИСЖКХ12Получатели(ТаблицаПлатежиГИСЖКХ12Получатели, СтрокаПечати);
				КонецЕсли;
				
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПечати.ГрафаОтчетаГЦЖС) Тогда	
				
				ТабДокПрочиеУсл.Вывести(ОбластьСтрока);
			Иначе 
				
				ТабДокКоммунальныеУсл.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ТабДокСодержаниеРемонтУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокСодержаниеРемонтУсл);
		КонецЕсли;
		
		Если ТабДокКоммунальныеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокКоммунальныеУсл);
		КонецЕсли;
		
		Если ТабДокПрочиеУсл.ВысотаТаблицы > 1 Тогда
			Квитанция.Вывести(ТабДокПрочиеУсл);
		КонецЕсли;
		
		ОбластьИтог.Параметры.Заполнить(мСтруктураДанных);
		Квитанция.Вывести(ОбластьИтог);
		Квитанция.Вывести(ОбластьУказания);
		
		// ОбластьРаздел5.
		ТабДокуРаздел5 = Неопределено;
		Если мТаблицаПерерасчетов.Количество() > 0 Тогда
			
			ТабДокуРаздел5 = Новый ТабличныйДокумент;
			ТабДокуРаздел5.Вывести(ОбластьПустаяСтрока);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Заголовок);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5Шапка);
			ТабДокуРаздел5.Вывести(ОбластьРаздел5НомКолонок);
			
			Для каждого СтрокаСведений Из мТаблицаПерерасчетов Цикл
				
				ОбластьРаздел5Строка.Параметры.Заполнить(СтрокаСведений);
				Если ИспользоватьКомментарийКакОснование Тогда
					ОбластьРаздел5Строка.Параметры.Основание = СтрокаСведений.Комментарий;
				КонецЕсли; 
				
				ОбновитьТаблицаПлатежиГИСЖКХ36(мСтруктураДанных.ЛицевойСчет, СтрокаСведений, ИспользоватьКомментарийКакОснование);
				
				ТабДокуРаздел5.Вывести(ОбластьРаздел5Строка);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ ТабДокуРаздел5 = Неопределено Тогда
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Квитанция, ТабДокуРаздел5) Тогда
				Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
				Квитанция.Вывести(ТабДокуРаздел5);
			Иначе
				Квитанция.Вывести(ТабДокуРаздел5);
			КонецЕсли;  
		КонецЕсли; 

	КонецЕсли; //Конец условия мКэшПараметрыЖКХ.РаздельныйУчетКапРемонта.

	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Квитанция, ОбластьШтрихкодQR);
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	// Платежные документы ГИС ЖКХ 1-2.
	Если мТаблицаПлатежиГИСЖКХ12 = Неопределено Тогда
		Возврат Квитанция;	
	КонецЕсли;
	
	Попытка
		ЗадолженностьЗаПредыдущиеПериоды = ОбластьРаздел2Итог.Параметры.Долг;
	Исключение
		ЗадолженностьЗаПредыдущиеПериоды = 0;
	КонецПопытки;
	
	Попытка
		АвансНаНачалоПериода = ОбластьРаздел2Итог.Параметры.Авансы;
	Исключение
		АвансНаНачалоПериода = 0;
	КонецПопытки;
	
	Попытка
		ИтогоКОплатеЗаРС = ОбластьИтог.Параметры.КОплатеЗаМесяц;
	Исключение
		ИтогоКОплатеЗаРС = 0;
	КонецПопытки;
	
	Попытка
		ИтогоКОплатеЗаРССальдо = ОбластьРаздел2Итог.Параметры.Коплате;
	Исключение
		ИтогоКОплатеЗаРССальдо = 0;
	КонецПопытки;
	
	Для Каждого Стр Из ТаблицаПлатежиГИСЖКХ12Получатели Цикл
				
		СтрПлатежГИСЖКХ = мТаблицаПлатежиГИСЖКХ12.Добавить();
		СтрПлатежГИСЖКХ.ЛицевойСчет						= мСтруктураДанных.ЛицевойСчет;
		СтрПлатежГИСЖКХ.ИдентификаторЖКУ				= мСтруктураДанных.ИдентификаторЖКУ;
		//СтрПлатежГИСЖКХ.ТипПД							= ?(ШаблонИзвещений.Сальдо = Перечисления.ДаНет.Да, "Долговой", "Текущий");
		СтрПлатежГИСЖКХ.РасчетныйПериод					= мСтруктураДанных.Дата;
		СтрПлатежГИСЖКХ.ЗадолженностьЗаПредыдущиеПериоды= ?(ЗначениеЗаполнено(ЗадолженностьЗаПредыдущиеПериоды), ЗадолженностьЗаПредыдущиеПериоды, 0);
		СтрПлатежГИСЖКХ.АвансНаНачалоПериода	 		= ?(ЗначениеЗаполнено(АвансНаНачалоПериода), АвансНаНачалоПериода, 0);
		СтрПлатежГИСЖКХ.Оплачено						= мСтруктураДанных.Оплата;
		СтрПлатежГИСЖКХ.ЧислоРасчетногоПериода			= День(КонецМесяца(мСтруктураДанных.Дата));
		СтрПлатежГИСЖКХ.ДатаПоследнейОплаты				= мСтруктураДанных.ДатаПоследнейОплатыНеКапРемГИСЖКХ;
		СтрПлатежГИСЖКХ.ДатаПоследнейОплатыКапРем		= мСтруктураДанных.ДатаПоследнейОплатыКапРемГИСЖКХ;
		СтрПлатежГИСЖКХ.ИтогоКОплатеЗаРС				= ?(ЗначениеЗаполнено(ИтогоКОплатеЗаРС), ИтогоКОплатеЗаРС, 0);
		СтрПлатежГИСЖКХ.ИтогоКОплатеЗаРССальдо			= ?(ЗначениеЗаполнено(ИтогоКОплатеЗаРССальдо), ИтогоКОплатеЗаРССальдо, 0);
		СтрПлатежГИСЖКХ.ИтогПени						= мСтруктураДанных.ИтогПени;
		
		ЗаполнитьЗначенияСвойств(СтрПлатежГИСЖКХ, Стр);
		СтрПлатежГИСЖКХ.ТабличнйДокумент = Квитанция;
		
	КонецЦикла;
	
	ЗаполнитьТаблицаПлатежиГИСЖКХНеустойки(мСтруктураДанных.ЛицевойСчет, мСтруктураДанных.НачисленоПениЗаПериод, мСтруктураДанных.ИтогПени);
	
	Возврат Квитанция;
	
КонецФункции

Функция ПечатьПлатежныйДокументРК43() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьЗаголовок						= мМакет.ПолучитьОбласть("Заголовок");
	ОбластьРаздел1							= мМакет.ПолучитьОбласть("Раздел1");
	ОбластьРаздел2Шапка						= мМакет.ПолучитьОбласть("Раздел2Шапка");
	ОбластьРаздел2Строка					= мМакет.ПолучитьОбласть("Раздел2Строка");
	ОбластьРаздел3Шапка						= мМакет.ПолучитьОбласть("Раздел3Шапка");
	ОбластьРаздел3ГруппаСодержание			= мМакет.ПолучитьОбласть("Раздел3ГруппаСодержание");
	ОбластьРаздел3ГруппаКоммунальные		= мМакет.ПолучитьОбласть("Раздел3ГруппаКоммунальные");
	ОбластьРаздел3СтрокаКапитальныйРемонт	= мМакет.ПолучитьОбласть("Раздел3СтрокаКапитальныйРемонт");
	ОбластьРаздел3ПрочиеУслуги				= мМакет.ПолучитьОбласть("Раздел3ПрочиеУслуги");
	ОбластьРаздел3Строка					= мМакет.ПолучитьОбласть("Раздел3Строка");
	ОбластьРаздел3СтрокаИтогоЗаПериод		= мМакет.ПолучитьОбласть("Раздел3СтрокаИтогоЗаПериод");
	ОбластьРаздел3СтрокаИтого				= мМакет.ПолучитьОбласть("Раздел3СтрокаИтого");
	ОбластьРаздел4Шапка						= мМакет.ПолучитьОбласть("Раздел4Шапка");
	ОбластьРаздел4Строка					= мМакет.ПолучитьОбласть("Раздел4Строка");
	ОбластьРаздел4СтрокаПредельный			= мМакет.ПолучитьОбласть("Раздел4СтрокаПредельный");
	ОбластьРаздел6Шапка						= мМакет.ПолучитьОбласть("Раздел6Шапка");
	ОбластьРаздел6Строка					= мМакет.ПолучитьОбласть("Раздел6Строка");
	
	Попытка
		ОбластьШапкаПолучатель = мМакет.ПолучитьОбласть("ШапкаПолучатель");
	Исключение
		ОбластьШапкаПолучатель = Неопределено
	КонецПопытки;
	
	Попытка
		ОбластьПолучательСтрока = мМакет.ПолучитьОбласть("ПолучательСтрока");
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьQRКод = мМакет.ПолучитьОбласть("ОбластьQRКод")
	Исключение
	КонецПопытки;
	
	// Заголовок.
	ОбластьЗаголовок.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьЗаголовок);
	
	// Раздел1.
	ОбластьРаздел1.Параметры.Заполнить(мСтруктураДанных);
	
	ДлинаСтрокиЛицевойСчетАдрес = СтрДлина(мСтруктураДанных.ЛицевойСчетАдрес);
	Если ДлинаСтрокиЛицевойСчетАдрес < 92 Тогда
		
		ЛицевойСчетАдрес1 = мСтруктураДанных.ЛицевойСчетАдрес;
		ЛицевойСчетАдрес2 = "";
		
	Иначе
		// Разбиваем строку на две подстроки, таким образом чтобы первая строка была не более 92 символов
		// Для этого ищем очередной пробел и проверяем длину строк в предположении, что перенос будет выполнен по найденной позиции.
		ЛицевойСчетАдрес2 = мСтруктураДанных.ЛицевойСчетАдрес;
		ПозицияПоиска = СтрНайти(ЛицевойСчетАдрес2," ")+1;
		
		// Если найден очередной пробел и длина первой строки после операции будет менее 92 символов, то выполняем еще одну итерацию.
		Пока ПозицияПоиска > 1 И ДлинаСтрокиЛицевойСчетАдрес - СтрДлина(ЛицевойСчетАдрес2) + ПозицияПоиска < 92 Цикл
			
			ЛицевойСчетАдрес2 = Сред(ЛицевойСчетАдрес2, ПозицияПоиска);
			ПозицияПоиска       = СтрНайти(ЛицевойСчетАдрес2," ")+1;
			
		КонецЦикла; 
		
		ЛицевойСчетАдрес1 = Лев(мСтруктураДанных.ЛицевойСчетАдрес,ДлинаСтрокиЛицевойСчетАдрес - СтрДлина(ЛицевойСчетАдрес2));
		
	КонецЕсли; 
	
	СтруктураАдресаЛС = Новый Структура;
	СтруктураАдресаЛС.Вставить("ЛицевойСчетАдрес1", ЛицевойСчетАдрес1);
	СтруктураАдресаЛС.Вставить("ЛицевойСчетАдрес2", ЛицевойСчетАдрес2);
	ОбластьРаздел1.Параметры.Заполнить(СтруктураАдресаЛС);
	Квитанция.Вывести(ОбластьРаздел1);
	
	// Раздел2/Раздел4.
	ТабДокРаздел2 = Новый ТабличныйДокумент;
	ТабДокРаздел2.Вывести(ОбластьРаздел2Шапка);
	ТабДокРаздел4 = Новый ТабличныйДокумент;
	ТабДокРаздел4.Вывести(ОбластьРаздел4Шапка);

	Если мТаблицаПечатиСчетчиков.Количество() = 0 Тогда
		ТабДокРаздел2.Вывести(ОбластьРаздел2Строка);
	Иначе
		Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
				ОбластьРаздел2Строка.Параметры.Заполнить(СтрокаТаблицы);
				ТабДокРаздел2.Вывести(ОбластьРаздел2Строка);
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.Счетчик)  Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеСправочнойИнформации = Новый Структура;
				ДанныеСправочнойИнформации.Вставить("ИтогоОбъемОбщедомовых", СтрокаТаблицы.ОбъемОбщДом);
				ДанныеСправочнойИнформации.Вставить("КоличествоЕдиницИНД", СтрокаТаблицы.ДоПоказаний);
				
				ОбластьРаздел4Строка.Параметры.Заполнить(СтрокаТаблицы);
				ОбластьРаздел4Строка.Параметры.Заполнить(ДанныеСправочнойИнформации);
				
				ТабДокРаздел4.Вывести(ОбластьРаздел4Строка);
				
		КонецЦикла; 
	КонецЕсли;
	
	Если НЕ ОбластьШапкаПолучатель = Неопределено Тогда
		
		ТабДокПолучателяПлатежа = Новый ТабличныйДокумент;
		ТабДокПолучателяПлатежа.Вывести(ОбластьШапкаПолучатель);

		ДанныеПолучателяПлатежа = Новый Структура;
		Если ЗначениеЗаполнено(мСтруктураДанных.ПолучательРС)
			ИЛИ ЗначениеЗаполнено(мСтруктураДанных.ПолучательИНН)
			ИЛИ ЗначениеЗаполнено(мСтруктураДанных.ПолучательКПП)
			ИЛИ ЗначениеЗаполнено(мСтруктураДанных.ПолучательБанк)
			ИЛИ ЗначениеЗаполнено(мСтруктураДанных.ПолучательКоррСчет2)
			ИЛИ ЗначениеЗаполнено(мСтруктураДанных.ПолучательБИК) Тогда
			
			ТекстПолучательСчет = НСтр("ru='р/с: %1 ИНН: %2 КПП: %3
											|Банк: %4
											|Корр.счет.\БИК: %5'");
			ТекстПолучательСчет = СтрШаблон(ТекстПолучательСчет,
											мСтруктураДанных.ПолучательРС,
											мСтруктураДанных.ПолучательИНН,
											мСтруктураДанных.ПолучательКПП,
											мСтруктураДанных.ПолучательБанк,
											мСтруктураДанных.ПолучательКоррСчет2 + " \ " + мСтруктураДанных.ПолучательБИК);
			
			ДанныеПолучателяПлатежа.Вставить("ПолучательПлатежа", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ПолучательПлатежа,"Наименование"));
			ДанныеПолучателяПлатежа.Вставить("ПолучательСчет"	, ТекстПолучательСчет);
			ДанныеПолучателяПлатежа.Вставить("ЛицевойСчет"	, Строка(мСтруктураДанных.ЛицевойСчет));
		КонецЕсли;
		
		ОбластьПолучательСтрока.Параметры.Заполнить(ДанныеПолучателяПлатежа);
		ТабДокПолучателяПлатежа.Вывести(ОбластьПолучательСтрока);
		ТабДокРаздел2.Вывести(ТабДокПолучателяПлатежа);
		
	КонецЕсли;
	Квитанция.Присоединить(ТабДокРаздел2);
	
	// Раздел3.
	Квитанция.Вывести(ОбластьРаздел3Шапка);
	
	// Строки Раздел3.
	ТабДокСодержание = Новый ТабличныйДокумент;
	ТабДокСодержание.Вывести(ОбластьРаздел3ГруппаСодержание);
	
	ТабДокКоммунальныеУсл = Новый ТабличныйДокумент;
	ТабДокКоммунальныеУсл.Вывести(ОбластьРаздел3ГруппаКоммунальные);
	
	ТабДокКапРем = Новый ТабличныйДокумент;
	
	ТабДокПрочиеУсл	= Новый ТабличныйДокумент;
	ТабДокПрочиеУсл.Вывести(ОбластьРаздел3ПрочиеУслуги);
	
	Для каждого СтрокаПечати Из мТаблицаПечати Цикл
		
		Если НеПечататьУслугиБезНачислений(СтрокаПечати) Тогда
			Продолжить;
		КонецЕсли;
		
		КОплатеЗаМесяцСПени = Новый Структура("КОплатеЗаМесяцВсего", СтрокаПечати.КОплатеЗаМесяц + СтрокаПечати.Пени + СтрокаПечати.Сальдо);
		
		Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
			
			ОбластьРаздел3СтрокаКапитальныйРемонт.Параметры.Заполнить(СтрокаПечати);
			ОбластьРаздел3СтрокаКапитальныйРемонт.Параметры.Заполнить(КОплатеЗаМесяцСПени);
			ТабДокКапРем.Вывести(ОбластьРаздел3СтрокаКапитальныйРемонт);
			Продолжить;
		КонецЕсли;
		
		ОбластьРаздел3Строка.Параметры.Заполнить(СтрокаПечати);
		ОбластьРаздел3Строка.Параметры.Заполнить(КОплатеЗаМесяцСПени);
		Если СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание")
			ИЛИ СтрокаПечати.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм") Тогда
			
			ТабДокСодержание.Вывести(ОбластьРаздел3Строка);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПечати.ГрафаОтчетаГЦЖС) Тогда	
			
			ТабДокПрочиеУсл.Вывести(ОбластьРаздел3Строка);
		Иначе 
			
			ТабДокКоммунальныеУсл.Вывести(ОбластьРаздел3Строка);
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ТабДокСодержание.ВысотаТаблицы > 1 Тогда
		Квитанция.Вывести(ТабДокСодержание);
	КонецЕсли;
	
	Если  ТабДокКоммунальныеУсл.ВысотаТаблицы > 1 Тогда
		Квитанция.Вывести(ТабДокКоммунальныеУсл);
	КонецЕсли;
	
	Если ТабДокКапРем.ВысотаТаблицы > 0 Тогда
		Квитанция.Вывести(ТабДокКапРем);
	КонецЕсли;
	
	Если ТабДокПрочиеУсл.ВысотаТаблицы > 1 Тогда
		Квитанция.Вывести(ТабДокПрочиеУсл);
	КонецЕсли;
	
	ОбластьРаздел3СтрокаИтогоЗаПериод.Параметры.Заполнить(мСтруктураДанных);
	Квитанция.Вывести(ОбластьРаздел3СтрокаИтогоЗаПериод);
	
	ИтогоКОплате = Новый Структура("ИтогоКОплате", мСтруктураДанных.КОплатеЗаМесяц + мСтруктураДанных.ИтогПени + мСтруктураДанных.Сальдо);
	ОбластьРаздел3СтрокаИтого.Параметры.Заполнить(ИтогоКОплате);
	Квитанция.Вывести(ОбластьРаздел3СтрокаИтого);
	
	Квитанция.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Раздел 4.
	Для каждого Строка из мТаблицаОбщедомовыхСчетчиков Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Счетчик)  Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСправочнойИнформации = Новый Структура;
		ДанныеСправочнойИнформации.Вставить("ИтогоОбъемОбщедомовых", СтрокаТаблицы.ОбъемОбщДом);
		ДанныеСправочнойИнформации.Вставить("КоличествоЕдиницГУРП", СтрокаТаблицы.ДоПоказаний);
		ДанныеСправочнойИнформации.Вставить("ОбъемОбщийИнд", Строка.ИтогоОбъемИндИПУ + Строка.ИтогоОбъемИндНорматив);
		
		ОбластьРаздел4Строка.Параметры.Заполнить(Строка);
		ОбластьРаздел4Строка.Параметры.Заполнить(ДанныеСправочнойИнформации);
		
		ТабДокРаздел4.Вывести(ОбластьРаздел4Строка);
		
	КонецЦикла;	

	
	ТабДокРаздел4.Вывести(ОбластьРаздел4СтрокаПредельный);
	Квитанция.Вывести(ТабДокРаздел4);
	
	// Раздел 6.
	Если мТаблицаПерерасчетов.Количество() > 0 Тогда
		
		ТабДокРаздел6 = Новый ТабличныйДокумент;
		ТабДокРаздел6.Вывести(ОбластьРаздел6Шапка);
		
		Для каждого СтрокаСведений Из мТаблицаПерерасчетов Цикл
			
			ОбластьРаздел6Строка.Параметры.Заполнить(СтрокаСведений);
			Если ИспользоватьКомментарийКакОснование Тогда
				ОбластьРаздел6Строка.Параметры.Основание = СтрокаСведений.Комментарий;
			КонецЕсли; 
			ТабДокРаздел6.Вывести(ОбластьРаздел6Строка);
			
		КонецЦикла;
		
		Квитанция.Вывести(ТабДокРаздел6);
		
	КонецЕсли;
	
	Если ИспользоватьQR Тогда
		НапечататьQRКод(Квитанция);	
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Платежный документ РК 354.
//
Функция ПечатьПлатежныйДокументРКБИТ() Экспорт
	
	Квитанция = Новый ТабличныйДокумент;
	
	ОбластьПолучатель       = мМакет.ПолучитьОбласть("Получатель");
	ОбластьПлательщик       = мМакет.ПолучитьОбласть("Плательщик");
	ОбластьШтрихКод         = мМакет.ПолучитьОбласть("ШтрихКод");
	ОбластьПлательщикПодвал = мМакет.ПолучитьОбласть("ПлательщикПодвал");
	
	ОбластьШапка        = мМакет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	Попытка
		СтрокаРасшифровкиГр = мМакет.ПолучитьОбласть("СтрокаРасшифровкиГр");
	Исключение
		СтрокаРасшифровкиГр = Неопределено;
	КонецПопытки;
	СтрокаРасшифровки   = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = мМакет.ПолучитьОбласть("Итого"); 
	СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	ШапкаПриборыУчета   = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаВывода        = мМакет.ПолучитьОбласть("СтрокаВывода");
	
	РазовыеШапка  = мМакет.ПолучитьОбласть("РазовыеШапка");
	РазовыеСтрока = мМакет.ПолучитьОбласть("РазовыеСтрока");
	
	ОбластьКассовыйСбор     = мМакет.ПолучитьОбласть("КассовыйСбор");
	ОбластьСтрокаОбращение	= мМакет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = мМакет.ПолучитьОбласть("Линия");
	
	ШапкаПоказания  = мМакет.ПолучитьОбласть("ШапкаПоказания");
	СтрокаПоказания = мМакет.ПолучитьОбласть("СтрокаПоказания");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате + мСтруктураДанных.ПроцентОтОплаты;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	СчВывода = ?(мТаблицаПечатиСчетчиков.Количество() > 0, 4, 5);
	
	// Блок отрывной печати начало.
	Если НЕ мНастройкиМакета.БезОтрывнойЧасти Тогда
		
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
		
		Квитанция.Вывести(ОбластьПолучатель);
		
		Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
			
			Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			Рисунок = ОбластьШтрихКод.Рисунки.Шк;
			
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
			
			Квитанция.Вывести(ОбластьШтрихКод);
		Иначе
			ОбластьШапка.Рисунки.очистить();
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьПлательщик);
		
		Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
			Квитанция.Вывести(ШапкаПриборыУчета);
		КонецЕсли; 
		
		Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
			
			Если СчВывода = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			Квитанция.Вывести(СтрокаПриборовУчета);
			
			СчВывода = СчВывода - 1;
			
		КонецЦикла; 
		
		Пока НЕ СчВывода = 0 Цикл
			
			Квитанция.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
			
		КонецЦикла;
		
		Квитанция.Вывести(ОбластьПлательщикПодвал);
		
	КонецЕсли;
	// Блок отрывной печати конец.
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	Квитанция.Вывести(ОбластьШапка);
	
	Если мТаблицаПечатиСчетчиков.Количество() > 0 Тогда
		Квитанция.Вывести(ШапкаПоказания);
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		СтрокаПоказания.Параметры.Заполнить(СтрокаТаблицы);
		ЗаполнитьПараметр(СтрокаПоказания, "Услуга", СтрокаТаблицы.СокрНаименование);
		
		СтрУслуга = мТаблицаПечати.Найти(СтрокаТаблицы.Услуга, "Услуга");
		Если НЕ СтрУслуга = Неопределено Тогда
			ЗаполнитьПараметр(СтрокаПоказания, "ОбъемИнд"		, СтрУслуга.ИтогоОбъемИнд);
		Иначе
			ЗаполнитьПараметр(СтрокаПоказания, "ОбъемИнд"		, 0);
		КонецЕсли;	
		
		Квитанция.Вывести(СтрокаПоказания);
		
	КонецЦикла;
	
	Квитанция.Вывести(ШапкаЗаголовки);
	
	Если НЕ СтрокаРасшифровкиГр = Неопределено
		И (ГруппироватьУслуги ИЛИ мСтруктураДанных.ГруппироватьУслуги) Тогда
		
		Запрос = ПолучитьзапросГруппировки(мТаблицаПечати);
		ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГруп.Следующий() Цикл
			
			СтрокаРасшифровкиГр.Параметры.Заполнить(ВыборкаГруп);
			СтрокаРасшифровкиГр.Параметры.УслугаПредставление = ВРег(ВыборкаГруп.ГруппаУслугиПредставление);
			
			Выборка = ВыборкаГруп.Выбрать();
			
			Если Выборка.Количество() = 1 Тогда // Едсинственная услуга в группировки.
				
				Выборка.Следующий();
				
				Если НеПечататьУслугиБезНачислений(Выборка) Тогда
					Продолжить;
				КонецЕсли;
				
				Квитанция.Вывести(СтрокаРасшифровкиГр);
				СтрокаРасшифровкиГр.Параметры.Заполнить(Выборка);
				СтрокаРасшифровкиГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
				
			ИначеЕсли Выборка.Количество() > 1 Тогда 
				
				Если НеПечататьУслугиБезНачислений(ВыборкаГруп) = Ложь Тогда 
					Квитанция.Вывести(СтрокаРасшифровкиГр);
				КонецЕсли;
				
				Пока Выборка.Следующий() И РасскрытьСоставГрупп Цикл
					
					Если НеПечататьУслугиБезНачислений(Выборка) Тогда 
						Продолжить;
					КонецЕсли;
					СтрокаРасшифровки.Параметры.Заполнить(Выборка);
					Квитанция.Вывести(СтрокаРасшифровки);
					
				КонецЦикла; 
				
			ИначеЕсли ВыборкаГруп.Услуга.Пустая() Тогда 
				
				Пока Выборка.Следующий() Цикл
					
					Если НеПечататьУслугиБезНачислений(Выборка) Тогда 
						Продолжить;
					КонецЕсли;
					
					СтрокаРасшифровкиГр.Параметры.Заполнить(Выборка);
					СтрокаРасшифровкиГр.Параметры.УслугаПредставление = ВРег(Выборка.УслугаПредставление);
					Квитанция.Вывести(СтрокаРасшифровкиГр);
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
			Если НеПечататьУслугиБезНачислений(СтрокаТаблицы) Тогда 
				Продолжить;	
			КонецЕсли;
			СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
			Квитанция.Вывести(СтрокаРасшифровки);
		КонецЦикла; 
		
	КонецЕсли;
	
	Если НЕ мСтруктураДанных.ПроцентОтОплаты = 0 Тогда
		
		// Вывод информации о кассовом сборе.
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "ПроцентОтОплаты", мСтруктураДанных.ПроцентОтОплаты);
		ЗаполнитьПараметр(ОбластьКассовыйСбор, "Процент", Процент);
		
		Если мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплате Тогда
			мСтруктураДанных.КОплатеЗаМесяц = мСтруктураДанных.КОплатеЗаМесяц + мСтруктураДанных.ПроцентОтОплаты;
		КонецЕсли;
		
		Квитанция.Вывести(ОбластьКассовыйСбор);
		
	КонецЕсли;
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	ЗаполнитьПараметр(ОбластьИтого, "КОплате", мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты);
	
	Квитанция.Вывести(ОбластьИтого);
	
	Если НЕ ПустаяСтрока(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		Квитанция.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Квитанция, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Квитанция.Вывести(ОбластьЛиния);
	
	Если мТаблицаПерерасчетов.Количество() > 0 Тогда
		
		Квитанция.Вывести(РазовыеШапка);
		
		Для каждого СтрокаТаблицы Из мТаблицаПерерасчетов Цикл
			
			РазовыеСтрока.Параметры.Заполнить(СтрокаТаблицы);
			Если ИспользоватьКомментарийКакОснование Тогда
				РазовыеСтрока.Параметры.Основание= СтрокаТаблицы.Комментарий;
			КонецЕсли; 
			Квитанция.Вывести(РазовыеСтрока);
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Квитанция, ОбластьШтрихкодQR);
	Иначе
		УбратьQRКод(Квитанция)
	КонецЕсли;
	
	Возврат Квитанция;
	
КонецФункции

// Печать макета Единый Платежный Документ.
//
Функция ПечатьЕдиныйПлатежныйДокумент() Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	// Области отрывной части.                           
	Попытка	
		ОбластьШапкаДокумента       = мМакет.ПолучитьОбласть("ШапкаДокумента");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШтрихКод1            = мМакет.ПолучитьОбласть("ШтрихКод1");
	Исключение
	КонецПопытки;
	
	Попытка	
		ШапкаПриборыУчета           = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	Исключение
	КонецПопытки;
	
	Попытка	
		СтрокаПриборовУчета         = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПодтверждениеДанных  = мМакет.ПолучитьОбласть("ПодтверждениеДанных");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШтрихКод             = мМакет.ПолучитьОбласть("ШтрихКод");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПолучатель           = мМакет.ПолучитьОбласть("Получатель");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПлательщик           = мМакет.ПолучитьОбласть("Плательщик");
	Исключение
	КонецПопытки;
	
	// Основные области печати.
	Попытка	
		ОбластьШапка                   = мМакет.ПолучитьОбласть("Шапка");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШапкаЗаголовки          = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	Исключение
	КонецПопытки;
	
	Попытка	
		СтрокаРасшифровки              = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьИтого                   = мМакет.ПолучитьОбласть("Итого");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШапкаПерерасчеты        = мМакет.ПолучитьОбласть("ШапкаПерерасчеты");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПерерасчеты             = мМакет.ПолучитьОбласть("Перерасчеты");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШапкаПоставщики         = мМакет.ПолучитьОбласть("ШапкаПоставщики");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПоставщики              = мМакет.ПолучитьОбласть("Поставщики");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьСправочнаяИнформация    = мМакет.ПолучитьОбласть("СправочнаяИнформация");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьСправочнаяИнформацияСтрока    = мМакет.ПолучитьОбласть("СправочнаяИнформацияСтрока");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьСправочнаяИнформацияПримечание    = мМакет.ПолучитьОбласть("СправочнаяИнформацияПримечание");
	Исключение
	КонецПопытки;
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате        + мСтруктураДанных.ПроцентОтОплаты;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	Попытка
		ОбластьШапкаДокумента.Параметры.Заполнить(мСтруктураДанных);
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьШапкаДокумента.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьШапкаДокумента.Параметры.Значение = мТаблицаСвойств[0].Значение;
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьШтрихКод1.Параметры.Заполнить(мСтруктураДанных);
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьПлательщик.Параметры.Заполнить(мСтруктураДанных);
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета,
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства,
	|	ЕСТЬNULL(бит_ЗначениеСвойствОбъектовУчета.Значение, 0) КАК Значение
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета = &Здание";
	
	Запрос.УстановитьПараметр("Здание", мСтруктураДанных.ЛицевойСчет.Здание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПлощадьЖилыхНежилых = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания") Тогда
			ЗаполнитьПараметр(ОбластьШапка, "ОбщаяПлощадьДома", ВыборкаДетальныеЗаписи.Значение);
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьНежилыхПомещений")
			Или ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений") Тогда
			ПлощадьЖилыхНежилых = ПлощадьЖилыхНежилых + ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования") Тогда
			ЗаполнитьПараметр(ОбластьШапка, "МестОбщегоПользования", ВыборкаДетальныеЗаписи.Значение);
		КонецЕсли;	
	КонецЦикла;
	ЗаполнитьПараметр(ОбластьШапка, "ПлощадьЖилыхНежилых", ПлощадьЖилыхНежилых);
	
	Попытка
		ОбластьПодтверждениеДанных.Параметры.Заполнить(мСтруктураДанных);
	Исключение
	КонецПопытки;
	
	Попытка
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьПодтверждениеДанных.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьПодтверждениеДанных.Параметры.Значение = мТаблицаСвойств[0].Значение
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Попытка
		
		Результат.Вывести(ОбластьШапкаДокумента);
	Исключение
	КонецПопытки;
	
	Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
	
		Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Попытка
			Рисунок = ОбластьШтрихКод1.Рисунки.Шк;
		Исключение
		КонецПопытки;
		
		Попытка
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
		Исключение
		КонецПопытки;
		
		Попытка
			Результат.Вывести(ОбластьШтрихКод1);
		Исключение
		КонецПопытки;
		
	Иначе
		
		Попытка
			ОбластьШтрихКод1.Рисунки.очистить();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		Результат.Вывести(ШапкаПриборыУчета);
	Исключение
	КонецПопытки;
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		Попытка
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			Результат.Вывести(СтрокаПриборовУчета);
		Исключение
		КонецПопытки;
		
	КонецЦикла; 
	
	Попытка
		Результат.Вывести(ОбластьПодтверждениеДанных);
	Исключение
	КонецПопытки;
	
	Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
		
		
		Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Попытка
			Рисунок = ОбластьШтрихКод.Рисунки.Шк2;
		Исключение
		КонецПопытки;
		
		Попытка    
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
		Исключение
		КонецПопытки;
		
		Попытка
			Результат.Вывести(ОбластьШтрихКод);
		Исключение
		КонецПопытки;
		
	Иначе
		
		Попытка
			ОбластьШтрихКод.Рисунки.очистить();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		Результат.Вывести(ОбластьПолучатель);
	Исключение
	КонецПопытки;		
	Попытка
		Результат.Вывести(ОбластьПлательщик);
	Исключение
	КонецПопытки;		
	Попытка
		Результат.Вывести(ОбластьШапка);
	Исключение
	КонецПопытки;		
	
	
	Попытка
		Результат.Вывести(ОбластьШапкаЗаголовки);
	Исключение
	КонецПопытки;		
	
	КодПоставщика = 0;
	
	Мас = Новый Массив;
	
	Попытка
		Мас.Добавить(СтрокаРасшифровки);
		Мас.Добавить(ОбластьИтого);
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, Мас) Тогда
			
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
	Исключение
	КонецПопытки;		
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		КодПоставщика = КодПоставщика + 1;
		
		Если НеПечататьУслугиБезНачислений(СтрокаТаблицы) Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
			СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
			СтрокаРасшифровки.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
			Результат.Вывести(СтрокаРасшифровки);
		Исключение
		КонецПопытки;		
		
	КонецЦикла; 
	
	Попытка
		ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
		Результат.Вывести(ОбластьИтого);
	Исключение
	КонецПопытки;		
	
	Результат.ВывестиГоризонтальныйРазделительСтраниц();
	
	Попытка
		Результат.Вывести(ОбластьШапкаПерерасчеты);
	Исключение
	КонецПопытки;		
	
	КодПоставщика = 0;
	Для каждого СтрокаТаблицы Из мТаблицаПерерасчетов Цикл
		КодПоставщика = КодПоставщика + 1;
		
		Попытка
			ОбластьПерерасчеты.Параметры.Заполнить(СтрокаТаблицы);
			ОбластьПерерасчеты.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
			
			Результат.Вывести(ОбластьПерерасчеты);
		Исключение
		КонецПопытки;		
		
	КонецЦикла; 
	
	Попытка
		Результат.Вывести(ОбластьШапкаПоставщики);
	Исключение
	КонецПопытки;		
	
	КодПоставщика = 0;
	
	ПредыдущийПоставщик = Неопределено;
	ПредыдущийДолг            = Неопределено;
	ПредыдущаяОплата          = Неопределено;
	ПредыдущийПени            = Неопределено;
	ПредыдущийКОплатеЗаМесяц  = Неопределено;
	ПредыдущийКОплате         = Неопределено;
	
	мТаблицаПечати.Сортировать("Поставщик");
	
	ПараметрЛицевойСчет = мСтруктураДанных.ЛицевойСчет;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип,
	|	ОрганизацииКонтактнаяИнформация.Вид,
	|	ОрганизацииКонтактнаяИнформация.Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка = &Поставщик";
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Тип,
	|	КонтрагентыКонтактнаяИнформация.Вид,
	|	КонтрагентыКонтактнаяИнформация.Представление,
	|	КонтрагентыКонтактнаяИнформация.Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Поставщик";
	
	ПредыдущаяОбласть = Ложь;  
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
			
			Если ТипЗнч(СтрокаТаблицы.Поставщик) = Тип("СправочникСсылка.Организации") Тогда
				
				Запрос.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик);
				РезультатЗапроса = Запрос.Выполнить();
			Иначе
				
				Запрос2.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик);
				РезультатЗапроса = Запрос2.Выполнить();
				
			КонецЕсли;
			
		Иначе	
			
			Если ТипЗнч(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Организации") Тогда
				
				Запрос.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств);
				РезультатЗапроса = Запрос.Выполнить();
			Иначе
				
				Запрос2.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств);
				РезультатЗапроса = Запрос2.Выполнить();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Адрес = Неопределено;
			Телефон = Неопределено;
			
			
			Пока Выборка.Следующий() Цикл
				Если Строка(Выборка.Вид) = "Фактический адрес" ИЛИ  Строка(Выборка.Вид) = "Фактический" Тогда
					
					Адрес = Выборка.Представление; 	
					
					
				КонецЕсли;
				
				Если Строка(Выборка.Вид) = "Телефон" Тогда
					
					Телефон = Строка("Тел: " + Выборка.Представление); 	
					
				КонецЕсли;
				
			КонецЦикла; 
			Попытка
				Если Адрес = Неопределено и Телефон <> Неопределено Тогда
					Адрес = "";
				ИначеЕсли Телефон = Неопределено и Адрес <> Неопределено Тогда
					Телефон = "";
				КонецЕсли;
				
				АдресТелефон = Строка(Адрес + "  " + Телефон); 
			Исключение
				АдресТелефон = "Нет";	
			КонецПопытки;
			
		Иначе
			АдресТелефон = "Нет";	
		КонецЕсли;
		
		Попытка
			
			Если КодПоставщика = 0 Тогда
				ОбластьПоставщики.Параметры.ЛицевойСчет = ПараметрЛицевойСчет;
				КодПоставщика = КодПоставщика + 1;
				ОбластьПоставщики.Параметры.Заполнить(СтрокаТаблицы);
				
				Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
					
					ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
					
					
					ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик;		
				Иначе	
					ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств;	
					ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(ОбластьПоставщики.Параметры.Поставщик.Код),3);
					
				КонецЕсли;
				
				Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
					ОбластьПоставщики.Параметры.Долг = ОбластьПоставщики.Параметры.Долг - СтрокаТаблицы.ПереплатаНаНачало;
				КонецЕсли;
				
				ПредыдущаяОбласть = ОбластьПоставщики;
				ПредыдущийАдресТелефон = АдресТелефон;
			ИначеЕсли ?(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"),СтрокаТаблицы.Поставщик,СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) = ПредыдущаяОбласть.Параметры.Поставщик Тогда
				Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
					ПредыдущаяОбласть.Параметры.Долг = ПредыдущаяОбласть.Параметры.Долг + СтрокаТаблицы.Долг - СтрокаТаблицы.ПереплатаНаНачало;
				Иначе	
					ПредыдущаяОбласть.Параметры.Долг = ПредыдущаяОбласть.Параметры.Долг + СтрокаТаблицы.Долг; 
				КонецЕсли;
				ПредыдущаяОбласть.Параметры.Оплата         = ПредыдущаяОбласть.Параметры.Оплата + СтрокаТаблицы.Оплата;
				ПредыдущаяОбласть.Параметры.Пени           = ПредыдущаяОбласть.Параметры.Пени + СтрокаТаблицы.Пени;
				ПредыдущаяОбласть.Параметры.КОплатеЗаМесяц = ПредыдущаяОбласть.Параметры.КОплатеЗаМесяц + СтрокаТаблицы.КОплатеЗаМесяц;
				ПредыдущаяОбласть.Параметры.КОплате        = ПредыдущаяОбласть.Параметры.КОплате + СтрокаТаблицы.КОплате;
			ИначеЕсли ?(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"),СтрокаТаблицы.Поставщик,СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) <> ПредыдущаяОбласть.Параметры.Поставщик И  ПредыдущаяОбласть <> Ложь Тогда
				ЗаполнитьПараметр(ПредыдущаяОбласть, "АдресИТелефонПоставщика", ПредыдущийАдресТелефон);	
				Результат.Вывести(ПредыдущаяОбласть);
				ОбластьПоставщики.Параметры.ЛицевойСчет = ПараметрЛицевойСчет;
				КодПоставщика = КодПоставщика + 1;
				ОбластьПоставщики.Параметры.Заполнить(СтрокаТаблицы);
				
				Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
					
					ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
					ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик;		
				Иначе	
					ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств;
					ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(ОбластьПоставщики.Параметры.Поставщик.Код),3);
					
				КонецЕсли;
				
				Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
					ОбластьПоставщики.Параметры.Долг = ОбластьПоставщики.Параметры.Долг - СтрокаТаблицы.ПереплатаНаНачало;
				КонецЕсли;
				
				ПредыдущаяОбласть = ОбластьПоставщики;
				ПредыдущийАдресТелефон = АдресТелефон;
				
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		
	КонецЦикла; 
	
	Попытка
		ЗаполнитьПараметр(ПредыдущаяОбласть, "АдресИТелефонПоставщика", ПредыдущийАдресТелефон);	
		Результат.Вывести(ПредыдущаяОбласть);
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьСправочнаяИнформация.Параметры.Заполнить(мСтруктураДанных);
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьСправочнаяИнформация.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьСправочнаяИнформация.Параметры.Значение = мТаблицаСвойств[0].Значение;
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Результат.Вывести(ОбластьСправочнаяИнформация);
		
	Исключение
	КонецПопытки;
	
	Попытка
		
		Для каждого строка из мТаблицаОбщедомовыхСчетчиков Цикл
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.Заполнить(строка);     			
					 
		    Результат.Вывести(ОбластьСправочнаяИнформацияСтрока);

		КонецЦикла;	
		
		НомерПункта = 1;
		// Индвидуальные сч.
		// БИТ ЖКХ 20.02.2020
		Для каждого Строка из мТаблицаПечатиСчетчиков Цикл

			Если Не ЗначениеЗаполнено(Строка.Счетчик)  Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.Заполнить(Строка);
//			ОбластьСправочнаяИнформацияСтрока.Параметры.НомерПункта = НомерПункта; 
//			ОбластьСправочнаяИнформацияСтрока.Параметры.ВидПУ	 = "ИПУ";
			ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемОбщедомовых = Строка.ОбъемОбщДом;
			
			СтрУслуга = мТаблицаПечати.Найти(Строка.Услуга, "Услуга");
			Если НЕ СтрУслуга = Неопределено Тогда
				ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемИндНорматив = СтрУслуга.ИтогоОбъемИндНорматив;
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативОбщДом", СтрУслуга.НормативОбщДом);
				ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемИндИПУ = СтрУслуга.ИтогоОбъемИндИПУ;
			иначе
				ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемИндНорматив = 0;
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативОбщДом", 0);
				ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемИндИПУ = 0;
			КонецЕсли;
			
			Результат.Вывести(ОбластьСправочнаяИнформацияСтрока);
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;	
		
	Исключение
		
	КонецПопытки;
	
	// СправочнаяИнформацияПримечание реализована возможность. 
	// Использовать параметры структуры данных, Свойство и Значение.
	// Результат.Вывести(ОбластьСправочнаяИнформацияПримечание);.
	Попытка
		
		ОбластьСправочнаяИнформацияПримечание.Параметры.Заполнить(мСтруктураДанных);
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьСправочнаяИнформацияПримечание.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьСправочнаяИнформацияПримечание.Параметры.Значение = мТаблицаСвойств[0].Значение;
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Результат.Вывести(ОбластьСправочнаяИнформацияПримечание);
	Исключение
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		
		Результат.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Результат, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Если ИспользоватьQR = Истина Тогда
		
		//Попытка	
		//	ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		//Исключение
		//КонецПопытки;
		
		НапечататьQRКод(Результат);
	Иначе
		УбратьQRКод(Результат)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатьЕдиныйПлатежныйДокумент679_30() Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	// Области отрывной части.                           
	Попытка	
		ОбластьШапкаДокумента       = мМакет.ПолучитьОбласть("ШапкаДокумента");
	Исключение
	КонецПопытки;
	
	Попытка	
		ШапкаПриборыУчета           = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	Исключение
	КонецПопытки;
	
	Попытка	
		СтрокаПриборовУчета         = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПодтверждениеДанных  = мМакет.ПолучитьОбласть("ПодтверждениеДанных");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШтрихКод             = мМакет.ПолучитьОбласть("ШтрихКод");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПолучатель           = мМакет.ПолучитьОбласть("Получатель");
	Исключение
	КонецПопытки;
	
	// Основные области печати.
	Попытка	
		ОбластьШапка                   = мМакет.ПолучитьОбласть("Шапка");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШапкаЗаголовки          = мМакет.ПолучитьОбласть("ШапкаЗаголовки");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьГруппаСодержание        = мМакет.ПолучитьОбласть("ГруппаСодержание");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьГруппаСодержаниеИтого   = мМакет.ПолучитьОбласть("ГруппаСодержаниеИтого");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьГруппаКоммунальные  	   = мМакет.ПолучитьОбласть("ГруппаКоммунальные");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьГруппаКоммунальныеИтого = мМакет.ПолучитьОбласть("ГруппаКоммунальныеИтого");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьГруппаПрочие            = мМакет.ПолучитьОбласть("ГруппаПрочие");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьИтого                   = мМакет.ПолучитьОбласть("Итого");
	Исключение
	КонецПопытки;
	
	Попытка	
		СтрокаРасшифровки	           = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	Исключение
	КонецПопытки;

	Попытка	
		ОбластьШапкаПерерасчеты        = мМакет.ПолучитьОбласть("ШапкаПерерасчеты");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПерерасчеты             = мМакет.ПолучитьОбласть("Перерасчеты");
	Исключение
	КонецПопытки;
	
	// БИТ_ЖКХ 25.10.2017 15:19:30 Начало правки... 
	//Попытка	
	//	ОбластьШапкаПоставщики         = мМакет.ПолучитьОбласть("ШапкаПоставщики");
	//Исключение
	//КонецПопытки;
	//
	//Попытка	
	//	ОбластьПоставщики              = мМакет.ПолучитьОбласть("Поставщики");
	//Исключение
	//КонецПопытки;
	// БИТ_ЖКХ 25.10.2017 15:19:33 Конец правки. 
	
	Попытка	
		ОбластьСправочнаяИнформация    = мМакет.ПолучитьОбласть("СправочнаяИнформация");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьСправочнаяИнформацияСтрока    = мМакет.ПолучитьОбласть("СправочнаяИнформацияСтрока");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьСправочнаяИнформацияПримечание    = мМакет.ПолучитьОбласть("СправочнаяИнформацияПримечание");
	Исключение
	КонецПопытки;
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате        + мСтруктураДанных.ПроцентОтОплаты;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	Попытка
		ОбластьШапкаДокумента.Параметры.Заполнить(мСтруктураДанных);
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьШапкаДокумента.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьШапкаДокумента.Параметры.Значение = мТаблицаСвойств[0].Значение;
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьПолучатель.Параметры.Заполнить(мСтруктураДанных);
		ОбластьПолучатель.Параметры.Период = ВРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ОбластьШапка.Параметры.Период = ВРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета,
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства,
	|	ЕСТЬNULL(бит_ЗначениеСвойствОбъектовУчета.Значение, 0) КАК Значение
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета = &Здание";
	
	Запрос.УстановитьПараметр("Здание", мСтруктураДанных.ЛицевойСчет.Здание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПлощадьЖилыхНежилых = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания") Тогда
			ЗаполнитьПараметр(ОбластьШапка, "ОбщаяПлощадьДома", ВыборкаДетальныеЗаписи.Значение);
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьНежилыхПомещений")
			Или ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений") Тогда
			ПлощадьЖилыхНежилых = ПлощадьЖилыхНежилых + ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования") Тогда
			ЗаполнитьПараметр(ОбластьШапка, "МестОбщегоПользования", ВыборкаДетальныеЗаписи.Значение);
		КонецЕсли;	
	КонецЦикла;
	ЗаполнитьПараметр(ОбластьШапка, "ПлощадьЖилыхНежилых", ПлощадьЖилыхНежилых);
	
	Попытка
		ОбластьПодтверждениеДанных.Параметры.Заполнить(мСтруктураДанных);
	Исключение
	КонецПопытки;
	
	Попытка
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьПодтверждениеДанных.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьПодтверждениеДанных.Параметры.Значение = мТаблицаСвойств[0].Значение
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
		
		Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Попытка
			Рисунок = ОбластьШапкаДокумента.Рисунки.Шк;
		Исключение
		КонецПопытки;
		
		Попытка
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
		Исключение
		КонецПопытки;
		
	Иначе
		
		Попытка
			ОбластьШапкаДокумента.Рисунки.очистить();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		Результат.Вывести(ОбластьШапкаДокумента);
	Исключение
	КонецПопытки;
	
	Попытка
		Результат.Вывести(ШапкаПриборыУчета);
	Исключение
	КонецПопытки;
	
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		Попытка
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			Результат.Вывести(СтрокаПриборовУчета);
		Исключение
		КонецПопытки;
		
	КонецЦикла; 
	
	Попытка
		Результат.Вывести(ОбластьПодтверждениеДанных);
	Исключение
	КонецПопытки;
	
	Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
		
		
		Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Попытка
			Рисунок = ОбластьШтрихКод.Рисунки.Шк2;
		Исключение
		КонецПопытки;
		
		Попытка    
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
		Исключение
		КонецПопытки;
		
		Попытка
			Результат.Вывести(ОбластьШтрихКод);
		Исключение
		КонецПопытки;
		
	Иначе
		
		Попытка
			ОбластьШтрихКод.Рисунки.очистить();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		Результат.Вывести(ОбластьПолучатель);
	Исключение
	КонецПопытки;		
	
	Попытка
		Результат.Вывести(ОбластьШапка);
	Исключение
	КонецПопытки;		
	
	
	Попытка
		ОбластьШапкаЗаголовки.Параметры.Период = НРег(мСтруктураДанных.Период);
		Результат.Вывести(ОбластьШапкаЗаголовки);
	Исключение
	КонецПопытки;		
	
	КодПоставщика = 0;
	
	Мас = Новый Массив;
	
	Попытка
		Мас.Добавить(СтрокаРасшифровки);
		Мас.Добавить(ОбластьИтого);
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, Мас) Тогда
			
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
	Исключение
	КонецПопытки;		
	
	
	ТабДокСодержаниеРемонтУсл = Новый ТабличныйДокумент;
	ТабДокСодержаниеРемонтУсл.Вывести(ОбластьГруппаСодержание);
	ТабДокКоммунальныеУсл = Новый ТабличныйДокумент;
	ТабДокКоммунальныеУсл.Вывести(ОбластьГруппаКоммунальные);
	ТабДокПрочиеУсл	= Новый ТабличныйДокумент;
	ТабДокПрочиеУсл.Вывести(ОбластьГруппаПрочие);
	ИтогоТабДокСодержаниеРемонтУсл = 0;
	ИтогоТабДокКоммунальныеУсл	   = 0;
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		Если НеПечататьУслугиБезНачислений(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		Если (СтрокаТаблицы.ОбъемИНД = 0 И СтрокаТаблицы.ОбъемОбщДом = 0)
			ИЛИ (СтрокаТаблицы.ОбъемИНД <> 0 И СтрокаТаблицы.ОбъемОбщДом = 0) Тогда
			СтрокаРасшифровки.Параметры.ВидУсл = "инд.";
		ИначеЕсли СтрокаТаблицы.ОбъемОбщДом <> 0 И СтрокаТаблицы.ОбъемИНД <> 0 Тогда
			СтрокаРасшифровки.Параметры.ВидУсл = "инд./ОДН";
		Иначе
			СтрокаРасшифровки.Параметры.ВидУсл = "ОДН";
		КонецЕсли;
		
		Если СтрокаТаблицы.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание")
			ИЛИ СтрокаТаблицы.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм")
			ИЛИ СтрокаТаблицы.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
			
			ТабДокСодержаниеРемонтУсл.Вывести(СтрокаРасшифровки);
			ИтогоТабДокСодержаниеРемонтУсл = ИтогоТабДокСодержаниеРемонтУсл + СтрокаТаблицы.КОплатеЗаМесяц;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицы.ГрафаОтчетаГЦЖС) Тогда	
			
			ТабДокПрочиеУсл.Вывести(СтрокаРасшифровки);
			
		Иначе 
			
			ТабДокКоммунальныеУсл.Вывести(СтрокаРасшифровки);
			ИтогоТабДокКоммунальныеУсл = ИтогоТабДокКоммунальныеУсл + СтрокаТаблицы.КОплатеЗаМесяц;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ТабДокСодержаниеРемонтУсл.ВысотаТаблицы > 1 Тогда
		ОбластьГруппаСодержаниеИтого.Параметры.Период = НРег(мСтруктураДанных.Период);
		ОбластьГруппаСодержаниеИтого.Параметры.ИтогоСодержание = ИтогоТабДокСодержаниеРемонтУсл;
		ТабДокСодержаниеРемонтУсл.Вывести(ОбластьГруппаСодержаниеИтого);
		Результат.Вывести(ТабДокСодержаниеРемонтУсл);
	КонецЕсли;
	
	Если ТабДокКоммунальныеУсл.ВысотаТаблицы > 1 Тогда
		ОбластьГруппаКоммунальныеИтого.Параметры.Период = НРег(мСтруктураДанных.Период);
		ОбластьГруппаКоммунальныеИтого.Параметры.ИтогоКоммУсл = ИтогоТабДокКоммунальныеУсл;
		ТабДокКоммунальныеУсл.Вывести(ОбластьГруппаКоммунальныеИтого);
		Результат.Вывести(ТабДокКоммунальныеУсл);
	КонецЕсли;
	
	Если ТабДокПрочиеУсл.ВысотаТаблицы > 1 Тогда
		Результат.Вывести(ТабДокПрочиеУсл);
	КонецЕсли;
	
	Попытка
		ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
		Результат.Вывести(ОбластьИтого);
	Исключение
	КонецПопытки;		
	
	Результат.ВывестиГоризонтальныйРазделительСтраниц();
	
	Попытка
		Результат.Вывести(ОбластьШапкаПерерасчеты);
	Исключение
	КонецПопытки;		
	
	Для каждого СтрокаТаблицы Из мТаблицаПерерасчетов Цикл
		
		Попытка
			ОбластьПерерасчеты.Параметры.Заполнить(СтрокаТаблицы);
			ОбластьПерерасчеты.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
			Результат.Вывести(ОбластьПерерасчеты);
		Исключение
		КонецПопытки;		
		
	КонецЦикла; 
	
	// БИТ_ЖКХ 25.10.2017 15:19:18 Начало правки... 
	//Попытка
	//	Результат.Вывести(ОбластьШапкаПоставщики);
	//Исключение
	//КонецПопытки;		
	
	//КодПоставщика = 0;
	//
	//ПредыдущийПоставщик = Неопределено;
	//ПредыдущийДолг            = Неопределено;
	//ПредыдущаяОплата          = Неопределено;
	//ПредыдущийПени            = Неопределено;
	//ПредыдущийКОплатеЗаМесяц  = Неопределено;
	//ПредыдущийКОплате         = Неопределено;
	//
	//мТаблицаПечати.Сортировать("Поставщик");
	//
	//ПараметрЛицевойСчет = мСтруктураДанных.ЛицевойСчет;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ОрганизацииКонтактнаяИнформация.Тип,
	//|	ОрганизацииКонтактнаяИнформация.Вид,
	//|	ОрганизацииКонтактнаяИнформация.Представление,
	//|	ОрганизацииКонтактнаяИнформация.Ссылка
	//|ИЗ
	//|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	//|ГДЕ
	//|	ОрганизацииКонтактнаяИнформация.Ссылка = &Поставщик";
	//
	//Запрос2 = Новый Запрос;
	//Запрос2.Текст = 
	//"ВЫБРАТЬ
	//|	КонтрагентыКонтактнаяИнформация.Тип,
	//|	КонтрагентыКонтактнаяИнформация.Вид,
	//|	КонтрагентыКонтактнаяИнформация.Представление,
	//|	КонтрагентыКонтактнаяИнформация.Ссылка
	//|ИЗ
	//|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	//|ГДЕ
	//|	КонтрагентыКонтактнаяИнформация.Ссылка = &Поставщик";
	//
	//ПредыдущаяОбласть = Ложь;  
	//
	//Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
	//	
	//	Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
	//		
	//		Если ТипЗнч(СтрокаТаблицы.Поставщик) = Тип("СправочникСсылка.Организации") Тогда
	//			
	//			Запрос.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик);
	//			РезультатЗапроса = Запрос.Выполнить();
	//		Иначе
	//			
	//			Запрос2.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик);
	//			РезультатЗапроса = Запрос2.Выполнить();
	//			
	//		КонецЕсли;
	//		
	//	Иначе	
	//		
	//		Если ТипЗнч(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Организации") Тогда
	//			
	//			Запрос.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств);
	//			РезультатЗапроса = Запрос.Выполнить();
	//		Иначе
	//			
	//			Запрос2.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств);
	//			РезультатЗапроса = Запрос2.Выполнить();
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Если НЕ РезультатЗапроса.Пустой() Тогда
	//		Выборка = РезультатЗапроса.Выбрать();
	//		
	//		Адрес = Неопределено;
	//		Телефон = Неопределено;
	//		
	//		
	//		Пока Выборка.Следующий() Цикл
	//			Если Строка(Выборка.Вид) = "Фактический адрес" ИЛИ  Строка(Выборка.Вид) = "Фактический" Тогда
	//				
	//				Адрес = Выборка.Представление; 	
	//				
	//				
	//			КонецЕсли;
	//			
	//			Если Строка(Выборка.Вид) = "Телефон" Тогда
	//				
	//				Телефон = Строка("Тел: " + Выборка.Представление); 	
	//				
	//			КонецЕсли;
	//			
	//		КонецЦикла; 
	//		Попытка
	//			Если Адрес = Неопределено и Телефон <> Неопределено Тогда
	//				Адрес = "";
	//			ИначеЕсли Телефон = Неопределено и Адрес <> Неопределено Тогда
	//				Телефон = "";
	//			КонецЕсли;
	//			
	//			АдресТелефон = Строка(Адрес + "  " + Телефон); 
	//		Исключение
	//			АдресТелефон = "Нет";	
	//		КонецПопытки;
	//		
	//	Иначе
	//		АдресТелефон = "Нет";	
	//	КонецЕсли;
	//	
	//	Попытка
	//		
	//		Если КодПоставщика = 0 Тогда
	//			ОбластьПоставщики.Параметры.ЛицевойСчет = ПараметрЛицевойСчет;
	//			КодПоставщика = КодПоставщика + 1;
	//			ОбластьПоставщики.Параметры.Заполнить(СтрокаТаблицы);
	//			
	//			Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
	//				
	//				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
	//				
	//				
	//				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик;		
	//			Иначе	
	//				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств;	
	//				
	//				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(ОбластьПоставщики.Параметры.Поставщик.Код),3);
	//				
	//			КонецЕсли;
	//			
	//			Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
	//				ОбластьПоставщики.Параметры.Долг = ОбластьПоставщики.Параметры.Долг - СтрокаТаблицы.ПереплатаНаНачало;
	//			КонецЕсли;
	//			
	//			ПредыдущаяОбласть = ОбластьПоставщики;
	//			ПредыдущийАдресТелефон = АдресТелефон;
	//		ИначеЕсли ?(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"),СтрокаТаблицы.Поставщик,СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) = ПредыдущаяОбласть.Параметры.Поставщик Тогда
	//			Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
	//				ПредыдущаяОбласть.Параметры.Долг = ПредыдущаяОбласть.Параметры.Долг + СтрокаТаблицы.Долг - СтрокаТаблицы.ПереплатаНаНачало;
	//			Иначе	
	//				ПредыдущаяОбласть.Параметры.Долг = ПредыдущаяОбласть.Параметры.Долг + СтрокаТаблицы.Долг; 
	//			КонецЕсли;
	//			ПредыдущаяОбласть.Параметры.Оплата         = ПредыдущаяОбласть.Параметры.Оплата + СтрокаТаблицы.Оплата;
	//			ПредыдущаяОбласть.Параметры.Пени           = ПредыдущаяОбласть.Параметры.Пени + СтрокаТаблицы.Пени;
	//			ПредыдущаяОбласть.Параметры.КОплатеЗаМесяц = ПредыдущаяОбласть.Параметры.КОплатеЗаМесяц + СтрокаТаблицы.КОплатеЗаМесяц;
	//			ПредыдущаяОбласть.Параметры.КОплате        = ПредыдущаяОбласть.Параметры.КОплате + СтрокаТаблицы.КОплате;
	//		ИначеЕсли ?(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"),СтрокаТаблицы.Поставщик,СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) <> ПредыдущаяОбласть.Параметры.Поставщик И  ПредыдущаяОбласть <> Ложь Тогда
	//			ЗаполнитьПараметр(ПредыдущаяОбласть, "АдресИТелефонПоставщика", ПредыдущийАдресТелефон);	
	//			Результат.Вывести(ПредыдущаяОбласть);
	//			ОбластьПоставщики.Параметры.ЛицевойСчет = ПараметрЛицевойСчет;
	//			КодПоставщика = КодПоставщика + 1;
	//			ОбластьПоставщики.Параметры.Заполнить(СтрокаТаблицы);
	//			
	//			Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
	//				
	//				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
	//				
	//				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик;		
	//			Иначе	
	//				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств;
	//				
	//				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(ОбластьПоставщики.Параметры.Поставщик.Код),3);
	//				
	//			КонецЕсли;
	//			
	//			Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
	//				ОбластьПоставщики.Параметры.Долг = ОбластьПоставщики.Параметры.Долг - СтрокаТаблицы.ПереплатаНаНачало;
	//			КонецЕсли;
	//			
	//			ПредыдущаяОбласть = ОбластьПоставщики;
	//			ПредыдущийАдресТелефон = АдресТелефон;
	//			
	//		КонецЕсли;
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЦикла; 
	//
	//Попытка
	//	ЗаполнитьПараметр(ПредыдущаяОбласть, "АдресИТелефонПоставщика", ПредыдущийАдресТелефон);	
	//	Результат.Вывести(ПредыдущаяОбласть);
	//Исключение
	//КонецПопытки;
	// БИТ_ЖКХ 25.10.2017 15:19:23 Конец правки. 
	
	Попытка
		ОбластьСправочнаяИнформация.Параметры.Заполнить(мСтруктураДанных);
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьСправочнаяИнформация.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьСправочнаяИнформация.Параметры.Значение = мТаблицаСвойств[0].Значение;
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Результат.Вывести(ОбластьСправочнаяИнформация);
		
	Исключение
	КонецПопытки;
	
	Попытка
		НомерПункта = 1;
		// Индвидуальные сч.
		
		Для каждого Строка из мТаблицаПечатиСчетчиков Цикл

			Если Не ЗначениеЗаполнено(Строка.Счетчик)  Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.Заполнить(Строка);
			ОбластьСправочнаяИнформацияСтрока.Параметры.НомерПункта = НомерПункта; 
			ОбластьСправочнаяИнформацияСтрока.Параметры.ВидПУ	 = "ИПУ";
			ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемОбщедомовых = Строка.ОбъемОбщДом;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.ОбъемОбщийИнд = 0;
			СтрУслуга = мТаблицаПечати.Найти(Строка.Услуга, "Услуга");
			Если НЕ СтрУслуга = Неопределено Тогда
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативИНД",	   СтрУслуга.НормативИНД);
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативОбщДом", СтрУслуга.НормативОбщДом);
				//14.12.2018
				// БИТ ЖКХ 13.09.2020
				//если Строка.ОбъемИнд <> 0 тогда	
				 ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "ОбъемОбщийИнд",  СтрУслуга.ИтогоОбъемИнд);
				//конецесли;	
			КонецЕсли;
			
			Результат.Вывести(ОбластьСправочнаяИнформацияСтрока);
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;	
		
		// Общедомовые сч.
		Для каждого Строка из мТаблицаОбщедомовыхСчетчиков Цикл
			
			Если Не ЗначениеЗаполнено(Строка.Счетчик)  Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.Заполнить(Строка);
			ОбластьСправочнаяИнформацияСтрока.Параметры.НомерПункта = НомерПункта; 
			ОбластьСправочнаяИнформацияСтрока.Параметры.ВидПУ		= "ОДПУ";
			
			СтрУслуга = мТаблицаПечати.Найти(Строка.Услуга, "Услуга");
			Если НЕ СтрУслуга = Неопределено Тогда
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативИНД",	   СтрУслуга.НормативИНД);
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативОбщДом", СтрУслуга.НормативОбщДом);
			КонецЕсли;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.ОбъемОбщийИнд = Строка.ИтогоОбъемИндИПУ + Строка.ИтогоОбъемИндНорматив;
			Результат.Вывести(ОбластьСправочнаяИнформацияСтрока);
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;	
		
	Исключение
		
	КонецПопытки;
	
	Попытка
		
		ОбластьСправочнаяИнформацияПримечание.Параметры.Заполнить(мСтруктураДанных);
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьСправочнаяИнформацияПримечание.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				
				ОбластьСправочнаяИнформацияПримечание.Параметры.Значение = мТаблицаСвойств[0].Значение;
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Результат.Вывести(ОбластьСправочнаяИнформацияПримечание);
	Исключение
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		
		Результат.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Результат, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Результат, ОбластьШтрихкодQR);
	Иначе
		УбратьQRКод(Результат)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатьЕдиныйПлатежныйДокумент761_32() Экспорт 
	
	Результат = Новый ТабличныйДокумент;
	
	Попытка	
		ОбластьШапкаДокумента = мМакет.ПолучитьОбласть("ШапкаДокумента");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШапкаПриборыУчета = мМакет.ПолучитьОбласть("ШапкаПриборыУчета");
	Исключение
	КонецПопытки;
	
	Попытка	
		СтрокаПриборовУчета = мМакет.ПолучитьОбласть("СтрокаПриборовУчета");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПодтверждениеДанных = мМакет.ПолучитьОбласть("ПодтверждениеДанных");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПолучатель = мМакет.ПолучитьОбласть("Получатель");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьКвитанция = мМакет.ПолучитьОбласть("Квитанция");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШапкаРасчета = мМакет.ПолучитьОбласть("ШапкаРасчета");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьГруппаСодержание = мМакет.ПолучитьОбласть("ГруппаСодержание");
	Исключение
	КонецПопытки;
	
	//Попытка	
	//	ОбластьГруппаСодержаниеИтого = мМакет.ПолучитьОбласть("ГруппаСодержаниеИтого");
	//Исключение
	//КонецПопытки;
	
	Попытка	
		ОбластьГруппаКоммунальные = мМакет.ПолучитьОбласть("ГруппаКоммунальные");
	Исключение
	КонецПопытки;
	
	//Попытка	
	//	ОбластьГруппаКоммунальныеИтого = мМакет.ПолучитьОбласть("ГруппаКоммунальныеИтого");
	//Исключение
	//КонецПопытки;
	
	Попытка	
		ОбластьГруппаПрочие = мМакет.ПолучитьОбласть("ГруппаПрочие");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьИтогоБез = мМакет.ПолучитьОбласть("ИтогоБез");
	Исключение
	КонецПопытки;
	
	Попытка	
		СтрокаДобрСтрах = мМакет.ПолучитьОбласть("СтрокаДобрСтрах");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьИтогоС = мМакет.ПолучитьОбласть("ИтогоС");
	Исключение
	КонецПопытки;
	
	// БИТ ЖКХ 14.04.2021
	Попытка	
		ОбластьИтогоПени = мМакет.ПолучитьОбласть("ИтогоПени");
	Исключение
	КонецПопытки;

	
	Попытка	
		СтрокаРасшифровки = мМакет.ПолучитьОбласть("СтрокаРасшифровки");
	Исключение
	КонецПопытки;

	//// БИТ_ЖКХ 25.10.2017 15:19:30 Начало правки... 
	////Попытка	
	////	ОбластьШапкаПоставщики = мМакет.ПолучитьОбласть("ШапкаПоставщики");
	////Исключение
	////КонецПопытки;
	////
	////Попытка	
	////	ОбластьПоставщики = мМакет.ПолучитьОбласть("Поставщики");
	////Исключение
	////КонецПопытки;
	//// БИТ_ЖКХ 25.10.2017 15:19:33 Конец правки. 
	
	Попытка	
		ОбластьШапкаСправочнаяИнформация = мМакет.ПолучитьОбласть("ШапкаСправочнаяИнформация");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьСправочнаяИнформацияСтрока = мМакет.ПолучитьОбласть("СправочнаяИнформацияСтрока");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьСправочнаяИнформацияИнфоПИ = мМакет.ПолучитьОбласть("СправочнаяИнформацияИнфоПИ");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьШапкаПерерасчеты = мМакет.ПолучитьОбласть("ШапкаПерерасчеты");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьПерерасчеты = мМакет.ПолучитьОбласть("Перерасчеты");
	Исключение
	КонецПопытки;
	
	Попытка	
		ОбластьИтогРассрочка = мМакет.ПолучитьОбласть("ИтогРассрочка");
	Исключение
	КонецПопытки;

	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты   = мСтруктураДанных.КОплате + мСтруктураДанных.ПроцентОтОплаты;
	мСтруктураДанных.ИтогоКОплатеСУчетомПени         = мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты + мСтруктураДанных.ИтогПени;
	
	Попытка
		СуммаШтрихКода = мСтруктураДанных[мНастройкиМакета.ПолеСуммыШК];
	Исключение
		СуммаШтрихКода = 0;
	КонецПопытки;
	
	// Линейный штрихкод (ШК) для всех областей.
	Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
		
		Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Попытка
			Рисунок = ОбластьШапкаДокумента.Рисунки.Шк;
			Рисунок1 = ОбластьПолучатель.Рисунки.Шк1;
			Рисунок2 = ОбластьПолучатель.Рисунки.Шк2;
		Исключение
		КонецПопытки;
		
		Попытка
			ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
			мСтруктураДанных.ЛицевойСчетНомер,
			ШаблонИзвещений.Идентификатор,
			мСтруктураДанных.ЛицевойСчет.Идентификатор,
			мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
			мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
			
			КартинкаШК = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода); 
			Рисунок.Картинка	= КартинкаШК;
			Рисунок1.Картинка	= КартинкаШК;
			Рисунок2.Картинка	= КартинкаШК;
		Исключение
		КонецПопытки;
		
	Иначе
		
		Попытка
			ОбластьШапкаДокумента.Рисунки.очистить();
			УбратьШККод(ОбластьПолучатель);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	// ОбластьШапкаДокумента.
	Попытка
		ОбластьШапкаДокумента.Параметры.Заполнить(мСтруктураДанных);
		//Если Объект.Ссылка.Здание.КонтактнаяИнформация.Количество() > 0 Тогда 
		//	АдресПроживания       = ?(ЗначениеЗаполнено(Объект.Ссылка.Здание.ПочтовыйАдрес),Строка(Объект.Ссылка.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(Объект.Квартира), ", кв." + Строка(Объект.Квартира),""),Адрес);
		//Иначе
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				
				ОбластьШапкаДокумента.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				ОбластьШапкаДокумента.Параметры.Значение = мТаблицаСвойств[0].Значение;
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Попытка
		Результат.Вывести(ОбластьШапкаДокумента);
	Исключение
	КонецПопытки;
	
	// ОбластьШапкаПриборыУчета.
	Попытка
		Результат.Вывести(ОбластьШапкаПриборыУчета);
	Исключение
	КонецПопытки;
	
	// СтрокаПриборовУчета.
	Для каждого СтрокаТаблицы Из мТаблицаПечатиСчетчиков Цикл
		
		Попытка
			СтрокаПриборовУчета.Параметры.Заполнить(СтрокаТаблицы);
			ЗаполнитьПараметр(СтрокаПриборовУчета, "Услуга", СтрокаТаблицы.СокрНаименование);
			Результат.Вывести(СтрокаПриборовУчета);
		Исключение
		КонецПопытки;
		
	КонецЦикла; 
	
	// ОбластьПодтверждениеДанных.
	Попытка
		Результат.Вывести(ОбластьПодтверждениеДанных);
	Исключение
	КонецПопытки;
	
	// ОбластьПолучатель.
	Попытка
		ЗаполнитьЗначенияСвойств(ОбластьПолучатель.Параметры, мСтруктураДанных, "ЛицевойСчет, ЛицевойСчетФио, ЛицевойСчетАдрес, ЕЛС, ИдентификаторПД");
	  //ОбластьПолучатель.Параметры.ЛицевойСчет						= мСтруктураДанных.ЛицевойСчет;
	  //  ОбластьПолучатель.Параметры.ЛицевойСчетФио					= мСтруктураДанных.ЛицевойСчетФио;
	  //  ОбластьПолучатель.Параметры.ЛицевойСчетАдрес				= мСтруктураДанных.ЛицевойСчетАдрес;
		ОбластьПолучатель.Параметры.Заполнить(мКэшПолучателяПлатежа);
		ОбластьПолучатель.Параметры.Период							= ВРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
		ОбластьПолучатель.Параметры.ИтогоКОплатеСУчетомПредоплаты	= ПолучитьСуммуСтрокой(мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты);
		Результат.Вывести(ОбластьПолучатель);
	Исключение
	КонецПопытки;	
	
	// ОбластьКвитанция.
	Попытка
		ОбластьКвитанция.Параметры.ОрганизацияПредставление	= мСтруктураДанных.ПолучательПредставление;
		ОбластьКвитанция.Параметры.ОрганизацияИНН			= мСтруктураДанных.ПолучательИНН;
		ОбластьКвитанция.Параметры.ОрганизацияКПП			= мСтруктураДанных.ПолучательКПП;
		ОбластьКвитанция.Параметры.ОрганизацияДопИнформация	= мСтруктураДанных.ПолучательДопИнформация;
		ОбластьКвитанция.Параметры.ОрганизацияАдрес			= мСтруктураДанных.ПолучательАдрес;
		ОбластьКвитанция.Параметры.Заполнить(мКэшПолучателяПлатежа);
		ОбластьКвитанция.Параметры.ЛицевойСчет			= мСтруктураДанных.ЛицевойСчет;
		ОбластьКвитанция.Параметры.ЛицевойСчетФио		= мСтруктураДанных.ЛицевойСчетФио;
		ОбластьКвитанция.Параметры.ЛицевойСчетАдрес		= мСтруктураДанных.ЛицевойСчетАдрес;
		ОбластьКвитанция.Параметры.ДатаПоследнейОплаты	= мСтруктураДанных.ДатаПоследнейОплаты;
		ОбластьКвитанция.Параметры.ОплатитьДо			= мСтруктураДанных.ОплатитьДо;
		ОбластьКвитанция.Параметры.Период				= ВРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
		ОбластьКвитанция.Параметры.ИтогоКОплатеСУчетомПредоплаты = ПолучитьСуммуСтрокой(мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты);
		ОбластьКвитанция.Параметры.СтатусКвартиры		= Строка(мСтруктураДанных.СтатусКвартиры);
		ОбластьКвитанция.Параметры.ТипКвартиры			= Строка(мСтруктураДанных.ТипКвартиры);
		ОбластьКвитанция.Параметры.ОписаниеОбщейПлощади	= мСтруктураДанных.ОписаниеОбщейПлощади;
		ОбластьКвитанция.Параметры.ОписаниеЖилойПлощади	= мСтруктураДанных.ОписаниеЖилойПлощади;
		ОбластьКвитанция.Параметры.КоличествоЗарегистрированных	= мСтруктураДанных.КоличествоЗарегистрированных;
		ОбластьКвитанция.Параметры.КоличествоПроживающих		= мСтруктураДанных.КоличествоПроживающих;
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета,
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства,
	|	ЕСТЬNULL(бит_ЗначениеСвойствОбъектовУчета.Значение, 0) КАК Значение
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета = &Здание";
	
	Запрос.УстановитьПараметр("Здание", мСтруктураДанных.ЛицевойСчет.Здание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПлощадьЖилыхНежилых = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания") Тогда
			ЗаполнитьПараметр(ОбластьКвитанция, "ОбщаяПлощадьДома", ВыборкаДетальныеЗаписи.Значение);
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений") Тогда 	
			ЗаполнитьПараметр(ОбластьКвитанция, "ЖилыеПомещения", ВыборкаДетальныеЗаписи.Значение);
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидСвойства = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования") Тогда
			ЗаполнитьПараметр(ОбластьКвитанция, "МестОбщегоПользования", ВыборкаДетальныеЗаписи.Значение);
			
		КонецЕсли;	
		
	КонецЦикла;
	ЗаполнитьПараметр(ОбластьКвитанция, "ПлощадьЖилыхНежилых", ПлощадьЖилыхНежилых);

	Попытка
		Результат.Вывести(ОбластьКвитанция);
	Исключение
	КонецПопытки;		
	
	
	////Если НЕ мВнешняяКомпонента = Неопределено И мНастройкиМакета.ФормироватьШтрихКод Тогда
	////	
	////	
	////	Эталон = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("Эталон");
	////	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	////	
	////	Попытка
	////		Рисунок = ОбластьШтрихКод.Рисунки.Шк2;
	////	Исключение
	////	КонецПопытки;
	////	
	////	Попытка    
	////		ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(?(СуммаШтрихКода < 0 ,0, СуммаШтрихКода),
	////		мСтруктураДанных.ЛицевойСчетНомер,
	////		ШаблонИзвещений.Идентификатор,
	////		мСтруктураДанных.ЛицевойСчет.Идентификатор,
	////		мКэшПараметрыЖКХ.НомерПолучателяПоБанку,
	////		мКэшПараметрыЖКХ.ИспользоватьНомерПолучателяВШК);
	////		
	////		ПараметрыШтрихкода = Новый Структура;
	////		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
	////		ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
	////		ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
	////		ПараметрыШтрихкода.Вставить("ТипКода",         4);
	////		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
	////		ПараметрыШтрихкода.Вставить("РазмерШрифта",    8);
	////		
	////		Рисунок.Картинка = ПолучитьКартинкуШтрихкода(мВнешняяКомпонента, ПараметрыШтрихкода);
	////	Исключение
	////	КонецПопытки;
	////	
	////	Попытка
	////		Результат.Вывести(ОбластьШтрихКод);
	////	Исключение
	////	КонецПопытки;
	////	
	////Иначе
	////	
	////	Попытка
	////		ОбластьШтрихКод.Рисунки.очистить();
	////	Исключение
	////	КонецПопытки;
	////	
	////КонецЕсли;
	
	
	// ОбластьШапкаРасчета.
	Попытка
		ОбластьШапкаРасчета.Параметры.Период	= ВРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
		ОбластьШапкаРасчета.Параметры.НРегПериод= НРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
		Результат.Вывести(ОбластьШапкаРасчета);
	Исключение
	КонецПопытки;		
	
	КодПоставщика = 0;
	Мас = Новый Массив;
	Попытка
		Мас.Добавить(СтрокаРасшифровки);
		Мас.Добавить(ОбластьИтогоБез);
		Мас.Добавить(СтрокаДобрСтрах);
		Мас.Добавить(ОбластьИтогоС);
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, Мас) Тогда
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	Исключение
	КонецПопытки;		
	
	ТабДокСодержаниеРемонтУсл = Новый ТабличныйДокумент;
	ТабДокСодержаниеРемонтУсл.Вывести(ОбластьГруппаСодержание);
	ТабДокКоммунальныеУсл = Новый ТабличныйДокумент;
	ТабДокКоммунальныеУсл.Вывести(ОбластьГруппаКоммунальные);
	ТабДокПрочиеУсл	= Новый ТабличныйДокумент;
	ТабДокПрочиеУсл.Вывести(ОбластьГруппаПрочие);
	ИтогоТабДокСодержаниеРемонтУсл = 0;
	ИтогоТабДокКоммунальныеУсл	   = 0;
	
	ИтогоТабДокНачислено= 0;
	ИтогоТабДокРазовые	= 0;
	ИтогоТабДокСальдо	= 0;
	ИтогоТабДокОплата	= 0;
	
	Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
		
		Если НеПечататьУслугиБезНачислений(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРасшифровки.Параметры.Заполнить(СтрокаТаблицы);
		ИтогоТабДокНачислено= ИтогоТабДокНачислено + СтрокаТаблицы.Начислено;
		ИтогоТабДокРазовые	= ИтогоТабДокРазовые + СтрокаТаблицы.Разовые;
		ИтогоТабДокСальдо	= ИтогоТабДокСальдо + СтрокаТаблицы.Сальдо;
		ИтогоТабДокОплата	= ИтогоТабДокОплата + СтрокаТаблицы.Оплата;
		
		//Если (СтрокаТаблицы.ОбъемИНД = 0 И СтрокаТаблицы.ОбъемОбщДом = 0)
		//	ИЛИ (СтрокаТаблицы.ОбъемИНД <> 0 И СтрокаТаблицы.ОбъемОбщДом = 0) Тогда
		//	СтрокаРасшифровки.Параметры.ВидУсл = "инд.";
		//ИначеЕсли СтрокаТаблицы.ОбъемОбщДом <> 0 И СтрокаТаблицы.ОбъемИНД <> 0 Тогда
		//	СтрокаРасшифровки.Параметры.ВидУсл = "инд./ОДН";
		//Иначе
		//	СтрокаРасшифровки.Параметры.ВидУсл = "ОДН";
		//КонецЕсли;
		
		Если СтрокаТаблицы.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание")
			ИЛИ СтрокаТаблицы.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм")
			ИЛИ СтрокаТаблицы.ГрафаОтчетаГЦЖС = ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт") Тогда
			
			ТабДокСодержаниеРемонтУсл.Вывести(СтрокаРасшифровки);
			ИтогоТабДокСодержаниеРемонтУсл = ИтогоТабДокСодержаниеРемонтУсл + СтрокаТаблицы.КОплатеЗаМесяц;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицы.ГрафаОтчетаГЦЖС) Тогда	
			
			ТабДокПрочиеУсл.Вывести(СтрокаРасшифровки);
			
		Иначе 
			
			ТабДокКоммунальныеУсл.Вывести(СтрокаРасшифровки);
			ИтогоТабДокКоммунальныеУсл = ИтогоТабДокКоммунальныеУсл + СтрокаТаблицы.КОплатеЗаМесяц;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ТабДокСодержаниеРемонтУсл.ВысотаТаблицы > 1 Тогда
		//ОбластьГруппаСодержаниеИтого.Параметры.Период = НРег(мСтруктураДанных.Период);
		//ОбластьГруппаСодержаниеИтого.Параметры.ИтогоСодержание = ИтогоТабДокСодержаниеРемонтУсл;
		//ТабДокСодержаниеРемонтУсл.Вывести(ОбластьГруппаСодержаниеИтого);
		Результат.Вывести(ТабДокСодержаниеРемонтУсл);
	КонецЕсли;
	
	Если ТабДокКоммунальныеУсл.ВысотаТаблицы > 1 Тогда
		//ОбластьГруппаКоммунальныеИтого.Параметры.Период = НРег(мСтруктураДанных.Период);
		//ОбластьГруппаКоммунальныеИтого.Параметры.ИтогоКоммУсл = ИтогоТабДокКоммунальныеУсл;
		//ТабДокКоммунальныеУсл.Вывести(ОбластьГруппаКоммунальныеИтого);
		Результат.Вывести(ТабДокКоммунальныеУсл);
	КонецЕсли;
	
	Если ТабДокПрочиеУсл.ВысотаТаблицы > 1 Тогда
		Результат.Вывести(ТабДокПрочиеУсл);
	КонецЕсли;
	
	Попытка
		ОбластьИтогоБез.Параметры.КОплатеЗаМесяц		= мСтруктураДанных.КОплатеЗаМесяц;
		ОбластьИтогоБез.Параметры.ИтогоТабДокНачислено	= ИтогоТабДокНачислено;
		ОбластьИтогоБез.Параметры.ИтогоТабДокРазовые	= ИтогоТабДокРазовые;
		ОбластьИтогоБез.Параметры.ИтогоТабДокСальдо		= ИтогоТабДокСальдо;
		ОбластьИтогоБез.Параметры.ИтогоТабДокОплата		= ИтогоТабДокОплата;
		ОбластьИтогоБез.Параметры.Период				= НРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
		Результат.Вывести(ОбластьИтогоБез);
	Исключение
	КонецПопытки;		
	
	Попытка
		Результат.Вывести(СтрокаДобрСтрах);
	Исключение
	КонецПопытки;		
	
	Попытка
		ОбластьИтогоС.Параметры.КОплатеЗаМесяц		= мСтруктураДанных.КОплатеЗаМесяц;
		ОбластьИтогоС.Параметры.ИтогоТабДокНачислено= ИтогоТабДокНачислено;
		ОбластьИтогоС.Параметры.ИтогоТабДокРазовые	= ИтогоТабДокРазовые;
		ОбластьИтогоС.Параметры.ИтогоТабДокСальдо	= ИтогоТабДокСальдо;
		ОбластьИтогоС.Параметры.ИтогоТабДокОплата	= ИтогоТабДокОплата;
		ОбластьИтогоС.Параметры.Период				= НРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
		Результат.Вывести(ОбластьИтогоС);
	Исключение
	КонецПопытки;	
	
	// БИТ ЖКХ 15.04.2021
	Попытка
		ОбластьИтогоПени.Параметры.Период		    = НРег(Формат(мСтруктураДанных.Дата, "ДФ=ММММ")) + " " + мСтруктураДанных.ПериодГод + "г.";
		
		// БИТ ЖКХ 20.04.2021
		для каждого СтрокаПараметра из мСтруктураДанных цикл		
		 если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбластьИтогоПени.Параметры, СтрокаПараметра.Ключ) тогда
		  ОбластьИтогоПени.Параметры[СтрокаПараметра.Ключ] = мСтруктураДанных[СтрокаПараметра.Ключ];													
	     конецесли; 
		конеццикла;	 
		
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбластьИтогоПени.Параметры, "ПеняЗаПериод") тогда
		 ОбластьИтогоПени.Параметры.ПеняЗаПериод	    	 = мСтруктураДанных.ВходящееСальдоПени;											
	    конецесли; 
	    если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбластьИтогоПени.Параметры, "ВсегоПениЗаПериод") тогда
		 ОбластьИтогоПени.Параметры.ВсегоПениЗаПериод     = мСтруктураДанных.НачисленоПениЗаПериод;						
		конецесли; 
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбластьИтогоПени.Параметры, "ВсегоПени") тогда
		 ОбластьИтогоПени.Параметры.ВсегоПени		     = мСтруктураДанных.ИтогПени;											
		конецесли; 
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбластьИтогоПени.Параметры, "КОплатеБезСтрахования") тогда
		 ОбластьИтогоПени.Параметры.КОплатеБезСтрахования = мСтруктураДанных.ИтогоКОплатеСУчетомПени;													
	    конецесли; 
	    если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбластьИтогоПени.Параметры, "КОплатеСоСтрахованием") тогда
		 ОбластьИтогоПени.Параметры.КОплатеСоСтрахованием = мСтруктураДанных.ИтогоКОплатеСУчетомПени;													
	    конецесли; 
	 
			 
		Результат.Вывести(ОбластьИтогоПени);
	Исключение
	КонецПопытки;	
	
	Результат.ВывестиГоризонтальныйРазделительСтраниц();
	
	// ОбластьШапкаСправочнаяИнформация.
	Попытка
		ОбластьШапкаСправочнаяИнформация.Параметры.Заполнить(мСтруктураДанных);
		
		Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
			
			Попытка
				ОбластьШапкаСправочнаяИнформация.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
				ОбластьШапкаСправочнаяИнформация.Параметры.Значение = мТаблицаСвойств[0].Значение;
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Результат.Вывести(ОбластьШапкаСправочнаяИнформация);
		
	Исключение
	КонецПопытки;
	
	Попытка
		НомерПункта = 1;
		// Индвидуальные сч.
		Для каждого Строка из мТаблицаПечатиСчетчиков Цикл

			Если Не ЗначениеЗаполнено(Строка.Счетчик)  Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.Заполнить(Строка);
			ОбластьСправочнаяИнформацияСтрока.Параметры.НомерПункта = НомерПункта; 
			ОбластьСправочнаяИнформацияСтрока.Параметры.ВидПУ	 = "ИПУ";
			ОбластьСправочнаяИнформацияСтрока.Параметры.ИтогоОбъемОбщедомовых = Строка.ОбъемОбщДом;
			
			СтрУслуга = мТаблицаПечати.Найти(Строка.Услуга, "Услуга");
			Если НЕ СтрУслуга = Неопределено Тогда
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативИНД",	   СтрУслуга.НормативИНД);
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативОбщДом", СтрУслуга.НормативОбщДом);
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "ОбъемОбщийИнд",  СтрУслуга.ИтогоОбъемИнд);
			КонецЕсли;
			
			Результат.Вывести(ОбластьСправочнаяИнформацияСтрока);
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;	
		
		// Общедомовые сч.
		Для каждого Строка из мТаблицаОбщедомовыхСчетчиков Цикл
			
			Если Не ЗначениеЗаполнено(Строка.Счетчик)  Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.Заполнить(Строка);
			ОбластьСправочнаяИнформацияСтрока.Параметры.НомерПункта = НомерПункта; 
			ОбластьСправочнаяИнформацияСтрока.Параметры.ВидПУ		= "ОДПУ";
			
			СтрУслуга = мТаблицаПечати.Найти(Строка.Услуга, "Услуга");
			Если НЕ СтрУслуга = Неопределено Тогда
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативИНД",	   СтрУслуга.НормативИНД);
				ЗаполнитьПараметр(ОбластьСправочнаяИнформацияСтрока, "НормативОбщДом", СтрУслуга.НормативОбщДом);
			КонецЕсли;
			
			ОбластьСправочнаяИнформацияСтрока.Параметры.ОбъемОбщийИнд = Строка.ИтогоОбъемИндИПУ + Строка.ИтогоОбъемИндНорматив;
			Результат.Вывести(ОбластьСправочнаяИнформацияСтрока);
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;	
		
	Исключение
		
	КонецПопытки;
	
	Попытка
		Результат.Вывести(ОбластьСправочнаяИнформацияИнфоПИ);
	Исключение
	КонецПопытки;
	
	// ОбластьШапкаПерерасчеты.
	Попытка
		Результат.Вывести(ОбластьШапкаПерерасчеты);
	Исключение
	КонецПопытки;		
	
	Для каждого СтрокаТаблицы Из мТаблицаПерерасчетов Цикл
		
		Попытка
			ОбластьПерерасчеты.Параметры.Заполнить(СтрокаТаблицы);
			ОбластьПерерасчеты.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
			Результат.Вывести(ОбластьПерерасчеты);
		Исключение
		КонецПопытки;		
		
	КонецЦикла; 

	Попытка
		Результат.Вывести(ОбластьИтогРассрочка);
	Исключение
	КонецПопытки;		
	
	//// БИТ_ЖКХ 25.10.2017 15:19:18 Начало правки... 
	////Попытка
	////	Результат.Вывести(ОбластьШапкаПоставщики);
	////Исключение
	////КонецПопытки;		
	//
	////КодПоставщика = 0;
	////
	////ПредыдущийПоставщик = Неопределено;
	////ПредыдущийДолг            = Неопределено;
	////ПредыдущаяОплата          = Неопределено;
	////ПредыдущийПени            = Неопределено;
	////ПредыдущийКОплатеЗаМесяц  = Неопределено;
	////ПредыдущийКОплате         = Неопределено;
	////
	////мТаблицаПечати.Сортировать("Поставщик");
	////
	////ПараметрЛицевойСчет = мСтруктураДанных.ЛицевойСчет;
	////
	////Запрос = Новый Запрос;
	////Запрос.Текст = 
	////"ВЫБРАТЬ
	////|	ОрганизацииКонтактнаяИнформация.Тип,
	////|	ОрганизацииКонтактнаяИнформация.Вид,
	////|	ОрганизацииКонтактнаяИнформация.Представление,
	////|	ОрганизацииКонтактнаяИнформация.Ссылка
	////|ИЗ
	////|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	////|ГДЕ
	////|	ОрганизацииКонтактнаяИнформация.Ссылка = &Поставщик";
	////
	////Запрос2 = Новый Запрос;
	////Запрос2.Текст = 
	////"ВЫБРАТЬ
	////|	КонтрагентыКонтактнаяИнформация.Тип,
	////|	КонтрагентыКонтактнаяИнформация.Вид,
	////|	КонтрагентыКонтактнаяИнформация.Представление,
	////|	КонтрагентыКонтактнаяИнформация.Ссылка
	////|ИЗ
	////|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	////|ГДЕ
	////|	КонтрагентыКонтактнаяИнформация.Ссылка = &Поставщик";
	////
	////ПредыдущаяОбласть = Ложь;  
	////
	////Для каждого СтрокаТаблицы Из мТаблицаПечати Цикл
	////	
	////	Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
	////		
	////		Если ТипЗнч(СтрокаТаблицы.Поставщик) = Тип("СправочникСсылка.Организации") Тогда
	////			
	////			Запрос.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик);
	////			РезультатЗапроса = Запрос.Выполнить();
	////		Иначе
	////			
	////			Запрос2.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик);
	////			РезультатЗапроса = Запрос2.Выполнить();
	////			
	////		КонецЕсли;
	////		
	////	Иначе	
	////		
	////		Если ТипЗнч(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Организации") Тогда
	////			
	////			Запрос.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств);
	////			РезультатЗапроса = Запрос.Выполнить();
	////		Иначе
	////			
	////			Запрос2.УстановитьПараметр("Поставщик",СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств);
	////			РезультатЗапроса = Запрос2.Выполнить();
	////			
	////		КонецЕсли;
	////		
	////	КонецЕсли;
	////	
	////	Если НЕ РезультатЗапроса.Пустой() Тогда
	////		Выборка = РезультатЗапроса.Выбрать();
	////		
	////		Адрес = Неопределено;
	////		Телефон = Неопределено;
	////		
	////		
	////		Пока Выборка.Следующий() Цикл
	////			Если Строка(Выборка.Вид) = "Фактический адрес" ИЛИ  Строка(Выборка.Вид) = "Фактический" Тогда
	////				
	////				Адрес = Выборка.Представление; 	
	////				
	////				
	////			КонецЕсли;
	////			
	////			Если Строка(Выборка.Вид) = "Телефон" Тогда
	////				
	////				Телефон = Строка("Тел: " + Выборка.Представление); 	
	////				
	////			КонецЕсли;
	////			
	////		КонецЦикла; 
	////		Попытка
	////			Если Адрес = Неопределено и Телефон <> Неопределено Тогда
	////				Адрес = "";
	////			ИначеЕсли Телефон = Неопределено и Адрес <> Неопределено Тогда
	////				Телефон = "";
	////			КонецЕсли;
	////			
	////			АдресТелефон = Строка(Адрес + "  " + Телефон); 
	////		Исключение
	////			АдресТелефон = "Нет";	
	////		КонецПопытки;
	////		
	////	Иначе
	////		АдресТелефон = "Нет";	
	////	КонецЕсли;
	////	
	////	Попытка
	////		
	////		Если КодПоставщика = 0 Тогда
	////			ОбластьПоставщики.Параметры.ЛицевойСчет = ПараметрЛицевойСчет;
	////			КодПоставщика = КодПоставщика + 1;
	////			ОбластьПоставщики.Параметры.Заполнить(СтрокаТаблицы);
	////			
	////			Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
	////				
	////				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
	////				
	////				
	////				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик;		
	////			Иначе	
	////				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств;	
	////				
	////				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(ОбластьПоставщики.Параметры.Поставщик.Код),3);
	////				
	////			КонецЕсли;
	////			
	////			Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
	////				ОбластьПоставщики.Параметры.Долг = ОбластьПоставщики.Параметры.Долг - СтрокаТаблицы.ПереплатаНаНачало;
	////			КонецЕсли;
	////			
	////			ПредыдущаяОбласть = ОбластьПоставщики;
	////			ПредыдущийАдресТелефон = АдресТелефон;
	////		ИначеЕсли ?(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"),СтрокаТаблицы.Поставщик,СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) = ПредыдущаяОбласть.Параметры.Поставщик Тогда
	////			Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
	////				ПредыдущаяОбласть.Параметры.Долг = ПредыдущаяОбласть.Параметры.Долг + СтрокаТаблицы.Долг - СтрокаТаблицы.ПереплатаНаНачало;
	////			Иначе	
	////				ПредыдущаяОбласть.Параметры.Долг = ПредыдущаяОбласть.Параметры.Долг + СтрокаТаблицы.Долг; 
	////			КонецЕсли;
	////			ПредыдущаяОбласть.Параметры.Оплата         = ПредыдущаяОбласть.Параметры.Оплата + СтрокаТаблицы.Оплата;
	////			ПредыдущаяОбласть.Параметры.Пени           = ПредыдущаяОбласть.Параметры.Пени + СтрокаТаблицы.Пени;
	////			ПредыдущаяОбласть.Параметры.КОплатеЗаМесяц = ПредыдущаяОбласть.Параметры.КОплатеЗаМесяц + СтрокаТаблицы.КОплатеЗаМесяц;
	////			ПредыдущаяОбласть.Параметры.КОплате        = ПредыдущаяОбласть.Параметры.КОплате + СтрокаТаблицы.КОплате;
	////		ИначеЕсли ?(СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"),СтрокаТаблицы.Поставщик,СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств) <> ПредыдущаяОбласть.Параметры.Поставщик И  ПредыдущаяОбласть <> Ложь Тогда
	////			ЗаполнитьПараметр(ПредыдущаяОбласть, "АдресИТелефонПоставщика", ПредыдущийАдресТелефон);	
	////			Результат.Вывести(ПредыдущаяОбласть);
	////			ОбластьПоставщики.Параметры.ЛицевойСчет = ПараметрЛицевойСчет;
	////			КодПоставщика = КодПоставщика + 1;
	////			ОбластьПоставщики.Параметры.Заполнить(СтрокаТаблицы);
	////			
	////			Если СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = Неопределено Или СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
	////				
	////				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(СтрокаТаблицы.Поставщик.Код),3);
	////				
	////				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик;		
	////			Иначе	
	////				ОбластьПоставщики.Параметры.Поставщик = СтрокаТаблицы.Поставщик.ПолучательДенежныхСредств;
	////				
	////				ОбластьПоставщики.Параметры.КодПоставщика = Прав(Строка(ОбластьПоставщики.Параметры.Поставщик.Код),3);
	////				
	////			КонецЕсли;
	////			
	////			Если мНастройкиМакета.СУчетомПереплатыКОплате Тогда
	////				ОбластьПоставщики.Параметры.Долг = ОбластьПоставщики.Параметры.Долг - СтрокаТаблицы.ПереплатаНаНачало;
	////			КонецЕсли;
	////			
	////			ПредыдущаяОбласть = ОбластьПоставщики;
	////			ПредыдущийАдресТелефон = АдресТелефон;
	////			
	////		КонецЕсли;
	////		
	////	Исключение
	////	КонецПопытки;
	////	
	////КонецЦикла; 
	////
	////Попытка
	////	ЗаполнитьПараметр(ПредыдущаяОбласть, "АдресИТелефонПоставщика", ПредыдущийАдресТелефон);	
	////	Результат.Вывести(ПредыдущаяОбласть);
	////Исключение
	////КонецПопытки;
	//// БИТ_ЖКХ 25.10.2017 15:19:23 Конец правки. 
	
	////
	////Попытка
	////	
	////	ОбластьСправочнаяИнформацияПримечание.Параметры.Заполнить(мСтруктураДанных);
	////	
	////	Если НЕ мТаблицаСвойств.Количество() = 0 Тогда
	////		
	////		Попытка
	////			
	////			ОбластьСправочнаяИнформацияПримечание.Параметры.Свойство = Лев(мТаблицаСвойств[0].Свойство,СтрДлина(мТаблицаСвойств[0].Свойство)-16);
	////			
	////			ОбластьСправочнаяИнформацияПримечание.Параметры.Значение = мТаблицаСвойств[0].Значение;
	////			
	////		Исключение
	////		КонецПопытки;
	////		
	////	КонецЕсли;
	////	
	////	Результат.Вывести(ОбластьСправочнаяИнформацияПримечание);
	////Исключение
	////	
	////КонецПопытки;
	
	// Обращение.
	Если ЗначениеЗаполнено(Обращение) Тогда
		
		ОбращениеКГражданам = мМакет.ПолучитьОбласть("Обращение");
		ЗаполнитьПараметр(ОбращениеКГражданам, "Обращение", "" + Обращение);
		
		Результат.Вывести(ОбращениеКГражданам);
		
	КонецЕсли;
	
	// Вывод замечаний по лицевому счету.
	Если мКэшПараметрыЖКХ.ВыводитьЗамечанияЖКХ Тогда
		ВывестиЗамечания(Результат, мСтруктураДанных.ЛицевойСчет);
	КонецЕсли; 
	
	Если ИспользоватьQR = Истина Тогда
		
		Попытка	
			ОбластьШтрихкодQR                   = мМакет.ПолучитьОбласть("ШтрихкодQR");
		Исключение
		КонецПопытки;
		
		НапечататьQRКод(Результат, ОбластьШтрихкодQR);
	Иначе
		УбратьQRКод(Результат)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура Заполняет параметр.
Процедура ЗаполнитьПараметр(Область, ИмяПараметра, ЗначениеПараметра)
	
	Попытка
		
		Область.Параметры[ИмяПараметра] = ЗначениеПараметра;
		
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФормированияШтрихкода

// Функция выполняет подключение внешней компоненты и ее первоначальную настройку.
// 
// Параметры: 
//  Нет. 
// 
// Возвращаемое значение: 
//  Картинка - Картинка со сформированным штрихкодом или НЕОПРЕДЕЛЕНО.
Функция ПодключитьВнешнююКомпонентуПечатиШтрихкода() Экспорт
	
	// В зависимости от типа платформы подключим соответствующую внешнюю компоненту.
	ПодключениеВыполнено = Неопределено;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.бит_ПечатьСчетИзвещений.Макет.КомпонентаПечатиШтрихкодовWindows32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.бит_ПечатьСчетИзвещений.Макет.КомпонентаПечатиШтрихкодовWindows64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.бит_ПечатьСчетИзвещений.Макет.КомпонентаПечатиШтрихкодовLinux32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	Иначе
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.бит_ПечатьСчетИзвещений.Макет.КомпонентаПечатиШтрихкодовLinux64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	КонецЕсли;
	
	// Создадим объект внешней компоненты.
	Если ПодключениеВыполнено Тогда
		мВнешняяКомпонента = Новый("AddIn.КартинкаШтрихкода.Barcode");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет возможности рисовать.
	Если НЕ мВнешняяКомпонента.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем.
		Возврат Неопределено;
	Иначе
		
		// Установим основные параметры компоненты.
		
		// Если в системе установлен шрифт Tahoma.
		Если мВнешняяКомпонента.НайтиШрифт("Tahoma") = Истина Тогда
			// Выбираем его как шрифт для формирования картинки.
			мВнешняяКомпонента.Шрифт = "Tahoma";
		Иначе
			
			// Шрифт Tahoma в системе отсутствует.
			// Обойдем все доступные компоненте шрифты.
			Для Сч = 0 По мВнешняяКомпонента.КоличествоШрифтов -1 Цикл
				// Получим очередной шрифт, доступный компоненте.
				ТекущийШрифт = мВнешняяКомпонента.ШрифтПоИндексу(Сч);
				// Если шрифт доступен.
				Если ТекущийШрифт <> Неопределено Тогда
					// Они и будет шрифтом для формирования штри-кода.
					мВнешняяКомпонента.Шрифт = ТекущийШрифт;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Утановим размер шрифта.
		мВнешняяКомпонента.РазмерШрифта = 12;
		
		Возврат мВнешняяКомпонента;
		
	КонецЕсли;
	
КонецФункции

// Функция выполняет формирование изображения штрихкода.
// 
// Параметры: 
//  ВнешняяКомпонента, ПараметрыШтрихкода.
// 
// Возвращаемое значение: 
//  Картинка - Картинка со сформированным штрихкодом или НЕОПРЕДЕЛЕНО.
Функция ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода) Экспорт
	
	// Зададим размер картинки.
	мВнешняяКомпонента.Ширина = ПараметрыШтрихкода.Ширина;
	мВнешняяКомпонента.Высота = ПараметрыШтрихкода.Высота;
	
	// Разрешим компоненте самой определять тип кода.
	мВнешняяКомпонента.АвтоТип = Ложь;
	мВнешняяКомпонента.ТипКода         = ПараметрыШтрихкода.ТипКода;
	мВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	Попытка
		мВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	Исключение
		
	КонецПопытки;
	
	мВнешняяКомпонента.СодержитКС = СтрДлина(ПараметрыШтрихкода.Штрихкод) = 43;
	
	// Если отображать контрольный символ не нужно.
	мВнешняяКомпонента.ВидимостьКС = Ложь;
	
	// Формируем картинку штрихкода.
	мВнешняяКомпонента.ЗначениеКода = ПараметрыШтрихкода.Штрихкод;
	
	// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
	Если мВнешняяКомпонента.Ширина < мВнешняяКомпонента.МинимальнаяШиринаКода Тогда
		// Скорректируем ширину.
		мВнешняяКомпонента.Ширина = мВнешняяКомпонента.МинимальнаяШиринаКода + 10;
	КонецЕсли;
	
	// Сформируем картинку.
	ДвоичныеДанныеКартинки = мВнешняяКомпонента.ПолучитьШтрихкод();
	
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		// Формируем из двоичных данных.
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура УбратьШККод(ТабДок)
	
	РисункиШК = Новый Массив;
	Для Каждого Рис Из ТабДок.Рисунки Цикл
		Если СтрНайти(НРег(Рис.Имя), "шк") > 0 Тогда
			РисункиШК.Добавить(Рис);
		КонецЕсли;
	КонецЦикла;
	Если РисункиШК.Количество() > 0 Тогда
		Для Каждого РисШК Из РисункиШК Цикл
			ТабДок.Рисунки.Удалить(РисШК);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПечатиДополнительнойИнформации

Функция СформироватьДонесениеОПоказанияхВодосчетчиков(ЛицевойСчет, ОтветсвенноеЛицо, Дата) Экспорт
	
	Донесение = Новый ТабличныйДокумент;
	
	Донесение.АвтоМасштаб = Истина;
	Донесение.ПолеСверху  = 0;
	Донесение.ПолеСнизу   = 0;
	
	Если мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент Тогда
		Донесение.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Иначе
		Донесение.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	КонецЕсли;
	
	Макет = ПолучитьМакет("СрочноеДонесениеОПоказанияхВодосчетчиков");
	
	Шапка  = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТаблицаСтрок = Новый ТабличныйДокумент;
	
	Запрос= Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Дата"       , КонецМесяца(Дата));
	Запрос.УстановитьПараметр("СписокГЦЖС" , СписокГЦЖС);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС
	|ПОМЕСТИТЬ Счетчики
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &ЛицевойСчет
	|				И НЕ Многотарифный
	|				И Услуга.ГрафаОтчетаГЦЖС В (&СписокГЦЖС)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счетчики.Счетчик КАК Счетчик,
	|	Счетчики.МестоУстановкиСчетчика КАК Комната,
	|	МАКСИМУМ(бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияНачальныйОстаток) КАК НачПок,
	|	МАКСИМУМ(бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток) КАК КонПок
	|ИЗ
	|	Счетчики КАК Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, 1), МЕСЯЦ), КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, 1), МЕСЯЦ), , , ) КАК бит_ПоказанияСчетчиковОстаткиИОбороты
	|		ПО Счетчики.Счетчик = бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик
	|			И Счетчики.Услуга = бит_ПоказанияСчетчиковОстаткиИОбороты.Услуга
	|			И Счетчики.Объект = бит_ПоказанияСчетчиковОстаткиИОбороты.Объект
	|
	|СГРУППИРОВАТЬ ПО
	|	Счетчики.Счетчик,
	|	Счетчики.МестоУстановкиСчетчика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счетчик
	|ИТОГИ ПО
	|	Комната";
	
	ВыборкаКомната = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерПоследнейСтроки = 0;
	НомерПервойСтроки    = 1;
	
	Пока ВыборкаКомната.Следующий() Цикл
		
		Выборка = ВыборкаКомната.Выбрать();
		КоличествоСтрок = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл
			
			Строка.Параметры.Заполнить(Выборка);
			
			ТаблицаСтрок.Вывести(Строка);
			
		КонецЦикла; 
		
		НомерПоследнейСтроки = НомерПоследнейСтроки + КоличествоСтрок; 
		
		Область = ТаблицаСтрок.Область("R"+НомерПервойСтроки+"C1:R"+НомерПоследнейСтроки+"C2");
		Область.Объединить();
		Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		Область.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
		
		НомерПервойСтроки = НомерПоследнейСтроки + 1;
		
	КонецЦикла;
	
	Если ТаблицаСтрок.ВысотаТаблицы = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	Шапка.Параметры.ОтвЛицо     = ОтветсвенноеЛицо;
	Шапка.Параметры.ЛицевойСчет = ЛицевойСчет;
	Шапка.Параметры.ТекМесяц    = Формат(ДобавитьМесяц(Дата, 1), "ДФ= ММММ");
	
	Если Месяц(Дата) = 12 Тогда
		Шапка.Параметры.ЧислоГод    = Прав(Формат(Год(Дата)+1, "ДФ= ММММ"),2);
	Иначе
		Шапка.Параметры.ЧислоГод    = Прав(Формат(Дата, "ДФ= yyyy"), 2);
	КонецЕсли;
	
	Шапка.Параметры.НаименованиеСрочногоДонесения = НаименованиеСрочногоДонесения;
	
	Донесение.Вывести(Шапка);
	Донесение.Вывести(ТаблицаСтрок);
	Донесение.Вывести(Подвал);
	
	Возврат Донесение;
	
КонецФункции

Процедура ВывестиЗамечания(ТабличныйДокумент, Знач ЛицевойСчет)
	
	ЗапросЗамечание = Новый Запрос;
	ЗапросЗамечание.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗамечанияПоЛС.ЛицевойСчет,
	|	бит_ЗамечанияПоЛС.Наименование,
	|	бит_ЗамечанияПоЛС.ТекстЗамечания,
	|	бит_ЗамечанияПоЛС.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.бит_ЗамечанияПоЛС КАК бит_ЗамечанияПоЛС
	|ГДЕ
	|	бит_ЗамечанияПоЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_ЗамечанияПоЛС.Исполнено = ЛОЖЬ
	|	И бит_ЗамечанияПоЛС.ВыводитьНаПечать = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	ЗапросЗамечание.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	РезультатЗапроса = ЗапросЗамечание.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ШапкаЗамечания         = мМакет.ПолучитьОбласть("ШапкаЗамечания");
		ОбластьСтрокаОбращение = мМакет.ПолучитьОбласть("СтрокаОбращение");
		
		ТабличныйДокумент.Вывести(ШапкаЗамечания);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьПараметр(ОбластьСтрокаОбращение, "ОбращениеСтрока", Выборка.Номер + ".  " + Выборка.ТекстЗамечания);
			ТабличныйДокумент.Вывести(ОбластьСтрокаОбращение);
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПлатежныйДокументПени(ВходящееСальдоПени,НачисленоПениЗаПериод,ПолучательКоррСчет,ПолучательБанк,ИтогПени,ПолучательТелефон,ПолучательПредставление,ПолучательКПП,ПолучательИНН,ПолучательРС,ПолучательАдрес,ЛицевойСчет, ОтветсвенноеЛицо, Дата) Экспорт
	
	ДокументПени = Новый ТабличныйДокумент;
	
	ДокументПени.АвтоМасштаб = Истина;
	ДокументПени.ПолеСверху  = 0;
	ДокументПени.ПолеСнизу   = 0;
	
	Если мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ Тогда
		ДокументПени.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Иначе
		ДокументПени.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	КонецЕсли;
	
	Если мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924 
		ИЛИ мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ Тогда 
		
		Макет = ПолучитьМакет("ПлатежныйДокументПени");
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент1 Тогда
		
		Макет = ПолучитьМакет("ПлатежныйДокументПениРКБИТ");
		
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент Тогда 
		
		Макет = ПолучитьМакет("ПлатежныйДокументПениРК354");
	ИначеЕсли мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументПени Тогда 
		
		Макет = ПолучитьМакет("ПлатежныйДокументПениРКБИТ");
		
	КонецЕсли;
	
	Шапка   = Макет.ПолучитьОбласть("Шапка");
	Раздел1 = Макет.ПолучитьОбласть("Раздел1");
	Раздел2 = Макет.ПолучитьОбласть("Раздел2");
	Справка = Макет.ПолучитьОбласть("Справка");
	
	
	Раздел1.Параметры.ЛицевойСчет         = ЛицевойСчет;
	Раздел1.Параметры.ЛицевойСчетФИО      = ОтветсвенноеЛицо;
	Раздел1.Параметры.Период              = Формат(Период,"ДФ=MM.yyyy");
	//Раздел1.Параметры.ЛицевойСчетАдрес    = Строка(ЛицевойСчет.УлицаЛицевогоСчета) +""+ Строка(ЛицевойСчет.Здание);
	Раздел1.Параметры.ЛицевойСчетАдрес    = мСтруктураДанных.ЛицевойСчетАдрес;
		
	Раздел1.Параметры.ПолучательПредставление    =  ПолучательПредставление;
	
	СтруктураАдресаПолучателя = РазбитьСтроку(ПолучательАдрес, 51, "ПолучательАдрес_1", "ПолучательАдрес_2");
	Раздел1.Параметры.Заполнить(СтруктураАдресаПолучателя);
	
	Раздел1.Параметры.ПолучательТелефон            =  ПолучательТелефон;
	Раздел1.Параметры.ПолучательРС               =  ПолучательРС;
	Раздел1.Параметры.ПолучательИНН              =  ПолучательИНН;
	Раздел1.Параметры.ПолучательКПП              =  ПолучательКПП;
	Раздел1.Параметры.ПолучательБанк              =  ПолучательБанк;
	Раздел1.Параметры.ПолучательКоррСчет              =  ПолучательКоррСчет;
	
	Раздел2.Параметры.ПениИтого               =  ИтогПени;
	Раздел2.Параметры.ВходящееСальдоПени       =  ВходящееСальдоПени;
	Раздел2.Параметры.НачисленоПениЗаПериод    =  НачисленоПениЗаПериод;
	
	Если ЗначениеЗаполнено(ИтогПени) или ЗначениеЗаполнено(ВходящееСальдоПени) или ЗначениеЗаполнено(НачисленоПениЗаПериод) Тогда
		
		ДокументПени.Вывести(Шапка);
		ДокументПени.Вывести(Раздел1);
		ДокументПени.Вывести(Раздел2);
		ДокументПени.Вывести(Справка);
		
	КонецЕсли;
	
	Возврат ДокументПени;
	
КонецФункции

Функция ЗаполнитьТаблицуЗначенийСвойств(ЛицевойСчет)
	
	// Заполнение дерева значениями свойств.
	ЗначенияСвойств = ПрочитатьЗначенияСвойствИзРегистраСведений(ЛицевойСчет);
	
	Индекс = 0;
	
	ЗначенияСвойств.Колонки.Добавить("Индекс");	
	
	Для Каждого Строка из ЗначенияСвойств Цикл
		Индекс = Индекс + 1;
		
		Строка.Индекс = Индекс;	 
		
	КонецЦикла;	 
	
	ЗначенияСвойств.Сортировать("Индекс Убыв");
	
	Возврат ЗначенияСвойств;
	
КонецФункции

Функция ПрочитатьЗначенияСвойствИзРегистраСведений(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ЛицевойСчет);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуОбщедомовыхСчетчиков() Экспорт
	
	// Таблица печати счетчиков - содержит информацию по счетчикам на лс.
	ТаблицаОбщедомовыхСчетчиков = Новый ТаблицаЗначений;
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("КодПоставщика"		,ОбщегоНазначения.ОписаниеТипаСтрока(5));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("Счетчик"				,Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("Услуга"				,Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ЕдИзм"				,Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ДоПоказаний"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ИтогоОбъемИндИПУ"		,ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ИтогоОбъемИндНорматив",ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ИтогоОбъемОбщедомовых",ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ОтПоказаний"			,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ОбъемИнд"				,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("СокрНаименование"		,ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("УслугаПредставление"	,ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	// БИТ ЖКХ 23.01.2020
	
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ИтогоОтапливаемаяПлощадь",ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаОбщедомовыхСчетчиков.Колонки.Добавить("ИтогоОбщаяПлощадь",ОбщегоНазначения.ОписаниеТипаЧисло(16,4));	
	
	Возврат ТаблицаОбщедомовыхСчетчиков;	
	
КонецФункции	

// Функция обработки строки.
//
Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер              = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		
		ИсходнаяСтрока = "";
		
		Возврат Буфер;
		
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока  = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция ПолучитьСуммуСтрокой(Сумма)
	
	ЦЧасть = Цел(Сумма);
	ДЧасть = (Сумма - ЦЧасть) * 100;
	Если ДЧасть = 0 Тогда
		ДЧасть = "00";
	ИначеЕсли ДЧасть < 0 Тогда
		ДЧасть = ДЧасть * (-1);
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = '%1 руб. %2 коп.'"), ЦЧасть, ДЧасть);
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииФормированияQRКода

// Процедуры печати QR-кода.
Процедура НапечататьQRКод(ТабДок, ОбластьQRКод = Неопределено)
	
	Если МакетКВ.ОсновнойВариант = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент
		ИЛИ МакетКВ = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент 
		ИЛИ МакетКВ.ОсновнойВариант = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32
		ИЛИ МакетКВ = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32
		ИЛИ МакетКВ.ОсновнойВариант = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43
		ИЛИ МакетКВ = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43 
		ИЛИ МакетКВ.ОсновнойВариант = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924
		ИЛИ МакетКВ = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924
		ИЛИ МакетКВ.ОсновнойВариант = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ
		ИЛИ МакетКВ = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ Тогда 
		СведенияОПолучателе   = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ЭтотОбъект.ПолучательПлатежа, ЭтотОбъект.ДатаПечатиКвитанций, ЭтотОбъект.РС);
	Иначе	
		СведенияОПолучателе   = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ЭтотОбъект.Организация, ЭтотОбъект.ДатаПечатиКвитанций, ЭтотОбъект.РС);
	КонецЕсли;
	
	ФИО		= Строка(мСтруктураДанных.ЛицевойСчетФИО);
	Фамилия	= ВыделитьСлово(ФИО);
	Имя		= ВыделитьСлово(ФИО);
	Отчество= ВыделитьСлово(ФИО);
	
	РеквизитыПлатежа					= НоваяСтруктураРеквизитыПлатежаУФЭБС();
	РеквизитыПлатежа.ФамилияПлательщика	= Фамилия;
	РеквизитыПлатежа.ИмяПлательщика		= Имя;
	РеквизитыПлатежа.ОтчествоПлательщика= Отчество;
	РеквизитыПлатежа.ИННПлательщика		= ?(ЗначениеЗаполнено(мСтруктураДанных.ЛицевойСчетФИО)
												,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мСтруктураДанных.ЛицевойСчетФИО,"ИНН")
												,"");
	РеквизитыПлатежа.АдресПлательщика	= мСтруктураДанных.ЛицевойСчетАдрес;
	
	Если НЕ ЗначениеЗаполнено(СведенияОПолучателе.ПолноеНаименование) Тогда
		РеквизитыПлатежа.ТекстПолучателя = мСтруктураДанных.ПолучательПлатежа;
	Иначе
		Если ИспользоватьСокращенноеНаименование Тогда
			РеквизитыПлатежа.ТекстПолучателя = СведенияОПолучателе.СокращенноеНаименование;
		Иначе	
			РеквизитыПлатежа.ТекстПолучателя = СведенияОПолучателе.ПолноеНаименование;
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыПлатежа.НомерСчетаПолучателя		= СведенияОПолучателе.НомерСчета;
	РеквизитыПлатежа.НаименованиеБанкаПолучателя= СведенияОПолучателе.Банк;
	РеквизитыПлатежа.БИКБанкаПолучателя			= СведенияОПолучателе.БИК;
	РеквизитыПлатежа.СчетБанкаПолучателя		= СведенияОПолучателе.КоррСчет;
	
	//23.07.2019
	если ИспользоватьSumCПени = Истина тогда
	 РеквизитыПлатежа.СуммаЧислом				= мСтруктураДанных.ИтогоКОплатеСУчетомПени;
	иначе	
	 РеквизитыПлатежа.СуммаЧислом				= мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты;
	конецесли; 
	РеквизитыПлатежа.ИННПолучателя				= СведенияОПолучателе.ИНН;
	РеквизитыПлатежа.КПППолучателя				= СведенияОПолучателе.КПП;
	
	Если ЗначениеЗаполнено(НазначениеПлатежа) Тогда
		РеквизитыПлатежа.НазначениеПлатежа = НазначениеПлатежа;
	Иначе
		РеквизитыПлатежа.НазначениеПлатежа = "Оплата ЖКУ";
	КонецЕсли;
	
	РеквизитыПлатежа.ВидПлатежа						= сг_КодУслугиВСистемеГород;
	РеквизитыПлатежа.НомерЛицевогоСчетаПлательщика	= мСтруктураДанных.ЛицевойСчет;
	
	Если ЗначениеЗаполнено(ФорматДаты) Тогда
		Попытка
			РеквизитыПлатежа.ПериодОплаты = Формат(мСтруктураДанных.Дата, "ДФ='" + ФорматДаты + "'");
		Исключение
			ТекстСообщения = Нстр("ru = 'Ошибка в настройках формата даты для QR-кода (Настройка параметров ЖКХ).'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ТабДок.Очистить();
			Возврат;
		КонецПопытки;
		Если СтрДлина(РеквизитыПлатежа.ПериодОплаты) > 8 Тогда
			ТекстСообщения = Нстр("ru = 'Ошибка в настройках формата даты для QR-кода (Настройка параметров ЖКХ).'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ТабДок.Очистить();
			Возврат;
		КонецЕсли;
	Иначе
		РеквизитыПлатежа.ПериодОплаты = Формат(мСтруктураДанных.Дата, "ДФ='ММгг'");
	КонецЕсли;
	
	РеквизитыПлатежа.СуммаСтраховки = ?(ЗначениеЗаполнено(мСтруктураДанных.ИтогПени),  Формат(мСтруктураДанных.ИтогПени * 100, "ЧГ="), "000");
	
	МассивРеквизитов =  ТаблицаРеквизитовQRКода.Выгрузить(Новый Структура("Выводить", Истина)).ВыгрузитьКолонку("Реквизит");
	Для Каждого Элт Из РеквизитыПлатежа Цикл
		Если МассивРеквизитов.Найти(Элт.Ключ) = Неопределено Тогда
			РеквизитыПлатежа[Элт.Ключ] = Неопределено;
		КонецЕсли;	
	КонецЦикла;
	
	Попытка      
	 // БИТ ЖКХ 12.03.2021
	 РеквизитыПлатежа.НазначениеПлатежа = РеквизитыПлатежа.НазначениеПлатежа + " " +
	  // БИТ ЖКХ 1.04.2021
      //РеквизитыПлатежа.АдресПлательщика + "; " +
          мСтруктураДанных.ЛицевойСчет + " "; 
	исключение
	конецпопытки;	  
	// QR-код.
	QRСтрока = УправлениеПечатью.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
	
	Если НЕ ПустаяСтрока(QRСтрока) Тогда // Возникли ошибки
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
		Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось сформировать QR-код для документа.
										|Технические подробности см. в журнале регистрации.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Если НЕ ОбластьQRКод = Неопределено Тогда
			Попытка
				ОбластьQRКод.Рисунки.QRКод.Картинка =  Новый Картинка(ДанныеQRКода);
				ТабДок.Вывести(ОбластьQRКод);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			Для Каждого Рис Из ТабДок.Рисунки Цикл
				Если НЕ СтрНайти(НРег(Рис.Имя), "qrкод") = 0 Тогда
					Рис.Картинка = Новый Картинка(ДанныеQRКода);
				КонецЕсли;
			КонецЦикла;	
		Исключение
		КонецПопытки
	Иначе
		 УбратьQRКод(ТабДок);
	КонецЕсли;
	
КонецПроцедуры

Функция НоваяСтруктураРеквизитыПлатежаУФЭБС()
	
	// Входящие данные функци УправлениеПечатью.ФорматнаяСтрокаУФЭБС().
	Возврат Новый Структура(
	// Обязательные поля структуры.
	"ТекстПолучателя,
	|НомерСчетаПолучателя,
	|НаименованиеБанкаПолучателя,
	|БИКБанкаПолучателя,
	|СчетБанкаПолучателя,
	// Дополнительные поля структуры.
	|СуммаЧислом,
	|НазначениеПлатежа,
	|ИННПолучателя,
	|ИННПлательщика,
	// |СтатусСоставителя,
	|КПППолучателя,
	// |КодБК,
	// |КодОКТМО,
	// |ПоказательОснования,
	// |ПоказательПериода,
	// |ПоказательНомера,
	// |ПоказательДаты,
	// |ПоказательТипа,
	// Прочие дополнительные  поля.
	|ФамилияПлательщика,
	|ИмяПлательщика,
	|ОтчествоПлательщика,
	|АдресПлательщика,
	// |ЛицевойСчетБюджетногоПолучателя,
	// |ИндексПлатежногоДокумента,
	// |СНИЛС,
	// |НомерДоговора,
	|НомерЛицевогоСчетаПлательщика,
	// |НомерКвартиры,
	// |НомерТелефона,
	// |ВидПлательщика,
	// |НомерПлательщика,
	// |ФИОРебенка,
	// |ДатаРождения,
	// |СрокПлатежа,
	|ПериодОплаты,
	|ВидПлатежа,
	// |КодУслуги,
	// |НомерПрибораУчета,
	// |ПоказаниеПрибораУчета,
	// |НомерИзвещения,
	// |ДатаИзвещения,
	// |НомерУчреждения,
	// |НомерГруппы,
	// |ФИОПреподавателя,
	|СуммаСтраховки");
	// |НомерПостановления,
	// |НомерИсполнительногоПроизводства,
	// |КодВидаПлатежа,
	// |ИдентификаторНачисления,
	// |ТехническийКод");.
	
	//// Образец из РКО.
	//Возврат Новый Структура(
	//	// Обязательные поля структуры
	//	"ТекстПолучателя,
	//	|НомерСчетаПолучателя,
	//	|НаименованиеБанкаПолучателя,
	//	|БИКБанкаПолучателя,
	//	|СчетБанкаПолучателя,
	//	|ИндексПлатежногоДокумента,
	//	// Дополнительные поля структуры
	//	|СуммаЧислом,
	//	|НазначениеПлатежа,
	//	|ИННПолучателя,
	//	|ИННПлательщика,
	//	|СтатусСоставителя,
	//	|КПППолучателя,
	//	|КодБК,
	//	|КодОКТМО,
	//	|ПоказательОснования,
	//	|ПоказательПериода,
	//	|ПоказательНомера,
	//	|ПоказательДаты,
	//	|ПоказательТипа,
	//	// Прочие дополнительные поля
	//	|ФамилияПлательщика,
	//	|ИмяПлательщика,
	//	|ОтчествоПлательщика,
	//	|АдресПлательщика,
	//	|ИдентификаторНачисления,
	//	|Ссылка");
	// БИТ_ЖКХ 26.01.2017 17:43:41 Конец правки. 		
		
КонецФункции

// Устаревшая функция. Присутствует в пользовательских макетах.
// Процедуры печати QR штрихкода.
Процедура НапечататьQRШтрихкод(ОбластьШтрихкодQR, Результат)
	
	НапечататьQRКод(Результат, ОбластьШтрихкодQR);
	
КонецПроцедуры


Процедура УбратьQRКод(ТабДок)
	
	РисункиQR = Новый Массив;
	Для Каждого Рис Из ТабДок.Рисунки Цикл
		Если НЕ СтрНайти(НРег(Рис.Имя), "qrкод") = 0 Тогда
			РисункиQR.Добавить(Рис);
		КонецЕсли;
	КонецЦикла;
	Если РисункиQR.Количество() > 0 Тогда
		Для Каждого РисQR Из РисункиQR Цикл
			ТабДок.Рисунки.Удалить(РисQR);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НеПечататьУслугиБезНачислений(СтрПечати) 
	
	Если НеПечататьУслугиБезНачислений
		И СтрПечати.НачисленоИНД = 0
		И СтрПечати.НачисленоОбщДом = 0
		И СтрПечати.Начислено = 0
		И СтрПечати.Разовые = 0
		И СтрПечати.Льгота = 0 
		И (СтрПечати.Оплата = 0 ИЛИ НЕ ПечататьУслугиСОплатой) Тогда
		
		Возврат Истина;	
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

Функция РазбитьСтроку(Строка, МаксДлина, ИмяСтр1, ИмяСтр2)
	
	ДлинаСтроки = СтрДлина(Строка);
	Если ДлинаСтроки < МаксДлина Тогда
		
		Стр_1 = Строка;
		Стр_2 = "";
		
	Иначе
		// Разбиваем строку на две подстроки, таким образом чтобы первая строка была не более Длина символов
		// Для этого ищем очередной пробел и проверяем длину строк в предположении, что перенос будет выполнен по найденной позиции.
		Стр_2 = Строка;
		ПозицияПоиска = СтрНайти(Стр_2," ")+1;
		
		// Если найден очередной пробел и длина первой строки после операции будет менее Длина символов, то выполняем еще одну итерацию.
		Пока ПозицияПоиска > 1 И ДлинаСтроки - СтрДлина(Стр_2) + ПозицияПоиска < МаксДлина Цикл
			
			Стр_2 = Сред(Стр_2, ПозицияПоиска);
			ПозицияПоиска       = СтрНайти(Стр_2," ")+1;
			
		КонецЦикла; 
		
		Стр_1 = Лев(Строка,ДлинаСтроки - СтрДлина(Стр_2));
		
	КонецЕсли; 
	
	СтруктураАдресаПолучателя = Новый Структура;
	СтруктураАдресаПолучателя.Вставить(ИмяСтр1, Стр_1);
	СтруктураАдресаПолучателя.Вставить(ИмяСтр2, Стр_2);
	
	Возврат СтруктураАдресаПолучателя;
	
КонецФункции

#КонецОбласти

#КонецЕсли
