
#Область ДействиеКоманды

// Процедура - обработчик команды.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ОткрытьФорму("Отчет.бит_ДвиженияДокумента.Форма"
				,Новый Структура("Документ, ПоказыватьДокумент", ПараметрКоманды, Ложь)
				,ПараметрыВыполненияКоманды.Источник
				,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор
				,ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти