Перем ПутьКФайлу;
&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, СтандартнаяОбработка)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок                   = "Выберите файл";
	ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогОткрытияФайла.Фильтр                      = "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";	
	ДиалогОткрытияФайла.ИндексФильтра               = 0;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыборФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНаСервере()
	//Сообщить("1");
	Excel = Новый ComОбъект("Excel.Application");
	Книга = Excel.Workbooks.Open(ВыборФайла);
	Лист  = Книга.Sheets(2);
	КолонкаАдрес 	   	  = 3;
	КолонкаДата  		  = 4;
	КолонкаНормХВ 		  = 5;
	КолонкаНормГВ  		  = 6;
	КолонкаНормЭЭ 		  = 7;
	КолонкаНормВО 		  = 8;
	КолонкаМОП			  = 9; 
	КолонкаПлощадьЖилого  = 11;
	КолонкаПлощадьНЖилого = 12;
	КолонкаТеплоисточник  = 13;
	КолонкаВидВодоразбора = 14;
	КолонкаСтХВ 		  = 15;
	КолонкаСтЭЭ 		  = 16;
	КолонкаНормНаПодогрев = 17;
	КолонкаСтГкал 		  = 18;
	КолонкаСтХВнаГВ       = 19;
	КолонкаСтВО 		  = 20;
	КолонкаГодПостройки   = 21;
	КолонкаЭтажность      = 22;
	КолонкаВысотаПотолков = 23;
	КолонкаСпособНач   	  = 24;
	КолонкаПодвал		  = 25;
	КолонкаЧердак		  = 26;
	Сч    		   		  = 2;
	Отбой 				  = Ложь;
	Пока НЕ Отбой = Истина Цикл
		СпособНач	   = СокрЛП(Лист.Cells(Сч,КолонкаСпособНач).Value);
		//Если СпособНач > 1 Тогда
		//Иначе	
		Дом  		   = СокрЛП(Лист.Cells(Сч,КолонкаАдрес).Value);
		Период  	   = СокрЛП(Лист.Cells(Сч,КолонкаДата).Value);
		НормХВ 		   = СокрЛП(Лист.Cells(Сч,КолонкаНормХВ).Value);
		НормГВ 		   = СокрЛП(Лист.Cells(Сч,КолонкаНормГВ).Value);
		НормЭЭ 		   = СокрЛП(Лист.Cells(Сч,КолонкаНормЭЭ).Value);
		НормВО         = СокрЛП(Лист.Cells(Сч,КолонкаНормВО).Value);
		МОП 		   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаМОП).Value),"ЧГ=");
		ПлощадьЖилого  = Формат(СокрЛП(Лист.Cells(Сч,КолонкаПлощадьЖилого).Value),"ЧГ=");
		ПлощадьНЖилого = Формат(СокрЛП(Лист.Cells(Сч,КолонкаПлощадьНЖилого).Value),"ЧГ=");
		Теплоисточник  = Формат(СокрЛП(Лист.Cells(Сч,КолонкаТеплоисточник).Value),"ЧГ=");
		ВидВодоразбора = Формат(СокрЛП(Лист.Cells(Сч,КолонкаВидВодоразбора).Value),"ЧГ=");
		НормНаПодогрев = Формат(СокрЛП(Лист.Cells(Сч,КолонкаНормНаПодогрев).Value),"ЧГ=");
		СтГкал 		   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаСтГкал).Value),"ЧГ=");
		СтХВ		   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаСтХВ).Value),"ЧГ=");
		СтЭЭ		   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаСтЭЭ).Value),"ЧГ=");
		СтВО		   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаСтВО).Value),"ЧГ=");
		СтХВнаГВ 	   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаСтХВнаГВ).Value),"ЧГ=");
		ГодПостройки   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаГодПостройки).Value),"ЧГ=");
		Этажность      = Формат(СокрЛП(Лист.Cells(Сч,КолонкаЭтажность).Value),"ЧГ=");
		ВысотаПотолков = Формат(СокрЛП(Лист.Cells(Сч,КолонкаВысотаПотолков).Value),"ЧГ=");
		Подвал   	   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаПодвал).Value),"ЧГ=");
		Чердак  	   = Формат(СокрЛП(Лист.Cells(Сч,КолонкаЧердак).Value),"ЧГ=");
		СтГВ           = СтХВнаГВ + (НормНаПодогрев*СтГкал);
		Год            = Прав(Период,4);
		Месяц  		   = Лев(Период,2);
		Период		   = ""+Год+Месяц+"01";
		Период 		   = НачалоМесяца(Период);
		
		Адрес = ЗапросАдреса(Дом);
		ЗаписатьНормативыОДН(Период,НормХВ,НормГВ,НормВО,НормЭЭ,МОП,ПлощадьЖилого,ПлощадьНжилого,Теплоисточник,ВидВодоразбора,НормНаПодогрев,Стгкал,стхв,стЭЭ,ство,Стхвнагв,ГодПостройки,Этажность,ВысотаПотолков,Подвал,Чердак,СпособНач,Адрес);
		//КонецЕсли;
		Если СокрЛП(Лист.Cells(Сч+1,КолонкаАдрес).Text) = "" Тогда
			Отбой = Истина;
		КонецЕсли;
		Сч 	   = Сч + 1;	
	КонецЦикла;
	Excel.DisplayAlerts = 0;
	Excel.quit();
	Excel.DisplayAlerts = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Д1 = ТекущаяДата();
	ЗагрузитьНаСервере();	
	Д2 = ТекущаяДата();
	Сообщить("Время расчета начислений "+Формат((Д1-Д2)/60,"ЧДЦ=1")+" мин.");
КонецПроцедуры

&НаСервере
Функция ЗапросАдреса(Дом)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	лб_Тест_Дома.Здание КАК Здание
	|ИЗ
	|	РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
	|ГДЕ
	|	лб_Тест_Дома.ADR = &Дом";
	
	Запрос.УстановитьПараметр("Дом",Дом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	ф = 0;
	Если ВыборкаДетальныеЗаписи.Количество() > 0 тогда
		Адрес = ВыборкаДетальныеЗаписи[0].Здание;
	Иначе
		Сообщить("Запишите "+Дом+" в регистр Тест_Дома");
		Адрес = Дом;
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

&НаСервере
Функция ЗапросДокумента(Период)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	лб_НормативыОДН.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.лб_НормативыОДН КАК лб_НормативыОДН
	|ГДЕ
	|	лб_НормативыОДН.Период <= &ПериодК
	|	И лб_НормативыОДН.Период >= &ПериодН";
	
	Запрос.УстановитьПараметр("ПериодН", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ПериодК", КонецМесяца(Период));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0  Тогда
		НормативыОДН = ВыборкаДетальныеЗаписи[0].Ссылка.ПолучитьОбъект();
	Иначе
		НормативыОДН = Документы.лб_НормативыОДН.СоздатьДокумент();
		НормативыОДН.Дата = ТекущаяДата();
		НормативыОДН.Период = Период;
	КонецЕсли;
	Возврат НормативыОДН;
КонецФункции

&НаСервере
Процедура ЗаписатьНормативыОДН(Период,НормХВ,НормГВ,НормВО,НормЭЭ,МОП,ПлощадьЖилого,ПлощадьНжилого,Теплоисточник,ВидВодоразбора,НормНаПодогрев,Стгкал,стхв,стЭЭ,ство,Стхвнагв,ГодПостройки,Этажность,ВысотаПотолков,Подвал,Чердак,СпособНач,Адрес)
	НормативыОДН = ЗапросДокумента(Период);
	Проверка = НормативыОДН.Нормативы.Найти(Адрес,"Адрес");
	Если Проверка = Неопределено Тогда 
		ТабЧасть = НормативыОДН.Нормативы.Добавить();
		ТабЧасть.Адрес = Адрес;
	Иначе
		ТабЧасть = Проверка;
	КонецЕсли;
	ТабЧасть.НормативХВ = Нормхв;
	ТабЧасть.НормативГВ = НормГв;
	ТабЧасть.НормативВО = НормВО;
	ТабЧасть.НормативЭЭ = НормЭЭ;
	ТабЧасть.НормативНаПодогрев = НормНаПодогрев;
	ТабЧасть.МОП = МОП;
	ТабЧасть.Подвал = Подвал;
	ТабЧасть.Чердак = Чердак;
	ТабЧасть.Жилая = ПлощадьЖилого;
	ТабЧасть.Нежилая = ПлощадьНжилого;
	ТабЧасть.СтоимостьКубаХВ = стХВ;
	ТабЧасть.СтоимостьКВтч = Стээ;
	ТабЧасть.СтоимостьКубаВО = стВО;
	ТабЧасть.СтоимостьГКалл =стГКал;
	ТабЧасть.СтоимостьКубаХВнаГВ = стХВнаГВ;
	ТабЧасть.ВысотаПотолков = ВысотаПотолков;
	ТабЧасть.Этажность = Этажность;
	ТабЧасть.ГодПостройки = ГодПостройки;
	ТабЧасть.Теплоисточник = Теплоисточник;
	ТабЧасть.ВидВодоразбора = ВидВодоразбора;
	ТабЧасть.СпособНачисленияОДН = СпособНач;
	НормативыОДН.Записать(РежимЗаписиДокумента.Запись);
	НормативыОДН.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

