////////////////////////////////////////////////////////////////////////////////
// Ответственные лица: процедуры и функции для работы с ответственным лицами.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает структуру с реквизитами ответственных лиц.
//
// Параметры:
//  Организация - организация, для которой нужно определить руководящих лиц.
//	ДатаСреза - дата со временем, на которые необходимо определить сведения.
//	Подразделение - подразделение, для которого необходимо определить ответственных лиц.
//
Функция ОтветственныеЛица(Организация, ДатаСреза) Экспорт

	ДанныеОтветственныхЛиц = бит_ОтветственныеЛица.ПустаяСтруктураОтветственныхЛиц();

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат ДанныеОтветственныхЛиц;
	КонецЕсли;
	
	//СобиратьПоОрганизации = НЕ ЗначениеЗаполнено(Подразделение);

	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, 
			"ИндивидуальныйПредприниматель, ЮридическоеФизическоеЛицо");
	Иначе
		РеквизитыОрганизации = Новый Структура();
		РеквизитыОрганизации.Вставить("ИндивидуальныйПредприниматель");
		РеквизитыОрганизации.Вставить("ЮридическоеФизическоеЛицо");
	КонецЕсли;

	ЗапросПоЛицам = Новый Запрос();
	ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
	ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);

	Если РеквизитыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Организация, ДатаСреза);
		
		ФИО = Новый Структура("Фамилия, Имя, Отчество");
		ЗаполнитьЗначенияСвойств(ФИО, НаименованияОрганизации.ФИО);
		ФИО.Вставить("Представление", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО));
		
		ДанныеОтветственныхЛиц.Руководитель               = РеквизитыОрганизации.ИндивидуальныйПредприниматель;
		ДанныеОтветственныхЛиц.РуководительФИО            = ФИО;
		ДанныеОтветственныхЛиц.РуководительПредставление  = ФИО.Представление;
		
	КонецЕсли;
	
	ЗапросПоЛицам.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование КАК ФизическоеЛицоПредставление,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьПредставление
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо <> ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ПустаяСсылка)";
	
	Руководители = ЗапросПоЛицам.Выполнить().Выгрузить();
	
	// Получим ФИО+Представление
	ПоляИмени = "Фамилия, Имя, Отчество, ФамилияИО";
	РуководителиСписок = Руководители.ВыгрузитьКолонку("ФизическоеЛицо");
	УстановитьПривилегированныйРежим(Истина);
	ФИОРуководителей = КадровыйУчет.КадровыеДанныеФизическихЛиц(
		Истина,
		РуководителиСписок,
		ПоляИмени,
		ДатаСреза);
	УстановитьПривилегированныйРежим(Ложь);

	Для каждого Руководитель Из Руководители Цикл
		
		ФИОРуководителя = ФИОРуководителей.Найти(Руководитель.ФизическоеЛицо, "ФизическоеЛицо");
		Если ФИОРуководителя = Неопределено Тогда
			Фамилия       = " ";
			Имя           = " ";
			Отчество      = " ";
			Представление = " ";
		Иначе
			Фамилия       = ФИОРуководителя.Фамилия;
			Имя           = ФИОРуководителя.Имя;
			Отчество      = ФИОРуководителя.Отчество;
			Представление = ФИОРуководителя.ФамилияИО;
		КонецЕсли;
		ФИО = Новый Структура("Фамилия, Имя, Отчество, Представление", Фамилия, Имя, Отчество, Представление);

		ИмяОтветственного = ОбщегоНазначения.ИмяЗначенияПеречисления(Руководитель.ОтветственноеЛицо);
		Если ДанныеОтветственныхЛиц.Свойство(ИмяОтветственного) Тогда
			ДанныеОтветственныхЛиц[ИмяОтветственного]                            = Руководитель.ФизическоеЛицо;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "Должность"]              = Руководитель.Должность;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "ДолжностьПредставление"] = Руководитель.ДолжностьПредставление;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "ФИО"]                    = ФИО;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "Представление"]          = Представление;
		КонецЕсли;

	КонецЦикла;

	Возврат ДанныеОтветственныхЛиц;

КонецФункции

// Функция возвращает массив с датами изменения в ответственных лицах.
//
Функция ДатыИзмененияОтветственныхЛицОрганизаций(Организация) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Период КАК Период,
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница = &Организация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Период,
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ПО ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница = ПодразделенияОрганизаций.Ссылка
	|			И (ПодразделенияОрганизаций.Владелец = &Организация)";
	
	ТаблицаОтветственныеЛица = Запрос.Выполнить().Выгрузить();
	ТаблицаОтветственныеЛица.Индексы.Добавить("ФизическоеЛицо");
	
	МассивДат            = ТаблицаОтветственныеЛица.ВыгрузитьКолонку("Период");
	МассивФизическиеЛица = ТаблицаОтветственныеЛица.ВыгрузитьКолонку("ФизическоеЛицо");
	
	МассивДат            = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивДат);
	МассивФизическиеЛица = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивФизическиеЛица);
	
	ТаблицаФизическиеЛица = КадровыйУчет.ПериодыИзмененияФИОФизическихЛиц(МассивФизическиеЛица);
	
	Для каждого СтрокаТаблицыФизическиеЛица Из ТаблицаФизическиеЛица Цикл
		
		ДатыНазначенияОтвественныхЛиц = ТаблицаОтветственныеЛица.НайтиСтроки(Новый Структура("ФизическоеЛицо", СтрокаТаблицыФизическиеЛица.ФизическоеЛицо));
		Для каждого ДатаНазначенияОтветственногоЛица Из ДатыНазначенияОтвественныхЛиц Цикл
			// Добавляем дату изменения ФИО ответственного лица, только если оно произошло после назначения в должность
			Если ДатаНазначенияОтветственногоЛица.Период < СтрокаТаблицыФизическиеЛица.Период 
					И МассивДат.Найти(СтрокаТаблицыФизическиеЛица.Период) = Неопределено Тогда
			
				МассивДат.Добавить(СтрокаТаблицыФизическиеЛица.Период);
				Прервать;
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЦикла;

	Возврат МассивДат;

КонецФункции

#КонецОбласти