#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СписокКодовЧисел Экспорт;         // Хранит список значений с кодами символов чисел.
Перем мТаблицаПечати   Экспорт;         // Хранит таблицу зачений Начислений.
Перем мТаблицаПечатиСчетчиков  Экспорт; // Хранит таблицу зачений Счетчиков.
Перем мТаблицаПерерасчетов  Экспорт;	// Хранит таблицу зачений Счетчиков.
Перем мСтруктураДанных Экспорт;         // Хранит структуру данных для печати шапки.

// Перменные настроек ЖКХ.
Перем мЛьготаПерсонифицированная           Экспорт; // Хранит флаги настроек ЖКХ.
Перем мВыводитьЛьготыНаСчетИзвещение       Экспорт; // Хранит флаги настроек ЖКХ.
Перем мРасчетСУчетомДолейВладения          Экспорт; // Хранит флаги настроек ЖКХ.
Перем мУменьшениеНормыЛьготыВПределахФакта Экспорт; // Хранит флаги настроек ЖКХ.
Перем мНачислениеСУчетомДнейПроживания     Экспорт; // Хранит флаги настроек ЖКХ.
Перем мНеПечататьУлица                     Экспорт; // Хранит флаги настроек ЖКХ.
Перем мНеПечататьДом                       Экспорт; // Хранит флаги настроек ЖКХ.
Перем мНеПечататьКорпус                    Экспорт; // Хранит флаги настроек ЖКХ.
Перем мНеПечататьКвартира                  Экспорт; // Хранит флаги настроек ЖКХ.
Перем мПрефиксУлица                        Экспорт; // Хранит флаги настроек ЖКХ.
Перем мПрефиксДом                          Экспорт; // Хранит флаги настроек ЖКХ.
Перем мПрефиксКорпус                       Экспорт; // Хранит флаги настроек ЖКХ.
Перем мПрефиксКвартира                     Экспорт; // Хранит флаги настроек ЖКХ.
Перем мПрефиксРайон                        Экспорт; // Хранит флаги настроек ЖКХ.
Перем мНеПечататьРайон                     Экспорт; // Хранит флаги настроек ЖКХ.
Перем мНомерПолучателяПоБанку              Экспорт; // Хранит флаги настроек ЖКХ.
Перем мИспользоватьНомерПолучателяВШК      Экспорт; // Хранит флаги настроек ЖКХ.

Перем мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Экспорт; // Хранит флаги настроек ЖКХ.

// БИТ_ЖКХ_04102013_начало_изменений
Перем мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика Экспорт; // Хранит флаги настроек ЖКХ.
// БИТ_ЖКХ_04102013_окончание_изменений

#КонецОбласти

#Если Клиент Тогда

#Область ПечатьСчетИзвещений

// Функция формирует табличный документ с печатной формой СчетИзвещения.
// Возвращаемое значение:
// Табличный документ - печатная форма. 
Функция ПечатьСчетИзвещения(ВидМакета)
	
	Попытка
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	
	// БИТ_ЖКХ изменения кода . Начало: 25.10.2011
	Если ВидМакета Тогда
		
		Макет = ПолучитьМакет("СчетИзвещение");
		
	Иначе
		
		Макет = ПолучитьМакет("СчетИзвещение1");
		
	КонецЕсли; 
	// БИТ_ЖКХ изменения кода . Конец  25.10.2011
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.КлючПараметровПечати = "Счет-Извещение";
	
	ОбластьШапка1       = Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2       = Макет.ПолучитьОбласть("Шапка2");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал1      = Макет.ПолучитьОбласть("Подвал1");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = Макет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = Макет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = Макет.ПолучитьОбласть("Итого"); 
	// БИТ_ЖКХ изменения кода . Начало: 25.10.2011
	Если ВидМакета Тогда
		ШапкаПриборыУчета   = Макет.ПолучитьОбласть("ШапкаПриборыУчета");
		СтрокаПриборовУчета = Макет.ПолучитьОбласть("СтрокаПриборовУчета");
	Иначе
		ШапкаПриборыУчета1   = Макет.ПолучитьОбласть("ШапкаПриборыУчета1");
		СтрокаПриборовУчета1 = Макет.ПолучитьОбласть("СтрокаПриборовУчета1");
		ШапкаПриборыУчета2   = Макет.ПолучитьОбласть("ШапкаПриборыУчета2");
		СтрокаПриборовУчета2 = Макет.ПолучитьОбласть("СтрокаПриборовУчета2");
	КонецЕсли;
		// БИТ_ЖКХ изменения кода . Конец  25.10.2011
		СтрокаВывода        = Макет.ПолучитьОбласть("СтрокаВывода");
		ОбластьШтрихКод     = Макет.ПолучитьОбласть("ОбластьШтрихКод");
		
		ОбластьШапка1.Параметры.Заполнить(мСтруктураДанных);
		ТабДок.Вывести(ОбластьШапка1); 
		Если мЗагруженШтрихкод тогда
			
			СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, Ссылка.Наименование, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Ссылка.Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
			
			ОбластьШтрихКод.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
			
			ТабДок.Вывести(ОбластьШтрихКод);
		КонецЕсли;
		ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
		ТабДок.Вывести(ОбластьШапка2);
		
		СчВывода = 5;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабСЧ.Счетчик,
		|	ТабСЧ.Услуга,
		|	ТабСЧ.ДоПоказаний,
		|	ТабСЧ.Приоритет
		|ПОМЕСТИТЬ ТабСЧ
		|ИЗ
		|	&ТабСЧ КАК ТабСЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСЧ.Счетчик КАК Счетчик,
		|	ТабСЧ.Услуга КАК Услуга,
		|	ТабСЧ.ДоПоказаний КАК ДоПоказаний,
		|	ТабСЧ.Приоритет КАК Приоритет
		|ИЗ
		|	ТабСЧ КАК ТабСЧ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет
		|ИТОГИ
		|	МАКСИМУМ(ДоПоказаний)
		|ПО
		|	Счетчик";
		
		Запрос.УстановитьПараметр("ТабСЧ",мТаблицаПечатиСчетчиков);
		
		ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаСЧ = мТаблицаПечатиСчетчиков.СкопироватьКолонки();
		ТаблицаСЧ.Очистить();
		// БИТ_ЖКХ изменения кода . Начало: 25.10.2011
		// Для учета вида макета и количества счетчиков.
		НаличиеКолонки = Ложь;
		
		// Если количество счетчиков не попадет в один ряд, а макет "Счет - извещение с 8-мью счетчиками".
		Если ВыборкаСЧ.Количество() > 4 И НЕ ВидМакета Тогда
			
			НаличиеКолонки = Истина;
			
		КонецЕсли;
		// БИТ_ЖКХ изменения кода . Конец  25.10.2011
		
		Если ВыборкаСЧ.Количество() > 0 тогда
			// БИТ_ЖКХ добавление кода Начало: 25.10.2011 
			Если ВидМакета Тогда
				
				ТабДок.Вывести(ШапкаПриборыУчета);
				
			Иначе
				
				ТабДок.Вывести(ШапкаПриборыУчета1);
				
				Если НаличиеКолонки Тогда
					
					ТабДок.Присоединить(ШапкаПриборыУчета2)
					
				КонецЕсли;
			КонецЕсли; 
			ПереборКолонок = Истина;
			СчВывода = СчВывода - 1;
			Пока ВыборкаСЧ.Следующий() Цикл
				
				НоваяСтрока = ТаблицаСЧ.Добавить();
				// БИТ_ЖКХ добавление кода Начало: 25.10.2011 
				Если НЕ ВидМакета Тогда
					
					Если ПереборКолонок Тогда
						// Для вывода последовательно в первую и вторую колонки.
						ПереборКолонок = Ложь;
						
					Иначе
						
						ПереборКолонок = Истина;
						
					КонецЕсли;
					Если НаличиеКолонки И ПереборКолонок Тогда
						СтрокаПриборовУчета2.Параметры.Заполнить(ВыборкаСЧ);
					Иначе
						СтрокаПриборовУчета1.Параметры.Заполнить(ВыборкаСЧ);
					КонецЕсли;
				Иначе
					
					СтрокаПриборовУчета.Параметры.Заполнить(ВыборкаСЧ);
				КонецЕсли;
				Выборка = ВыборкаСЧ.Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					// БИТ_ЖКХ добавление кода Начало: 25.10.2011 
					Если Не ВидМакета Тогда
						
						Если НаличиеКолонки И ПереборКолонок Тогда
							СтрокаПриборовУчета2.Параметры.Услуга = Лев(Выборка.Услуга, 12);
							ТабДок.Присоединить(СтрокаПриборовУчета2);
							
						Иначе
							СтрокаПриборовУчета1.Параметры.Услуга = Лев(Выборка.Услуга, 12);
							ТабДок.Вывести(СтрокаПриборовУчета1);
							
							СчВывода = СчВывода - 1;
						КонецЕсли;
						
					Иначе
						
						СтрокаПриборовУчета.Параметры.Услуга = Лев(Выборка.Услуга, 12);
						ТабДок.Вывести(СтрокаПриборовУчета);
						СчВывода = СчВывода - 1;
						
					КонецЕсли;	
					
				КонецЕсли;
				
				Если СЧВывода <= 0 Тогда
					
					Прервать;
					СчВывода =0;
					
				КонецЕсли; 
				
			КонецЦикла;	
			
			Пока СчВывода <> 0 цикл
				ТабДок.Вывести(СтрокаВывода);
				СчВывода = СчВывода - 1;
			КонецЦикла;
			
		иначе
			
			Пока СчВывода <> 0 цикл
				ТабДок.Вывести(СтрокаВывода);
				СчВывода = СчВывода - 1;
			КонецЦикла;	
		КонецЕсли;	
		// БИТ_ЖКХ изменения кода. Конец
		
		ТабДок.Вывести(ОбластьПодвал);
		
		ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
		ТабДок.Вывести(ОбластьШапка);
		
		Если ТаблицаСЧ.Количество() > 0 Тогда
			// БИТ_ЖКХ добавление кода Начало: 25.10.2011 
			Если ВидМакета Тогда
				
				ТабДок.Вывести(ШапкаПриборыУчета);
				
			Иначе
				
				ТабДок.Вывести(ШапкаПриборыУчета1);
				
				Если НаличиеКолонки Тогда
					
					ТабДок.Присоединить(ШапкаПриборыУчета2)
					
				КонецЕсли;
				
			КонецЕсли; 
			// ТабДок.Вывести(ШапкаПриборыУчета);.
			ПереборКолонок = Истина;
			Для каждого ТекСтрока Из ТаблицаСЧ Цикл
				Если НЕ ВидМакета Тогда
					
					Если ПереборКолонок Тогда
						// Для вывода последовательно в первую и вторую колонки.
						ПереборКолонок = Ложь;
						
					Иначе
						
						ПереборКолонок = Истина;
						
					КонецЕсли;
				КонецЕсли;
				
				Если Не ВидМакета Тогда
					
					Если НаличиеКолонки И ПереборКолонок Тогда
						СтрокаПриборовУчета2.Параметры.Заполнить(ТекСтрока);
						СтрокаПриборовУчета2.Параметры.Услуга = Лев(СтрокаПриборовУчета2.Параметры.Услуга, 12);
						ТабДок.Присоединить(СтрокаПриборовУчета2);
						
					Иначе
						СтрокаПриборовУчета1.Параметры.Заполнить(ТекСтрока);
						СтрокаПриборовУчета1.Параметры.Услуга = Лев(СтрокаПриборовУчета1.Параметры.Услуга, 12);
						ТабДок.Вывести(СтрокаПриборовУчета1);
						
					КонецЕсли;
					
				Иначе
					
					СтрокаПриборовУчета.Параметры.Заполнить(ТекСтрока);
					// БИТ_ЖКХ изменения кода . Начало: 23.03.2011
					СтрокаПриборовУчета.Параметры.Услуга = Лев(СтрокаПриборовУчета.Параметры.Услуга,12);
					// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
					ТабДок.Вывести(СтрокаПриборовУчета);
				КонецЕсли;
				
			КонецЦикла; 
		иначе
			
		КонецЕсли;	
		// БИТ_ЖКХ изменения кода. Конец
		
		ТабДок.Вывести(ОбластьПодвал1);
		ТабДок.Вывести(ШапкаЗаголовки);
		
		Для Каждого ТекСтрока  Из мТаблицаПечати  Цикл 
			
			Если ТекСтрока.СальдоНаНачало = 0 И ТекСтрока.Начислено = 0 Тогда
				Продолжить;
			Иначе
				СтрокаРасшифровки.Параметры.Заполнить(ТекСтрока);
				Если  мЛьготаПерсонифицированная И НЕ мВыводитьЛьготыНаСчетИзвещение Тогда
					СтрокаРасшифровки.Параметры.Льгота = 0;
				КонецЕсли;	
				ТабДок.Вывести(СтрокаРасшифровки);
			КонецЕсли;
			
		КонецЦикла;
		
		
		ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
		// БИТ_ЖКХ добавление кода Начало: 20.06.2011 
		Если  мЛьготаПерсонифицированная И НЕ мВыводитьЛьготыНаСчетИзвещение Тогда
			ОбластьИтого.Параметры.Льгота = 0;
		КонецЕсли;	
	// БИТ_ЖКХ добавление кода конец : 20.06.2011
	
	ТабДок.Вывести(ОбластьИтого);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	
	Возврат ТабДок;
	
КонецФункции //  
	
// Функция формирует табличный документ с печатной формой СчетИзвещения.
// Возвращаемое значение:
// Табличный документ - печатная форма. 
Функция ПечатьСчетИзвещенияВариант4(ИмяМакета)  
	
	Попытка
		
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	
	УчитыватьЛьготу = НЕ мЛьготаПерсонифицированная;
	
	Макет = ПолучитьМакет("СчетИзвещение4");
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.КлючПараметровПечати = "Счет-Извещение";
	
	ОбластьШапка1       = Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2       = Макет.ПолучитьОбласть("Шапка2");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал1      = Макет.ПолучитьОбласть("Подвал1");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = Макет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = Макет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = Макет.ПолучитьОбласть("Итого"); 
	ШапкаПриборыУчета   = Макет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаПриборовУчета = Макет.ПолучитьОбласть("СтрокаПриборовУчета");
	СтрокаВывода        = Макет.ПолучитьОбласть("СтрокаВывода");
	ОбластьШтрихКод     = Макет.ПолучитьОбласть("ОбластьШтрихКод");
	
	ОбластьШапка1.Параметры.Заполнить(мСтруктураДанных);
	ТабДок.Вывести(ОбластьШапка1); 
	Если мЗагруженШтрихкод тогда
		СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, Ссылка.Наименование, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Ссылка.Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
		
		ОбластьШтрихКод.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
		
		ТабДок.Вывести(ОбластьШтрихКод);
	КонецЕсли;
	
	мТаблицаПечати4 = мТаблицаПечати.Скопировать();
	
	Для Каждого ТекСтрока  Из мТаблицаПечати4  Цикл 
		КОплате = ТекСтрока.СальдоНаНачало + ТекСтрока.Начислено - ТекСтрока.Оплата + ТекСтрока.Разовые - ТекСтрока.Субсидия 
		- ?(УчитыватьЛьготу, ТекСтрока.Льгота, 0);
		Если КОплате < 0 Тогда
			ТекСтрока.КОплате = КОплате;
		КонецЕсли; 
		Если ИмяМакета = "СчетИзвещение5" Тогда
			
			ТекСтрока.СальдоНаНачало = ТекСтрока.СальдоНаНачало;
			
		Иначе
			
			ТекСтрока.СальдоНаНачало = ТекСтрока.СальдоНаНачало - ТекСтрока.Оплата;
			
		КонецЕсли; 
	КонецЦикла;
	
	ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
	Если мСтруктураДанных.КОплате <> мТаблицаПечати4.Итог("КОплате") Тогда
		ОбластьШапка2.Параметры.ИтогоКОплатеСУчетомПени = мТаблицаПечати4.Итог("КОплате") + мСтруктураДанных.ИтогПени;
	КонецЕсли; 
	ТабДок.Вывести(ОбластьШапка2);
	
	СчВывода = 5;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабСЧ.Счетчик,
	|	ТабСЧ.Услуга,
	|	ТабСЧ.ДоПоказаний,
	|	ТабСЧ.Приоритет
	|ПОМЕСТИТЬ ТабСЧ
	|ИЗ
	|	&ТабСЧ КАК ТабСЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСЧ.Счетчик КАК Счетчик,
	|	ТабСЧ.Услуга КАК Услуга,
	|	ТабСЧ.ДоПоказаний КАК ДоПоказаний,
	|	ТабСЧ.Приоритет КАК Приоритет
	|ИЗ
	|	ТабСЧ КАК ТабСЧ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(ДоПоказаний)
	|ПО
	|	Счетчик";
	
	Запрос.УстановитьПараметр("ТабСЧ",мТаблицаПечатиСчетчиков);
	
	ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаСЧ = мТаблицаПечатиСчетчиков.СкопироватьКолонки();
	ТаблицаСЧ.Очистить();
	
	Если ВыборкаСЧ.Количество() > 0 тогда
		СчВывода = СчВывода - 1;
		ТабДок.Вывести(ШапкаПриборыУчета);
		Пока ВыборкаСЧ.Следующий() Цикл
			
			НоваяСтрока = ТаблицаСЧ.Добавить();
			СтрокаПриборовУчета.Параметры.Заполнить(ВыборкаСЧ);
			Выборка = ВыборкаСЧ.Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				СтрокаПриборовУчета.Параметры.Услуга = Лев(Выборка.Услуга, 12);
				
			КонецЕсли;
			
			СчВывода = СчВывода - 1;
			ТабДок.Вывести(СтрокаПриборовУчета);
			
			Если СЧВывода <= 0 Тогда
				
				Прервать;
				СчВывода =0;
				
			КонецЕсли; 
			
		КонецЦикла;	
		
		Пока СчВывода <> 0 цикл
			ТабДок.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
		КонецЦикла;
		
	иначе
		
		Пока СчВывода <> 0 цикл
			ТабДок.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
		КонецЦикла;	
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьПодвал);
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	
	Если мСтруктураДанных.КОплате <> мТаблицаПечати4.Итог("КОплате") Тогда
		ОбластьШапка.Параметры.ИтогоКОплатеСУчетомПени 	  = мТаблицаПечати4.Итог("КОплате") + мСтруктураДанных.ИтогПени;
		ОбластьШапка.Параметры.ИтогоКОплатеСУчетомПредоплаты = мТаблицаПечати4.Итог("КОплате");
	КонецЕсли; 
	// БИТ_ЖКХ изменения кода . Начало: 07.04.2011  
	ОбластьШапка.Параметры.СальдоНаНачалоМесяца 	  = мТаблицаПечати4.Итог("СальдоНаНачало");
	// БИТ_ЖКХ изменения кода . Конец  07.04.2011 
	ТабДок.Вывести(ОбластьШапка);
	
	Если ТаблицаСЧ.Количество() > 0 Тогда
		ТабДок.Вывести(ШапкаПриборыУчета);
		Для каждого ТекСтрока Из ТаблицаСЧ Цикл
			
			СтрокаПриборовУчета.Параметры.Заполнить(ТекСтрока);
			// БИТ_ЖКХ изменения кода . Начало: 23.03.2011
			СтрокаПриборовУчета.Параметры.Услуга = Лев(СтрокаПриборовУчета.Параметры.Услуга,12);
			// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
			ТабДок.Вывести(СтрокаПриборовУчета);
			
		КонецЦикла; 
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьПодвал1);
	ТабДок.Вывести(ШапкаЗаголовки);
	
	Итог = 0;
	Для Каждого ТекСтрока  Из мТаблицаПечати4  Цикл
		// БИТ_ЖКХ изменения кода . Начало: 21.05.2012
		Если ТекСтрока.СальдоНаНачало = 0 И ТекСтрока.Начислено = 0 Тогда
			Продолжить;
		Иначе
			СтрокаРасшифровки.Параметры.Заполнить(ТекСтрока);
			ТабДок.Вывести(СтрокаРасшифровки);
		КонецЕсли;
		// БИТ_ЖКХ изменения кода . Конец  21.05.2012
	КонецЦикла;
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	Если мСтруктураДанных.КОплате <> мТаблицаПечати4.Итог("КОплате") Тогда
		ОбластьИтого.Параметры.КОплате = мТаблицаПечати4.Итог("КОплате");
	КонецЕсли; 
	// БИТ_ЖКХ изменения кода . Начало: 07.04.2011 
	ОбластьИтого.Параметры.Сальдо = мТаблицаПечати4.Итог("СальдоНаНачало");
	// БИТ_ЖКХ изменения кода . Конец  07.04.2011 
	ТабДок.Вывести(ОбластьИтого);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	
	Возврат ТабДок;
	
КонецФункции //  

// Функция формирует табличный документ с печатной формой СчетИзвещения.
// Возвращаемое значение:
// Табличный документ - печатная форма. 
Функция ПечатьСчетКвитанция6(ИмяМакета)
	
	Попытка
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	// БИТ_ЖКХ изменения кода . Начало: 29.09.2011
	// Макет = ПолучитьМакет("Квитанция6");.
	Макет = ПолучитьМакет(ИмяМакета);
	// БИТ_ЖКХ изменения кода . Конец  29.09.2011
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.КлючПараметровПечати = "Счет-Извещение";
	
	ОбластьШапка       = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока      = Макет.ПолучитьОбласть("Строка");
	ОбластьВсего       = Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал      = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал2     = Макет.ПолучитьОбласть("Подвал2");
	ПустаяСтрока       = Макет.ПолучитьОбласть("ПустаяСтрока");
	СтрокаПРиборы      = Макет.ПолучитьОбласть("СтрокаПриборовУчета");
	
	Если мЗагруженШтрихкод тогда
		
		СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, Ссылка.Наименование, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Ссылка.Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
		
		ОбластьШапка.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
		
	КонецЕсли;
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	ОбластьШапка.Параметры.НазваниеОрганизации = Организация;
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация);
	ОбластьШапка.Параметры.АдресОрганизации    = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ИННОрганизации      = Организация.ИНН;
	ТабДок.Вывести(ОбластьШапка);
	
	Отбор = Новый Структура;
	Для каждого Строка Из мТаблицаПечати Цикл
		// БИТ_ЖКХ изменения кода . Начало: 21.05.2012
		Если Строка.СальдоНаНачало = 0 И Строка.Начислено = 0 Тогда
			Продолжить;
		Иначе
			Отбор.Очистить();
			Отбор.Вставить("Услуга",Строка.Услуга);
			СтрокиСЧ = мТаблицаПечатиСчетчиков.НайтиСтроки(Отбор);
			
			Если СтрокиСЧ.Количество() = 1 Тогда
				ОбластьСтрока.Параметры.Заполнить(СтрокиСЧ[0]);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(Строка);
			ТабДок.Вывести(ОбластьСтрока);
			
			Если СтрокиСЧ.Количество() > 1 Тогда
				Для каждого СЧ Из СтрокиСЧ Цикл
					
					СтрокаПРиборы.Параметры.Заполнить(СЧ);
					ТабДок.Вывести(СтрокаПРиборы);
					
				КонецЦикла;
			КонецЕсли;
			
			Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
				
				ОбластьСтрока.Параметры.Установить(Значение, "");
				
			КонецЦикла;
		КонецЕсли;
		// БИТ_ЖКХ изменения кода . Конец  21.05.2012
	КонецЦикла;
	
	ОбластьВсего.Параметры.Заполнить(мСтруктураДанных);
	
	ТабДок.Вывести(ОбластьВсего);
	
	КолПустСтрок = 12;
	
	Если КолПустСтрок > мТаблицаПечати.Количество() + мТаблицаПечатиСчетчиков.Количество() Тогда
		
		КолПустСтрок = КолПустСтрок - мТаблицаПечати.Количество();
		Пока КолПустСтрок <> 0 Цикл
			
			ТабДок.Вывести(ПустаяСтрока);
			КолПустСтрок = КолПустСтрок - 1;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.Заполнить(мСтруктураДанных);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьПодвал2);
	
	Возврат ТабДок;
	
КонецФункции // ()

// Функция формирует табличный документ с печатной формой СчетИзвещения.
// Возвращаемое значение:
// Табличный документ - печатная форма. 
Функция ПечатьСчетКвитанция5()
	
	Попытка
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	
	Макет = ПолучитьМакет("Квитанция5");
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.КлючПараметровПечати = "Счет-Извещение";
	
	ОбластьШапка       = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока      = Макет.ПолучитьОбласть("Строка|Часть1");
	ДопСтрока          = Макет.ПолучитьОбласть("Строка|Часть2");
	ОбластьВсего       = Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал      = Макет.ПолучитьОбласть("Подвал");
	ПустаяСтрока       = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Если мЗагруженШтрихкод тогда

		СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, Ссылка.Наименование, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Ссылка.Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
		
		ОбластьШапка.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
		
	КонецЕсли;
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация);
	
	ОбластьШапка.Параметры.НазваниеОрганизации = Организация;
	ОбластьШапка.Параметры.АдресОрганизации    = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ИННОрганизации      = Организация.ИНН;
	ОбластьШапка.Параметры.Месяц               = Формат(Месяц(ТекущаяДата()), "ЧЦ=2; ЧВН=");
	ОбластьШапка.Параметры.Год                 = Формат(Год(ТекущаяДата())  , "ЧЦ=4; ЧГ=");
	ОбластьШапка.Параметры.ДатаПоследнейОплаты = ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты),Формат(мСтруктураДанных.ДатаПоследнейОплаты,"ДФ=dd.MM.yyyy"),"");
	
	ТабДок.Вывести(ОбластьШапка);
	
	ИндексСтроки = 0;
	КолПустыхСтрок = 12;
	Вывести = Истина;
	
	мТаблицаПечати1 = мТаблицаПечати.Скопировать();
	мТаблицаПечати2 = мТаблицаПечати.Скопировать();
	
	Для каждого Колонка Из мТаблицаПечати1.Колонки Цикл
		
		Колонка.Имя = Колонка.Имя + 1;
		
	КонецЦикла;
	
	Для каждого Колонка Из мТаблицаПечати2.Колонки Цикл
		
		Колонка.Имя = Колонка.Имя + 1;
		
	КонецЦикла; 
	
	Для каждого Строка Из мТаблицаПечати Цикл
		// БИТ_ЖКХ изменения кода . Начало: 21.05.2012
		Если Строка.СальдоНаНачало = 0 И Строка.Начислено = 0 Тогда
			Продолжить;
		Иначе
			ИндексСтроки = ИндексСтроки + 1;
			
			Если ИндексСтроки <> 23 Тогда
				
				Если Вывести Тогда
					
					ОбластьСтрока.Параметры.Заполнить(Строка);
					
					// БИТ_ЖКХ добавление кода Начало: 23.08.2011 
					Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") Тогда
						ОбластьСтрока.Параметры.Количество = Null;
					КонецЕсли;
					// БИТ_ЖКХ добавление кода конец : 23.08.2011
					
					ТабДок.Вывести(ОбластьСтрока);
					
				Иначе 
					
					ДопСтрока.Параметры.Заполнить(Строка);
					
					// БИТ_ЖКХ добавление кода Начало: 24.08.2011 
					Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") Тогда
						ДопСтрока.Параметры.Количество = Null;
					КонецЕсли;
					// БИТ_ЖКХ добавление кода конец : 24.08.2011
					
					ТабДок.Присоединить(ДопСтрока);
					
				КонецЕсли    ;
				
				Вывести = ?(Вывести, ложь,Истина);
				
			КонецЕсли;
		КонецЕсли;
		// БИТ_ЖКХ изменения кода . Конец  21.05.2012
	КонецЦикла;   
	
	Если Вывести Тогда
		
		ИндексСтроки = ИндексСтроки + 2;
		
		Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
			
			ОбластьСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;  
		
		ТабДок.Вывести(ОбластьСтрока);
		
		// БИТ_ЖКХ изменения кода . Начало: 23.03.2011 
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			
			ДопСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;  
		// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
		
		ДопСтрока.Параметры.Услуга         = "ИТОГО";
		ДопСтрока.Параметры.Начислено      = мТаблицаПечати.итог("Начислено");
		ДопСтрока.Параметры.КОплатеЗаМесяц = мТаблицаПечати.итог("КОплатеЗаМесяц");
		
		ТабДок.Присоединить(ДопСтрока);
		
	Иначе
		
		ИндексСтроки = ИндексСтроки + 1;
		// БИТ_ЖКХ изменения кода . Начало: 23.03.2011 
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			
			ДопСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;  
		// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
		ДопСтрока.Параметры.Услуга         = "ИТОГО";
		ДопСтрока.Параметры.Начислено      = мТаблицаПечати.итог("Начислено");
		ДопСтрока.Параметры.КОплатеЗаМесяц = мТаблицаПечати.итог("КОплатеЗаМесяц");
		
		ТабДок.Присоединить(ДопСтрока);
		
	КонецЕсли; 
	
	КолПустыхСтрок = КолПустыхСтрок - (ИндексСтроки/2);
	
	Пока КолПустыхСтрок <> 0 Цикл
		КолПустыхСтрок = КолПустыхСтрок - 1;
		ТабДок.Присоединить(ПустаяСтрока);
	КонецЦикла;
	
	НомерСчетчика = 0;
	
	мТаблицаПечатиСчетчиков1 = мТаблицаПечатиСчетчиков.Скопировать();
	мТаблицаПечатиСчетчиков1.Свернуть("Счетчик,ЕдИзм,ДоПоказаний");
	Для каждого Строка Из мТаблицаПечатиСчетчиков1 Цикл
		
		НомерСчетчика =  НомерСчетчика + 1;
		Если НомерСчетчика <= 6 Тогда
			
			НазваниеСчетчика = "НазваниеСчетчика" +НомерСчетчика;
			ЕдИзмСч = "ЕдИзмСч" + НомерСчетчика;
			
			ДоПоказаний = "ДоПоказаний" + НомерСчетчика;
			ОбластьВсего.Параметры[ДоПоказаний] = Строка.ДоПоказаний;
			ОбластьВсего.Параметры[НазваниеСчетчика] = Строка.Счетчик;
			ОбластьВсего.Параметры[ЕдИзмСч]          = Строка.ЕдИзм;
			
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
	
	ОбластьВсего.Параметры.ИтогоКОплатеСУчетомПени = "ИТОГО: " + мСтруктураДанных.ИтогоКОплатеСУчетомПени +" "+
	?(мСтруктураДанных.ИтогПени<> 0,"в т. ч. Пени: " + мСтруктураДанных.ИтогПени,"");
	ТабДок.Вывести(ОбластьВсего);
	
	ОбластьПодвал.Параметры.СтрЗадолженность = "Задолженность на "+ Формат(НачалоМесяца(ТекущаяДата()),"ДФ=dd.MM.yyyy")+ " : " + мСтруктураДанных.Долг;
	ОбластьПодвал.Параметры.СтрОплата        = "Оплачено после "+ Формат(НачалоМесяца(ТекущаяДата()),"ДФ=dd.MM.yyyy")+ " : " + мСтруктураДанных.Оплата;
	
	Текст = "Вид собственности: " + мСтруктураДанных.СтатусКвартиры+ " К-во комнат: " + мСтруктураДанных.КоличествоКомнат
	+ " Площадь общ.: " + мСтруктураДанных.ОписаниеОбщейПлощади + " жилая: " 
	+ мСтруктураДанных.ОписаниеЖилойПлощади + " К-во проживающих:" + мСтруктураДанных.КоличествоПроживающих + "; льготников: " 
	+ мСтруктураДанных.КолЛьготников + " "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты), "Дата последней оплаты: "+мСтруктураДанных.ДатаПоследнейОплаты, "") 
	+"  Дата создания: "+ Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
	ОбластьПодвал.Параметры.СтрИнфо = Текст;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции // ()

// БИТ_ЖКХ добавление кода Начало: 23.09.2011 
// Функция формирует табличный документ с печатной формой Квитанция7.
// Возвращаемое значение:
// Табличный документ - печатная форма. 
Функция ПечатьСчетКвитанция7()
	
	Попытка
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	
	Макет = ПолучитьМакет("Квитанция7");
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.КлючПараметровПечати = "Счет-Извещение";
	
	ОбластьШапка       = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока      = Макет.ПолучитьОбласть("Строка|Часть1");
	ДопСтрока          = Макет.ПолучитьОбласть("Строка|Часть2");
	ОбластьВсего       = Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал      = Макет.ПолучитьОбласть("Подвал");
	ПустаяСтрока       = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	УчитыватьЛьготу = НЕ мЛьготаПерсонифицированная;
	
	мТаблицаПечати4 = мТаблицаПечати.Скопировать();
	
	Для Каждого ТекСтрока  Из мТаблицаПечати4  Цикл 
		КОплате = ТекСтрока.СальдоНаНачало + ТекСтрока.Начислено - ТекСтрока.Оплата + ТекСтрока.Разовые - ТекСтрока.Субсидия 
		- ?(УчитыватьЛьготу, ТекСтрока.Льгота, 0);
		Если КОплате < 0 Тогда
			ТекСтрока.КОплате = КОплате;
		КонецЕсли; 
	КонецЦикла;
	// БИТ_ЖКХ добавление кода конец : 23.09.2011
	
	Если мЗагруженШтрихкод тогда

		СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, Ссылка.Наименование, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Ссылка.Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
		
		ОбластьШапка.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
		
	КонецЕсли;
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация);
	
	ОбластьШапка.Параметры.НазваниеОрганизации = Организация;
	ОбластьШапка.Параметры.АдресОрганизации    = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ИННОрганизации      = Организация.ИНН;
	ОбластьШапка.Параметры.Месяц               = Формат(Месяц(ТекущаяДата()), "ЧЦ=2; ЧВН=");
	ОбластьШапка.Параметры.Год                 = Формат(Год(ТекущаяДата())  , "ЧЦ=4; ЧГ=");
	ОбластьШапка.Параметры.ДатаПоследнейОплаты = ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты),Формат(мСтруктураДанных.ДатаПоследнейОплаты,"ДФ=dd.MM.yyyy"),"");
	// БИТ_ЖКХ добавление кода Начало: 23.09.2011 
	Если мСтруктураДанных.КОплате <> мТаблицаПечати4.Итог("КОплате") Тогда
		ОбластьШапка.Параметры.КОплате = мТаблицаПечати4.Итог("КОплате") + мСтруктураДанных.ИтогПени;
	КонецЕсли;
	// БИТ_ЖКХ добавление кода конец : 23.09.2011
	ТабДок.Вывести(ОбластьШапка);
	
	ИндексСтроки = 0;
	КолПустыхСтрок = 12;
	Вывести = Истина;
	
	мТаблицаПечати1 = мТаблицаПечати.Скопировать();
	мТаблицаПечати2 = мТаблицаПечати.Скопировать();
	
	Для каждого Колонка Из мТаблицаПечати1.Колонки Цикл
		
		Колонка.Имя = Колонка.Имя + 1;
		
	КонецЦикла;
	
	Для каждого Колонка Из мТаблицаПечати2.Колонки Цикл
		
		Колонка.Имя = Колонка.Имя + 1;
		
	КонецЦикла; 
	
	Для каждого Строка Из мТаблицаПечати Цикл
		// БИТ_ЖКХ изменения кода . Начало: 21.05.2012
		Если Строка.СальдоНаНачало = 0 И Строка.Начислено = 0 Тогда
			Продолжить;
		Иначе
			
			ИндексСтроки = ИндексСтроки + 1;
			
			Если ИндексСтроки <> 23 Тогда
				
				Если Вывести Тогда
					
					ОбластьСтрока.Параметры.Заполнить(Строка);
					
					// БИТ_ЖКХ добавление кода Начало: 23.08.2011 
					Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") Тогда
						ОбластьСтрока.Параметры.Количество = Null;
					КонецЕсли;
					// БИТ_ЖКХ добавление кода конец : 23.08.2011
					
					ТабДок.Вывести(ОбластьСтрока);
					
				Иначе 
					
					ДопСтрока.Параметры.Заполнить(Строка);
					
					// БИТ_ЖКХ добавление кода Начало: 24.08.2011 
					Если ТипЗнч(Строка.Услуга) = Тип("СправочникСсылка.бит_ГруппыУслуг") Тогда
						ДопСтрока.Параметры.Количество = Null;
					КонецЕсли;
					// БИТ_ЖКХ добавление кода конец : 24.08.2011
					
					ТабДок.Присоединить(ДопСтрока);
					
				КонецЕсли    ;
				
				Вывести = ?(Вывести, ложь,Истина);
				
			КонецЕсли;
		КонецЕсли;
		// БИТ_ЖКХ изменения кода . Конец  21.05.2012
	КонецЦикла;   
	
	Если Вывести Тогда
		
		ИндексСтроки = ИндексСтроки + 2;
		
		Для Значение=0 по ОбластьСтрока.Параметры.Количество() - 1 Цикл
			
			ОбластьСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;  
		
		ТабДок.Вывести(ОбластьСтрока);
		
		// БИТ_ЖКХ изменения кода . Начало: 23.03.2011 
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			
			ДопСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;  
		// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
		
		ДопСтрока.Параметры.Услуга         = "ИТОГО";
		ДопСтрока.Параметры.Начислено      = мТаблицаПечати.итог("Начислено");
		ДопСтрока.Параметры.КОплатеЗаМесяц = мТаблицаПечати.итог("КОплатеЗаМесяц");
		// БИТ_ЖКХ добавление кода Начало: 05.04.2012 
		ДопСтрока.Параметры.Разовые 	= мТаблицаПечати.итог("Разовые");
		ДопСтрока.Параметры.Льгота      = мТаблицаПечати.итог("Льгота");
		// БИТ_ЖКХ добавление кода конец : 05.04.2012
		ТабДок.Присоединить(ДопСтрока);
		
	Иначе
		
		ИндексСтроки = ИндексСтроки + 1;
		// БИТ_ЖКХ изменения кода . Начало: 23.03.2011 
		Для Значение=0 по ДопСтрока.Параметры.Количество() - 1 Цикл
			
			ДопСтрока.Параметры.Установить(Значение, "");
			
		КонецЦикла;  
		// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
		ДопСтрока.Параметры.Услуга         = "ИТОГО";
		ДопСтрока.Параметры.Начислено      = мТаблицаПечати.итог("Начислено");
		ДопСтрока.Параметры.КОплатеЗаМесяц = мТаблицаПечати.итог("КОплатеЗаМесяц");
		// БИТ_ЖКХ добавление кода Начало: 05.04.2012 
		ДопСтрока.Параметры.Разовые 	= мТаблицаПечати.итог("Разовые");
		ДопСтрока.Параметры.Льгота      = мТаблицаПечати.итог("Льгота");
		// БИТ_ЖКХ добавление кода конец : 05.04.2012
		ТабДок.Присоединить(ДопСтрока);
		
	КонецЕсли; 
	
	КолПустыхСтрок = КолПустыхСтрок - (ИндексСтроки/2);
	
	Пока КолПустыхСтрок <> 0 Цикл
		КолПустыхСтрок = КолПустыхСтрок - 1;
		ТабДок.Присоединить(ПустаяСтрока);
	КонецЦикла;
	
	НомерСчетчика = 0;
	
	мТаблицаПечатиСчетчиков1 = мТаблицаПечатиСчетчиков.Скопировать();
	мТаблицаПечатиСчетчиков1.Свернуть("Счетчик,ЕдИзм,ДоПоказаний");
	Для каждого Строка Из мТаблицаПечатиСчетчиков1 Цикл
		
		НомерСчетчика =  НомерСчетчика + 1;
		Если НомерСчетчика <= 6 Тогда
			
			НазваниеСчетчика = "НазваниеСчетчика" +НомерСчетчика;
			ЕдИзмСч = "ЕдИзмСч" + НомерСчетчика;
			
			ДоПоказаний = "ДоПоказаний" + НомерСчетчика;
			ОбластьВсего.Параметры[ДоПоказаний] = Строка.ДоПоказаний;
			
			ОбластьВсего.Параметры[НазваниеСчетчика] = Строка.Счетчик;
			ОбластьВсего.Параметры[ЕдИзмСч]          = Строка.ЕдИзм;
			
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
	
	// БИТ_ЖКХ добавление кода Начало: 23.09.2011 
	Если мСтруктураДанных.КОплате <> мТаблицаПечати4.Итог("КОплате") Тогда
		ОбластьВсего.Параметры.КОплате = мТаблицаПечати4.Итог("КОплате") + мСтруктураДанных.ИтогПени;
	КонецЕсли; 
	
	// БИТ_ЖКХ добавление кода конец : 23.09.2011
	ТабДок.Вывести(ОбластьВсего);
	
	ОбластьПодвал.Параметры.СтрЗадолженность = "Задолженность на "+ Формат(НачалоМесяца(ТекущаяДата()),"ДФ=dd.MM.yyyy")+ " : " + мСтруктураДанных.Сальдо;
	
	ОбластьПодвал.Параметры.СтрОплата        = "Оплачено за период: с "+ Формат(НачалоМесяца(ТекущаяДата()),"ДФ=dd.MM.yyyy")+ " по " + Формат(КонецМесяца(ТекущаяДата()),"ДФ=dd.MM.yyyy") + " : " + мСтруктураДанных.Оплата;
	
	Текст = "Вид собственности: " + мСтруктураДанных.СтатусКвартиры+ " К-во комнат: " + мСтруктураДанных.КоличествоКомнат
	+ " Площадь общ.: " + мСтруктураДанных.ОписаниеОбщейПлощади + " жилая: " 
	+ мСтруктураДанных.ОписаниеЖилойПлощади + " К-во проживающих:" + мСтруктураДанных.КоличествоПроживающих + "; льготников: " 
	+ мСтруктураДанных.КолЛьготников + " "+ ?(ЗначениеЗаполнено(мСтруктураДанных.ДатаПоследнейОплаты), "Дата последней оплаты: "+мСтруктураДанных.ДатаПоследнейОплаты, "") 
	+"  Дата создания: "+ Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
	ОбластьПодвал.Параметры.СтрИнфо = Текст;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции // ()
// БИТ_ЖКХ добавление кода конец : 23.09.2011

// БИТ_ЖКХ добавление кода. Начало. 07.08.2012{{
Функция ПечатьКвитанции8(ИмяМакета);
	
	ТабПоле = Новый ТабличныйДокумент();
	ТабПоле.КлючПараметровПечати = "Счет-Извещение";
	
	Попытка
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	
	Макет = ПолучитьМакет("Квитанция8");
	
	Шапка                    = Макет.ПолучитьОбласть("Шапка");
	ЛеваяЧасть               = Макет.ПолучитьОбласть("ЛеваяЧасть");
	ЛеваяЧастьПустаяСтрока   = Макет.ПолучитьОбласть("ЛеваяЧастьПустаяСтрока");
	ЛеваяЧастьПодвал         = Макет.ПолучитьОбласть("ЛеваяЧастьПодвал");
	
	ОбластьШК                = Макет.ПолучитьОбласть("ОбластьШК");
	
	ТаблицаСЧПустаяСтрока    = Макет.ПолучитьОбласть("ТаблицаСЧПустаяСтрока");
	ТаблицаСЧСтрока          = Макет.ПолучитьОбласть("ТаблицаСЧСтрока");
	ТаблицаСЧШапка           = Макет.ПолучитьОбласть("ТаблицаСЧШапка");
	
	Середина                 = Макет.ПолучитьОбласть("Середина");
	
	ИнфШапка                 = Макет.ПолучитьОбласть("ИнфШапка");
	
	ИнфОПлатежеПустаяСтрока  = Макет.ПолучитьОбласть("ИнфОПлатежеПустаяСтрока");
	ИнфОПлатежеПодвал        = Макет.ПолучитьОбласть("ИнфОПлатежеПодвал");
	
	ТаблицаУслугШапка        = Макет.ПолучитьОбласть("ТаблицаУслугШапка");
	ТаблицаУслугСтрока       = Макет.ПолучитьОбласть("ТаблицаУслугСтрока");
	ТаблицаУслугИтого        = Макет.ПолучитьОбласть("ТаблицаУслугИтого");
	ТаблицаУслугПустаяСтрока = Макет.ПолучитьОбласть("ТаблицаУслугПустаяСтрока");
	ТаблицаУслугПодвал       = Макет.ПолучитьОбласть("ТаблицаУслугПодвал");
	
	Разделитель              = Макет.ПолучитьОбласть("Разделитель");
	
	СтруктураСтрокаИнф = Новый Структура;
	
	Для Значение = 1 По 13 Цикл
		
		ИмяОбласти = "ИнфСтр" + Значение;
		СтруктураСтрокаИнф.Вставить(ИмяОбласти, Макет.ПолучитьОбласть(ИмяОбласти));
		
	КонецЦикла; 
	
	ТаблицаСЧ          = Новый ТабличныйДокумент;
	ТаблицаНаПечать    = Новый ТабличныйДокумент;
	
	// Заполнение параметров и вывод на печать.
	
	// Представление получателя.
	Если мСтруктураДанных.ПолучательВариантНаименования = Перечисления.ВариантыНаименованияДляПечатныхФорм.СокращенноеНаименование Тогда
		мСтруктураДанных.ПолучательПредставление =  мСтруктураДанных.ПолучательСокращенноеНаименование;
	КонецЕсли; 
	
	// Разбить адрес.
	ЛицевойСчетАдрес_1 = "";
	ЛицевойСчетАдрес_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ЛицевойСчетАдрес, 30, ЛицевойСчетАдрес_1 , ЛицевойСчетАдрес_2 );
	
	мСтруктураДанных.Вставить("ЛицевойСчетАдрес_1", ЛицевойСчетАдрес_1);
	мСтруктураДанных.Вставить("ЛицевойСчетАдрес_2", ЛицевойСчетАдрес_2);
	
	// Разбить описание льготы.
	ОписаниеЛьгот_1 = "";
	ОписаниеЛьгот_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(мСтруктураДанных.ОписаниеЛьгот, 30, ОписаниеЛьгот_1 , ОписаниеЛьгот_2 );
	
	мСтруктураДанных.Вставить("ОписаниеЛьгот_1", ОписаниеЛьгот_1);
	мСтруктураДанных.Вставить("ОписаниеЛьгот_2", ОписаниеЛьгот_2);
	
	тмпТаблица = мТаблицаПечати.Скопировать();
	
	Для Каждого СтрокаТаблицы  Из тмпТаблица  Цикл 
		
		КОплате = СтрокаТаблицы.Начислено + СтрокаТаблицы.Разовые  
		- ?(мЛьготаПерсонифицированная, 0, СтрокаТаблицы.Льгота);
		
		СтрокаТаблицы.КОплате = КОплате;
		
		Если СтрокаТаблицы.НормативПоКу = 0 Тогда
			СтрокаТаблицы.Объем = СтрокаТаблицы.Количество;
		КонецЕсли;
		
		Если СтрокаТаблицы.Тариф = 0 Тогда
			СтрокаТаблицы.Тариф = СтрокаТаблицы.Ставка;
		КонецЕсли;
		
	КонецЦикла;
	
	мСтруктураДанных.НачисленоВТекущемПериодеДляБанка = тмпТаблица.Итог("Коплате");
	мСтруктураДанных.Коплате                          = тмпТаблица.Итог("Коплате");
	
	мСтруктураДанных.ИтогоКОплатеСУчетомПредоплаты = мСтруктураДанных.СальдоНаНачалоМесяца + мСтруктураДанных.НачисленоВТекущемПериодеДляБанка - мСтруктураДанных.ОплаченоВТекущемПериоде;
	
	Шапка.Параметры.Заполнить(мСтруктураДанных);
	
	ТаблицаНаПечать.Вывести(Шапка);
	
	Если мЗагруженШтрихкод тогда
		
		СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, мСтруктураДанных.ЛицевойСчетНомер, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
		
		ОбластьШК.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
		
	КонецЕсли;
	
	ТаблицаНаПечать.Вывести(ОбластьШК);
	
	ТаблицаСЧ.Вывести(ТаблицаСЧШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСчетчиков", мТаблицаПечатиСчетчиков);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСчетчиков.Счетчик,
	|	ТаблицаСчетчиков.Услуга,
	|	ТаблицаСчетчиков.ОтПоказаний,
	|	ТаблицаСчетчиков.ДоПоказаний,
	|	ТаблицаСчетчиков.Многотарифный,
	|	ТаблицаСчетчиков.Приоритет
	|ПОМЕСТИТЬ Счетчики
	|ИЗ
	|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счетчики.Счетчик,
	|	МАКСИМУМ(Счетчики.ОтПоказаний) КАК ОтПоказаний,
	|	МАКСИМУМ(Счетчики.ДоПоказаний) КАК ДоПоказаний,
	|	Счетчики.Многотарифный,
	|	СУММА(0) КАК Приоритет,
	|	СУММА(0) КАК Услуга
	|ИЗ
	|	Счетчики КАК Счетчики
	|ГДЕ
	|	НЕ Счетчики.Многотарифный
	|
	|СГРУППИРОВАТЬ ПО
	|	Счетчики.Счетчик,
	|	Счетчики.Многотарифный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Счетчики.Счетчик,
	|	Счетчики.ОтПоказаний,
	|	Счетчики.ДоПоказаний,
	|	Счетчики.Многотарифный,
	|	Счетчики.Приоритет,
	|	Счетчики.Услуга
	|ИЗ
	|	Счетчики КАК Счетчики
	|ГДЕ
	|	Счетчики.Многотарифный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СчетчикСЧ = 1;
	Пока Выборка.Следующий() Цикл
		
		Если СчетчикСЧ > 8 Тогда
			Прервать;
		КонецЕсли;
		
		ТаблицаСЧСтрока.Параметры.Заполнить(Выборка);
		Если Выборка.Многотарифный Тогда
			
			ТаблицаСЧСтрока.Параметры.Счетчик = "" + Выборка.Услуга;
			
		КонецЕсли; 
		
		ТаблицаСЧ.Вывести(ТаблицаСЧСтрока);
		
		СчетчикСЧ = СчетчикСЧ + 1;
		
	КонецЦикла;
	
	ДобавитьПустыхСтрокСч = 9 - СчетчикСЧ;
	
	Если ДобавитьПустыхСтрокСч > 0 Тогда
		
		Для Значение = 1 По ДобавитьПустыхСтрокСч Цикл
			ТаблицаСЧ.Вывести(ТаблицаСЧПустаяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаНаПечать.Присоединить(ТаблицаСЧ);
	Середина.Параметры.Заполнить(мСтруктураДанных);
	ТаблицаНаПечать.Вывести(Середина);
	
	ТаблицаНаПечать.Вывести(ТаблицаУслугШапка);
	ИнфШапка.Параметры.Заполнить(мСтруктураДанных);
	ТаблицаНаПечать.Присоединить(ИнфШапка);
	
	ТабПоле.Вывести(ЛеваяЧасть);
	ТабПоле.Присоединить(ТаблицаНаПечать);
	
	КоличествоСтрокУс =  мТаблицаПечати.Количество();
	
	ОдинокийЛьготник = (мСтруктураДанных.КолЛьготников = 1 И мСтруктураДанных.КоличествоПроживающих = 1);
	
	СчетчикСтрокУс = 1;
	Для каждого СтрокаТаблицы Из тмпТаблица Цикл
		
		Если СтрокаТаблицы.СальдоНаНачало = 0 И СтрокаТаблицы.Начислено = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		ТаблицаУслугСтрока.Параметры.Заполнить(СтрокаТаблицы);
		
		ТаблицаУслугСтрока.Параметры.Объем = "" + СтрокаТаблицы.Объем + "" + СтрокаТаблицы.ЕдИзм;
		
		ТабПоле.Вывести(ТаблицаУслугСтрока);
		
		Если СчетчикСтрокУс < 13 Тогда
			
			СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
			ТабПоле.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
			
		Иначе
			
			ТабПоле.Присоединить(ИнфОПлатежеПустаяСтрока);
			
		КонецЕсли;
		
		СчетчикСтрокУс = СчетчикСтрокУс + 1;
		
	КонецЦикла; 
	
	Если КоличествоСтрокУс < 13 Тогда
		
		ТабПоле.Вывести(ЛеваяЧастьПустаяСтрока);
		
		ТаблицаУслугИтого.Параметры.Заполнить(мСтруктураДанных);
		ТабПоле.Присоединить(ТаблицаУслугИтого);
		
		СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
		ТабПоле.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
		
		СчетчикСтрокУс = СчетчикСтрокУс + 1;
		
		Для Значение = СчетчикСтрокУс По 13  Цикл
			
			ТабПоле.Вывести(ЛеваяЧастьПустаяСтрока);
			ТабПоле.Присоединить(ТаблицаУслугПустаяСтрока);
			
			СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс].Параметры.Заполнить(мСтруктураДанных);
			ТабПоле.Присоединить(СтруктураСтрокаИнф["ИнфСтр" + СчетчикСтрокУс]);
			
			СчетчикСтрокУс = СчетчикСтрокУс + 1;
			
		КонецЦикла;
		
		ЛеваяЧастьПодвал.Параметры.Заполнить(мСтруктураДанных);
		ТабПоле.Вывести(ЛеваяЧастьПодвал);
		ТабПоле.Присоединить(ТаблицаУслугПодвал);
		ТабПоле.Присоединить(ИнфОПлатежеПодвал);
		
	Иначе
		
		ЛеваяЧастьПодвал.Параметры.Заполнить(мСтруктураДанных);
		ТабПоле.Вывести(ЛеваяЧастьПодвал);
		
		ТаблицаУслугИтого.Параметры.Заполнить(мСтруктураДанных);
		ТабПоле.Присоединить(ТаблицаУслугИтого);
		
		ТабПоле.Присоединить(ИнфОПлатежеПодвал);
		
	КонецЕсли;
	
	ТабПоле.Вывести(Разделитель);
	
	Возврат ТабПоле;
	
КонецФункции // ()

Функция ПечатьСчетИзвещения6(ИмяМакета)  
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.КлючПараметровПечати = "Счет-Извещение";
	
	Макет = ПолучитьМакет("СчетИзвещение5");
	
	Попытка
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	
	ОбластьШапка1       = Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2       = Макет.ПолучитьОбласть("Шапка2");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал1      = Макет.ПолучитьОбласть("Подвал1");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = Макет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = Макет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = Макет.ПолучитьОбласть("Итого"); 
	
	ШапкаПриборыУчета    = Макет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаПриборовУчета  = Макет.ПолучитьОбласть("СтрокаПриборовУчета");
	
	СтрокаВывода            = Макет.ПолучитьОбласть("СтрокаВывода");
	ОбластьШтрихКод         = Макет.ПолучитьОбласть("ОбластьШтрихКод");
	ОбластьКассовыйСбор     = Макет.ПолучитьОбласть("КассовыйСбор");
	ОбластьСтрокаОбращение	= Макет.ПолучитьОбласть("СтрокаОбращение");
	ОбластьЛиния            = Макет.ПолучитьОбласть("Линия");
	
	ОбластьШапка1.Параметры.Заполнить(мСтруктураДанных);
	ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
	
	ТабДок.Вывести(ОбластьШапка1);
	
	Если мЗагруженШтрихкод тогда
		
		СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, мСтруктураДанных.ЛицевойСчетНомер, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
		
		ОбластьШтрихКод.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
		ТабДок.Вывести(ОбластьШтрихКод);
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапка2);
	
	СчВывода = 5;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСчетчиков", мТаблицаПечатиСчетчиков);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСчетчиков.Счетчик,
	|	ТаблицаСчетчиков.Услуга,
	|	ТаблицаСчетчиков.ОтПоказаний,
	|	ТаблицаСчетчиков.ДоПоказаний,
	|	ТаблицаСчетчиков.Многотарифный,
	|	ТаблицаСчетчиков.Приоритет,
	|	ТаблицаСчетчиков.КоличествоЕдиницПоЛС КАК Количество
	|ПОМЕСТИТЬ Счетчики
	|ИЗ
	|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счетчики.Счетчик,
	|	МАКСИМУМ(Счетчики.ОтПоказаний) КАК ОтПоказаний,
	|	МАКСИМУМ(Счетчики.ДоПоказаний) КАК ДоПоказаний,
	|	Счетчики.Многотарифный,
	|	МАКСИМУМ(0) КАК Приоритет,
	|	МАКСИМУМ("""") КАК Услуга,
	|	МАКСИМУМ(Счетчики.Количество) КАК Количество
	|ИЗ
	|	Счетчики КАК Счетчики
	|ГДЕ
	|	НЕ Счетчики.Многотарифный
	|
	|СГРУППИРОВАТЬ ПО
	|	Счетчики.Счетчик,
	|	Счетчики.Многотарифный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Счетчики.Счетчик,
	|	Счетчики.ОтПоказаний,
	|	Счетчики.ДоПоказаний,
	|	Счетчики.Многотарифный,
	|	Счетчики.Приоритет,
	|	Счетчики.Услуга,
	|	Счетчики.Количество
	|ИЗ
	|	Счетчики КАК Счетчики
	|ГДЕ
	|	Счетчики.Многотарифный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока СчВывода <> 0 цикл
		ТабДок.Вывести(СтрокаВывода);
		СчВывода = СчВывода - 1;
	КонецЦикла;
	
	Выборка.Сбросить();
	
	ТабДок.Вывести(ОбластьПодвал);
	
	мСтруктураДанных.СальдоНаНачалоМесяца = мСтруктураДанных.СальдоНаНачалоМесяца * ?(мСтруктураДанных.СальдоНаНачалоМесяца > 0,1, -1);
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.Вывести(ШапкаПриборыУчета);
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаПриборовУчета.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(СтрокаПриборовУчета);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал1);
	ТабДок.Вывести(ШапкаЗаголовки);
	
	Для Каждого ТекСтрока  Из мТаблицаПечати  Цикл 
		
		Если ТекСтрока.СальдоНаНачало = 0 И ТекСтрока.Начислено = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаРасшифровки.Параметры.Заполнить(ТекСтрока);
		
		Если ТекСтрока.НормативПоКу = 0 Тогда
			СтрокаРасшифровки.Параметры.Объем = ТекСтрока.Количество;
			СтрокаРасшифровки.Параметры.Тариф = ТекСтрока.Ставка;
		КонецЕсли;
		
		ТабДок.Вывести(СтрокаРасшифровки);
		
	КонецЦикла;
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	
	ОбластьИтого.Параметры.КОплате   = мТаблицаПечати.Итог("КОплате");
	
	ТабДок.Вывести(ОбластьИтого);
	
	Возврат ТабДок;
	
КонецФункции //
// БИТ_ЖКХ добавление кода. Конец. 07.08.2012}}

// Функция формирует табличный документ с печатной формой СчетИзвещения.
// Возвращаемое значение:
// Табличный документ - печатная форма. 
Функция ПечатьСчетИзмещенияВариант2(ИмяМакета)
	
	Попытка
		КомпонентШК = Новый COMОбъект("V8.Barcod.1");
		мЗагруженШтрихкод = Истина;
	Исключение
		мЗагруженШтрихкод = Ложь;
	КонецПопытки;
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.КлючПараметровПечати = "Счет-Извещение";
	
	ОбластьШапка1       = Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2       = Макет.ПолучитьОбласть("Шапка2");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал1      = Макет.ПолучитьОбласть("Подвал1");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ШапкаЗаголовки      = Макет.ПолучитьОбласть("ШапкаЗаголовки");
	СтрокаРасшифровки   = Макет.ПолучитьОбласть("СтрокаРасшифровки");
	ОбластьИтого        = Макет.ПолучитьОбласть("Итого");
	ОбластьИтогоПени    = Макет.ПолучитьОбласть("ИтогоПени");
	ШапкаПриборыУчета   = Макет.ПолучитьОбласть("ШапкаПриборыУчета");
	СтрокаПриборовУчета = Макет.ПолучитьОбласть("СтрокаПриборовУчета");
	СтрокаВывода        = Макет.ПолучитьОбласть("СтрокаВывода");
	ОбластьШтрихКод     = Макет.ПолучитьОбласть("ОбластьШтрихКод");
	
	ОбластьШапка1.Параметры.Заполнить(мСтруктураДанных);
	ТабДок.Вывести(ОбластьШапка1); 
	Если мЗагруженШтрихкод тогда

		СтрокаСумма = бит_ОбщегоНазначения.СформируемШтрихКод(мСтруктураДанных.ИтогоКОплатеСУчетомПени, Ссылка.Наименование, Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам.Идентификатор, Ссылка.Идентификатор, мНомерПолучателяПоБанку, мИспользоватьНомерПолучателяВШК);
		
		ОбластьШтрихКод.Рисунки.ШтрихКод.Объект.Сообщение = СтрокаСумма;
		
		ТабДок.Вывести(ОбластьШтрихКод);
	КонецЕсли;
	ОбластьШапка2.Параметры.Заполнить(мСтруктураДанных);
	ТабДок.Вывести(ОбластьШапка2);
	
	
	СчВывода = 5;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабСЧ.Счетчик,
	|	ТабСЧ.Услуга,
	|	ТабСЧ.ДоПоказаний,
	|	ТабСЧ.Приоритет
	|ПОМЕСТИТЬ ТабСЧ
	|ИЗ
	|	&ТабСЧ КАК ТабСЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСЧ.Счетчик КАК Счетчик,
	|	ТабСЧ.Услуга КАК Услуга,
	|	ТабСЧ.ДоПоказаний КАК ДоПоказаний,
	|	ТабСЧ.Приоритет КАК Приоритет
	|ИЗ
	|	ТабСЧ КАК ТабСЧ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(ДоПоказаний)
	|ПО
	|	Счетчик";
	
	Запрос.УстановитьПараметр("ТабСЧ",мТаблицаПечатиСчетчиков);
	
	ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаСЧ = мТаблицаПечатиСчетчиков.СкопироватьКолонки();
	ТаблицаСЧ.Очистить();
	
	Если ВыборкаСЧ.Количество() > 0 тогда
		
		СчВывода = СчВывода - 1;
		ТабДок.Вывести(ШапкаПриборыУчета);
		Пока ВыборкаСЧ.Следующий() Цикл
			
			НоваяСтрока = ТаблицаСЧ.Добавить();
			СтрокаПриборовУчета.Параметры.Заполнить(ВыборкаСЧ);
			Выборка = ВыборкаСЧ.Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				СтрокаПриборовУчета.Параметры.Услуга = Лев(Выборка.Услуга, 12);
				
			КонецЕсли;
			
			СчВывода = СчВывода - 1;
			ТабДок.Вывести(СтрокаПриборовУчета);
			
			Если СЧВывода <= 0 Тогда
				
				Прервать;
				СчВывода =0;
				
			КонецЕсли; 
			
		КонецЦикла;	
		
		Пока СчВывода <> 0 цикл
			ТабДок.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
		КонецЦикла;
		
	иначе
		
		Пока СчВывода <> 0 цикл
			ТабДок.Вывести(СтрокаВывода);
			СчВывода = СчВывода - 1;
		КонецЦикла;	
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьПодвал);
	
	ОбластьШапка.Параметры.Заполнить(мСтруктураДанных);
	ТабДок.Вывести(ОбластьШапка);
	
	Если ТаблицаСЧ.Количество() > 0 Тогда
		ТабДок.Вывести(ШапкаПриборыУчета);
		Для каждого ТекСтрока Из ТаблицаСЧ Цикл
			
			СтрокаПриборовУчета.Параметры.Заполнить(ТекСтрока);
			// БИТ_ЖКХ изменения кода . Начало: 23.03.2011
			СтрокаПриборовУчета.Параметры.Услуга = Лев(СтрокаПриборовУчета.Параметры.Услуга,12);
			// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
			ТабДок.Вывести(СтрокаПриборовУчета);
			
		КонецЦикла; 
	иначе
		
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьПодвал1);
	ШапкаЗаголовки.Параметры.Заполнить(мСтруктураДанных);
	ТабДок.Вывести(ШапкаЗаголовки);
	
	Для Каждого ТекСтрока  Из мТаблицаПечати  Цикл 
		// БИТ_ЖКХ изменения кода . Начало: 21.05.2012
		Если ТекСтрока.СальдоНаНачало = 0 И ТекСтрока.Начислено = 0 Тогда
			Продолжить;
		Иначе
			СтрокаРасшифровки.Параметры.Заполнить(ТекСтрока);
			ТабДок.Вывести(СтрокаРасшифровки);
		КонецЕсли;
		// БИТ_ЖКХ изменения кода . Конец  21.05.2012
	КонецЦикла;
	
	ОбластьИтого.Параметры.Заполнить(мСтруктураДанных);
	ТабДок.Вывести(ОбластьИтого);
	
	Если мСтруктураДанных.ИтогПени > 0 Тогда
		
		ОбластьИтогоПени.Параметры.Заполнить(мСтруктураДанных);
		ТабДок.Вывести(ОбластьИтогоПени);
		
	КонецЕсли; 
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	
	Возврат ТабДок;
	
КонецФункции // ()

// Функция формирует табличный документ с печатной формой СчетИзвещения.
// Возвращаемое значение:
// Табличный документ - печатная форма. 
Функция ПечатьСчетИзвещенияПодробно() 
	
	Макет = ПолучитьМакет("СчетИзвещение");
	
	ТабДок = Новый ТабличныйДокумент();
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	
	Возврат ТабДок;
	
КонецФункции //  

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Процедура осуществляет печать справочника. Можно направить печать на. 
// Экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
// Параметры:
//  НазваниеМакета - строка, название макета.
// Возвращаемое значение:
//  Нет.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь, ФормаЭлемента = Неопределено) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "СчетИзвещения" Тогда
		// БИТ_ЖКХ изменения кода . Начало: 25.10.2011
		ТабДокумент = ПечатьСчетИзвещения(Истина);
	ИначеЕсли ИмяМакета = "СчетИзвещения1"  Тогда
		ТабДокумент = ПечатьСчетИзвещения(Ложь);
		// БИТ_ЖКХ изменения кода . Конец  25.10.2011
	ИначеЕсли ИмяМакета = "СчетИзвещение2" ИЛИ ИмяМакета = "СчетИзвещение3" Тогда
		ТабДокумент = ПечатьСчетИзмещенияВариант2(ИмяМакета);
		// БИТ_ЖКХ изменения кода . Начало: 23.03.2011 
	ИначеЕсли ИмяМакета = "СчетИзвещение4" ИЛИ ИмяМакета = "СчетИзвещение5"  Тогда
		ТабДокумент = ПечатьСчетИзвещенияВариант4(ИмяМакета);
		// БИТ_ЖКХ изменения кода . Конец  23.03.2011 
	ИначеЕсли ИмяМакета = "СчетИзвещение6"  Тогда
		ТабДокумент = ПечатьСчетИзвещения6(ИмяМакета);
	ИначеЕсли ИмяМакета = "Квитанция6" ИЛИ ИмяМакета = "Квитанция6_1" Тогда
		ТабДокумент = ПечатьСчетКвитанция6(ИмяМакета);
	ИначеЕсли ИмяМакета = "Квитанция5" Тогда
		ТабДокумент = ПечатьСчетКвитанция5();
		// БИТ_ЖКХ добавление кода Начало: 23.09.2011 
	ИначеЕсли ИмяМакета = "Квитанция7" Тогда
		ТабДокумент = ПечатьСчетКвитанция7();
	ИначеЕсли ИмяМакета = "Квитанция8"  Тогда
		ТабДокумент = ПечатьКвитанции8(ИмяМакета);
		// БИТ_ЖКХ добавление кода конец : 23.09.2011	
	ИначеЕсли ИмяМакета = "СчетИзвещенияПодробно" тогда	
		ТабДокумент = ПечатьСчетИзвещенияПодробно();
	ИначеЕсли ИмяМакета = "ПоквартирнаяКарточка" тогда
		ОтчетОбъект = Отчеты.бит_ПоквартирнаяКарточка.Создать();
		ОтчетОбъект.ЛицевойСчет = Ссылка;
		ФормаОтчета = ОтчетОбъект.ПолучитьФорму("ПоквартирнаяКарточкаУправляемая");
		ФормаОтчета.Открыть();
		ОтчетОбъект.ПоквартирнаяКарточкаВывести(ФормаОтчета.ЭлементыФормы.ПолеТабличногоДокумента);
		
		Возврат;
		
	ИначеЕсли  ИмяМакета = "КопияФинансовоЛицевогоСчета" тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЛицевойСчет", Ссылка);
		
		ОткрытьФорму("Отчет.бит_КопияФинансовоЛицевогоСчета.Форма.ФормаОтчета", ПараметрыФормы);

		Возврат;
	ИначеЕсли  ИмяМакета = "ВыпискаИзДомовойКниги"  тогда
		ОтчетОбъект = Отчеты.бит_ВыпискаИзДомовойКниги.Создать();
		ОтчетОбъект.Дата        = ТекущаяДата();
		ОтчетОбъект.ЛицевойСчет = Ссылка;
		ФормаОтчета = ОтчетОбъект.ПолучитьФорму("ФормаОтчетаУправляемая");
		ФормаОтчета.Открыть();
		// БИТ_ЖКХ изменения кода . Начало: 26.09.2011
		// Добавлен второй параметр.
		ОтчетОбъект.СформироватьОтчет(ФормаОтчета.ЭлементыФормы.Результат,ИмяМакета);
		// БИТ_ЖКХ изменения кода . Конец  26.09.2011
		Возврат;
		// БИТ_ЖКХ изменение кода. Начало. 18.01.2012{{
	ИначеЕсли ИмяМакета = "КарточкаРасчетовПоЛицевомуСчету" Тогда
		
		Параметры = Новый Структура;
		Параметры.Вставить("НачалоПериода"    , НачалоМесяца(ТекущаяДата()));
		Параметры.Вставить("КонецПериода"     , КонецМесяца(ТекущаяДата()));
		Параметры.Вставить("ЛицевойСчет"      , Ссылка);
		Параметры.Вставить("СформироватьОтчет", Истина);
		
		ОткрытьФорму("Отчет.бит_КарточкаРасчетовПоЛицевомуСчету.Форма.ФормаОтчета", Параметры);
		
		Возврат;
		
	ИначеЕсли ИмяМакета = "СправкаПоПовестке" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЛицевойСчет", Ссылка);
		
		ОткрытьФорму("Отчет.бит_СправкаПоПовестке.Форма.ФормаОтчета", ПараметрыФормы);
		
		// БИТ_ЖКХ изменения кода . Начало: 29.07.2013
	ИначеЕсли ИмяМакета = "ОтчетОДвиженияхНаЛСПомесячно" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЛицевойСчет", Ссылка);
		
		ОткрытьФорму("Отчет.бит_ОтчетОДвиженияхНаЛСПомесячно.Форма.ФормаОтчета", ПараметрыФормы);
		// БИТ_ЖКХ изменения кода . Конец: 29.07.2013
	Иначе

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка получения дополнительной печатной формы объекта. Возможно форма была удалена");
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Возвращает доступные варианты печати справочника.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	Возврат Новый Структура("ПоквартирнаяКарточка,КопияФинансовоЛицевогоСчета,ВыпискаИзДомовойКниги,КарточкаРасчетовПоЛицевомуСчету, СправкаПоПовестке, ОтчетОДвиженияхНаЛСПомесячно"
	,"Поквартирная карточка","Копия финансово-лицевого счета","Выписка из домовой книги", "Карточка расчетов по лицевому счету", "Справка по повестке", "Отчет о движениях на ЛС помесячно");
	
КонецФункции // ПолучитьСписокПечатныхФорм()

// БИТ_ЖКХ добавление кода Начало: 27.02.2012 
// Функция получает ответственного по ЛС на текущую дату.
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//  <Параметр2>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>.
//
Функция ПолучитьОтветственногоПоЛС() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ОтветственныеЛицаПоКУСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		Ответственный = Результат[0].ФизЛицо;
	Иначе
		Ответственный = Справочники.бит_Проживающие.ПустаяСсылка();
	КонецЕсли; 
	Возврат Ответственный;
	
КонецФункции // ПолучитьОтветственногоПоЛС()

#КонецОбласти

#КонецЕсли

#Область ПроцедурыИФункцииОбщегоНазначения

// Проверяет уникальность лицевого счета.
Процедура ПроверитьУникальностьЛицевогоСчета(Отказ)  Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка <> &Ссылка
	|	И бит_ЛицевыеСчета.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("Ссылка"            ,Ссылка);
	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный лицевой счет уже существует.",Отказ,,СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры	

// Проверяет уникальность адреса.
Процедура ПроверитьУникальностьАдреса(Отказ)  Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка <> &Ссылка
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
	|	И бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.Квартира = &Квартира";
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета" ,УлицаЛицевогоСчета);
	Запрос.УстановитьПараметр("Здание"             ,Здание);
	Запрос.УстановитьПараметр("Квартира"           ,Квартира);
	Запрос.УстановитьПараметр("Ссылка"             ,Ссылка);
	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный адрес уже существует.",Отказ,,СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры	

// Проверяет правильность ввода лицевого счета.
Процедура ПроверитьПравильностьВводаЛС(СтрокаТекста,Отказ)  Экспорт 
	
	// БИТ_ЖКХ 23.05.2017 11:43:09 Начало правки...
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_РазрешитьТекстЛС") Тогда
		Возврат;	
	КонецЕсли;
	// БИТ_ЖКХ 23.05.2017 11:43:09 Конец правки.
	
	Для Значение = 1 По СтрДлина(СтрокаТекста) Цикл
		Если СписокКодовЧисел.НайтиПоЗначению(КодСимвола(СтрокаТекста,Значение)) = Неопределено 
			Тогда		
			
			бит_ОбщегоНазначения.СообщитьОбОшибке("Введены некорректыне данные! Лицевой счет может содержать только цифры.",Отказ,,СтатусСообщения.Важное);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

// БИТ_ЖКХ изменения кода. Начало.02.04.2009
// Изменяет основные сведения о квартире.
Процедура ИзменитьДанныеКвартиры (Реквизит,Значение) Экспорт
	
	Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, ТекущаяДата());
	бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись,Реквизит, Значение);	
	
КонецПроцедуры

// Процедура генерирует числовой идентитфикатор.
//
Процедура ЗаполнитьИД() Экспорт
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
		
		ГСЧ = Новый ГенераторСлучайныхЧисел;
		Число = ГСЧ.СлучайноеЧисло(1,999999);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	бит_ЛицевыеСчета.Ссылка
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
		Запрос.УстановитьПараметр("Идентификатор", Число);
		
		Результат =Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			
			ЗаполнитьИД();
			
		Иначе
			Идентификатор = Число;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" объекта справочника. 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Наименование = бит_ОбщегоНазначения.УбитьЛишнее(Строка(Наименование));
	Организация  = Здание.Организация;
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	// Выполним проверку заполненности обязательных реквизитов для элемента справочника.
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнен номер ЛС!");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПроверитьПравильностьВводаЛС(Наименование,Отказ);
	
	Если НЕ ЗначениеЗаполнено(УлицаЛицевогоСчета) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнена улица!");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Здание) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнен дом!");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Квартира) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнена квартира!");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;    
	
	Если Не Отказ тогда
		
		ПроверитьУникальностьЛицевогоСчета(Отказ);

	КонецЕсли;
	
	ЗаполнитьИД();
	
	// БИТ_ЖКХ 13.04.2017 17:25:53 Начало правки... 
	бит_ЗакрытыйСлужебныйСервер.ПровреритьВозможностьДобавления(ЭтотОбъект.ЭтоНовый(), Отказ);
	// БИТ_ЖКХ 13.04.2017 17:25:55 Конец правки. 
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

СписокКодовЧисел = Новый СписокЗначений;
Для Значение = 48 По 57 Цикл
	СписокКодовЧисел.Добавить(Значение); 
КонецЦикла;

#КонецОбласти

#КонецЕсли