
#Область ПроцедурыОбработчикиСобытийФормы

// БИТ_ЖКХ 10.05.2016 11:12:46 Начало правки... 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РедактированиеИзДокумента") Тогда
		Элементы.Период.ТолькоПросмотр  = Параметры.РедактированиеИзДокумента;
		Элементы.ФизЛицо.ТолькоПросмотр = Параметры.РедактированиеИзДокумента;
		РедактированиеИзДокумента		= Параметры.РедактированиеИзДокумента;
	КонецЕсли;
	
	Если Параметры.Ключ.ФизЛицо.Пустая() Тогда
		Параметры.Свойство("ФизЛицо", Запись.ФизЛицо);
		Параметры.Свойство("Период" , Запись.Период);
	КонецЕсли; 
	
КонецПроцедуры
// БИТ_ЖКХ 10.05.2016 11:12:50 Конец правки.

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
		
		Заголовок = "Фамилия, имя, отчество физ. лица: ";
		
	Иначе
		
		Заголовок = "Фамилия, имя, отчество физ. лица: " + ПолучитьНаименованиеФизЛицаНаСервере(Запись.ФизЛицо);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
		
		Заголовок = "Фамилия, имя, отчество физ. лица: ";
		
	Иначе
		
		Заголовок = "Фамилия, имя, отчество физ. лица: " + ПолучитьНаименованиеФизЛицаНаСервере(Запись.ФизЛицо);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПолучитьНаименованиеФизЛицаНаСервере(Знач ФизЛицо)
	
	Возврат ФизЛицо.Наименование;
	
КонецФункции

// БИТ_ЖКХ 10.05.2016 14:33:54 Начало правки... 
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если РедактированиеИзДокумента Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Фамилия"  , Запись.Фамилия);
		ПараметрыФормы.Вставить("Имя"      , Запись.Имя);
		ПараметрыФормы.Вставить("Отчество" , Запись.Отчество);
		
		Оповестить("СменаФамилииПоМЖ", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 10.05.2016 12:26:21 Конец правки.

#КонецОбласти