#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЗакрытиеСчета20

Функция ПодготовитьПараметрыЗакрытиеСчета20(СтруктураШапки, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос     = Новый Запрос;
	Содержание = "Закрытие расходов по смете ЖКХ";
	Запрос.УстановитьПараметр("Ссылка",          СтруктураШапки.Ссылка);
	Запрос.УстановитьПараметр("Содержание",      Содержание);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаЗакрытиеСчета20(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();

	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции // ПодготовитьПараметрыЗакрытиеСчета20()

Функция ТекстЗапросаЗакрытиеСчета20(НомераТаблиц)
	
	// Временные таблицы
	НомераТаблиц.Вставить("ТаблицаРеквизитыЗакрытие20", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ЗакрытиеСчетов.Ссылка КАК Регистратор,
	|	бит_ЗакрытиеСчетов.Организация КАК Организация,
	|	бит_ЗакрытиеСчетов.Дата КАК Период,
	|	НАЧАЛОПЕРИОДА(бит_ЗакрытиеСчетов.Дата, МЕСЯЦ) КАК НачДата,
	|	КОНЕЦПЕРИОДА(бит_ЗакрытиеСчетов.Дата, МЕСЯЦ) КАК КонДата,
	|	&Содержание КАК Содержание
	|ИЗ
	|	Документ.бит_ЗакрытиеСчетов КАК бит_ЗакрытиеСчетов
	|ГДЕ
	|	бит_ЗакрытиеСчетов.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции // ТекстЗапросаЗакрытиеСчета20()

#КонецОбласти

#КонецЕсли