
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаЧекККМ") Тогда
		
		Объект.Касса       = Параметры.ЗаполнитьИзДокументаЧекККМ.Касса;
		Объект.Организация = Параметры.ЗаполнитьИзДокументаЧекККМ.Организация;
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_ЧекККМ"));
		ДокументОбъект.УстановитьВремя(РежимАвтоВремя.Последним);
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КодКассы = ЗначениеРеквизитаНаСервере(Объект.Касса, "КодКассы"); 
		Объект.КодПачки = ""+Объект.КодКассы+""+Формат(День(Объект.Дата),"ЧЦ=2; ЧВН=")+""+Формат(Месяц(Объект.Дата),"ЧЦ=2; ЧВН=");
		Объект.Организация = ЗначениеРеквизитаНаСервере(Объект.Касса, "Владелец");
	КонецЕсли;
	
	ОбновитьОкноИнформации();
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИспользуютсяСканерыШтрихкода И НЕ ТолькоПросмотр Тогда
		// Попробуем подключить сканер штрихкода
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьСканерШКЗавершение", ЭтотОбъект); 
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, "СканерШтрихкода");
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодНачислений = ПериодНачислений(Объект.Дата);
	КонецЕсли;
	ПериодНач = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодНачислений);
	
	мКэшЗначений.мТекущаяДатаДокумента = Объект.Дата;
	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		ПолучитьНачисленияПени();
	КонецЕсли; 
	
	мКэшЗначений.НуженПерерасчет = ?(Параметры.Ключ.Пустая(), Истина, Ложь);
	
	УправлениеЭлементамиФормы();
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьСканерШКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	СканерШтрихкодаПодключен = РезультатВыполнения.Результат;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СканерШтрихкодаПодключен И ЗавершениеРаботы Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	Если СканерШтрихкодаПодключен И НЕ ЗавершениеРаботы Тогда
		ТипыПО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода");
		ОповещенияПриОтключении = Новый ОписаниеОповещения("ОтключитьСканерШКЗавершение", ЭтотОбъект); 
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(ОповещенияПриОтключении, УникальныйИдентификатор, ТипыПО);
	КонецЕсли;
	//Конец  ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканерШКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При отключении оборудования произошла ошибка: ""%1"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		СканерШтрихкодаПодключен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "Штрихкод" Тогда
		
		Попытка
			
			Массив = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(,,МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
			
			Для Каждого Стр из Массив Цикл
				Если Стр.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СканерШтрихкода") Тогда
					
					Результат = бит_ОбработатьСобытиеСШК(Объект, Данные);
					
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СуммаОплаты) 
		И ЗначениеЗаполнено(Объект.ШаблонИзвещений) 
		И ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		РасчетУслуг();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг") Тогда
		ВыборЧекаККМВозврата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПроверитьНомерДокументаНаСервере();
	
	мКэшЗначений.мТекущаяДатаДокумента = Объект.Дата; // Запомним текущую дату документа для контроля номера документа.
	
	Объект.КодПачки = "" + Объект.КодКассы + "" + Формат(День(Объект.Дата),"ЧЦ=2; ЧВН=") + "" + Формат(Месяц(Объект.Дата),"ЧЦ=2; ЧВН=");
	
КонецПроцедуры

&НаКлиенте
Процедура ВводВручнуюПриИзменении(Элемент)
	
	мКэшЗначений.НуженПерерасчет = Истина;
	
	ВводВручнуюПриИзмененииСервер();
	
	Если ЗначениеЗаполнено(Объект.СуммаОплаты) Тогда
		ПриИзмененииЛицевогоСчет_Услуги();
	КонецЕсли; 
	
	УстановитьДосутпность();
	УстановитьВидимостьКолонкиПени();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	ОбработкаКассаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Касса = ПредопределенноеЗначение("Справочник.бит_КассыККМ.ПустаяСсылка");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		КассаОрганизации = НайтиКассуОрганизации(ВыбранноеЗначение); 
		Если Объект.Касса  <> КассаОрганизации Тогда
			Объект.Касса = КассаОрганизации;
		КонецЕсли;
	Иначе
		Объект.Касса = ПредопределенноеЗначение("Справочник.бит_КассыККМ.ПустаяСсылка");
	КонецЕсли;
	ОбработкаКассаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИзвещенийПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Продажа")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат") Тогда
		ПриИзмененииЛицевогоСчет_Услуги();
	Иначе
		ПриИзмененииЛицевогоСчет_БиллинговыеУслуги();
	КонецЕсли; 
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИзвещенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Объект.ШаблонИзвещений Тогда
		мКэшЗначений.НуженПерерасчет = Ложь;
	Иначе
		мКэшЗначений.НуженПерерасчет = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ЗаполнениеСправочнойИнформации(Объект.ЛицевойСчет);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Продажа")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат") Тогда
		ПриИзмененииЛицевогоСчет_Услуги();
	Иначе
		ПриИзмененииЛицевогоСчет_БиллинговыеУслуги();
	КонецЕсли; 
	
	УстановитьВидимость();
	Объект.Счетчики.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Объект.ЛицевойСчет Тогда
		мКэшЗначений.НуженПерерасчет = Ложь;
	Иначе
		мКэшЗначений.НуженПерерасчет = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплатыПриИзменении(Элемент)
	
	мКэшЗначений.НуженПерерасчет = Истина;
	Объект.Итого = Объект.СуммаОплаты; 
	
	Если Объект.ВводВручную Тогда
		
		ОбновитьОкноИнформации();
		
	Иначе	
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Продажа")
			ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат") Тогда
			ПриИзмененииЛицевогоСчет_Услуги();
		Иначе	
			ПриИзмененииЛицевогоСчет_БиллинговыеУслуги();
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИтогоПриИзменении(Элемент)
	
	Объект.Сдача = ?(Объект.Итого > Объект.СуммаОплаты, Объект.Итого - Объект.СуммаОплаты, 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиСуммаПениПриИзменении(Элемент)
	
	ТекСтрокаУС = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекСтрокаУС <> Неопределено И мТаблицаНачисленийПени <> Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет" ,Объект.ЛицевойСчет);
		Отбор.Вставить("Услуга"      ,ТекСтрокаУС.Услуга);
		
		СтрокаПени = мТаблицаНачисленийПени.НайтиСтроки(Отбор);
		
		Если СтрокаПени.Количество() = 1 Тогда
			
			СальдоПени = СтрокаПени[0].СуммаПени;
			СуммаПени  = Число(Элемент.ТекстРедактирования);
			
			Если СуммаПени > СальдоПени Тогда
				
				ТекстСообщения = НСтр("ru='Сумма оплаты пени : %1 не может превышать сальдо пени: %2'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СуммаПени, СальдоПени);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				ТекСтрокаУС.СуммаПени = СальдоПени;
				
			КонецЕсли; 
			
		Иначе
			
			ТекстСообщения = НСтр("ru='Начислений ""Пени"" по услуге: %1 не было произведено!'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекСтрокаУС.Услуга);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ТекСтрокаУС.СуммаПени = 0;
			
		КонецЕсли; 
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Начислений ""Пени"" по услуге: %1 не было произведено!'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекСтрокаУС.Услуга);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ТекСтрокаУС.СуммаПени = 0;
		
	КонецЕсли; 
	
	Если мТаблицаДолга.Количество() > 0  Тогда
		МассивДолгаПоУсл = мТаблицаДолга.НайтиСтроки(Новый Структура("Услуга" ,ТекСтрокаУС.Услуга));
		Если МассивДолгаПоУсл.Количество() > 0 Тогда
			ТекСтрокаУС.Долг      = МассивДолгаПоУсл[0].Долг - ТекСтрокаУС.СуммаПени - ТекСтрокаУС.Сумма;
			МассивДолгаПоУсл[0].СуммаПени = ТекСтрокаУС.СуммаПени;
		КонецЕсли; 	
	КонецЕсли;

	ОбновитьОкноИнформации();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	ТекСтрокаУС = Элементы.Услуги.ТекущиеДанные;
	
	Если мТаблицаДолга.Количество() > 0  Тогда
		МассивДолгаПоУсл = мТаблицаДолга.НайтиСтроки(Новый Структура("Услуга" ,ТекСтрокаУС.Услуга));
		Если МассивДолгаПоУсл.Количество() > 0 Тогда
			ТекСтрокаУС.Долг      = МассивДолгаПоУсл[0].Долг - ТекСтрокаУС.СуммаПени - ТекСтрокаУС.Сумма;
			МассивДолгаПоУсл[0].Сумма = ТекСтрокаУС.Сумма;
		КонецЕсли; 	
	КонецЕсли;
	
	ОбновитьОкноИнформации();

	ПриИзмененииСумма("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	ПриИзмененииСтавкаНДС("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаНДСПриИзменении(Элемент)
	
	ПриИзмененииСуммаНДС("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСумма(ИмяТабЧасти)

	СтрокаТаблицы = Элементы[ИмяТабЧасти].ТекущиеДанные;
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Объект.ДокументБезНДС Тогда
		СтрокаТаблицы.СтавкаНДС	= ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТаблицы, Объект.СуммаВключаетНДС);
	//СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммаНДС(ИмяТабЧасти)

	СтрокаТаблицы = Элементы[ИмяТабЧасти].ТекущиеДанные;
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	//СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкаНДС(ИмяТабЧасти)

	СтрокаТаблицы = Элементы[ИмяТабЧасти].ТекущиеДанные;
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	Если Объект.ДокументБезНДС Тогда
		СтрокаТаблицы.СтавкаНДС	= ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		
		ТекстСообщения = НСтр("ru = 'В параметрах настройки ЖКХ установлена настройка ""Вариант расчета НДС"": Документ без НДС!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТаблицы, Объект.СуммаВключаетНДС);
	//СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСчетчики

&НаКлиенте
Процедура СчетчикиТекущиеПоказанияПриИзменении(Элемент)
	
	ТекСчетчик = Элементы.Счетчики.ТекущиеДанные.Счетчик;
	
	Многотарифный = МноготарифныйНаСервере(ТекСчетчик);
	
	Для Каждого СтрокаТЧ из Объект.Счетчики Цикл
		
		Если СтрокаТЧ.Счетчик = ТекСчетчик и НЕ Многотарифный Тогда
			ЧислоСтрока	= Элемент.ТекстРедактирования;
			МоеЧисло	= Число(ЧислоСтрока);			
			
			ЭлементЗначение = МоеЧисло;
			
			Если СтрокаТЧ.ТекущиеПоказания < СтрокаТЧ.ПредыдущиеПоказания
				И ЗначениеЗаполнено(СтрокаТЧ.ТекущиеПоказания) Тогда
				
				Разность = СтрокаТЧ.Разрядность - СтрокаТЧ.ПредыдущиеПоказания + 1 + СтрокаТЧ.ТекущиеПоказания;
				
				ТекстВопроса = НСтр("ru='Произойдет переход через 0 на разность: %1. Ввести?'");
				ТекстВопроса = СтрШаблон(ТекстВопроса, Разность);
				ОписаниеОповещения = Новый ОписаниеОповещения("СчетчикиТекущиеПоказанияПриИзмененииЗавершение", ЭтотОбъект
																, Новый Структура("СтрокаТЧ, ЭлементЗначение", СтрокаТЧ, ЭлементЗначение));
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				СтрокаТЧ.ТекущиеПоказания = ЭлементЗначение;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетчикиТекущиеПоказанияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	СтрокаТЧ = ДополнительныеПараметры.СтрокаТЧ;
	ЭлементЗначение = ДополнительныеПараметры.ЭлементЗначение;
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		СтрокаТЧ.ТекущиеПоказания = 0;
	Иначе
		СтрокаТЧ.ТекущиеПоказания = ЭлементЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьТЧ(Команда)
	
	Результат = Печать();
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"АЛП_стар"
	,"Ф2:Адресный листок прибытия"
	,АдресТабличногоДокументаВоВременномХранилище
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Счетчики.Количество() >0 Тогда
		ТекстВопроса = НСтр("ru='Табличная часть ""Счетчики"" будет очищена. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнениеТаблицыСчетчиков();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнениеТаблицыСчетчиков();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаБезСдачи(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СуммаОплаты", Объект.СуммаОплаты);
	ВведенноеЗначение = Неопределено;
	ОткрытьФорму("Документ.бит_ЧекККМ.Форма.ФормаСдачиУправляемая", Новый Структура("ОткрытьИзКнопкиОплатаБезСдачи", ПараметрыФормы), ЭтаФорма,,,, Новый ОписаниеОповещения("ОплатаБезСдачиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаБезСдачиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Объект.Итого = Результат.Итого;
		Объект.Сдача = Результат.Сдача;
		
	КонецЕсли;
	
	Если Объект.Итого >= 15000 Тогда
		
		Элементы.Плательщик.ПропускатьПриВводе        = Ложь;		
		ТекущийЭлемент                                = Элементы.Плательщик;
		Элементы.Плательщик.АвтоОтметкаНезаполненного = Истина;
		
		#Если Клиент Тогда
			
			ПоказатьПредупреждение(, "Платеж 15 тыс.руб. или более, укажите плательщика!", 30);
			
		#КонецЕсли
		
	ИначеЕсли Объект.СуммаОплаты > Объект.Итого Тогда
		
		ТекущийЭлемент = Элементы.ОплатаБезСдачи;
		
	Иначе
		
		ТекущийЭлемент = Элементы.СчетчикиЗаполнить;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказания(Команда)
	
	Если Объект.Счетчики.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'В таблице нет счетчиков для ввода показаний.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВводПоказанийПоСчетчикам();
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйЧек(Команда)
	
	Попытка
		ЗаписатьНаСервере(РежимЗаписиДокумента.Проведение);	
		Закрыть();
		Оповестить("НовыйЧекПроведен");
		СоздатьНовыйДокумент();
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПречекЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ОсновныеДействияФормыКассовыйОттиск();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьИН(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		ПериодНачислений = ПериодНачислений(Объект.Дата);
		
		ФормаОбработка = ОткрытьФорму("Обработка.бит_ПечатьСчетИзвещений.Форма.ФормаУправляемая");	
		Обработка =	ФормаОбработка.Объект;
		
		Обработка.СписокЛС.Очистить();
		НовыйЛС = Обработка.СписокЛС.Добавить();
		НовыйЛС.ЛицевойСчет = Объект.ЛицевойСчет; 
		
		Обработка.ШаблонИзвещений     = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам");
		Обработка.Организация         = Объект.Организация;
		Обработка.ДатаПечатиКвитанций = ТекущаяДата();
		Обработка.Период              = ПериодНачислений;
	
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Обработка.РС = ЗначениеРеквизитаНаСервере(Объект.Организация, "ОсновнойБанковскийСчет");
			Если НЕ ЗначениеЗаполнено(Обработка.РС) Тогда
				Обработка.РС = РСНаСервере(Объект.Организация);
			КонецЕсли; 
		КонецЕсли;
		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТН(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",Объект.ЛицевойСчет);
		Форма = ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаЭлементаУправляемая",ПараметрыФормы, ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСтруктурыВХранилище"           , Форма.АдресСтруктурыВХранилище);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаПечатиТекущихНачислений", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЛС(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЛицевойСчет", Объект.ЛицевойСчет);
		
		Форма = ОткрытьФорму("Отчет.бит_ОтчетОДвиженияхНаЛСПомесячно.Форма.ФормаОтчета", ПараметрыФормы);
		Форма.Отчет.НачалоПериода  = НачалоГода(ТекущаяДата());
		Форма.Отчет.КонецПериода   = КонецМесяца(ТекущаяДата());
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Чек(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.НомерЧекаККМ <> 0 ИЛИ Объект.ЧекПробитНаККМ Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном устройстве!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	Если Объект.СуммаОплаты >= 15000
		И НЕ ЗначениеЗаполнено(Объект.Плательщик) Тогда
		
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Плательщик'"));
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Сумма оплаты больше 15 тыс. руб. %1'"), ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Плательщик", "Объект", Отказ);
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Продажа") И Объект.Итого = 0 тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Получено'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Итого", "Объект", Отказ);
	КонецЕсли;		
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстВопроса = НСтр("ru='Будет напечатан фискальный чек. Продолжить?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЧекЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		МассивПустойНдс = Объект.Услуги.НайтиСтроки(Новый Структура("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка")));
		Если МассивПустойНдс.Количество() > 0 Тогда
			ОчиститьСообщения();
			ТекстСообщения = НСтр("ru = 'Ошибка при записи чека.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Для Каждого Элт Из МассивПустойНдс Цикл
				ТекстСообщения = НСтр("ru='Для услуги ""%1"" отсутствует ставка НДС!'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Элт.Услуга));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЦикла;
			Возврат;
		КонецЕсли;
		
		Попытка
			ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
			Записать(ПараметрыЗаписи);
			//ЗаписатьНаСервере(РежимЗаписиДокумента.Проведение);
			ОсновныеДействияФормыКассовыйОттиск();
		Исключение
			ТекстСообщения = НСтр("ru = 'Ошибка при записи: ""%1""'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОписаниеОшибки()); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
	КонецЕсли;

	
	// Активировать кнопку "ручного" режима печати чека ККМ.
	Если Объект.ЧекПробитНаККМ Тогда
		Элементы.Чек.Доступность= Ложь;
		ЭтаФорма.ТолькоПросмотр	= Истина;
	Иначе
		ЭтаФорма.ТолькоПросмотр	= Ложь;
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьЧека

// Процедура - обработчик событя "Нажатие" кнопки "КассовыйОттиск" командной панели "ОсновныеДействия".
//
// Параметры
//   Нет.
//
&НаКлиенте
Процедура ОсновныеДействияФормыКассовыйОттиск()
	
	ТаблицаУслуг = ?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Продажа")
					ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат")
					, Объект.Услуги, Объект.БиллинговыеУслуги);
					
	Если Объект.ВводВручную Тогда
	
		КонтрольнаяСумма = Объект.СуммаОплаты;
		
		ИтогСумма	= ТаблицаУслуг.Итог("Сумма");
		ИтогПени	= ТаблицаУслуг.Итог("СуммаПени");
		Остаток		= КонтрольнаяСумма - ИтогСумма - ИтогПени;
		
		Если Остаток <> 0 Тогда
			ТекстСообщения = НСтр("ru = 'Распределите всю сумму оплаты по услугам.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Возврат;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если мКэшЗначений.мПечатьПДС <> 0 Тогда
		
		СписокУслуг = Новый СписокЗначений;
		Для каждого строка из ТаблицаУслуг Цикл
			СписокУслуг.Добавить(строка.Услуга,строка.Услуга);
		КонецЦикла;	
		
		ДополнитьТаблицуПолучателямиДС(СписокУслуг);
		
	КонецЕсли;
	
	НапечататьЧек();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьПечатиЧека(Форма)
	ПечататьЧек = Истина;
	
	// Если объект не проведен или модифицирован - сообщим пользователю, что печать не возможна.
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.")
		И (НЕ Форма.Объект.Проведен
		ИЛИ Форма.Модифицированность) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( , НСтр("ru = 'Операция возможна только после проведения документа'"));
		ПечататьЧек = Ложь;
		
	КонецЕсли;
	
	Возврат ПечататьЧек;
КонецФункции 

&НаКлиенте
Процедура НапечататьЧек()
	
	ОчиститьСообщения();
	
	Если ПроверитьВозможностьПечатиЧека(ЭтотОбъект) Тогда
		
		Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение", ЭтотОбъект);
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
			МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru = 'Выберите фискальное устройство'"), НСтр("ru = 'Фискальное устройство не подключено.'"),,,,Объект.Касса);
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
	ОповеститьОбИзменении(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ВыборФискальногоУстройстваЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	ОписаниеОшибки = "";
	
	Если ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		
		МассивОборудования = Новый Массив;
		МассивОборудования.Добавить(ИдентификаторУстройства);
		
		// БИТ_ЖКХ 13.07.2017 14:58:18 Начало правки... Шаблон параметров для заполнения. 
		ПараметрыОплаты = Новый Структура;
		ПараметрыОплаты.Вставить("АдресТаблицыОплаты"	, Неопределено);
		ПараметрыОплаты.Вставить("ОплатаКарта"			, 0);
		ПараметрыОплаты.Вставить("ОплатаНаличные"		, Объект.Итого);
		ПараметрыОплаты.Вставить("ПечататьТоварныйЧек"	, Ложь);
		ПараметрыОплаты.Вставить("ПокупательEmail"		, СокрЛП(EmailДляИнформирования));
		ПараметрыОплаты.Вставить("ПокупательНомер"		, СокрЛП(ТелефонДляИнформирования));
		ПараметрыОплаты.Вставить("СписокОборудования"	, МассивОборудования);
		
		Параметры = Новый Структура;
		Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		Параметры.Вставить("ОплатаКарта"			, 0);
		Параметры.Вставить("ПараметрыОплаты"		, ПараметрыОплаты);
		Параметры.Вставить("ПечататьТоварныйЧек"	, Ложь);
		// БИТ_ЖКХ 13.07.2017 14:58:21 Конец правки. 
		
		ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства);
		ТипУстройства = ?(ДанныеУстройства.Свойство("ТипОборудованияИмя"), ДанныеУстройства.ТипОборудованияИмя, "ККТ");
		
		Параметры.Вставить("ТипУстройства"	, ТипУстройства);		

		Если ТипУстройства = "ККТ" Тогда
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПолучитьПараметрыЗавершение", ЭтотОбъект, Параметры);
			МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, Ложь);
		Иначе
			ПолучитьПараметрыЗавершение(Неопределено, Параметры);
		КонецЕсли;
		
		//ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(ИдентификаторУстройства);//
		//НомерСекции         = ?(ПараметрыУстройства.Свойство("НомерСекции"), ПараметрыУстройства.НомерСекции, 0);//
		//
		//ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства);
		//ТипУстройства = ?(ДанныеУстройства.Свойство("ТипОборудованияИмя"), ДанныеУстройства.ТипОборудованияИмя, "ККТ");
		//
		//Контекст = Новый Структура();
		//Контекст.Вставить("НомерСекции", НомерСекции);
		//Контекст.Вставить("ДоговорПА", Параметры.ДоговорПА);
		//Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		//
		//Если ТипУстройства = "ККТ" Тогда
		//	Оповещение = Новый ОписаниеОповещения("РеквизитыОтправкиЧекаЗавершение", ЭтотОбъект, Контекст);
		//	ОткрытьФорму("ОбщаяФорма.РеквизитыОтправкиЧека", , ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//Иначе
		//	РеквизитыОтправкиЧека = Новый Структура("Телефон, АдресЭП", "", ""); //Номер и электронная почта покупателя.
		//	РеквизитыОтправкиЧекаЗавершение(РеквизитыОтправкиЧека, Контекст);
		//КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось получить идентификатор устройства.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыЗавершение(ПараметрыФискальногоУстройства, ДополнительныеПараметры) Экспорт
	Перем АдресУстановкиККТ, ОписаниеОшибки;
	
	Если ПараметрыФискальногоУстройства =  Неопределено Тогда
		// Принтер чеков эмулирует все атрибуды ФФД 1.1
		ВерсияФормата = ?(ДополнительныеПараметры.ТипУстройства = "ПринтерЧеков", "1.1.0.0", "1.0.0.0");
	ИначеЕсли НЕ ПараметрыФискальногоУстройства.Результат Тогда 
		ОписаниеОшибки = ПараметрыФискальногоУстройства.ОписаниеОшибки;
	Иначе
		ВерсияФормата = ПечатьФискальныхДокументовКлиент.ПолучитьВерсиюФФД(ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДФН, ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДККТ);
		ПараметрыФискальногоУстройства.ВыходныеПараметры.Свойство("АдресУстановкиККТ", АдресУстановкиККТ);
	КонецЕсли; 
	
	// Если не удалось подключить ККТ, то формировать чеки смысла нет
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПараметрыОплаты = ДополнительныеПараметры.ПараметрыОплаты;
		//Если ПараметрыОплаты.АдресТаблицыОплаты = Неопределено Тогда
		//	ПараметрыПечатиЧека = ПараметрыПечатиЧекаНаличныеКарта(ПараметрыОплаты, ВерсияФормата, ОписаниеОшибки);
		//Иначе
		//	ПараметрыПечатиЧека = ПараметрыПечатиЧекаСложнаяОплата(ПараметрыОплаты, ВерсияФормата, ОписаниеОшибки);
		//КонецЕсли;
		ПараметрыПечатиЧека = ПараметрыПечатиЧекаНаличныеКарта(ПараметрыОплаты, ВерсияФормата, АдресУстановкиККТ, ОписаниеОшибки);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) ИЛИ ПараметрыПечатиЧека = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
			|Чек не напечатан на фискальном устройстве.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ИдентификаторУстройства <> Неопределено И ДополнительныеПараметры.ТипУстройства = "ККТ" Тогда
		ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ПараметрыПечатиЧека, ДополнительныеПараметры.ИдентификаторУстройства);
	КонецЕсли;
	
	ЭтаФорма.Доступность = Ложь; // Блокируем интерфейс пользователя.
	
	Если ДополнительныеПараметры.Свойство("ИдентификаторУстройстваЭТ") Тогда
		ДополнительныеПараметры.Вставить("ИдентификаторУстройства", ДополнительныеПараметры.ИдентификаторУстройства);
		ДополнительныеПараметры.Вставить("ПараметрыПечатиЧека", ПараметрыПечатиЧека);
		
		ОповещениеПриЗавершенииОперации = Новый ОписаниеОповещения("ОперацияПоПлатежнойКартеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыОперации = МенеджерОборудованияКлиент.ПараметрыВыполненияЭквайринговойОперации();
		ПараметрыОперации.ТипТранзакции  = "AuthorizeSales";
		ПараметрыОперации.СуммаОперации  = ДополнительныеПараметры.ОплатаКарта;
		ПараметрыОперации.НомерЧека      = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер, Истина, Истина);
		
		МенеджерОборудованияКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОповещениеПриЗавершенииОперации, УникальныйИдентификатор, 
			ДополнительныеПараметры.ИдентификаторУстройстваЭТ, ДополнительныеПараметры.ИдентификаторУстройства, ПараметрыОперации);
	Иначе
		Если ДополнительныеПараметры.ИдентификаторУстройства <> Неопределено Тогда 
			ОповещениеПриЗавершенииПечатиЧека = Новый ОписаниеОповещения("ПечатьЧекаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			//20.09.2019
			ПараметрыПечатиЧека.Организация = Объект.Организация;
			МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(
				ОповещениеПриЗавершенииПечатиЧека, 
				УникальныйИдентификатор, 
				ПараметрыПечатиЧека, 
				ДополнительныеПараметры.ИдентификаторУстройства,
				,
				,
				);
				
		Иначе
			ПечатьЧекаЗавершение(Новый Структура("Результат", Истина), ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПечатьЧекаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Перем ВыходныеПараметры, ИдентификаторУстройства;
	
	ЭтаФорма.Доступность = Истина; // Разблокировка интерфейса пользователя.
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
	Иначе
		// Получить номер чека, если номер чека не задан - записываем текущий номер документа
		Объект.НомерЧекаККМ            = ?(РезультатВыполнения.Свойство("ВыходныеПараметры", ВыходныеПараметры), 
			ВыходныеПараметры[1], 
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер, Истина, Истина));
			
		Объект.ЧекПробитНаККМ = Истина;
		Объект.ИдентификаторУстройства = ?(РезультатВыполнения.Свойство("ИдентификаторУстройства", ИдентификаторУстройства), ИдентификаторУстройства, Неопределено);
		
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
		Записать(ПараметрыЗаписи);
		
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		ПоказатьОповещениеПользователя(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПечатиЧекаНаличныеКарта(ПараметрыОплаты, ВерсияФормата, АдресУстановкиККТ, ОписаниеОшибки)
	
	Возврат ПараметрыПечатиЧека(ПараметрыОплаты, ВерсияФормата, АдресУстановкиККТ, ОписаниеОшибки);
	
КонецФункции

&НаСервере
Функция ПараметрыПечатиЧека(ПараметрыОплаты, ВерсияФормата, АдресУстановкиККТ, ОписаниеОшибки)
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата);
	
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	ЭтоВерсия110 = НЕ ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.1.0.0", ВерсияФормата) > 0;
	ЭтоВерсия105 = НЕ ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.5.0", ВерсияФормата) > 0;
	
	ОбщиеПараметры.ТипРасчета = ?(
		Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Продажа, 
		Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств, 
		Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств);
		
	ДанныеКассира = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛицаТекущегоПользователя(Объект.Организация, Объект.Дата);
	
	ОбщиеПараметры.Кассир    = ?(ДанныеКассира.Представление = Неопределено, Неопределено, СокрЛП(СтрШаблон("%1 %2", Строка(ДанныеКассира.Должность), ДанныеКассира.Представление)));
	ОбщиеПараметры.КассирИНН = ДанныеКассира.ИНН;
	
	ОбщиеПараметры.Электронно = Ложь;
	
	ОбщиеПараметры.НомерКассы     = "00001";
	ОбщиеПараметры.НомерЧека      = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер, Истина, Истина);
	ОбщиеПараметры.НомерСмены     = 1;
	
	ОбщиеПараметры.ОрганизацияНазвание = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
	ОбщиеПараметры.ОрганизацияИНН      = СведенияОбОрганизации.ИНН;
	ОбщиеПараметры.ОрганизацияКПП      = СведенияОбОрганизации.КПП;
	ОбщиеПараметры.АдресМагазина       = ?(ЗначениеЗаполнено(АдресУстановкиККТ), АдресУстановкиККТ, СведенияОбОрганизации.ФактическийАдрес);
	
	ОбщиеПараметры.ОтправительEMail    = СведенияОбОрганизации.Email;
	ОбщиеПараметры.ПокупательEmail     = ПараметрыОплаты.ПокупательEmail;
	ОбщиеПараметры.ПокупательНомер     = ПараметрыОплаты.ПокупательНомер;
	
	//ОбщиеПараметры.НаименованиеМагазина = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "Наименование");
	ОбщиеПараметры.НаименованиеМагазина = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
	
	ОбщиеПараметры.СистемаНалогообложения = СистемаНалогообложения();
	
	// Подготовка таблицы
	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ВерсияФормата);
	
	ТаблицаДокумента    = ПараметрыПечатиЧека.ТаблицаДокумента;
	
	СписокДоговоровПлатежногоАгента = ПараметрыПечатиЧека.ТаблицаДоговораПлатежногоАгента.ВыгрузитьКолонку("ДоговорКонтрагента");
	
	//Если НЕ ЭтоВерсия110 
	//	И (СписокДоговоровПлатежногоАгента.Количество() > 1 
	//		ИЛИ (СписокДоговоровПлатежногоАгента.Количество() = 1 
	//			И (Объект.Товары.Количество() > 0 
	//			ИЛИ ПараметрыПечатиЧека.ТаблицаКомитенты.Итог("КоличествоДоговоров") > 1))) Тогда
	//	ТекстСообщения = НСтр("ru = 'Для версии формата фискальных данных %1 возможен лишь один договор платежного агента в чеке'");
	//	ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВерсияФормата);
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//Если СписокДоговоровПлатежногоАгента.Количество() = 1 
	//	И ПараметрыПечатиЧека.ТаблицаКомитенты.Итог("КоличествоДоговоров") = 1 Тогда
	//	СтруктураРеквизитов = УчетДенежныхСредствБП.РеквизитыПлатежногоАгента(СписокДоговоровПлатежногоАгента[0]);
	//	ЗаполнитьЗначенияСвойств(ОбщиеПараметры, СтруктураРеквизитов);
	//ИначеЕсли ЭтоВерсия105 Тогда
	//	СписокКомитентовУслуги = ПараметрыПечатиЧека.ТаблицаКомитенты.ВыгрузитьКолонку("Контрагент");
	//	
	//	Если НЕ ЭтоВерсия110 
	//		И (СписокКомитентовУслуги.Количество() > 1 
	//			ИЛИ (СписокКомитентовУслуги.Количество() = 1 И Объект.Товары.Количество() > 0 )) Тогда
	//		ТекстСообщения = НСтр("ru = 'Для версии формата фискальных данных %1 возможен лишь один принципал в чеке'");
	//		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВерсияФормата);
	//		Возврат Неопределено;
	//	КонецЕсли;
	//	
	//	Если НЕ ЭтоВерсия110 И СписокКомитентовУслуги.Количество() = 1 Тогда 
	//		// Версия фискальных данных < 1.1 и только один комитент на услуги
	//		ОбщиеПараметры.ПризнакАгента = Перечисления.ПризнакиАгента.Агент;
	//		КомитентПоЧеку = СписокКомитентовУслуги[0];
	//		
	//		ЗаполнитьЗначенияСвойств(ОбщиеПараметры.ДанныеПоставщика, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КомитентПоЧеку, "Наименование, ИНН"));
	//		ОбщиеПараметры.ДанныеПоставщика.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КомитентПоЧеку, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
	//	Иначе
	//		ПараметрыОбъекта = Новый Структура("Организация, Дата");
	//	
	//		ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	//		
	//		МассивТоваровНаКомиссии = Новый Массив;
	//		
	//		СписокНоменклатуры = ТаблицаДокумента.ВыгрузитьКолонку("Номенклатура");
	//		СведенияОСпискеНоменклатуры = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(СписокНоменклатуры, ПараметрыОбъекта, Истина, Ложь);
	//		Для каждого СведенияОНоменклатуре Из СведенияОСпискеНоменклатуры Цикл
	//			Если СведенияОНоменклатуре.Значение.Комиссионный Тогда
	//				МассивТоваровНаКомиссии.Добавить(СведенияОНоменклатуре.Ключ);
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		СведенияОКомитентах = УчетДенежныхСредствБП.ПолучитьСведенияОКомитентах(МассивТоваровНаКомиссии, ПараметрыОбъекта.Организация, ПараметрыОбъекта.Дата);
	//		
	//		КомитентПоЧеку = УчетДенежныхСредствБП.КомитентПоЧеку(СведенияОКомитентах, МассивТоваровНаКомиссии);
	//		
	//		Если КомитентПоЧеку <> Неопределено Тогда
	//			ОбщиеПараметры.ПризнакАгента = Перечисления.ПризнакиАгента.Комиссионер;
	//			
	//			ЗаполнитьЗначенияСвойств(ОбщиеПараметры.ДанныеПоставщика, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КомитентПоЧеку, "Наименование, ИНН"));
	//			ОбщиеПараметры.ДанныеПоставщика.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КомитентПоЧеку, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Для каждого СтрокаТовары Из ТаблицаДокумента Цикл
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		
		ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, СтрокаТовары);
		
		СтрокаПозицииЧека.ЦенаСоСкидками = СтрокаПозицииЧека.Цена;
		
		//27.12.2018
		если СтрокаПозицииЧека.СтавкаНДС = 0 тогда
		  СтрокаПозицииЧека.СтавкаНДС = неопределено;	
		конецесли;	

		//11.01.2019
		если СтрокаТовары.Номенклатура.Наименование <> "" тогда
		 СтрокаПозицииЧека.Наименование = СтрокаТовары.Номенклатура.Наименование;	
	    иначе 
			если СтрокаТовары.Номенклатура.НаименованиеПолное <> "" тогда
				СтрокаПозицииЧека.Наименование = СтрокаТовары.Номенклатура.НаименованиеПолное;
			иначе	
				если СтрокаТовары.Номенклатура.НаименованиеПолное	<> "" тогда
				   СтрокаПозицииЧека.Наименование = СтрокаТовары.Номенклатура.НаименованиеПолное;
			    иначе
				  если СтрокаТовары.Номенклатура.Наименование	<> "" тогда
				   СтрокаПозицииЧека.Наименование = СтрокаТовары.Номенклатура.Наименование;
			      конецесли;	
			    конецесли;
			конецесли;	
		конецесли;
		//-----
		//КОГДА НЕ (РеализацияТовары.Содержание ПОДОБНО "") ТОГДА
		//	РеализацияТовары.Содержание
		//КОГДА НЕ (РеализацияТовары.Номенклатура.НаименованиеПолное ПОДОБНО "") ТОГДА
		//	РеализацияТовары.Номенклатура.НаименованиеПолное
		//ИНАЧЕ
		//	РеализацияТовары.Номенклатура.Наименование
		//КОНЕЦ,
		
		
		//Если ЭтоВерсия110  И ОбщиеПараметры.ПризнакАгента = Неопределено ТОгда
		//	Если ЗначениеЗаполнено(СтрокаТовары.ДоговорКонтрагента) Тогда
		//		РеквизитыАгента = УчетДенежныхСредствБП.РеквизитыПлатежногоАгента(СтрокаТовары.ДоговорКонтрагента);
		//		ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, РеквизитыАгента);
		//	ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда 
		//		Комитент = СведенияОКомитентах[СтрокаТовары.Номенклатура];
		//		Если Комитент <> Неопределено Тогда
		//			ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека.ДанныеПоставщика, ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Комитент, "Наименование, ИНН"));
		//			СтрокаПозицииЧека.ДанныеПоставщика.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Комитент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
		//		КонецЕсли; 
		//	КонецЕсли;
		//КонецЕсли; 
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;
	
	ОплатыПоДокументу = ПараметрыПечатиЧека.ТаблицаОплат;
	
	Если ПараметрыОплаты.ОплатаНаличные > 0 Тогда
		СтрокаОплаты = ОплатыПоДокументу.Добавить();
		СтрокаОплаты.ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные;
		//СтрокаОплаты.ТипОплаты = 0;
		СтрокаОплаты.Сумма = ПараметрыОплаты.ОплатаНаличные;
	КонецЕсли;
	
	Для каждого СтрокаОплатыПоДокументу Из ОплатыПоДокументу Цикл
		СтрокаОплаты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаОплатыПоДокументу);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЦикла;
	
	
	Возврат ОбщиеПараметры;
	
КонецФункции

&НаСервере
Функция СистемаНалогообложения()
	
	ПрименяетсяОсобыйПорядокНалогообложения = 
		УчетнаяПолитика.ПрименяетсяОсобыйПорядокНалогообложения(Объект.Организация, Объект.Дата);
	
	НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	Если ПрименяетсяОсобыйПорядокНалогообложения Тогда
		НалоговыйРежим = ?(УчетнаяПолитика.ПлательщикЕНВД(Объект.Организация, Объект.Дата), Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД, Перечисления.ТипыСистемНалогообложенияККТ.Патент);
	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходы(Объект.Организация, Объект.Дата) Тогда
		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Объект.Организация, Объект.Дата) Тогда 
		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
	КонецЕсли;
	
	Возврат НалоговыйРежим;
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыПечатиЧека(ВерсияФормата)
	
	Запрос = Новый Запрос;
	
	ЭтоВерсия105 = НЕ ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.5.0", ВерсияФормата) > 0;
	
	//Запрос.УстановитьПараметр("ТаблицаТовары",      Объект.Товары.Выгрузить());
	//Запрос.УстановитьПараметр("ТаблицаУслуги",      Объект.АгентскиеУслуги.Выгрузить());
	//Запрос.УстановитьПараметр("ТаблицаСертификаты", Объект.ПодарочныеСертификаты.Выгрузить());
	//Запрос.УстановитьПараметр("ТаблицаОплата",      Объект.Оплата.Выгрузить());
	//Запрос.УстановитьПараметр("СуммаВключаетНДС",   Объект.СуммаВключаетНДС);
	//Запрос.УстановитьПараметр("ДокументБезНДС",     Объект.ДокументБезНДС);
	//Запрос.УстановитьПараметр("ЭтоВерсия105",       ЭтоВерсия105);
	
	////ТаблицаОплата = Новый ТаблицаЗначений;
	////ТаблицаОплата.Колонки.Добавить("СпособРасчета" , Новый ОписаниеТипов("ПеречислениеСсылка.ТипыОплатыККТ"));
	////ТаблицаОплата.Колонки.Добавить("СпособРасчета" , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Запрос.УстановитьПараметр("ТаблицаУслуги",      Объект.Услуги.Выгрузить());
	//Запрос.УстановитьПараметр("ТаблицаОплата",      ТаблицаОплата);
	Запрос.УстановитьПараметр("СуммаВключаетНДС",   Объект.СуммаВключаетНДС);
	Запрос.УстановитьПараметр("ДокументБезНДС",     Объект.ДокументБезНДС);
	Запрос.УстановитьПараметр("ЭтоВерсия105",       ЭтоВерсия105);
	
	НомераТаблиц = Новый Структура;
	
//  11.12.2019 58	
//	Запрос.Текст = ТекстЗапросаТаблицаТоваров(НомераТаблиц);
	Запрос.Текст = ТекстЗапросаТаблицаТоваровНДС2019(НомераТаблиц);

	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыПечатиЧека = Новый Структура;
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПечатиЧека.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПечатиЧека;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаТаблицаТоваров(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_АгентскиеУслуги",              НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ТаблицаЧека",                  НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ТаблицаЧекаПеня",              НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаДокумента",                НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаОплат",                    НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаКомитенты",                НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаДоговораПлатежногоАгента", НомераТаблиц.Количество());
	               
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Услуга КАК Номенклатура,
	|	"""" КАК Содержание,
	|	1 КАК Количество,
	|	ТаблицаУслуги.Сумма КАК Цена,
	|	ТаблицаУслуги.Сумма,
	|	ТаблицаУслуги.СуммаПени КАК ЦенаПени,
	|	ТаблицаУслуги.СуммаПени КАК СуммаПени,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_АгентскиеУслуги
	|ИЗ
	|	&ТаблицаУслуги КАК ТаблицаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуги.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаУслуги.Номенклатура КАК Справочник.бит_УслугиЖКХ).НаименованиеПолное КАК Содержание,
	|	ТаблицаУслуги.Количество,
	|	ТаблицаУслуги.Цена,
	|	ТаблицаУслуги.Сумма,
	|	ТаблицаУслуги.ЦенаПени,
	|	ТаблицаУслуги.СуммаПени,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.Услуга) КАК ПризнакПредметаРасчета,
	|	ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой) КАК ПризнакСпособаРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыКонтрагентов.ПлатежныйАгент, ЛОЖЬ)
	|			ТОГДА ТаблицаУслуги.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ТаблицаЧека
	|ИЗ
	|	ВТ_АгентскиеУслуги КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ТаблицаУслуги.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Пеня"" КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.бит_УслугиЖКХ.Пеня) КАК Номенклатура,
	|	"""" КАК Артикул,
	|	"""" КАК Штрихкод,
	|	ТаблицаЧека.Количество КАК Количество,
	|	ТаблицаЧека.ЦенаПени КАК ЦенаПени,
	|	ТаблицаЧека.СуммаПени КАК СуммаПени,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакСпособаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакСпособаРасчета,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакПредметаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакПредметаРасчета,
	|	1 КАК НомерСекции,
	|	ТаблицаЧека.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ТаблицаЧекаПеня
	|ИЗ
	|	ТаблицаЧека КАК ТаблицаЧека
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаЧека.Содержание КАК СТРОКА(1000)) КАК Наименование,
	|	ТаблицаЧека.Номенклатура КАК Номенклатура,
	|	"""" КАК Артикул,
	|	"""" КАК Штрихкод,
	|	ТаблицаЧека.Количество,
	|	ВЫБОР
	|		КОГДА &СуммаВключаетНДС
	|			ТОГДА ТаблицаЧека.Цена
	|		КОГДА ТаблицаЧека.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ((ТаблицаЧека.Сумма + ТаблицаЧека.СуммаНДС) / ТаблицаЧека.Количество КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ТаблицаЧека.Сумма + ТаблицаЧека.СуммаНДС
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА &СуммаВключаетНДС
	|			ТОГДА ТаблицаЧека.Сумма
	|		ИНАЧЕ ТаблицаЧека.Сумма + ТаблицаЧека.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|				И ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 120
	|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА &ЭтоВерсия105
	|				И ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 118
	|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18
	|		КОГДА &ЭтоВерсия105
	|				И ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 110
	|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаЧека.СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакСпособаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакСпособаРасчета,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакПредметаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакПредметаРасчета,
	|	1 КАК НомерСекции,
	|	ТаблицаЧека.ДоговорКонтрагента
	|ИЗ
	|	ТаблицаЧека КАК ТаблицаЧека
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЧекаПеня.Наименование,
	|	ТаблицаЧекаПеня.Номенклатура,
	|	ТаблицаЧекаПеня.Артикул,
	|	ТаблицаЧекаПеня.Штрихкод,
	|	МАКСИМУМ(ТаблицаЧекаПеня.Количество),
	|	СУММА(ТаблицаЧекаПеня.ЦенаПени),
	|	СУММА(ТаблицаЧекаПеня.СуммаПени),
	|	ТаблицаЧекаПеня.СтавкаНДС,
	|	СУММА(ТаблицаЧекаПеня.СуммаНДС),
	|	ТаблицаЧекаПеня.ПризнакСпособаРасчета,
	|	ТаблицаЧекаПеня.ПризнакПредметаРасчета,
	|	ТаблицаЧекаПеня.НомерСекции,
	|	ТаблицаЧекаПеня.ДоговорКонтрагента
	|ИЗ
	|	ТаблицаЧекаПеня КАК ТаблицаЧекаПеня
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЧекаПеня.Наименование,
	|	ТаблицаЧекаПеня.Номенклатура,
	|	ТаблицаЧекаПеня.Артикул,
	|	ТаблицаЧекаПеня.Штрихкод,
	|	ТаблицаЧекаПеня.СтавкаНДС,
	|	ТаблицаЧекаПеня.ПризнакСпособаРасчета,
	|	ТаблицаЧекаПеня.ПризнакПредметаРасчета,
	|	ТаблицаЧекаПеня.НомерСекции,
	|	ТаблицаЧекаПеня.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.ПустаяСсылка) КАК ТипОплаты,
	|	0 КАК Сумма
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АгентскиеУслуги.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АгентскиеУслуги.ДоговорКонтрагента) КАК КоличествоДоговоров
	|ИЗ
	|	ВТ_АгентскиеУслуги КАК ВТ_АгентскиеУслуги
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АгентскиеУслуги.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
	|	АгентскиеУслуги.ДоговорКонтрагента
	|ИЗ
	|	ВТ_АгентскиеУслуги КАК АгентскиеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АгентскиеУслуги.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ПлатежныйАгент";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

&НаСервере
Функция ТекстЗапросаТаблицаТоваровНДС2019(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_АгентскиеУслуги",              НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ТаблицаЧека",                  НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ТаблицаЧекаПеня",              НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаДокумента",                НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаОплат",                    НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаКомитенты",                НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаДоговораПлатежногоАгента", НомераТаблиц.Количество());
	               
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Услуга КАК Номенклатура,
	|	"""" КАК Содержание,
	|	1 КАК Количество,
	|	ТаблицаУслуги.Сумма КАК Цена,
	|	ТаблицаУслуги.Сумма,
	|	ТаблицаУслуги.СуммаПени КАК ЦенаПени,
	|	ТаблицаУслуги.СуммаПени КАК СуммаПени,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_АгентскиеУслуги
	|ИЗ
	|	&ТаблицаУслуги КАК ТаблицаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуги.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаУслуги.Номенклатура КАК Справочник.бит_УслугиЖКХ).НаименованиеПолное КАК Содержание,
	|	ТаблицаУслуги.Количество,
	|	ТаблицаУслуги.Цена,
	|	ТаблицаУслуги.Сумма,
	|	ТаблицаУслуги.ЦенаПени,
	|	ТаблицаУслуги.СуммаПени,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.Услуга) КАК ПризнакПредметаРасчета,
	|	ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой) КАК ПризнакСпособаРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыКонтрагентов.ПлатежныйАгент, ЛОЖЬ)
	|			ТОГДА ТаблицаУслуги.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ТаблицаЧека
	|ИЗ
	|	ВТ_АгентскиеУслуги КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ТаблицаУслуги.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Пеня"" КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.бит_УслугиЖКХ.Пеня) КАК Номенклатура,
	|	"""" КАК Артикул,
	|	"""" КАК Штрихкод,
	|	ТаблицаЧека.Количество КАК Количество,
	|	ТаблицаЧека.ЦенаПени КАК ЦенаПени,
	|	ТаблицаЧека.СуммаПени КАК СуммаПени,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакСпособаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакСпособаРасчета,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакПредметаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакПредметаРасчета,
	|	1 КАК НомерСекции,
	|	ТаблицаЧека.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ТаблицаЧекаПеня
	|ИЗ
	|	ТаблицаЧека КАК ТаблицаЧека
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаЧека.Содержание КАК СТРОКА(1000)) КАК Наименование,
	|	ТаблицаЧека.Номенклатура КАК Номенклатура,
	|	"""" КАК Артикул,
	|	"""" КАК Штрихкод,
	|	ТаблицаЧека.Количество,
	|	ВЫБОР
	|		КОГДА &СуммаВключаетНДС
	|			ТОГДА ТаблицаЧека.Цена
	|		КОГДА ТаблицаЧека.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ((ТаблицаЧека.Сумма + ТаблицаЧека.СуммаНДС) / ТаблицаЧека.Количество КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ТаблицаЧека.Сумма + ТаблицаЧека.СуммаНДС
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА &СуммаВключаетНДС
	|			ТОГДА ТаблицаЧека.Сумма
	|		ИНАЧЕ ТаблицаЧека.Сумма + ТаблицаЧека.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|				И ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|			ТОГДА 120
	|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|				ИЛИ ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|			ТОГДА 20
	|		КОГДА &ЭтоВерсия105
	|				И ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА 118
	|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|				ИЛИ ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА 18
	//|		КОГДА &ЭтоВерсия105
	//|				И ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.НДС10_110)
	//|			ТОГДА 110
	//|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.НДС10)
	//|				ИЛИ ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.НДС10_110)
	//|			ТОГДА 10
	|		КОГДА ТаблицаЧека.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаЧека.СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакСпособаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакСпособаРасчета,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсия105
	|			ТОГДА ТаблицаЧека.ПризнакПредметаРасчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПризнакПредметаРасчета,
	|	1 КАК НомерСекции,
	|	ТаблицаЧека.ДоговорКонтрагента
	|ИЗ
	|	ТаблицаЧека КАК ТаблицаЧека
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЧекаПеня.Наименование,
	|	ТаблицаЧекаПеня.Номенклатура,
	|	ТаблицаЧекаПеня.Артикул,
	|	ТаблицаЧекаПеня.Штрихкод,
	|	МАКСИМУМ(ТаблицаЧекаПеня.Количество),
	|	СУММА(ТаблицаЧекаПеня.ЦенаПени),
	|	СУММА(ТаблицаЧекаПеня.СуммаПени),
	|	ТаблицаЧекаПеня.СтавкаНДС,
	|	СУММА(ТаблицаЧекаПеня.СуммаНДС),
	|	ТаблицаЧекаПеня.ПризнакСпособаРасчета,
	|	ТаблицаЧекаПеня.ПризнакПредметаРасчета,
	|	ТаблицаЧекаПеня.НомерСекции,
	|	ТаблицаЧекаПеня.ДоговорКонтрагента
	|ИЗ
	|	ТаблицаЧекаПеня КАК ТаблицаЧекаПеня
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЧекаПеня.Наименование,
	|	ТаблицаЧекаПеня.Номенклатура,
	|	ТаблицаЧекаПеня.Артикул,
	|	ТаблицаЧекаПеня.Штрихкод,
	|	ТаблицаЧекаПеня.СтавкаНДС,
	|	ТаблицаЧекаПеня.ПризнакСпособаРасчета,
	|	ТаблицаЧекаПеня.ПризнакПредметаРасчета,
	|	ТаблицаЧекаПеня.НомерСекции,
	|	ТаблицаЧекаПеня.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.ПустаяСсылка) КАК ТипОплаты,
	|	0 КАК Сумма
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АгентскиеУслуги.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АгентскиеУслуги.ДоговорКонтрагента) КАК КоличествоДоговоров
	|ИЗ
	|	ВТ_АгентскиеУслуги КАК ВТ_АгентскиеУслуги
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АгентскиеУслуги.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
	|	АгентскиеУслуги.ДоговорКонтрагента
	|ИЗ
	|	ВТ_АгентскиеУслуги КАК АгентскиеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АгентскиеУслуги.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ПлатежныйАгент";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции


//&НаКлиенте
//Процедура НапечататьОдинЧек(МассивЧеков, ИдентификаторУстройства, ВерсияФормата)
//	
//	ОбщиеПараметры    = МассивЧеков[0];
//	
//	Контекст = Новый Структура();
//	Контекст.Вставить("МассивЧеков", МассивЧеков);
//	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
//	Контекст.Вставить("ВерсияФормата", ВерсияФормата);
//	Контекст.Вставить("Форма", Форма);
//	
//	Оповещение = Новый ОписаниеОповещения("НапечататьОдинЧекЗавершение", ЭтотОбъект, Контекст);
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ПараметрыПечатиЧека",     МассивЧеков[0]);
//	ПараметрыФормы.Вставить("Организация",             Объект.Организация);
//	ПараметрыФормы.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
//	ПараметрыФормы.Вставить("ВерсияФормата",           ВерсияФормата);
//	
//	ОткрытьФорму("Обработка.ПечатьЧека.Форма", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры


////&НаКлиенте
////Процедура РеквизитыОтправкиЧекаЗавершение(РеквизитыОтправкиЧека, Параметры) Экспорт
////	
////	Если ТипЗнч(РеквизитыОтправкиЧека) = Тип("Структура") Тогда
////		// Готовим данные.
////		МассивЧеков = ПодготовитьДанныеДляПробитияЧека(Параметры.НомерСекции, Параметры.ДоговорПА, РеквизитыОтправкиЧека.Телефон, РеквизитыОтправкиЧека.АдресЭП);
////	Иначе
////		МассивЧеков = ПодготовитьДанныеДляПробитияЧека(Параметры.НомерСекции, Параметры.ДоговорПА);
////	КонецЕсли;
////	
////	Если МассивЧеков.Количество() > 0 Тогда
////		НапечататьОдинЧек(МассивЧеков, Параметры.ИдентификаторУстройства);
////	КонецЕсли;
////	
////КонецПроцедуры

////&НаКлиенте
////Процедура НапечататьОдинЧек(МассивЧеков, ИдентификаторУстройства)
////	
////	ОбщиеПараметры    = МассивЧеков[0];
////	
////	Контекст = Новый Структура();
////	Контекст.Вставить("МассивЧеков", МассивЧеков);
////	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
////	
////	Оповещение = Новый ОписаниеОповещения("НапечататьОдинЧекЗавершение", ЭтотОбъект, Контекст);
////	
////	МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, 
////		УникальныйИдентификатор, 
////		ОбщиеПараметры, 
////		ИдентификаторУстройства,
////		,
////		,
////		);
////	
////КонецПроцедуры
//	
//////&НаКлиенте
//////Процедура НапечататьОдинЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
//////	
//////	Если РезультатВыполнения.Результат Тогда
//////		
//////		Параметры.МассивЧеков.Удалить(0);
//////		Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
//////		Объект.ЧекПробитНаККМ = Истина;
//////		УстановитьДосутпность();
//////		Если Параметры.МассивЧеков.Количество() > 0 Тогда
//////			НапечататьОдинЧек(Параметры.МассивЧеков, Параметры.ИдентификаторУстройства);
//////		Иначе
//////			Модифицированность = Истина;
//////			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
//////		КонецЕсли;
//////	Иначе
//////		
//////		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
//////								|Чек не напечатан на фискальном устройстве.
//////								|Дополнительное описание:
//////								|""%1""'");
//////		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатВыполнения.ОписаниеОшибки);
//////		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//////		
//////	КонецЕсли;
//////	
//////КонецПроцедуры

//////&НаСервере
//////Функция ПодготовитьДанныеДляПробитияЧека(НомерСекции, ДоговорПА, Телефон = "", АдресЭП = "")
//////	
//////	Возврат Документы.бит_ЧекККМ.СобратьДанныеЧеков(Объект.Ссылка, НомерСекции, ДоговорПА, Телефон, АдресЭП);
//////	
//////КонецФункции

&НаКлиенте
Процедура ВыборЧекаВозвратаЗавершение(ВыбранныйЧек, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйЧек) Тогда
		Объект.ЧекОснование = ВыбранныйЧек;
	Иначе
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьЧекНаСервере();
	
	УстановитьДосутпность();
	УстановитьВидимость();
	
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Услуги);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЧекНаСервере()
	
	РеквизитыЧекОснование = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ЧекОснование
		, "СуммаОплаты, ЛицевойСчет, ШаблонИзвещений, Касса, Итого, Плательщик, Услуги, БиллинговыеУслуги, СуммаВключаетНДС, ДокументБезНДС");
	
	Объект.СуммаОплаты		= РеквизитыЧекОснование.СуммаОплаты;
	Объект.ЛицевойСчет		= РеквизитыЧекОснование.ЛицевойСчет;
	Объект.ШаблонИзвещений	= РеквизитыЧекОснование.ШаблонИзвещений;
	Объект.Касса			= РеквизитыЧекОснование.Касса;
	Объект.Организация		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Касса, "Владелец"); 
	Объект.Итого			= РеквизитыЧекОснование.СуммаОплаты;
	Объект.Плательщик		= РеквизитыЧекОснование.Плательщик;
	Объект.СуммаВключаетНДС = РеквизитыЧекОснование.СуммаВключаетНДС;
	Объект.ДокументБезНДС	= РеквизитыЧекОснование.ДокументБезНДС;
	
	Объект.Услуги.Очистить();
	ТЗ = РеквизитыЧекОснование.Услуги.Выгрузить();
	Объект.Услуги.Загрузить(ТЗ);
	
	Объект.БиллинговыеУслуги.Очистить();
	ТЗ = РеквизитыЧекОснование.БиллинговыеУслуги.Выгрузить();
	Объект.БиллинговыеУслуги.Загрузить(ТЗ);
	
	ЗаполнениеСправочнойИнформации(Объект.ЛицевойСчет);

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	Если ПравоДоступа("Чтение", Метаданные.Справочники.ПодключаемоеОборудование) Тогда
		ИспользуютсяСканерыШтрихкода = (МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам("СканерШтрихкода").Количество() > 0);
	Иначе
		ИспользуютсяСканерыШтрихкода = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , "");
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЧекаККМВозврата()
	
	ПараметрыОтбора = Новый Структура;
	Отбор = Новый Структура;
	
	Отбор.Вставить("Архивный", Ложь);
	Отбор.Вставить("Касса", Объект.Касса);
	Отбор.Вставить("Ответственный", Объект.Ответственный);
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат") Тогда
		
		Отбор.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Продажа"));
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг") Тогда
		
		Отбор.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.ПродажаВнешнийБиллинг"));
	КонецЕсли; 
	Отбор.Вставить("ЧекПробитНаККМ", Истина);
	
	ПараметрыОтбора.Вставить("Отбор", Отбор);
	ОткрытьФорму("Документ.бит_ЧекККМ.ФормаВыбора", ПараметрыОтбора, ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,Новый ОписаниеОповещения("ВыборЧекаВозвратаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере 
Процедура ВводВручнуюПриИзмененииСервер()
	
	мКоммунальныеУслуги = Объект.Услуги.Выгрузить();
	ПерезагрузитьТаблицуУслуг(мКоммунальныеУслуги);
	Объект.Услуги.Загрузить(мКоммунальныеУслуги);
	
	ОбновитьОкноИнформации();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКассаПриИзменении()
	
	Объект.КодКассы = ЗначениеРеквизитаНаСервере(Объект.Касса, "КодКассы");
	
	Объект.КодПачки = "" + Объект.КодКассы + "" + Формат(День(Объект.Дата),"ЧЦ=2; ЧВН=") + "" +Формат(Месяц(Объект.Дата),"ЧЦ=2; ЧВН=");
	
	Если Объект.ЧекПробитНаККМ Тогда
		Элементы.Чек.Доступность    = Ложь;
		//Элементы.Пречек.Доступность = Ложь;
	Иначе
		Элементы.Чек.Доступность    = Истина;
		//Элементы.Пречек.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиКассуОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_КассыККМ.Ссылка КАК КассаККМ
	               |ИЗ
	               |	Справочник.бит_КассыККМ КАК бит_КассыККМ
	               |ГДЕ
	               |	НЕ бит_КассыККМ.ПометкаУдаления
	               |	И бит_КассыККМ.Владелец = &Организация
	               |	И НЕ бит_КассыККМ.ПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.бит_ПодразделенияОрганизаций.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	бит_КассыККМ.Код";
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КассаККМ;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииЛицевогоСчет_Услуги()
	
	Если ЗначениеЗаполнено(объект.ШаблонИзвещений) И ЗначениеЗаполнено(Объект.ЛицевойСчет)Тогда
		РасчетУслуг();
	КонецЕсли; 
	
	мТаблицаНачисленийПени.Очистить();
	
	ПолучитьНачисленияПени();
	
	Итог = Объект.Услуги.Итог("СуммаПени");
	
	Элементы.УслугиСуммаПени.Видимость       = ?(Итог <> 0 ИЛИ Объект.ВводВручную, Истина, Ложь);
	Элементы.УслугиДеревоСуммаПени.Видимость = ?(Итог <> 0 ИЛИ Объект.ВводВручную, Истина, Ложь);
	
КонецПроцедуры

// Процедура выполняет расчет сумм услуг табличной части "Услуги".
//
// Параметры
//   Нет.
//
&НаКлиенте
Процедура РасчетУслуг(ВводПоказаний = Ложь)
	
	Если НЕ мКэшЗначений.НуженПерерасчет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Объект.Услуги.Очистить();
	Объект.БиллинговыеУслуги.Очистить();
	мСписокЛС.Очистить();
	
	Строка = мСписокЛС.Добавить();
	
	Строка.ЛицевойСчет     = Объект.ЛицевойСчет;
	Строка.ШаблонИзвещений = Объект.ШаблонИзвещений;
	Строка.Сумма           = Объект.СуммаОплаты;
	
	ЗаполнитьУслугиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.бит_ЧекККМ"));
	
	мКоммунальныеУслуги = ДокументОбъект.Услуги.ВыгрузитьКолонки();
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"								, Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"						, Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"								, Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"							, Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика"	, Ложь);
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты"							, Ложь);
	ПараметрыЖКХ.Вставить("ВариантРасчетаНДС"										, Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Объект.Дата),  Объект.Организация, ПараметрыЖКХ);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЖКХ.ВариантРасчетаНДС) Тогда
		ПараметрыЖКХ.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДСВСумме;
	КонецЕсли; 
	
	Если ПараметрыЖКХ.ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.ДокументБезНДС") Тогда 
		Объект.ДокументБезНДС	= Истина;
		//НДСНеВыделять			= Ложь;
		Объект.СуммаВключаетНДС	= Истина;
		//27.12.2018
		ЭтаФорма.Элементы.УслугиСтавкаНДС.АвтоОтметкаНезаполненного = Ложь;
		ЭтаФорма.Элементы.УслугиСуммаНДС.АвтоОтметкаНезаполненного = Ложь;
		ЭтаФорма.Элементы.УслугиСтавкаНДС.АвтоВыборНезаполненного = Ложь;
		ЭтаФорма.Элементы.УслугиСтавкаНДС.АвтоВыборНезаполненного = Ложь;

	ИначеЕсли ПараметрыЖКХ.ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.НДСНеВыделять") Тогда 
		Объект.ДокументБезНДС	= Ложь;
		//НДСНеВыделять			= Истина;
		Объект.СуммаВключаетНДС	= Истина;
	ИначеЕсли ПараметрыЖКХ.ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.НДСВСумме") Тогда 
		Объект.ДокументБезНДС	= Ложь;
		//НДСНеВыделять			= Ложь;
		Объект.СуммаВключаетНДС	= Истина;
	Иначе
		Объект.ДокументБезНДС	= Ложь;
		//НДСНеВыделять			= Ложь;
		Объект.СуммаВключаетНДС	= Ложь;
	КонецЕсли;
	
	лРасчетСУчетомДолейВладения          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	лУменьшениеНормыЛьготыВПределахФакта = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	лЛьготаПерсонифицированная           = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	лНачислениеСУчетомДнейПроживания     = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	лРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика  = ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика;
	лРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика  = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	лНачислятьПениСУчетомПереплаты		 = ПараметрыЖКХ.НачислятьПениСУчетомПереплаты;
	
	СписокЛС = ДанныеФормыВЗначение(мСписокЛС,Тип("ТаблицаЗначений"));
	
	бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Объект.Дата,
													Объект.Организация,
													СписокЛС,
													мКоммунальныеУслуги,
													лЛьготаПерсонифицированная,
													лРасчетСУчетомДолейВладения,
													лУменьшениеНормыЛьготыВПределахФакта,
													лНачислениеСУчетомДнейПроживания,
													лРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
													лРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
													лНачислятьПениСУчетомПереплаты);
	
	Объект.Услуги.Загрузить(мКоммунальныеУслуги);
	
	Если Объект.ВводВручную Тогда
		
		Для каждого Строка Из Объект.Услуги Цикл
			
			Строка.Сумма     = 0;
			Строка.СуммаПени = 0;
			
		КонецЦикла;
		
		Элементы.УслугиСуммаПени.Видимость = Истина;
		
	Иначе
		
		УстановитьВидимостьКолонкиПени();
		
	КонецЕсли; 
	
	УменьшитьСумму();
	
	ЗаполнитьТаблицуДолга();
	
	Если Объект.ЛицевойСчет.ОтображатьПоГруппам Тогда
		
		СформироватьДеревоУслуг();
		
	КонецЕсли; 
	
	СуммаУслуга       = 0;
	СуммаСУчПереплаты = 0;
	
	Для каждого Строка Из Объект.Услуги Цикл
		
		Если Строка.Долг >0 Тогда
			
			СуммаУслуга = СуммаУслуга + Строка.Долг;
			
		КонецЕсли;
		
		СуммаСУчПереплаты = СуммаСУчПереплаты + Строка.Долг;
		
	КонецЦикла; 
	
	Элементы.УслугиДолг.ТекстПодвала = Строка(СуммаУслуга)+"
	|" + Строка(СуммаСУчПереплаты);
	
	СуммаУслуга       = 0;
	СуммаСУчПереплаты = 0;
	
	
	мУслугиДерево = ДанныеФормыВЗначение(УслугиДерево,Тип("ДеревоЗначений")); 
	
	Для каждого Строка Из мУслугиДерево.Строки Цикл
		
		Если Строка.Долг >0 Тогда
			
			СуммаУслуга = СуммаУслуга + Строка.Долг;
			
		КонецЕсли; 
		
		СуммаСУчПереплаты = СуммаСУчПереплаты + Строка.Долг;
		
	КонецЦикла; 
	
	Если Не Объект.ВводВручную Тогда
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_ЧекККМ"));
		
		ДокументОбъект.УдалитьПустыеСтроки();
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
	КонецЕсли; 
	
	Элементы.УслугиДеревоДолг.ТекстПодвала = Строка(СуммаУслуга)+"
	|" + Строка(СуммаСУчПереплаты);
	
	мКэшЗначений.НуженПерерасчет = Ложь;
	
КонецПроцедуры

// Процедура получает таблицу начислений пени.
//
&НаСервере
Процедура ПолучитьНачисленияПени()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток, 0) - ЕСТЬNULL(НачислениеКасс.СуммаПениОборот, 0) < 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток, 0) - ЕСТЬNULL(НачислениеКасс.СуммаПениОборот, 0)
	|		КОНЕЦ) КАК СуммаПени,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ.ГруппаУслуги КАК ГруппаУслуги
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_НачисленияКассОбороты.Услуга КАК Услуга,
	|			СУММА(бит_НачисленияКассОбороты.СуммаПениОборот) КАК СуммаПениОборот
	|		ИЗ
	|			РегистрНакопления.бит_НачисленияКасс.Обороты(
	|					&ДатаНач,
	|					&ДатаКон,
	|					,
	|					КассаККМ = &КассаККМ
	|						И ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияКассОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_НачисленияКассОбороты.Услуга) КАК НачислениеКасс
	|		ПО бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ = НачислениеКасс.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ";
	
	Запрос.УстановитьПараметр("Дата"       , Объект.Дата);
	Запрос.УстановитьПараметр("ДатаНач"    , НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКон"    , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("КассаККМ"   , Объект.Касса);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если мТаблицаНачисленийПени.Количество() = 0 Тогда
		
		ТаблицаНачисленийПени = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли; 
	
	Отбор = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		
		Отбор.Очистить();
		
		Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		Отбор.Вставить("Услуга"     , Выборка.Услуга);
		
		МассивСтрок = ТаблицаНачисленийПени.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Если МассивСтрок[0].СуммаПени <> Выборка.СуммаПени Тогда
				
				МассивСтрок[0].СуммаПени = Выборка.СуммаПени;	
				
			КонецЕсли; 	
			
		Иначе
			
			НоваяСтрока = мТаблицаНачисленийПени.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ЗначениеВДанныеФормы(ТаблицаНачисленийПени,мТаблицаНачисленийПени);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииЛицевогоСчет_БиллинговыеУслуги()
	
	Объект.Услуги.Очистить();
	ЗаполнитьБиллинговымиУслугами();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБиллинговымиУслугами()
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	ПостроительЗапроса.Параметры.Вставить("Момент"     , КонецДня(объект.Дата));
	ПостроительЗапроса.Параметры.Вставить("Организация", объект.Организация);
	ПостроительЗапроса.Параметры.Вставить("ЛицевойСчет", объект.ЛицевойСчет);
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ СведенияОбУслугах
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(
	|			&Момент,
	|			Организация = &Организация
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|ГДЕ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК ПролучательДС,
	|	КонтактнаяИнформация.Поле3 КАК Телефон
	|ПОМЕСТИТЬ КонтактнаяИнформация
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	(КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|			ИЛИ КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбУслугах.Услуга,
	|	бит_бу_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	СведенияОбУслугах.Приоритет
	|ПОМЕСТИТЬ УслугиИПолучателиДС
	|ИЗ
	|	СведенияОбУслугах КАК СведенияОбУслугах
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_бу_ПолучателиДенежныхСредств.СрезПоследних(&Момент) КАК бит_бу_ПолучателиДенежныхСредствСрезПоследних
	|		ПО СведенияОбУслугах.Услуга = бит_бу_ПолучателиДенежныхСредствСрезПоследних.Услуга
	|			И СведенияОбУслугах.Поставщик = бит_бу_ПолучателиДенежныхСредствСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиИПолучателиДС.Услуга КАК Услуга,
	|	УслугиИПолучателиДС.ПолучательДенежныхСредств КАК ПолучательДС,
	|	КонтактнаяИнформация.Телефон,
	|	УслугиИПолучателиДС.Приоритет
	|{ВЫБРАТЬ
	|	Услуга.*}
	|ИЗ
	|	УслугиИПолучателиДС КАК УслугиИПолучателиДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО УслугиИПолучателиДС.ПолучательДенежныхСредств = КонтактнаяИнформация.ПролучательДС
	|{ГДЕ
	|	УслугиИПолучателиДС.Услуга.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОбУслугах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КонтактнаяИнформация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ УслугиИПолучателиДС";
	
	ПостроительЗапроса.Выполнить();
	
	Если НЕ объект.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам И объект.ШаблонИзвещений.Услуги.Количество() > 0 Тогда
		
		СписокУслуг = Новый СписокЗначений;
		СписокУслуг.ЗагрузитьЗначения(объект.ШаблонИзвещений.Услуги.ВыгрузитьКолонку("Услуга"));
		ПостроительЗапроса.Отбор.Добавить("Услуга");
		
		ПостроительЗапроса.Отбор["Услуга"].Использование = Истина;
		ПостроительЗапроса.Отбор["Услуга"].ВидСравнения  = ВидСравнения.ВСписке;
		ПостроительЗапроса.Отбор["Услуга"].Значение      = СписокУслуг;
		
	КонецЕсли; 
	
	
	КоммунальныеУслуги.Загрузить(ПостроительЗапроса.Результат.Выгрузить());
	
	КоммунальныеУслуги.Сортировать("Приоритет Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	УстановитьРучнойВвод();
	
	Итог = объект.Услуги.Итог("СуммаПени");
	
	Элементы.Услуги.ПодчиненныеЭлементы.УслугиСуммаПени.Видимость = ?(Итог = 0 И НЕ Объект.ВводВручную, Ложь, Истина);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат") Тогда
		
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиДолг.Видимость = Ложь;
	Иначе
		
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиДолг.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОкноИнформации()
	
	ОтображатьПоГруппам = ЗначениеРеквизитаНаСервере(Объект.ЛицевойСчет, "ОтображатьПоГруппам");
	Если ЗначениеЗаполнено(ОтображатьПоГруппам) И ОтображатьПоГруппам Тогда
		ТаблицаУслуг = РеквизитФормыВЗначение("УслугиДерево").Строки;	
	Иначе
		ТаблицаУслуг = Объект.Услуги; 
	КонецЕсли;
	
	СуммаУслуга       = 0;
	СуммаСУчПереплаты = 0;
	
	Для каждого Строка Из Объект.Услуги Цикл
		
		Если Строка.Долг >0 Тогда
			
			СуммаУслуга = СуммаУслуга + Строка.Долг;
			
		КонецЕсли;
		
		СуммаСУчПереплаты = СуммаСУчПереплаты + Строка.Долг;
		
	КонецЦикла; 
	
	Элементы.УслугиДолг.ТекстПодвала = Строка(СуммаУслуга)+"
	|" + Строка(СуммаСУчПереплаты);
	
	Если ТаблицаУслуг.Количество() > 0 Тогда
		
		Текст ="Сумма оплаты:" + Объект.СуммаОплаты;
		КонтрольнаяСумма = Объект.СуммаОплаты;
		ИтогСумма = ТаблицаУслуг.Итог("Сумма");
		ИтогПени  = ТаблицаУслуг.Итог("СуммаПени");
		Остаток = КонтрольнаяСумма - ИтогСумма - ИтогПени;
		
		Текст = Текст + "
		|Оплата услуг :" + ИтогСумма + ", Пени: "+ ИтогПени + 
		?(Остаток > 0, ". 
		|Не распределенная сумма оплаты: "+ Остаток ,".");
		
		Если Остаток < 0 Тогда
			Элементы.НадписьИнфоОбщ.ЦветТекста = Новый Цвет(255, 0, 0);		
			Текст = Текст + ". 
			|Распределенная сумма превышает сумму оплаты на: "+ Остаток * -1 +" !"
		Иначе
			Элементы.НадписьИнфоОбщ.ЦветТекста = Новый Цвет(0, 0, 0);
		КонецЕсли; 
		
		Элементы.НадписьИнфоОбщ.Заголовок = Текст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйДокумент()
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Касса"      , Объект.Касса);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	
	ОткрытьФорму("Документ.бит_ЧекККМ.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаЧекККМ", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

// Процедура создает новый документ "Ввод показаний по счетчикам" 
// и заполяет его на основе таблицы "Счетчики".
//
// Параметры
//   Нет.
//
&НаКлиенте
Процедура ВводПоказанийПоСчетчикам()
	
	ПроведениеДокумента = ПроведениеДокументаВводПоказанийПоСчетчикамНаСервере();
	
	Если ПроведениеДокумента Тогда
		
		Если ЗначениеЗаполнено(Объект.СуммаОплаты)
			И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Продажа")
			ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат"))Тогда
			
			РасчетУслуг(Истина);
		КонецЕсли;
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Дата"              , Объект.Дата - 60);
		ПараметрыФормы.Вставить("ВидОперации"       , ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний"));
		ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
		ПараметрыФормы.Вставить("ЛицевойСчет"       , Объект.ЛицевойСчет);
		ПараметрыФормы.Вставить("Ответственный"     , Объект.Ответственный);
		ПараметрыФормы.Вставить("Улица"             , ЗначениеРеквизитаНаСервере(Объект.ЛицевойСчет, "УлицаЛицевогоСчета"));
		ПараметрыФормы.Вставить("ТипСчетчика"       , ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Индивидуальный"));
		ПараметрыФормы.Вставить("ПоказанияНаселения", Истина);
		
		МассивСчетчиков = ПолучитьМассивСчетчиковНаСервере();
		
		ПараметрыФормы.Вставить("МассивСчетчиков", МассивСчетчиков);
		
		ОткрытьФорму("Документ.бит_ВводПоказанийПоСчетчикам.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаЧекККМ", ПараметрыФормы), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Печать()
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = Документы.бит_ЧекККМ.ПолучитьМакет("ТоварныйЧек");
	
	ОпластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОпластьШапка.Параметры.Номер       = Объект.Номер;
	ОпластьШапка.Параметры.КодКассы    = Объект.КодКассы;
	ОпластьШапка.Параметры.ЛицевойСчет = Объект.ЛицевойСчет;
	
	Если НЕ ЗначениеЗаполнено(Объект.Адрес) Тогда
		СпрИнфо = ПолучитьСправочнуюИнформацию(Объект.ЛицевойСчет, Объект.Дата);
		ОпластьШапка.Параметры.Адрес = СпрИнфо.Адрес;
	Иначе
		ОпластьШапка.Параметры.Адрес = Объект.Адрес;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОпластьШапка);
	
	Для каждого Строка Из Объект.Услуги Цикл
		
		ОбластьСтрока.Параметры.НомерСтроки = Строка.НомерСтроки;
		ОбластьСтрока.Параметры.Услуга      = Строка.Услуга;
		ОбластьСтрока.Параметры.Сумма       = Строка.Сумма + Строка.СуммаПени;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	ОбластьПодвал.Параметры.Итого         = Объект.Услуги.Итог("Сумма") + Объект.Услуги.Итог("СуммаПени");
	ОбластьПодвал.Параметры.Получено      = Объект.Итого;
	ОбластьПодвал.Параметры.Сдача         = Объект.Сдача;
	ОбластьПодвал.Параметры.Ответственный = Объект.Ответственный;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции

// Процедура заполняет табличную часть счетчики.
//
// Параметры
//	Нет.
//
&НаСервере
Процедура ЗаполнениеТаблицыСчетчиков() 
	
	Объект.Счетчики.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	, КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Объект"	, Объект.ЛицевойСчет);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
	               |	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	               |	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	               |	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	               |	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания
	               |ИЗ
	               |	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	               |			&Дата,
	               |			(ВЫРАЗИТЬ(Объект КАК Справочник.бит_ЛицевыеСчета)) = &Объект
	               |				И Счетчик В
	               |					(ВЫБРАТЬ
	               |						бит_Счетчики.Ссылка
	               |					ИЗ
	               |						Справочник.бит_Счетчики КАК бит_Счетчики
	               |					ГДЕ
	               |						бит_Счетчики.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный))) КАК бит_СчетчикиНаУслугахСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, ) КАК бит_ПоказанияСчетчиковОстатки
	               |		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	               |			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	               |			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	               |ГДЕ
	               |	бит_СчетчикиНаУслугахСрезПоследних.Использовать = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		НовСтрока						= Объект.Счетчики.Добавить();
		НовСтрока.Счетчик				= Выборка.Счетчик;
		НовСтрока.Услуга				= Выборка.Услуга;
		НовСтрока.Разрядность			= Выборка.Разрядность;
		НовСтрока.ПредыдущиеПоказания	= Выборка.ПредыдущиеПоказания;
	КонецЦикла; 
	
	
КонецПроцедуры

// Процедура дополняет таблицу услуги получетелями денежных средств.
//
&НаСервере
Процедура ДополнитьТаблицуПолучателямиДС(Знач СписокУслуг)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолучателиДС.Услуга,
	|	ПолучателиДС.ПолучательДенежныхСредств КАК ПолучательДС,
	|	ЕСТЬNULL(КонтактнаяИнформация.Телефон, """") КАК Телефон
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_ПолучателиДенежныхСредствСрезПоследних.Услуга КАК Услуга,
	|		бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств КАК ПолучательДенежныхСредств
	|	ИЗ
	|		РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Дата, Услуга В (&Услуги)) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|				бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|				бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
	|			ИЗ
	|				РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|						&Дата,
	|						ЛицевойСчет = &ЛицевойСчет
	|							И Услуга В (&Услуги)) КАК бит_СведенияПоУслугамЛССрезПоследних) КАК СведенияПоУслугам
	|			ПО бит_ПолучателиДенежныхСредствСрезПоследних.Услуга = СведенияПоУслугам.Услуга
	|				И бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик = СведенияПоУслугам.Поставщик) КАК ПолучателиДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтактнаяИнформация.Объект КАК ПролучательДС,
	|			КонтактнаяИнформация.Поле3 КАК Телефон
	|		ИЗ
	|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ГДЕ
	|			(КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|					ИЛИ КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
	|			И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)) КАК КонтактнаяИнформация
	|		ПО ПолучателиДС.ПолучательДенежныхСредств = КонтактнаяИнформация.ПролучательДС";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуги"     , СписокУслуг);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Услуга", Выборка.Услуга);
		
		НайденыеСтроки = Объект.Услуги.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденыеСтроки Цикл
			
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
			
		КонецЦикла;   
		
	КонецЦикла; 
	
КонецПроцедуры

// Функция получает последную дата начислений по ЛС.
//
&НаСервереБезКонтекста
Функция ПериодНачислений(Дата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_НачислениеПоЛицевымСчетам.Дата КАК Дата
	|ИЗ
	|	Документ.бит_НачислениеПоЛицевымСчетам КАК бит_НачислениеПоЛицевымСчетам
	|ГДЕ
	|	бит_НачислениеПоЛицевымСчетам.Дата < &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	Иначе
		Возврат ДобавитьМесяц(Дата, -1);
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста
Функция РСНаСервере(Организация)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Процедура выполняет заполнения элементы формы стравочной информацией.
//
// Параметры
//   ЛС - СправочникСсылка.бит_ЛицевыеСчета - текущий лицевой счет.
//
&НаСервере
Процедура ЗаполнениеСправочнойИнформации(ЛС)
	
	ПараметрыЖКХ = Новый Структура;  
	
	ПараметрыЖКХ.Вставить("ПечатьПолучателейДС"                , Перечисления.бит_ВидыПечатиПолучателейДС.НеПечатать);
	ПараметрыЖКХ.Вставить("ГруппироватьУслугиВЧеке"            , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"          , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьРайон"                    , Ложь);
	ПараметрыЖКХ.Вставить("ПрефиксУлица"                       , "ул.");
	ПараметрыЖКХ.Вставить("ПрефиксДом"                         , "д.");
	ПараметрыЖКХ.Вставить("ПрефиксКорпус"                      , "к.");
	ПараметрыЖКХ.Вставить("ПрефиксКвартира"                    , "кв.");
	ПараметрыЖКХ.Вставить("ПрефиксРайон"                       , "г.");
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Объект.Дата, Объект.Организация, ПараметрыЖКХ);
	
	мЛьготаПерсонифицированная           = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	мПечатьГруппУслуг                    = ПараметрыЖКХ.ГруппироватьУслугиВЧеке;
	мНеПечататьРайон                     = ПараметрыЖКХ.НеПечататьРайон;
	мПрефиксУлица                        = ПараметрыЖКХ.ПрефиксУлица;
	мПрефиксДом                          = ПараметрыЖКХ.ПрефиксДом;
	мПрефиксКорпус                       = ПараметрыЖКХ.ПрефиксКорпус;
	мПрефиксКвартира                     = ПараметрыЖКХ.ПрефиксКвартира;
	мПрефиксРайон                        = ПараметрыЖКХ.ПрефиксРайон;
	мПечатьПДС                           = 0;
	Если ПараметрыЖКХ.ПечатьПолучателейДС <> Перечисления.бит_ВидыПечатиПолучателейДС.НеПечатать Тогда
		мПечатьПДС = ?(ПараметрыЖКХ.ПечатьПолучателейДС = Перечисления.бит_ВидыПечатиПолучателейДС.ПодСтрокойУслуги ,2,1);
	КонецЕсли;
	
	мКэшЗначений.мПечатьПДС = мПечатьПДС;
	
	мПечатьГруппУслуг = Объект.ЛицевойСчет.ОтображатьПоГруппам;
	
	мКэшЗначений.мПечатьГруппУслуг = мПечатьГруппУслуг;
	
	// БИТ_ЖКХ 28.03.2018 13:37:37 Начало правки... 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Запрос.УстановитьПараметр("Дата"       , Объект.Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_СписокЗданий.ПочтовыйАдрес КАК ПочтовыйАдрес
	|ПОМЕСТИТЬ ВТ_ВсеЛС
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_Квартиросъемщик
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Дата,
	|			СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|				И СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЛС.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ВТ_ВсеЛС.Квартира КАК Квартира,
	|	ВТ_Квартиросъемщик.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	ВТ_ВсеЛС КАК ВТ_ВсеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Квартиросъемщик КАК ВТ_Квартиросъемщик
	|		ПО ВТ_ВсеЛС.ЛицевойСчет = ВТ_Квартиросъемщик.ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Объект.Адрес = ?(ЗначениеЗаполнено(Выборка.ПочтовыйАдрес), Строка(Выборка.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(Выборка.Квартира), ", кв." + Строка(Выборка.Квартира),""), "");
		Объект.Квартиросъемщик = Строка(Выборка.ФизЛицо);
	Иначе
		Объект.Адрес = "";
		Объект.Квартиросъемщик = "";
	КонецЕсли; 
	
	//СтрРайон	= ?(мНеПечататьРайон, "", "" + мПрефиксРайон + " " + СокрЛП(Строка(ЛС.Здание.Район)) + ",");	
	//СтрУлица	= " " + мПрефиксУлица + " " + СокрЛП(Строка(ЛС.УлицаЛицевогоСчета)) + ",";
	//СтрДом		= " " + мПрефиксДом + " " + СокрЛП(Строка(ЛС.Здание)) + ",";
	//СтрКорпус	= ?(ЗначениеЗаполнено(ЛС.Здание.Корпус), " " + мПрефиксКорпус + " " + СокрЛП(Строка(ЛС.Здание.Корпус)) + ",", "");
	//СтрКвартира	= " " + мПрефиксКвартира + " " + СокрЛП(Строка(ЛС.Квартира));
	//Объект.Адрес= "" + СтрРайон + СтрУлица + СтрДом + СтрКорпус + СтрКвартира;
	//
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ //ПЕРВЫЕ 1
	//|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	//|	бит_ПроживающиеПоЛССрезПоследних.Период КАК Период
	//|ИЗ
	//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	//|			&Дата,
	//|			СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	//|				И (НЕ СтатусФизЛица В (&СписокИгнорируемыхСтатусов))
	//|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Период УБЫВ";
	//
	//СписокИгнорируемыхСтатусов = Новый СписокЗначений;
	//
	//СписокИгнорируемыхСтатусов.Добавить(Справочники.бит_СтатусФизЛица.Выписан);
	//
	//Запрос.УстановитьПараметр("Дата"                       , Объект.Дата);
	//Запрос.УстановитьПараметр("ЛицевойСчет"                , ЛС);
	//Запрос.УстановитьПараметр("СписокИгнорируемыхСтатусов" , СписокИгнорируемыхСтатусов);	
	//
	//Если НЕ Запрос.Выполнить().Пустой() Тогда
	//	
	//	Результат = Запрос.Выполнить().Выбрать();
	//	Если Результат.Следующий() Тогда
	//		Объект.КвартироСъемщик = Результат.ФизЛицо;
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	Объект.КвартироСъемщик = "";
	//	Объект.Адрес           = "";
	//	
	//КонецЕсли;
	// БИТ_ЖКХ 28.03.2018 13:37:42 Конец правки. 
	
	мКэшЗначений.Адрес = Объект.Адрес;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("ГруппироватьУслугиВЧеке"            , Ложь);
	КэшированныеЗначения.Вставить("ЛьготаПерсонифицированная"          , Ложь);
	КэшированныеЗначения.Вставить("НеПечататьРайон"                    , Ложь);
	КэшированныеЗначения.Вставить("ПрефиксУлица"                       , "ул.");
	КэшированныеЗначения.Вставить("ПрефиксДом"                         , "д.");
	КэшированныеЗначения.Вставить("ПрефиксКорпус"                      , "к.");
	КэшированныеЗначения.Вставить("ПрефиксКвартира"                    , "кв.");
	КэшированныеЗначения.Вставить("ПрефиксРайон"                       , "г.");
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта"      , Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Дата"                      , Объект.Дата);
	КэшированныеЗначения.Вставить("мТекущаяДатаДокумента"     , Объект.Дата);
	
	КэшированныеЗначения.Вставить("мПечатьПДС"                , Неопределено);
	КэшированныеЗначения.Вставить("мПечатьГруппУслуг"         , Неопределено);
	КэшированныеЗначения.Вставить("Адрес"                     , Неопределено);
	
	КэшированныеЗначения.Вставить("НуженПерерасчет"           , Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонкиПени()
	
	Итог = Объект.Услуги.Итог("СуммаПени");
	
	Элементы.УслугиСуммаПени.Видимость       = ?(Итог <> 0 ИЛИ Объект.ВводВручную, Истина, Ложь);
	Элементы.УслугиДеревоСуммаПени.Видимость = ?(Итог <> 0 ИЛИ Объект.ВводВручную, Истина, Ложь);
	
КонецПроцедуры

// Процедура формирует таблиц значений.
//
&НаСервере
Процедура ЗаполнитьТаблицуДолга()
	
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.бит_ЧекККМ"));
	
	мТаблицаДолга.Очистить();
	ТаблицаДолга = ДокументОбъект.Услуги.Выгрузить();
	мТаблицаДолга.Загрузить(ТаблицаДолга);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСчетчиковНаСервере()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Счетчик");
	ТаблицаЗначений.Колонки.Добавить("Услуга");
	ТаблицаЗначений.Колонки.Добавить("Разрядность");
	ТаблицаЗначений.Колонки.Добавить("ПредыдущиеПоказания");
	ТаблицаЗначений.Колонки.Добавить("ТекущиеПоказания");
	
	Для каждого Строка Из Объект.Счетчики Цикл
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	МассивСчетчиков = бит_ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
	
	Возврат МассивСчетчиков;
	
КонецФункции

// Процедура выполняет группировку услуг по "Грппа услуги".
// И заполнение дерева услуг.
//
&НаСервере
Процедура СформироватьДеревоУслуг()
	
	ТаблицаЧек = Объект.Услуги.Выгрузить();
	
	УслугиДер = ДанныеФормыВЗначение(УслугиДерево,Тип("ДеревоЗначений"));
	
	УслугиДер.Строки.Очистить();
	
	// Заполняем Дерево начислений.
	Для каждого Строка Из ТаблицаЧек Цикл
		
		НоваяСтрока = УслугиДер.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Приоритет = Строка.Услуга.Приоритет;
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Услуга
	|ПОМЕСТИТЬ ТабНач
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабНач.Услуга,
	|	ТабНач.Услуга.ГруппаУслуги КАК ГруппаУслуги
	|ИЗ
	|	ТабНач КАК ТабНач
	|ИТОГИ ПО
	|	ГруппаУслуги;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабНач";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаЧек);
	
	ВыборкаГруп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруп.Следующий() Цикл
		
		Выборка = ВыборкаГруп.Выбрать();
		
		Если ВыборкаГруп.ГруппаУслуги = Справочники.бит_ГруппыУслуг.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Выборка.Количество() > 1 Тогда
			
			НоваяСтрока							= УслугиДер.Строки.Добавить();
			НоваяСтрока.Услуга					= ВыборкаГруп.ГруппаУслуги;
			НоваяСтрока.ГруппаУслугиПриоритет	= ВыборкаГруп.ГруппаУслуги.Приоритет;
			
			Долг      = 0;
			СуммаПени = 0;
			Сумма     = 0;
			Начислено = 0;
			Сальдо    = 0;
			
			Пока Выборка.Следующий() Цикл
				
				Отбор = Новый Структура;
				
				Отбор.Вставить("Услуга", Выборка.Услуга);
				
				Строка = ТаблицаЧек.НайтиСтроки(Отбор);
				
				// Убираем строки с общией группой под группу.
				Если Строка.Количество() > 0 Тогда
					
					Строка = Строка[0];	
					
					СтрокаДерева = УслугиДер.Строки.НайтиСтроки(Отбор);
					
					Если СтрокаДерева.Количество() > 0 Тогда
						
						Для Каждого ЭлементМассива Из СтрокаДерева Цикл
							
							УслугиДер.Строки.Удалить(ЭлементМассива);
							
						КонецЦикла;
						
					КонецЕсли; 
					
					ПеренесеннаяСтрока = НоваяСтрока.Строки.Добавить();
					
					ЗаполнитьЗначенияСвойств(ПеренесеннаяСтрока, Строка);
					
					Долг      = Долг      + Строка.Долг;
					СуммаПени = СуммаПени + Строка.СуммаПени;
					Сумма     = Сумма     + Строка.Сумма;
					Начислено = Начислено + Строка.Начислено;
					Сальдо    = Сальдо    + Строка.Сальдо;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НоваяСтрока.Долг            = Долг;
			НоваяСтрока.СуммаПени       = СуммаПени;
			НоваяСтрока.Сумма           = Сумма;
			НоваяСтрока.Начислено       = Начислено;
			НоваяСтрока.Сальдо          = Сальдо;			
			НоваяСтрока.ШаблонИзвещений = Объект.ШаблонИзвещений;
			НоваяСтрока.ЛицевойСчет     = Объект.ЛицевойСчет;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	УслугиДер.Строки.Сортировать("Приоритет Возр, ГруппаУслугиПриоритет Возр", ИСТИНА);
	
	Элементы.Группа21.Видимость = Ложь;
	Элементы.Группа22.Видимость = Истина;
	Элементы.Группа23.Видимость = Ложь;
	
	ЗначениеВДанныеФормы(УслугиДер,УслугиДерево);
	
КонецПроцедуры

&НаСервере
Функция ПроведениеДокументаВводПоказанийПоСчетчикамНаСервере()
	
	Документ = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
	
	Документ.Дата               = Объект.Дата - 60;
	Документ.ВидОперации        = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
	Документ.Организация        = Объект.Организация;
	Документ.ЛицевойСчет        = Объект.ЛицевойСчет;
	Документ.Ответственный      = Объект.Ответственный;
	Документ.Улица              = Объект.ЛицевойСчет.УлицаЛицевогоСчета;
	Документ.ТипСчетчика        = Перечисления.бит_ТипСчетчика.Индивидуальный;
	Документ.ПоказанияНаселения = Истина;
	
	Документ.ПоказанияПоСчетчикам.Очистить();
	
	Для каждого Счетчик Из Объект.Счетчики Цикл
		
		Если Счетчик.ТекущиеПоказания <> 0  Тогда
			
			НоваяСтрока = Документ.ПоказанияПоСчетчикам.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Счетчик);
			
			НоваяСтрока.ЛицевойСчет = Объект.ЛицевойСчет;
			
			КолЕдиниц = 0 ;
			
			Если Счетчик.ПредыдущиеПоказания > Счетчик.ТекущиеПоказания Тогда
				
				КолЕдиниц = Счетчик.Разрядность - Счетчик.ПредыдущиеПоказания + Счетчик.ТекущиеПоказания + 1;
				
			Иначе
				
				КолЕдиниц = Счетчик.ТекущиеПоказания - Счетчик.ПредыдущиеПоказания;
				
			КонецЕсли; 
			
			НоваяСтрока.КоличествоЕдиницПоСчетчику = КолЕдиниц;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	мКэшЗначений.НуженПерерасчет = Истина;
	
	Попытка
		
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат Истина;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	УстановитьРучнойВвод();
	
	Итог = Объект.Услуги.Итог("СуммаПени");
	
	Элементы.УслугиСуммаПени.Видимость = ?(Итог = 0 И НЕ Объект.ВводВручную, Ложь, Истина);
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат Тогда
		Элементы.УслугиДолг.Видимость = Ложь;
	Иначе
		Элементы.УслугиДолг.Видимость = Истина;
	КонецЕсли; 
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Продажа
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат  Тогда
		
		Элементы.Группа21.Видимость = Истина;
		Элементы.Группа22.Видимость = Ложь;
		Элементы.Группа23.Видимость = Ложь;
		
		Если Объект.ЛицевойСчет.ОтображатьПоГруппам Тогда
			
			Элементы.Группа21.Видимость = Ложь;
			Элементы.Группа22.Видимость = Истина;
			Элементы.Группа23.Видимость = Ложь;
			
			Если Не Параметры.Ключ.Пустая() Тогда
				
				СформироватьДеревоУслуг();
				
			КонецЕсли; 
			
		Иначе
			
			Элементы.Группа21.Видимость = Истина;
			Элементы.Группа22.Видимость = Ложь;
			Элементы.Группа23.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.Группа21.Видимость = Ложь;
		Элементы.Группа22.Видимость = Ложь;
		Элементы.Группа23.Видимость = Истина;
		
	КонецЕсли;
	
	Если Объект.ВводВручную Тогда
		
		Элементы.НадписьИнфоОбщ.Видимость        = Истина;
		Элементы.Услуги.ТолькоПросмотр       = Ложь;
		Элементы.УслугиДерево.ТолькоПросмотр = Ложь;
		
	Иначе
		
		Элементы.НадписьИнфоОбщ.Видимость        = Ложь;
		Элементы.Услуги.ТолькоПросмотр       = Истина;
		Элементы.УслугиДерево.ТолькоПросмотр = Истина;
		
	КонецЕсли; 	
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат Тогда
		
		Элементы.СуммаОплаты.Доступность             = Ложь;
		Элементы.ШаблонИзвещений.Доступность         = Ложь; 
		Элементы.ЛицевойСчет.Доступность             = Ложь;
		Элементы.Плательщик.Доступность              = Ложь;
		Элементы.СчетчикиВвестиПоказания.Доступность = Ложь;
		Элементы.СчетчикиЗаполнить.Доступность       = Ложь;
		Элементы.ОплатаБезСдачи.Доступность          = Ложь;	
		
	Иначе
		
		Элементы.СуммаОплаты.Доступность             = Истина;
		Элементы.ШаблонИзвещений.Доступность         = Истина; 
		Элементы.ЛицевойСчет.Доступность             = Истина;
		Элементы.СчетчикиВвестиПоказания.Доступность = Истина;
		Элементы.СчетчикиЗаполнить.Доступность       = Истина;
		Элементы.ОплатаБезСдачи.Доступность          = Истина;
		Элементы.Плательщик.Доступность              = Истина;		
		
	КонецЕсли; 
	
	// Активировать кнопку "ручного" режима печати чека ККМ.
	Если Объект.ЧекПробитНаККМ Тогда
		Элементы.Чек.Доступность    = Ложь;
		//Элементы.Пречек.Доступность = Ложь;
	КонецЕсли;
	
	// Сделать недоступными все действия для пробитого чека.
	Если Объект.ЧекПробитНаККМ Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Элементы.ОплатаБезСдачи.Доступность          = Не ТолькоПросмотр;
	Элементы.СчетчикиЗаполнить.Доступность       = Не ТолькоПросмотр;	
	Элементы.СчетчикиВвестиПоказания.Доступность = Не ТолькоПросмотр;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРучнойВвод()
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.ПродажаВнешнийБиллинг
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг Тогда
		
		Элементы.НадписьИнфоОбщ.Видимость = Истина;
		Если Параметры.Ключ.Пустая() Тогда
			Объект.ВводВручную = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_ЧекККМ"));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНомерДокументаНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_ЧекККМ"));
	
	бит_РаботаСДиалогамиСервер.ПроверитьНомерДокумента(ДокументОбъект, мКэшЗначений.Дата);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// Процедура выполняет востановление значений долга, суммы и суммыпени в таблице услуги.
//
&НаСервере
Процедура ПерезагрузитьТаблицуУслуг(Таблица)
	
	Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		Таблица.ЗаполнитьЗначения(0, "Сумма, СуммаПени");
	Иначе  
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(0);
		Таблица.ЗагрузитьКолонку(МассивЗначений, "Сумма");
		Таблица.ЗагрузитьКолонку(МассивЗначений, "СуммаПени");
	КонецЕсли; 
	
	Если мТаблицаДолга.Количество() > 0 Тогда
		Для Каждого Строка Из мТаблицаДолга Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Услуга", Строка.Услуга);
			СтрокаПоиска = Таблица.НайтиСтроки(Отбор);
			
			Если НЕ СтрокаПоиска.Количество() = 0 Тогда
				СтрокаПоиска[0].Долг = Строка.Долг;
			Иначе
				НоваяСтрока = Объект.Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере	
Процедура ЗаписатьНаСервере(РежимЗаписиДокумента)
	
	Попытка
		ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_ЧекККМ"));
	Исключение
		ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	КонецПопытки;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента);	
	Исключение
	КонецПопытки;
	
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция бит_ОбработатьСобытиеСШК(Клиент, ШК)
	
	Результат = Неопределено;
	
	Если ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ОплатаКУ") ИЛИ 
		ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ЧекККМ") ИЛИ 
		ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_РазовыеПоУслугамЖКХ") Тогда
	Иначе
		возврат Результат;
	КонецЕсли;
	
	ДлинаШК = СтрДлина(ШК);
	
	ЧекККМ = Документы.бит_ЧекККМ.ПустаяСсылка();
	
	Если ДлинаШК > 37 Тогда
		
		СтрокаСумма = Лев(ШК,40);
		
		Если ДлинаШК > 43 Тогда
			СтрокаСумма = Сред(ШК,6,40);
		КонецЕсли; 
		
		КонтрольнаяСумма = 0;
		Для Значение = 1 по СтрДлина(СтрокаСумма)-1 Цикл
			КонтрольнаяСумма = КонтрольнаяСумма +  Число(Лев(СтрокаСумма,Значение))*33;
		КонецЦикла;
		КонтрольнаяСумма = КонтрольнаяСумма%1000;
		
		СуммаДляПроверки = Число(Прав(ШК, ДлинаШК- 40));
		Если ДлинаШК > 43 Тогда
			СуммаДляПроверки = Число(Прав(ШК, ДлинаШК- 45));
		КонецЕсли; 
		
		Если СуммаДляПроверки <> КонтрольнаяСумма тогда
			Возврат "Не правильно считан штрихкод!!!";
		КонецЕсли;
		
		РезШК = бит_РазберемШтрихКодИД(ШК);
		НаименованиеЛС	= РезШК.НаименованиеЛС;
		КодШаблона		= РезШК.КодШаблона;
		СуммаЦелых		= РезШК.СуммаЦелых;
		
	ИначеЕсли ДлинаШК = 13 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЧекККМ.Ссылка
		|ИЗ
		|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
		|ГДЕ
		|	бит_ЧекККМ.ШтрихКодФР = &ШтрихКодФР";
		Запрос.УстановитьПараметр("ШтрихКодФР", ШК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЧекККМ = Выборка.Ссылка;
			
		КонецЕсли; 
		
	ИначеЕсли ДлинаШК = 37 Тогда
		
		СтрокаСумма = Лев(ШК,34);
		КонтрольнаяСумма = 0;
		Для Значение = 1 по СтрДлина(СтрокаСумма)-1 Цикл
			КонтрольнаяСумма = КонтрольнаяСумма +  Число(Лев(СтрокаСумма,Значение))*33;
		КонецЦикла;
		КонтрольнаяСумма = КонтрольнаяСумма%1000;
		СуммаДляПроверки = Число(Прав(ШК, СтрДлина(ШК)-34));
		Если СуммаДляПроверки <> КонтрольнаяСумма тогда
			Возврат "Не правильно считан штрихкод!!!";
		КонецЕсли;
		
		РезШК = бит_РазберемШтрихКод(ШК);
		НаименованиеЛС	= РезШК.НаименованиеЛС;
		КодШаблона		= РезШК.КодШаблона;
		СуммаЦелых		= РезШК.СуммаЦелых;
		
	Иначе
		
		Возврат "Считанный штрих код не распознан!!!";
		
	КонецЕсли; 
	
	Если ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ОплатаКУ") Тогда
		
		МассивСтрок = Клиент.СписокЛС.НайтиСтроки(новый Структура("ЛицевойСчет",НаименованиеЛС));
		
		Если МассивСтрок.Количество() = 0 тогда	 
			
			мСтруктураСчетовЖКХ  = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Клиент.Организация,КонецМесяца(Клиент.Дата));
			НоваяСтрока = Объект.СписокЛС.добавить();
			НоваяСтрока.ЛицевойСчет = НаименованиеЛС;
			НоваяСтрока.ШаблонИзвещений = КодШаблона;
			НоваяСтрока.Сумма = СуммаЦелых;
			НоваяСтрока.СчетАбонента = мСтруктураСчетовЖКХ.СчетАбонента;
			СтрокаСубконта = НоваяСтрока.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета, "ВидСубконто");
			Если Не СтрокаСубконта = Неопределено тогда
				НоваяСтрока["Субконто"+СтрокаСубконта.НомерСтроки] = НоваяСтрока.ЛицевойСчет;
			КонецЕсли;	
			НоваяСтрока.СчетКУ = мСтруктураСчетовЖКХ.ТранзитныйСчетОплаты;
			
		КонецЕсли;	 
		
		Возврат Результат;
		
	ИначеЕсли ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ЧекККМ") Тогда
		
		Объект.ЛицевойСчет     = НаименованиеЛС;
		Объект.ШаблонИзвещений = КодШаблона;
		Объект.СуммаОплаты     = СуммаЦелых;
		Объект.ШтрихКОд        = ШК;
		
		Возврат Результат;
		
	ИначеЕсли ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_РазовыеПоУслугамЖКХ") Тогда
		
		Клиент.ЧекККМ = ЧекККМ;
		
		Возврат Результат;
		
	КонецЕсли; 
	
КонецФункции

// Функция разбора штрих кода.
//
&НаСервере
Функция бит_РазберемШтрихКодИД(ШК)
	
	Рез = Новый Структура("НаименованиеЛС, КодШаблона, СуммаЦелых");
	СтрокаСумма = Лев(ШК,40);
	
	Если СтрДлина(ШК) > 43 Тогда
		
		СтрокаСумма = Сред(ШК,6,40);
		
	КонецЕсли; 
	
	// Код шаблона извещения (9 символов).
	КодШаблона = "";

	Для Значение = 13 по 21 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		КодШаблона = КодШаблона + СимволСтроки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ШаблоныИзвещений.Ссылка
	|ИЗ
	|	Справочник.бит_ШаблоныИзвещений КАК бит_ШаблоныИзвещений
	|ГДЕ
	|	(бит_ШаблоныИзвещений.Код = &Код
	|			ИЛИ бит_ШаблоныИзвещений.Идентификатор = &Код)";
	Запрос.УстановитьПараметр("Код",КодШаблона);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Рез.КодШаблона = Выборка.Ссылка;	
	Иначе 
		Рез.КодШаблона = Справочники.бит_ШаблоныИзвещений.ПустаяСсылка();	
	КонецЕсли;
	
	ИД = "";
	ПерваяУжеБылаНеНоль = Ложь;
	
	Для Значение = 22 По 27 Цикл
		
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		Если СимволСтроки = "0" тогда	
			Если ПерваяУжеБылаНеНоль тогда
				ИД = ИД + СимволСтроки;
				ПерваяУжеБылаНеНоль =  Истина;
			КонецЕсли;	
		иначе	 
			ИД = ИД + СимволСтроки;
			ПерваяУжеБылаНеНоль =  Истина;
		КонецЕсли;
		
	КонецЦикла; 
	
	ИД = Число(ИД);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор",ИД);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Рез.НаименованиеЛС = Выборка.Ссылка;	
	Иначе 
		Рез.НаименованиеЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();	
	КонецЕсли;
	
	СуммаЦелых = "";
	
	// Целая часть суммы (было 13, сделали 11 символов).

	Для Значение = 28 по 38 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	СуммаЦелых = СуммаЦелых + ",";
	
	// Дробная часть суммы (два знака после запятой).
	Для Значение = 39 по 40 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	
	Рез.СуммаЦелых = Число(СуммаЦелых);
	
	возврат Рез;
	
КонецФункции

// Разберем штрих код.
&НаСервере
Функция бит_РазберемШтрихКод(ШК)
	
	Рез = Новый Структура("НаименованиеЛС, КодШаблона, СуммаЦелых");
	СтрокаСумма = Лев(ШК,34);
	
	НаименованиеЛС = "";
	ПерваяУжеБылаНеНоль = Ложь; 
	
	СтрокаРазбора = СокрЛП(Лев(СтрокаСумма,12));
	ДлинаСтроки = СтрДлина(СтрокаРазбора);
	
	СписокЛС = Новый СписокЗначений;
	
	Для Значение = 1  По 12 Цикл
		
		ЛицевойСчет = НайтиЛС(СтрокаРазбора);
		
		Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
			
			СписокЛС.Добавить(ЛицевойСчет);
			
		КонецЕсли; 
		
		Если Лев(СтрокаРазбора, 1)="0" Тогда
			ДлинаСтроки =  ДлинаСтроки - 1;
			СтрокаРазбора = СокрЛП(Прав(СтрокаРазбора,ДлинаСтроки));
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если СписокЛС.Количество() > 1 Тогда
		
		ЛС = бит_РазберемШтрихКодФрагмент(СписокЛС);
		
		Рез.НаименованиеЛС = ЛС.Значение
		
	ИначеЕсли СписокЛС.Количество() > 0 Тогда 
		
		Рез.НаименованиеЛС = СписокЛС[0].Значение;
		
	КонецЕсли; 
	
	// Код шаблона извещения (9 символов).
	КодШаблона = "";

	Для Значение = 13 по 21 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		КодШаблона = КодШаблона + СимволСтроки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ШаблоныИзвещений.Ссылка
	|ИЗ
	|	Справочник.бит_ШаблоныИзвещений КАК бит_ШаблоныИзвещений
	|ГДЕ
	|	(бит_ШаблоныИзвещений.Код = &Код
	|			ИЛИ бит_ШаблоныИзвещений.Идентификатор = &Код)";
	Запрос.УстановитьПараметр("Код",КодШаблона);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Рез.КодШаблона = Выборка.Ссылка;	
	Иначе 
		Рез.КодШаблона = Справочники.бит_ШаблоныИзвещений.ПустаяСсылка();	
	КонецЕсли;
	
	СуммаЦелых = "";
	
	// Целая часть суммы (было 13, сделали 11 символов).

	Для Значение = 22 по 32 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	СуммаЦелых = СуммаЦелых + ",";
	
	// Дробная часть суммы (два знака после запятой).
	Для Значение = 33 по 34 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	
	Рез.СуммаЦелых = Число(СуммаЦелых);
	
	возврат Рез;
	
КонецФункции

&НаСервере
Функция бит_РазберемШтрихКодФрагмент(Знач СписокЛС)
	
	Перем ЛС;
	
	ЛС = СписокЛС.ВыбратьЭлемент("Пожалуйста выберете лицевой счет.");
	Возврат ЛС;
	
КонецФункции

// Функция выполняет поиск лицевойго счета в базе.
//
&НаСервере
Функция НайтиЛС(НаименованиеЛС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",НаименованиеЛС);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ЛС = Выборка.Ссылка;	
	Иначе 
		ЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат ЛС;
	
КонецФункции

&НаСервереБезКонтекста
Функция МноготарифныйНаСервере(Счетчик)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Многотарифный;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедра управляет свойствами элементов формы.
//
&НаКлиенте
Процедура УстановитьДосутпность()

	Если Объект.ВводВручную Тогда
		Элементы.Услуги.ТолькоПросмотр       = Ложь;
		Элементы.УслугиДерево.ТолькоПросмотр = Ложь;
		Элементы.НадписьИнфоОбщ.Видимость	 = Истина;
	Иначе
		Элементы.Услуги.ТолькоПросмотр       = Истина;
		Элементы.УслугиДерево.ТолькоПросмотр = Истина;
		Элементы.НадписьИнфоОбщ.Видимость	 = Ложь;
	КонецЕсли; 	
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЧекККМ.Возврат") Тогда
		
		Элементы.СуммаОплаты.Доступность              = Ложь;
		Элементы.ШаблонИзвещений.Доступность          = Ложь; 
		Элементы.ЛицевойСчет.Доступность              = Ложь;
		Элементы.СчетчикиВвестиПоказания.Доступность  = Ложь;
		Элементы.СчетчикиЗаполнить.Доступность        = Ложь;
		Элементы.ОплатаБезСдачи.Доступность           = Ложь;
		Элементы.Плательщик.Доступность               = Ложь;
		
	Иначе
		
		Элементы.СуммаОплаты.Доступность              = Истина;
		Элементы.ШаблонИзвещений.Доступность          = Истина; 
		Элементы.ЛицевойСчет.Доступность              = Истина;
		Элементы.СчетчикиВвестиПоказания.Доступность  = Истина;
		Элементы.СчетчикиЗаполнить.Доступность        = Истина;
		Элементы.ОплатаБезСдачи.Доступность           = Истина;
		Элементы.Плательщик.Доступность               = Истина;
		
	КонецЕсли; 
	
	// Активировать кнопку "ручного" режима печати чека ККМ.
	Если Объект.ЧекПробитНаККМ Тогда
		Элементы.Чек.Доступность = Ложь;
	КонецЕсли;
	
	// Активировать кнопку "ручного" режима печати чека ККМ.
	Если Объект.ЧекПробитНаККМ Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ОплатаБезСдачи.Доступность           = НЕ ЭтаФорма.ТолькоПросмотр;
	Элементы.СчетчикиЗаполнить.Доступность        = НЕ ЭтаФорма.ТолькоПросмотр;	
	Элементы.СчетчикиВвестиПоказания.Доступность  = НЕ ЭтаФорма.ТолькоПросмотр;
	
КонецПроцедуры

// Процедура выполняет учет введных ранее чеков по ЛС.
//
&НаСервере
Процедура УменьшитьСумму()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.бит_ЧекККМ"));
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияКассОбороты.Услуга,
	|	СУММА(бит_НачисленияКассОбороты.СуммаОплатыОборот) КАК СуммаОплатыОборот,
	|	СУММА(бит_НачисленияКассОбороты.СуммаПениОборот) КАК СуммаПениОборот
	|ПОМЕСТИТЬ НачисленияКасс
	|ИЗ
	|	РегистрНакопления.бит_НачисленияКасс.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			КассаККМ = &КассаККМ
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияКассОбороты
	|ГДЕ
	|	(НЕ бит_НачисленияКассОбороты.Регистратор = &ССЫЛКА)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияКассОбороты.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.Услуга,
	|	Услуги.Сумма,
	|	Услуги.СуммаПени,
	|	Услуги.Долг,
	|	Услуги.Сальдо,
	|	Услуги.Начислено,
	|	Услуги.Приоритет,
	|	Услуги.ЛицевойСчет,
	|	Услуги.ШаблонИзвещений,
	|	Услуги.СальдоПени,
	|	Услуги.СальдоНаНачало,
	|	Услуги.Факт,
	|	Услуги.НормаЛьготы,
	|	Услуги.КОплате,
	|	Услуги.СтавкаНДС
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.Услуга,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЧекККМ.Продажа)
	|			ТОГДА ЕСТЬNULL(Услуги.Сумма, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачисленияКасс.СуммаОплатыОборот > 0
	|					ТОГДА ЕСТЬNULL(Услуги.Сумма, 0) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЧекККМ.Продажа)
	|			ТОГДА ЕСТЬNULL(Услуги.СуммаПени, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачисленияКасс.СуммаПениОборот > 0
	|					ТОГДА ЕСТЬNULL(Услуги.СуммаПени, 0) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПени,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЧекККМ.Продажа)
	|			ТОГДА ЕСТЬNULL(Услуги.Долг, 0) - ЕСТЬNULL(Услуги.СуммаПени, 0) - ЕСТЬNULL(НачисленияКасс.СуммаПениОборот, 0) - ЕСТЬNULL(Услуги.Сумма, 0) - ЕСТЬNULL(НачисленияКасс.СуммаОплатыОборот, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(НачисленияКасс.СуммаОплатыОборот, 0) > 0
	|					ТОГДА ЕСТЬNULL(Услуги.Долг, 0) + ЕСТЬNULL(Услуги.СуммаПени, 0) + ЕСТЬNULL(Услуги.Сумма, 0) - ЕСТЬNULL(НачисленияКасс.СуммаПениОборот, 0) - ЕСТЬNULL(НачисленияКасс.СуммаОплатыОборот, 0)
	|				ИНАЧЕ ЕСТЬNULL(Услуги.Долг, 0)
	|			КОНЕЦ
	|	КОНЕЦ КАК Долг,
	|	Услуги.Сальдо,
	|	Услуги.Начислено,
	|	Услуги.Приоритет,
	|	Услуги.ЛицевойСчет,
	|	Услуги.ШаблонИзвещений,
	|	Услуги.СальдоПени,
	|	Услуги.СальдоНаНачало,
	|	Услуги.Факт,
	|	Услуги.НормаЛьготы,
	|	Услуги.КОплате,
	|	Услуги.СтавкаНДС
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияКасс КАК НачисленияКасс
	|		ПО Услуги.Услуга = НачисленияКасс.Услуга";
	
	Запрос.УстановитьПараметр("ДатаНач"    , НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКон"    , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("КассаККМ"   , Объект.Касса);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуги"     , ДокументОбъект.Услуги);
	Запрос.УстановитьПараметр("ВидОперации", Объект.ВидОперации);
	Запрос.УстановитьПараметр("Ссылка"     , Объект.Ссылка);
	
	//Если НЕ Запрос.Выполнить().Пустой() Тогда
	//	
	//	Результат = Запрос.Выполнить().Выгрузить();
	//	
	//	Объект.Услуги.Очистить();
	//	
	//	Объект.Услуги.Загрузить(Результат);
	//	
	//КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Объект.Услуги.Очистить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
			
			Если НЕ ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
				ТекстСообщения = НСтр("ru='Для услуги ""%1"" отсутствует ставка НДС!'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Выборка.Услуга));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			Если Объект.ДокументБезНДС Тогда
				Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				Продолжить;
			КонецЕсли;
			//
			//если Стр.СтавкаНДС = Перечисления.ВидыСтавокНДС.Общая тогда
			//	Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; 
			//конецесли;	
			// НДС.     10.01.2019
			бит_ОбщегоНазначения.РассчитатьСуммуНДСТабЧасти(Стр, Объект.СуммаВключаетНДС);
			Стр.Сумма = Стр.Сумма + ?(Объект.СуммаВключаетНДС, 0, Стр.СуммаНДС);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Ссылка, Реквизит)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);	
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСправочнуюИнформацию()
	
	СправочнаяИнформация	= ПолучитьСправочнуюИнформацию(Объект.ЛицевойСчет, Объект.Дата);
	Объект.Адрес			= СправочнаяИнформация.Адрес;
	Объект.КвартироСъемщик	= СправочнаяИнформация.КвартироСъемщик;
	мКэшЗначений.Адрес		= СправочнаяИнформация.Адрес;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура выполняет заполнения элементы формы стравочной информацией.
//
// Параметры
//
//   ЛС - СправочникСсылка.бит_ЛицевыеСчета - текущий лицевой счет.
//
Функция ПолучитьСправочнуюИнформацию(ЛС, ДатаДок)
	
	СправочнаяИнформация = Новый Структура("Адрес, Квартиросъемщик");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Запрос.УстановитьПараметр("Дата"       , ДатаДок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_СписокЗданий.ПочтовыйАдрес КАК ПочтовыйАдрес
	|ПОМЕСТИТЬ ВТ_ВсеЛС
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_Квартиросъемщик
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Дата,
	|			СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|				И СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЛС.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ВТ_ВсеЛС.Квартира КАК Квартира,
	|	ВТ_Квартиросъемщик.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	ВТ_ВсеЛС КАК ВТ_ВсеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Квартиросъемщик КАК ВТ_Квартиросъемщик
	|		ПО ВТ_ВсеЛС.ЛицевойСчет = ВТ_Квартиросъемщик.ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СправочнаяИнформация.Адрес = ?(ЗначениеЗаполнено(Выборка.ПочтовыйАдрес), Строка(Выборка.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(Выборка.Квартира), ", кв." + Строка(Выборка.Квартира),""), "");
		СправочнаяИнформация.Квартиросъемщик = Строка(Выборка.ФизЛицо);
	Иначе
		СправочнаяИнформация.Адрес = "";
		СправочнаяИнформация.Квартиросъемщик = "";
	КонецЕсли; 
	
	Возврат СправочнаяИнформация;
	
КонецФункции

#КонецОбласти