
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТарифСтавка;
		
		Если Параметры.Свойство("МакетКвитанции") Тогда
			Объект.МакетКвитанции = Параметры.МакетКвитанции;
		КонецЕсли; 
		
	КонецЕсли; 
	
	// БИТ_ЖКХ 04.03.2016 15:49:58 Начало правки...
	Элементы.СальдоКОплатеБезУчетаДолга.Доступность = Объект.СальдоКОплате;
	// БИТ_ЖКХ 04.03.2016 15:49:58 Конец правки.
	
КонецПроцедуры

// БИТ_ЖКХ 04.03.2016 15:44:09 Начало правки... 
&НаКлиенте
Процедура СальдоВТаблицеПриИзменении(Элемент)
	
	Элементы.СальдоКОплатеБезУчетаДолга.Доступность = Объект.СальдоКОплате;
	
	Если Объект.СальдоКОплате = Ложь Тогда
		Объект.СальдоКОплатеБезУчетаДолга = Ложь;
	КонецЕсли;

КонецПроцедуры
// БИТ_ЖКХ 04.03.2016 15:44:14 Конец правки. 

#КонецОбласти