#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" формы.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Порядок = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОбъектаКонтактнойИнформации) И Не Отказ И Порядок = 0 Тогда
		УстановитьПорядок();
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события "ПриЗаписи" формы.
//
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ ОбменДанными.Загрузка) И (НЕ ЗначениеЗаполнено(ВидОбъектаКонтактнойИнформации) ИЛИ НЕ ЗначениеЗаполнено(Тип)) Тогда
		#Если Клиент Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПриЗаписиЗавершение", ЭтотОбъект, Новый Структура("Отказ", Отказ)), "Укажите вид и тип объекта контактной информации.");
            Возврат;
		#КонецЕсли
		
		ПриЗаписиФрагмент(Отказ);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиЗавершение(ДополнительныеПараметры) Экспорт
    
    Отказ = ДополнительныеПараметры.Отказ;
    
    ПриЗаписиФрагмент(Отказ);

КонецПроцедуры

Процедура ПриЗаписиФрагмент(Знач Отказ)
    
    Отказ = Истина;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура утановки порядка.
//
Процедура УстановитьПорядок()

	ТЗ = "ВЫБРАТЬ
	|	МАКСИМУМ(ВидыКонтактнойИнформации.Порядок) КАК Порядок
	|ИЗ
	|	Справочник.бит_ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации";
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТЗ;
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Порядок = ?(Выборка.Следующий() И Выборка.Порядок <> Null, Выборка.Порядок+1, 1);

КонецПроцедуры

#КонецОбласти

#КонецЕсли