 
#Область ПроцедурыОбработчикиСобытийФормы

 // Процедура - обработчик события "ПриСозданииНаСервере" формы.
 //
 &НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	 Для Каждого Элемент Из Параметры.Отбор Цикл
		 СписокОбязательныхОтборов.Добавить(Элемент.Ключ);
	 КонецЦикла;
	 
 КонецПроцедуры // ПриСозданииНаСервере()
 
 // БИТ_ЖКХ Процедура - обработчик события "ПриОткрытии" формы.
 //
 &НаКлиенте
 Процедура ПриОткрытии(Отказ)
	 
	 Для Каждого ИмяОтбора Из СписокОбязательныхОтборов Цикл
		 Для Каждого Элемент Из ЭтаФорма.Список.Отбор.Элементы Цикл
			 Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора) Тогда
				 Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			 КонецЕсли;
		 КонецЦикла;
	 КонецЦикла;
	 
 КонецПроцедуры
 
#КонецОбласти