
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОпераций =  Новый СписокЗначений;
	СписокОпераций.Добавить(Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания);
	СписокОпераций.Добавить("");
	
	Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВидОперации");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Эл.ПравоеЗначение   = СписокОпераций;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ПечатьФорма4(Команда)
	
	ФормаОтчета = ОткрытьФорму("Отчет.бит_ЖурналУчетаВыдачиСвидетельствРегистрации.Форма.ПоМестуПребыванияРегистрацииГражданУправляемая",,);
	
	ОтчетОбъект = ПечатьФорма4НаСервере(ФормаОтчета.ТабДок);	
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПечатьФорма4НаСервере(ТабДок)
	
	ОтчетОбъект = Отчеты.бит_ЖурналУчетаВыдачиСвидетельствРегистрации.Создать();
	
	ОтчетОбъект.ЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГражданВывести(ТабДок);
	
КонецФункции

#КонецОбласти