&НаКлиенте
Процедура ПечатьЗаявление(Команда)                                 
	Масси  =Новый Массив();
	Масси.Добавить(Элементы.Список.ТекущаяСтрока);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.бит_ИсполнительныйЛист", "ПФ_DOCX_Макет",Масси , ЭтотОбъект);    
КонецПроцедуры   

&НаСервере
Функция ПолучитьМассивОбъектовСопр()                                                                     
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	бит_ИсполнительныйЛист.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.бит_ИсполнительныйЛист КАК бит_ИсполнительныйЛист
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоИсполнительнымЛистам.СрезПоследних КАК СтатусыПоИсполнительнымЛистамСрезПоследних
	                      |		ПО СтатусыПоИсполнительнымЛистамСрезПоследних.ИсполнительныйЛист = бит_ИсполнительныйЛист.Ссылка
	                      |ГДЕ
	                      |	СтатусыПоИсполнительнымЛистамСрезПоследних.СтатусДокумента В(&СтатусДокумента)
	                      |	И бит_ИсполнительныйЛист.Дата >= &ДатаНачала
	                      |	И бит_ИсполнительныйЛист.Дата <= &ДатаОкончания");
    Запрос.УстановитьПараметр("ДатаНачала", ПериодОтбора.ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ПериодОтбора.ДатаОкончания); 
	Статусы = Новый Массив();
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВБанк); 
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВБанк); 
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВОСП); 
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВОСП); 
	Запрос.УстановитьПараметр("СтатусДокумента", Статусы);       
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции


&НаКлиенте
Процедура ПечатьСопроводительное(Команда)
	МассивОбъектов = ПолучитьМассивОбъектовСопр();
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.бит_ИсполнительныйЛист", "ПФ_DOCX_Сопроводительное", МассивОбъектов, ЭтотОбъект);
КонецПроцедуры

