
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТолькоЧисло Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СвойстваОбъектовУчета.Ссылка КАК ПВХ,
		|	бит_СвойстваОбъектовУчета.ТипЗначения
		|ИЗ
		|	ПланВидовХарактеристик.бит_СвойстваОбъектовУчета КАК бит_СвойстваОбъектовУчета";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СписокПВХ = Новый СписокЗначений;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ТипЗначения.Типы().Количество() = 1 и Выборка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
				
				СписокПВХ.Добавить(Выборка.ПВХ);
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		Отбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		Отбор.ПравоеЗначение = СписокПВХ;
		
		СписокОбязательныхОтборов.Добавить("Ссылка");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ИмяОтбора Из СписокОбязательныхОтборов Цикл
		Для Каждого Элемент Из Список.Отбор.Элементы Цикл
			Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора) Тогда
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
