
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Если Не ЗначениеЗаполнено(СхемаКомпоновкиДанных) Тогда
		СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(Отчет.ВоенныйКомиссариат) Тогда
		РезультатВыполнения = СформироватьОтчетСервер();
		Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
			бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		КонецЕсли;
	Иначе

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните поле военный комиссариат");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки(Команда)
	
	Если  	Элементы.СкрытьНастройки.Пометка = Ложь Тогда
		Элементы.СкрытьНастройки.Пометка = Истина;
		Элементы.СкрытьНастройки.Заголовок = "Показать настройки";
		Элементы.Настройки.Видимость = Ложь;
	Иначе
		Элементы.СкрытьНастройки.Пометка = Ложь;
		Элементы.СкрытьНастройки.Заголовок = "Скрыть настройки";
		Элементы.Настройки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция СформироватьОтчетСервер()
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	ОбъектОтчет.СформироватьОтчет(Результат, ДанныеРасшифровки, СхемаКомпоновкиДанных, Истина, АдресХранилища);

	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанныеНаСервере();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанныеНаСервере()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		
КонецПроцедуры

#КонецОбласти