#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбеспечениеПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Льгота";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	РеквизитыТабСписокУслуг = "Услуга,Распространение"; // Через запятую.
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокУслуг", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
КонецПроцедуры // ПроверкаРеквизитов()

// Процедура проверяет добли строк.
//
Процедура ПроверитьДублиУслуг(ТаблицаПоУслугам, Отказ, Заголовок)
	
	ТаблицаДублей = ТаблицаПоУслугам.Скопировать();
	
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1, "КоличествоПовторений");
	ТаблицаДублей.Свернуть("Услуга", "КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке.
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		// ТаблицаПоЦБ.Индексы.Добавить("Контрагент");.
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			МассивСтрок = ТаблицаПоУслугам.НайтиСтроки(Новый Структура("Услуга", СтрокаТаблицыДублей.Услуга));
			
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""Услуга"" указаны одни и те же.";
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
	
	
КонецПроцедуры

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам,Отказ, Заголовок)
	
	ДатаДока = Дата;
	УстановкаЛьготУслуг = Движения.бит_УстановкаЛьгот;
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		
		Движение = УстановкаЛьготУслуг.Добавить();
		
		Движение.Период                     = ДатаДока;
		Движение.Льгота                     = СтруктураШапкиДокумента.Льгота;
		Движение.Услуга                     = СтрокаТЧ.Услуга;
		Движение.Распространение            = СтрокаТЧ.Распространение;
		Движение.СемейнаяСтавка             = СтрокаТЧ.СемейнаяСтавка;
		Движение.ЛичнаяСтавка               = СтрокаТЧ.ЛичнаяСтавка;
		Движение.ИспользоватьНормуНаОдного  = СтрокаТЧ.ИспользоватьНормуНаОдного;
		Движение.РасчетСУчетомДолейВладения = СтрокаТЧ.РасчетСУчетомДолейВладения;
		Движение.РасчетСУчетомСоставаСемьи  = СтрокаТЧ.РасчетСУчетомСоставаСемьи;
		Движение.ФактическоеПотреблениеПоСчетчикамБезУчетаВременноПроживающих  = СтрокаТЧ.ФактическоеПотреблениеПоСчетчикамБезУчетаВременноПроживающих;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Услуга"                    ,"Услуга");
	СтруктураПолей.Вставить("ЛичнаяСтавка"              ,"ЛичнаяСтавка");
	СтруктураПолей.Вставить("СемейнаяСтавка"            ,"СемейнаяСтавка");
	СтруктураПолей.Вставить("Распространение"           ,"Распространение");
	СтруктураПолей.Вставить("ИспользоватьНормуНаОдного" ,"ИспользоватьНормуНаОдного");
	СтруктураПолей.Вставить("РасчетСУчетомДолейВладения","РасчетСУчетомДолейВладения");
	СтруктураПолей.Вставить("РасчетСУчетомСоставаСемьи" ,"РасчетСУчетомСоставаСемьи");
	
	СтруктураПолей.Вставить("ФактическоеПотреблениеПоСчетчикамБезУчетаВременноПроживающих",
	"ФактическоеПотреблениеПоСчетчикамБезУчетаВременноПроживающих");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокУслуг", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоУслугам, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	ПроверитьДублиУслуг(ТаблицаПоУслугам, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события "ОбработкаЗаполнения" документа.
//
Процедура ОбработкаЗаполнения(Основание)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры // ОбработкаЗаполнения()

#КонецОбласти

#КонецЕсли