#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьДеревоПомеченныхНаУдалениеВФоне(Параметры, АдресРезультата) Экспорт
	
	СписокСправочников = Новый Массив;
	СписокСправочников.Добавить("БанковскиеКартыКонтрагентов");
	СписокСправочников.Добавить("БанковскиеСчета");
	СписокСправочников.Добавить("Билеты");
	СписокСправочников.Добавить("БланкиСтрогойОтчетности");
	СписокСправочников.Добавить("ВидыВзаиморасчетов");
	СписокСправочников.Добавить("ВидыНалоговИПлатежейВБюджет");
	СписокСправочников.Добавить("ВидыНоменклатуры");
	СписокСправочников.Добавить("ВидыОплатОрганизаций");
	СписокСправочников.Добавить("ГодовыеГрафикиАмортизацииОС");
	СписокСправочников.Добавить("ГосКонтракты");
	СписокСправочников.Добавить("ДоговорыКонтрагентов");
	СписокСправочников.Добавить("Должности");
	СписокСправочников.Добавить("ДополнительныеУсловия");
	СписокСправочников.Добавить("ДоходыБудущихПериодов");
	СписокСправочников.Добавить("ЗарплатныеПроекты");
	СписокСправочников.Добавить("КонтактныеЛица");
	СписокСправочников.Добавить("Контрагенты");
	СписокСправочников.Добавить("НаправленияИспользованияПрибыли");
	СписокСправочников.Добавить("Номенклатура");
	СписокСправочников.Добавить("НоменклатурныеГруппы");
	СписокСправочников.Добавить("НомераГТД");
	СписокСправочников.Добавить("ОбъектыСтроительства");
	СписокСправочников.Добавить("ОснованияПраваПодписи");
	СписокСправочников.Добавить("ОсновныеСредства");
	СписокСправочников.Добавить("ПараметрыВыработкиОС");
	СписокСправочников.Добавить("ПараметрыТиповойОперации");
	СписокСправочников.Добавить("Патенты");
	СписокСправочников.Добавить("ПодразделенияОрганизаций");
	СписокСправочников.Добавить("ПравилаФинОтчетности");
	СписокСправочников.Добавить("ПричиныСписанияОС");
	СписокСправочников.Добавить("ПрочиеДоходыИРасходы");
	СписокСправочников.Добавить("РасходыБудущихПериодов");
	СписокСправочников.Добавить("Склады");
	СписокСправочников.Добавить("СобытияОС");
	СписокСправочников.Добавить("Сотрудники");
	СписокСправочников.Добавить("СпособыОтраженияЗарплатыВБухУчете");
	СписокСправочников.Добавить("СпособыОтраженияРасходовПоАмортизации");
	СписокСправочников.Добавить("СтатьиДвиженияДенежныхСредств");
	СписокСправочников.Добавить("СтатьиЗатрат");
	СписокСправочников.Добавить("ТиповыеОперации");
	СписокСправочников.Добавить("ТипыЦенНоменклатуры");
	СписокСправочников.Добавить("ТорговыеТочки");
	СписокСправочников.Добавить("ТранспортныеСредства");
	СписокСправочников.Добавить("ФизическиеЛица");
	СписокСправочников.Добавить("ЦелиРасходаМатериалов");
	СписокСправочников.Добавить("ЦенныеБумаги");
	СписокСправочников.Добавить("ШаблоныДоговоров");
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить("АвансовыйОтчет");
	СписокДокументов.Добавить("АвансовыйПлатежИностранцаПоНДФЛ");
	СписокДокументов.Добавить("АктПроверкиСтраховыхВзносов");
	СписокДокументов.Добавить("АктСверкиВзаиморасчетов");
	СписокДокументов.Добавить("БольничныйЛист");
	СписокДокументов.Добавить("ВводНачальныхОстатков");
	СписокДокументов.Добавить("ВедомостьНаВыплатуЗарплаты");
	СписокДокументов.Добавить("ВедомостьНаВыплатуЗарплатыВБанк");
	СписокДокументов.Добавить("ВедомостьНаВыплатуЗарплатыВКассу");
	СписокДокументов.Добавить("ВедомостьУплатыАДВ_11");
	СписокДокументов.Добавить("ВозвратНДФЛ");
	СписокДокументов.Добавить("ВозвратОСОтАрендатора");
	СписокДокументов.Добавить("ВозвратТоваровОтПокупателя");
	СписокДокументов.Добавить("ВозвратТоваровПоставщику");
	СписокДокументов.Добавить("ВыкупПредметовЛизинга");
	СписокДокументов.Добавить("ВыработкаОС");
	СписокДокументов.Добавить("ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР");
	СписокДокументов.Добавить("ДепонированиеЗарплаты");
	СписокДокументов.Добавить("Доверенность");
	СписокДокументов.Добавить("ДоговорРаботыУслуги");
	СписокДокументов.Добавить("ДокументРасчетовСКонтрагентом");
	СписокДокументов.Добавить("ЗаписьКнигиУчетаДоходовИРасходовИП");
	СписокДокументов.Добавить("ЗаписьКУДиР");
	СписокДокументов.Добавить("ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников");
	СписокДокументов.Добавить("ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов");
	СписокДокументов.Добавить("ЗаявлениеВФССОВозмещенииРасходовНаПогребение");
	СписокДокументов.Добавить("ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ");
	СписокДокументов.Добавить("ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ");
	СписокДокументов.Добавить("ЗаявлениеСотрудникаНаВыплатуПособия");
	СписокДокументов.Добавить("ИзменениеГрафиковАмортизацииОС");
	СписокДокументов.Добавить("ИзменениеОтраженияРасходовПоЛизинговымПлатежамОС");
	СписокДокументов.Добавить("ИзменениеПараметровНачисленияАмортизацииОС");
	СписокДокументов.Добавить("ИзменениеСостоянияОС");
	СписокДокументов.Добавить("ИзменениеСпециальногоКоэффициентаОС");
	СписокДокументов.Добавить("ИзменениеСпособовОтраженияРасходовПоАмортизацииОС");
	СписокДокументов.Добавить("ИнвентаризацияОС");
	СписокДокументов.Добавить("ИнвентаризацияРасчетовСКонтрагентами");
	СписокДокументов.Добавить("ИнвентаризацияТоваровНаСкладе");
	СписокДокументов.Добавить("ИсполнительныйЛист");
	СписокДокументов.Добавить("ИсходящаяСправкаОЗаработкеДляРасчетаПособий");
	СписокДокументов.Добавить("КадровыйПеревод");
	СписокДокументов.Добавить("КорректировкаДолга");
	СписокДокументов.Добавить("КорректировкаПоступления");
	СписокДокументов.Добавить("КорректировкаРеализации");
	СписокДокументов.Добавить("МодернизацияОС");
	СписокДокументов.Добавить("НачислениеДивидендов");
	СписокДокументов.Добавить("НачислениеЗарплаты");
	СписокДокументов.Добавить("НачислениеНДСпоСМРхозспособом");
	СписокДокументов.Добавить("НачислениеОценочныхОбязательствПоОтпускам");
	СписокДокументов.Добавить("НачислениеПеней");
	СписокДокументов.Добавить("ОбесценениеЗапасов");
	СписокДокументов.Добавить("ОперацияБух");
	СписокДокументов.Добавить("ОперацияНалоговогоУчетаПоНДФЛ");
	СписокДокументов.Добавить("ОперацияУчетаПоСтраховымВзносам");
	СписокДокументов.Добавить("ОписьЗаявленийСотрудниковНаВыплатуПособий");
	СписокДокументов.Добавить("ОписьОДВ_1");
	СписокДокументов.Добавить("ОписьПачекСЗВ_6");
	СписокДокументов.Добавить("ОплатаПлатежнойКартой");
	СписокДокументов.Добавить("ОприходованиеТоваров");
	СписокДокументов.Добавить("Отпуск");
	СписокДокументов.Добавить("ОтпускБезСохраненияОплаты");
	СписокДокументов.Добавить("ОтражениеНачисленияНДС");
	СписокДокументов.Добавить("ОтражениеНДСКВычету");
	СписокДокументов.Добавить("ОтчетОператораСистемыПлатон");
	СписокДокументов.Добавить("ОтчетОРозничныхПродажах");
	СписокДокументов.Добавить("Партия");
	СписокДокументов.Добавить("ПачкаДокументовАДВ_1");
	СписокДокументов.Добавить("ПачкаДокументовАДВ_2");
	СписокДокументов.Добавить("ПачкаДокументовАДВ_3");
	СписокДокументов.Добавить("ПачкаДокументовДСВ_1");
	СписокДокументов.Добавить("ПачкаДокументовСЗВ_6_1");
	СписокДокументов.Добавить("ПачкаДокументовСЗВ_6_3");
	СписокДокументов.Добавить("ПачкаДокументовСЗВ_6_4");
	СписокДокументов.Добавить("ПачкаДокументовСЗВ_К");
	СписокДокументов.Добавить("ПачкаДокументовСПВ_1");
	СписокДокументов.Добавить("ПачкаДокументовСПВ_2");
	СписокДокументов.Добавить("ПачкаРазделов6РасчетаРСВ_1");
	СписокДокументов.Добавить("ПередачаОборудованияВМонтаж");
	СписокДокументов.Добавить("ПередачаОС");
	СписокДокументов.Добавить("ПередачаОСВАренду");
	СписокДокументов.Добавить("ПередачаТоваров");
	СписокДокументов.Добавить("ПеремещениеОС");
	СписокДокументов.Добавить("ПеремещениеТоваров");
	СписокДокументов.Добавить("ПерерасчетНДФЛ");
	СписокДокументов.Добавить("ПерерасчетСтраховыхВзносов");
	СписокДокументов.Добавить("ПлатежноеПоручение");
	СписокДокументов.Добавить("ПодготовкаКПередачеОС");
	СписокДокументов.Добавить("ПоступлениеВЛизинг");
	СписокДокументов.Добавить("ПоступлениеДопРасходов");
	СписокДокументов.Добавить("ПоступлениеНаРасчетныйСчет");
	СписокДокументов.Добавить("ПоступлениеТоваровУслуг");
	СписокДокументов.Добавить("ПрекращениеСтандартныхВычетовНДФЛ");
	СписокДокументов.Добавить("ПриемНаРаботу");
	СписокДокументов.Добавить("ПринятиеКУчетуОС");
	СписокДокументов.Добавить("ПриходныйКассовыйОрдер");
	СписокДокументов.Добавить("ПутевойЛист");
	СписокДокументов.Добавить("РасходныйКассовыйОрдер");
	СписокДокументов.Добавить("РасходыНаОнлайнКассыУменьшающиеНалоги");
	СписокДокументов.Добавить("РасходыПредпринимателя");
	СписокДокументов.Добавить("РеализацияТоваровУслуг");
	СписокДокументов.Добавить("РегистрацияОплатыОсновныхСредствДляИП");
	СписокДокументов.Добавить("РегистрацияОплатыОсновныхСредствДляУСН");
	СписокДокументов.Добавить("РегистрацияСуммыУбыткаУСН");
	СписокДокументов.Добавить("РегистрУчета");
	СписокДокументов.Добавить("РегламентнаяОперация");
	СписокДокументов.Добавить("РеестрДСВ_3");
	СписокДокументов.Добавить("РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий");
	СписокДокументов.Добавить("РеестрСЗВ_6_2");
	СписокДокументов.Добавить("РозничнаяПродажа");
	СписокДокументов.Добавить("СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ");
	СписокДокументов.Добавить("СведенияОЗастрахованныхЛицахСЗВ_М");
	СписокДокументов.Добавить("СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ");
	СписокДокументов.Добавить("СписаниеДепонированнойЗарплаты");
	СписокДокументов.Добавить("СписаниеНДС");
	СписокДокументов.Добавить("СписаниеОС");
	СписокДокументов.Добавить("СписаниеСРасчетногоСчета");
	СписокДокументов.Добавить("СписаниеТоваров");
	СписокДокументов.Добавить("СправкаНДФЛ");
	СписокДокументов.Добавить("СправкиНДФЛДляПередачиВНалоговыйОрган");
	СписокДокументов.Добавить("СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль");
	СписокДокументов.Добавить("СчетНаОплатуПокупателю");
	СписокДокументов.Добавить("СчетНаОплатуПоставщика");
	СписокДокументов.Добавить("СчетФактураВыданный");
	СписокДокументов.Добавить("СчетФактураПолученный");
	СписокДокументов.Добавить("ТребованиеНакладная");
	СписокДокументов.Добавить("УведомлениеОПравеНаИмущественныйВычетДляНДФЛ");
	СписокДокументов.Добавить("УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком");
	СписокДокументов.Добавить("Увольнение");
	СписокДокументов.Добавить("УстановкаЦенНоменклатуры");
	СписокДокументов.Добавить("ФормированиеЗаписейКнигиПокупок");
	СписокДокументов.Добавить("ФормированиеЗаписейКнигиПродаж");
	СписокДокументов.Добавить("ФормированиеУставногоКапитала");
	СписокДокументов.Добавить("ФормированиеУставногоКапитала");
	
	КодПиктограммыСправочник = 4;
	КодПиктограммыДокумент = 13;
	
	ТекстЗапроса = "";
	
	Для каждого ИмяОбъекта Из СписокСправочников Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени("Справочник." + ИмяОбъекта);
		Если МетаданныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПредставлениеОбъекта = МетаданныеОбъекта.Представление();
		ЕстьГруппы = МетаданныеОбъекта.Иерархический
			И МетаданныеОбъекта.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;
		
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + СтрШаблон("ВЫБРАТЬ" + ?(ПустаяСтрока(ТекстЗапроса), " РАЗРЕШЕННЫЕ", "") + "
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(%1.Ссылка) КАК Представление,
		|	%1.Ссылка КАК Ссылка,
		|	%2 КАК НомерКартинки,
		|	""%3"" КАК ВидОбъекта
		|ИЗ
		|	Справочник.%1 КАК %1
		|ГДЕ
		|	%1.ПометкаУдаления" + ?(ЕстьГруппы, " И НЕ %1.ЭтоГруппа", ""),
		ИмяОбъекта, КодПиктограммыСправочник, СтрЗаменить(ПредставлениеОбъекта, """", """"""));
	КонецЦикла;
	
	Для каждого ИмяОбъекта Из СписокДокументов Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени("Документ." + ИмяОбъекта);
		Если МетаданныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПредставлениеОбъекта = МетаданныеОбъекта.Представление();
		
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + СтрШаблон("ВЫБРАТЬ ПРЕДСТАВЛЕНИЕССЫЛКИ(%1.Ссылка) КАК Представление,
		|	%1.Ссылка КАК Ссылка,
		|	%2 КАК НомерКартинки,
		|	""%3"" КАК ВидОбъекта
		|ИЗ
		|	Документ.%1 КАК %1
		|ГДЕ
		|	%1.ПометкаУдаления",
		ИмяОбъекта, КодПиктограммыСправочник, СтрЗаменить(ПредставлениеОбъекта, """", """"""));
	КонецЦикла;
	
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИТОГИ ПО
	|	ВидОбъекта";
	
 	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для каждого Строка Из Дерево.Строки Цикл
		Строка.Представление = СтрШаблон("%1 (%2)", Строка.ВидОбъекта, Строка.Строки.Количество());
	КонецЦикла;
	Дерево.Строки.Сортировать("Представление", Истина);
	
	ПоместитьВоВременноеХранилище(Дерево, АдресРезультата);
	
КонецПроцедуры

Функция СсылкиКаналаБизнесСтарт() Экспорт
	
	ТаблицаСсылок = НоваяТаблицаСсылок();
	ДобавитьСсылку("intro", НСтр("ru = 'Введение в программу 1С:БизнесСтарт'"), ТаблицаСсылок);
	ДобавитьСсылку("depositingip", НСтр("ru = 'Начало работы в программе. Взнос денег на счет ИП'"), ТаблицаСсылок);
	ДобавитьСсылку("goodsandpartners", НСтр("ru = 'Учет товара. Поступление товаров. Информация о контрагентах'"), ТаблицаСсылок);
	ДобавитьСсылку("cashregister", НСтр("ru = 'Онлайн-касса'"), ТаблицаСсылок);
	ДобавитьСсылку("sellingforcashusnd", НСтр("ru = 'Продажа покупателю юридическому лицу за наличный расчет'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("retailusnd", НСтр("ru = 'Розничные продажи'"), ТаблицаСсылок);
	ДобавитьСсылку("creditcardsusnd", НСтр("ru = 'Прием оплаты платежными картами'"), ТаблицаСсылок);
	ДобавитьСсылку("suppliers", НСтр("ru = 'Договор с поставщиком. Досье контрагента. Загрузка прайс-листа. Поступление товаров безнал'"), ТаблицаСсылок);
	ДобавитьСсылку("invoicingusnd", НСтр("ru = 'Продажа покупателю за безналичный расчет'"), ТаблицаСсылок);
	ДобавитьСсылку("banking", НСтр("ru = 'Работа с банком'"), ТаблицаСсылок);
	ДобавитьСсылку("outsourcingusnd", НСтр("ru = 'Расходы на аутсорсинг'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("businesstrip", НСтр("ru = 'Оформление командировочных расходов'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("taxreturnusnd", НСтр("ru = 'Отчетность УСН'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("incomebookusnd", НСтр("ru = 'Книга учета доходов и расходов УСН «доходы»'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("insurancefee", НСтр("ru = 'Страховые взносы ИП за себя'"), ТаблицаСсылок, Ложь);
	
	МассивПодстрок = Новый Массив;
	
	Для НомерСтроки = 1 По ТаблицаСсылок.Количество() Цикл
		СвойстваСсылки = ТаблицаСсылок[НомерСтроки - 1];
		Если СвойстваСсылки.Используется Тогда
			МассивПодстрок.Добавить(Формат(НомерСтроки, "ЧГ=0"));
			МассивПодстрок.Добавить(". ");
			МассивПодстрок.Добавить(Новый ФорматированнаяСтрока(СвойстваСсылки.Представление, , , , СвойстваСсылки.Ссылка));
			МассивПодстрок.Добавить(Символы.ПС);
			МассивПодстрок.Добавить(" ");
			МассивПодстрок.Добавить(Символы.ПС);
		КонецЕсли;
	КонецЦикла;
	
	МассивПодстрок.Добавить(СсылкаНаКаналБизнесСтарт());
	
	Возврат Новый ФорматированнаяСтрока(МассивПодстрок);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяТаблицаСсылок()
	
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаСсылок.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСсылок.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаСсылок;
	
КонецФункции

Функция ДобавитьСсылку(Идентификатор, Представление, ТаблицаСсылок, Используется = Истина)
	
	ШаблонСсылок = "http://its.1c.ru/bmk/youtube/bs/%1";
	
	СвойстваСсылки = ТаблицаСсылок.Добавить();
	СвойстваСсылки.Ссылка = СтрШаблон(ШаблонСсылок, Идентификатор);
	СвойстваСсылки.Представление = Представление;
	СвойстваСсылки.Используется = Используется;
	
	Возврат СвойстваСсылки;
	
КонецФункции

Функция СсылкаНаКаналБизнесСтарт()
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Посмотрите канал <a href=""http://its.1c.ru/bmk/youtube/bs/channel"">Онлайн-бухгалтерия 1С:БизнесСтарт</a>'"));
	
КонецФункции

#КонецОбласти

#КонецЕсли