
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТаблицыРасшифровкиВХранилище") Тогда
		
		ТаблицаРасшифровкиИзФормыРасшифровкиКоличестваЕдиниц  = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыРасшифровкиВХранилище);
		
		СдвинутьКолонкиТаблицыРасшифровки(ТаблицаРасшифровкиИзФормыРасшифровкиКоличестваЕдиниц);
		
		ТаблицаНужныхКолонок = СформироватьТаблицуНужныхКолонок();
		
		ВывестиТаблицуНаФорму(ЭтаФорма, "РасшифровкаЕдиниц", ТаблицаРасшифровкиИзФормыРасшифровкиКоличестваЕдиниц, Неопределено, ТаблицаНужныхКолонок); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ВывестиТаблицуНаФорму(УФ, ИмяТЗНаФорме, ТЗ, ТЗОбработчиковСобытий = Неопределено, ТаблицаНужныхКолонок)
    
    // СОЗДАНИЕ РЕКВИЗИТОВ ФОРМЫ.
    МассивДобавляемыхРеквизитов = Новый Массив; 
    
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		
        МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТЗНаФорме, Колонка.Заголовок));
		
    КонецЦикла; 
    
    МассивУдаляемыхРеквизитов = УФ.ПолучитьРеквизиты(ИмяТЗНаФорме);
	
    МассивИменУдаляемыхРеквизитов = Новый Массив;
    
	Для каждого Элемент Из МассивУдаляемыхРеквизитов Цикл
		
        МассивИменУдаляемыхРеквизитов.Добавить(ИмяТЗНаФорме + "." + Элемент.Имя);
		
    КонецЦикла; 
    
    УФ.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивИменУдаляемыхРеквизитов); 
    
    // СОЗДАНИЕ ЭЛЕМЕНТОВ ФОРМЫ.
	Для каждого Элемент Из МассивУдаляемыхРеквизитов Цикл
		
        УдаляемыйЭлемент = УФ.Элементы.Найти(ИмяТЗНаФорме + Элемент.Имя);
		
        УФ.Элементы.Удалить(УдаляемыйЭлемент);
		
    КонецЦикла; 
    
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		
        НоваяКолонка = УФ.Элементы.Добавить(ИмяТЗНаФорме + Колонка.Имя, Тип("ПолеФормы"), УФ.Элементы[ИмяТЗНаФорме]);
		
		НоваяКолонка.Вид                 = ВидПоляФормы.ПолеВвода; 
        НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Имя", Колонка.Имя);
		
		МассивСтрок = ТаблицаНужныхКолонок.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			НоваяКолонка.Заголовок   = МассивСтрок[0].Заголовок; 
            НоваяКолонка.ПутьКДанным = МассивСтрок[0].ПутьКДанным;
			НоваяКолонка.Видимость   = Истина;
			
			Если МассивСтрок[0].Итого Тогда
				
				НоваяКолонка.ОтображатьВПодвале = Истина;
				
				Если Колонка.ТипЗначения.КвалификаторыЧисла.Разрядность > 0 Тогда
					
					ТекстЧисла = "ЧЦ=" + Строка(Колонка.ТипЗначения.КвалификаторыЧисла.Разрядность) +
					             "; ЧДЦ=" + Строка(Колонка.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти);
				
					НоваяКолонка.ТекстПодвала                    = Формат(ТЗ.Итог(Колонка.Имя), ТекстЧисла);
					НоваяКолонка.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
					
				Иначе
					
					НоваяКолонка.ТекстПодвала = "Итого:";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если МассивСтрок[0].Жирный Тогда
				
				НоваяКолонка.Шрифт = Новый Шрифт("Шрифт диалогов и меню", 8, Истина);
				
			КонецЕсли;
			
		Иначе
			
			НоваяКолонка.Заголовок   = Колонка.Заголовок; 
            НоваяКолонка.ПутьКДанным = ИмяТЗНаФорме + "." + Колонка.Имя;
			НоваяКолонка.Видимость   = Ложь;
			
		КонецЕсли;
		
    КонецЦикла;     
    
    УФ[ИмяТЗНаФорме].Загрузить(ТЗ);
    
    // Привязка обработчиков событий.
	Если ТЗОбработчиковСобытий = Неопределено Тогда
		
        Возврат;
		
    КонецЕсли;    
    
	Для Каждого Строка Из ТЗОбработчиковСобытий Цикл
		
        УФ.Элементы[Строка.ИмяЭлемента].УстановитьДействие(Строка.ИмяСобытия, Строка.ИмяЭлемента + Строка.ИмяСобытия);
		
    КонецЦикла;    
    
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуНужныхКолонок()
	
	ТаблицаНужныхКолонок = Новый ТаблицаЗначений;
	
	ТаблицаНужныхКолонок.Колонки.Добавить("Имя");
	ТаблицаНужныхКолонок.Колонки.Добавить("Заголовок");
	ТаблицаНужныхКолонок.Колонки.Добавить("ПутьКДанным");
	ТаблицаНужныхКолонок.Колонки.Добавить("Итого");
	ТаблицаНужныхКолонок.Колонки.Добавить("Жирный");
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "Счетчик";
	НоваяСтрока.Заголовок   = "Счетчик";
	НоваяСтрока.ПутьКДанным = "РасшифровкаЕдиниц.Счетчик";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "КоличествоЕдиниц";
	НоваяСтрока.Заголовок   = "Кол. ед. по счетчику";
	НоваяСтрока.ПутьКДанным = "РасшифровкаЕдиниц.КоличествоЕдиниц";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "ДоляПоЛС";
	НоваяСтрока.Заголовок   = "Кол.ед.по ЛС";
	НоваяСтрока.ПутьКДанным = "РасшифровкаЕдиниц.ДоляПоЛС";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "Ставка";
	НоваяСтрока.Заголовок   = "Ставка на ЛС";
	НоваяСтрока.ПутьКДанным = "РасшифровкаЕдиниц.Ставка";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "Доля";
	НоваяСтрока.Заголовок   = "Кол.ед.по всем ЛС";
	НоваяСтрока.ПутьКДанным = "РасшифровкаЕдиниц.Доля";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Ложь;
	
	НоваяСтрока = ТаблицаНужныхКолонок.Добавить();
	
	НоваяСтрока.Имя         = "КоличествоЕдиницПоЛС";
	НоваяСтрока.Заголовок   = "Доля от группового";
	НоваяСтрока.ПутьКДанным = "РасшифровкаЕдиниц.КоличествоЕдиницПоЛС";
	НоваяСтрока.Итого       = Ложь;
	НоваяСтрока.Жирный      = Истина;
	
	Возврат ТаблицаНужныхКолонок;
	
КонецФункции

&НаСервере
Процедура СдвинутьКолонкиТаблицыРасшифровки(ТаблицаЗначений)
		
	Колонка = ТаблицаЗначений.Колонки["Счетчик"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка));
	
	Колонка = ТаблицаЗначений.Колонки["КоличествоЕдиниц"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 1);
	
	Колонка = ТаблицаЗначений.Колонки["ДоляПоЛС"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 2);
	
	Колонка = ТаблицаЗначений.Колонки["Ставка"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 3);
	
	Колонка = ТаблицаЗначений.Колонки["Доля"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 4);

	Колонка = ТаблицаЗначений.Колонки["КоличествоЕдиницПоЛС"];
	
	ТаблицаЗначений.Колонки.Сдвинуть(Колонка, -ТаблицаЗначений.Колонки.Индекс(Колонка) + 5);

КонецПроцедуры

#КонецОбласти