
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	
	ОтборИВыборПоВладельцу();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура уставноки отбора.
//                                                 
&НаКлиенте
Процедура ОтборИВыборПоВладельцу()
	
	Список.Отбор.Элементы.Очистить();
	
	Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = ПодразделениеОрганизации;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры

#КонецОбласти