
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр бит_СтавкиВознагражденияПредседателюМКД
	Движения.бит_СтавкиВознагражденияПредседателюМКД.Записывать = Истина;
	Для Каждого ТекСтрокаСтавки Из Ставки Цикл
		Движение = Движения.бит_СтавкиВознагражденияПредседателюМКД.Добавить();
		Движение.Период = НачалоМесяца(Дата);
		Движение.Здание = ТекСтрокаСтавки.Здание;
		Движение.Ставка = ТекСтрокаСтавки.Ставка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
