
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МестоРожденияСтрокой") Тогда
		
		МестоРожденияСтрокой = Параметры.МестоРожденияСтрокой;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		
		ЗаголовокФормы = Параметры.ЗаголовокФормы;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Устанавливаем заголовок формы.
	Заголовок = ЗаголовокФормы;

	// Выполняем разбор места рождения из строки, используем нижний регистр для представления и верхний регистр для документов.
		
	СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(МестоРожденияСтрокой, Ложь);
		
	Особое  = СтруктураМестоРождения.Особое;
	Город   = СтруктураМестоРождения.НаселенныйПункт;
	Село    = СтруктураМестоРождения.Село;
	Район   = СтруктураМестоРождения.Район;
	Область = СтруктураМестоРождения.Область;
	Страна  = СтруктураМестоРождения.Страна;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Если мРезультатДиалога = "Нет" тогда
		
	ИначеЕсли мРезультатДиалога <> "Отмена" тогда

		МестоРожденияСтрокойПослеРедактирования = "" + СокрЛП(Особое) + "," + СокрЛП(Город) + "," + СокрЛП(Район) + "," + СокрЛП(Область) + "," + СокрЛП(Страна) + "," + СокрЛП(Село);

		Если СокрЛП(МестоРожденияСтрокой) <> СокрЛП(МестоРожденияСтрокойПослеРедактирования) тогда

			Если мРезультатДиалога <> "ОК" тогда

				Отказ = Истина;
				
				РезультатВопроса = Неопределено;
				
				ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, Новый Структура("МестоРожденияСтрокойПослеРедактирования", МестоРожденияСтрокойПослеРедактирования)), "Данные о месте рождения изменены. Сохранить?", РежимДиалогаВопрос.ДаНетОтмена);
                Возврат;

			КонецЕсли;

			ПередЗакрытиемФрагмент(МестоРожденияСтрокойПослеРедактирования);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса1, ДополнительныеПараметры) Экспорт
    
    МестоРожденияСтрокойПослеРедактирования = ДополнительныеПараметры.МестоРожденияСтрокойПослеРедактирования;
    
    РезультатВопроса = РезультатВопроса1;
    
	Если РезультатВопроса=КодВозвратаДиалога.Нет тогда
		
        мРезультатДиалога = "Нет";
		
		ЭтаФорма.Закрыть();
        
    ИначеЕсли РезультатВопроса=КодВозвратаДиалога.Отмена тогда
        
        // Отказ = Истина;.
        
        Возврат;
        
    Иначе
        
        мРезультатДиалога = "ОК";
        
        ЭтаФорма.Закрыть();
        
    КонецЕсли;
    
    ПередЗакрытиемФрагмент(МестоРожденияСтрокойПослеРедактирования);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемФрагмент(Знач МестоРожденияСтрокойПослеРедактирования)
    
    МестоРожденияСтрокой = МестоРожденияСтрокойПослеРедактирования;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Если мРезультатДиалога = "ОК" Тогда
		
		ОповеститьОВыборе(МестоРожденияСтрокой);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура ОК(Команда)
	
	мРезультатДиалога = "ОК";

	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	мРезультатДиалога = "Отмена";

	Закрыть();

КонецПроцедуры

#КонецОбласти