
// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

	//++АнисимоваМВ 1бит добавление ответственного     
	Эл = Элементы.Добавить("Автор", Тип("ПолеФормы"), ЭтотОбъект); 
	Эл.Вид = ВидПоляФормы.ПолеВвода;
	Эл.ПутьКДанным = "Объект.Автор";
	Эл.Заголовок = "Автор";
	//--АнисимоваМВ 1бит добавление ответственного
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОплатыПоИсполнительномуЛисту.Параметры.УстановитьЗначениеПараметра("ИспЛист", Объект.Ссылка);
	Иначе
		ОплатыПоИсполнительномуЛисту.Параметры.УстановитьЗначениеПараметра("ИспЛист", Документы.бит_ИсполнительныйЛист.ПустаяСсылка());
	КонецЕсли;
	
	//НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИсторияСтатуса", Тип("ДекорацияФормы"),Элементы.Группа6);
	//НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	// НовыйЭлемент.Заголовок = "История";
	Если Объект.Ответчики.Количество()> 0 Тогда
		ПолучениеФИОДолжника();  
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПриОткрытииНаСервере()
	
	//ОплатыПоИсполнительномуЛисту.Параметры.УстановитьЗначениеПараметра("ИспЛист", Объект.Ссылка);
	
	ЛицевойСчетПриИзмененииНаСервере();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыПоИсполнительнымЛистамСрезПоследних.ИсполнительныйЛист КАК Регистратор,
	|	СтатусыПоИсполнительнымЛистамСрезПоследних.СтатусДокумента КАК СтатусДокумента,
	|	СтатусыПоИсполнительнымЛистамСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.СтатусыПоИсполнительнымЛистам.СрезПоследних(, ИсполнительныйЛист = &Ссылка) КАК СтатусыПоИсполнительнымЛистамСрезПоследних";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Период;
	КонецЕсли;
	
	//заполнение ТЧ 
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	Если Объект.Проведен Тогда
		Элементы.СтатусДата1.Заголовок = ПриОткрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СписокЗданий.Наименование КАК НомерДома,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира.Представление КАК Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Объект.Адрес = "" + РезультатЗапроса.Улица + ", д. " + РезультатЗапроса.НомерДома + ", кв. " + РезультатЗапроса.Квартира;
	Иначе
		Объект.Адрес = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ЛицевойСчетПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаИсторияСтатусов(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИсполнительныйЛист",Объект.Ссылка);
	ФормаОтчета = ОткрытьФорму("Документ.бит_ИсполнительныйЛист.Форма.ИсторияСтатусов",ПараметрыОтбора,ЭтаФорма);
	

КонецПроцедуры


&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если  НЕ ЗначениеЗаполнено(Объект.ФИОДолжника) Тогда
	ПолучениеФИОДолжника();	
КонецЕсли;
КонецПроцедуры 
                                                                                                             
&НаСервере
Процедура ПолучениеФИОДолжника()
	УстановитьПривилегированныйРежим(Истина);
	Если Объект.Услуга = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001") Тогда
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛС",Объект.ЛицевойСчет); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_Тест_Жильцы.Жилец КАК Жилец
	               |ИЗ
	               |	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
	               |ГДЕ
	               |	лб_Тест_Жильцы.ЭтоОтветственный = ИСТИНА
	               |	И лб_Тест_Жильцы.ЛС = &ЛС";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ФИОДолжника = Выборка.Жилец;
	КонецЕсли;
КонецЕсли; 
Если Объект.Услуга = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008") Тогда
	Объект.ФИОДолжника = Объект.Ответчики[0].ФизЛицо;
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры  	


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

КонецПроцедуры

