
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Элемент Из Параметры.Отбор Цикл
		СписокОбязательныхОтборов.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	// БИТ_ЖКХ_26112013_начало_изменений
	Если Параметры.Свойство("ТекЭлемент") Тогда
		
		Элементы.Список.ТекущаяСтрока = Параметры.ТекЭлемент;
		
	КонецЕсли;
	// БИТ_ЖКХ_26112013_окончание_изменений
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата", КонецДня(ТекущаяДата()));
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ИмяОтбора Из СписокОбязательныхОтборов Цикл
		Для Каждого Элемент Из ЭтаФорма.Список.Отбор.Элементы Цикл
			Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора) Тогда
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
