// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
//	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
КонецПроцедуры


Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = ЭтаФорма.Параметры;
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;
	
	Если Параметры.Свойство("Источник") Тогда 
		
		СформироватьПараметрыОтчета(Параметры.Источник, ЭтаФорма.ФормаПараметры, Параметры);
			
	КонецЕсли;
	
	ФормаПараметры = ЭтаФорма.ФормаПараметры;
	
КонецПроцедуры

Процедура СформироватьПараметрыОтчета(ПараметрКоманды, ПараметрыФормы, Параметры)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ЭтоМассив = Истина;
		Если ПараметрКоманды.Количество() > 0 Тогда
			ПервыйЭлемент = ПараметрКоманды[0];
		Иначе
			ПервыйЭлемент = Неопределено;
		КонецЕсли;
	Иначе
		ЭтоМассив = Ложь;
		ПервыйЭлемент = ПараметрКоманды;
	КонецЕсли;
	
	Если ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.бит_ЛицевыеСчета") Тогда
		ПараметрыФормы.Отбор = Новый Структура("ОсновнойЛицевойСчет", ПараметрКоманды);
		ПараметрыФормы.КлючНазначенияИспользования = ПараметрКоманды;
		Параметры.КлючНазначенияИспользования = ПараметрКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	Для Каждого ЭлементОтбора ИЗ КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОсновнойЛицевойСчет") Тогда
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОсновнойЛицевойСчетОтбор", ЭлементОтбора.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	//+bit_semenov.v_31/03/2021
	КапРемонт = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КапРемонт");
	КапРемонт.Значение = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010");
	КапРемонт.Использование = Истина;
	
	 //	
	ВидИсполнительныеЛисты = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВидИсполнительныеЛисты");
	ВидИсполнительныеЛисты.Значение = Справочники.лб_ВидыОплат.НайтиПоКоду("000000029");
	ВидИсполнительныеЛисты.Использование = Истина;	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	//-bit_semenov.v_31/03/2021 
	
	//СхемаКомпоновкиДанныхМакет = ЭтотОбъект.ПолучитьМакет(
	//
	//ЦветНачисления = КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	//ЦветНачисления.Использование = Истина;
	//ЦветОф = ЦветНачисления.Оформление.Элементы.Найти("ЦветФона");
	//ЦветОф.Значение = Новый Цвет(222,217,204);
	
КонецПроцедуры
