
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

//  Процедура - обработчик события "ПриИзменении" поля ввода "Наименование"
// 
&НаКлиенте
Процедура НаименованиеСоставноеПриИзменении(Элемент)
	
	Наименование = ПолучитьНаименованиеНаСервере(Объект.НаименованиеСоставное);

	Если ТипЗнч(Объект.НаименованиеСоставное) <> Тип("СправочникСсылка.Контрагенты") Тогда
		
		
		Объект.Наименование = Объект.НаименованиеСоставное;
		
	Иначе
		
		Объект.Наименование = Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеНаСервере(НаименованиеСоставное)

	Возврат НаименованиеСоставное.Наименование;
	
КонецФункции

#КонецОбласти