
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьЗаводскойНомер(Команда)
	
	ЗаполнитьЗаводскойНомерНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуПоверки(Команда)

	ЗаполнитьДатуПоверкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьЗаводскойНомерНаСервере()
	
	Справочники.бит_Счетчики.ЗаполнитьЗаводскиеНомераСчетчиков();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДатуПоверкиНаСервере()
	
	Справочники.бит_Счетчики.ЗаполнитьДатуПоверкиСчетчиков();
	
КонецПроцедуры

#КонецОбласти