     
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ") Тогда
				
		Дата         = Параметры.ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ.Дата;
		ЛицевойСчет  = Параметры.ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ.ЛицевойСчет;
		МассивФизЛиц = Параметры.ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ.МассивФизЛиц;
		
	Иначе
		
		Дата         = Неопределено;
		ЛицевойСчет  = Неопределено;
		МассивФизЛиц = Неопределено;
			
	КонецЕсли;
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений, Дата, ЛицевойСчет, МассивФизЛиц);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:57:06 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:57:06 Конец правки.
	
	АдресФизЛицВХранилище = ПоместитьФизЛицВХранилище();
	Структура = Новый Структура("АдресФизЛицВХранилище", АдресФизЛицВХранилище);
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы
 
&НаКлиенте
Процедура ОК(Команда)
	
	 Закрыть();
	 
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ФизЛицаФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	мСписокЗначений = ПолучитьСписокФизЛицНаСервере(КонецМесяца(мКэшЗначений.Дата), мКэшЗначений.ЛицевойСчет);
	
	ПараметрыФормы = Новый Структура;
		
	ПараметрыФормы.Вставить("мСписокЗначений", мСписокЗначений);	
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	   
   Если мКэшЗначений.МассивФизЛиц <> Неопределено Тогда
	   
	   Для каждого Строка Из мКэшЗначений.МассивФизЛиц Цикл
		   
		   НоваяСтрока = ЭтаФорма.ФизЛица.Добавить();
		   ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		   
	   КонецЦикла;
	   
   КонецЕсли;
  
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения, Дата, ЛицевойСчет, МассивФизЛиц)
	
	КэшированныеЗначения = Новый Структура;
		
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("Дата"        , Дата);
    КэшированныеЗначения.Вставить("ЛицевойСчет" , ЛицевойСчет);
    КэшированныеЗначения.Вставить("МассивФизЛиц", МассивФизЛиц);	
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервереБезКонтекста
Функция ПолучитьСписокФизЛицНаСервере(Знач Дата, Знач ЛицевойСчет)
	
	Запрос =  Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	               |	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	               |	ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	               |	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	               |	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	               |	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	               |	ПроживающиеПоЛССрезПоследних.ДатаЗаписи
	               |ИЗ
	               |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	               |ГДЕ
	               |	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	               |			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
				   
	Запрос.УстановитьПараметр("Момент",      Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	мТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	мСписокЗначений = Новый СписокЗначений;

	Пока Выборка.Следующий() Цикл 
		
		мСписокЗначений.Добавить(Выборка.ФизЛицо)
		
	КонецЦикла;
	
	Возврат мСписокЗначений;
	
КонецФункции

&НаСервере
Функция ПоместитьФизЛицВХранилище()
	
	ТаблицаФизЛиц = ФизЛица.Выгрузить();
	
	АдресФизЛицВХранилище = ПоместитьВоВременноеХранилище(ТаблицаФизЛиц, УникальныйИдентификатор);
	
	Возврат АдресФизЛицВХранилище;
	
КонецФункции

#КонецОбласти