
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ         = Метаданные.Документы.бит_РазовыеПоУслугамЖКХ;
	ПравоНаИзменение = ПравоДоступа("Изменение", Документ);
	
	Элементы.ФормаФайлы.Доступность = ?(НЕ ПравоНаИзменение, Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Файлы(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда 
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Объект", ТекДанные.Ссылка);
		
		ОткрытьФорму("Справочник.бит_рз_ХранилищеДополнительнойИнформации.Форма.ФормаСпискаУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
