#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВерсииШаблоновГИСЖКХ(ЭтоКоманада) Экспорт
	
	ВерсииШаблоновГИСЖКХ = Новый Структура;
	
	Если ЭтоКоманада Тогда
		Возврат ВерсииШаблоновГИСЖКХ; 	
	КонецЕсли;
	
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетГМКД"	,"1.3.2.97");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетЖД"		,"1.3.2.97");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетИПУ"	,"1.3.2.73");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетЛС"		,"1.3.2.37");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетМКД"	,"1.3.2.97");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетОДПУ"	,"1.3.2.37");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетПД"		,"1.3.2.106");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетПД2020"	,"1.3.2.115");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетПУ"		,"1.3.2.37");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетТФ"		,"1.3.2.18");
	//ВерсииШаблоновГИСЖКХ.Вставить("МакетОплаты"	,"1.3.2.99");
	
	ВерсииШаблоновГИСЖКХ.Вставить("МакетГМКД"	,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетЖД"		,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетИПУ"	,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетЛС"		,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетМКД"	,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетОДПУ"	,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетПД"		,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетПД2020"	,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетПУ"		,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетТФ"		,"1.3.3.32");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетОплаты"	,"1.3.3.32");
	// БИТ ЖКХ 25.02.2021
	ВерсииШаблоновГИСЖКХ.Вставить("МакетГМКДРСО" ,"1.3.3.55");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетЖДРСО"	 ,"1.3.3.55");
	ВерсииШаблоновГИСЖКХ.Вставить("МакетМКДРСО"	 ,"1.3.3.55") ;

	
	Возврат ВерсииШаблоновГИСЖКХ;
	
КонецФункции

Процедура ЗаполнитьШаблоны(ЭтоКоманада = Ложь) Экспорт
	
	// Проверяем необходимость заполнения СКД.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_СКДТаблицГИСЖКХ.ТаблицаШаблонаГИСЖКХ
	|ИЗ
	|	РегистрСведений.бит_СКДТаблицГИСЖКХ КАК бит_СКДТаблицГИСЖКХ";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ОбновитьШаблоныРелиз(ЭтоКоманада);
		Возврат;
		
	КонецЕсли;
	
	// Пометка на удаления старых шаблонов.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ШаблоныВыгрузкиГИСЖКХ.Ссылка
	|ИЗ
	|	Справочник.бит_ШаблоныВыгрузкиГИСЖКХ КАК бит_ШаблоныВыгрузкиГИСЖКХ
	|ГДЕ
	|	НЕ бит_ШаблоныВыгрузкиГИСЖКХ.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Об					= Выборка.Ссылка.ПолучитьОбъект();
			Об.ПометкаУдаления	= Истина;
			Об.Записать();
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	// Первое заполнение СКД.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ТаблицыШаблоновГИСЖКХ.Ссылка,
	|	бит_ТаблицыШаблоновГИСЖКХ.ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.бит_ТаблицыШаблоновГИСЖКХ КАК бит_ТаблицыШаблоновГИСЖКХ
	|ГДЕ
	|	бит_ТаблицыШаблоновГИСЖКХ.Предопределенный";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Набор = РегистрыСведений.бит_СКДТаблицГИСЖКХ.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Период = ТекущаяДата();
	
	Пока Выборка.Следующий() Цикл
		НовыйНабор							= Набор.Добавить();
		НовыйНабор.Период					= Период;
		НовыйНабор.ТаблицаШаблонаГИСЖКХ		= Выборка.Ссылка;
		СхемаКомпоновкиДанных				= бит_ОбщегоНазначенияКлиентСервер.ПодготовитьСхемуСКД(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ПолучитьМакет("Макет" + Выборка.ИмяПредопределенныхДанных));
		НовыйНабор.СхемаКомпоновкиДанных	= Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	КонецЦикла; 
	
	Попытка
		Набор.Записать();
	Исключение
	КонецПопытки;
	
	СоздатьШаблоны(ЭтоКоманада);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьШаблоныРелиз(ЭтоКоманада)
	
	ВерсииШаблоновГИСЖКХ = ПолучитьВерсииШаблоновГИСЖКХ(ЭтоКоманада);
	ШаблоныНаОбновление = Новый Массив;
	
	// Отправка в архив старых шаблонов.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.Ссылка КАК бит_ШаблоныВыгрузкиГИСЖКХ,
	|	бит_ШаблоныВыгрузкиГИСЖКХ.ВерсияШаблона КАК ВерсияШаблона,
	|	бит_ШаблоныВыгрузкиГИСЖКХ.ИмяМакета КАК ИмяМакета
	|ИЗ
	|	Справочник.бит_ШаблоныВыгрузкиГИСЖКХ.ПоляШаблона КАК бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ШаблоныВыгрузкиГИСЖКХ КАК бит_ШаблоныВыгрузкиГИСЖКХ
	|		ПО бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.Ссылка = бит_ШаблоныВыгрузкиГИСЖКХ.Ссылка
	|ГДЕ
	|	НЕ бит_ШаблоныВыгрузкиГИСЖКХ.Архивный
	|	И НЕ бит_ШаблоныВыгрузкиГИСЖКХ.ПометкаУдаления
	|	И НЕ бит_ШаблоныВыгрузкиГИСЖКХ.ПользовательскийШаблон
	|	И (бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЛС)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЛСКапРем)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаНежилыхПомещений)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПодъездов)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПомещений)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПомещенийКапРем)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПУ_Инд)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПУ_Гр)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопКоммРесурсы_Инд)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопКоммРесурсы_Гр)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопЛСПУ)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2КапРем)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2_2020)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2КапРем2020)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6КапРем)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6_2020)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6КапРем2020)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПД)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПДКапРем)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойки)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойкиКапРем)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаИПУ)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОДПУ)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаАбонентовМО)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПроживающихМО)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПоставщиковУслугМО)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилогоФондаМО)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаИПУМО)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОДПУМО)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплаты)
	|			ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплатыКапРем))";
	
	//25.11.2019     	
	Запрос.Текст = Запрос.Текст + " ИЛИ (бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплаты) ИЛИ бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы = ЗНАЧЕНИЕ(Справочник.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплатыКапРем))";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// Выборочное обновление.
		Если НЕ ЭтоКоманада
			И ЗначениеЗаполнено(Выборка.ИмяМакета) Тогда
			
			НоваяВерсия = Неопределено;
			ВерсииШаблоновГИСЖКХ.Свойство(Выборка.ИмяМакета, НоваяВерсия);
			Если НоваяВерсия <> Неопределено
				И СравнитьВерсии(НоваяВерсия, Выборка.ВерсияШаблона) <= 0 Тогда
				
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ШаблоныНаОбновление.Добавить(Выборка.ИмяМакета);
		
		Попытка
			Об				= Выборка.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьОбъект();
			Об.Архивный		= Истина;
			Об.Комментарий	= "Схема сбора данных устарела.";
			Об.Записать();
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	// Перезаполнение макетов СКД.
	ВерсииТаблицШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ПолучитьВерсииТаблицШаблоновГИСЖКХ(ЭтоКоманада);
	НоваяВерсияШаблона = бит_ОбщегоНазначенияПовтИсп.ПолучитьНомерРелиза_бит();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ТаблицыШаблоновГИСЖКХ.Ссылка КАК Ссылка,
	|	бит_ТаблицыШаблоновГИСЖКХ.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	бит_ТаблицыШаблоновГИСЖКХ.ВерсияТаблицы КАК ВерсияТаблицы
	|ИЗ
	|	Справочник.бит_ТаблицыШаблоновГИСЖКХ КАК бит_ТаблицыШаблоновГИСЖКХ
	|ГДЕ
	|	бит_ТаблицыШаблоновГИСЖКХ.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Выборочное обновление.
		Если НЕ ЭтоКоманада
			И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			НоваяВерсия = ВерсииТаблицШаблоновГИСЖКХ[Выборка.Ссылка];
			Если НоваяВерсия <> Неопределено
				И СравнитьВерсии(НоваяВерсия, Выборка.ВерсияТаблицы) <= 0 Тогда
				
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		// Поставить отметку версии.
		Об				= Выборка.Ссылка.ПолучитьОбъект();
		Об.ВерсияТаблицы= НоваяВерсияШаблона;
		Об.Записать();
		
		НаборСКДТаблицГИСЖКХ = РегистрыСведений.бит_СКДТаблицГИСЖКХ.СоздатьНаборЗаписей();  
		НаборСКДТаблицГИСЖКХ.Отбор.Период.Установить(ТекущаяДата());
		НаборСКДТаблицГИСЖКХ.Отбор.ТаблицаШаблонаГИСЖКХ.Установить(Выборка.Ссылка);
		НаборСКДТаблицГИСЖКХ.Прочитать();
		
		Макет = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ПолучитьМакет("Макет" + Выборка.ИмяПредопределенныхДанных);
		
		Если НаборСКДТаблицГИСЖКХ.Количество() = 0 Тогда
			НовыйНаборСКДТаблицГИСЖКХ						= НаборСКДТаблицГИСЖКХ.Добавить();
			НовыйНаборСКДТаблицГИСЖКХ.Период				= ТекущаяДата();
			НовыйНаборСКДТаблицГИСЖКХ.ТаблицаШаблонаГИСЖКХ	= Выборка.Ссылка;
			СхемаКомпоновкиДанных							= бит_ОбщегоНазначенияКлиентСервер.ПодготовитьСхемуСКД(Макет);
			НовыйНаборСКДТаблицГИСЖКХ.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
		Иначе 
			НовыйНаборСКДТаблицГИСЖКХ						= НаборСКДТаблицГИСЖКХ[0];
			СхемаКомпоновкиДанных							= бит_ОбщегоНазначенияКлиентСервер.ПодготовитьСхемуСКД(Макет);
			НовыйНаборСКДТаблицГИСЖКХ.СхемаКомпоновкиДанных	= Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
		КонецЕсли;
		
		Попытка
			НаборСКДТаблицГИСЖКХ.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	СоздатьШаблоны(ЭтоКоманада, ШаблоныНаОбновление);
	
КонецПроцедуры

Процедура СоздатьШаблоны(ЭтоКоманада, ШаблоныНаОбновление = Неопределено)
	
	НоваяВерсияШаблона = бит_ОбщегоНазначенияПовтИсп.ПолучитьНомерРелиза_бит();
	
	ОбновитьШаблонЖД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонМКД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонГМКД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонЛС(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонПУ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонПД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонИПУ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонОДПУ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонТФ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонОплаты(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонПД2020(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	// БИТ ЖКХ 25.02.2021
	ОбновитьШаблонЖДРСО(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонМКДРСО(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);
	ОбновитьШаблонГМКДРСО(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона);

КонецПроцедуры

// БИТ ЖКХ 25.02.2021
Процедура ОбновитьШаблонЖДРСО(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетЖДРСО") <> Неопределено Тогда
		
		// Шаблон импорт сведений о ЖД.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о ЖД РСО";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетЖДРСО";
		НШаблон.ТипыДомовГИСЖКХ			= Перечисления.бит_ТипыДомовГИСЖКХ.ЖД;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресЗдания",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖДБлокированнойЗастройки",		3, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилыеДомаОдногоАдреса",  	    4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОКТМО",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧасоваяЗонаПоOlson",			6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерЗдания",		7, );
						
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		2, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КатегорияПомещения",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ХарактеристикаПомещения",	4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилаяПлощадь",				6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	7, );
				
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКомнаты",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Площадь",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКомнаты",	5, );
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетЖДРСО"));
		
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
Процедура ОбновитьШаблонМКДРСО(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетМКДРСО") <> Неопределено Тогда
		
		// Шаблон импорт сведений о МКД.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о МКД РСО";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетМКДРСО";
		НШаблон.ТипыДомовГИСЖКХ			= Перечисления.бит_ТипыДомовГИСЖКХ.МКД;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресЗдания",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОКТМО",						3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧасоваяЗонаПоOlson",	    	4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерЗдания",		5, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаНежилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		2, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	4, );
	
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПодъезда",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ХарактеристикаПомещения",	4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	5, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		4, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКомнаты",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Площадь",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКомнаты",	5, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетМКДРСО"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонГМКДРСО(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетГМКДРСО") <> Неопределено Тогда
		
		// Шаблон импорт сведений о ГМКД.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о ГМКД РСО";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетГМКДРСО";
		НШаблон.ТипыДомовГИСЖКХ			= Перечисления.бит_ТипыДомовГИСЖКХ.МКД;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресЗдания",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОКТМО",						3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧасоваяЗонаПоOlson",	    	4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерЗдания",		5, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаНежилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			2, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",				2, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	3, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",		5, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодЖилогоПомещения",		2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			3, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодПодъезда",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ХарактеристикаПомещения",	7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	8, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,	    4, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКомнаты",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодПомещения",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Площадь",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКомнаты",	5, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетГМКДРСО"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонЖД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетЖД") <> Неопределено Тогда
		
		// Шаблон импорт сведений о ЖД.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о ЖД";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетЖД";
		НШаблон.ТипыДомовГИСЖКХ			= Перечисления.бит_ТипыДомовГИСЖКХ.ЖД;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресЗдания",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖДБлокированнойЗастройки",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОКТМО",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Состояние",					6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадьЗдания",			8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ГодВводаВЭксплуатацию",		9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоЭтажей",				10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъектаКультурногоНаследия",	11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧасоваяЗонаПоOlson",			12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерЗдания",		13, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КатегорияПомещения",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ХарактеристикаПомещения",	4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилаяПлощадь",				6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	8, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		5, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКомнаты",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Площадь",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКомнаты",	5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	6, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетЖД"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонМКД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетМКД") <> Неопределено Тогда
		
		// Шаблон импорт сведений о МКД.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о МКД";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетМКД";
		НШаблон.ТипыДомовГИСЖКХ			= Перечисления.бит_ТипыДомовГИСЖКХ.МКД;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресЗдания",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОКТМО",						3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Состояние",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СтадияЖизненногоЦикла",		5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадьЗдания",			6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ГодВводаВЭксплуатацию",		7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоЭтажей",				8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоПодземныхЭтажей",	9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоЭтажейНаименьшее",	10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧасоваяЗонаПоOlson",			11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъектаКультурногоНаследия",	12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерЗдания",		13, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаНежилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		5, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОщееИмущество",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	6, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПодъездов;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		7, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресПодъезда",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПодъезда",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Этажность",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ГодПостройки",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	5, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		10, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПодъезда",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ХарактеристикаПомещения",	4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилаяПлощадь",				6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	8, );
	
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		12, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКомнаты",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Площадь",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКомнаты",	5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	6, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетМКД"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонГМКД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетГМКД") <> Неопределено Тогда
		
		// Шаблон импорт сведений о ГМКД.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о ГМКД";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетГМКД";
		НШаблон.ТипыДомовГИСЖКХ			= Перечисления.бит_ТипыДомовГИСЖКХ.МКД;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресЗдания",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОКТМО",						3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Состояние",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СтадияЖизненногоЦикла",		5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадьЗдания",			6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ГодВводаВЭксплуатацию",		7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоЭтажей",				8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоПодземныхЭтажей",	9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоЭтажейНаименьшее",	10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧасоваяЗонаПоOlson",			11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъектаКультурногоНаследия",	12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерЗдания",		13, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаНежилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			5, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодНежилогоПомещения",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОщееИмущество",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",					6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",		7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",		8, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПодъездов;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			7, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресПодъезда",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодПодъезда",					2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПодъезда",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Этажность",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ГодПостройки",					6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",		7, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		10, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКвартиры",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодЖилогоПомещения",		2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодПодъезда",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ХарактеристикаПомещения",	6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",				7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилаяПлощадь",				8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКвартиры",	9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	10, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		12, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресКомнаты",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодПомещения",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Площадь",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КадастровыйНомерКомнаты",	5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПодтвержденоПоставщиком",	6, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетГМКД"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонЛС(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетЛС") <> Неопределено Тогда
		
		// Шаблон импорт сведений о ЛС.	
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорта ЛС";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетЛС";
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЛС;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЗаписи",						1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",					3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипЛицевогоСчета",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Наниматель",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЛицевыеСчетаРазделеныНаПомещения",	6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Фамилия",							7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Имя",								8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Отчество",							9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СНИЛС",							10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидДокументаУЛ",					11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерДокументаУЛ",					12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СерияДокументаУЛ",					13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаДокументаУЛ",					14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОГРН_ОГРНИП",						15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КПП",								17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",						18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилаяПлощадь",						19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОтпливаемяПлощадь",				20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КолВоПроживающих",					21, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПомещений;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			2, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЗаписи",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресПомещения",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПомещенияБлок",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",					6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерГИСЖКХ",		7, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетЛС"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
		
		// Шаблон импорт сведений о ЛС (кап. рем.).	
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорта ЛС (кап. рем.)";
		НШаблон.НомерНачальнойСтроки	= 3;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетЛС";
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЛСКапРем;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЗаписи",						1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",					3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипЛицевогоСчета",					4, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Наниматель",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЛицевыеСчетаРазделеныНаПомещения",	6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Фамилия",							7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Имя",								8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Отчество",							9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СНИЛС",							10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидДокументаУЛ",					11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерДокументаУЛ",					12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СерияДокументаУЛ",					13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаДокументаУЛ",					14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОГРН_ОГРНИП",						15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КПП",								17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",						18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилаяПлощадь",						19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОтпливаемяПлощадь",				20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КолВоПроживающих",					21, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПомещенийКапРем;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			2, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЗаписи",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресПомещения",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодФИАС_ИдентификаторГИСЖКХ",	3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПомещенияБлок",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПомещения",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКомнаты",					6, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерГИСЖКХ",		7, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетЛС"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонПУ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетПУ") <> Неопределено Тогда
		
		// Шаблон импорт сведений о ПУ(приборах учета) идивидуальные счетчики.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о ПУ (идивидуальные)";
		НШаблон.НомерНачальнойСтроки	= 2;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетПУ";
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПУ_Инд;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СсылочныйНомерПУ",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗаводскойСерийныйНомерПУ",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидПУ",							3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МаркаПУ",							4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МодельПУ",							5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресДома",						6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерДома",				7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерПомещения",			8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерКомнаты",			9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",							10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДистанционноеСнятиеПоказаний",		11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаименованияУстановленнойСистемы",	12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемНесколькихПриборовУчета",		13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидКоммунальногоРесурса",			16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдиницаИзмерения",					17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидПУПоКоличествуТарифов",			18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ1",				19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ2",				20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ3",				21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоэффициентТрансформации",			22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаУстановки",					23, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаВводаВЭксплуатацию",			24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнейПоверки",				25, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаОпломбированияЗаводом",		26, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МежповерочныйИнтервал",			27, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаличиеДатчиковТемпературы",		28, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИнформацияДатчиковТемпературы",	29, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаличиеДатчиковДавления",			30, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИнформацияДатчиковДавления",		31, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвтоматическийРасчетОбъема",		32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопКоммРесурсы_Инд;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		2, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СсылочныйНомерПУ",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресДома",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидКоммунальногоРесурса",	3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдиницаИзмерения",			4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказание",			5, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетПУ"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
		
		
		// Шаблон импорт сведений о ПУ(приборах учета) групповые счетчики.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорт сведений о ПУ (групповые)";
		НШаблон.НомерНачальнойСтроки	= 2;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетПУ";
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПУ_Гр;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СсылочныйНомерПУ",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗаводскойСерийныйНомерПУ",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидПУ",							3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МаркаПУ",							4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МодельПУ",							5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресДома",						6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерДома",				7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерПомещения",			8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерКомнаты",			9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",							10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДистанционноеСнятиеПоказаний",		11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаименованияУстановленнойСистемы",	12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемНесколькихПриборовУчета",		13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидКоммунальногоРесурса",			16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдиницаИзмерения",					17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидПУПоКоличествуТарифов",			18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ1",				19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ2",				20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ3",				21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоэффициентТрансформации",			22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаУстановки",					23, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаВводаВЭксплуатацию",			24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнейПоверки",				25, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаОпломбированияЗаводом",		26, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МежповерочныйИнтервал",			27, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаличиеДатчиковТемпературы",		28, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИнформацияДатчиковТемпературы",	29, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаличиеДатчиковДавления",			30, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИнформацияДатчиковДавления",		31, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвтоматическийРасчетОбъема",		32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопКоммРесурсы_Гр;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		2, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СсылочныйНомерПУ",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресДома",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидКоммунальногоРесурса",	3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдиницаИзмерения",			4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказание",			5, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопЛСПУ;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СсылочныйНомерПУ",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресДома",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",					3, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетПУ"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонПД(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетПД") <> Неопределено Тогда
		
		МакетСтраницы = ПолучитьПредыдущийМакетСтраницыПД();
		
		// Шаблон импорт платежных документов.
		НШаблон								= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование				= "Шаблон импорт платежных документов";
		НШаблон.НомерНачальнойСтроки		= 0;
		НШаблон.ВерсияШаблона				= НоваяВерсияШаблона;
		НШаблон.ИмяМакета					= "МакетПД";
		НШаблон.ШаблонПлатежныхДокументов	= Истина;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 4);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПД",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КОплатеЗаМесяц",					9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗадолженностьЗаПредыдущиеПериоды",	10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвансНаНачалоПериода",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Оплачено",							12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧислоРасчетногоПериода",			13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнейОплаты",				14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",   	    	            15, ); //25.01.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеЗаРССальдоСПени",		16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БИКБанка",							17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйСчет",					18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РазмерВзносаНаКвМ",				19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВсегоНачислено",					20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПерерасчетыВсего",					21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЛьготыСубсидии",					22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					23, );		
		
		//25.10.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетовКап",			24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетовКап",				25, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",						26, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",						32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				2, 5);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдИзм",							3, ); //1.02.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовИнд",		4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугИнд",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовОбщ",		6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугОбщ",					7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Тариф",							8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоИнд",						9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоОбщДом",					10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПовышающийКоэффициент",			12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Субсидии", 						13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Перерасчеты",						14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",							15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативИнд",						17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативОбщ",						18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияИнд",					19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияОбщ",					20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемИнд",				21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемОбщ",				22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетов",				23, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетов",					24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочкуСумма",			27, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочку",				28, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаКОплате",						29, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсего",				30, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсегоОбщегоИмущества",	32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПД;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",					2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",				4, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойки;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		4, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидНачисления",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованияНачислений",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",				4, );     		
		
		Если ЗначениеЗаполнено(МакетСтраницы) Тогда
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(МакетСтраницы);
		Иначе
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетПД"));
		КонецЕсли;
		
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
		
		// Шаблон импорт платежных документов (кап. рем.).
		НШаблон								= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование				= "Шаблон импорт платежных документов (кап. рем.)";
		НШаблон.НомерНачальнойСтроки		= 0;
		НШаблон.ВерсияШаблона				= НоваяВерсияШаблона;
		НШаблон.ИмяМакета					= "МакетПД";
		НШаблон.ШаблонПлатежныхДокументов	= Истина;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2КапРем;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 4);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПД",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КОплатеЗаМесяц",					9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗадолженностьЗаПредыдущиеПериоды",	10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвансНаНачалоПериода",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Оплачено",							12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧислоРасчетногоПериода",			13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнейОплаты",				14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",   	    	            15, ); //25.01.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеЗаРССальдоСПени",		16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БИКБанка",							17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйСчет",					18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РазмерВзносаНаКвМ",				19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВсегоНачислено",					20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПерерасчетыВсего",					21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЛьготыСубсидии",					22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					23, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",						25, );
		
		//25.10.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетовКап",			24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетовКап",				25, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",						26, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",						32, );

		
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",						30, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6КапРем;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				2, 5);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдИзм",							3, ); //1.02.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовИнд",		4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугИнд",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовОбщ",		6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугОбщ",					7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Тариф",							8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоИнд",						9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоОбщДом",					10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Перерасчеты",						14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",							15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативИнд",						17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативОбщ",						18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияИнд",					19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияОбщ",					20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемИнд",				21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемОбщ",				22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетов",				23, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетов",					24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочкуСумма",			27, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочку",				28, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаКОплате",						29, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсего",				30, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсегоОбщегоИмущества",	32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПДКапРем;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",					2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",				4, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойкиКапРем;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		4, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидНачисления",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованияНачислений",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",				4, );
		
		Если ЗначениеЗаполнено(МакетСтраницы) Тогда
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(МакетСтраницы);
		Иначе
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетПД"));
		КонецЕсли;
		
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонПД2020(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетПД2020") <> Неопределено Тогда
		
		МакетСтраницы = ПолучитьПредыдущийМакетСтраницыПД2020();
		
		// Шаблон импорт платежных документов.
		НШаблон								= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование				= "Шаблон импорт платежных документов 2020";
		НШаблон.НомерНачальнойСтроки		= 0;
		НШаблон.ВерсияШаблона				= НоваяВерсияШаблона;
		НШаблон.ИмяМакета					= "МакетПД2020";
		НШаблон.ШаблонПлатежныхДокументов	= Истина;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2_2020;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 4);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПД",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КОплатеЗаМесяц",					9, );
		//25.12.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗадолженностьЗаПредыдущиеПериоды",	10, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвансНаНачалоПериода",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Оплачено",							10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧислоРасчетногоПериода",			11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнейОплаты",				12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",   	    	            13, ); //25.01.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеЗаРССальдоСПени",		14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоРеквизита", 		15, );

		// БИТ ЖКХ 24.01.2020
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БИКБанка",							17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеСКапремонтом",			17, );
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйСчет",					18, );
		// БИТ ЖКХ 25.12.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",						19, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РазмерВзносаНаКвМ",				19, );
		// БИТ ЖКХ 10.01.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВсегоНачислено",					20, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПерерасчетыВсего",					21, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЛьготыСубсидии",					22, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					23, );		
		//
		//25.10.2019
		// БИТ ЖКХ 10.01.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетовКап",			24, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетовКап",				25, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",						26, );		
		// БИТ ЖКХ 25.12.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",						32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6_2020;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				2, 4);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдИзм",							3, ); //1.02.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовИнд",		4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугИнд",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовОбщ",		6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугОбщ",					7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Тариф",							8, );
		// БИТ ЖКХ 26.12.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоИнд",						9, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоОбщДом",					10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоЗаРасчетныйПериод",		9, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПовышающийКоэффициент",			10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Субсидии", 						11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Перерасчеты",						12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",							13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаКОплате",						15, );
		
		// БИТ ЖКХ 26.12.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвансНаНачалоПериода",				16 );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогПени", 						17 );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",						21);
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативИнд",						22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативОбщ",						23, );
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияИнд",					24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияОбщ",					25, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемИнд",				26, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемОбщ",				27, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетов",				28, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетов",					29, );
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочкуСумма",			32, );
// БИТ ЖКХ 26.12.2019
//		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочку",				33, );
		
// БИТ ЖКХ 26.12.2019
//		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсего",				30, );
//		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсегоОбщегоИмущества",	32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПД;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		5, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",					2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",				4, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойки;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		6, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидНачисления",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованияНачислений",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",				4, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДПлатежныеРеквизиты;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		9, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоРеквизита", 2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БИКБанка",          		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйСчет",			4, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛицевогоСчета",		5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаКОплате",        		6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Задолженность",  	        7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",  	        8, );
		Если ЗначениеЗаполнено(МакетСтраницы) Тогда
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(МакетСтраницы);
		Иначе
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетПД2020"));
		КонецЕсли;
		
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
		
		// Шаблон импорт платежных документов (кап. рем.).
		НШаблон								= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование				= "Шаблон импорт платежных документов (кап. рем.)2020";
		НШаблон.НомерНачальнойСтроки		= 0;
		НШаблон.ВерсияШаблона				= НоваяВерсияШаблона;
		НШаблон.ИмяМакета					= "МакетПД";
		НШаблон.ШаблонПлатежныхДокументов	= Истина;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2КапРем2020;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				1, 4);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПД",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",						5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КОплатеЗаМесяц",					9, );
		//25.12.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗадолженностьЗаПредыдущиеПериоды",	10, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвансНаНачалоПериода",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Оплачено",							10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧислоРасчетногоПериода",			11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнейОплаты",				12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",   	    	            13, ); //25.01.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеЗаРССальдоСПени",		14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоРеквизита", 		15, );

		// БИТ ЖКХ 24.01.2020
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БИКБанка",							17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеСКапремонтом",			17, );
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйСчет",					18, );
		// БИТ ЖКХ 25.12.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",						19, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РазмерВзносаНаКвМ",				19, );
		// БИТ ЖКХ 10.01.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВсегоНачислено",					20, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПерерасчетыВсего",					21, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЛьготыСубсидии",					22, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					23, );		
		//
		//25.10.2019
		// БИТ ЖКХ 10.01.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетовКап",			24, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетовКап",				25, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",						26, );		
		// БИТ ЖКХ 25.12.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",						32, );

		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6КапРем2020;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,				2, 4);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",			1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",							2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдИзм",							3, ); //1.02.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовИнд",		4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугИнд",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СпособОпределенияОбъемовОбщ",		6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбъемКомУслугОбщ",					7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Тариф",							8, );
		// БИТ ЖКХ 26.12.2019
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоИнд",						9, );
		//НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоОбщДом",					10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НачисленоЗаРасчетныйПериод",		9, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПовышающийКоэффициент",			10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Субсидии", 						11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Перерасчеты",						12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Льготы",							13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПорядокРасчетов",					14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаКОплате",						15, );
		
		// БИТ ЖКХ 26.12.2019
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвансНаНачалоПериода",				16 );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогПени", 						17 );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",						21);
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативИнд",						22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НормативОбщ",						23, );
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияИнд",					24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТекПоказанияОбщ",					25, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемИнд",				26, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммарныйОбъемОбщ",				27, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованиеПересчетов",				28, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаПересчетов",					29, );
		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочкуСумма",			32, );
// БИТ ЖКХ 26.12.2019
//		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроцентыЗаРассрочку",				33, );
		
// БИТ ЖКХ 26.12.2019
//		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсего",				30, );
//		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплатеВсегоОбщегоИмущества",	32, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПД;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		5, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга",					2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйПериод",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",				4, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойки;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		6, 3);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ВидНачисления",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОснованияНачислений",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПениИтого",				4, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДПлатежныеРеквизиты;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		9, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоДокумента",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПлатежногоРеквизита", 2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БИКБанка",          		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "РасчетныйСчет",			4, );		
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛицевогоСчета",		5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СуммаКОплате",        		6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Задолженность",  	        7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИтогоКОплате",  	        8, );


		
		Если ЗначениеЗаполнено(МакетСтраницы) Тогда
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(МакетСтраницы);
		Иначе
			НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетПД2020"));
		КонецЕсли;
		
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонИПУ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетИПУ") <> Неопределено Тогда
		
		// Шаблон импорта показаний ИПУ.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорта показаний ИПУ";
		НШаблон.НомерНачальнойСтроки	= 2;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетИПУ";
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаИПУ;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресДома",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерГИСЖКХ",		2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоммунальныйРесурс",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ1",			4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ2",			5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ3",			6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаСнятияПоказания",			7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвтоматическийРасчетОбъема",	8, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетИПУ"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонОДПУ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетОДПУ") <> Неопределено Тогда
		
		// Шаблон импорта показаний ОДПУ.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон импорта показаний ОДПУ";
		НШаблон.НомерНачальнойСтроки	= 2;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетОДПУ";
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОДПУ;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АдресДома",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "УникальныйНомерГИСЖКХ",		2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоммунальныйРесурс",			3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ1",			4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ2",			5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БазовоеПоказаниеТ3",			6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаСнятияПоказания",			7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "АвтоматическийРасчетОбъема",	8, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетОДПУ"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонТФ(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетТФ") <> Неопределено Тогда
		
		// Шаблон транспортного файла Московской области.
		НШаблон							= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование			= "Шаблон транспортного файла Московской области";
		НШаблон.НомерНачальнойСтроки	= 2;
		НШаблон.ВерсияШаблона			= НоваяВерсияШаблона;
		НШаблон.ИмяМакета				= "МакетТФ";
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаАбонентовМО;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		1, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Фамилия",					3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Имя",						4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Отчество",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипДокументаУЛ",			6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СерияДокументаУЛ",			7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерДокументаУЛ",			8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаДокументаУЛ",			9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДокументКемВыдан",			10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Индекс",					11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Район",					12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаселенныйПункт",			13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Улица",					14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Дом",						15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Корпус",					16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерКвартиры",			17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерПодъезда",			18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Телефон",					19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СтатусКвартиры",			20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Этаж",						21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоКомнат",			22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадь",				23, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЖилаяПлощадь",				24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КолВоПроживающих",			25, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КолВоЗарегистрированных",	26, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипДома",					27, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПроживающихМО;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,	2, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Фамилия",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Имя",					3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Отчество",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Пол",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаРождения",			6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Владелец",				7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Проживает",			8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Зарегистрирован",		9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроживаетС",			10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПроживаетПО",			11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗарегистрированС",		12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗарегистрированПО",	13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипДокументаУЛ",		14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СерияДокументаУЛ",		15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерДокументаУЛ",		16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаДокументаУЛ",		17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДокументКемВыдан",		18, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаИПУМО;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		3, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НомерЛС",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаименованиеУслуги",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПоставщикУслуг",			4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПриборУчета",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗаводскойСерийныйНомерПУ",	6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МодельПУ",					7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаУстановки",			9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СледующаяПоверка",			10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧислоТарифов",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПредыдущиеПоказания",		12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПредыдущихПоказаний",	15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПоследниеПоказания",		16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнихПоказаний",	19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Значность",				20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Состояние",				21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдИзм",					22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Тариф",					23, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Норматив",					24, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПлиты",					25, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОДПУМО;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,		4, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Район",					1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаселенныйПункт",			2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Улица",					3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Дом",						4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Корпус",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаименованиеУслуги",		6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЗаводскойСерийныйНомерПУ",	7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "МодельПУ",					8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаУстановки",			9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СледующаяПоверка",			10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЧислоТарифов",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПредыдущиеПоказания",		12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПредыдущихПоказаний",	13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПоследниеПоказания",		14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаПоследнихПоказаний",	15, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Значность",				16, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоэффициентТрансформации",	17, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Состояние",				18, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ФормаНачисления",			19, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЕдИзм",					20, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Тариф",					21, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Норматив",					22, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Привязка",					25, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилогоФондаМО;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,	5, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Индекс",				1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Район",				2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "НаселенныйПункт",		3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Улица",				4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Дом",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Корпус",				6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоЭтажей",		7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоПодъездов",	8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ОбщаяПлощадьЗдания",	9, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КоличествоКвартир",	10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипЛифта",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипПлиты",				12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ГодВводаВЭксплуатацию",13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ТипДома",				14, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КодКапРемонта",		15, );
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПоставщиковУслугМО;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,	6, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КраткоеНаименование",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПолноеНаимменование",	2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЮрАдрес",				3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ФактАдрес",			4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИНН",					5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "КПП",					6, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "БанковскиеРеквизиты",	7, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Телефон",				8, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ЭлектроннаяПочта",		10, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга1",				11, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга2",				12, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга3",				13, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Услуга4",				14, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетТФ"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШаблонОплаты(ЭтоКоманада, ШаблоныНаОбновление, НоваяВерсияШаблона)
	
	Если ЭтоКоманада
		ИЛИ ШаблоныНаОбновление = Неопределено
		ИЛИ ШаблоныНаОбновление.Найти("МакетОплаты") <> Неопределено
		  ИЛИ ШаблоныНаОбновление.Найти("МакетОплат") <> Неопределено Тогда
		
		// Шаблон загрузки информации о внесении платы исполнителем услуг.
		НШаблон								= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование				= "Шаблон загрузки информации оплаты";
		НШаблон.НомерНачальнойСтроки		= 2;
		НШаблон.ВерсияШаблона				= НоваяВерсияШаблона;
		НШаблон.ИмяМакета					= "МакетОплаты";
		НШаблон.ШаблонПлатежныхДокументов	= Истина;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплаты;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СистемныеПоляНомерПоПорядку",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Сумма",						2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаВнесения",					3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПериодОплаты",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторПД",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",				6, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетОплаты"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
		
		// Шаблон загрузки информации о внесении платы исполнителем услуг (кап. рем.).
		НШаблон								= Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.СоздатьЭлемент();
		НШаблон.Наименование				= "Шаблон загрузки информации оплаты (кап. рем)";
		НШаблон.НомерНачальнойСтроки		= 2;
		НШаблон.ВерсияШаблона				= НоваяВерсияШаблона;
		НШаблон.ИмяМакета					= "МакетОплаты";
		НШаблон.ШаблонПлатежныхДокументов	= Истина;
		
		ТаблицаШаблоновГИСЖКХ = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплатыКапРем;
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, ТаблицаШаблоновГИСЖКХ,			1, 2);
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "СистемныеПоляНомерПоПорядку",	1, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "Сумма",						2, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ДатаВнесения",					3, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ПериодОплаты",					4, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторПД",				5, );
		НСтрШаблона(НШаблон.ПоляШаблона, ТаблицаШаблоновГИСЖКХ, "ИдентификаторЖКУ",				6, );
		
		НШаблон.МакетСтраницы = Новый ХранилищеЗначения(Справочники.бит_ШаблоныВыгрузкиГИСЖКХ.ПолучитьМакет("МакетОплаты"));
		Попытка
			НШаблон.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает последний загруженный пользователем макет Excel для платежных документов.
// У каждого юр. лица свой уникальный макет платежных документов.
// Пользователь должен выполнять обновление макета платежных документов самостоятельно.
Функция ПолучитьПредыдущийМакетСтраницыПД();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ШаблоныВыгрузкиГИСЖКХ.Ссылка КАК Ссылка,
	|	бит_ШаблоныВыгрузкиГИСЖКХ.МакетСтраницы КАК МакетСтраницы
	|ИЗ
	|	Справочник.бит_ШаблоныВыгрузкиГИСЖКХ КАК бит_ШаблоныВыгрузкиГИСЖКХ
	|ГДЕ
	|	бит_ШаблоныВыгрузкиГИСЖКХ.ИмяМакета = ""МакетПД""
	|	И бит_ШаблоныВыгрузкиГИСЖКХ.Наименование = ""Шаблон импорт платежных документов""
	|	И НЕ бит_ШаблоныВыгрузкиГИСЖКХ.ПометкаУдаления
	|	И НЕ бит_ШаблоныВыгрузкиГИСЖКХ.ПользовательскийШаблон
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ШаблоныВыгрузкиГИСЖКХ.Код УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Попытка
			ДвДанные = Выборка.МакетСтраницы.Получить();
			Возврат ДвДанные;
		Исключение
			Возврат Неопределено
		КонецПопытки;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает последний загруженный пользователем макет Excel для платежных документов.
// У каждого юр. лица свой уникальный макет платежных документов.
// Пользователь должен выполнять обновление макета платежных документов самостоятельно.
Функция ПолучитьПредыдущийМакетСтраницыПД2020();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ШаблоныВыгрузкиГИСЖКХ.Ссылка КАК Ссылка,
	|	бит_ШаблоныВыгрузкиГИСЖКХ.МакетСтраницы КАК МакетСтраницы
	|ИЗ
	|	Справочник.бит_ШаблоныВыгрузкиГИСЖКХ КАК бит_ШаблоныВыгрузкиГИСЖКХ
	|ГДЕ
	|	бит_ШаблоныВыгрузкиГИСЖКХ.ИмяМакета = ""МакетПД2020""
	|	И бит_ШаблоныВыгрузкиГИСЖКХ.Наименование = ""Шаблон импорт платежных документов 2020""
	|	И НЕ бит_ШаблоныВыгрузкиГИСЖКХ.ПометкаУдаления
	|	И НЕ бит_ШаблоныВыгрузкиГИСЖКХ.ПользовательскийШаблон
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ШаблоныВыгрузкиГИСЖКХ.Код УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Попытка
			ДвДанные = Выборка.МакетСтраницы.Получить();
			Возврат ДвДанные;
		Исключение
			Возврат Неопределено
		КонецПопытки;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Заполнение строки табличной части шаблона.
Процедура НСтрШаблона(ТЧ, ИмяТаблицы, Поле, СтраницаКолонка = 0, НомерНачальнойСтроки = 0)
	
	НСтр = ТЧ.Добавить();
	НСтр.ИмяТаблицы			  = ИмяТаблицы;
	НСтр.Поле				  = Поле;
	НСтр.СтраницаКолонка	  = СтраницаКолонка;
	НСтр.НомерНачальнойСтроки = НомерНачальнойСтроки;
	
КонецПроцедуры

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	    	НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
