
#Область ДействияКомандФормы

&НаКлиенте
Процедура КомандаОбновитьОбъектыСистемы(Команда)
	
	ТекстСостояние =  НСтр("ru = 'Выполняется обновление объектов системы...'");
	Состояние(ТекстСостояние);
	
	ОбновитьОбъектыСистемы();
	
КонецПроцедуры //КомандаОбновитьОбъектыСистемы()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОбъектыСистемы()
	
	 бит_УправлениеОбъектамиСистемы.ОбновитьОбъектыСистемы();
	ТекстСообщения =  НСтр("ru = 'Объекты системы обновлены.'");
	 бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	
КонецПроцедуры // ОбновитьОбъектыСистемы()

#КонецОбласти