
#Область ДоступностьИБитыеСсылки

// Функция проверяет значение на "битую" ссылку.
//
// Параметры:
//  ЗначениеДляПроверки  – Произвольный.
//
// Возвращаемое значение:
//   ЗначениеДоступно   – Булево.
//
Функция СсылкаДоступна(ЗначениеДляПроверки) Экспорт
	
	ЗначениеДоступно = Истина;
	
	Если ЗначениеЗаполнено(ЗначениеДляПроверки) 
		И НЕ бит_ОбщегоНазначения.ЭтоПримитивныйТип(ЗначениеДляПроверки) Тогда
		
		Попытка
			ТекОбъект = ЗначениеДляПроверки.ПолучитьОбъект();
			Если ТекОбъект = Неопределено Тогда
				
				ЗначениеДоступно = Ложь;
				
			КонецЕсли; 
		Исключение
			ЗначениеДоступно = Ложь;
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ЗначениеДоступно;
	
КонецФункции // СсылкаДоступна()

// Процедура выполняет проверку наличия "битых" ссылок в шапке и табличных частях объекта.
//
// Параметры:
// 	ДокументОбъект - ДокументОбъект.
// 	МассивТипов    - МассивТипов.
// 	Отказ 		   - Булево.
//  РежимСообщений - Строка: "Нет","Все","Ошибки". По умолчанию "Все".
//
Процедура ПроверитьБитыеСсылкиВОбъекте(ДокументОбъект, Отказ, РежимСообщений = "Все") Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.бит_ЛицевыеСчета"));
	МассивТипов.Добавить(Тип("СправочникСсылка.бит_СписокЗданий"));
	
	// БИТ_ЖКХ 07.02.2014{{	
	Попытка
		
		ПараметрыСеанса.бит_ИспользоватьОграниченияПравДоступаНаУровнеЗаписей = Константы.бит_ИспользоватьОграниченияПравДоступаНаУровнеЗаписей.Получить();
		
		ИспользуетсяRLS = ПараметрыСеанса.бит_ИспользоватьОграниченияПравДоступаНаУровнеЗаписей; 
		
	Исключение
		// Если НЕ ИспользуетсяRLS Тогда.
		Возврат;
		// КонецЕсли;. 
	КонецПопытки;	
	// БИТ_ЖКХ 07.02.2014}}
	
	ВыводитьИнформацию = ?(ВРег(РежимСообщений) = "ВСЕ", Истина, Ложь);
	
	ОписаниеКонтроль = Новый ОписаниеТипов(МассивТипов);
	
	Заголовок = "Проверка прав доступа к объекту """+Строка(ДокументОбъект)+"""";
	
	МетаданныеОбъекта = ДокументОбъект.Метаданные();
	
	// Проверим шапку документа.
	ПроверенныеЗначения = Новый Соответствие;
	
	Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		
		МассивТиповРеквизита = Реквизит.Тип.Типы();
		
		Для каждого Элемент Из МассивТиповРеквизита Цикл
			
			Если ОписаниеКонтроль.СодержитТип(Элемент) Тогда
				
				ЗначениеДляПроверки = ДокументОбъект[Реквизит.Имя];
				
				Если ОписаниеКонтроль.СодержитТип(ТипЗнч(ЗначениеДляПроверки)) Тогда
					
					ТекстСообщения = "Нет доступа к реквизиту шапки документа """
					+Реквизит.Имя
					+""" .";
					
					ПроверитьДоступностьЗначения(ЗначениеДляПроверки
					,ПроверенныеЗначения
					,ТекстСообщения
					,Отказ
					,Заголовок
					,ВыводитьИнформацию);												
					
				КонецЕсли; 
				
			КонецЕсли; // Контроль доступа.
			
		КонецЦикла; // Цикл по типам.
		
	КонецЦикла; // Цикл по реквизитам.
	
	// Проверим табличные части.
	Для каждого ТабличнаяЧастьМета Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		ИмяТабЧасти 	  = ТабличнаяЧастьМета.Имя;
		МассивДляКонтроля = Новый Массив;
		
		Для каждого Реквизит Из ТабличнаяЧастьМета.Реквизиты Цикл
			
			МассивТиповРеквизита = Реквизит.Тип.Типы();
			
			Для каждого Элемент Из МассивТиповРеквизита Цикл
				
				Если ОписаниеКонтроль.СодержитТип(Элемент) Тогда
					МассивДляКонтроля.Добавить(Реквизит.Имя);
				КонецЕсли; // Контроль доступа.				
				
			КонецЦикла; // По типам.	
			
		КонецЦикла; // По реквизитам.
		
		ТабличнаяЧасть = ДокументОбъект[ИмяТабЧасти];
		
		ПроверенныеЗначения = Новый Соответствие;
		
		Для каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			
			Для каждого ИмяРеквизита Из МассивДляКонтроля Цикл
				
				ЗначениеДляПроверки = СтрокаТаблицы[ИмяРеквизита];
				
				Если ОписаниеКонтроль.СодержитТип(ТипЗнч(ЗначениеДляПроверки)) Тогда
					
					ТекстСообщения = "В строке № "
					+СтрокаТаблицы.НомерСтроки
					+" табличной части """
					+ТабличнаяЧастьМета.Синоним
					+""" нет доступа к реквизиту """
					+ИмяРеквизита
					+""".";
					
					ПроверитьДоступностьЗначения(ЗначениеДляПроверки
					,ПроверенныеЗначения
					,ТекстСообщения
					,Отказ
					,Заголовок
					,ВыводитьИнформацию);
					
				КонецЕсли;	   
				
			КонецЦикла; // По именам реквизитов.
			
		КонецЦикла; // По строкам таб. части.
		
	КонецЦикла; // По табличным частям.
	
КонецПроцедуры // ПроверитьБитыеСсылкиВОбъекте()

// Процедура выполняет проверку доступности значения ссылочного типа. 
//
// Параметры:
//  ЗначениеДляПроверки - СправочникСсылка.
//  ТекстСообщения      - Строка.
//  Отказ               - Булево.
//  Заголовок 			- Строка.
//  ВыводитьИнформацию  - Булево, по умолчанию Истина.
//
Процедура ПроверитьДоступностьЗначения(ЗначениеДляПроверки
	,ПроверенныеЗначения
	,ТекстСообщения
	,Отказ
	,Заголовок
	,ВыводитьИнформацию = Истина)
	
	ЗначениеДоступно = Истина;
	
	РезультатПредыдущихПроверок = ПроверенныеЗначения[ЗначениеДляПроверки];
	
	Если РезультатПредыдущихПроверок = Неопределено Тогда
		
		ЗначениеДоступно = СсылкаДоступна(ЗначениеДляПроверки);
		
	Иначе	
		
		ЗначениеДоступно = РезультатПредыдущихПроверок;
		
	КонецЕсли; 
	
	
	Если НЕ ЗначениеДоступно Тогда
		
		Отказ = Истина;
		
		Если ВыводитьИнформацию Тогда
			бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ,Заголовок,СтатусСообщения.Важное);
		КонецЕсли;
		
	КонецЕсли; 
	
	Если РезультатПредыдущихПроверок = Неопределено Тогда
		
		ПроверенныеЗначения.Вставить(ЗначениеДляПроверки,ЗначениеДоступно);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти