
#Область ПеременныеМодуля

Перем мСтруктураРедактированияКИ;        // Структура.

Перем мКопияНабораКонтактнойИнформации;  // Набор Записей.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	Документ       = Метаданные.Справочники.бит_ПодразделенияОрганизаций;
	ПравоИзменения = ПравоДоступа("Изменение", Документ);
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("ПравоИзменения"      , ПравоИзменения);
	КэшированныеЗначения.Вставить("АдресПодразделенияОрганизации", Неопределено);
	КэшированныеЗначения.Вставить("ТелефонПодразделенияОрганизации", Неопределено);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура обновление заголовка.
//
&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	ЭтаФорма.Заголовок = "Подразделение организации: "+ Объект.Владелец;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	РазместитьКонтактнуюИнформацию();
	
	ПолеКИ1           = ПолучитьДанныеИзКонтактнойИнформации("Телефон"                , "АдресПодразделенияОрганизации");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПодразделенияОрганизации"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.Адрес) Тогда
		
		КонтактнаяИнформацияПолеАдресПодразделенияОрганизации = Объект.Адрес;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеАдресПодразделенияОрганизации = ПолеКИ1;
		
	Иначе
		
		КонтактнаяИнформацияПолеАдресПодразделенияОрганизации = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ1 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеАдресПодразделенияОрганизации = Строки[0].Представление;
		
	КонецЕсли;	
	
	
	ПолеКИ2           = ПолучитьДанныеИзКонтактнойИнформации("ВебСтраница"                , "ТелефонПодразделенияОрганизации");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПодразделенияОрганизации"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.Телефон) Тогда
		
		КонтактнаяИнформацияПолеТелефонПодразделенияОрганизации = Объект.Телефон;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеТелефонПодразделенияОрганизации = ПолеКИ2;
		
	Иначе
		
		КонтактнаяИнформацияПолеТелефонПодразделенияОрганизации = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ2 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеТелефонПодразделенияОрганизации = Строки[0].Представление;
		
	КонецЕсли;		
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мКэшЗначений.АдресПодразделенияОрганизации = Элементы.КонтактнаяИнформацияПолеАдресПодразделенияОрганизации.ТекстРедактирования;
	мКэшЗначений.ТелефонПодразделенияОрганизации = Элементы.КонтактнаяИнформацияПолеТелефонПодразделенияОрганизации.ТекстРедактирования;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Адрес = мКэшЗначений.АдресПодразделенияОрганизации;
	ТекущийОбъект.Телефон = мКэшЗначений.ТелефонПодразделенияОрганизации;
	
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры
// БИТ_ЖКХ 25.03.2014

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

//  Процедура - обработчик события "ПриИзменении" поля ввода "Владелец"
// 
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ОбновитьЗаголовок();
КонецПроцедуры

//&НаКлиенте
//Процедура АдресПодразделенияОрганизацииПриИзменении(Элемент)
//	
//	Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура АдресПодразделенияОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//	
//КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПодсистемыКонтактнаяИнформация

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация


//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
//	
//	// БИТ_ЖКХ 16.08.2016 18:29:31 Начало правки... 
//	//УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
//	МодульУправлениеКонтактнойИнформациейКлиент =
//		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
//	
//	МодульУправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
//	// БИТ_ЖКХ 16.08.2016 18:29:34 Конец правки. 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	//Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, , СтандартнаяОбработка);
//	Результат = бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
//	
//	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеОчистка(ЭтаФорма, Элемент.Имя);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
//	
//	Результат = УправлениеКонтактнойИнформациейКлиент.ПодключаемаяКоманда(ЭтаФорма, Команда.Имя);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВводаАдреса(ЭтаФорма, Результат);
//	
//КонецПроцедуры

//&НаСервере
//Функция ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
//	
//	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтаФорма, Объект, Результат);
//	
//КонецФункции

//// БИТ_ЖКХ 31.12.2015 11:26:31 Начало правки... 
//&НаСервере
//Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
//	
//	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтаФорма, Объект, Результат);
//	
//КонецФункции
//// БИТ_ЖКХ 31.12.2015 11:26:34 Конец правки. 

&НаСервере
Процедура РазместитьКонтактнуюИнформацию()
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИсключаемыеВиды = Новый Массив;
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПодразделенияОрганизации);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонПодразделенияОрганизации);
	
	ДополнительныеПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметрыКонтактнойИнформации.ОтложеннаяИнициализация = Ложь;
	ДополнительныеПараметрыКонтактнойИнформации.ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ДополнительныеПараметрыКонтактнойИнформации.ИсключаемыеВиды = ИсключаемыеВиды;
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметрыКонтактнойИнформации);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	//бит_УправлениеКонтактнойИнформациейНовый.бит_ПриСозданииНаСервере(ЭтаФорма, Объект, "АдресаИТелефоны", "");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеИзКонтактнойИнформации(Тип, Вид)
	
	ТипВЗапросе = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;
	ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.АдресПодразделенияОрганизации;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|ГДЕ
	|	бит_КонтактнаяИнформация.Объект = &Объект
	|	И бит_КонтактнаяИнформация.Тип = &Тип
	|	И бит_КонтактнаяИнформация.Вид = &Вид");
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.УстановитьПараметр("Тип"   , ТипВЗапросе);
	Запрос.УстановитьПараметр("Вид"   , ВидВЗапросе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредставлениеАдреса = "";
	
	Если Выборка.Следующий() Тогда
		
		ПредставлениеАдреса = Выборка.Представление;
		
	КонецЕсли;
	
	Возврат ПредставлениеАдреса;
	
КонецФункции

&НаКлиенте
Процедура СокращенноеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец",Объект.Ссылка);
	
	ОткрытьФорму("Справочник.бит_СокращенныеНаименованияПодразделений.Форма.ФормаВыбора",Новый Структура("ОткрытьИзПодразделенийОрганизации",ПараметрыФормы),ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если Строка(типзнч(ВыбранноеЗначение)) = "Сокращенные наименования подразделений " Тогда
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			Объект.СокращенноеНаименование = ВыбранноеЗначение;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

#КонецОбласти