
#Область ЭкспортныеПроцедурыИФункции

// Процедура заполняет дерево документов введеных ранее. 
//
// Параметры: 
//
//	Оплата       - ДокументСсылка - Текущийд документ оплаты ку.
// 
//	ДеревоПКО    - ДеревоЗначение - Реквизит формы.
//
//	ЭлементФормы - ЭлементФормы   - ЭлементФормы дерева значений.
//
Процедура ЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Комментарий,
	|	ПриходныйКассовыйОрдер.СуммаДокумента,
	|	ПриходныйКассовыйОрдер.СчетКасса,
	|	ПриходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдер.бит_ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.ДокументОснование = &Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Комментарий,
	|	ПоступлениеНаРасчетныйСчет.СуммаДокумента,
	|	ПоступлениеНаРасчетныйСчет.СчетБанк,
	|	ПоступлениеНаРасчетныйСчет.СтатьяДвиженияДенежныхСредств,
	|	ПоступлениеНаРасчетныйСчет.бит_ЛицевойСчет
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ДокументОснование = &Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаПлатежнойКартой.Ссылка,
	|	ОплатаПлатежнойКартой.Комментарий,
	|	ОплатаПлатежнойКартой.СуммаДокумента,
	|	ОплатаПлатежнойКартой.СчетКасса,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ОплатаПлатежнойКартой.бит_ЛицевойСчет
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	|ГДЕ
	|	ОплатаПлатежнойКартой.ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Оплата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Запрос.Выполнить().Пустой() Тогда
	НовыйЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы);
		Возврат;	
	КонецЕсли;
	
	ПервыйУровень = ДеревоПКО.Строки.Найти(Оплата,"ПриходныйКассовыйОредер");
	
	Если ПервыйУровень = Неопределено Тогда
		
		ПервыйУровень = ДеревоПКО.Строки.Добавить();
		ПервыйУровень.ПриходныйКассовыйОредер = Оплата;	
		ПервыйУровень.Сумма                   = Оплата.СуммаДокумента;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ВторойУровень  = ПервыйУровень.Строки.Найти(Выборка.Ссылка,"ПриходныйКассовыйОредер");
		
		Если ВторойУровень = Неопределено Тогда
			
			ВторойУровень =	ПервыйУровень.Строки.Добавить();
			ВторойУровень.ПриходныйКассовыйОредер  = Выборка.Ссылка;
			ВторойУровень.Сумма                    = Выборка.СуммаДокумента;
			ВторойУровень.СтатьяДвиженийДенСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			ВторойУровень.СчетУчета                = Выборка.СчетКасса;
			ВторойУровень.ЛицевойСчет              = Выборка.ЛицевойСчет;
			
		КонецЕсли;
		
		Если ВторойУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
			
			ВторойУровень.НомерКартинки = 1;
			
		ИначеЕсли ВторойУровень.ПриходныйКассовыйОредер.Проведен Тогда
			
			ВторойУровень.НомерКартинки = 0;
		Иначе 
			ВторойУровень.НомерКартинки = 2;
		КонецЕсли;	
		// БИТ_ЖКХ 20.08.2014
		
	КонецЦикла; 
	
	Если ПервыйУровень.Строки.Количество() = 0 Тогда
		
		ДеревоПКО.Удалить(ПервыйУровень);	
		
	КонецЕсли;
	
	НовыйЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы);
	
КонецПроцедуры //ЗаполнитьДеревоПКО()

// Процедура заполняет дерево документов введеных ранее со счетами. 
//
// Параметры: 
//
//	Оплата       - ДокументСсылка - Текущийд документ оплаты ку.
// 
//	ДеревоПКО    - ДеревоЗначение - Реквизит формы.
//
//	ЭлементФормы - ЭлементФормы   - ЭлементФормы дерева значений.
//
Процедура НовыйЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы)  Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.бит_ДокументОснование КАК бит_ДокументОснование,
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.бит_ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Оплата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивОснование = Новый Массив();
	Пока Выборка.Следующий() цикл
	МассивОснование.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдер.Комментарий КАК Комментарий,
	|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
	|	ПриходныйКассовыйОрдер.СчетКасса КАК СчетКасса,
	|	ПриходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдер.бит_ЛицевойСчет КАК ЛицевойСчет,
	|	ПриходныйКассовыйОрдер.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.ДокументОснование В(&МассивОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Комментарий,
	|	ПоступлениеНаРасчетныйСчет.СуммаДокумента,
	|	ПоступлениеНаРасчетныйСчет.СчетБанк,
	|	ПоступлениеНаРасчетныйСчет.СтатьяДвиженияДенежныхСредств,
	|	ПоступлениеНаРасчетныйСчет.бит_ЛицевойСчет,
	|	ПоступлениеНаРасчетныйСчет.ДокументОснование
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ДокументОснование В(&МассивОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаПлатежнойКартой.Ссылка,
	|	ОплатаПлатежнойКартой.Комментарий,
	|	ОплатаПлатежнойКартой.СуммаДокумента,
	|	ОплатаПлатежнойКартой.СчетКасса,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ОплатаПлатежнойКартой.бит_ЛицевойСчет,
	|	ОплатаПлатежнойКартой.ДокументОснование
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	|ГДЕ
	|	ОплатаПлатежнойКартой.ДокументОснование В(&МассивОснование)";
	
	Запрос.УстановитьПараметр("МассивОснование", МассивОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Запрос.Выполнить().Пустой() Тогда
		Элементформы.НачальноеОтображениеДерева  = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		Возврат;	
	КонецЕсли;
	
	ПервыйУровень = ДеревоПКО.Строки.Найти(Оплата,"ПриходныйКассовыйОредер");
	
	Если ПервыйУровень = Неопределено Тогда
		
		ПервыйУровень = ДеревоПКО.Строки.Добавить();
		ПервыйУровень.ПриходныйКассовыйОредер = Оплата;	
		ПервыйУровень.Сумма                   = Оплата.СуммаДокумента;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ВторойУровень  = ПервыйУровень.Строки.Найти(Выборка.ДокументОснование,"ПриходныйКассовыйОредер");
		
		Если ВторойУровень = Неопределено Тогда
			
			ВторойУровень =	ПервыйУровень.Строки.Добавить();
			ВторойУровень.ПриходныйКассовыйОредер  = Выборка.ДокументОснование;
			ВторойУровень.Сумма                    = Выборка.СуммаДокумента;
			ВторойУровень.СтатьяДвиженийДенСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			ВторойУровень.СчетУчета                = Выборка.СчетКасса;
			ВторойУровень.ЛицевойСчет              = Выборка.ЛицевойСчет;
			
		КонецЕсли;
		
				
		ТретийУровень  = ВторойУровень.Строки.Найти(Выборка.Ссылка,"ПриходныйКассовыйОредер");
		
		Если ТретийУровень = Неопределено Тогда
			
			ТретийУровень =	ВторойУровень.Строки.Добавить();
			ТретийУровень.ПриходныйКассовыйОредер  = Выборка.Ссылка;
			ТретийУровень.Сумма                    = Выборка.СуммаДокумента;
			ТретийУровень.СтатьяДвиженийДенСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			ТретийУровень.СчетУчета                = Выборка.СчетКасса;
			ТретийУровень.ЛицевойСчет              = Выборка.ЛицевойСчет;
			
		КонецЕсли;
		
		Если ВторойУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
			
			ВторойУровень.НомерКартинки = 1;
			
		ИначеЕсли ВторойУровень.ПриходныйКассовыйОредер.Проведен Тогда
			
			ВторойУровень.НомерКартинки = 0;
		Иначе 
			ВторойУровень.НомерКартинки = 2;
		КонецЕсли;	
		// БИТ_ЖКХ 20.08.2014
		
		Если ТретийУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
			
			ТретийУровень.НомерКартинки = 1;
			
		ИначеЕсли ТретийУровень.ПриходныйКассовыйОредер.Проведен Тогда
			
			ТретийУровень.НомерКартинки = 0;
		Иначе 
			ТретийУровень.НомерКартинки = 2;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ПервыйУровень.Строки.Количество() = 0 Тогда
		
		ДеревоПКО.Удалить(ПервыйУровень);	
		
	КонецЕсли;
	
	Элементформы.НачальноеОтображениеДерева  = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры //ЗаполнитьДеревоПКО()

#КонецОбласти