#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мПодкруткаНаЛС       Экспорт; // Хранит флаг настройки ЖКХ.
Перем мСчетчикиПодкрутка   Экспорт; // Хранит флаг настройки ЖКХ.
Перем мВариантПодкрутки Экспорт; // Хранит флаг настройки ЖКХ.
Перем мКоличествоМесяцевПодкрутки Экспорт; // Хранит флаг настройки ЖКХ.

Перем колвоМесяцевПодкрутки;

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

Процедура ОбновитьПараметрыЖКХ() Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("СчетчикиПодкрутка"         , Ложь);
	ПараметрыЖКХ.Вставить("ПодкруткаНаЛС"             , Ложь);
	ПараметрыЖКХ.Вставить("ВариантПодкрутки"         , Перечисления.бит_ВариантыПодкрутки.ПустаяСсылка());
	ПараметрыЖКХ.Вставить("КоличествоМесяцевПодкрутки", 0);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Организация, ПараметрыЖКХ);
	
	мПодкруткаНаЛС              = ПараметрыЖКХ.ПодкруткаНаЛС;
	мСчетчикиПодкрутка          = ПараметрыЖКХ.СчетчикиПодкрутка;
	мВариантПодкрутки           = ПараметрыЖКХ.ВариантПодкрутки;
	мКоличествоМесяцевПодкрутки = ПараметрыЖКХ.КоличествоМесяцевПодкрутки;
	
КонецПроцедуры

//  Процедура выполняет заполнение таблицы показаний.
//
Процедура ЗаполнитьТаблицуПоказаний(СортироватьПоНомеруКвартиры = ложь) Экспорт
	
	колвоМесяцевПодкрутки = 0;
	
	ОбновитьПараметрыЖКХ();
	
	ПоказанияПоСчетчикам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ТипСчетчика", ТипСчетчика);
	
	Если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив Тогда
		мКоличествоМесяцевПодкрутки = 3;
	КонецЕсли;
	
    //4.11.2018
	Если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив Тогда
		//22.02.2019
		мКоличествоМесяцевПодкрутки = 6;
	КонецЕсли;

	Если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоНорме Тогда
		//9.04.2019
		мКоличествоМесяцевПодкрутки = 0;
	КонецЕсли;

	
	Запрос.УстановитьПараметр("КолМесяцевПодкрутка", мКоличествоМесяцевПодкрутки);
	
	Если мКоличествоМесяцевПодкрутки = 0 Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		
	Иначе
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДобавитьМесяц(Дата, -мКоличествоМесяцевПодкрутки)));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДобавитьМесяц(Дата, -1)));
		
	КонецЕсли; 
	
	ТекстУсловия = "ТипСчетчика = &ТипСчетчика";
	
	Если ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		
		Если Не Дом = Справочники.бит_СписокЗданий.ПустаяСсылка() Тогда    // по дому.
			Запрос.УстановитьПараметр("Объект",Дом);
			ТекстУсловия = ТекстУсловия + " И Объект = &Объект";
		ИначеЕсли НЕ Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда    // по улице.
			Запрос.УстановитьПараметр("Улица",Улица);
			ТекстУсловия = ТекстУсловия + " И Объект.Улица = &Улица"
		// БИТ ЖКХ 19.10.2020	
		ИначеЕсли СортироватьПоНомеруКвартиры = истина И НЕ Квартира = Справочники.бит_Квартиры.ПустаяСсылка() Тогда    // по квартире.
			Запрос.УстановитьПараметр("Квартира", Квартира);
			ТекстУсловия = ТекстУсловия + " И Объект.Квартира = &Квартира"
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЛицевойСчет = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда // по лицевому счету.
			Запрос.УстановитьПараметр("Объект",ЛицевойСчет);
			ТекстУсловия = ТекстУсловия + " И Объект = &Объект";
		ИначеЕсли Не Дом = Справочники.бит_СписокЗданий.ПустаяСсылка() Тогда    // по дому.
			Запрос.УстановитьПараметр("Здание",Дом);
			ТекстУсловия = ТекстУсловия + " И Объект.Здание = &Здание";
		ИначеЕсли НЕ Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда    // по улице.
			Запрос.УстановитьПараметр("Улица",Улица);
			ТекстУсловия = ТекстУсловия + " И Объект.УлицаЛицевогоСчета = &Улица"
		КонецЕсли;	
		// БИТ ЖКХ 26.10.2020	
		Если СортироватьПоНомеруКвартиры = истина тогда
			Если НЕ Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() И 
				  Не Дом = Справочники.бит_СписокЗданий.ПустаяСсылка() И
				   НЕ Квартира = Справочники.бит_Квартиры.ПустаяСсылка() Тогда    // по квартире.
				Запрос.УстановитьПараметр("Квартира", Квартира);
				ТекстУсловия = ТекстУсловия + " И Объект.Квартира = &Квартира"
			КонецЕсли;
		конецесли;
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный КАК Многотарифный,
	|	бит_СчетчикиНаУслугахСрезПоследних.Период КАК Период,
	|	бит_СчетчикиНаУслугахСрезПоследних.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	|	бит_СчетчикиНаУслугахСрезПоследних.ОсновнаяУслуга КАК ОсновнаяУслуга
	|ПОМЕСТИТЬ Счетчики
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, "+ ТекстУсловия +") КАК бит_СчетчикиНаУслугахСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счетчики.Объект КАК Объект,
	|	Счетчики.Услуга КАК Услуга,
	|	Счетчики.Счетчик КАК Счетчик,
	|	Счетчики.Разрядность КАК Разрядность,
	|	Счетчики.Приоритет КАК Приоритет,
	|	Счетчики.Многотарифный КАК Многотарифный,
	|	Счетчики.Период КАК Период,
	|	Счетчики.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	|	Счетчики.ОсновнаяУслуга КАК ОсновнаяУслуга
	|ПОМЕСТИТЬ Счетчики_Полн
	|ИЗ
	|	Счетчики КАК Счетчики
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик.Разрядность,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.Приоритет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	|				И Счетчик В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Таб.Счетчик
	|					ИЗ
	|						Счетчики КАК Таб)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Счетчики_Полн.Счетчик КАК Счетчик
	|ПОМЕСТИТЬ ВТ_Счетчики
	|ИЗ
	|	Счетчики_Полн КАК Счетчики_Полн
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПоказанияСчетчиков.Объект КАК ЛицевойСчет,
	|	бит_ПоказанияСчетчиков.Услуга КАК УслугаЖКХ,
	|	бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиков.ПоказанияПодкрутка КАК ПоказанияПодкрутка
	|ПОМЕСТИТЬ ВТ_ПоказанияПодкрутки
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Счетчики КАК ВТ_Счетчики
	|		ПО бит_ПоказанияСчетчиков.Счетчик = ВТ_Счетчики.Счетчик
	|ГДЕ
	|	бит_ПоказанияСчетчиков.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_ПоказанияСчетчиков.Объект,
	|	бит_ПоказанияСчетчиков.Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказанияПодкрутки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ПоказанияПодкрутки.УслугаЖКХ КАК УслугаЖКХ,
	|	ВТ_ПоказанияПодкрутки.Счетчик КАК Счетчик,
	|	СУММА(1) КАК КоличествоМесяцев,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПоказанияПодкрутки.ПоказанияПодкрутка = 0
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоМесяцевПодкрутки
	|ПОМЕСТИТЬ ВТ_ПоказанияПодкруткиИтого
	|ИЗ
	|	ВТ_ПоказанияПодкрутки КАК ВТ_ПоказанияПодкрутки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоказанияПодкрутки.ЛицевойСчет,
	|	ВТ_ПоказанияПодкрутки.УслугаЖКХ,
	|	ВТ_ПоказанияПодкрутки.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_КолЕдиницПоСчетчикамОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_КолЕдиницПоСчетчикамОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_КолЕдиницПоСчетчикамОбороты.Счетчик КАК Счетчик,
	|	СУММА(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдиницПоЛСОборот + бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдПодкруткаОборот) КАК КоличествоЕдиниц
	|ПОМЕСТИТЬ ВТ_КолЕдиницПоСчетчикам
	|ИЗ
	|	РегистрНакопления.бит_КолЕдиницПоСчетчикам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счетчик В
	|				(ВЫБРАТЬ
	|					ВТ_Счетчики.Счетчик
	|				ИЗ
	|					ВТ_Счетчики КАК ВТ_Счетчики)) КАК бит_КолЕдиницПоСчетчикамОбороты
	|ГДЕ
	|	НЕ бит_КолЕдиницПоСчетчикамОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_КолЕдиницПоСчетчикамОбороты.ЛицевойСчет,
	|	бит_КолЕдиницПоСчетчикамОбороты.УслугаЖКХ,
	|	бит_КолЕдиницПоСчетчикамОбороты.Счетчик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПоказанияПодкруткиИтого.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ПоказанияПодкруткиИтого.УслугаЖКХ КАК УслугаЖКХ,
	|	ВТ_ПоказанияПодкруткиИтого.Счетчик КАК Счетчик,
	|	ЕСТЬNULL(ВТ_КолЕдиницПоСчетчикам.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	|	ВТ_ПоказанияПодкруткиИтого.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВТ_ПоказанияПодкруткиИтого.КоличествоМесяцевПодкрутки КАК КоличествоМесяцевПодкрутки
	|ПОМЕСТИТЬ КолЕд
	|ИЗ
	|	ВТ_ПоказанияПодкруткиИтого КАК ВТ_ПоказанияПодкруткиИтого
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолЕдиницПоСчетчикам КАК ВТ_КолЕдиницПоСчетчикам
	|		ПО ВТ_ПоказанияПодкруткиИтого.ЛицевойСчет = ВТ_КолЕдиницПоСчетчикам.ЛицевойСчет
	|			И ВТ_ПоказанияПодкруткиИтого.УслугаЖКХ = ВТ_КолЕдиницПоСчетчикам.УслугаЖКХ
	|			И ВТ_ПоказанияПодкруткиИтого.Счетчик = ВТ_КолЕдиницПоСчетчикам.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПоказанияСчетчиковОстатки.Объект КАК Объект,
	|	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
	|	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПредыдущиеПоказания
	|ПОМЕСТИТЬ ВТ_ПоказанияСчетчиков
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|			&Дата,
	|			(Объект, Услуга, Счетчик) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Счетчики_Полн.Объект,
	|					Счетчики_Полн.Услуга,
	|					Счетчики_Полн.Счетчик
	|				ИЗ
	|					Счетчики_Полн КАК Счетчики_Полн)) КАК бит_ПоказанияСчетчиковОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
	|ПОМЕСТИТЬ ВТ_Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Счетчики_Полн.Объект
	|				ИЗ
	|					Счетчики_Полн КАК Счетчики_Полн
	|				ГДЕ
	|					Счетчики_Полн.Объект ССЫЛКА Справочник.бит_ЛицевыеСчета)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать КАК Использовать,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	ВТ_Проживающие.КолПроживающих КАК КолПроживающих
	|ПОМЕСТИТЬ ВТ_Сведения
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			(ЛицевойСчет, Услуга) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Счетчики_Полн.Объект,
	|					Счетчики_Полн.Услуга
	|				ИЗ
	|					Счетчики_Полн КАК Счетчики_Полн
	|				ГДЕ
	|					Счетчики_Полн.Объект ССЫЛКА Справочник.бит_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проживающие КАК ВТ_Проживающие
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_Проживающие.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	РежимПотребления,
	|	СпособРасчета,
	|	ТипКвартиры,
	|	СтатусКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сведения.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Сведения.Услуга КАК Услуга,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(ВТ_Сведения.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	ВЫБОР
	|		КОГДА ВТ_Сведения.РежимПотребления = ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.Нет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УслугаОтключена
	|ПОМЕСТИТЬ ВТ_Нормы
	|ИЗ
	|	ВТ_Сведения КАК ВТ_Сведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Дата, ) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО ВТ_Сведения.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И ВТ_Сведения.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И ВТ_Сведения.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И ВТ_Сведения.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|			И ВТ_Сведения.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счетчики_Полн.Объект КАК Объект,
	|	Счетчики_Полн.Услуга КАК Услуга,
	|	Счетчики_Полн.Счетчик КАК Счетчик,
	|	Счетчики_Полн.Счетчик.Разрядность КАК Разрядность,
	|	ЕСТЬNULL(ВТ_ПоказанияСчетчиков.ПредыдущиеПоказания, 0) КАК ПредыдущиеПоказания,
	|	ЕСТЬNULL(ВТ_Нормы.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(ВТ_Нормы.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(ВТ_Нормы.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(ВТ_Нормы.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(ВТ_Нормы.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(ВТ_Нормы.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(ВТ_Нормы.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	Счетчики_Полн.Услуга.Приоритет КАК Приоритет,
	|	Счетчики_Полн.Многотарифный КАК Многотарифный,
	|	ЕСТЬNULL(КолЕд.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(Счетчики_Полн.Период, &КонецПериода, МЕСЯЦ) + 1 > &КолМесяцевПодкрутка
	|			ТОГДА &КолМесяцевПодкрутка
	|		ИНАЧЕ РАЗНОСТЬДАТ(Счетчики_Полн.Период, &КонецПериода, МЕСЯЦ) + 1
	|	КОНЕЦ КАК КоличествоМесяцев,
	|	ЕСТЬNULL(КолЕд.КоличествоМесяцевПодкрутки, 0) КАК КоличествоМесяцевПодкрутки,
	|	ЕСТЬNULL(ВТ_Нормы.УслугаОтключена, ЛОЖЬ) КАК УслугаОтключена,
	|	Счетчики_Полн.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	|	Счетчики_Полн.ОсновнаяУслуга КАК ОсновнаяУслуга
	|ИЗ
	|	Счетчики_Полн КАК Счетчики_Полн
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказанияСчетчиков КАК ВТ_ПоказанияСчетчиков
	|		ПО Счетчики_Полн.Объект = ВТ_ПоказанияСчетчиков.Объект
	|			И Счетчики_Полн.Услуга = ВТ_ПоказанияСчетчиков.Услуга
	|			И Счетчики_Полн.Счетчик = ВТ_ПоказанияСчетчиков.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Нормы КАК ВТ_Нормы
	|		ПО ((ВЫРАЗИТЬ(Счетчики_Полн.Объект КАК Справочник.бит_ЛицевыеСчета)) = ВТ_Нормы.ЛицевойСчет)
	|			И Счетчики_Полн.Услуга = ВТ_Нормы.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ КолЕд КАК КолЕд
	|		ПО Счетчики_Полн.Услуга = КолЕд.УслугаЖКХ
	|			И ((ВЫРАЗИТЬ(Счетчики_Полн.Объект КАК Справочник.бит_ЛицевыеСчета)) = КолЕд.ЛицевойСчет)
	|			И Счетчики_Полн.Счетчик = КолЕд.Счетчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(КоличествоМесяцевПодкрутки),
	|	МИНИМУМ(УслугаОтключена),
	|	МАКСИМУМ(СчетчикСЗависимымиУслугами)
	|ПО
	|	Счетчик";
	
	тмпТаблицаПоказаний = ПоказанияПоСчетчикам.ВыгрузитьКолонки();
	тмпТаблицаПоказаний.Колонки.Добавить("Приоритет", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	тмпТаблицаПоказаний.Колонки.Добавить("КоличествоМесяцевПодкруткиПодряд", ОбщегоНазначения.ОписаниеТипаЧисло(4, 0));
	
	ВыборкаСч = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСч.Следующий() Цикл
		
		ТекПоказания = 0;
		Показания    = 0;
		Выборка      = ВыборкаСч.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.СчетчикСЗависимымиУслугами И НЕ Выборка.ОсновнаяУслуга Тогда
				Продолжить;
			КонецЕсли; 
			
			НовСтрока = тмпТаблицаПоказаний.Добавить();
			
			Если Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда
				Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
					НовСтрока.Улица = Выборка.Объект.Улица;
				Иначе
					НовСтрока.Улица = Выборка.Объект.УлицаЛицевогоСчета;
				КонецЕсли;
			Иначе
				НовСтрока.Улица = Улица;
			КонецЕсли;
			
			Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
				НовСтрока.Дом = Выборка.Объект;
			Иначе
				НовСтрока.ЛицевойСчет = Выборка.Объект;
				НовСтрока.Дом = Выборка.Объект.Здание;
			КонецЕсли;
			
			НовСтрока.Счетчик = Выборка.Счетчик;
			НовСтрока.Услуга = Выборка.Услуга;
			НовСтрока.Разрядность         = Выборка.Разрядность;
			НовСтрока.ПредыдущиеПоказания = Выборка.ПредыдущиеПоказания;
			НовСтрока.Многотарифный       = Выборка.Многотарифный;
			НовСтрока.Приоритет           = Выборка.Приоритет;
			НовСтрока.УслугаОтключена     = Выборка.УслугаОтключена;			
									
			Если ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки И НЕ ВыборкаСч.УслугаОтключена Тогда
				
				// 25.02.2019
				// 25.04.2019
				если мКоличествоМесяцевПодкрутки <> 0 тогда  
				 НовСтрока.КоличествоМесяцевПодкруткиПодряд = ПолучитьКолвоПодкрутокПодряд(Запрос.Параметры.КонецПериода, НовСтрока.Счетчик, Выборка.Объект, НовСтрока.Услуга, мКоличествоМесяцевПодкрутки);
				конецесли;  
				
				Если НЕ мСчетчикиПодкрутка Тогда
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Подкрутка счетчиков не ведется по этой организации!";
					Сообщение.Сообщить();
					
					ПоказанияПоСчетчикам.Очистить();
					Возврат;
					
				КонецЕсли; 
				
				Если ТекПоказания <> 0 И НЕ Выборка.Многотарифный Тогда
					
					Если НовСтрока.ПредыдущиеПоказания > 0 Тогда
						
						НовСтрока.ТекущиеПоказания           = ТекПоказания;
						НовСтрока.КоличествоЕдиницПоСчетчику = Показания;
					Иначе
						НовСтрока.ТекущиеПоказания           = 0;
						НовСтрока.КоличествоЕдиницПоСчетчику = 0;
					КонецЕсли;
					
				Иначе
					
					Показания = 0;
					
					// Норма только один раз по услуге.
					МассивПодкруток = Новый Массив;
					Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
						МассивПодкруток = тмпТаблицаПоказаний.НайтиСтроки(Новый Структура("Дом, Услуга", Выборка.Объект, Выборка.Услуга));
					Иначе	
						МассивПодкруток = тмпТаблицаПоказаний.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", Выборка.Объект, Выборка.Услуга));
					КонецЕсли;
					Если МассивПодкруток.Количество() = 1 Тогда
						
						Если (мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднему
							И ВыборкаСч.КоличествоМесяцевПодкрутки < мКоличествоМесяцевПодкрутки)
					// 4.12.2018
							 ИЛИ (( мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив ИЛИ
							         мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив )

							// И ВыборкаСч.КоличествоМесяцевПодкрутки < 3)  Тогда
                            // 25.02.2019
							И НовСтрока.КоличествоМесяцевПодкруткиПодряд < 3)  Тогда

							
							 Если Выборка.КоличествоМесяцев > 0 Тогда
								
							 // 05.04.2019 
							  если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив или
								    мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив	тогда
								 
							    если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив тогда
								 Показания = Окр(Выборка.КоличествоЕдиниц / 3, 4);
							    конецесли;	
							
							    если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив тогда
								 Показания = Окр(Выборка.КоличествоЕдиниц / 6, 4);
							    конецесли;

							  иначе	
							   Если Выборка.КоличествоМесяцев > 0 Тогда
							     Показания = Окр(Выборка.КоличествоЕдиниц / Выборка.КоличествоМесяцев,4);
							   КонецЕсли; 
							  конецесли; 

								
							 КонецЕсли; 
							
						Иначе
							
							Норма     = 0;
							
							Если мПодкруткаНаЛС Тогда
								
								Показания = Окр(Выборка.НаЛицевойСчет, 4);
								
							Иначе
								
								КолПроживающих = ?(Выборка.КолПроживающих = 0, 1, Выборка.КолПроживающих);
								
								Если КолПроживающих = 1 тогда
									Норма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
								ИначеЕсли КолПроживающих = 2 тогда
									Норма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2; 
								ИначеЕсли КолПроживающих = 3 тогда
									Норма  = Выборка.НаСемью * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;  
								ИначеЕсли КолПроживающих = 4 тогда
									Норма  = Выборка.НаСемью4 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;  
								ИначеЕсли КолПроживающих = 5 тогда
									Норма  = Выборка.НаСемью5 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;  
								ИначеЕсли КолПроживающих > 5 тогда
									Норма  = Выборка.НаСемью6 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
								КонецЕсли;
								
								Показания = Окр(Норма, 4);
								
							КонецЕсли; 
							
						КонецЕсли;
					ИначеЕсли МассивПодкруток.Количество() > 1 
						И ((мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднему
							И ВыборкаСч.КоличествоМесяцевПодкрутки < мКоличествоМесяцевПодкрутки)
						    // 4.12.2018	
						     ИЛИ ((мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив ИЛИ
						        мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив )

							// И ВыборкаСч.КоличествоМесяцевПодкрутки < 3)  Тогда
                            // 25.02.2019
							И НовСтрока.КоличествоМесяцевПодкруткиПодряд < 3))  Тогда

							// 05.04.2019 
							 если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив или
								    мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив	тогда

							   если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив тогда
								Показания = Окр(Выборка.КоличествоЕдиниц / 3, 4);
							   конецесли;	
							
							   если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив тогда
								Показания = Окр(Выборка.КоличествоЕдиниц / 6, 4);
							   конецесли;
                             иначе
							   Если Выборка.КоличествоМесяцев > 0 Тогда
							     Показания = Окр(Выборка.КоличествоЕдиниц / Выборка.КоличествоМесяцев,4);
							   КонецЕсли; 
							 конецесли;

					КонецЕсли; 
					
					Если НовСтрока.ПредыдущиеПоказания > 0 Тогда
						
						ТекПоказания = НовСтрока.ПредыдущиеПоказания + Показания;
					Иначе
						ТекПоказания = 0;
						Показания = 0;
					КонецЕсли;
					
					Если ТекПоказания > НовСтрока.Разрядность Тогда
						ТекПоказания = ТекПоказания - НовСтрока.Разрядность + 1;
						Показания    = Показания    + 1 ;
					КонецЕсли;
					
					НовСтрока.ТекущиеПоказания           = ТекПоказания;
					НовСтрока.КоличествоЕдиницПоСчетчику = Показания;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	тмпТаблицаПоказаний.Сортировать("Дом Возр, ЛицевойСчет Возр, Счетчик Возр, Приоритет Возр");
	ПоказанияПоСчетчикам.Загрузить(тмпТаблицаПоказаний);
	
КонецПроцедуры

// 25.02.2019
функция ПолучитьКолвоПодкрутокПодряд (конечнаяДата, Счетчик, Объект, Услуга, колвоМесяцев)
	
 // 09.04.2019	
 если мВариантПодкрутки <> Перечисления.бит_ВариантыПодкрутки.ПоСреднему тогда	
		
		 начальнаяДата = НачалоДня(ДобавитьМесяц(конечнаяДата, -6));  	
		 
		 запрос = новый Запрос;
		 
		 запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			            | бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
			            | бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки
		                |ПОМЕСТИТЬ ПоверкаСчетчика
		                | ИЗ
			            | РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(, Счетчик = &Счетчик) КАК бит_ПоверкаСчетчиковСрезПоследних
		                |ГДЕ
			            | НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку;
		                | ////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			            | бит_СчетчикиНаУслугахОбщий.Объект КАК Объект,
			            | бит_СчетчикиНаУслугахОбщий.Услуга КАК Услуга,
			            | бит_СчетчикиНаУслугахОбщий.Счетчик КАК Счетчик,
			            | бит_СчетчикиНаУслугахОбщий.СпособРасчета КАК СпособРасчета,
			            | ПоверкаСчетчика.ДатаПоверки КАК ДатаПоверки
		                |ПОМЕСТИТЬ СчетчикиЛС
		                |ИЗ
			            |РегистрСведений.бит_СчетчикиНаУслугахОбщий КАК бит_СчетчикиНаУслугахОбщий
				        |  ЛЕВОЕ СОЕДИНЕНИЕ ПоверкаСчетчика КАК ПоверкаСчетчика
				        | ПО бит_СчетчикиНаУслугахОбщий.Счетчик = ПоверкаСчетчика.Счетчик
		                |ГДЕ
			            | бит_СчетчикиНаУслугахОбщий.Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
			            | И бит_СчетчикиНаУслугахОбщий.Услуга = &Услуга
			            | И бит_СчетчикиНаУслугахОбщий.Счетчик = &Счетчик     ;
		                |
		                | ////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			            | СчетчикиЛС.Объект КАК Объект,
			            | СчетчикиЛС.Услуга КАК Услуга,
			            | СчетчикиЛС.Счетчик КАК Счетчик,
			            |ВЫБОР
				        |КОГДА СчетчикиЛС.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)
					    |ТОГДА СчетчикиЛС.СпособРасчета
				        |ИНАЧЕ """"
			            |КОНЕЦ КАК СпособРасчета,
						| бит_ПоказанияСчетчиковОбороты.ПериодМесяц КАК ПериодМесяц,
						| бит_ПоказанияСчетчиковОбороты.ПоследниеПоказанияПриход КАК ДоПоказаний,
						| бит_ПоказанияСчетчиковОбороты.ПоследниеПоказанияРасход КАК ОтПоказаний,
						| бит_ПоказанияСчетчиковОбороты.Регистратор КАК Регистратор,
						|ВЫБОР
					    |	КОГДА бит_ПоказанияСчетчиковОбороты.ТекущиеПоказанияИнспектораПриход = 0
						|		ТОГДА ВЫБОР
						|				КОГДА бит_ПоказанияСчетчиковОбороты.ТекущиеПоказанияНаселенияПриход = 0
						|					ТОГДА ВЫБОР
						|							КОГДА бит_ПоказанияСчетчиковОбороты.ПоказанияПодкруткаПриход = 0
						|								ТОГДА 0
						|							ИНАЧЕ 1
						|						КОНЕЦ
						|				ИНАЧЕ 0
						|			КОНЕЦ
						|	ИНАЧЕ 0
						| КОНЕЦ КАК Подкрутка,
						| СчетчикиЛС.ДатаПоверки КАК ДатаПоверки
						|ИЗ
						|	СчетчикиЛС КАК СчетчикиЛС
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Обороты(
						|				&П,
						|				&П,
						|				Авто,
						|				((Счетчик В
						|						(ВЫБРАТЬ
						|							СчетчикиЛС.Счетчик
						|						ИЗ
						|							СчетчикиЛС КАК СчетчикиЛС)
						|					И Услуга В
						|						(ВЫБРАТЬ
						|							СчетчикиЛС.Услуга
						|						ИЗ
						|							СчетчикиЛС КАК СчетчикиЛС)) И Услуга = &Услуга) И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОбороты
						|		ПО СчетчикиЛС.Услуга = бит_ПоказанияСчетчиковОбороты.Услуга
						|			И СчетчикиЛС.Счетчик = бит_ПоказанияСчетчиковОбороты.Счетчик
						|ГДЕ
						|	(бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
						|			ИЛИ бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_КорректировкаПоказанийСчетчиков)
						|	И СчетчикиЛС.Объект = &Объект";
		 
		 запрос.УстановитьПараметр("П", неопределено);
		 запрос.УстановитьПараметр("датаНачала", начальнаяДата);
		 запрос.УстановитьПараметр("датаОкончания", конечнаяДата);
		 запрос.УстановитьПараметр("Счетчик", Счетчик);
		 запрос.УстановитьПараметр("Объект", Объект);
		 запрос.УстановитьПараметр("Услуга", Услуга);

		 табЗапроса = запрос.Выполнить().Выгрузить();
		 табЗапроса.Сортировать("ПериодМесяц Убыв");
		 
		 колвоПодкруток = 0;
		 для ном = 0 по 2 цикл
			если ном < табЗапроса.Количество()-1 тогда  
			 колвоПодкруток =  колвоПодкруток + табЗапроса[ном].Подкрутка; 
			конецесли;	 
		 конеццикла;
		 
		 возврат колвоПодкруток;
 
 иначе
	
		 начальнаяДата = НачалоДня(ДобавитьМесяц(конечнаяДата, -колвоМесяцев));  	
		 
		 запрос = новый Запрос;
		 
		 запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                |	бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
		                |	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки
		                |ПОМЕСТИТЬ ПоверкаСчетчика
		                |ИЗ
		                |	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(, Счетчик = &Счетчик) КАК бит_ПоверкаСчетчиковСрезПоследних
		                |ГДЕ
		                |	НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		                |	бит_СчетчикиНаУслугахОбщий.Объект КАК Объект,
		                |	бит_СчетчикиНаУслугахОбщий.Услуга КАК Услуга,
		                |	бит_СчетчикиНаУслугахОбщий.Счетчик КАК Счетчик,
		                |	бит_СчетчикиНаУслугахОбщий.СпособРасчета КАК СпособРасчета,
		                |	ПоверкаСчетчика.ДатаПоверки КАК ДатаПоверки
		                |ПОМЕСТИТЬ СчетчикиЛС
		                |ИЗ
		                |	РегистрСведений.бит_СчетчикиНаУслугахОбщий КАК бит_СчетчикиНаУслугахОбщий
		                |		ЛЕВОЕ СОЕДИНЕНИЕ ПоверкаСчетчика КАК ПоверкаСчетчика
		                |		ПО бит_СчетчикиНаУслугахОбщий.Счетчик = ПоверкаСчетчика.Счетчик
		                |ГДЕ
		                |	бит_СчетчикиНаУслугахОбщий.Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
		                |	И бит_СчетчикиНаУслугахОбщий.Услуга = &Услуга
		                |	И бит_СчетчикиНаУслугахОбщий.Счетчик = &Счетчик
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		                |	СчетчикиЛС.Объект КАК Объект,
		                |	СчетчикиЛС.Услуга КАК Услуга,
		                |	СчетчикиЛС.Счетчик КАК Счетчик,
		                |	ВЫБОР
		                |		КОГДА СчетчикиЛС.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)
		                |			ТОГДА СчетчикиЛС.СпособРасчета
		                |		ИНАЧЕ """"
		                |	КОНЕЦ КАК СпособРасчета,
		                |	бит_ПоказанияСчетчиковОбороты.ПериодМесяц КАК ПериодМесяц,
		                |	бит_ПоказанияСчетчиковОбороты.ПоследниеПоказанияПриход КАК ДоПоказаний,
		                |	бит_ПоказанияСчетчиковОбороты.ПоследниеПоказанияРасход КАК ОтПоказаний,
		                |	бит_ПоказанияСчетчиковОбороты.Регистратор КАК Регистратор,
		                |	ВЫБОР
		                |		КОГДА бит_ПоказанияСчетчиковОбороты.ТекущиеПоказанияИнспектораПриход = 0
		                |			ТОГДА ВЫБОР
		                |					КОГДА бит_ПоказанияСчетчиковОбороты.ТекущиеПоказанияНаселенияПриход = 0
		                |						ТОГДА ВЫБОР
		                |								КОГДА бит_ПоказанияСчетчиковОбороты.ПоказанияПодкруткаПриход = 0
		                |									ТОГДА 0
		                |								ИНАЧЕ 1
		                |							КОНЕЦ
		                |					ИНАЧЕ 0
		                |				КОНЕЦ
		                |		ИНАЧЕ 0
		                |	КОНЕЦ КАК Подкрутка,
		                |	СчетчикиЛС.ДатаПоверки КАК ДатаПоверки
		                |ИЗ
		                |	СчетчикиЛС КАК СчетчикиЛС
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Обороты(
		                |				&датаНачала,
		                |				&датаОкончания,
		                |				Авто,
		                |				Счетчик В
		                |						(ВЫБРАТЬ
		                |							СчетчикиЛС.Счетчик
		                |						ИЗ
		                |							СчетчикиЛС КАК СчетчикиЛС)
		                |					И Услуга В
		                |						(ВЫБРАТЬ
		                |							СчетчикиЛС.Услуга
		                |						ИЗ
		                |							СчетчикиЛС КАК СчетчикиЛС)
		                |					И Услуга = &Услуга
		                |					И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОбороты
		                |		ПО СчетчикиЛС.Услуга = бит_ПоказанияСчетчиковОбороты.Услуга
		                |			И СчетчикиЛС.Счетчик = бит_ПоказанияСчетчиковОбороты.Счетчик
		                |ГДЕ
		                |	(бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
		                |			ИЛИ бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_КорректировкаПоказанийСчетчиков)
		                |	И СчетчикиЛС.Объект = &Объект";
		 
		 запрос.УстановитьПараметр("П", неопределено);
		 запрос.УстановитьПараметр("датаНачала", начальнаяДата);
		 запрос.УстановитьПараметр("датаОкончания", конечнаяДата);
		 запрос.УстановитьПараметр("Счетчик", Счетчик);
		 запрос.УстановитьПараметр("Объект", Объект);
		 запрос.УстановитьПараметр("Услуга", Услуга);

		 табЗапроса = запрос.Выполнить().Выгрузить();
		 табЗапроса.Сортировать("ПериодМесяц Убыв");
		 
		 колвоПодкруток = 0;
		 для ном = 0 по табЗапроса.Количество()-1 цикл
			если ном < колвоМесяцев тогда  
			 колвоПодкруток =  колвоПодкруток + табЗапроса[ном].Подкрутка; 
			конецесли;	 
		 конеццикла;
		 
		 возврат колвоПодкруток;
  конецесли;	
	 
конецфункции	

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура("ТипСчетчика");	
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаТЧ,СтруктураПолей,Отказ, Заголовок) Экспорт
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ПоказанияПоСчетчикам",
	СтруктураПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура выполняет записи движений по регистрам.
//
Процедура ЗаписатьДвижения(Организация, Выборка, ВидДвижения, ТекущиеПоказания)
	
	ДвижениеРасх = Движения.бит_ПоказанияСчетчиков.Добавить();
	ДвижениеРасх.ВидДвижения = ВидДвижения;
	ДвижениеРасх.Период = Дата;
	ДвижениеРасх.Объект = Выборка.Объект;
	ДвижениеРасх.Услуга = Выборка.Услуга;
	ДвижениеРасх.Счетчик = Выборка.Счетчик;
	ДвижениеРасх.Коэффициент = Выборка.КоэффициентУмножения;
	ДвижениеРасх.ПоследниеПоказания = Выборка.ПоследниеПоказания;
	ДвижениеРасх.Организация   = Организация;
	
	Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
		Если ВидОперации = перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний Тогда
			
			Если ПоказанияНаселения Тогда
				ДвижениеРасх.ТекущиеПоказанияНаселения  = ТекущиеПоказания;
				ДвижениеРасх.ТекущиеПоказанияИнспектора = 0;
				ДвижениеРасх.ПоказанияПодкрутка         = 0;
			Иначе
				ДвижениеРасх.ПоказанияПодкрутка         = 0;
				ДвижениеРасх.ТекущиеПоказанияНаселения  = 0;
				ДвижениеРасх.ТекущиеПоказанияИнспектора = ТекущиеПоказания;
			КонецЕсли;
			
		Иначе
			
			ДвижениеРасх.ПоказанияПодкрутка         = ТекущиеПоказания;
			ДвижениеРасх.ТекущиеПоказанияНаселения  = 0;
			ДвижениеРасх.ТекущиеПоказанияИнспектора = 0;
			
		КонецЕсли; 
	ИначеЕсли  ВидДвижения =  ВидДвиженияНакопления.Расход Тогда
		
		ДвижениеРасх.ТекущиеПоказанияНаселения  = Выборка.ТекущиеПоказанияНаселения;
		ДвижениеРасх.ТекущиеПоказанияИнспектора = Выборка.ТекущиеПоказанияИнспектора;
		ДвижениеРасх.ПоказанияПодкрутка         = Выборка.ПоказанияПодкрутка;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам,Отказ, Заголовок)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Момент", МоментВремени());
	
	Счетчики = ПоказанияПоСчетчикам.ВыгрузитьКолонку("Счетчик");
	
	Запрос.УстановитьПараметр("Счетчики", Счетчики);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.Услуга,
	|	бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.Счетчик,
	|	бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.ТекущиеПоказания,
	|	бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.ПереходЧерезНоль,
	|	ВЫБОР
	|		КОГДА бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.Ссылка.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|			ТОГДА бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.ЛицевойСчет
	|		ИНАЧЕ бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.Дом
	|	КОНЕЦ КАК Объект
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.бит_ВводПоказанийПоСчетчикам.ПоказанияПоСчетчикам КАК бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам
	|ГДЕ
	|	бит_ВводПоказанийПоСчетчикамПоказанияПоСчетчикам.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПоследниеПоказания,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) КАК ТекущиеПоказанияИнспектора,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) КАК ТекущиеПоказанияНаселения,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) КАК ПоказанияПодкрутка,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток, 1) КАК КоэффициентУмножения,
	|	ЕСТЬNULL(ТаблицаДокумента.ТекущиеПоказания, 0) КАК КонечныеПоказания,
	|	ЕСТЬNULL(ТаблицаДокумента.ПереходЧерезНоль, ЛОЖЬ) КАК ПереходЧерезНоль
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Момент, Счетчик В (&Счетчики)) КАК бит_СчетчикиНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Момент, ) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДокумента КАК ТаблицаДокумента
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Услуга = ТаблицаДокумента.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = ТаблицаДокумента.Счетчик
	|			И бит_СчетчикиНаУслугахСрезПоследних.Объект = ТаблицаДокумента.Объект
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КонечныеПоказания > 0 ИЛИ Выборка.ПереходЧерезНоль Тогда
			
			ЗаписатьДвижения(Организация,Выборка,ВидДвиженияНакопления.Расход, 0);
			ЗаписатьДвижения(Организация,Выборка,ВидДвиженияНакопления.Приход, Выборка.КонечныеПоказания);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
	// Укажем, что надо проверить.
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("ТипСчетчика");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ
	, "Проверка заполнения обязательных реквизитов документа ""Ввод показаний счетчика"".");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если ЗаполнитьТаблицуСчетчиковВРучную Тогда
		
		СтруктураПолей = Новый Структура;
		
		Если НЕ ЗначениеЗаполнено(Улица) Тогда
			СтруктураПолей.Вставить("Улица" ,"Улица");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Дом) Тогда
			СтруктураПолей.Вставить("Дом" ,"Дом");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЛицевойСчет) И ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный Тогда
			СтруктураПолей.Вставить("ЛицевойСчет" ,"ЛицевойСчет");
		КонецЕсли; 
		
		СтруктураПолей.Вставить("Счетчик"                    , "Счетчик");
		СтруктураПолей.Вставить("Услуга"                     , "Услуга");
		
		РезультатЗапросаПоПоказаниям = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПоказанияПоСчетчикам", СтруктураПолей);
		ТаблицаПоказаний          = РезультатЗапросаПоПоказаниям.Выгрузить();
		
		ПроверкаРеквизитовТЧ(ТаблицаПоказаний, СтруктураПолей, Отказ, Заголовок);
		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоказаний, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ВидОперации        = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
	ТипСчетчика        = Перечисления.бит_ТипСчетчика.Индивидуальный;
	ПоказанияНаселения = Истина;
	Ответственный      = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Обходим строки и проверяем превышение разрядности.
	Для Индекс = 0 по ПоказанияПоСчетчикам.Количество()-1 Цикл
		СтрокаПоказаний = ПоказанияПоСчетчикам.Получить(Индекс);
		Если СтрокаПоказаний.ТекущиеПоказания > СтрокаПоказаний.Разрядность Тогда
			Сообщение = Новый СообщениеПользователю();
			НомерСтроки = Индекс + 1;
			Сообщение.Текст = "В строке " + НомерСтроки + " текущие показания превышают разрядность счетчика.";
			Сообщение.Поле	= "ПоказанияПоСчетчикам[" + Индекс + "].ТекущиеПоказания";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


// БИТ ЖКХ 07.04.2021
//  Процедура выполняет заполнение таблицы показаний по списку счетчиков
//
Процедура ЗаполнитьТаблицуПоказанийПоСпискуСчетчиков(СписокСчетчиков, СортироватьПоНомеруКвартиры = ложь) Экспорт
	
	колвоМесяцевПодкрутки = 0;
	
	ОбновитьПараметрыЖКХ();
	
	ПоказанияПоСчетчикам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ТипСчетчика", ТипСчетчика);
	
	мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив;
	
    //4.11.2018
	Если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив Тогда
		//22.02.2019
		мКоличествоМесяцевПодкрутки = 6;
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("КолМесяцевПодкрутка", мКоличествоМесяцевПодкрутки);
	
	Если мКоличествоМесяцевПодкрутки = 0 Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		
	Иначе
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДобавитьМесяц(Дата, -мКоличествоМесяцевПодкрутки)));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДобавитьМесяц(Дата, -1)));
		
	КонецЕсли; 
	
	ТекстУсловия = "ТипСчетчика = &ТипСчетчика";
	
	Если ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		
		Если Не Дом = Справочники.бит_СписокЗданий.ПустаяСсылка() Тогда    // по дому.
			Запрос.УстановитьПараметр("Объект",Дом);
			ТекстУсловия = ТекстУсловия + " И Объект = &Объект";
		ИначеЕсли НЕ Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда    // по улице.
			Запрос.УстановитьПараметр("Улица",Улица);
			ТекстУсловия = ТекстУсловия + " И Объект.Улица = &Улица"
		// БИТ ЖКХ 19.10.2020	
		ИначеЕсли СортироватьПоНомеруКвартиры = истина И НЕ Квартира = Справочники.бит_Квартиры.ПустаяСсылка() Тогда    // по квартире.
			Запрос.УстановитьПараметр("Квартира", Квартира);
			ТекстУсловия = ТекстУсловия + " И Объект.Квартира = &Квартира"
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЛицевойСчет = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда // по лицевому счету.
			Запрос.УстановитьПараметр("Объект",ЛицевойСчет);
			ТекстУсловия = ТекстУсловия + " И Объект = &Объект";
		ИначеЕсли Не Дом = Справочники.бит_СписокЗданий.ПустаяСсылка() Тогда    // по дому.
			Запрос.УстановитьПараметр("Здание",Дом);
			ТекстУсловия = ТекстУсловия + " И Объект.Здание = &Здание";
		ИначеЕсли НЕ Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда    // по улице.
			Запрос.УстановитьПараметр("Улица",Улица);
			ТекстУсловия = ТекстУсловия + " И Объект.УлицаЛицевогоСчета = &Улица"
		КонецЕсли;	
		// БИТ ЖКХ 26.10.2020	
		Если СортироватьПоНомеруКвартиры = истина тогда
			Если НЕ Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() И 
				  Не Дом = Справочники.бит_СписокЗданий.ПустаяСсылка() И
				   НЕ Квартира = Справочники.бит_Квартиры.ПустаяСсылка() Тогда    // по квартире.
				Запрос.УстановитьПараметр("Квартира", Квартира);
				ТекстУсловия = ТекстУсловия + " И Объект.Квартира = &Квартира"
			КонецЕсли;
		конецесли;
		
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокСчетчиков", СписокСчетчиков);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный КАК Многотарифный,
	|	бит_СчетчикиНаУслугахСрезПоследних.Период КАК Период,
	|	бит_СчетчикиНаУслугахСрезПоследних.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	|	бит_СчетчикиНаУслугахСрезПоследних.ОсновнаяУслуга КАК ОсновнаяУслуга
	|ПОМЕСТИТЬ Счетчики
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ) КАК бит_СчетчикиНаУслугахСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать И Счетчик В (&СписокСчетчиков)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счетчики.Объект КАК Объект,
	|	Счетчики.Услуга КАК Услуга,
	|	Счетчики.Счетчик КАК Счетчик,
	|	Счетчики.Разрядность КАК Разрядность,
	|	Счетчики.Приоритет КАК Приоритет,
	|	Счетчики.Многотарифный КАК Многотарифный,
	|	Счетчики.Период КАК Период,
	|	Счетчики.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	|	Счетчики.ОсновнаяУслуга КАК ОсновнаяУслуга
	|ПОМЕСТИТЬ Счетчики_Полн
	|ИЗ
	|	Счетчики КАК Счетчики
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик.Разрядность,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.Приоритет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	|				И Счетчик В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Таб.Счетчик
	|					ИЗ
	|						Счетчики КАК Таб)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Счетчики_Полн.Счетчик КАК Счетчик
	|ПОМЕСТИТЬ ВТ_Счетчики
	|ИЗ
	|	Счетчики_Полн КАК Счетчики_Полн
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПоказанияСчетчиков.Объект КАК ЛицевойСчет,
	|	бит_ПоказанияСчетчиков.Услуга КАК УслугаЖКХ,
	|	бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиков.ПоказанияПодкрутка КАК ПоказанияПодкрутка
	|ПОМЕСТИТЬ ВТ_ПоказанияПодкрутки
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Счетчики КАК ВТ_Счетчики
	|		ПО бит_ПоказанияСчетчиков.Счетчик = ВТ_Счетчики.Счетчик
	|ГДЕ
	|	бит_ПоказанияСчетчиков.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_ПоказанияСчетчиков.Объект,
	|	бит_ПоказанияСчетчиков.Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказанияПодкрутки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ПоказанияПодкрутки.УслугаЖКХ КАК УслугаЖКХ,
	|	ВТ_ПоказанияПодкрутки.Счетчик КАК Счетчик,
	|	СУММА(1) КАК КоличествоМесяцев,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПоказанияПодкрутки.ПоказанияПодкрутка = 0
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоМесяцевПодкрутки
	|ПОМЕСТИТЬ ВТ_ПоказанияПодкруткиИтого
	|ИЗ
	|	ВТ_ПоказанияПодкрутки КАК ВТ_ПоказанияПодкрутки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоказанияПодкрутки.ЛицевойСчет,
	|	ВТ_ПоказанияПодкрутки.УслугаЖКХ,
	|	ВТ_ПоказанияПодкрутки.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_КолЕдиницПоСчетчикамОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_КолЕдиницПоСчетчикамОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_КолЕдиницПоСчетчикамОбороты.Счетчик КАК Счетчик,
	|	СУММА(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдиницПоЛСОборот + бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдПодкруткаОборот) КАК КоличествоЕдиниц
	|ПОМЕСТИТЬ ВТ_КолЕдиницПоСчетчикам
	|ИЗ
	|	РегистрНакопления.бит_КолЕдиницПоСчетчикам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счетчик В
	|				(ВЫБРАТЬ
	|					ВТ_Счетчики.Счетчик
	|				ИЗ
	|					ВТ_Счетчики КАК ВТ_Счетчики)) КАК бит_КолЕдиницПоСчетчикамОбороты
	|ГДЕ
	|	НЕ бит_КолЕдиницПоСчетчикамОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_КолЕдиницПоСчетчикамОбороты.ЛицевойСчет,
	|	бит_КолЕдиницПоСчетчикамОбороты.УслугаЖКХ,
	|	бит_КолЕдиницПоСчетчикамОбороты.Счетчик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПоказанияПодкруткиИтого.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ПоказанияПодкруткиИтого.УслугаЖКХ КАК УслугаЖКХ,
	|	ВТ_ПоказанияПодкруткиИтого.Счетчик КАК Счетчик,
	|	ЕСТЬNULL(ВТ_КолЕдиницПоСчетчикам.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	|	ВТ_ПоказанияПодкруткиИтого.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВТ_ПоказанияПодкруткиИтого.КоличествоМесяцевПодкрутки КАК КоличествоМесяцевПодкрутки
	|ПОМЕСТИТЬ КолЕд
	|ИЗ
	|	ВТ_ПоказанияПодкруткиИтого КАК ВТ_ПоказанияПодкруткиИтого
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолЕдиницПоСчетчикам КАК ВТ_КолЕдиницПоСчетчикам
	|		ПО ВТ_ПоказанияПодкруткиИтого.ЛицевойСчет = ВТ_КолЕдиницПоСчетчикам.ЛицевойСчет
	|			И ВТ_ПоказанияПодкруткиИтого.УслугаЖКХ = ВТ_КолЕдиницПоСчетчикам.УслугаЖКХ
	|			И ВТ_ПоказанияПодкруткиИтого.Счетчик = ВТ_КолЕдиницПоСчетчикам.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПоказанияСчетчиковОстатки.Объект КАК Объект,
	|	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
	|	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПредыдущиеПоказания
	|ПОМЕСТИТЬ ВТ_ПоказанияСчетчиков
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|			&Дата,
	|			(Объект, Услуга, Счетчик) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Счетчики_Полн.Объект,
	|					Счетчики_Полн.Услуга,
	|					Счетчики_Полн.Счетчик
	|				ИЗ
	|					Счетчики_Полн КАК Счетчики_Полн)) КАК бит_ПоказанияСчетчиковОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
	|ПОМЕСТИТЬ ВТ_Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Счетчики_Полн.Объект
	|				ИЗ
	|					Счетчики_Полн КАК Счетчики_Полн
	|				ГДЕ
	|					Счетчики_Полн.Объект ССЫЛКА Справочник.бит_ЛицевыеСчета)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать КАК Использовать,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	ВТ_Проживающие.КолПроживающих КАК КолПроживающих
	|ПОМЕСТИТЬ ВТ_Сведения
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			(ЛицевойСчет, Услуга) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Счетчики_Полн.Объект,
	|					Счетчики_Полн.Услуга
	|				ИЗ
	|					Счетчики_Полн КАК Счетчики_Полн
	|				ГДЕ
	|					Счетчики_Полн.Объект ССЫЛКА Справочник.бит_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проживающие КАК ВТ_Проживающие
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_Проживающие.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	РежимПотребления,
	|	СпособРасчета,
	|	ТипКвартиры,
	|	СтатусКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сведения.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Сведения.Услуга КАК Услуга,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(ВТ_Сведения.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	ВЫБОР
	|		КОГДА ВТ_Сведения.РежимПотребления = ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.Нет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УслугаОтключена
	|ПОМЕСТИТЬ ВТ_Нормы
	|ИЗ
	|	ВТ_Сведения КАК ВТ_Сведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Дата, ) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО ВТ_Сведения.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И ВТ_Сведения.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И ВТ_Сведения.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И ВТ_Сведения.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|			И ВТ_Сведения.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счетчики_Полн.Объект КАК Объект,
	|	Счетчики_Полн.Услуга КАК Услуга,
	|	Счетчики_Полн.Счетчик КАК Счетчик,
	|	Счетчики_Полн.Счетчик.Разрядность КАК Разрядность,
	|	ЕСТЬNULL(ВТ_ПоказанияСчетчиков.ПредыдущиеПоказания, 0) КАК ПредыдущиеПоказания,
	|	ЕСТЬNULL(ВТ_Нормы.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(ВТ_Нормы.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(ВТ_Нормы.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(ВТ_Нормы.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(ВТ_Нормы.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(ВТ_Нормы.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(ВТ_Нормы.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(ВТ_Нормы.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	Счетчики_Полн.Услуга.Приоритет КАК Приоритет,
	|	Счетчики_Полн.Многотарифный КАК Многотарифный,
	|	ЕСТЬNULL(КолЕд.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(Счетчики_Полн.Период, &КонецПериода, МЕСЯЦ) + 1 > &КолМесяцевПодкрутка
	|			ТОГДА &КолМесяцевПодкрутка
	|		ИНАЧЕ РАЗНОСТЬДАТ(Счетчики_Полн.Период, &КонецПериода, МЕСЯЦ) + 1
	|	КОНЕЦ КАК КоличествоМесяцев,
	|	ЕСТЬNULL(КолЕд.КоличествоМесяцевПодкрутки, 0) КАК КоличествоМесяцевПодкрутки,
	|	ЕСТЬNULL(ВТ_Нормы.УслугаОтключена, ЛОЖЬ) КАК УслугаОтключена,
	|	Счетчики_Полн.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	|	Счетчики_Полн.ОсновнаяУслуга КАК ОсновнаяУслуга
	|ИЗ
	|	Счетчики_Полн КАК Счетчики_Полн
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказанияСчетчиков КАК ВТ_ПоказанияСчетчиков
	|		ПО Счетчики_Полн.Объект = ВТ_ПоказанияСчетчиков.Объект
	|			И Счетчики_Полн.Услуга = ВТ_ПоказанияСчетчиков.Услуга
	|			И Счетчики_Полн.Счетчик = ВТ_ПоказанияСчетчиков.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Нормы КАК ВТ_Нормы
	|		ПО ((ВЫРАЗИТЬ(Счетчики_Полн.Объект КАК Справочник.бит_ЛицевыеСчета)) = ВТ_Нормы.ЛицевойСчет)
	|			И Счетчики_Полн.Услуга = ВТ_Нормы.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ КолЕд КАК КолЕд
	|		ПО Счетчики_Полн.Услуга = КолЕд.УслугаЖКХ
	|			И ((ВЫРАЗИТЬ(Счетчики_Полн.Объект КАК Справочник.бит_ЛицевыеСчета)) = КолЕд.ЛицевойСчет)
	|			И Счетчики_Полн.Счетчик = КолЕд.Счетчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(КоличествоМесяцевПодкрутки),
	|	МИНИМУМ(УслугаОтключена),
	|	МАКСИМУМ(СчетчикСЗависимымиУслугами)
	|ПО
	|	Счетчик";
	
	тмпТаблицаПоказаний = ПоказанияПоСчетчикам.ВыгрузитьКолонки();
	тмпТаблицаПоказаний.Колонки.Добавить("Приоритет", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	тмпТаблицаПоказаний.Колонки.Добавить("КоличествоМесяцевПодкруткиПодряд", ОбщегоНазначения.ОписаниеТипаЧисло(4, 0));
	
	ВыборкаСч = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСч.Следующий() Цикл
		
		ТекПоказания = 0;
		Показания    = 0;
		Выборка      = ВыборкаСч.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.СчетчикСЗависимымиУслугами И НЕ Выборка.ОсновнаяУслуга Тогда
				Продолжить;
			КонецЕсли; 
			
			НовСтрока = тмпТаблицаПоказаний.Добавить();
			
			Если Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда
				Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
					НовСтрока.Улица = Выборка.Объект.Улица;
				Иначе
					НовСтрока.Улица = Выборка.Объект.УлицаЛицевогоСчета;
				КонецЕсли;
			Иначе
				НовСтрока.Улица = Улица;
			КонецЕсли;
			
			Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
				НовСтрока.Дом = Выборка.Объект;
			Иначе
				НовСтрока.ЛицевойСчет = Выборка.Объект;
				НовСтрока.Дом = Выборка.Объект.Здание;
			КонецЕсли;
			
			НовСтрока.Счетчик = Выборка.Счетчик;
			НовСтрока.Услуга = Выборка.Услуга;
			НовСтрока.Разрядность         = Выборка.Разрядность;
			НовСтрока.ПредыдущиеПоказания = Выборка.ПредыдущиеПоказания;
			НовСтрока.Многотарифный       = Выборка.Многотарифный;
			НовСтрока.Приоритет           = Выборка.Приоритет;
			НовСтрока.УслугаОтключена     = Выборка.УслугаОтключена;			
									
			Если ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки И НЕ ВыборкаСч.УслугаОтключена Тогда
				
				// 25.02.2019
				// 25.04.2019
				если мКоличествоМесяцевПодкрутки <> 0 тогда  
				 НовСтрока.КоличествоМесяцевПодкруткиПодряд = ПолучитьКолвоПодкрутокПодряд(Запрос.Параметры.КонецПериода, НовСтрока.Счетчик, Выборка.Объект, НовСтрока.Услуга, мКоличествоМесяцевПодкрутки);
				конецесли;  
				
				Если НЕ мСчетчикиПодкрутка Тогда
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Подкрутка счетчиков не ведется по этой организации!";
					Сообщение.Сообщить();
					
					ПоказанияПоСчетчикам.Очистить();
					Возврат;
					
				КонецЕсли; 
				
				Если ТекПоказания <> 0 И НЕ Выборка.Многотарифный Тогда
					
					Если НовСтрока.ПредыдущиеПоказания > 0 Тогда
						
						НовСтрока.ТекущиеПоказания           = ТекПоказания;
						НовСтрока.КоличествоЕдиницПоСчетчику = Показания;
					Иначе
						НовСтрока.ТекущиеПоказания           = 0;
						НовСтрока.КоличествоЕдиницПоСчетчику = 0;
					КонецЕсли;
					
				Иначе
					
					Показания = 0;
					
					// Норма только один раз по услуге.
					МассивПодкруток = Новый Массив;
					Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
						МассивПодкруток = тмпТаблицаПоказаний.НайтиСтроки(Новый Структура("Дом, Услуга", Выборка.Объект, Выборка.Услуга));
					Иначе	
						МассивПодкруток = тмпТаблицаПоказаний.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", Выборка.Объект, Выборка.Услуга));
					КонецЕсли;
					Если МассивПодкруток.Количество() = 1 Тогда
						
						Если (мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднему
							И ВыборкаСч.КоличествоМесяцевПодкрутки < мКоличествоМесяцевПодкрутки)
					// 4.12.2018
							 ИЛИ (( мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив ИЛИ
							         мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив )

							// И ВыборкаСч.КоличествоМесяцевПодкрутки < 3)  Тогда
                            // 25.02.2019
							И НовСтрока.КоличествоМесяцевПодкруткиПодряд < 3)  Тогда

							
							 Если Выборка.КоличествоМесяцев > 0 Тогда
								
							 // 05.04.2019 
							  если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив или
								    мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив	тогда
								 
							    если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив тогда
								 Показания = Окр(Выборка.КоличествоЕдиниц / 3, 4);
							    конецесли;	
							
							    если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив тогда
								 Показания = Окр(Выборка.КоличествоЕдиниц / 6, 4);
							    конецесли;

							  иначе	
							   Если Выборка.КоличествоМесяцев > 0 Тогда
							     Показания = Окр(Выборка.КоличествоЕдиниц / Выборка.КоличествоМесяцев,4);
							   КонецЕсли; 
							  конецесли; 

								
							 КонецЕсли; 
							
						Иначе
							
							Норма     = 0;
							
							Если мПодкруткаНаЛС Тогда
								
								Показания = Окр(Выборка.НаЛицевойСчет, 4);
								
							Иначе
								
								КолПроживающих = ?(Выборка.КолПроживающих = 0, 1, Выборка.КолПроживающих);
								
								Если КолПроживающих = 1 тогда
									Норма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
								ИначеЕсли КолПроживающих = 2 тогда
									Норма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2; 
								ИначеЕсли КолПроживающих = 3 тогда
									Норма  = Выборка.НаСемью * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;  
								ИначеЕсли КолПроживающих = 4 тогда
									Норма  = Выборка.НаСемью4 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;  
								ИначеЕсли КолПроживающих = 5 тогда
									Норма  = Выборка.НаСемью5 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;  
								ИначеЕсли КолПроживающих > 5 тогда
									Норма  = Выборка.НаСемью6 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
								КонецЕсли;
								
								Показания = Окр(Норма, 4);
								
							КонецЕсли; 
							
						КонецЕсли;
					ИначеЕсли МассивПодкруток.Количество() > 1 
						И ((мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднему
							И ВыборкаСч.КоличествоМесяцевПодкрутки < мКоличествоМесяцевПодкрутки)
						    // 4.12.2018	
						     ИЛИ ((мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив ИЛИ
						        мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив )

							// И ВыборкаСч.КоличествоМесяцевПодкрутки < 3)  Тогда
                            // 25.02.2019
							И НовСтрока.КоличествоМесяцевПодкруткиПодряд < 3))  Тогда

							// 05.04.2019 
							 если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив или
								    мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив	тогда

							   если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаТриМесяцаСПереходомВНорматив тогда
								Показания = Окр(Выборка.КоличествоЕдиниц / 3, 4);
							   конецесли;	
							
							   если мВариантПодкрутки = Перечисления.бит_ВариантыПодкрутки.ПоСреднемуЗаШестьМесяцевСПереходомВНорматив тогда
								Показания = Окр(Выборка.КоличествоЕдиниц / 6, 4);
							   конецесли;
                             иначе
							   Если Выборка.КоличествоМесяцев > 0 Тогда
							     Показания = Окр(Выборка.КоличествоЕдиниц / Выборка.КоличествоМесяцев,4);
							   КонецЕсли; 
							 конецесли;

					КонецЕсли; 
					
					Если НовСтрока.ПредыдущиеПоказания > 0 Тогда
						
						ТекПоказания = НовСтрока.ПредыдущиеПоказания + Показания;
					Иначе
						ТекПоказания = 0;
						Показания = 0;
					КонецЕсли;
					
					Если ТекПоказания > НовСтрока.Разрядность Тогда
						ТекПоказания = ТекПоказания - НовСтрока.Разрядность + 1;
						Показания    = Показания    + 1 ;
					КонецЕсли;
					
					НовСтрока.ТекущиеПоказания           = ТекПоказания;
					НовСтрока.КоличествоЕдиницПоСчетчику = Показания;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	тмпТаблицаПоказаний.Сортировать("Дом Возр, ЛицевойСчет Возр, Счетчик Возр, Приоритет Возр");
	ПоказанияПоСчетчикам.Загрузить(тмпТаблицаПоказаний);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли