
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаправлениеДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ПараметрыСоздания.Ссылка, "Направление", Истина);
	Если Параметры.Свойство("СозданныеДокументы") Тогда
		СозданныеДокументы = Параметры.СозданныеДокументы;
	Иначе
		СозданныеДокументы = РаспознаваниеДокументовСлужебныйКлиентСервер.СтруктураСозданныхДокументов(Параметры.ПараметрыСоздания.ТипКомплекта);
		РаспознаваниеДокументовСлужебный.НайтиИЗаполнитьСозданныеДокументы(Параметры.ПараметрыСоздания.Ссылка, Параметры.ПараметрыСоздания.ТипКомплекта, СозданныеДокументы, КоличествоЕщеНайденные);
	КонецЕсли;
	
	УправлениеФормой();
	СброситьРазмерыИПоложениеОкна();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоздатьДокументПоступлениеРеализацияПриИзменении(Элемент)
	
	ПрикрепитьСканКПоступлениюРеализации = СоздатьДокументПоступлениеРеализация;
	Элементы.ПрикрепитьСканКПоступлениюРеализации.Доступность = СоздатьДокументПоступлениеРеализация;
	
	СоздатьДокументСчетФактура = СоздатьДокументПоступлениеРеализация;
	Элементы.СоздатьДокументСчетФактура.Доступность = СоздатьДокументПоступлениеРеализация;
	
	ПрикрепитьСканКСчетуФактуре = СоздатьДокументПоступлениеРеализация;
	Элементы.ПрикрепитьСканКСчетуФактуре.Доступность = СоздатьДокументПоступлениеРеализация;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументСчетФактураПриИзменении(Элемент)
	
	ПрикрепитьСканКСчетуФактуре = СоздатьДокументСчетФактура;
	Элементы.ПрикрепитьСканКСчетуФактуре.Доступность = СоздатьДокументСчетФактура;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьДокументы(Команда)
	
	Параметры.ПараметрыСоздания.Вставить("Действие", "ОбработатьДокументы");
	
	Параметры.ПараметрыСоздания.Вставить("СоздатьДокументПоступлениеРеализация", СоздатьДокументПоступлениеРеализация);
	Параметры.ПараметрыСоздания.Вставить("СоздатьДокументСчетФактура", СоздатьДокументСчетФактура);
	Параметры.ПараметрыСоздания.Вставить("ПрикрепитьСканКПоступлениюРеализации", ПрикрепитьСканКПоступлениюРеализации);
	Параметры.ПараметрыСоздания.Вставить("ПрикрепитьСканКСчетуФактуре", ПрикрепитьСканКСчетуФактуре);
	
	Закрыть(Параметры.ПараметрыСоздания);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСчетФактуру(Команда)
	
	Если НаправлениеДокумента = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
		ОткрытьСозданныйДокумент(СозданныеДокументы.СчетФактураВыданный.Ссылка);
	Иначе
		ОткрытьСозданныйДокумент(СозданныеДокументы.СчетФактураПолученный.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоступлениеРеализацию(Команда)
	
	Если НаправлениеДокумента = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
		ОткрытьСозданныйДокумент(СозданныеДокументы.Реализация.Ссылка);
	Иначе
		ОткрытьСозданныйДокумент(СозданныеДокументы.Поступление.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодробнее(Команда)
	Элементы.ГруппаДетально.Видимость = Не Элементы.ГруппаДетально.Видимость;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	СканПрикрепленТорг12Акт = Ложь;
	СканПрикрепленСФ = Ложь;
	
	ШапкаРаспознанногоТорг12Акт = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПараметрыСоздания.Ссылка, "НомерДокумента, ДатаДокумента, Контрагент");
	Если НаправлениеДокумента = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
		Элементы.ПрикрепитьСканКПоступлениюРеализации.Заголовок = НСтр("ru = 'Прикрепить скан к поступлению'");
		СтрокаТипДокумента = НСтр("ru = 'Поступление'");
		ВОтКонтрагента = НСтр("ru = 'от '") + ШапкаРаспознанногоТорг12Акт.Контрагент;
		
		ПоступлениеРеализацияСсылка = СозданныеДокументы.Поступление.Ссылка;
		СчетФактураСсылка = СозданныеДокументы.СчетФактураПолученный.Ссылка;
	Иначе
		Элементы.ПрикрепитьСканКПоступлениюРеализации.Заголовок = НСтр("ru = 'Прикрепить скан к реализации'");
		СтрокаТипДокумента = НСтр("ru = 'Реализация'");
		ВОтКонтрагента = НСтр("ru = 'в '") + ШапкаРаспознанногоТорг12Акт.Контрагент;
		
		ПоступлениеРеализацияСсылка = СозданныеДокументы.Реализация.Ссылка;
		СчетФактураСсылка = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		Элементы.СоздатьДокументПоступлениеРеализация.Заголовок = НСтр("ru = 'Создать документ ""Реализация (акт, накладная)""'");
	КонецЕсли;
	
	ЭтотОбъект.Заголовок = СтрШаблон(НСтр("ru = '%1 от %2 %3'"),
		СтрокаТипДокумента, Формат(ШапкаРаспознанногоТорг12Акт.ДатаДокумента, "ДФ=dd.MM.yyyy"), ВОтКонтрагента);
	
	// Перед выполнением этой процедуры все элементы должны быть видны.
	Элементы.ГруппаПоступлениеРеализация.Видимость = ЗначениеЗаполнено(ПоступлениеРеализацияСсылка);
	Элементы.СоздатьДокументПоступлениеРеализация.Видимость = Не ЗначениеЗаполнено(ПоступлениеРеализацияСсылка);
	Элементы.ДекорацияСканПрикреплен1.Видимость = Ложь;
	Элементы.ГруппаСчетФактура.Видимость = Ложь;
	Элементы.ДекорацияСканПрикреплен2.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(ПоступлениеРеализацияСсылка) Тогда
		ЗаголовокСсылки = Строка(ПоступлениеРеализацияСсылка);
		Элементы.ОткрытьПоступлениеРеализацию.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ОтрезатьВремяУДатыСтрокой(ЗаголовокСсылки);
		
		ДанныеТорг12Акт = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПараметрыСоздания.Ссылка, "ИсходноеИзображение, ИмяФайла", Истина);
		АдресКартинки = ПоместитьВоВременноеХранилище(ДанныеТорг12Акт.ИсходноеИзображение.Получить(), УникальныйИдентификатор);
		СканПрикрепленТорг12Акт = РаспознаваниеДокументовСлужебный.СканУжеЕстьУВладельца(ДанныеТорг12Акт, ПоступлениеРеализацияСсылка, АдресКартинки);
		
		Элементы.ПрикрепитьСканКПоступлениюРеализации.Доступность = Не СканПрикрепленТорг12Акт;
		Элементы.ДекорацияСканПрикреплен1.Видимость = СканПрикрепленТорг12Акт;
		Если СканПрикрепленТорг12Акт Тогда
			ПрикрепитьСканКПоступлениюРеализации = Истина;
		КонецЕсли;
		
		Элементы.ГруппаСчетФактура.Видимость = ЗначениеЗаполнено(СчетФактураСсылка);
		Элементы.СоздатьДокументСчетФактура.Видимость = Не ЗначениеЗаполнено(СчетФактураСсылка);
		Если ЗначениеЗаполнено(СчетФактураСсылка) Тогда
			ЗаголовокСсылки = Строка(СчетФактураСсылка);
			Элементы.ОткрытьСчетФактуру.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ОтрезатьВремяУДатыСтрокой(ЗаголовокСсылки);
			
			ДанныеСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПараметрыСоздания.РаспознанныйДокументСФ, "ИсходноеИзображение, ИмяФайла", Истина);
			АдресКартинки = ПоместитьВоВременноеХранилище(ДанныеСФ.ИсходноеИзображение.Получить(), УникальныйИдентификатор);
			СканПрикрепленСФ = РаспознаваниеДокументовСлужебный.СканУжеЕстьУВладельца(ДанныеСФ, СчетФактураСсылка, АдресКартинки);
			
			Элементы.ПрикрепитьСканКСчетуФактуре.Доступность = Не СканПрикрепленСФ;
			Элементы.ДекорацияСканПрикреплен2.Видимость = СканПрикрепленСФ;
			Если СканПрикрепленСФ Тогда
				ПрикрепитьСканКСчетуФактуре = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.СоздатьДокументПоступлениеРеализация.Видимость Тогда
		Элементы.СоздатьДокументПоступлениеРеализация.Заголовок = Элементы.СоздатьДокументПоступлениеРеализация.Заголовок +
		СтрШаблон(НСтр("ru = ' № %1 от %2'"), СокрЛП(ШапкаРаспознанногоТорг12Акт.НомерДокумента), Формат(ШапкаРаспознанногоТорг12Акт.ДатаДокумента, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	Если Элементы.СоздатьДокументСчетФактура.Видимость Тогда
		ШапкаРаспознаннойСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПараметрыСоздания.РаспознанныйДокументСФ, "НомерДокумента, ДатаДокумента");
		Элементы.СоздатьДокументСчетФактура.Заголовок = Элементы.СоздатьДокументСчетФактура.Заголовок +
		СтрШаблон(НСтр("ru = ' № %1 от %2'"), СокрЛП(ШапкаРаспознаннойСФ.НомерДокумента), Формат(ШапкаРаспознаннойСФ.ДатаДокумента, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	Параметры.ПараметрыСоздания.Вставить("СозданныйДокументТорг12Акт", ПоступлениеРеализацияСсылка);
	Параметры.ПараметрыСоздания.Вставить("СозданныйДокументСФ", СчетФактураСсылка);
	Параметры.ПараметрыСоздания.Вставить("СканПрикрепленТорг12Акт", СканПрикрепленТорг12Акт);
	Параметры.ПараметрыСоздания.Вставить("СканПрикрепленСФ", СканПрикрепленСФ);
	
	СоздатьДокументПоступлениеРеализация = Истина;
	ПрикрепитьСканКПоступлениюРеализации = Истина;
	СоздатьДокументСчетФактура = Истина;
	ПрикрепитьСканКСчетуФактуре = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СброситьРазмерыИПоложениеОкна()

	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ПолноеИмяФормы = Метаданные.Обработки.РаспознаваниеДокументов.Формы.СозданиеКомплекта.ПолноеИмя();
		ХранилищеСистемныхНастроек.Удалить(ПолноеИмяФормы, "", ИмяПользователя);
	КонецЕсли;
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСозданныйДокумент(ДокументСсылка)
	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ДокументСсылка));
КонецПроцедуры

#КонецОбласти

