
// Модуль содержит функции с повторным использованием возвращаемых значений механизма общих переменных.
#Область ВозвращаемыеЗначения

Функция ЗначениеПеременной(ИмяПараметра) Экспорт
	
	НайденноеЗначение = Неопределено;
	ИмяПараметраВР 	  = ВРег(ИмяПараметра);
		
	Если ИмяПараметраВР = ВРег("глТекущийПользователь") Или ИмяПараметраВР = ВРег("ТекущийПользователь") Тогда		
		Выполнить("НайденноеЗначение = Пользователи.ТекущийПользователь()");
		
	ИначеЕсли ИмяПараметраВР = ВРег("ОсновнаяОрганизация")  Тогда		
		НайденноеЗначение = бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой(ИмяПараметра);
		
	ИначеЕсли ИмяПараметраВР = ВРег("ИспользоватьУправляемыеБлокировки") Тогда		
		Выполнить("НайденноеЗначение = ОбщегоНазначенияБПВызовСервераПовтИсп.ИспользоватьУправляемыеБлокировки()");
		
	ИначеЕсли ИмяПараметраВР = ВРег("бит_НастройкиПрограммы") Тогда		
		НайденноеЗначение = бит_ОбщегоНазначения.ЗаполнениеНастроекПрограммы();
		
	ИначеЕсли ИмяПараметраВР = ВРег("бит_РежимФункционированияЗащиты") Тогда 		
		НайденноеЗначение = Константы.бит_РежимФункционированияЗащиты.Получить();
		
	ИначеЕсли ИмяПараметраВР = ВРег("бит_ЗначенияНастроекПользователей") Тогда		
		НайденноеЗначение = Новый Соответствие;
		
	ИначеЕсли ИмяПараметраВР = ВРег("КодЯзыка") Тогда	
		НайденноеЗначение = бит_ПолныеПрава.ПолучитьКодЯзыка(); 
		
	// БИТ_ЖКХ 23.05.2017 12:04:58 Начало правки...
	ИначеЕсли ИмяПараметраВР = ВРег("бит_РазрешитьТекстЛС") Тогда 		
		НайденноеЗначение = Константы.бит_РазрешитьТекстЛС.Получить();
	// БИТ_ЖКХ 23.05.2017 12:04:58 Конец правки.	
		
	КонецЕсли;
    	
	Возврат НайденноеЗначение;
	
КонецФункции // ЗначениеПеременной()

#КонецОбласти