
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Период      = Параметры.Период;
	Переплата   = Параметры.Переплата;
	
	Заголовок = СтрШаблон(НСтр("ru = 'Переплата на %1'"), Формат(НачалоГода(Период), "ДЛФ=D"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Оповещение = Новый ОписаниеОповещения(
		"ПередЗакрытиемЗавершение",
		ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Модифицированность Тогда
		Модифицированность = Ложь;
		ИзменитьОстаткиРасчетовПоНалогу(Организация, Период, Переплата);
		Оповестить("ОбновитьПоказателиРасчетаУСН");
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ИзменитьОстаткиРасчетовПоНалогу(Организация, Период, Переплата);
		Оповестить("ОбновитьПоказателиРасчетаУСН");
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьОстаткиРасчетовПоНалогу(Организация, Период, Переплата)
	
	ПараметрыЗадания = ПомощникиПоУплатеНалоговИВзносов.НовыеПараметрыИзмененияОстатковРасчетовПоНалогамВзносамИП();
	ПараметрыЗадания.Организация       = Организация;
	ПараметрыЗадания.ПериодСобытия     = Период;
	ПараметрыЗадания.ТаблицаОстатков   = ТаблицаПереплатыПоНалогу(Организация, Период, Переплата);
	ПараметрыЗадания.Комментарий =
		НСтр("ru = '#Создан автоматически обработкой ""Помощник расчета налога УСН"" для отражения переплаты по налогу УСН'");
	
	АдресРезультата = "";
	ПомощникиПоУплатеНалоговИВзносов.СохранитьПереплатуПоНалогамВзносамИнтеграцияСБанком(ПараметрыЗадания, АдресРезультата);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаПереплатыПоНалогу(Организация, Период, Переплата)
	
	ТаблицаОстатков = ПомощникиПоУплатеНалоговИВзносов.НоваяТаблицаИзмененияРасчетовПоНалогамВзносамИП();
	
	СтрокаОстаток = ТаблицаОстатков.Добавить();
	СтрокаОстаток.СчетУчета = ПланыСчетов.Хозрасчетный.ЕНприУСН;
	СтрокаОстаток.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог;
	СтрокаОстаток.Переплата = Переплата;
	
	ОстатокРасчетов = УчетУСН.ОстатокРасчетовПоНалогуУСНЗаПредыдущиеНалоговыеПериодыИнтеграцияСБанком(Организация, Период);
	СтрокаОстаток.СуммаИзмененияПереплаты = Переплата - ОстатокРасчетов;
	
	Возврат ТаблицаОстатков;
	
КонецФункции

#КонецОбласти

