
#Область ПроцедурыДействияКомандФормы

&НаКлиенте
Процедура ID(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ОчиститьСообщения();
		
		ЗадатьIDНаСервере(ТекущаяСтрока.Код);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗадатьIDНаСервере(Код)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныИзвещений.Ссылка,
	|	бит_ШаблоныИзвещений.Код,
	|	бит_ШаблоныИзвещений.Идентификатор
	|ИЗ
	|	Справочник.бит_ШаблоныИзвещений КАК бит_ШаблоныИзвещений
	|ГДЕ
	|	бит_ШаблоныИзвещений.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);

	Результат = Запрос.Выполнить().Выгрузить();

	Для каждого Строка Из Результат Цикл
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Идентификатор: " +Строка.Идентификатор);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти