#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытийФормы

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Укажем, что надо проверить из реквизитов табличной части:
	СтруктураОбязательныхПолей = Новый Структура("Подразделение");

	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Подразделения", СтруктураОбязательныхПолей, Отказ, "");
	
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "Подразделения", СтруктураОбязательныхПолей, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли