#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

#Если Клиент Тогда
	
// Функция вызывает форму печати табличного документа с печатной формой.
// Инвентаризационной описи основных средств.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьЗОРПМЖ() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	// Добавление ФИО ответственного за регистрацию из регистра.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	ВЫБОР
	|		КОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения ЕСТЬ NULL 
	|				ИЛИ бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &Момент < бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РАЗНОСТЬДАТ(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, &Момент, ГОД)
	|	КОНЕЦ КАК РегЛицоВозраст,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКодПодразделения КАК ДокументКодПодразделенияПред,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Дата КАК ДатаСвидетельства,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Номер КАК НомерСвидетельства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК ФамилияПред,
	|	бит_ФИОПроживающихСрезПоследних.Имя КАК ИмяПред,
	|	бит_ФИОПроживающихСрезПоследних.Отчество КАК ОтчествоПред
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	|		ПО (бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование = бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";

	Макет         = ПолучитьМакет("ЗОРПМЖ_New");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	АдресПрибытия = ПолучитьКИ(Выборка.РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие);
	СтрокаАдресПрибытия = АдресПрибытия.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия,"Вид");
	
	АдресПрибытия_1 = "";
	АдресПрибытия_2 = "";
	
	Если ЗначениеЗаполнено(СтрокаАдресПрибытия) Тогда
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаАдресПрибытия.Представление, 80, АдресПрибытия_1, АдресПрибытия_2);
		ШапкаОбласть.Параметры.АдресПрибытия = АдресПрибытия_1;
	КонецЕсли; 
	
	ПринятоеРешение_1 = "";
	ПринятоеРешение_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ПринятоеРешение, 80, ПринятоеРешение_1, ПринятоеРешение_2);
	ШапкаОбласть.Параметры.ПринятоеРешение = ПринятоеРешение_1;
	
	ДокументОснование_1 = "";
	ДокументОснование_2 = "";
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокОснованиеСтр = Строка(ДокументОснование) + ?(ЗначениеЗаполнено(ДокументОснование.НомерДокумента)," №"+ Строка(ДокументОснование.НомерДокумента),"")
		+ ?(ЗначениеЗаполнено(ДокументОснование.ДатаДокумента)," от "+ Формат(ДокументОснование.ДатаДокумента,"ДФ='dd.MM.yyyy ""г.""'"),"")
		+ ?(ЗначениеЗаполнено(ДокументОснование.ОрганизацияВыдавшаяДокумент)," , выдан "+ Строка(ДокументОснование.ОрганизацияВыдавшаяДокумент.НаименованиеПолное), "");
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ДокОснованиеСтр, 95, ДокументОснование_1,ДокументОснование_2);
	КонецЕсли;
	
	ШапкаОбласть.Параметры.ДокументОснование1 = ДокументОснование_1;
	ШапкаОбласть.Параметры.ДокументОснование2 = ДокументОснование_2;
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	Если ЗначениеЗаполнено(Выборка.ФамилияПред) Тогда
		Ответственный = Строка(Выборка.ФамилияПред)+" "+ Строка(Выборка.ИмяПред)+" "+Строка(Выборка.ОтчествоПред);
	Иначе
		Ответственный = Строка(Выборка.Ответственный) ;
	КонецЕсли;
	ШапкаОбласть.Параметры.Ответственный = Ответственный;
	
	Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
		ФизЛицо = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
	Иначе
		ФизЛицо = Строка(Выборка.РегистрируемоеЛицо) ;
	КонецЕсли;
	ФизЛицо_Склон = "";
	ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФизЛицо,2,Выборка.РегистрируемоеЛицо.Пол,ФизЛицо_Склон);
	Если ИсходСклонения Тогда
		ФизЛицо = ФизЛицо_Склон;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
		ШапкаОбласть.Параметры.ФизЛицо =  ФизЛицо +", "+Строка(Формат (Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'"));
	Иначе
		ШапкаОбласть.Параметры.ФизЛицо =  ФизЛицо;
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.ЧислоРег  = Формат(Выборка.ДатаРегистрации,"ДФ=dd");
	ШапкаОбласть.Параметры.МесяцРег  = Формат(Выборка.ДатаРегистрации,"ДФ=MM");
	ШапкаОбласть.Параметры.ГодРег    = Формат(Выборка.ДатаРегистрации,"ДФ=yy");
	
	ШапкаОбласть.Параметры.ЧислоСнят = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd");
	ШапкаОбласть.Параметры.МесяцСнят = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=MM");
	ШапкаОбласть.Параметры.ГодСнят   = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=yy");
	
	ШапкаОбласть.Параметры.ЧислоТек = Формат(Дата,"ДФ=dd");
	ШапкаОбласть.Параметры.МесяцТек = Формат(Дата,"ДФ=MM");
	ШапкаОбласть.Параметры.ГодТек   = Формат(Дата,"ДФ=yy");
	
	ШапкаОбласть.Параметры.ЧислоВыдачи = Формат(Выборка.ДатаВыдачи ,"ДФ=dd");
	ШапкаОбласть.Параметры.МесяцВыдачи = Формат(Выборка.ДатаВыдачи ,"ДФ=MM");
	ШапкаОбласть.Параметры.ГодВыдачи   = Формат(Выборка.ДатаВыдачи ,"ДФ=yyyy");
	
	ШапкаОбласть.Параметры.ЧислоВыдачиПред = Формат(Выборка.ДатаВыдачиПред ,"ДФ=dd");
	ШапкаОбласть.Параметры.МесяцВыдачиПред = Формат(Выборка.ДатаВыдачиПред ,"ДФ=MM");
	ШапкаОбласть.Параметры.ГодВыдачиПред   = Формат(Выборка.ДатаВыдачиПред ,"ДФ=yyyy");
	Если НЕ Выборка.РегЛицоВозраст = Неопределено
		И  Выборка.РегЛицоВозраст <= 14 Тогда
		
		ЗаконныйПредставитель_1 = "";
		ЗаконныйПредставитель_2 = "";
		
		Если ФизическиеЛица.Количество()> 0 Тогда
			ТабЗнач = ФизическиеЛица.Выгрузить();
			ЗаконныйПредставитель = Строка(ТабЗнач[0].ФизическоеЛицо);
			СтепеньРодстваЗП      = Строка(ТабЗнач[0].СтепеньРодства);
			ПаспортныеДанныеЗП = бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокой(ТабЗнач[0].ФизическоеЛицо, Дата, Ложь);
			ЗаконныйПредставитель = ?(ЗначениеЗаполнено(СтепеньРодстваЗП),СтепеньРодстваЗП + ", ","") + ЗаконныйПредставитель;
			Если ЗначениеЗаполнено(ПаспортныеДанныеЗП) Тогда
				ЗаконныйПредставитель = ЗаконныйПредставитель + ", " + ПаспортныеДанныеЗП;
			КонецЕсли;
			
		Иначе
			
			ЗаконныйПредставитель = ?(ЗначениеЗаполнено(СтепеньРодства),НРег(Строка(СтепеньРодства)) + ", ","")
			+ Ответственный 
			+ ?(ЗначениеЗаполнено(Выборка.ВидДокументаПред),", " + Строка(Выборка.ВидДокументаПред), "") 
			+?(ЗначениеЗаполнено(Выборка.СерияДокументаПред), ", сер. "+Строка(Выборка.СерияДокументаПред), "")
			+?(ЗначениеЗаполнено(Выборка.НомерДокументаПред), ", № "+ Строка(Выборка.НомерДокументаПред), "")
			+?(ЗначениеЗаполнено(Выборка.ВыданДокументПред),", выдан " + Строка(Выборка.ВыданДокументПред),"")
			+?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделенияПред), ", код орг: "+ Строка(Выборка.ДокументКодПодразделенияПред),"")
			+?(ЗначениеЗаполнено(Выборка.ДатаВыдачиПред), ", дата выдачи: "+ Формат(Выборка.ДатаВыдачиПред,"ДФ='dd.MM.yyyy ""г.""'"), "");
		КонецЕсли;	
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ЗаконныйПредставитель, 65, ЗаконныйПредставитель_1 , ЗаконныйПредставитель_2 );
		ШапкаОбласть.Параметры.ЗаконныйПредставитель1 = ЗаконныйПредставитель_1;
		ШапкаОбласть.Параметры.ЗаконныйПредставитель2 = ЗаконныйПредставитель_2;
	КонецЕсли; 
	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
	ИскомаяСтрока = Неопределено;
	Для каждого СтрокаНабор Из НаборЗаписей  Цикл
		Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
			И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
			Тогда 
			ИскомаяСтрока = СтрокаНабор;
		КонецЕсли;	
		
	КонецЦикла;
	
	ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
	
	Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
		СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
		Если НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
			НасПунктАдрес = ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.НаселенныйПункт),"нас.п. "+СтруктураАдресРегистрации.НаселенныйПункт+", ","")
			+ ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.Город),"г. "+СтруктураАдресРегистрации.Город+", ","")
			+ ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.Район),"р-н "+СтруктураАдресРегистрации.Район+", ","")
			+ ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.Регион),"рег. "+СтруктураАдресРегистрации.Регион,"");
			
			ШапкаОбласть.Параметры.НаселенныйПунктРег = НасПунктАдрес; 
			ШапкаОбласть.Параметры.УлицаРег 	= СтруктураАдресРегистрации.Улица;
			ШапкаОбласть.Параметры.ДомРег		= СтруктураАдресРегистрации.Дом;
			ШапкаОбласть.Параметры.КорпусРег 	= СтруктураАдресРегистрации.Корпус;
			
		КонецЕсли; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.НомерСвидетельства) Тогда
		
		ШапкаОбласть.Параметры.НомерСвидетельства = Выборка.НомерСвидетельства;	
		
	КонецЕсли; 
	
	ОрганУчета_1 = "";
	ОрганУчета_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ПаспортнаяСлужба, 60, ОрганУчета_1 , ОрганУчета_2 );
	ШапкаОбласть.Параметры.ОрганУчета1 = ОрганУчета_1;
	ШапкаОбласть.Параметры.ОрганУчета2 = ОрганУчета_2;
	
	ДолжностноеЛицоОрганизации = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация, ДолжностноеЛицо,Дата);

	ШапкаОбласть.Параметры.ДолжностноеЛицоОрганизации = ДолжностноеЛицоОрганизации;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой сличительной ведомости
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСОРПМЖ() Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("СОРПМЖ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	АдресПрибытия = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(Выборка.РегистрируемоеЛицо, "Юридический");
	
	АдресПрибытия_1 = "";
	АдресПрибытия_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 75, АдресПрибытия_1, АдресПрибытия_2);
	ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
	ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
		
		ФизЛицо = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
		
	Иначе
		
		ФизЛицо = Строка(Выборка.РегистрируемоеЛицо);
		
	КонецЕсли; 
	Если ЗначениеЗаполнено(РегистрируемоеЛицо.ДатаРождения) Тогда
		
		ШапкаОбласть.Параметры.ФизЛицо = ФизЛицо + ", "+Строка(Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='yyyy ""г.""'"));
		
	Иначе
		
		ШапкаОбласть.Параметры.ФизЛицо = ФизЛицо;
		
	КонецЕсли; 

	ШапкаОбласть.Параметры.ЧислоРег  = Формат(Выборка.ДатаРегистрации,"ДФ=dd");
	ШапкаОбласть.Параметры.МесяцРег  = Формат(Выборка.ДатаРегистрации,"ДФ=MMММ");
	ШапкаОбласть.Параметры.ГодРег    = Формат(Выборка.ДатаРегистрации,"ДФ=yy");
	
	ШапкаОбласть.Параметры.ДатаОкончанияРегистрации	 = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy");
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ШапкаОбласть.Параметры.ОрганУчета = Выборка.ДомРег.ПаспортнаяСлужба;				
		
	КонецЕсли;
	ТабДокумент.Вывести(ШапкаОбласть);
	
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьКР() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("КР_New");
	Шапка1Область  = Макет.ПолучитьОбласть("Шапка1");
	СтрокаПаспорт  = Макет.ПолучитьОбласть("СтрокаПаспорт");
	Шапка2Область  = Макет.ПолучитьОбласть("Шапка2");
	
	
	ТаблицаПаспорт = ПолучитьТаблицуДокументов();
	СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
	Шапка1Область.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
	Шапка1Область.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
	Шапка1Область.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
	Шапка1Область.Параметры.НаселенныйПунктРожд = СтруктураМестоРождения.Село;
	
	СтруктураАдресПрибытия = бит_ПаспортныйСтолСервер.ПолнаяКонтактнаяИнформацияПоОбъекту(РегистрируемоеЛицо,Перечисления.бит_ТипыКонтактнойИнформации.Адрес,Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия);
	
	Если ТипЗнч(СтруктураАдресПрибытия) =  Тип("Структура") Тогда
		
		АдресПрибытия = ?(ЗначениеЗаполнено(СтруктураАдресПрибытия.НасПункт),"нас.п. " + СтруктураАдресПрибытия.НасПункт + ", " ,"")
		+ ?(ЗначениеЗаполнено(СтруктураАдресПрибытия.Город),"г. " + СтруктураАдресПрибытия.Город + ", ","")
		+ ?(ЗначениеЗаполнено(СтруктураАдресПрибытия.Район),"р-н " + СтруктураАдресПрибытия.Район + ", ","")
		+ ?(ЗначениеЗаполнено(СтруктураАдресПрибытия.Регион),"рег. " + СтруктураАдресПрибытия.Регион,"");
		Шапка1Область.Параметры.НаселенныйПунктПриб = АдресПрибытия;
		
		Шапка1Область.Параметры.УлицаПриб 	= СтруктураАдресПрибытия.Улица;
		Шапка1Область.Параметры.ДомПриб 	= СтруктураАдресПрибытия.Дом;
		Шапка1Область.Параметры.КорпусПриб 	= СтруктураАдресПрибытия.Корпус;
		Шапка1Область.Параметры.КвартираПриб = СтруктураАдресПрибытия.Квартира;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда 
		
		Шапка1Область.Параметры.ДеньРожд  	= Формат(Выборка.ДатаРождения,"ДФ=dd");
		ДатаМесяц							= Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
		Шапка1Область.Параметры.МесяцРожд 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		Шапка1Область.Параметры.ГодРожд   	= Формат(Выборка.ДатаРождения,"ДФ=yyyy");
		
	КонецЕсли;
	
	Шапка1Область.Параметры.Заполнить(Выборка);
	
	Шапка1Область.Параметры.ДеньПриб  	= Формат(ДатаРегистрации,"ДФ=dd");
	ДатаМесяц							= Формат(ДатаРегистрации,"ДФ='дд.MMMM'");
	Шапка1Область.Параметры.МесяцПриб 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	Шапка1Область.Параметры.ГодПриб   	= Формат(ДатаРегистрации,"ДФ=yyyy");
	
	ТабДокумент.Вывести(Шапка1Область);
	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
	ВыборкаПочтАдр = Неопределено;
	Для каждого СтрокаНабор Из НаборЗаписей  Цикл
		Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
			И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
			Тогда 
			ВыборкаПочтАдр = СтрокаНабор;
		КонецЕсли;	
	КонецЦикла;
	
	ПочтовыйАдресСтрока = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
	СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
	Если СтруктураПочтовыйАдрес <> Неопределено И НЕ СтруктураПочтовыйАдрес.Свойство("ЗаПределамиРФ") Тогда
		Если ЗначениеЗаполнено(СтруктураПочтовыйАдрес.Город) Тогда
			Шапка2Область.Параметры.НаселенныйПунктРег = СтруктураПочтовыйАдрес.Город ;
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураПочтовыйАдрес.НаселенныйПункт) Тогда
			Шапка2Область.Параметры.НаселенныйПунктРег = СтруктураПочтовыйАдрес.НаселенныйПункт;
			
		КонецЕсли;
		
		Шапка2Область.Параметры.УлицаРег 	= СтруктураАдресПрибытия.Улица;
		Шапка2Область.Параметры.ДомРег 		= СтруктураАдресПрибытия.Дом;
		Шапка2Область.Параметры.КорпусРег 	= СтруктураАдресПрибытия.Корпус;
		
	КонецЕсли; 
	
	
	Для каждого Строка Из ТаблицаПаспорт Цикл
		
		СтрокаПаспорт.Параметры.Заполнить(Строка);
		Если ЗначениеЗаполнено(Строка.ВидДокумента) Тогда
			СтрокаПаспорт.Параметры.ВидДокумента = Строка.ВидДокумента.КодПФР;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Строка.ВыданДокумент) Тогда
			СтрокаПаспорт.Параметры.ДатаВыдачиДок = ",  выд. " + Формат(Строка.ДатаВыдачиДокумента,"ДЛФ=Д")+ "г.";
		КонецЕсли; 
		ТабДокумент.Вывести(СтрокаПаспорт)
		
	КонецЦикла; 
	
	КолПараметров = СтрокаПаспорт.Параметры.Количество();
	НомерТекПараметра = 0;
	
	Пока КолПараметров <> 0 Цикл
		
		СтрокаПаспорт.Параметры.Установить(НомерТекПараметра,"");
		КолПараметров = КолПараметров - 1;
		НомерТекПараметра = НомерТекПараметра + 1;
		
	КонецЦикла; 
	
	КоличествоСтрокНаВывод = 4 - ТаблицаПаспорт.Количество();
	
	Если КоличествоСтрокНаВывод > 0 Тогда
		Пока КоличествоСтрокНаВывод <> 0  Цикл
			КоличествоСтрокНаВывод = КоличествоСтрокНаВывод - 1;
			ТабДокумент.Вывести(СтрокаПаспорт);
		КонецЦикла; 
	КонецЕсли; 
	
	Шапка2Область.Параметры.Заполнить(Выборка);
	
	ТабДокумент.Вывести(Шапка2Область);
	
	Возврат ТабДокумент;
	
	
КонецФункции

// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьЛСУП() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("ЛСУП");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
		
		СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
		ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
		ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
		ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
		ШапкаОбласть.Параметры.СтранаРожд          = СтруктураМестоРождения.Страна;
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.Пол) Тогда
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				
				ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				
				ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			КонецЕсли;
		КонецЕсли; 
		ШапкаОбласть.Параметры.Заполнить(Выборка);
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
			
			ШапкаОбласть.Параметры.ДеньРожд   = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=dd");
			ДатаМесяц 							= Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРожд 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			МесяцРожд                         = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=MM");
			ШапкаОбласть.Параметры.МесяцРожд1 = Сред(МесяцРожд,1,1);
			ШапкаОбласть.Параметры.МесяцРожд2 = Сред(МесяцРожд,2,1);
			ГодРожд                           = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=yyyy");
			ШапкаОбласть.Параметры.ГодРожд1   = Сред(ГодРожд,1,1);
			ШапкаОбласть.Параметры.ГодРожд2   = Сред(ГодРожд,2,1);
			ШапкаОбласть.Параметры.ГодРожд3   = Сред(ГодРожд,3,1);
			ШапкаОбласть.Параметры.ГодРожд4   = Сред(ГодРожд,4,1);
			
		КонецЕсли;
		
		ИскомаяСтрока = ПолучитьКИ(Выборка.РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие); 
		Строка = ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия, "Вид");
		ПолныйАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(Строка);
		
		Если  ЗначениеЗаполнено(ПолныйАдресПрибытия) Тогда
			СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПолныйАдресПрибытия);
			Если НЕ СтруктураАдресПрибытия.Свойство("ЗаПределамиРФ") Тогда
				
				ШапкаОбласть.Параметры.ГосударствоПриб     = СтруктураАдресПрибытия.Страна;
				ШапкаОбласть.Параметры.РегионПриб          = СтруктураАдресПрибытия.Регион;
				ШапкаОбласть.Параметры.РайонПриб           = СтруктураАдресПрибытия.Район ;
				ШапкаОбласть.Параметры.ГородПриб           = СтруктураАдресПрибытия.Город ;
				ШапкаОбласть.Параметры.НаселенныйПунктПриб = СтруктураАдресПрибытия.НаселенныйПункт;
				
			КонецЕсли;
		КонецЕсли;
		
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
		ИскомаяСтрока = Неопределено;
		Для каждого СтрокаНабор Из НаборЗаписей  Цикл
			Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
				И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
				Тогда 
				ИскомаяСтрока = СтрокаНабор;
			КонецЕсли;	
			
		КонецЦикла;
		
		ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
		
		Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
			
			СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
			Если СтруктураАдресРегистрации <> Неопределено И НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
				
				ШапкаОбласть.Параметры.РегионРег 			= СтруктураАдресРегистрации.Регион;
				ШапкаОбласть.Параметры.РайонРег 			= СтруктураАдресРегистрации.Район;
				ШапкаОбласть.Параметры.ГородРег 			= СтруктураАдресРегистрации.Город;
				ШапкаОбласть.Параметры.НаселенныйПунктРег 	= СтруктураАдресРегистрации.НаселенныйПункт;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	ДолжностноеЛицоОрганизации = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация, ДолжностноеЛицо, Дата);
	ШапкаОбласть.Параметры.ДолжностноеЛицоОрганизации = ДолжностноеЛицоОрганизации;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция вызывает форму печати табличного документа с печатной формой.
// Инвентаризационной описи основных средств.
//
// Параметры:
//  ПечатьДвухЧастей - булево, печатать обе части заявления (Истина) или только верхнюю (Ложь).
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьЗОССРУПМЖ(ПечатьДвухЧастей) Экспорт
	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	// Добавление регистра сведений с ФИО ответственного за регистрацию.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	ВЫБОР
	|		КОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения ЕСТЬ NULL 
	|				ИЛИ бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &Момент < бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РАЗНОСТЬДАТ(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, &Момент, ГОД)
	|	КОНЕЦ КАК РегЛицоВозраст,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКодПодразделения КАК ДокументКодПодразделенияПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМС КАК ОрганФМСПрибытия,
	|	бит_ФИОПроживающихСрезПоследних1.Фамилия КАК ФамилияПред,
	|	бит_ФИОПроживающихСрезПоследних1.Имя КАК ИмяПред,
	|	бит_ФИОПроживающихСрезПоследних1.Отчество КАК ОтчествоПред
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ФИОПроживающихСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";

		Макет         = ПолучитьМакет("ЗОССРУПМЖ_New");
		ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
		
		ШапкаОбласть1 = Макет.ПолучитьОбласть("Шапка1");
		// Таблица значений с данными  Проживающие, вкладка Адреса и телефоны. 
		ИскомаяСтрока 	= ПолучитьКИ(Выборка.РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие); 
		// Адрес прибытия.  
		ВыборкаАдрПриб 	= ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия, "Вид");
		// Адрес по прописке.
		ВыборкаАдр 		= ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего, "Вид");
		
		// Адрес по убытия.
		ВыборкаАдрУбыт 	= ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресУбытия, "Вид");
		СтрокаАдрУбыт = Неопределено;
		Если ЗначениеЗаполнено(ВыборкаАдрУбыт.Представление) Тогда
			СтрокаАдрУбыт = ВыборкаАдрУбыт.Представление;
		КонецЕсли; 
		
		ДолжностноеЛицоОрганизации = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация, ДолжностноеЛицо,Дата);
		
		// Почтовый адрес здания.
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
		ВыборкаПочтАдр = Неопределено;
		Для каждого СтрокаНабор Из НаборЗаписей  Цикл
			Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
				И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
				Тогда 
				ВыборкаПочтАдр = СтрокаНабор;
			КонецЕсли;	
		КонецЦикла;
		ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
		СтруктураПочтАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
		
		ВидДокумента_1 = "";           
		ВидДокумента_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ВидДокумента, 25, ВидДокумента_1 , ВидДокумента_2 );
		
		ПочтовыйАдресСтрока = Неопределено;
		ПочтовыйАдресСтруктура = бит_ПаспортныйСтолСервер.ПолнаяКонтактнаяИнформацияПоОбъекту(ЛицевойСчет.Здание, Перечисления.бит_ТипыКонтактнойИнформации.Адрес,Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
		Если ТипЗнч(ПочтовыйАдресСтруктура) = Тип("Структура") Тогда
			ПочтовыйАдресСтрока = ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Регион),"рег. "+ ПочтовыйАдресСтруктура.Регион+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Район),"р-н "+ ПочтовыйАдресСтруктура.Район+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Город),"г. "+ ПочтовыйАдресСтруктура.Город+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.НасПункт),"нас.п. "+ ПочтовыйАдресСтруктура.НасПункт+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Улица),"ул. "+ ПочтовыйАдресСтруктура.Улица+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Дом),Строка(ПочтовыйАдресСтруктура.ТипДома)+" "+ ПочтовыйАдресСтруктура.Дом+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Корпус),Строка(ПочтовыйАдресСтруктура.ТипКорпуса)+" " + ПочтовыйАдресСтруктура.Корпус+ ", ","");
		КонецЕсли;
		ПочтовыйАдрес = Строка(ПочтовыйАдресСтрока) + ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира)," кв. "+Строка(ЛицевойСчет.Квартира), "");
		
		Если ЗначениеЗаполнено(Выборка.ФамилияПред) Тогда
			Ответственный = Строка(Выборка.ФамилияПред)+" "+ Строка(Выборка.ИмяПред)+" "+Строка(Выборка.ОтчествоПред);
		Иначе
			Ответственный = Строка(Выборка.Ответственный) ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			ФизЛицо = Строка(Выборка.Фамилия) + " " + Строка(Выборка.Имя) + " " + Строка(Выборка.Отчество); 
		Иначе
			ФизЛицо = Строка(Выборка.РегистрируемоеЛицо);	
		КонецЕсли;
		
		// Перевод в родительный падеж.
		ФизЛицо_Склон = "";
		ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФизЛицо,2,Выборка.РегистрируемоеЛицо.Пол,ФизЛицо_Склон);
		
		Если ИсходСклонения Тогда
			ФизЛицо = ФизЛицо_Склон;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
			
			ФизЛицо = ФизЛицо +",  "+ Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=dd.MM.yyyy")+" г.р.";
			
		КонецЕсли;
		
		ЗаконныйПредставитель_1 = "";
		ЗаконныйПредставитель_2 = "";
		Если НЕ Выборка.РегЛицоВозраст = Неопределено
			И  Выборка.РегЛицоВозраст <= 14 Тогда
			Если ФизическиеЛица.Количество()> 0 Тогда
				ТабЗнач = ФизическиеЛица.Выгрузить();
				ЗаконныйПредставитель = Строка(ТабЗнач[0].ФизическоеЛицо);
				СтепеньРодстваЗП      = Строка(ТабЗнач[0].СтепеньРодства);
				ПаспортныеДанныеЗП = бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокой(ТабЗнач[0].ФизическоеЛицо, Дата, Ложь);
				ЗаконныйПредставитель = ?(ЗначениеЗаполнено(СтепеньРодстваЗП),СтепеньРодстваЗП + ", ","") + ЗаконныйПредставитель;
				Если ЗначениеЗаполнено(ПаспортныеДанныеЗП)  Тогда
					ЗаконныйПредставитель = ЗаконныйПредставитель + ", " + ПаспортныеДанныеЗП;
				КонецЕсли;
				
			Иначе
				ЗаконныйПредставитель = ?(ЗначениеЗаполнено(СтепеньРодства),НРег(Строка(СтепеньРодства)) + ", ","")
				+ Ответственный  
				+ ?(ЗначениеЗаполнено(Выборка.ВидДокументаПред),", " + Строка(Выборка.ВидДокументаПред), "") 
				+?(ЗначениеЗаполнено(Выборка.СерияДокументаПред), ", сер. "+Строка(Выборка.СерияДокументаПред), "")
				+?(ЗначениеЗаполнено(Выборка.НомерДокументаПред), ", № "+ Строка(Выборка.НомерДокументаПред), "")
				+?(ЗначениеЗаполнено(Выборка.ВыданДокументПред),", выдан " + Строка(Выборка.ВыданДокументПред),"")
				+?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделенияПред), ", код орг: "+ Строка(Выборка.ДокументКодПодразделенияПред),"")
				+?(ЗначениеЗаполнено(Выборка.ДатаВыдачиПред), ", дата выдачи: "+ Формат(Выборка.ДатаВыдачиПред,"ДФ='dd.MM.yyyy ""г.""'"), "");
				
			КонецЕсли;	
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ЗаконныйПредставитель, 65, ЗаконныйПредставитель_1 , ЗаконныйПредставитель_2 );
			
		КонецЕсли; 
		
		Если ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета или ПечатьДвухЧастей Тогда
			АдресРегистрации_1 = "";
			АдресРегистрации_2 = "";
			
			ШапкаОбласть1.Параметры.Заполнить(Выборка);           
			
			Если ПечатьДвухЧастей Тогда

				ШапкаОбласть1.Параметры.ОрганУчета 			= ?(ЗначениеЗаполнено(Выборка.ОрганФМСПрибытия), Строка(Выборка.ОрганФМСПрибытия), "");
				
				ШапкаОбласть1.Параметры.ОрганУчетаПрописки 	= Выборка.ДомРег.ПаспортнаяСлужба;

				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ПочтовыйАдрес, 40, АдресРегистрации_1 , АдресРегистрации_2 );
				ШапкаОбласть1.Параметры.АдресРегистрации_1 =  АдресРегистрации_1;
				ШапкаОбласть1.Параметры.АдресРегистрации_2 =  АдресРегистрации_2;
				
				ШапкаОбласть1.Параметры.ЗаконныйПредставитель_1 =  ЗаконныйПредставитель_1;
				ШапкаОбласть1.Параметры.ЗаконныйПредставитель_2 =  ЗаконныйПредставитель_2;
				
				Если ЗначениеЗаполнено(ВыборкаАдрПриб.Представление) Тогда
					АдресРегистрации_1_1 = "";
					АдресРегистрации_1_2 = "";
					бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВыборкаАдрПриб.Представление, 25, АдресРегистрации_1_1 , АдресРегистрации_1_2 );
					ШапкаОбласть1.Параметры.АдресПрибытия_2_1 = АдресРегистрации_1_1;
					ШапкаОбласть1.Параметры.АдресПрибытия_2_2 = АдресРегистрации_1_2;
				КонецЕсли; 
				
			Иначе
				ШапкаОбласть1.Параметры.ОрганУчета 			= Выборка.ДомРег.ПаспортнаяСлужба;
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ПочтовыйАдрес, 50, АдресРегистрации_1 , АдресРегистрации_2 );
				ШапкаОбласть1.Параметры.АдресПрибытия_2_1 	= АдресРегистрации_1;
				ШапкаОбласть1.Параметры.АдресПрибытия_2_2 	= АдресРегистрации_2;
				ШапкаОбласть1.Параметры.ОрганУчетаПрописки 	= ?(ЗначениеЗаполнено(Выборка.ОрганФМСПрибытия), Строка(Выборка.ОрганФМСПрибытия), "");
				
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаАдрУбыт, 40, АдресРегистрации_1 , АдресРегистрации_2 );
				ШапкаОбласть1.Параметры.АдресРегистрации_1 =  АдресРегистрации_1;
				ШапкаОбласть1.Параметры.АдресРегистрации_2 =  АдресРегистрации_2;
				
			КонецЕсли; 

			ШапкаОбласть1.Параметры.ВыданДокумент_1 	= Строка(Выборка.ВыданДокумент);
			
			ШапкаОбласть1.Параметры.ФизЛицо 			= ФизЛицо;
			
			ШапкаОбласть1.Параметры.ЧислоТек    = Формат(Дата,"ДФ=dd");
			ДатаМесяц 							= Формат(Дата,"ДФ='дд.ММММ  yyyy '");
			ШапкаОбласть1.Параметры.МесяцГодТек = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			
			Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда
				ШапкаОбласть1.Параметры.ДатаВыдачиДокумента  	= День(Выборка.ДатаВыдачиДокумента);
				ДатаМесяц 										= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
				ШапкаОбласть1.Параметры.МесяцВыдачиДокумента 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть1.Параметры.ГодВыдачиДокумента   	= Формат(Выборка.ДатаВыдачиДокумента,"ДФ=yyyy");
				ШапкаОбласть1.Параметры.ВидДокумента_1 			= ВидДокумента_1; 
			КонецЕсли;	
			
			ШапкаОбласть1.Параметры.ЗаконныйПредставитель_1 = ЗаконныйПредставитель_1;
			ШапкаОбласть1.Параметры.ЗаконныйПредставитель_2 = ЗаконныйПредставитель_2;
			
		КонецЕсли;
		
		Если ВидОперации <> Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета или ПечатьДвухЧастей Тогда
			ДокОснование 	= Выборка.ДокументОснование;
			ДокументОснование_1 = "";
			ДокументОснование_2 = "";
			Если ДокОснование <> Неопределено Тогда
				ДокОснованиеСтр = Строка(ДокОснование) + ?(ЗначениеЗаполнено(ДокОснование.НомерДокумента)," №"+ Строка(ДокОснование.НомерДокумента),"");
				ДокОснованиеСтр = ДокОснованиеСтр + ?(ЗначениеЗаполнено(ДокОснование.ДатаДокумента)," от "+ Формат(ДокОснование.ДатаДокумента,"ДФ='dd.MM.yyyy ""г.""'"),"") ; 
				ДокОснованиеСтр = ДокОснованиеСтр + ?(ЗначениеЗаполнено(ДокОснование.ОрганизацияВыдавшаяДокумент)," , выдан "+ Строка(ДокОснование.ОрганизацияВыдавшаяДокумент.НаименованиеПолное), "");
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ДокОснованиеСтр, 95, ДокументОснование_1,ДокументОснование_2);
			КонецЕсли; 
			ПринятоеРешение_1 = "";
			ПринятоеРешение_2 = "";
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ПринятоеРешение, 85, ПринятоеРешение_1 , ПринятоеРешение_2 );
			
			ШапкаОбласть.Параметры.Заполнить(Выборка);
			
			ОрганУчета_1 = "";
			ОрганУчета_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ДомРег.ПаспортнаяСлужба, 65, ОрганУчета_1 , ОрганУчета_2);
			ШапкаОбласть.Параметры.ОрганУчета_1			= ОрганУчета_1;
			ШапкаОбласть.Параметры.ОрганУчета_2			= ОрганУчета_2;
			ШапкаОбласть.Параметры.ВыданДокумент_1 		= Строка(Выборка.ВыданДокумент);
			ШапкаОбласть.Параметры.ДокументОснование1 	= ДокументОснование_1;
			ШапкаОбласть.Параметры.ДокументОснование2 	= ДокументОснование_2;
			ШапкаОбласть.Параметры.ЗаконныйПредставитель_1 = ЗаконныйПредставитель_1;
			ШапкаОбласть.Параметры.ЗаконныйПредставитель_2 = ЗаконныйПредставитель_2;
			ШапкаОбласть.Параметры.Ответственный 		= Ответственный  + 
			?(ЗначениеЗаполнено(СтепеньРодства),", " + НРег(Строка(СтепеньРодства)), "");
			
			ШапкаОбласть.Параметры.ФизЛицо 				  = ФизЛицо;    
			
			ШапкаОбласть.Параметры.АдресПрибытия     	  = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(ВыборкаАдрПриб);
			
			ШапкаОбласть.Параметры.ЧислоТек    	= Формат(Дата,"ДФ=dd");
			ДатаМесяц 							= Формат(Дата,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцТек    	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодТек      	= Формат(Дата,"ДФ=yy");
			
			ШапкаОбласть.Параметры.ЧислоРеш    	= Формат(ДатаРегистрации,"ДФ=dd");
			ДатаМесяцРеш 						= Формат(ДатаРегистрации,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРеш    	= Сред(ДатаМесяцРеш, 4, СтрДлина(ДатаМесяцРеш));
			ШапкаОбласть.Параметры.ГодРеш4     	= Формат(ДатаРегистрации,"ДФ=yyyy");
			ШапкаОбласть.Параметры.ДолжностноеЛицоОрганизации  = ДолжностноеЛицоОрганизации;
			ШапкаОбласть.Параметры.ПринятоеРешение_1     = ПринятоеРешение_1;
			ШапкаОбласть.Параметры.ПринятоеРешение_2     = ПринятоеРешение_2;
			
			Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда
				ШапкаОбласть.Параметры.ДатаВыдачиДокумента  = День(Выборка.ДатаВыдачиДокумента);
				ДатаМесяц 									= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцВыдачиДокумента = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодВыдачиДокумента   = Формат(Выборка.ДатаВыдачиДокумента,"ДФ=yyyy");
			КонецЕсли;
			
			ШапкаОбласть.Параметры.ВидДокумента_1 		= ВидДокумента_1; 
			Если ЗначениеЗаполнено(ВыборкаАдр.Представление) Тогда
				
				Если ЗначениеЗаполнено(ВыборкаАдр.Поле5) Тогда
					ШапкаОбласть.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле5;
				ИначеЕсли ЗначениеЗаполнено(ВыборкаАдр.Поле4) Тогда
					ШапкаОбласть.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле4;
				ИначеЕсли ЗначениеЗаполнено(ВыборкаАдр.Поле3) Тогда
					ШапкаОбласть.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле3;
				ИначеЕсли ЗначениеЗаполнено(ВыборкаАдр.Поле2) Тогда
					ШапкаОбласть.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле2;
				КонецЕсли; 
				
				ШапкаОбласть.Параметры.УлицаРег    			= ВыборкаАдр.Поле6;
				ШапкаОбласть.Параметры.ДомРег  				= ВыборкаАдр.Поле7;
				ШапкаОбласть.Параметры.КорпусРег   			= ВыборкаАдр.Поле8;
				ШапкаОбласть.Параметры.КвартираРег 			= ВыборкаАдр.Поле9;
				
			Иначе
				
				Если СтруктураПочтАдрес <> Неопределено И НЕ СтруктураПочтАдрес.Свойство("ЗаПределамиРФ") Тогда
					Если ЗначениеЗаполнено(СтруктураПочтАдрес.НаселенныйПункт) Тогда
						ШапкаОбласть.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.НаселенныйПункт;
					ИначеЕсли ЗначениеЗаполнено(СтруктураПочтАдрес.Город) Тогда
						ШапкаОбласть.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.Город;
					ИначеЕсли ЗначениеЗаполнено(СтруктураПочтАдрес.Регион) Тогда
						ШапкаОбласть.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.Регион;
					КонецЕсли;
					ШапкаОбласть.Параметры.УлицаРег    			= СтруктураПочтАдрес.Улица;
					ШапкаОбласть.Параметры.ДомРег  				= СтруктураПочтАдрес.Дом;
					ШапкаОбласть.Параметры.КорпусРег   			= СтруктураПочтАдрес.Корпус;
					ШапкаОбласть.Параметры.КвартираРег 			= Выборка.КвартираРег;
				Иначе
					ШапкаОбласть.Параметры.УлицаРег    			= Выборка.УлицаРег;
					ШапкаОбласть.Параметры.ДомРег  				= Выборка.ДомРег;
					ШапкаОбласть.Параметры.КорпусРег   			= Выборка.КорпусРег;
					ШапкаОбласть.Параметры.КвартираРег 			= Выборка.КвартираРег;
					
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
		ТабДокумент.Вывести(ШапкаОбласть);
		ТабДокумент.Вывести(ШапкаОбласть1);
		
	Иначе

		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните обязательные поля - Лицевой счет и Регистрируемое лицо";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой адресный листок прибытия.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьАЛП(ВидМакета) Экспорт  
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРег,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	ВыборкаТЗ = Запрос.Выполнить().Выгрузить();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	
	Если ВидМакета Тогда
		Макет         = ПолучитьМакет("АЛП_New");
	Иначе 	
		Макет         = ПолучитьМакет("АЛП");
	КонецЕсли;
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если ВыборкаТЗ.Количество()= 0 Тогда
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	ВыборкаИсходник = ВыборкаТЗ[0];
	ВыборкаПриемник = Новый ТаблицаЗначений;
	Для Каждого Колонка Из ВыборкаТЗ.Колонки Цикл
		ВыборкаПриемник.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	Выборка = ВыборкаПриемник.Добавить();
	ЗаполнитьЗначенияСвойств(Выборка, ВыборкаИсходник);
	
	// При переводе к верхнему регистру типы данных приведены к строке.
	Выборка.ДокументОснование  = ВРег(Строка(ВыборкаИсходник.ДокументОснование));
	Выборка.ПринятоеРешение    = ВРег(Строка(ВыборкаИсходник.ПринятоеРешение));
	Выборка.ОткудаПрибыл       = ВРег(Строка(ВыборкаИсходник.ОткудаПрибыл));
	Выборка.УлицаРег           = ВРег(Строка(ВыборкаИсходник.УлицаРег));
	Выборка.ДомРег             = ВРег(Строка(ВыборкаИсходник.ДомРег));
	Выборка.КвартираРег        = ВРег(Строка(ВыборкаИсходник.КвартираРег));
	Выборка.КорпусРег          = ВРег(Строка(ВыборкаИсходник.КорпусРег));
	Выборка.ПочтовыйАдрес      = ВРег(ВыборкаИсходник.ПочтовыйАдрес);
	Выборка.ВидДокумента       = ВРег(Строка(ВыборкаИсходник.ВидДокумента));
	Выборка.СерияДокумента     = ВРег(ВыборкаИсходник.СерияДокумента);
	Выборка.НомерДокумента     = ВРег(ВыборкаИсходник.НомерДокумента);
	Выборка.ВыданДокумент      = ВРег(ВыборкаИсходник.ВыданДокумент);
	Выборка.ДокументКодПодразделения  = ВРег(ВыборкаИсходник.ДокументКодПодразделения);
	Выборка.ВидДокументаПред   = ВРег(Строка(ВыборкаИсходник.ВидДокументаПред));
	Выборка.СерияДокументаПред = ВРег(ВыборкаИсходник.СерияДокументаПред);
	Выборка.НомерДокументаПред = ВРег(ВыборкаИсходник.НомерДокументаПред);
	Выборка.ВыданДокументПред  = ВРег(ВыборкаИсходник.ВыданДокументПред);
	Выборка.ПаспортнаяСлужба   = ВРег(ВыборкаИсходник.ПаспортнаяСлужба);
	Выборка.Страна             = ВРег(Строка(ВыборкаИсходник.Страна));
	Выборка.Фамилия            = ВРег(ВыборкаИсходник.Фамилия);
	Выборка.Имя                = ВРег(ВыборкаИсходник.Имя);
	Выборка.Отчество           = ВРег(ВыборкаИсходник.Отчество);
	
	ВыданДокумент_1 = "";
	ВыданДокумент_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ВыданДокумент, 60, ВыданДокумент_1 , ВыданДокумент_2 );
	ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
	ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
	
	СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
	ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
	ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
	ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
	
	Если ВидМакета Тогда
		
		ШапкаОбласть.Параметры.СтранаРожд = СтруктураМестоРождения.Страна;
	КонецЕсли;
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.Пол) Тогда
		ПолФизЛица = Выборка.РегистрируемоеЛицо.Пол;
		Если ПолФизЛица = Перечисления.ПолФизическогоЛица.Мужской Тогда
			ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ИначеЕсли  ПолФизЛица = Перечисления.ПолФизическогоЛица.Женский Тогда
			ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		КонецЕсли; 
	КонецЕсли;
	
	ШапкаОбласть.Параметры.Гражданство = Выборка.Страна;
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	Если ВидМакета Тогда
		ПаспортнаяСлужба_1 = "";
		ПаспортнаяСлужба_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ПаспортнаяСлужба, 35, ПаспортнаяСлужба_1 , ПаспортнаяСлужба_2 );
		
		ШапкаОбласть.Параметры.ПаспортнаяСлужба_1 	= ВРег(ПаспортнаяСлужба_1);
		ШапкаОбласть.Параметры.ПаспортнаяСлужба_2 	= ВРег(ПаспортнаяСлужба_2);
		Если ТипЗнч(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
			ШапкаОбласть.Параметры.КодПаспортнойСлужбы  = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПоОКПО;
		КонецЕсли; 
	Иначе
		ШапкаОбласть.Параметры.ПаспортнаяСлужба		= ВРег(Выборка.ПаспортнаяСлужба);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
		
		Если ВидМакета Тогда
			
			ШапкаОбласть.Параметры.ДеньРождения   	= День(Выборка.ДатаРождения);
			ДатаМесяц							  	= Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРождения  	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРождения    	= Формат(Выборка.ДатаРождения,"ДФ='yyyy'");	
		Иначе
			ШапкаОбласть.Параметры.ДатаРождения		= Формат(Выборка.ДатаРождения,"ДЛФ=DD");
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Если ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства Тогда
			
			ЗачеркнутыйШрифт = Новый Шрифт(Макет.Область("ТекстПребывания").Шрифт,,,,,,Истина);
			ШапкаОбласть.Область("ТекстПребывания").Шрифт = ЗачеркнутыйШрифт;
			
		ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания    Тогда
			
			ЗачеркнутыйШрифт = Новый Шрифт(Макет.Область("ТекстЖительство").Шрифт,,,,,,Истина);
			ШапкаОбласть.Область("ТекстЖительство").Шрифт = ЗачеркнутыйШрифт;
			
		КонецЕсли; 
		
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ЛицевойСчет.Здание);
		ИскомаяСтрока = Неопределено;
		
		Для каждого СтрокаНабор Из НаборЗаписей  Цикл
			Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
				И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
				Тогда 
				ИскомаяСтрока = СтрокаНабор;
			КонецЕсли;	
		КонецЦикла;
		
		ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
		Если ЗначениеЗаполнено(ЗаписьАдрес)  Тогда
			
			СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
			Если НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
				
				ШапкаОбласть.Параметры.РегионРег 			= ВРег(СтруктураАдресРегистрации.Регион);
				ШапкаОбласть.Параметры.РайонРег 			= ВРег(СтруктураАдресРегистрации.Район);
				ШапкаОбласть.Параметры.ГородРег 			= ВРег(СтруктураАдресРегистрации.Город);
				ШапкаОбласть.Параметры.НаселенныйПунктРег 	= ВРег(СтруктураАдресРегистрации.НаселенныйПункт);
				ШапкаОбласть.Параметры.УлицаРег 			= ВРег(СтруктураАдресРегистрации.Улица);
				ШапкаОбласть.Параметры.КорпусРег 			= ВРег(СтруктураАдресРегистрации.Корпус);
				ШапкаОбласть.Параметры.ДомРег	 			= ВРег(СтруктураАдресРегистрации.Дом);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВидМакета Тогда
			
			ШапкаОбласть.Параметры.ДеньРегистрации        = День(ДатаРегистрации);
			ДатаМесяц							  		  = Формат(ДатаРегистрации,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРегистрации       = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРегистрации         = Формат(ДатаРегистрации,"ДФ='yyyy '");
			
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда
		
		Если ВидМакета Тогда
			
			ШапкаОбласть.Параметры.ДеньВыдачиДокумента    = День(Выборка.ДатаВыдачиДокумента);
			ДатаМесяц							  		  = Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента   = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодВыдачиДокумента     = Формат(Выборка.ДатаВыдачиДокумента,"ДФ='yyyy'");
			
		Иначе
			ШапкаОбласть.Параметры.ДатаВыдачиДокумента    = Формат(Выборка.ДатаВыдачиДокумента,"ДЛФ=DD");
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ВидМакета Тогда
		
	Иначе
		ШапкаОбласть.Параметры.ДатаСоставления        = Формат(Дата,"ДЛФ=DD");
		
	КонецЕсли;
	
	ШапкаОбласть.Параметры.ДатаСнятияСРегистрации = ДатаСнятияСРегистрации;  
	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.РегистрируемоеЛицо);
	ИскомаяСтрока = Неопределено;
	Для каждого СтрокаНабор Из НаборЗаписей  Цикл
		Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
			И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия
			Тогда 
			ИскомаяСтрока = СтрокаНабор;
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
	
	СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
	
	Если ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СДругогоГорода
		ИЛИ ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ВТомЖеГородеСДругогоАдреса Тогда
		Если ВидМакета Тогда
			
			ШапкаОбласть.Параметры.СтранаПрибДГ 		   	 = Выборка.Страна;
			
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗаписьАдрес) И НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
			ШапкаОбласть.Параметры.РегионПрибДГ          = ВРег(СтруктураАдресРегистрации.Регион);
			ШапкаОбласть.Параметры.РайонПрибДГ           = ВРег(СтруктураАдресРегистрации.Район) ;
			ШапкаОбласть.Параметры.ГородПрибДГ           = ВРег(СтруктураАдресРегистрации.Город) ;
			ШапкаОбласть.Параметры.НаселенныйПунктПрибДГ = ВРег(СтруктураАдресРегистрации.НаселенныйПункт) ;
			ШапкаОбласть.Параметры.УлицаПрибДГ           = ВРег(СтруктураАдресРегистрации.Улица) ;
			ШапкаОбласть.Параметры.ДомПрибДГ             = ВРег(СтруктураАдресРегистрации.Дом) ;
			ШапкаОбласть.Параметры.КорпусПрибДГ          = ВРег(СтруктураАдресРегистрации.Корпус) ;
			ШапкаОбласть.Параметры.КвартираПрибДГ        = ВРег(СтруктураАдресРегистрации.Квартира) ;
		КонецЕсли;			
		
		Если ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ВТомЖеГородеСДругогоАдреса Тогда
			
			Если ЗначениеЗаполнено(ЗаписьАдрес) И НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
				ШапкаОбласть.Параметры.УлицаПрибТГ           = ВРег(СтруктураАдресРегистрации.Улица) ;
				ШапкаОбласть.Параметры.ДомПрибТГ             = ВРег(СтруктураАдресРегистрации.Дом) ;
				ШапкаОбласть.Параметры.КорпусПрибТГ          = ВРег(СтруктураАдресРегистрации.Корпус) ;
				ШапкаОбласть.Параметры.КвартираПрибТГ        = ВРег(СтруктураАдресРегистрации.Квартира) ;
			КонецЕсли;			
		КонецЕсли;	
		
	ИначеЕсли ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
		// Поиск предыдущих ФИО при смене ФИО.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ФИОПроживающих.Фамилия,
		|	бит_ФИОПроживающих.Имя,
		|	бит_ФИОПроживающих.Отчество
		|ИЗ
		|	РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
		|ГДЕ
		|	бит_ФИОПроживающих.Период < &Момент
		|	И бит_ФИОПроживающих.ФизЛицо = &ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ФИОПроживающих.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Момент", КонецДня(Дата));
		Запрос.УстановитьПараметр("ФизЛицо", Выборка.РегистрируемоеЛицо);
		
		ТаблицаФИО = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаФИО Из ТаблицаФИО Цикл
			Если СтрокаФИО.Фамилия <> Выборка.Фамилия ИЛИ СтрокаФИО.Имя <> Выборка.Имя
				ИЛИ СтрокаФИО.Отчество <> Выборка.Отчество Тогда
				
				ШапкаОбласть.Параметры.ФамилияСмена  				= ВРег(СтрокаФИО.Фамилия);
				ШапкаОбласть.Параметры.ИмяСмена      				= ВРег(СтрокаФИО.Имя);
				ШапкаОбласть.Параметры.ОтчествоСмена 				= ВРег(СтрокаФИО.Отчество);
				Прервать; 	
			КонецЕсли; 
		КонецЦикла;  			
		
		Если ВидМакета Тогда

			Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
				
				ШапкаОбласть.Параметры.ДеньРожденияСмена	  = День(Выборка.ДатаРождения);
				ДатаМесяц							  		  = Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцРожденияСмена  	  = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодРожденияСмена       = Формат(Выборка.ДатаРождения,"ДФ='yyyy'");	
				
			КонецЕсли;

			Если ЗначениеЗаполнено(ПолФизЛица) Тогда
				Если ПолФизЛица = Перечисления.ПолФизическогоЛица.Мужской Тогда
					ШапкаОбласть.Область("ПолМуж1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
				ИначеЕсли  ПолФизЛица = Перечисления.ПолФизическогоЛица.Женский Тогда
					ШапкаОбласть.Область("ПолЖен1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
				КонецЕсли; 
			КонецЕсли; 
			
		Иначе
			Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
				
				ШапкаОбласть.Параметры.ГодРожденияСмена       = Формат(Выборка.ДатаРождения,"ДФ='yyyy'");	
				
			КонецЕсли; 
			
		КонецЕсли; 
	Иначе
		
		ШапкаОбласть.Параметры.ПрочиеПричины = Комментарий;
		
	КонецЕсли; 
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьЛСУВ() Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("ЛСУВ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	// ФлагПрибытия хранит тип операции. 
	ФлагПрибытия = Ложь;
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства Тогда
		ФлагПрибытия = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РегистрируемоеЛицо) Тогда
		
		ИскомыеСтроки = ПолучитьКИ(РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие); 
		
		Если  ФлагПрибытия Тогда
			
			Строка = ИскомыеСтроки.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия, "Вид");
			Если ЗначениеЗаполнено(Строка) Тогда
				
				ШапкаОбласть.Параметры.РегионПриб          = Строка.Поле2; 
				ШапкаОбласть.Параметры.ГородПриб           = Строка.Поле4;
				ШапкаОбласть.Параметры.РайонПриб           = Строка.Поле3;
				ШапкаОбласть.Параметры.НаселенныйПунктПриб = Строка.Поле5;
				ШапкаОбласть.Параметры.СтранаПриб          = Выборка.Гражданство;
				
			КонецЕсли;
			
			Строка = ИскомыеСтроки.Найти(Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего, "Вид");
			Если ЗначениеЗаполнено(Строка) Тогда
				
				ШапкаОбласть.Параметры.РегионРег          = Строка.Поле2; 
				ШапкаОбласть.Параметры.ГородРег           = Строка.Поле4;
				ШапкаОбласть.Параметры.РайонРег           = Строка.Поле3;
				ШапкаОбласть.Параметры.НаселенныйПунктРег = Строка.Поле5;
				ШапкаОбласть.Параметры.СтранаРег          = Выборка.Гражданство;
				
			Иначе
				
				НаборЗаписей = НЕОПРЕДЕЛЕНО;
				бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
				ИскомаяСтрока = Неопределено;
				Для каждого СтрокаНабор Из НаборЗаписей  Цикл
					Если СтрокаНабор.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес
						И СтрокаНабор.Вид = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
						Тогда 
						ИскомаяСтрока = СтрокаНабор;
					КонецЕсли;	
				КонецЦикла;
				
				ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
				
				Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
					
					СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
					Если НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
						
						ШапкаОбласть.Параметры.РегионРег          = СтруктураАдресРегистрации.Регион; 
						ШапкаОбласть.Параметры.ГородРег           = СтруктураАдресРегистрации.Город;
						ШапкаОбласть.Параметры.РайонРег           = СтруктураАдресРегистрации.Район;
						ШапкаОбласть.Параметры.НаселенныйПунктРег = СтруктураАдресРегистрации.НаселенныйПункт;
						ШапкаОбласть.Параметры.СтранаРег          = СтруктураАдресРегистрации.Страна;
						
					КонецЕсли; 
				Иначе	

					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Для п.8: заполните почтовый адрес в справочнике ""Список зданий"", либо адрес по прописке в справочнике ""Проживающие""";
					Сообщение.Сообщить();
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			Строка = ИскомыеСтроки.Найти(Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего, "Вид");
			Если ЗначениеЗаполнено(Строка) Тогда
				
				ШапкаОбласть.Параметры.РегионПриб          = Строка.Поле2; 
				ШапкаОбласть.Параметры.ГородПриб           = Строка.Поле4;
				ШапкаОбласть.Параметры.РайонПриб           = Строка.Поле3;
				ШапкаОбласть.Параметры.НаселенныйПунктПриб = Строка.Поле5;
				ШапкаОбласть.Параметры.СтранаПриб          = Выборка.Гражданство;
				
			Иначе
				
				НаборЗаписей = НЕОПРЕДЕЛЕНО;
				бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
				ИскомаяСтрока = Неопределено;
				Для каждого СтрокаНабор Из НаборЗаписей  Цикл
					Если СтрокаНабор.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес
						И СтрокаНабор.Вид = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
						Тогда 
						ИскомаяСтрока = СтрокаНабор;
					КонецЕсли;	
				КонецЦикла;
				
				ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
				
				Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
					
					СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
					Если НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
						
						ШапкаОбласть.Параметры.РегионПриб          = СтруктураАдресРегистрации.Регион; 
						ШапкаОбласть.Параметры.ГородПриб           = СтруктураАдресРегистрации.Город;
						ШапкаОбласть.Параметры.РайонПриб           = СтруктураАдресРегистрации.Район;
						ШапкаОбласть.Параметры.НаселенныйПунктПриб = СтруктураАдресРегистрации.НаселенныйПункт;
						ШапкаОбласть.Параметры.СтранаПриб          = СтруктураАдресРегистрации.Страна;
						
					КонецЕсли; 
				Иначе
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Для п.8: заполните почтовый адрес в справочнике ""Список зданий"", либо адрес по прописке в справочнике ""Проживающие""";
					Сообщение.Сообщить();
					
				КонецЕсли;
				
			КонецЕсли;
			
			Строка = ИскомыеСтроки.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресУбытия, "Вид");
			
			Если Строка <> Неопределено Тогда
				ШапкаОбласть.Параметры.РегионРег          = Строка.Поле2;
				ШапкаОбласть.Параметры.РайонРег           = Строка.Поле3 ;
				ШапкаОбласть.Параметры.ГородРег           = Строка.Поле4 ;
				ШапкаОбласть.Параметры.НаселенныйПунктРег = Строка.Поле5 ;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ФлагПрибытия Тогда
			ШапкаОбласть.Параметры.ЧислоТек = Формат(Дата,"ДФ=dd");
			ДатаМесяц 						= Формат(Дата,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцТек = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодТек   = Формат(Дата,"ДФ=yyyy");
			ДолжностноеЛицоОрганизации = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация,ДолжностноеЛицо, Дата); 
			
			ШапкаОбласть.Параметры.ДолжностноеЛицоОрганизации  = ДолжностноеЛицоОрганизации;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.МестоРождения) Тогда
			
			СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
			ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
			ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
			ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
			ШапкаОбласть.Параметры.СтранаРожд          = СтруктураМестоРождения.Страна;
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В справочнике ""Проживающие"" заполните место рождения регистрируемого лица!";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.Пол) Тогда
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			КонецЕсли;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Выборка.Фамилия) Тогда

			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В справочнике ""Проживающие"" ФИО регистрируемого лица!";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
		ШапкаОбласть.Параметры.Заполнить(Выборка);
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
			ШапкаОбласть.Параметры.ДеньРожд   = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=dd");
			ДатаМесяц 						  = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРожд  = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			МесяцРожд                         = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=MM");
			ШапкаОбласть.Параметры.МесяцРожд1 = Сред(МесяцРожд,1,1);
			ШапкаОбласть.Параметры.МесяцРожд2 = Сред(МесяцРожд,2,1);
			ГодРожд                           = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=yyyy");
			ШапкаОбласть.Параметры.ГодРожд1   = Сред(ГодРожд,1,1);
			ШапкаОбласть.Параметры.ГодРожд2   = Сред(ГодРожд,2,1);
			ШапкаОбласть.Параметры.ГодРожд3   = Сред(ГодРожд,3,1);
			ШапкаОбласть.Параметры.ГодРожд4   = Сред(ГодРожд,4,1);
		Иначе 
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В справочнике ""Проживающие"" заполните дату рождения регистрируемого лица!";
			Сообщение.Сообщить();
			
		КонецЕсли; 
	КонецЕсли; 
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьУВОРУ() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_КонтактнаяИнформация.Вид,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ФИОПроживающихСрезПоследних.ФизЛицо.МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба,
	|	бит_КонтактнаяИнформация.Представление КАК АдресПаспортнойСлужбы
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба = бит_КонтактнаяИнформация.Объект
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("УВОРУ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	ШапкаОбласть.Параметры.ЧислоТек = Формат(Дата,"ДФ=dd");
	ДатаМесяц 						= Формат(Дата,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцТек = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодТек   = Формат(Дата,"ДФ=yy");
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		ШапкаОбласть.Параметры.ОрганУчета = Выборка.ДомРег.ПаспортнаяСлужба;
	КонецЕсли;
	
	ШапкаОбласть.Параметры.ЧислоСнят = Формат(ДатаСнятияСРегистрации,"ДФ=dd");
	ДатаМесяц 						= Формат(ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцСнят = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодСнят   = Формат(ДатаСнятияСРегистрации,"ДФ=yy");
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
		
		Если ЗначениеЗаполнено(Выборка.ФизЛицоМестоРождения) Тогда

			СтрокаМестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.РегистрируемоеЛицо.МестоРождения, Истина);

		Иначе

			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В справочнике ""Проживающие"" заполните место рождения регистрируемого лица!";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
		ФизЛицо = ?(ЗначениеЗаполнено(Выборка.Фамилия),Строка(Выборка.Фамилия),"")
		+ ?(ЗначениеЗаполнено(Выборка.Имя)," " + Строка(Выборка.Имя),"")
		+?(ЗначениеЗаполнено(Выборка.Отчество)," "+Строка(Выборка.Отчество),"")
		+?(ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения), ", "+Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='yyyy ""г.р.""'"), "")
		+ ?(ЗначениеЗаполнено(Выборка.ФизЛицоМестоРождения),", "  + СтрокаМестоРождения,"");
		ФизЛицо_1 = "";
		ФизЛицо_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФизЛицо, 70, ФизЛицо_1 , ФизЛицо_2 );
		ШапкаОбласть.Параметры.ФизЛицо_1 = ФизЛицо_1;
		ШапкаОбласть.Параметры.ФизЛицо_2 = ФизЛицо_2;
		
	КонецЕсли; 
	
	ОрганУчетаАдрес_1 = "";
	ОрганУчетаАдрес_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.АдресПаспортнойСлужбы, 40, ОрганУчетаАдрес_1 , ОрганУчетаАдрес_2 );
	ШапкаОбласть.Параметры.ОрганУчетаАдрес_1 = ОрганУчетаАдрес_1;
	ШапкаОбласть.Параметры.ОрганУчетаАдрес_2 = ОрганУчетаАдрес_2;
	
	ПредставлениеРег_1 = "";
	ПредставлениеРег_2 = "";
	Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда
		СтрокаАдресРегистрации = Выборка.ПочтовыйАдрес + ", кв." + Строка(Выборка.КвартираРег);
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаАдресРегистрации, 75, ПредставлениеРег_1 , ПредставлениеРег_2 );
	КонецЕсли; 
	ШапкаОбласть.Параметры.ПредставлениеРег_1 = ПредставлениеРег_1;
	ШапкаОбласть.Параметры.ПредставлениеРег_2 = ПредставлениеРег_2;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Если Организация.ВариантНаименованияДляПечатныхФорм = Перечисления.ВариантыНаименованияДляПечатныхФорм.СокращенноеНаименование Тогда
			НаименованиеОрганизации = Организация.НаименованиеСокращенное; 
		Иначе
			НаименованиеОрганизации = Организация.НаименованиеПолное; 
		КонецЕсли;
		ШапкаОбласть.Параметры.НаименованиеОрганизации = НаименованиеОрганизации;
	КонецЕсли;
	ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация, ДолжностноеЛицо, Дата, Ложь);
	Если ТипЗнч(ДолжностноеЛицоФИО) = Тип("Структура") Тогда
		ШапкаОбласть.Параметры.ДолжностноеЛицо = ДолжностноеЛицоФИО.ДолжностноеЛицо;
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьАЛУ(ВидМакета) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_КонтактнаяИнформация.Представление КАК ОткудаПрибыл,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
	|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистрации
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_КонтактнаяИнформация.Объект
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка1 = Запрос.Выполнить().Выгрузить();
	
	// Запрос с учетом возможных записей в журнале бит_ЖурналУчетаРегистрацииПребывания.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЖурналУчетаРегистрацииПребывания.Ссылка.ВидОперации КАК ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_КонтактнаяИнформация.Представление КАК ОткудаПрибыл,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
	|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистрации
	|ИЗ
	|	ЖурналДокументов.бит_ЖурналУчетаРегистрацииПребывания КАК бит_ЖурналУчетаРегистрацииПребывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|			ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|			ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|			ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|			ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|			ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|			ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_КонтактнаяИнформация.Объект
	|		ПО бит_ЖурналУчетаРегистрацииПребывания.РегистрируемоеЛицо = бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо
	|			И бит_ЖурналУчетаРегистрацииПребывания.ЛицевойСчет = бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка
	|	И бит_КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.АдресПрибытия)
	|	И (бит_ЖурналУчетаРегистрацииПребывания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства)
	|			ИЛИ бит_ЖурналУчетаРегистрацииПребывания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания))";
	
	Результат = Запрос.Выполнить();
	Выборка2 = Результат.Выгрузить();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	
	Если ВидМакета Тогда
		Макет         = ПолучитьМакет("АЛУ_New");
	Иначе
		Макет         = ПолучитьМакет("АЛУ");
	КонецЕсли; 
	
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	ВыборкаИсходник = Неопределено;
	ВыборкаПриемник = Новый ТаблицаЗначений;
	
	Если Выборка2.Количество()>0 Тогда
		ВыборкаИсходник = Выборка2[0];
		Для каждого Строки Из Выборка2.Колонки Цикл
			ВыборкаПриемник.Колонки.Добавить(Строки.Имя);
		КонецЦикла;
		
	ИначеЕсли Выборка1.Количество()>0 Тогда
		
		ВыборкаИсходник = Выборка1[0];
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Записей по регистрируемому лицу в журнале учета по месту жительства нет. Проверьте правильность заполнения оборотной стороны!";
		Сообщение.Сообщить();
		
		Для каждого Строки Из Выборка1.Колонки Цикл
			ВыборкаПриемник.Колонки.Добавить(Строки.Имя);
		КонецЦикла;
	Иначе
		Возврат ТабДокумент;
	КонецЕсли; 
	
	Выборка = ВыборкаПриемник.Добавить();
	
	ЗаполнитьЗначенияСвойств(Выборка, ВыборкаИсходник);
	// Перевод текста параметров к верхнему регистру.
	// Перевод к типу строка всех данных, имеющих другие типы.
	Выборка.ДокументОснование  = ВРег(Строка(ВыборкаИсходник.ДокументОснование));
	Выборка.ПринятоеРешение    = ВРег(Строка(ВыборкаИсходник.ПринятоеРешение));
	Выборка.ОткудаПрибыл       = ВРег(ВыборкаИсходник.ОткудаПрибыл);
	Выборка.УлицаРег           = ВРег(Строка(ВыборкаИсходник.УлицаРег));
	Выборка.ДомРег             = ВРег(Строка(ВыборкаИсходник.ДомРег));
	Выборка.КвартираРег        = ВРег(Строка(ВыборкаИсходник.КвартираРег));
	Выборка.КорпусРег          = ВРег(Строка(ВыборкаИсходник.КорпусРег));
	Выборка.ПочтовыйАдрес      = ВРег(ВыборкаИсходник.ПочтовыйАдрес);
	Выборка.ВидДокумента       = ВРег(Строка(ВыборкаИсходник.ВидДокумента));
	Выборка.СерияДокумента     = ВРег(Строка(ВыборкаИсходник.СерияДокумента));
	Выборка.НомерДокумента     = ВРег(Строка(ВыборкаИсходник.НомерДокумента));
	Выборка.ВыданДокумент      = ВРег(Строка(ВыборкаИсходник.ВыданДокумент));
	Выборка.ДокументКодПодразделения  = ВРег(Строка(ВыборкаИсходник.ДокументКодПодразделения));
	Выборка.ВидДокументаПред   = ВРег(Строка(ВыборкаИсходник.ВидДокументаПред));
	Выборка.СерияДокументаПред = ВРег(Строка(ВыборкаИсходник.СерияДокументаПред));
	Выборка.НомерДокументаПред = ВРег(Строка(ВыборкаИсходник.НомерДокументаПред));
	Выборка.ВыданДокументПред  = ВРег(Строка(ВыборкаИсходник.ВыданДокументПред));
	Выборка.ПаспортнаяСлужба   = ВРег(Строка(ВыборкаИсходник.ПаспортнаяСлужба));
	Выборка.Фамилия            = ВРег(ВыборкаИсходник.Фамилия);
	Выборка.Имя                = ВРег(ВыборкаИсходник.Имя);
	Выборка.Отчество           = ВРег(ВыборкаИсходник.Отчество);
	
	ВыданДокумент_1 = "";
	ВыданДокумент_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ВыданДокумент, 60, ВыданДокумент_1 , ВыданДокумент_2 );
	ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
	ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
	
	Если ЗначениеЗаполнено(Выборка.МестоРождения) Тогда
		СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
		Если ВидМакета Тогда
			ШапкаОбласть.Параметры.СтранаРожд      = СтруктураМестоРождения.Страна; 
		КонецЕсли;
		ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
		ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
		ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.Пол) Тогда
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				
				ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				
				ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.Заполнить(Выборка); 
	
	Если ВидМакета Тогда
		Если ТипЗнч(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
			ШапкаОбласть.Параметры.КодПаспортнойСлужбы = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПоОКПО;
			
		КонецЕсли;
	КонецЕсли;
	// ФлагПрибытия хранит тип операции. 
	ФлагПрибытия = Ложь;
	Если ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства Тогда
		
		ФлагПрибытия = Истина;
		ШапкаОбласть.Параметры.ПаспортнаяСлужба = "";
		ШапкаОбласть.Параметры.КодПаспортнойСлужбы = "";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Выборка.Фамилия) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните поле ФИО в справочнике ""Проживающие""";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ЛицевойСчет.Здание);
	
	ИскомаяСтрока 	= Неопределено;
	
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		Если СтрокаНабора.Вид = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания Тогда
			ИскомаяСтрока = СтрокаНабора;
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьАдрес 	= бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
	
	Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
		
		СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
		Если НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
			Если НЕ ФлагПрибытия Тогда
				ШапкаОбласть.Параметры.РегионРег 			= ВРег(СтруктураАдресРегистрации.Регион);
				ШапкаОбласть.Параметры.РайонРег 			= ВРег(СтруктураАдресРегистрации.Район);
				ШапкаОбласть.Параметры.ГородРег 			= ВРег(СтруктураАдресРегистрации.Город);
				ШапкаОбласть.Параметры.НаселенныйПунктРег 	= ВРег(СтруктураАдресРегистрации.НаселенныйПункт);
				ШапкаОбласть.Параметры.УлицаРег 			= ВРег(СтруктураАдресРегистрации.Улица);
				ШапкаОбласть.Параметры.ДомРег 				= ВРег(СтруктураАдресРегистрации.Дом);
				ШапкаОбласть.Параметры.КорпусРег 			= ВРег(СтруктураАдресРегистрации.Корпус);
				ШапкаОбласть.Параметры.КвартираРег 			= ВРег(Выборка.КвартираРег);
			Иначе
				ШапкаОбласть.Параметры.РегионВыб 			= ВРег(СтруктураАдресРегистрации.Регион);
				ШапкаОбласть.Параметры.РайонВыб 			= ВРег(СтруктураАдресРегистрации.Район);
				ШапкаОбласть.Параметры.ГородВыб 			= ВРег(СтруктураАдресРегистрации.Город);
				ШапкаОбласть.Параметры.НаселенныйПунктВыб 	= ВРег(СтруктураАдресРегистрации.НаселенныйПункт);
				ШапкаОбласть.Параметры.УлицаВыб 			= ВРег(СтруктураАдресРегистрации.Улица);
				ШапкаОбласть.Параметры.ДомВыб 				= ВРег(СтруктураАдресРегистрации.Дом);
				ШапкаОбласть.Параметры.КорпусВыб 			= ВРег(СтруктураАдресРегистрации.Корпус);
				ШапкаОбласть.Параметры.КвартираВыб 			= ВРег(Выборка.КвартираРег);
				
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Для п.8: заполните почтовый адрес у дома в справочнике ""Список зданий""";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	Если ВидМакета Тогда
		Если НЕ ФлагПрибытия Тогда
			ЗаписьАдресПриб = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибыл);
			
			Если ЗначениеЗаполнено(ЗаписьАдресПриб) Тогда
				
				СтруктураАдресРегистрацииПриб 		= бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдресПриб);
				
				ШапкаОбласть.Параметры.СтранаПриб 	= ВРег(СтруктураАдресРегистрацииПриб.Страна);
			КонецЕсли;	
		КонецЕсли;	
		
		ИскомаяСтрока 	= ПолучитьКИ(Выборка.РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие); 
		Строка 			= ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия, "Вид");
		Если Строка <> Неопределено Тогда
			Если ФлагПрибытия Тогда
				
				ШапкаОбласть.Параметры.РегионРег          = ВРег(Строка.Поле2);
				ШапкаОбласть.Параметры.РайонРег           = ВРег(Строка.Поле3) ;
				ШапкаОбласть.Параметры.ГородРег           = ВРег(Строка.Поле4) ;
				ШапкаОбласть.Параметры.НаселенныйПунктРег = ВРег(Строка.Поле5) ;
				ШапкаОбласть.Параметры.УлицаРег           = ВРег(Строка.Поле6) ;
				ШапкаОбласть.Параметры.ДомРег             = ВРег(Строка.Поле7) ;
				ШапкаОбласть.Параметры.КорпусРег          = ВРег(Строка.Поле8) ;
				ШапкаОбласть.Параметры.КвартираРег        = ВРег(Строка.Поле9) ;
				
			Иначе
				
				ШапкаОбласть.Параметры.РегионПриб          = ВРег(Строка.Поле2);
				ШапкаОбласть.Параметры.РайонПриб           = ВРег(Строка.Поле3) ;
				ШапкаОбласть.Параметры.ГородПриб           = ВРег(Строка.Поле4) ;
				ШапкаОбласть.Параметры.НаселенныйПунктПриб = ВРег(Строка.Поле5) ;
				ШапкаОбласть.Параметры.УлицаПриб           = ВРег(Строка.Поле6) ;
				ШапкаОбласть.Параметры.ДомПриб             = ВРег(Строка.Поле7) ;
				ШапкаОбласть.Параметры.КорпусПриб          = ВРег(Строка.Поле8) ;
				ШапкаОбласть.Параметры.КвартираПриб        = ВРег(Строка.Поле9) ;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	ИскомаяСтрока 	= ПолучитьКИ(Выборка.РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие); 
	Строка 			= ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресУбытия, "Вид");
	Если Строка <> Неопределено И НЕ ФлагПрибытия Тогда
		
		ШапкаОбласть.Параметры.РегионВыб          = ВРег(Строка.Поле2);
		ШапкаОбласть.Параметры.РайонВыб           = ВРег(Строка.Поле3) ;
		ШапкаОбласть.Параметры.ГородВыб           = ВРег(Строка.Поле4) ;
		ШапкаОбласть.Параметры.НаселенныйПунктВыб = ВРег(Строка.Поле5) ;
		ШапкаОбласть.Параметры.УлицаВыб           = ВРег(Строка.Поле6) ;
		ШапкаОбласть.Параметры.ДомВыб             = ВРег(Строка.Поле7) ;
		ШапкаОбласть.Параметры.КорпусВыб          = ВРег(Строка.Поле8) ;
		ШапкаОбласть.Параметры.КвартираВыб        = ВРег(Строка.Поле9) ;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
		Если ВидМакета Тогда
			ШапкаОбласть.Параметры.ДеньРождения     = День(Выборка.ДатаРождения);
			ДатаМесяц 								= Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРождения 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРождения      = Формат(Выборка.ДатаРождения,"ДФ='yyyy'");
			
		Иначе
			
			ШапкаОбласть.Параметры.ДатаРождения     = Формат(Выборка.ДатаРождения,"ДЛФ=DD");
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) И НЕ ФлагПрибытия Тогда
		Если ВидМакета  Тогда
			ШапкаОбласть.Параметры.ДеньРегистрации      = День(Выборка.ДатаРегистрации);
			ДатаМесяц 									= Формат(Выборка.ДатаРегистрации,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРегистрации 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРегистрации       = Формат(Выборка.ДатаРегистрации,"ДФ='yyyy '");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) И НЕ ФлагПрибытия Тогда
		Если ВидМакета Тогда
			
			ШапкаОбласть.Параметры.ДеньВыдачиДокумента  = День(Выборка.ДатаВыдачиДокумента);
			ДатаМесяц 									= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодВыдачиДокумента   = Формат(Выборка.ДатаВыдачиДокумента,"ДФ='yyyy'");
		Иначе
			ШапкаОбласть.Параметры.ДатаВыдачиДокумента  = Формат(Выборка.ДатаВыдачиДокумента,"ДФ=dd.MM.yy");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если  НЕ ФлагПрибытия Тогда
		Если ВидМакета  Тогда
			
			ШапкаОбласть.Параметры.ДеньСоставил     = День(Дата);
			ДатаМесяц 								= Формат(Дата,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцСоставил 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодСоставил      = Формат(Дата,"ДФ='yyyy '");
		Иначе
			ШапкаОбласть.Параметры.ДатаСоставления  = Формат(Дата,"ДЛФ=DD");
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда 
			Если ВидМакета Тогда
				
				ШапкаОбласть.Параметры.ДеньСнятияСРегистрации 	= День(Выборка.ДатаСнятияСРегистрации);
				ДатаМесяц 										= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцСнятияСРегистрации 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодСнятияСРегистрации 	= Формат(Дата,"ДФ='yyyy '");
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЕсли; 
	
	ИскомаяСтрока = ПолучитьКИ(Выборка.РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие); 
	Строка = ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия, "Вид");
	Если Строка <> Неопределено Тогда
		
		Если Выборка2.Количество()>0 И НЕ ФлагПрибытия Тогда
			Если ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СДругогоГорода Тогда
				
				Если ВидМакета Тогда
					ШапкаОбласть.Параметры.РегионПриб 			= ВРег(Строка.Поле2);
					ШапкаОбласть.Параметры.РайонПриб 			= ВРег(Строка.Поле3);
					ШапкаОбласть.Параметры.ГородПриб 			= ВРег(Строка.Поле4);
					ШапкаОбласть.Параметры.НаселенныйПунктПриб  = ВРег(Строка.Поле5);
					ШапкаОбласть.Параметры.УлицаПриб 			= ВРег(Строка.Поле6);
					ШапкаОбласть.Параметры.ДомПриб 				= ВРег(Строка.Поле7);
					ШапкаОбласть.Параметры.КорпусПриб 			= ВРег(Строка.Поле8);
					ШапкаОбласть.Параметры.КвартираПриб 		= ВРег(Строка.Поле9);
				КонецЕсли;
				
			ИначеЕсли ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ВТомЖеГородеСДругогоАдреса Тогда	
				
				ШапкаОбласть.Параметры.УлицаВыбТГ 			= ВРег(Строка.Поле6);
				ШапкаОбласть.Параметры.ДомВыбТГ 			= ВРег(Строка.Поле7);
				ШапкаОбласть.Параметры.КорпусВыбТГ 			= ВРег(Строка.Поле8);
				ШапкаОбласть.Параметры.КвартираВыбТГ 		= ВРег(Строка.Поле9);
				
			ИначеЕсли ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
				Если ВидМакета Тогда
					ШапкаОбласть.Параметры.ФамилияСмена  				= Выборка.Фамилия;
					ШапкаОбласть.Параметры.ИмяСмена      				= Выборка.Имя;
					ШапкаОбласть.Параметры.ОтчествоСмена 				= Выборка.Отчество;
					ШапкаОбласть.Параметры.ДеньРожденияСмена  			= День(Выборка.ДатаРождения);
					ДатаМесяц 											= Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
					ШапкаОбласть.Параметры.МесяцРожденияСмена 			= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
					ШапкаОбласть.Параметры.ГодРожденияСмена            	= Формат(Выборка.ДатаРождения,"ДФ='yyyy'");
				КонецЕсли;
				Если ВидМакета И ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.Пол) Тогда
					Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
						
						ШапкаОбласть.Область("ПолМуж1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
						
					ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
						
						ШапкаОбласть.Область("ПолЖен1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
						
					КонецЕсли;
				КонецЕсли;		
				
			Иначе
				Если ВидМакета Тогда
					ШапкаОбласть.Параметры.ПрочиеПричины = Комментарий;
				КонецЕсли;		
				
			КонецЕсли;
			
			Иначе Если Выборка1.Количество()>0 И ЗначениеЗаполнено(СтруктураАдресРегистрации)И НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
				Если Строка.Поле2  = СтруктураАдресРегистрации.Регион
					И Строка.Поле3 = СтруктураАдресРегистрации.Район
					И Строка.Поле4 = СтруктураАдресРегистрации.Город
					И Строка.Поле5 = СтруктураАдресРегистрации.НаселенныйПункт
					Тогда	
					ШапкаОбласть.Параметры.УлицаВыбТГ 			= ВРег(Строка.Поле6);
					ШапкаОбласть.Параметры.ДомВыбТГ 			= ВРег(Строка.Поле7);
					ШапкаОбласть.Параметры.КорпусВыбТГ 			= ВРег(Строка.Поле8);
					ШапкаОбласть.Параметры.КвартираВыбТГ 		= ВРег(Строка.Поле9);
					
				Иначе
					Если ВидМакета И НЕ ФлагПрибытия Тогда
						ШапкаОбласть.Параметры.РегионПриб 			= ВРег(Строка.Поле2);
						ШапкаОбласть.Параметры.РайонПриб 			= ВРег(Строка.Поле3);
						ШапкаОбласть.Параметры.ГородПриб 			= ВРег(Строка.Поле4);
						ШапкаОбласть.Параметры.НаселенныйПунктПриб  = ВРег(Строка.Поле5);
						ШапкаОбласть.Параметры.УлицаПриб 			= ВРег(Строка.Поле6);
						ШапкаОбласть.Параметры.ДомПриб 				= ВРег(Строка.Поле7);
						ШапкаОбласть.Параметры.КорпусПриб 			= ВРег(Строка.Поле8);
						ШапкаОбласть.Параметры.КвартираПриб 		= ВРег(Строка.Поле9);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Если Выборка2.Количество()>0  И ФлагПрибытия  Тогда
			Если ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ВТомЖеГородеСДругогоАдреса Тогда
				
				ШапкаОбласть.Параметры.УлицаВыбТГ 			= ВРег(Выборка.УлицаРег);
				ШапкаОбласть.Параметры.ДомВыбТГ 			= ВРег(Выборка.ДомРег);
				ШапкаОбласть.Параметры.КорпусВыбТГ 			= ВРег(Выборка.КорпусРег);
				ШапкаОбласть.Параметры.КвартираВыбТГ 		= ВРег(Выборка.КвартираРег);
				
			ИначеЕсли ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СДругогоГорода Тогда
				
				Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
					ШапкаОбласть.Параметры.РегионВыб 			= ВРег(СтруктураАдресРегистрации.Регион);
					ШапкаОбласть.Параметры.РайонВыб 			= ВРег(СтруктураАдресРегистрации.Район);
					ШапкаОбласть.Параметры.ГородВыб 			= ВРег(СтруктураАдресРегистрации.Город);
					ШапкаОбласть.Параметры.НаселенныйПунктВыб  = ВРег(СтруктураАдресРегистрации.НаселенныйПункт);
				КонецЕсли;
				
				ШапкаОбласть.Параметры.УлицаВыб 			= ВРег(Выборка.УлицаРег);
				ШапкаОбласть.Параметры.ДомВыб 				= ВРег(Выборка.ДомРег);
				ШапкаОбласть.Параметры.КорпусВыб 			= ВРег(Выборка.КорпусРег);
				ШапкаОбласть.Параметры.КвартираВыб	 		= ВРег(Выборка.КвартираРег);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой анкета.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьАнкета() Экспорт  
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("Анкета_New");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
	ШапкаОбласть.Параметры.СтранаРожд          = СтруктураМестоРождения.Страна; 
	
	ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
	ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
	ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
	ШапкаОбласть.Параметры.НаселенныйПунктРожд = СтруктураМестоРождения.НаселенныйПункт;
	
	ШапкаОбласть.Параметры.ДеньРожд  = Формат(Выборка.ДатаРождения,"ДФ=dd");
	ДатаМесяц						 = Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцРожд = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодРожд   = Формат(Выборка.ДатаРождения,"ДФ=yyyy");
	
	ШапкаОбласть.Параметры.ЧислоВыдачи 	= Формат(Выборка.ДатаВыдачиДокумента ,"ДФ=dd");
	ДатаМесяц						 	= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцВыдачи 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодВыдачи   	= Формат(Выборка.ДатаВыдачиДокумента ,"ДФ=yyyy");
	
	ДатаМесяц 							= Формат(ДатаРегистрации,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.ДатаРегистрацииМесяц = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ДатаМесяц 							= Формат(ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.ДатаСнятияСРегистрацииМесяц = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ДатаМесяц 							= Формат(Дата,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.ДатаМесяц = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
		Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			
			ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			
		ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			
			ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			
		КонецЕсли;
	КонецЕсли; 
	
	АдресЖительства = ПодробныйАдрес();
	Если АдресЖительства.Следующий() Тогда
		Если ЗначениеЗаполнено(АдресЖительства.Страна) Тогда
			ШапкаОбласть.Параметры.Республика 	= АдресЖительства.Страна;
		Иначе
			ШапкаОбласть.Параметры.Республика 	= "";	
		КонецЕсли; 
		ШапкаОбласть.Параметры.Регион 		= АдресЖительства.Регион;
		ШапкаОбласть.Параметры.Район 		= АдресЖительства.Район;
		ШапкаОбласть.Параметры.НасПункт 	= АдресЖительства.НасПункт;
		ШапкаОбласть.Параметры.Улица 		= АдресЖительства.Улица;
		ШапкаОбласть.Параметры.Дом 			= АдресЖительства.Дом;
		ШапкаОбласть.Параметры.Корпус 		= АдресЖительства.Корпус;
		ШапкаОбласть.Параметры.Квартира 	= АдресЖительства.Квартира;
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.Дата = Дата;
	КИОрганизации = ПолучитьКИ(Организация, 
	Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Организации);
	
	Адрес   = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
	ШапкаОбласть.Параметры.АдресОрганизации = Адрес.Представление;
	
	ВыданДокумент_1 = "";
	ВыданДокумент_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ВыданДокумент, 40, ВыданДокумент_1 , ВыданДокумент_2 );
	ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
	ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция вызывает форму печати табличного документа с печатной формой.
// Инвентаризационной описи основных средств.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьСОРГ_РФ_ПМЖ(ВерсияМакета = Истина) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.Пол КАК Пол,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "СведенияОРегистрацииГражданинаРоссийскойФедерацииПоМестуЖительства";
	
	Если ВерсияМакета Тогда
		
		Макет         = ПолучитьМакет("СОРГ_РФ_ПМЖ");
		ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
		
	Иначе
		
		Макет         = ПолучитьМакет("СОРГ_РФ_ПМЖ_Old");
		ШапкаОбласть  	= Макет.ПолучитьОбласть("Шапка");
		СтрокаОбласть = Макет.ПолучитьОбласть("СтрокаТЧ");
		ПодвалОбласть	= Макет.ПолучитьОбласть("Подвал");
		
	КонецЕсли; 
	
	КИОрганизации = ПолучитьКИ(Организация, 
	Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Организации);
	
	Адрес   = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
	Телефон = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации, "Вид"); 
	АдресПочтовый = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации, "Вид");

	НазваниеОрганизации_1	= "";
	НазваниеОрганизации_2	= "";
	НазваниеОрганизации		= "";
	Если ЗначениеЗаполнено(Выборка.ЛицевойСчет)Тогда 
		
		Если ТипЗнч(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			НазваниеОрганизации = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба.НаименованиеПолное;
			
			// ИНН.
			ИНН = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба.ИНН;
			ДлинаИНН = СтрДлина(Инн);
			
			Индекс = 0;
			Пока Индекс <> ДлинаИнн И Индекс < 10  Цикл
				
				Индекс = Индекс + 1;
				ИННИндекс = "ИНН" + Индекс;
				ШапкаОбласть.Параметры[ИННИндекс] = Сред(ИНН,Индекс,1);
				
			КонецЦикла;
			
			// КПП.
			КПП = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба.КПП;
			ДлинаИНН = СтрДлина(КПП);
			
			Индекс = 0;
			Пока Индекс <> ДлинаИнн Цикл
				
				Индекс = Индекс + 1;
				КППИндекс = "КПП" + Индекс;
				ШапкаОбласть.Параметры[КППИндекс] = Сред(КПП,Индекс,1);
				
			КонецЦикла;
		Иначе
			НазваниеОрганизации = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба;
		КонецЕсли;
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(НазваниеОрганизации, 35, НазваниеОрганизации_1 , НазваниеОрганизации_2 );
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.НазваниеОрганизации_1 = НазваниеОрганизации_1;
	ШапкаОбласть.Параметры.НазваниеОрганизации_2 = НазваниеОрганизации_2;
	
	НалоговыйОрган_1 = "";
	НалоговыйОрган_2 = "";
	НалоговыйОрган_3 = "";
	
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки("", 35, НалоговыйОрган_1 , НалоговыйОрган_2 );
	
	ШапкаОбласть.Параметры.НалоговыйОрган_1 = НалоговыйОрган_1;
	ШапкаОбласть.Параметры.НалоговыйОрган_2 = НалоговыйОрган_2;

	ИМНС = "";
	
	ДлинаИНН = СтрДлина(ИМНС);
	
	Индекс = 0;
	Пока Индекс <> ДлинаИнн Цикл
		
		Индекс = Индекс + 1;
		ИМНСИндекс = "ГНИ" + Индекс;
		ШапкаОбласть.Параметры[ИМНСИндекс] = Сред(ИМНС,Индекс,1);
		
	КонецЦикла;
	
	// Сведения о физ лице.
	ШапкаОбласть.Параметры.Фамилия  = Выборка.Фамилия;
	ШапкаОбласть.Параметры.Имя      = Выборка.Имя;
	ШапкаОбласть.Параметры.Отчество = Выборка.Отчество;
	Если ЗначениеЗаполнено(Выборка.Пол) Тогда
		
		Если Выборка.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			
			ШапкаОбласть.Параметры.ПолМ  = "V";
			
		ИначеЕсли Выборка.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			
			ШапкаОбласть.Параметры.ПолЖ  = "V";
			
		КонецЕсли; 
		
	КонецЕсли; 

	ШапкаОбласть.Параметры.ДатаРождения  = Формат(Выборка.ДатаРождения, "ДЛФ=DD");
	
	МестоРожденияСтруктура = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
	МестоРождения = "";
	Если ЗначениеЗаполнено(МестоРожденияСтруктура.НаселенныйПункт) Тогда
		МестоРождения = МестоРождения + МестоРожденияСтруктура.НаселенныйПункт;
	КонецЕсли;  
	Если ЗначениеЗаполнено(МестоРожденияСтруктура.Район) Тогда	
		МестоРождения = МестоРождения +", "+ МестоРожденияСтруктура.Район + " р-на";
	КонецЕсли;  
	Если ЗначениеЗаполнено(МестоРожденияСтруктура.Область) Тогда	
		МестоРождения = МестоРождения +", "+ МестоРожденияСтруктура.Область + " обл.";
	КонецЕсли;  
	Если ЗначениеЗаполнено(МестоРожденияСтруктура.Страна) Тогда	
		МестоРождения = МестоРождения +", "+ МестоРожденияСтруктура.Страна;
	КонецЕсли; 
	ШапкаОбласть.Параметры.МестоРождения = МестоРождения;
	
	ШапкаОбласть.Параметры.ВидДокумента  = Выборка.ВидДокумента;
	ШапкаОбласть.Параметры.Серия         = Выборка.СерияДокумента;
	ШапкаОбласть.Параметры.Номер         = Выборка.НомерДокумента;

	КемВыдан_1 = "";
	КемВыдан_2 = "";
	Если ЗначениеЗаполнено(Выборка.ВыданДокумент) Тогда
		КемВыдан = Строка(Выборка.ВыданДокумент) + ", код " + Строка(Выборка.ДокументКодПодразделения);
	ИначеЕсли ЗначениеЗаполнено(Выборка.ДокументКодПодразделения) Тогда
		КемВыдан = Строка(Выборка.ДокументКодПодразделения);
	КонецЕсли; 
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(КемВыдан, 25, КемВыдан_1, КемВыдан_2 );
	ШапкаОбласть.Параметры.КемВыдан_1 = КемВыдан_1;
	ШапкаОбласть.Параметры.КемВыдан_2 = КемВыдан_2;
	
	Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда
		ШапкаОбласть.Параметры.ДатаВыдачиДокумента = Формат(Выборка.ДатаВыдачиДокумента, "ДФ='dd.MM.yyyy ""г.""'");
	КонецЕсли; 
	
	// Сведения о постановке на учет.
	КИФизЛица = ПолучитьКИ(Выборка.РегистрируемоеЛицо, Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие);
	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
	ВыборкаПочтАдр = Неопределено;
	Для каждого СтрокаНабор Из НаборЗаписей  Цикл
		Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
			И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
			Тогда 
			ВыборкаПочтАдр = СтрокаНабор;
		КонецЕсли;	
	КонецЦикла;
	
	ПочтовыйАдресСтрока =  бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
	СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
	Если СтруктураПочтовыйАдрес <> Неопределено И НЕ СтруктураПочтовыйАдрес.Свойство("ЗаПределамиРФ") Тогда
		Если ЗначениеЗаполнено(СтруктураПочтовыйАдрес.Страна) Тогда
			ШапкаОбласть.Параметры.Республика = СтруктураПочтовыйАдрес.Страна;
		ИначеЕсли ЗначениеЗаполнено(СтруктураПочтовыйАдрес.Регион) Тогда
			ШапкаОбласть.Параметры.Республика = СтруктураПочтовыйАдрес.Регион;
		КонецЕсли; 
		ШапкаОбласть.Параметры.Район      = СтруктураПочтовыйАдрес.Район;
		ШапкаОбласть.Параметры.Город      = СтруктураПочтовыйАдрес.Город;
		ШапкаОбласть.Параметры.Село       = СтруктураПочтовыйАдрес.НаселенныйПункт;
		ШапкаОбласть.Параметры.Улица      = СтруктураПочтовыйАдрес.Улица;
		ШапкаОбласть.Параметры.Дом        = СтруктураПочтовыйАдрес.Дом;
		ШапкаОбласть.Параметры.Корпус     = СтруктураПочтовыйАдрес.Корпус;
		
	Иначе
		ШапкаОбласть.Параметры.Улица      = Выборка.УлицаРег;
		ШапкаОбласть.Параметры.Дом        = Выборка.ДомРег;
		ШапкаОбласть.Параметры.Корпус     = Выборка.КорпусРег;
		
	КонецЕсли; 
	ШапкаОбласть.Параметры.Квартира   = Выборка.КвартираРег;
	
	// Предыдущее место пребывания.
	АдресИнформирования = КИФизЛица.Найти(Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытия, "Вид");
	Если АдресИнформирования <> Неопределено Тогда
		
		АдресИнформированияСтрока = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(АдресИнформирования);
		АдресИнформированияСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(АдресИнформированияСтрока);
		Если АдресИнформированияСтруктура <> Неопределено И НЕ АдресИнформированияСтруктура.Свойство("ЗаПределамиРФ") Тогда
			
			ШапкаОбласть.Параметры.ПредРеспублика = АдресИнформированияСтруктура.Страна;
			ШапкаОбласть.Параметры.ПредРайон      = АдресИнформированияСтруктура.Район;
			ШапкаОбласть.Параметры.ПредГород      = АдресИнформированияСтруктура.Город;
			ШапкаОбласть.Параметры.ПредСело       = АдресИнформированияСтруктура.НаселенныйПункт;
			ШапкаОбласть.Параметры.ПредУлица      = АдресИнформированияСтруктура.Улица;
			ШапкаОбласть.Параметры.ПредДом        = АдресИнформированияСтруктура.Дом;
			ШапкаОбласть.Параметры.ПредКорпус     = АдресИнформированияСтруктура.Корпус;
			ШапкаОбласть.Параметры.ПредКвартира   = АдресИнформированияСтруктура.Квартира;
			
		КонецЕсли; 
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.стДатаПостановки       = Формат(ДатаРегистрации, "ДФ='dd.MM.yyyy ""г""'");
	ШапкаОбласть.Параметры.ДатаСнятияСрегистрации = Формат(ДатаСнятияСРегистрации, "ДФ='dd.MM.yyyy ""г.""'");
	
	Если ВерсияМакета Тогда
		ШапкаОбласть.Параметры.ДатаДокумента          = Формат(Дата, "ДФ='dd.MM.yyyy ""г.""'");
		ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация, ДолжностноеЛицо, Дата, Ложь);
		Если ТипЗнч(ДолжностноеЛицоФИО) = Тип("Структура") Тогда
			ШапкаОбласть.Параметры.ДолжностноеЛицо 	= ДолжностноеЛицоФИО.ДолжностноеЛицо;
			ШапкаОбласть.Параметры.Должность 		= ДолжностноеЛицоФИО.Должность;
		КонецЕсли;
		
	КонецЕсли;
	ТабДокумент.Вывести(ШапкаОбласть);
	
	// Выбран макет с данными детей до 14 лет. 
	Если НЕ ВерсияМакета Тогда                                 
		
		СписокДетей = ФизическиеЛица.Выгрузить();
		МассивДляУдаления = Новый Массив;
		Для каждого ДанныеРебенка Из СписокДетей Цикл
			
			ДатаРождения = ДанныеРебенка.ФизическоеЛицо.ДатаРождения;
			
			ЧислоЛет = бит_ПаспортныйСтолКлиетСервер.КолвоПолныхЛет(ДатаРождения,ДатаРегистрации);
			
			Если ЧислоЛет > 14 Тогда
				
				МассивДляУдаления.Добавить(ДанныеРебенка);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого СтрокаМассива Из МассивДляУдаления  Цикл
			
			СписокДетей.Удалить(СтрокаМассива);
			
		КонецЦикла; 
		
		Если СписокДетей.Количество()>0 Тогда
			
			Для каждого СтрокаТЧ Из СписокДетей Цикл
				
				ФИОФизЛица      = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(СтрокаТЧ.ФизическоеЛицо,Дата, Ложь);
				
				Если ЗначениеЗаполнено(ФИОФизЛица) Тогда
					СтрокаОбласть.Параметры.ФизЛицо = ФИОФизЛица;
				Иначе
					СтрокаОбласть.Параметры.ФизЛицо = СтрокаТЧ.ФизическоеЛицо.Наименование;
				КонецЕсли;
				
				Если СтрокаТЧ.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
					
					СтрокаОбласть.Параметры.Пол = "жен";
					
				ИначеЕсли СтрокаТЧ.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
					
					СтрокаОбласть.Параметры.Пол = "муж";
					
				КонецЕсли;
				
				СтрокаОбласть.Параметры.ДатаРождения = Формат(СтрокаТЧ.ФизическоеЛицо.ДатаРождения,"ДФ=dd.MM.yyyy");
				
				Если ЗначениеЗаполнено(СтрокаТЧ.ФизическоеЛицо.МестоРождения) Тогда
					
					МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(СтрокаТЧ.ФизическоеЛицо.МестоРождения);
					СтрокаОбласть.Параметры.МестоРождения = МестоРождения;
					
				КонецЕсли; 
				
				ДокументФизЛица = бит_ПаспортныйСтолСервер.ПолучитьДанныеДокументаФизЛица(СтрокаТЧ.ФизическоеЛицо,Дата);
				
				СтрокаОбласть.Параметры.СерияДок 	= ДокументФизЛица.ДокументСерия;
				СтрокаОбласть.Параметры.НомерДок 	= ДокументФизЛица.ДокументНомер;
				СтрокаОбласть.Параметры.ДатаДок  	= Формат(ДокументФизЛица.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy" );
				СтрокаОбласть.Параметры.КемВыданДок = ДокументФизЛица.ДокументКемВыдан + ?(ЗначениеЗаполнено(ДокументФизЛица.ДокументКодПодразделения),"код " + ДокументФизЛица.ДокументКодПодразделения,"");
				
				ТабДокумент.Вывести(СтрокаОбласть);
			КонецЦикла; 
			
		КонецЕсли;
		
		ПодвалОбласть.Параметры.ДатаДокумента = Дата;
		ТабДокумент.Вывести(ПодвалОбласть);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСОРПМП() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПОДСТРОКА(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения, 3, 200) КАК МестоРождения,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("СОРПМП");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если Выборка.ПочтовыйАдрес <> Неопределено И Выборка.ПочтовыйАдрес <> NULL Тогда
		АдресПрибытия = Строка(Выборка.ПочтовыйАдрес)+", кв."+Строка(Выборка.КвартираРег);;
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 60, АдресПрибытия_1, АдресПрибытия_2);
		ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
	КонецЕсли; 

	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	Если Выборка.РегистрируемоеЛицо <> Неопределено Тогда
		
		МестоРождения_1 = "";
		МестоРождения_2 = "";
		
		МестоРожденияСтруктура = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
		Если ЗначениеЗаполнено(МестоРожденияСтруктура) Тогда
			МестоРожденияСтрока = ?(ЗначениеЗаполнено(МестоРожденияСтруктура.НаселенныйПункт),МестоРожденияСтруктура.НаселенныйПункт +", ","")+ 
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Район),МестоРожденияСтруктура.Район + " р-н, ","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Область),МестоРожденияСтруктура.Область + " обл.,","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Страна)," страна "+МестоРожденияСтруктура.Страна,"");

			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРожденияСтрока, 60, МестоРождения_1, МестоРождения_2);
			ШапкаОбласть.Параметры.МестоРождения_1 = МестоРождения_1;
			ШапкаОбласть.Параметры.МестоРождения_2 = МестоРождения_2;

		КонецЕсли; 
	КонецЕсли; 
	
	ФизЛицо = "";
	Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
		ФизЛицо = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
	Иначе
		ФизЛицо = Строка(Выборка.РегистрируемоеЛицо);
	КонецЕсли; 
	
	// Перевод в родительный падеж.
	ФизЛицо_Склон = "";
	ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФизЛицо,3,Выборка.РегистрируемоеЛицо.Пол,ФизЛицо_Склон);
	Если ИсходСклонения Тогда
		ФизЛицо = ФизЛицо_Склон;
	КонецЕсли;	
	
	ФизЛицо = ФизЛицо + ", "+Строка(Формат(Выборка.ДатаРождения,"ДФ='yyyy ""г.р.""'"));
	ШапкаОбласть.Параметры.ФизЛицо = ФизЛицо;
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ШапкаОбласть.Параметры.ОрганУчета = Выборка.ДомРег.ПаспортнаяСлужба;				
		
	КонецЕсли; 
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоРег    	= День(Выборка.ДатаРегистрации);
		ДатаМесяц 							= Формат(Выборка.ДатаРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцРег 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодРег     	= Формат(Выборка.ДатаРегистрации,"ДФ=yy");
	КонецЕсли;
	Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоСнят    = День(Выборка.ДатаСнятияСРегистрации);
		ДатаМесяц 							= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцСнят 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодСнят     	= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='yy'");
	КонецЕсли;
	ШапкаОбласть.Параметры.ЧислоТек    	= Дата;
	ДатаМесяц 							= Формат(Дата,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцТек 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодТек     	= Дата;
	ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация, ДолжностноеЛицо, Дата, Ложь);
	Если ТипЗнч(ДолжностноеЛицоФИО) = Тип("Структура") Тогда
		ШапкаОбласть.Параметры.ДолжностноеЛицо = ДолжностноеЛицоФИО.ДолжностноеЛицо;
	КонецЕсли;
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой сличительной ведомости
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСОРПМПЖ() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	ПОДСТРОКА(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения, 3, 200) КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("СОРПМПЖ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда
		АдресПрибытия = Строка(Выборка.ПочтовыйАдрес)+", кв."+Строка(Выборка.КвартираРег);
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 74, АдресПрибытия_1, АдресПрибытия_2);
		ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
	КонецЕсли; 
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	Если Выборка.РегистрируемоеЛицо <> Неопределено Тогда
		МестоРождения_1 = "";
		МестоРождения_2 = "";
		МестоРожденияСтруктура = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
		Если ЗначениеЗаполнено(МестоРожденияСтруктура) Тогда
			МестоРожденияСтрока = ?(ЗначениеЗаполнено(МестоРожденияСтруктура.НаселенныйПункт),МестоРожденияСтруктура.НаселенныйПункт +", ","")+ 
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Район),МестоРожденияСтруктура.Район + " р-н, ","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Область),МестоРожденияСтруктура.Область + " обл.,","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Страна)," страна "+МестоРожденияСтруктура.Страна,"");
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРожденияСтрока, 60, МестоРождения_1, МестоРождения_2);
			ШапкаОбласть.Параметры.МестоРождения_1 = МестоРождения_1;
			ШапкаОбласть.Параметры.МестоРождения_2 = МестоРождения_2;
		КонецЕсли; 
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.ЧислоТек = Формат(Дата,"ДФ=dd");
	ДатаМесяц 						= Формат(Дата,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцТек	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодТек	= Формат(Дата,"ДФ=yy");
	
	Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда 
		ШапкаОбласть.Параметры.ДеньДатаВыдачиДокумента  = Формат(Выборка.ДатаВыдачиДокумента,"ДФ=dd");
		ДатаМесяц 										= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцДатаВыдачиДокумента	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодДатаВыдачиДокумента	= Формат(Выборка.ДатаВыдачиДокумента,"ДФ=yy");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
		ФизЛицо = Строка(Выборка.Фамилия) + " " + Строка(Выборка.Имя) + " " + Строка(Выборка.Отчество);
	Иначе
		ФизЛицо = Строка(Выборка.РегистрируемоеЛицо);
	КонецЕсли;
	ФизЛицо = ФизЛицо + ", "+ Строка(Формат(Выборка.ДатаРождения,"ДФ='yyyy ""г.р.""'"));
	ШапкаОбласть.Параметры.ФизЛицо = ФизЛицо;
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ОрганУчета = Строка(Выборка.ДомРег.ПаспортнаяСлужба);
		ОрганУчета_1 = "";
		ОрганУчета_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ОрганУчета, 30, ОрганУчета_1, ОрганУчета_2);
		ШапкаОбласть.Параметры.ОрганУчета_1 = ОрганУчета_1;
		ШапкаОбласть.Параметры.ОрганУчета_2 = ОрганУчета_2;
		
	КонецЕсли;
	
	ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Организация,ДолжностноеЛицо, Дата, Ложь);
	Если ТипЗнч(ДолжностноеЛицоФИО) = Тип("Структура") Тогда
		ШапкаОбласть.Параметры.ДолжностноеЛицо = ДолжностноеЛицоФИО.ДолжностноеЛицо;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ. 
// С макетом заявления.
// Параметры:
//  ВидЗаявления - логический, формирует шаблон в макете.
//  ТипМакета - логический, выбирает версии макета (версия 1 = Истина). 
// Возвращаемое значение:
//  Табличный документ - печатная форма заявления.
//
Функция ПечатьЗаявление(ВидЗаявления = Истина, ТипМакета = Истина)Экспорт
	
	ТабДокумент  = Новый ТабличныйДокумент;
	
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеСНГиРФ";
	Макет         = ПолучитьМакет("Заявление");                       
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	Если ТипМакета Тогда
		ШапкаТекст		  = Макет.ПолучитьОбласть("Текст1");
		СтрокаОбласть	  = Макет.ПолучитьОбласть("СтрокаЖильцов");
		ПодвалОбласть	  = Макет.ПолучитьОбласть("Подвал1");
		Если ВидЗаявления Тогда
			ВидМеста = "пребывания";
		Иначе
			ВидМеста = "проживания";
		КонецЕсли;
	Иначе
		ШапкаТекст		  = Макет.ПолучитьОбласть("Текст2");
		ПодвалОбласть	  = Макет.ПолучитьОбласть("Подвал2");
		Если ВидЗаявления Тогда
			ВидМеста = "пребывания";
		Иначе
			ВидМеста = "жительства";
		КонецЕсли;
		ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	КонецЕсли;
	
	Кому = "";
	ОтКого = "";
	
	РегистрируемоеЛицо_1 = "";
	РегистрируемоеЛицо_2 = "";
	
	СрокРегистрации 	= Неопределено;
	АдресПрибытия 		= Неопределено;
	
	Если ЭтотОбъект.ВидОперации <> Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
		Если ЗначениеЗаполнено(ЛицевойСчет)И ЗначениеЗаполнено(ЛицевойСчет.Здание) И ЗначениеЗаполнено(ЛицевойСчет.Здание.ПаспортнаяСлужба) Тогда
			РуководительУФМС = "";
			Если ТипЗнч(ЛицевойСчет.Здание.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
				КонтактЛицо = Строка(ЛицевойСчет.Здание.ПаспортнаяСлужба.ОсновноеКонтактноеЛицо);
				Если ЗначениеЗаполнено(КонтактЛицо) Тогда
					РуководительУФМС_1 = "";
					ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(КонтактЛицо,3,,РуководительУФМС_1);
					РуководительУФМС = ВРег(РуководительУФМС_1);
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаПаспортСлужба = Строка(ЛицевойСчет.Здание.ПаспортнаяСлужба);  
			ПервыйПробел = Найти(СтрокаПаспортСлужба, " "); 
			
			Если ПервыйПробел > 0 Тогда
				ПервоеСлово = Сред(СтрокаПаспортСлужба,1,ПервыйПробел-1);
				ПервоеСловоВерхРег = ВРег(ПервоеСлово);
				Если ПервоеСловоВерхРег <> ПервоеСлово  Тогда
					
					СтрокаПаспортСлужба = СтрЗаменить(СтрокаПаспортСлужба,ПервоеСлово,"");
					ПервоеСловоСклон = "";
					ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ПервоеСлово,2,,ПервоеСловоСклон);
					Если ИсходСклонения Тогда
						СтрокаПаспортСлужба = ПервоеСловоСклон + СтрокаПаспортСлужба;
					Иначе
						СтрокаПаспортСлужба = Строка(ЛицевойСчет.Здание.ПаспортнаяСлужба);
					КонецЕсли;
				КонецЕсли; 
				
				Кому = "Начальнику " + СтрокаПаспортСлужба;
			Иначе 
				Кому = "Начальнику ";
			КонецЕсли;
			Кому = Кому + " " + Символ(13) + РуководительУФМС;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ОтветственныйЗаРегистрацию) Тогда
			ШапкаОбласть.Параметры.Заполнить(ЭтотОбъект);
			// Перевод в родительный падеж.
			ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(ОтветственныйЗаРегистрацию),2,ОтветственныйЗаРегистрацию.Пол,ОтКого);
			ДанныеПаспорта = бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокой(ОтветственныйЗаРегистрацию, Дата, Ложь);
			Если ЗначениеЗаполнено(ДанныеПаспорта) Тогда
				ДанныеПаспорта = "";
			КонецЕсли;
			
			Если НЕ ИсходСклонения Тогда
				ОтКого = Строка(ОтветственныйЗаРегистрацию);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОтветственныйЗаРегистрацию.ДатаРождения) Тогда
				
				ДатаРождения = Формат(ОтветственныйЗаРегистрацию.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'");
				ОтКого  = "от " + ОтКого + " "+ ДатаРождения + Символ(13) + ДанныеПаспорта;
				
			Иначе
				
				ОтКого  = "от " + ОтКого + Символ(13) + ДанныеПаспорта;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(РегистрируемоеЛицо) Тогда
			
			РегистрируемоеЛицоЛС = "";
			
			ФИОРегЛица = "";
			ФИОРегЛица = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(РегистрируемоеЛицо, Дата, Ложь);
			Если ФИОРегЛица = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ФИОРегЛица) Тогда
				ФИОРегЛица = Строка(РегистрируемоеЛицо);
			КонецЕсли;
			
			Если ТипМакета Тогда
				ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФИОРегЛица,2,РегистрируемоеЛицо.Пол,РегистрируемоеЛицоЛС);
			Иначе
				ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФИОРегЛица,3,РегистрируемоеЛицо.Пол,РегистрируемоеЛицоЛС);
			КонецЕсли;
			
			Если ИсходСклонения Тогда
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(РегистрируемоеЛицоЛС, 70, РегистрируемоеЛицо_1, РегистрируемоеЛицо_2);
				РегЛицо = РегистрируемоеЛицоЛС;
			Иначе
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Строка(РегистрируемоеЛицо), 70, РегистрируемоеЛицо_1, РегистрируемоеЛицо_2);
				РегЛицо = Строка(РегистрируемоеЛицо);
			КонецЕсли; 
			
		КонецЕсли; 
		
		АдресЛС = "";
		Если ЗначениеЗаполнено(ОтветственныйЗаРегистрацию) Тогда
			АдресПоПрописке = бит_ПаспортныйСтолСервер.ПолнаяКонтактнаяИнформацияПоОбъекту(ОтветственныйЗаРегистрацию,Перечисления.бит_ТипыКонтактнойИнформации.Адрес,Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего);
			Если АдресПоПрописке <> Неопределено И ЗначениеЗаполнено(АдресПоПрописке.Представление) Тогда
				АдресЛС = АдресПоПрописке.Представление;
				
			ИначеЕсли ЗначениеЗаполнено(ЛицевойСчет) Тогда
				
				Если ЗначениеЗаполнено(ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
					
					АдресЛС = Строка(ЛицевойСчет.Здание.ПочтовыйАдрес)+ ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира), ", кв." + Строка(ЛицевойСчет.Квартира),"");
					
				Иначе
					УлицаАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.УлицаЛицевогоСчета),"ул. " + Строка(ЛицевойСчет.УлицаЛицевогоСчета),"");
					ДомАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.Здание),", д. " + Строка(ЛицевойСчет.Здание),"");
					КорпусАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.Здание.Корпус),", корп. " + Строка(ЛицевойСчет.Здание.Корпус),"");
					КвартираАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира),", кв. " + Строка(ЛицевойСчет.Квартира),"");
					
					АдресЛС =  УлицаАдреса + ДомАдреса + КорпусАдреса + КвартираАдреса;  
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаРегистрации) и ЗначениеЗаполнено(ДатаСнятияСРегистрации) Тогда
			
			СрокРегистрации = бит_ПаспортныйСтолКлиетСервер.ПериодПрописью(ДатаРегистрации,ДатаСнятияСРегистрации);
			
		КонецЕсли;
		АдресПрибытия = "";
		Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
			
			Если ЗначениеЗаполнено(ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
				
				АдресПрибытия = Строка(ЛицевойСчет.Здание.ПочтовыйАдрес)+ ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира), ", кв." + Строка(ЛицевойСчет.Квартира),"");
				
			Иначе
				УлицаАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.УлицаЛицевогоСчета),"ул. " + Строка(ЛицевойСчет.УлицаЛицевогоСчета),"");
				ДомАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.Здание),", д. " + Строка(ЛицевойСчет.Здание),"");
				КорпусАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.Здание.Корпус),", корп. " + Строка(ЛицевойСчет.Здание.Корпус),"");
				КвартираАдреса = ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира),", кв. " + Строка(ЛицевойСчет.Квартира),"");
				
				АдресПрибытия =  УлицаАдреса + ДомАдреса + КорпусАдреса + КвартираАдреса;  
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	СтруктураДляМакета = Новый Структура("Кому,ОтКого,РегЛицо, РегистрируемоеЛицо_1,РегистрируемоеЛицо_2,АдресЛС,ВидМеста,СрокРегистрации,АдресПрибытия,ОтветственныйЗаРегистрацию"
	,Кому,ОтКого,РегЛицо, РегистрируемоеЛицо_1,РегистрируемоеЛицо_2,АдресЛС,ВидМеста,СрокРегистрации,АдресПрибытия,Строка(ОтветственныйЗаРегистрацию));
	
	ШапкаОбласть.Параметры.Заполнить(СтруктураДляМакета);
	ТабДокумент.Вывести(ШапкаОбласть);
	ШапкаТекст.Параметры.Заполнить(СтруктураДляМакета);
	Если НЕ ТипМакета тогда
		
		СписокПроживающих = бит_ПаспортныйСтолСервер.ПолучитьСписокПроживающихПоЛС(ЛицевойСчет, Дата);
		НайденнаяСтрока = СписокПроживающих.Найти(ОтветственныйЗаРегистрацию,"ФизЛицо");
		Если НайденнаяСтрока <> Неопределено Тогда
			Если ЗначениеЗаполнено(НайденнаяСтрока.ПравоустанавливающиеДокументы) Тогда
				ДокСтрока = НайденнаяСтрока.ПравоустанавливающиеДокументы;
				
				СтрокаДляСклонения = "";
				ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ДокСтрока.Наименование,2,,СтрокаДляСклонения);
				Если ИсходСклонения Тогда
					ДокИтогСтрока = СтрокаДляСклонения;
				Иначе
					ДокИтогСтрока = ДокСтрока.Наименование;
				КонецЕсли; 
				ДокИтогСтрока = ДокИтогСтрока + ?(ЗначениеЗаполнено(ДокСтрока.НомерДокумента)," №" + ДокСтрока.НомерДокумента,"")
				+ ?(ЗначениеЗаполнено(ДокСтрока.ДатаДокумента)," от " + Формат(ДокСтрока.ДатаДокумента,"ДЛФ=DD"),"");
				ШапкаТекст.Параметры.ПравоустанавливающиеДокументы = ДокИтогСтрока;
			КонецЕсли;
		КонецЕсли;
		
		СтепеньРодстваИтог = "";
		Если РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			СтепеньРодстваИтог = "моему ";
		ИначеЕсли РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			СтепеньРодстваИтог = "моей ";
		КонецЕсли;
		
		СтепеньРодстваЛС = "";
		ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(СтепеньРодства),3,,СтепеньРодстваЛС);
		Если ИсходСклонения Тогда
			СтепеньРодстваИтог = СтепеньРодстваИтог + СтепеньРодстваЛС;
		Иначе
			СтепеньРодстваИтог = СтепеньРодстваИтог + Строка(СтепеньРодства);
		КонецЕсли; 
		ШапкаТекст.Параметры.СтепеньРодства = СтепеньРодстваИтог;
	КонецЕсли;
	ТабДокумент.Вывести(ШапкаТекст);
	Если ТипМакета Тогда
		// Вывод строк с проживающими по ЛС.
		Если ЭтотОбъект.ВидОперации <> Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
			
			// Формирование списка совершеннолетних, заполненных в таб части формы на вкладке "Доп. данные".
			СписокПроживающих = ФизическиеЛица.Выгрузить();
			МассивДляУдаления = Новый Массив;
			Для каждого ДанныеПроживающего Из СписокПроживающих Цикл
				
				ДатаРождения = ДанныеПроживающего.ФизическоеЛицо.ДатаРождения;
				
				ЧислоЛет = бит_ПаспортныйСтолКлиетСервер.КолвоПолныхЛет(ДатаРождения,ДатаРегистрации);
				
				Если ЧислоЛет < 18 Тогда
					МассивДляУдаления.Добавить(ДанныеПроживающего);
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого СтрокаМассива Из МассивДляУдаления  Цикл
				
				СписокПроживающих.Удалить(СтрокаМассива);
				
			КонецЦикла; 
			Если СписокПроживающих.Количество()>0 Тогда
				
				Для каждого СтрокаТЧ Из СписокПроживающих Цикл
					
					ФИОФизЛица      = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(СтрокаТЧ.ФизическоеЛицо,Дата, Ложь);
					
					Если ЗначениеЗаполнено(ФИОФизЛица) Тогда
						СтрокаОбласть.Параметры.ЖилецЛС = ФИОФизЛица;
					Иначе
						СтрокаОбласть.Параметры.ЖилецЛС = СтрокаТЧ.ФизическоеЛицо.Наименование;
					КонецЕсли;
					ТабДокумент.Вывести(СтрокаОбласть);
				КонецЦикла;
				
			Иначе 
				КолвоСтрок = 3;
				Для Счетчик = 1 По КолвоСтрок Цикл
					ТабДокумент.Вывести(СтрокаОбласть);
				КонецЦикла; 
			КонецЕсли;		
		Иначе
			
			КолвоСтрок = 3;
			Для Счетчик = 1 По КолвоСтрок Цикл
				ТабДокумент.Вывести(СтрокаОбласть);
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли;     
	
	Если ЗначениеЗаполнено(ДатаРегистрации) тогда
		ДатаЗаявления = ДатаРегистрации;
	ИначеЕсли ЗначениеЗаполнено(Дата) Тогда
		ДатаЗаявления = Дата;
	Иначе 
		ДатаЗаявления = ТекущаяДата();
	КонецЕсли;
	
	Если ТипМакета Тогда
		
		ПодвалОбласть.Параметры.День 	= Формат(ДатаЗаявления ,"ДФ=dd");
		ПодвалОбласть.Параметры.Месяц 	= Формат(ДатаЗаявления ,"ДФ=MM");
		ПодвалОбласть.Параметры.Год 	= Формат(ДатаЗаявления ,"ДФ='yyyy ""г.""'");
	Иначе
		ПодвалОбласть.Параметры.ДатаРегистрации = Формат(ДатаЗаявления, "ДЛФ=DD");
		КолвоСтрок = 3;
		Для Счетчик = 1 По КолвоСтрок Цикл
			ТабДокумент.Вывести(ОбластьПустаяСтрока);
		КонецЦикла; 
		
	КонецЕсли;	
	
	ТабДокумент.Вывести(ПодвалОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

//Функция формирует табличный документ  с макетом СопроводительноеПисьмо

// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "ЗОРПМЖ" тогда
		
		ТабДокумент = ПечатьЗОРПМЖ();
		
	ИначеЕсли ИмяМакета = "СОРПМЖ" тогда
		
		ТабДокумент = ПечатьСОРПМЖ();
		
	ИначеЕсли ИмяМакета = "КР" тогда
		
		ТабДокумент = ПечатьКР();
		
	ИначеЕсли ИмяМакета = "ЛСУП" тогда
		
		ТабДокумент = ПечатьЛСУП();
		
	ИначеЕсли ИмяМакета = "ЗОССРУПМЖ" тогда
		
		ТабДокумент = ПечатьЗОССРУПМЖ(Ложь);
		
	ИначеЕсли ИмяМакета = "ЗОССРУПМЖ_2части" тогда
		
		ТабДокумент = ПечатьЗОССРУПМЖ(Истина);
		
	ИначеЕсли ИмяМакета = "АЛУ" тогда
		
		ВидМакета = истина;
		ТабДокумент = ПечатьАЛУ(ВидМакета);
		
	ИначеЕсли ИмяМакета = "АЛУ_стар" тогда
		
		ВидМакета = ложь;
		ТабДокумент = ПечатьАЛУ(ВидМакета);
		
	ИначеЕсли ИмяМакета = "ЛСУВ" тогда
		
		ТабДокумент = ПечатьЛСУВ();
		
	ИначеЕсли ИмяМакета = "УВОРУ" тогда
		
		ТабДокумент = ПечатьУВОРУ();
		
	ИначеЕсли  ИмяМакета = "АЛП" тогда	
		
		ВидМакета = Истина;
		ТабДокумент = ПечатьАЛП(ВидМакета);
		
	ИначеЕсли  ИмяМакета = "АЛП_стар" тогда	
		
		ВидМакета = Ложь;
		ТабДокумент = ПечатьАЛП(ВидМакета);
		
	ИначеЕсли  ИмяМакета = "Анкета" тогда	
		
		ТабДокумент = ПечатьАнкета();
		
	ИначеЕсли  ИмяМакета = "СОРГ_РФ_ПМЖ" тогда	
		
		ТабДокумент = ПечатьСОРГ_РФ_ПМЖ();
	ИначеЕсли  ИмяМакета = "СОРГ_РФ_ПМЖ_Old" тогда	
		
		ТабДокумент = ПечатьСОРГ_РФ_ПМЖ(Ложь);
	ИначеЕсли ИмяМакета = "СОРПМП" Тогда
		
		ТабДокумент = ПечатьСОРПМП();
		
	ИначеЕсли ИмяМакета = "СОРПМПЖ" Тогда
		
		ТабДокумент = ПечатьСОРПМПЖ();
		
	ИначеЕсли ИмяМакета = "ЗаявлениеСНГ1" Тогда
		
		ТабДокумент = ПечатьЗаявление(Ложь);
		
	ИначеЕсли ИмяМакета = "ЗаявлениеРФ1" Тогда
		
		ТабДокумент = ПечатьЗаявление();
	ИначеЕсли ИмяМакета = "ЗаявлениеСНГ2" Тогда
		
		ТабДокумент = ПечатьЗаявление(Ложь, Ложь);
		
	ИначеЕсли ИмяМакета = "ЗаявлениеРФ2" Тогда
		
		ТабДокумент = ПечатьЗаявление(, Ложь);
		
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет загрузку в XML.
//
Процедура ЗагрузкаXML(ВидСообщения, Каталог) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ДокументXML = Новый ЗаписьXML;
	ДокументXML.ОткрытьФайл(Каталог + "\Хренота.xml");
	
	ДокументXML.ЗаписатьОбъявлениеXML();
	ДокументXML.ЗаписатьНачалоЭлемента("Документ");
	
	ДокументXML.ЗаписатьАтрибут("Тип"            , "888710");
	ДокументXML.ЗаписатьАтрибут("SchemaLocation" , "");
	ДокументXML.ЗаписатьАтрибут("Дата"           , Формат(Дата, "ДФ=dd.MM.yyyy"));
	
	ДокументXML.ЗаписатьНачалоЭлемента("Оформлен");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Дата");
	ДокументXML.ЗаписатьТекст(Формат(Дата, "ДФ=dd.MM.yyyy"));
	ДокументXML.ЗаписатьКонецЭлемента(); // Дата.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Орган");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Имя");
	ДокументXML.ЗаписатьАтрибут("Код","");
	ДокументXML.ЗаписатьКонецЭлемента();
	
	ДокументXML.ЗаписатьНачалоЭлемента("Сотрудник");
	ДокументXML.ЗаписатьАтрибут("Код","");
	ДокументXML.ЗаписатьКонецЭлемента();
	
	ДокументXML.ЗаписатьКонецЭлемента(); //О рган.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // Офромлен.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Подписан");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Дата");
	ДокументXML.ЗаписатьТекст(Формат(Дата, "ДФ=dd.MM.yyyy"));
	ДокументXML.ЗаписатьКонецЭлемента(); // Дата.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Орган");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Имя");
	ДокументXML.ЗаписатьАтрибут("Код","");
	ДокументXML.ЗаписатьКонецЭлемента();
	
	ДокументXML.ЗаписатьНачалоЭлемента("Сотрудник");
	ДокументXML.ЗаписатьАтрибут("Код","");
	ДокументXML.ЗаписатьКонецЭлемента();
	
	ДокументXML.ЗаписатьКонецЭлемента(); // Орган.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // Подписан.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Человек");
	ДокументXML.ЗаписатьНачалоЭлемента("УстановочныеДанные");
	ДокументXML.ЗаписатьАтрибут("Дествие","");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Операция");
	ДокументXML.ЗаписатьАтрибут("Основание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Операция.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Актуальность");
	ДокументXML.ЗаписатьАтрибут("Начало"   , "");
	ДокументXML.ЗаписатьАтрибут("Окончание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Актуальность.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Фамилия");
	ДокументXML.ЗаписатьКонецЭлемента(); //Фамилия.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Имя");
	ДокументXML.ЗаписатьКонецЭлемента(); // Имя.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Отчество");
	ДокументXML.ЗаписатьКонецЭлемента(); // Отчество.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Пол");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Пол.
	
	ДокументXML.ЗаписатьНачалоЭлемента("ДатаРождения");
	ДокументXML.ЗаписатьКонецЭлемента(); // ДатаРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("СтранаРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // СтранаРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("РегионРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // РегионРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("РайонРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // РайонРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("ГородРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // ГородРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("НаселенныйПунктРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // НаселенныйПунктРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("МестоРождения");
	ДокументXML.ЗаписатьАтрибут("ОКАТО", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // МестоРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Гражданство");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Гражданство.
	
	ДокументXML.ЗаписатьНачалоЭлемента("ЛичныйДокумент");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Вид");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Вид.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Серия");
	ДокументXML.ЗаписатьКонецЭлемента(); // Серия.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Номер");
	ДокументXML.ЗаписатьКонецЭлемента(); // Номер.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Дата");
	ДокументXML.ЗаписатьКонецЭлемента(); // Дата.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Орган");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Орган.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // ЛичныйДокумент.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // УстановочныеДанные.
	
	ДокументXML.ЗаписатьНачалоЭлемента("УстановочныеДанные");
	ДокументXML.ЗаписатьАтрибут("Дествие","");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Операция");
	ДокументXML.ЗаписатьАтрибут("Основание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Операция.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Актуальность");
	ДокументXML.ЗаписатьАтрибут("Начало"   , "");
	ДокументXML.ЗаписатьАтрибут("Окончание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Актуальность.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Фамилия");
	ДокументXML.ЗаписатьКонецЭлемента(); // Фамилия.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Имя");
	ДокументXML.ЗаписатьКонецЭлемента(); // Имя.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Отчество");
	ДокументXML.ЗаписатьКонецЭлемента(); // Отчество.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Пол");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); //Пол.
	
	ДокументXML.ЗаписатьНачалоЭлемента("ДатаРождения");
	ДокументXML.ЗаписатьКонецЭлемента(); // ДатаРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("СтранаРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // СтранаРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("РегионРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // РегионРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("РайонРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // РайонРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("ГородРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // ГородРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("НаселенныйПунктРождения");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // НаселенныйПунктРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("МестоРождения");
	ДокументXML.ЗаписатьАтрибут("ОКАТО", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // МестоРождения.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Гражданство");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Гражданство.
	
	ДокументXML.ЗаписатьНачалоЭлемента("ЛичныйДокумент");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Вид");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Вид.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Серия");
	ДокументXML.ЗаписатьКонецЭлемента(); // Серия.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Номер");
	ДокументXML.ЗаписатьКонецЭлемента(); // Номер.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Дата");
	ДокументXML.ЗаписатьКонецЭлемента(); // Дата.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Орган");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Орган.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // ЛичныйДокумент.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // УстановочныеДанные.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Координаты");
	ДокументXML.ЗаписатьАтрибут("Дествие","");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Операция");
	ДокументXML.ЗаписатьАтрибут("Основание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Операция.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Актуальность");
	ДокументXML.ЗаписатьАтрибут("Начало"   , "");
	ДокументXML.ЗаписатьАтрибут("Окончание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Актуальность.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Адрес");
	ДокументXML.ЗаписатьАтрибут("Тип"  , "");
	ДокументXML.ЗаписатьАтрибут("Вид"  , "");
	ДокументXML.ЗаписатьАтрибут("ОКАТО", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Адрес.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Страна");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Страна.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Регион");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Регион.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Район");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Район.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Город");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Город.
	
	ДокументXML.ЗаписатьНачалоЭлемента("НаселенныйПункт");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // НаселенныйПункт.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Улица");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Улица.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Дом");
	ДокументXML.ЗаписатьКонецЭлемента(); // Дом.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Корпус");
	ДокументXML.ЗаписатьКонецЭлемента(); // Корпус.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Строение");
	ДокументXML.ЗаписатьКонецЭлемента(); // Строение.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Квартира");
	ДокументXML.ЗаписатьКонецЭлемента(); // Квартира.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // Координаты.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Координаты");
	ДокументXML.ЗаписатьАтрибут("Дествие","");
	
	ДокументXML.ЗаписатьНачалоЭлемента("Операция");
	ДокументXML.ЗаписатьАтрибут("Основание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Операция.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Актуальность");
	ДокументXML.ЗаписатьАтрибут("Начало"   , "");
	ДокументXML.ЗаписатьАтрибут("Окончание", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Актуальность.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Адрес");
	ДокументXML.ЗаписатьАтрибут("Тип"  , "");
	ДокументXML.ЗаписатьАтрибут("Вид"  , "");
	ДокументXML.ЗаписатьАтрибут("ОКАТО", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Адрес.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Страна");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Страна.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Регион");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Регион.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Район");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Район.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Город");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Город.
	
	ДокументXML.ЗаписатьНачалоЭлемента("НаселенныйПункт");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // НаселенныйПункт.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Улица");
	ДокументXML.ЗаписатьАтрибут("Код", "");
	ДокументXML.ЗаписатьКонецЭлемента(); // Улица.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Дом");
	ДокументXML.ЗаписатьКонецЭлемента(); // Дом.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Корпус");
	ДокументXML.ЗаписатьКонецЭлемента(); // Корпус.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Строение");
	ДокументXML.ЗаписатьКонецЭлемента(); // Строение.
	
	ДокументXML.ЗаписатьНачалоЭлемента("Квартира");
	ДокументXML.ЗаписатьКонецЭлемента(); // Квартира.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // Координаты.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // Человек.
	
	ДокументXML.ЗаписатьКонецЭлемента(); // Документ.
	
КонецПроцедуры
	
	
#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства тогда
		
		СтруктураМакетов =  Новый Структура("ЗОССРУПМЖ,ЗОССРУПМЖ_2части,АЛП,КР,ЛСУП,СОРГ_РФ_ПМЖ,СОРГ_РФ_ПМЖ_Old,СОРПМПЖ, АЛП_стар,АЛУ,ЛСУВ"
		,"Ф6:Заявление о регистрации по месту жительства"
		,"Ф6:Заявление о регистрации и снятии по месту жительства"
		,"Ф2:Адресный листок прибытия","Ф9:Карточка регистрации"
		,"Ф12П:Листок статистического учета прибытия"
		,"РФЛ1:Сведения в ГНИ"
		,"РФЛ1:Сведения в ГНИ, с детьми до 14 лет"
		,"Ф8:Свидетельство о регистрации по месту жительства"
		,"Ф2:Адресный листок прибытия (старая версия)"
		,"Ф7:Адресный листок убытия"
		,"Ф12В:Листок статистического учета выбытия");
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания тогда	 
		
		СтруктураМакетов =  Новый Структура("ЗОРПМЖ,АЛП,Анкета,ЛСУП,СОРПМП,АЛП_стар"
		,"Ф1:Заявление о регистрации по месту пребывания"
		,"Ф2:Адресный листок прибытия","Ф5:Анкета"
		,"Ф12П:Листок статистического учета прибытия"
		,"Ф3:Свидетельство о регистрации по месту пребывания"
		,"Ф2:Адресный листок прибытия (старая версия)");
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета тогда 
		
		СтруктураМакетов =  Новый Структура("ЗОССРУПМЖ,АЛУ,ЛСУВ,УВОРУ, АЛУ_стар"
		,"Ф6:Заявление о снятии с регистрационного учета"
		,"Ф7:Адресный листок убытия"
		,"Ф12В:Листок статистического учета выбытия"
		,"Ф14:Уведомление в орган регистрационного учета"
		,"Ф7:Адресный листок убытия (старая версия)");
		
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
		// В дальнейшем преобразуется в разделитель.					
		СтруктураМакетов.Вставить("РазделительСобств","--");
		// Формирование блаков нерегламентированных документов.
		СтруктураМакетов.Вставить("ЗаявлениеСНГ1","Бланк заявления проживания (для СНГ, версия 1)");
		СтруктураМакетов.Вставить("ЗаявлениеРФ1", "Бланк заявления пребывания (для РФ, версия 1)");
		СтруктураМакетов.Вставить("ЗаявлениеСНГ2","Бланк заявления проживания (для СНГ, версия 2)");
		СтруктураМакетов.Вставить("ЗаявлениеРФ2", "Бланк заявления пребывания (для РФ, версия 2)");
	КонецЕсли;
	Возврат СтруктураМакетов;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ПодробныйАдрес()
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	ЗапросАдрес = Новый Запрос;
	ЗапросАдрес.УстановитьПараметр("Объект" , РегистрируемоеЛицо);
	ЗапросАдрес.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1 КАК Индекс,
	|	КонтактнаяИнформация.Поле2 КАК Регион,
	|	КонтактнаяИнформация.Поле3 КАК Район,
	|	КонтактнаяИнформация.Поле4 КАК Город,
	|	КонтактнаяИнформация.Поле5 КАК НасПункт,
	|	КонтактнаяИнформация.Поле6 КАК Улица,
	|	КонтактнаяИнформация.Поле7 КАК Дом,
	|	КонтактнаяИнформация.Поле8 КАК Корпус,
	|	КонтактнаяИнформация.Поле9 КАК Квартира,
	|	КонтактнаяИнформация.Поле10 КАК Страна,
	|	КонтактнаяИнформация.Комментарий,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтактнаяИнформация.ТипДома,
	|	КонтактнаяИнформация.ТипКорпуса,
	|	КонтактнаяИнформация.ТипКвартиры,
	|	КонтактнаяИнформация.ПользовательЛичногоКонтакта
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего)";
	
	Выборка = ЗапросАдрес.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Функция возвращает контактную информацию:
//
// Параметры
//  Объект      - СправочникСсылка - Физ лицо/Контрагент/Организация,
//  ВидОбъекта  - ПеречислениеСсылка - Вид объекта контактной информации.
//                 
// Возвращаемое значение:
//   Таблица значений   - содержит контактную информацию.
//
Функция ПолучитьКИ(Объект, ВидОбъекта)
	
	Запрос = Новый Запрос;
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Вид КАК Вид,
	|	ВложенныйЗапрос.Тип КАК Тип,
	|	ВложенныйЗапрос.Объект КАК Объект,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле1) КАК Поле1,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле2) КАК Поле2,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле3) КАК Поле3,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле4) КАК Поле4,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле5) КАК Поле5,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле6) КАК Поле6,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле7) КАК Поле7,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле8) КАК Поле8,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле9) КАК Поле9,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле10) КАК Поле10,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипДома) КАК ТипДома,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипКорпуса) КАК ТипКорпуса,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипКвартиры) КАК ТипКвартиры,
	|	МАКСИМУМ(ВложенныйЗапрос.Представление) КАК Представление,
	|	МАКСИМУМ(ВложенныйЗапрос.Комментарий) КАК Комментарий,
	|	МАКСИМУМ(ВложенныйЗапрос.ЗначениеПоУмолчанию) КАК ЗначениеПоУмолчанию
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Объект КАК Объект,
	|		ВидыКонтактнойИнформации.Тип КАК Тип,
	|		ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|		"""" КАК Представление,
	|		"""" КАК Поле1,
	|		"""" КАК Поле2,
	|		"""" КАК Поле3,
	|		"""" КАК Поле4,
	|		"""" КАК Поле5,
	|		"""" КАК Поле6,
	|		"""" КАК Поле7,
	|		"""" КАК Поле8,
	|		"""" КАК Поле9,
	|		"""" КАК Поле10,
	|		"""" КАК ТипДома,
	|		"""" КАК ТипКорпуса,
	|		"""" КАК ТипКвартиры,
	|		"""" КАК Комментарий,
	|		"""" КАК ЗначениеПоУмолчанию
	|	ИЗ
	|		"+?(ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие"),"Справочник.бит_ВидыКонтактнойИнформации", "Справочник.ВидыКонтактнойИнформации")+" КАК ВидыКонтактнойИнформации
	|	ГДЕ
	|		(НЕ ВидыКонтактнойИнформации.ПометкаУдаления)
	|		И ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		РегистрСведенийКонтактнаяИнформация.Объект,
	|		РегистрСведенийКонтактнаяИнформация.Тип,
	|		РегистрСведенийКонтактнаяИнформация.Вид,
	|		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Представление КАК СТРОКА(1000)),
	|		РегистрСведенийКонтактнаяИнформация.Поле1,
	|		РегистрСведенийКонтактнаяИнформация.Поле2,
	|		РегистрСведенийКонтактнаяИнформация.Поле3,
	|		РегистрСведенийКонтактнаяИнформация.Поле4,
	|		РегистрСведенийКонтактнаяИнформация.Поле5,
	|		РегистрСведенийКонтактнаяИнформация.Поле6,
	|		РегистрСведенийКонтактнаяИнформация.Поле7,
	|		РегистрСведенийКонтактнаяИнформация.Поле8,
	|		РегистрСведенийКонтактнаяИнформация.Поле9,
	|		РегистрСведенийКонтактнаяИнформация.Поле10,
	|		РегистрСведенийКонтактнаяИнформация.ТипДома,
	|		РегистрСведенийКонтактнаяИнформация.ТипКорпуса,
	|		РегистрСведенийКонтактнаяИнформация.ТипКвартиры,
	|		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Комментарий КАК СТРОКА(1000)),
	|		РегистрСведенийКонтактнаяИнформация.ЗначениеПоУмолчанию
	|	ИЗ
	|		"+?(ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие"),"РегистрСведений.бит_КонтактнаяИнформация", "РегистрСведений.КонтактнаяИнформация")+" КАК РегистрСведенийКонтактнаяИнформация
	|	ГДЕ
	|		РегистрСведенийКонтактнаяИнформация.Объект = &Объект) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Вид,
	|	ВложенныйЗапрос.Тип,
	|	ВложенныйЗапрос.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление УБЫВ,
	|	ВложенныйЗапрос.Тип.Порядок,
	|	Вид";
	
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъекта);
	Запрос.УстановитьПараметр("Объект", Объект);
	
	ТабЗн = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабЗн;
	
КонецФункции

// Функция возвращает паспортные данные проживающих.
//
Функция ПолучитьТаблицуДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 4
	|	ПаспортныеДанныеФизЛиц.ФизЛицо,
	|	ПаспортныеДанныеФизЛиц.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛиц.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛиц.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛиц.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛиц.ДокументКодПодразделения КАК КодПодразделенияДокумента,
	|	ПаспортныеДанныеФизЛиц.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства
	|ИЗ
	|	РегистрСведений.бит_ПаспортныеДанныеПроживающих КАК ПаспортныеДанныеФизЛиц
	|ГДЕ
	|	ПаспортныеДанныеФизЛиц.ФизЛицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачиДокумента УБЫВ";
	
	Запрос.УстановитьПараметр("ФизЛицо", РегистрируемоеЛицо);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));

КонецПроцедуры


#КонецОбласти

#КонецЕсли