
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура СозданиеЛицевыхСчетов(Команда)
	
	ОткрытьФорму("Обработка.бит_СозданиеЛицевыхСчетов.Форма",,ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата", КонецДня(ТекущаяДата()));
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	НастройкиКомпановки = Новый НастройкиКомпоновкиДанных;
	бит_ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(НастройкиКомпановки.Отбор, Список.Отбор);
	бит_ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(НастройкиКомпановки.УсловноеОформление, Список.УсловноеОформление);
	
	Для каждого ПолеГруппировки Из Список.Группировка.Элементы Цикл
		
		Группировки = НастройкиКомпановки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		НовоеПолеГруппировки = Группировки.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НовоеПолеГруппировки, ПолеГруппировки);
		
	КонецЦикла; 
	
	
	Настройки.Вставить("НастройкиКомпановки", НастройкиКомпановки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	НастройкиКомпановки = Настройки.Получить("НастройкиКомпановки");
	
	Если НЕ НастройкиКомпановки = Неопределено Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(Список.Отбор, НастройкиКомпановки.Отбор);
		бит_ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(Список.УсловноеОформление, НастройкиКомпановки.УсловноеОформление);
		
		Попытка
			
			Группировки = НастройкиКомпановки.Структура[0];
			
			Список.Группировка.Элементы.Очистить();
			
			Для каждого ПолеГруппировки Из Группировки.ПоляГруппировки.Элементы Цикл
				
				НовоеПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовоеПолеГруппировки, ПолеГруппировки);
				
			КонецЦикла; 
			
		Исключение
			
		КонецПопытки;
	Иначе
		
		Список.Отбор.Элементы.Очистить();
		Список.УсловноеОформление.Элементы.Очистить();
		Список.Группировка.Элементы.Очистить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВосстанавливатьОтборы Тогда
		
		Для каждого Отбор Из Список.Отбор.Элементы Цикл
			
			Отбор.Использование = Истина;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Дом      = Неопределено;
	Квартира = Неопределено;
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список,
																"УлицаЛицевогоСчета",
																Улица,
																НЕ Улица.Пустая(),
																ВидСравненияКомпоновкиДанных.Равно);
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список,
																"Здание");
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список,
																"Квартира");
	
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	
	Квартира = Неопределено;
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список,
																"Здание",
																Дом,
																НЕ Дом.Пустая(),
																ВидСравненияКомпоновкиДанных.Равно);
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список,
																"Квартира");
	
КонецПроцедуры

&НаКлиенте
Процедура ДомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Улица", Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список,
																"Квартира",
																Квартира,
																НЕ Квартира.Пустая(),
																ВидСравненияКомпоновкиДанных.Равно);
		
КонецПроцедуры

&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Дом);
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора",Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
		ОткрытьФорму("Обработка.бит_КопированиеЛицевогоСчета.Форма.Форма", Новый Структура("ЛицевойСчет", Элементы.Список.ТекущаяСтрока));
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти