#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура формирует наименование элемента.
//
Процедура СформироватьНаименование() Экспорт
	
	Наименование = Строка(НомерДома) + Строка(ПрефиксДома);
	
КонецПроцедуры //битСформироватьНаименование() 

// Процедура проверяет уникальность дома.
//
Процедура ПроверитьУникальностьДома(Отказ)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	бит_СписокЗданий.Ссылка
	               |ИЗ
	               |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	               |ГДЕ
	               |	бит_СписокЗданий.НомерДома = &НомерДома
	               |	И бит_СписокЗданий.ПрефиксДома = &ПрефиксДома
	               |	И НЕ (бит_СписокЗданий.Ссылка = &Ссылка)
	               |	И бит_СписокЗданий.Улица = &Улица
	               |	И бит_СписокЗданий.Корпус = &Корпус
	               |	И бит_СписокЗданий.Строение = &Строение";
	Запрос.УстановитьПараметр("НомерДома"   ,НомерДома);
	Запрос.УстановитьПараметр("ПрефиксДома" ,ПрефиксДома);
	Запрос.УстановитьПараметр("Владелец"    ,Владелец);
	Запрос.УстановитьПараметр("Ссылка"      ,Ссылка);
	Запрос.УстановитьПараметр("Улица"       ,Улица);
	Запрос.УстановитьПараметр("Корпус"      ,Корпус);
	// БИТ_ЖКХ 16.11.2015 13:01:14 Начало правки...
	Запрос.УстановитьПараметр("Строение"    ,Строение);
	// БИТ_ЖКХ 16.11.2015 13:01:14 Конец правки.	
	
	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный номер дома уже существует",Отказ,,СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНаименование();
	
	Если Не ЭтоНовый()
		И Не ПометкаУдаления = Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен номер дома!",Отказ);
	КонецЕсли;
	
	// Укажем, что надо проверить:
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("Улица");
	СтруктураРеквизитов.Вставить("НомерДома");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""Список зданий"".");
	
	Если Не Отказ тогда
		ПроверитьУникальностьДома(Отказ);
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ_20122013_начало_изменений
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами;
	
	// БИТ_ЖКХ 26.03.2014
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
	КонецЕсли;
	// БИТ_ЖКХ 26.03.2014
	
КонецПроцедуры
// БИТ_ЖКХ_20122013_окончание_изменений

#КонецОбласти

#КонецЕсли