
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидСведенийПриИзменении(Элемент)
	
		
	Если ЗначениеЗаполнено(Запись.ВидСведений) Тогда
		
		ТипЗначения = ВидСведенийПриИзмененииНаСервере(Запись.ВидСведений);
	
		Элементы.Значение.ОграничениеТипа = ТипЗначения;
		Запись.Значение = ТипЗначения.ПривестиЗначение();
	Иначе
		Запись.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВидСведенийПриИзмененииНаСервере(ВидСведений)
	
	Возврат ВидСведений.ТипЗначения;	
	
КонецФункции	
	
#КонецОбласти