&НаКлиенте
Процедура Сформировать(Команда)
	
	Таблица = СформироватьНаСервере();
	Таблица.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	Таблица = Новый ТабличныйДокумент;
	
	Макет = Новый ТабличныйДокумент;
	
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет"); 
	Шапка = Макет.ПолучитьОбласть("ОбластьШапка");
	//Шапка.Параметры.НачалоПериода = Формат(Период.ДатаНачала,"ДЛФ=DD");
	//Шапка.Параметры.КонецПериода = Формат(Период.ДатаОкончания,"ДЛФ=DD");
	Таблица.Вывести(Шапка);
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НП", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КП", Период.ДатаОкончания);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_НачисленияПоУслугамЖКХОбороты.Период КАК Дата,
	               |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.лб_ВидОплаты КАК Регистраторлб_ВидОплаты,
	               |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.Комментарий КАК РегистраторКомментарий,
	               |	-бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход КАК Сумма,
	               |	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	               |	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_ОплатаКУСписокЛС.лб_Примечание КАК Сведения,
	               |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Наименование КАК Квартиросъемщик,
	               |	лб_Тест_Дома.ADR КАК Здание,
	               |	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Квартира КАК Квартира
	               |ИЗ
	               |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НП, &КП, Запись, ) КАК бит_НачисленияПоУслугамЖКХОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КП, СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)) КАК бит_ПроживающиеПоЛССрезПоследних
	               |		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
	               |		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Здание = лб_Тест_Дома.Здание
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
	               |		ПО бит_НачисленияПоУслугамЖКХОбороты.Регистратор = бит_ОплатаКУСписокЛС.Ссылка
	               |			И бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет = бит_ОплатаКУСписокЛС.ЛицевойСчет
	               |ГДЕ
	               |	бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход < 0
	               |	И ТИПЗНАЧЕНИЯ(бит_НачисленияПоУслугамЖКХОбороты.Регистратор) = ТИП(документ.бит_ОплатаКУ)
	               |	И бит_НачисленияПоУслугамЖКХОбороты.Регистратор.лб_ВидОплаты.Код <> ""000000032""
	               |	И бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ.Код = ""00-000001""
	               |	И бит_ОплатаКУСписокЛС.лб_Примечание ПОДОБНО ""%КАП%""
	               |	И НЕ бит_ОплатаКУСписокЛС.лб_Примечание ПОДОБНО ""%возврат%""";
	
	Результат = Запрос.Выполнить();
	ОбщаяСумма = 0;
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выгрузить();
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		
		Для каждого стр из Выборка Цикл
			ОбластьСтрока.Параметры.Заполнить(стр);
			ОбластьСтрока.Параметры.Дата = Формат(Стр.Дата, "ДФ=dd.MM.yyyy");
			ОбластьСтрока.Параметры.Сумма = Формат(стр.Сумма, "ЧДЦ=2");
			ОбластьСтрока.Параметры.Адрес = "" + СокрП(стр.Здание) + ", кв. " + стр.Квартира; 
			ОбластьСтрока.Параметры.Квартиросъемщик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(стр.Квартиросъемщик);
			Таблица.Вывести(ОбластьСтрока);
			ОбщаяСумма = ОбщаяСумма + стр.Сумма;
		КонецЦикла;
		
		
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ИтогоСумма = Формат(ОбщаяСумма, "ЧДЦ=2");
	Таблица.Вывести(ОбластьПодвал);
	Возврат Таблица   ;
	
КонецФункции

