#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.Предопределенный Тогда
		Если ЭтотОбъект.ПометкаУдаления Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(НСтр("ru = 'Удаление предопределенного элемента запрещено.'"));
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли