
#Область ПроцедурыИФункцииРаботыСоСчетамиИСубконто

Процедура НачалоВыбораЗначенияСубконто(Форма, Элемент, СтандартнаяОбработка, СписокПараметров) Экспорт
	
	ДанныеСчета = бит_БухгалтерскийУчетСервер.ПолучитьСвойстваСчета(СписокПараметров.СчетУчета);
	
	Организация = СписокПараметров.Организация;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
			
			// БИТ_ЖКХ_31102013_начало_изменений
			// ТипЗначенияСубконто = ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"].ПривестиЗначение();.
			ТипЗначенияСубконто = ТипЗнч(ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"].ПривестиЗначение());
			// БИТ_ЖКХ_31102013_окончание_изменений
			
			Если ТипЗначенияСубконто = Тип("СправочникСсылка.БанковскиеСчета")
				И ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"] = Элемент.ОграничениеТипа Тогда
				
				СтандартнаяОбработка = Ложь;
				ФормаВыбора          = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент,);
				ФормаВыбора.ПараметрОтборПоВладельцу = Организация;
				ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
				
			ИначеЕсли ТипЗначенияСубконто = Тип("СправочникСсылка.ПодразделенияОрганизаций")
				И ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"] = Элемент.ОграничениеТипа Тогда
				
				СтандартнаяОбработка = Ложь;
				ФормаВыбора          = Справочники.ПодразделенияОрганизаций.ПолучитьФормуВыбора(,Элемент,);
				ФормаВыбора.ПараметрОтборПоВладельцу = Организация;
				ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
				
			ИначеЕсли ТипЗначенияСубконто = Тип("СправочникСсылка.ДоговорыКонтрагентов")
				И ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"] = Элемент.ОграничениеТипа Тогда
				
				СтандартнаяОбработка = Ложь;
				ФормаВыбора          = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(,Элемент,);
				
				Если Организация <> Неопределено Тогда
					ФормаВыбора.СправочникСписок.Отбор.Организация.Значение      = Организация.ГоловнаяОрганизация;
					ФормаВыбора.СправочникСписок.Отбор.Организация.Использование = Истина;
					ФормаВыбора.СправочникСписок.Отбор.Организация.ВидСравнения  = ВидСравнения.Равно;
					
					ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Организация.Доступность = Ложь;
				КонецЕсли;
				
				Если ТипЗнч(СписокПараметров) = Тип("Структура") Тогда
					
					Если СписокПараметров.Свойство("Контрагент") Тогда
						
						Если ТипЗнч(СписокПараметров.Контрагент) =  Тип("СправочникСсылка.Контрагенты") Тогда
							
							ФормаВыбора.СправочникСписок.Отбор.Владелец.Значение      = СписокПараметров.Контрагент;
							ФормаВыбора.СправочникСписок.Отбор.Владелец.Использование = Истина;
							ФормаВыбора.СправочникСписок.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
							
							ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗначенияСубконто = Тип("ДокументСсылка.Партия")
				И ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"] = Элемент.ОграничениеТипа Тогда
				
				СтандартнаяОбработка        = Ложь;
				ФормаВыбора                 = Документы.Партия.ПолучитьФормуВыбора(,Элемент,);
				ФормаВыбора.мТипыДокументов = Элемент.ОграничениеТипа; 
				ФормаВыбора.Организация     = Организация;
				
				Если ТипЗнч(СписокПараметров) = Тип("Структура") Тогда
					
					ФормаВыбора.Счет         = ?(СписокПараметров.Свойство("СчетУчета")		, СписокПараметров.СчетУчета	, Неопределено);
					ФормаВыбора.Номенклатура = ?(СписокПараметров.Свойство("Номенклатура")	, СписокПараметров.Номенклатура	, Неопределено);
					ФормаВыбора.Склад        = ?(СписокПараметров.Свойство("Склад")			, СписокПараметров.Склад		, Неопределено);
					
					Если СписокПараметров.Свойство("ЭтоНовыйДокумент")Тогда 
						Если СписокПараметров.ЭтоНовыйДокумент Тогда
							ФормаВыбора.КонПериода = КонецДня(РабочаяДата);
						Иначе
							ФормаВыбора.КонПериода = ?(СписокПараметров.Свойство("Дата"), СписокПараметров.Дата, Неопределено);
						КонецЕсли;
					Иначе
						ФормаВыбора.КонПериода = Неопределено; 
					КонецЕсли;
					
					Если СписокПараметров.Свойство("ВидСубконто") Тогда
						ФормаВыбора.ВидСубконто  = СписокПараметров.ВидСубконто;
					ИначеЕсли ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"] = Элемент.ОграничениеТипа Тогда
						ФормаВыбора.ВидСубконто  = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии;
					КонецЕсли;
					
				КонецЕсли;
			ИначеЕсли ТипЗначенияСубконто = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом")
				И ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"] = Элемент.ОграничениеТипа Тогда
				
				СтандартнаяОбработка = Ложь;
				
				СтруктураПараметров  = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, КонецПериода, СчетДляОпределенияОстатков, СторонаСчета");
				
				Если ТипЗнч(СписокПараметров) = Тип("Структура") Тогда
					
					СтруктураПараметров.Вставить("Организация", Организация);
					
					Если СписокПараметров.Свойство("Контрагент") Тогда
						СтруктураПараметров.Вставить("Контрагент", СписокПараметров.Контрагент);
					КонецЕсли;
					
					Если СписокПараметров.Свойство("ДоговорКонтрагента") Тогда
						СтруктураПараметров.Вставить("ДоговорКонтрагента", СписокПараметров.ДоговорКонтрагента);
					КонецЕсли;
					
					Если СписокПараметров.Свойство("Дата") Тогда
						Если ТипЗнч(СписокПараметров.Дата) = Тип("Дата") Тогда
							СтруктураПараметров.Вставить("КонецПериода", СписокПараметров.Дата - 1);
						КонецЕсли;
					КонецЕсли;
					
					Если СписокПараметров.Свойство("СчетУчета") Тогда
						СтруктураПараметров.Вставить("СчетДляОпределенияОстатков", СписокПараметров.СчетУчета);
					КонецЕсли;
					
					Если СписокПараметров.Свойство("СторонаПроводки") Тогда
						СтруктураПараметров.Вставить("СторонаСчета", ?(СписокПараметров.СторонаПроводки = "Дт", 1, 0));
					КонецЕсли;
					
					Если СписокПараметров.Свойство("ЭтоНовыйДокумент") Тогда
						СтруктураПараметров.Вставить("ЭтоНовыйДокумент", СписокПараметров.ЭтоНовыйДокумент);
					КонецЕсли;
					
				КонецЕсли;
				
				// БИТ_ЖКХ 30.03.2015{{
				//УправлениеВзаиморасчетами.ВыборРасчетногоДокумента(СтруктураПараметров, Элемент, Элемент.ОграничениеТипа);
				УчетВзаиморасчетовКлиент.ВыборРасчетногоДокумента(СтруктураПараметров, Элемент, Элемент.ОграничениеТипа);
				// БИТ_ЖКХ 30.03.2015}}
				
				Возврат;
				
			ИначеЕсли ТипЗначенияСубконто = Тип("ДокументСсылка.ПартияМатериаловВЭксплуатации") Тогда
				
				СтандартнаяОбработка = Ложь;
				ФормаВыбора          = Документы.ПартияМатериаловВЭксплуатации.ПолучитьФормуВыбора(,Элемент,);
				
				Если ТипЗнч(СписокПараметров) = Тип("Структура") Тогда
					ФормаВыбора.Номенклатура = СписокПараметров.Номенклатура;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СтандартнаяОбработка Тогда 
			ФормаВыбора.Открыть();
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
