
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ЗначенияПолей);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТСЖПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредседательПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтролирующийОрганПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаСозданияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗначенияПолей = Новый Структура;
	ЗначенияПолей.Вставить("ТСЖ"                , ТСЖ);
	ЗначенияПолей.Вставить("ДатаСоздания"       , ДатаСоздания);
	ЗначенияПолей.Вставить("Председатель"       , Председатель);
	ЗначенияПолей.Вставить("КонтролирующийОрган", КонтролирующийОрган);
	
	// БИТ_ЖКХ 10.04.2014
	ЗначенияПолей.Вставить("Период", Период);
	// БИТ_ЖКХ 10.04.2014
	Если Не Период  = Дата("00010101") Тогда
		Оповестить("ОбновитьИнформациюТСЖ", ЗначенияПолей, ЭтаФорма);
		
		Закрыть();
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните период");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти