
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемыКомпоновкиДанных.Параметры.УстановитьЗначениеПараметра("ТаблицаШаблонаГИСЖКХ", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		Объект.Наименование	= Объект.Наименование + " (Свой вариант)" ;
		Объект.Комментарий	= "Создано копированием.";
		
		ТекстСообщения = НСтр("ru = 'Для копирования схемы компоновки данных необходимо записать элемент справочника.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ЗначениеКопирования = Параметры.ЗначениеКопирования;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаШаблонаГИСЖКХ", ЗначениеКопирования);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_СКДТаблицГИСЖКХСрезПоследних.СхемаКомпоновкиДанных
		|ИЗ
		|	РегистрСведений.бит_СКДТаблицГИСЖКХ.СрезПоследних(, ТаблицаШаблонаГИСЖКХ = &ТаблицаШаблонаГИСЖКХ) КАК бит_СКДТаблицГИСЖКХСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Набор = РегистрыСведений.бит_СКДТаблицГИСЖКХ.СоздатьНаборЗаписей();
			Набор.Прочитать();
			Период = ТекущаяДата();
			
			НовыйНабор						= Набор.Добавить();
			НовыйНабор.Период				= Период;
			НовыйНабор.ТаблицаШаблонаГИСЖКХ	= ТекущийОбъект.Ссылка;
			НовыйНабор.Комментарий			= "Создано копированием.";
			НовыйНабор.Редактор				= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
			
			СКД = Выборка.СхемаКомпоновкиДанных.Получить();
			СхемаКомпоновкиДанных = бит_ОбщегоНазначенияКлиентСервер.ПодготовитьСхемуСКД(СКД);
			НовыйНабор.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
			
			Попытка
				Набор.Записать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка записи СКД. Таблица создана без схемы компоновки данных!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Таблица создана без схемы компоновки данных!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		ЗначениеКопирования = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ПустаяСсылка();
		
	КонецЕсли;
	
	СхемыКомпоновкиДанных.Параметры.УстановитьЗначениеПараметра("ТаблицаШаблонаГИСЖКХ", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗначенияЗаполнения = Новый Структура("ТаблицаШаблонаГИСЖКХ", Объект.Ссылка);
		ОткрытьФорму("РегистрСведений.бит_СКДТаблицГИСЖКХ.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Перед добавлением новой записи, необходимо сохранить новый элемент справочника.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
