
#Область ПодключениеСканера

Процедура ПодключитьСканер() Экспорт
	
    Массив=МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(,,МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	
	Для Каждого Стр из Массив Цикл
        Если Стр.ТипОборудования=ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СканерШтрихкода") Тогда
            Идентификатор = Стр.Ссылка;
            
        ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(Идентификатор);
                
        МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",,,Идентификатор,ПараметрыУстройства);
        КонецЕсли;
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти