
#Область ПроцедурыОбработчикиСобытий

// БИТ_ЖКХ Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		Эл                  = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ответственный");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		
		Эл.ПравоеЗначение   = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
		
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Ответственный", бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный"));
		
		Для Каждого Элемент Из Отбор Цикл
			
			СписокОбязательныхОтборов.Добавить(Элемент.Ключ);
			
		КонецЦикла;
		
КонецПроцедуры

// БИТ_ЖКХ Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ИмяОтбора Из СписокОбязательныхОтборов Цикл
		
		Для Каждого Элемент Из ЭтаФорма.Список.Отбор.Элементы Цикл
			
			Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора) Тогда
				
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
