#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Элемент не может быть записан!";
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ТекстСообщения  = ТекстСообщения + " Не заполнен статус физ. лица.";
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ);
	КонецЕсли;
	Если Не ЭтоНовый() тогда
		Если  Наименование <> Ссылка.Наименование
			ИЛИ НачислятьПоНорме <> Ссылка.НачислятьПоНорме 
			ИЛИ ПроживаниеВДанныйМомент <> Ссылка.ПроживаниеВДанныйМомент
			ИЛИ ПравоНаЛьготы <> Ссылка.ПравоНаЛьготы
			ИЛИ ПравоНаСубсидии <> Ссылка.ПравоНаСубсидии
			Тогда
			МассивДокументов = КритерииОтбора.бит_ДокументыПоСтатусуФизЛица.Найти(Ссылка);
			ЕстьПроведенныеДокументы = Ложь;
			
			Для каждого Документ из МассивДокументов Цикл
				
				ЕстьПроведенныеДокументы = Документ.Проведен;
				
				Если ЕстьПроведенныеДокументы тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьПроведенныеДокументы Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют документы, проведенные по статусу """ + Ссылка.Наименование + """.
				|Реквизиты ""Статус физ. лица"", ""Участвует в расчетах"", ""Право на льготы"", ""Право на субсидии"" не могут быть изменены.
				|Элемент не записан.");
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли