
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстовыйДокумент.УстановитьТекст(Параметры.Текст);
	ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("Текст"              , ТекстовыйДокумент.ПолучитьТекст());
	РезультатВыбора.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти