
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	ДатаНач = НачалоМесяца(ТекущаяДата());
	ДатаКон = КонецМесяца(ТекущаяДата());
    КолЛет = 14;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Попытка
		СформироватьНаСервере();
	Исключение	
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_СпискиПоНаселению"));
	РезультатЗапроса = СпискиПоНаселениюИнициализация();
	
	ОтчетОбъект.СпискиГражданПрописанныхВыписанныхВывести(ДатаНач, ДатаКон,КолЛет,Результат,РезультатЗапроса);
	
	
КонецПроцедуры

&НаСервере
Функция СпискиПоНаселениюИнициализация()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
		"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛС.Период,
	|	бит_ПроживающиеПоЛС.ФизЛицо,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица,
	|	ВЫБОР
	|		КОГДА (бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации = &ПустаяДата
	|				ИЛИ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации ЕСТЬ NULL )
	|				И (бит_ПроживающиеПоЛС.ДатаРегистрации = &ПустаяДата
	|					ИЛИ бит_ПроживающиеПоЛС.ДатаРегистрации ЕСТЬ NULL )
	|			ТОГДА ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|					ИНАЧЕ &ПустаяДата
	|				КОНЕЦ
	|		ИНАЧЕ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации
	|	КОНЕЦ КАК ДатаСнятияСРегистрации,
	|	ВЫБОР
	|		КОГДА (бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации = &ПустаяДата
	|				ИЛИ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации ЕСТЬ NULL )
	|				И (бит_ПроживающиеПоЛС.ДатаРегистрации = &ПустаяДата
	|					ИЛИ бит_ПроживающиеПоЛС.ДатаРегистрации ЕСТЬ NULL )
	|			ТОГДА ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ВременнаяРегистрация)
	|							ИЛИ бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация)
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|					ИНАЧЕ &ПустаяДата
	|				КОНЕЦ
	|		ИНАЧЕ бит_ПроживающиеПоЛС.ДатаРегистрации
	|	КОНЕЦ КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаЗаписи КАК ДатаОкончанияСтатуса,
	|	бит_ПроживающиеПоЛС.ФизЛицо.Пол,
	|	бит_ПроживающиеПоЛС.ФизЛицо.МестоРождения,
	|	бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения,
	|	бит_ПроживающиеПоЛС.СтатусПроживания,
	|	&ПустаяДата,
	|	бит_ПроживающиеПоЛС.Регистратор,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.Здание КАК Здание,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.Квартира КАК Квартира,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.Здание.Корпус КАК Корпус,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ &ДатаКон < бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения, &ДатаКон, МЕСЯЦ) / 12
	|	КОНЕЦ КАК КолЛет
	|ПОМЕСТИТЬ СписокФизЛиц
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|ГДЕ
	|	(ЕСТЬNULL(бит_ПроживающиеПоЛС.ДатаРегистрации, ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.ДатаРегистрации ЕСТЬ NULL 
	|							ИЛИ бит_ПроживающиеПоЛС.ДатаРегистрации = &ПустаяДата
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|				КОНЕЦ) >= &ДатаНач
	|			ИЛИ ЕСТЬNULL(бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации, ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации ЕСТЬ NULL 
	|							ИЛИ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации = &ПустаяДата
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|				КОНЕЦ) >= &ДатаНач
	|			ИЛИ бит_ПроживающиеПоЛС.Период >= &ДатаНач)
	|	И (бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация)
	|			ИЛИ бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан))
	|	И бит_ПроживающиеПоЛС.СтатусПроживания = ЗНАЧЕНИЕ(перечисление.бит_СтатусПроживания.Постоянно)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокФизЛиц.Регистратор,
	|	СписокФизЛиц.ЛицевойСчет,
	|	СписокФизЛиц.ФизЛицо,
	|	СписокФизЛиц.КолЛет,
	|	СписокФизЛиц.ФизЛицоДатаРождения КАК ДатаРождения,
	|	СписокФизЛиц.СтатусФизЛица КАК Статус,
	|	СписокФизЛиц.СтатусПроживания,
	|	СписокФизЛиц.ДатаРегистрации КАК ДатаРегистрации,
	|	СписокФизЛиц.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	СписокФизЛиц.ДатаОкончанияСтатуса,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид.КодПФР КАК Документ,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокСерия,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокНомер,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокКемВыдан,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокДатаВыдачи,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	СписокФизЛиц.ФизЛицоПол КАК ПолФизЛицо,
	|	СписокФизЛиц.ФизЛицоМестоРождения КАК МестоРождения,
	|	СписокФизЛиц.Улица,
	|	СписокФизЛиц.Здание,
	|	СписокФизЛиц.Корпус,
	|	СписокФизЛиц.Квартира
	|ИЗ
	|	СписокФизЛиц КАК СписокФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(
	|				&ДатаКон,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(
	|				&ДатаКон,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(
	|				&ДатаКон,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	(СписокФизЛиц.ДатаРегистрации >= &ДатаНач
	|				И СписокФизЛиц.ДатаРегистрации <= &ДатаКон
	|			ИЛИ СписокФизЛиц.ДатаСнятияСРегистрации >= &ДатаНач
	|				И СписокФизЛиц.ДатаСнятияСРегистрации <= &ДатаКон)
	|	И СписокФизЛиц.КолЛет >= &КолЛет
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписокФизЛиц.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокФизЛиц";         
	
	
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",ДатаКон);
	Запрос.УстановитьПараметр("КолЛет",КолЛет);
	Запрос.УстановитьПараметр("ПустаяДата",Дата('00010101'));

	 РезультатЗапроса = Запрос.Выполнить();
	 
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти