
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мКэшЗначений = Новый Структура;
	
	Заголовок = "Сведения об инвалидности: " + Запись.ФизЛицо.Наименование;
	
	мКэшЗначений.Вставить("мФизЛицо", Запись.ФизЛицо);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "Инвалидность"), Запись.ФизЛицо);
	
	Если мКэшЗначений.мФизЛицо <> Запись.ФизЛицо Тогда
		
        // Оповестим также форму того физлица, данные которого начинали редактировать.
		Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "Инвалидность"), мКэшЗначений.мФизЛицо);
		
		мКэшЗначений.мФизЛицо = Запись.ФизЛицо;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти