#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиРегистрацииФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.ПараметрыПериодовСтажаПФР.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.ПараметрыПериодовСтажаПФР.Измерения.ФизическоеЛицо.Имя;
КонецФункции

Процедура ДобавитьЗапросВТИсточникПервичныхДанных(ЧастиЗапроса, ИзмеренияОтбора, ИсточникДанных) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПараметрыПериодовСтажаПФР.Регистратор КАК Регистратор,
		|	ПараметрыПериодовСтажаПФР.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ПараметрыПериодовСтажаПФР.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПараметрыПериодовСтажаПФР.ТипДоговора КАК ТипДоговора,
		|	ПараметрыПериодовСтажаПФР.Начало КАК Начало,
		|	ПараметрыПериодовСтажаПФР.Окончание КАК Окончание,
		|	ПараметрыПериодовСтажаПФР.Приоритет КАК Приоритет,
		|	ПараметрыПериодовСтажаПФР.Сторно КАК Сторно,
		|	ПараметрыПериодовСтажаПФР.ДокументОснование КАК ДокументОснование,
		|	ПараметрыПериодовСтажаПФР.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	ПараметрыПериодовСтажаПФР.Сотрудник КАК Сотрудник,
		|	ПараметрыПериодовСтажаПФР.ВидСтажаПФР КАК ВидСтажаПФР,
		|	ПараметрыПериодовСтажаПФР.Должность КАК Должность,
		|	ПараметрыПериодовСтажаПФР.Подразделение КАК Подразделение,
		|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВидСтажаПФР КАК ИспользованиеРесурсаВидСтажаПФР,
		|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОрганизация КАК ИспользованиеРесурсаОрганизация,
		|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаПодразделение КАК ИспользованиеРесурсаПодразделение,
		|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаДолжность КАК ИспользованиеРесурсаДолжность,
		|	ПараметрыПериодовСтажаПФР.Организация КАК Организация,
		|	ПараметрыПериодовСтажаПФР.ВнутреннееСовместительство КАК ВнутреннееСовместительство,
		|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВнутреннееСовместительство КАК ИспользованиеРесурсаВнутреннееСовместительство
		|ПОМЕСТИТЬ ВТИсточникДанныхУчетаСтажаПФР
		|ИЗ
		|	РегистрСведений.ПараметрыПериодовСтажаПФР КАК ПараметрыПериодовСтажаПФР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияИзмерений КАК ИзменившиесяДанные
		|		ПО &УсловиеСвязиПараметрыПериодовСтажаПФР
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка),
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.Трудовой)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.ГражданскоПравовой)
		|	КОНЕЦ,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Работа),
		|	ЛОЖЬ,
		|	НЕОПРЕДЕЛЕНО,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема,
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПФР2014.ВключаетсяВСтажДляДосрочногоНазначенияПенсии),
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
		|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
		|	ЗНАЧЕНИЕ(Перечисление.ЗначениеРесурсаРегистровСостоянийСотрудника.Установлено),
		|	ЗНАЧЕНИЕ(Перечисление.ЗначениеРесурсаРегистровСостоянийСотрудника.Установлено),
		|	ЗНАЧЕНИЕ(Перечисление.ЗначениеРесурсаРегистровСостоянийСотрудника.Установлено),
		|	ЗНАЧЕНИЕ(Перечисление.ЗначениеРесурсаРегистровСостоянийСотрудника.Установлено),
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
		|	ВЫБОР
		|		КОГДА ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.ЗначениеРесурсаРегистровСостоянийСотрудника.Установлено)
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияИзмерений КАК ИзменившиесяДанные
		|		ПО &УсловиеСвязиТекущиеКадровыеДанныеСотрудников";
	
	Если ИзмеренияОтбора.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСвязиПараметрыПериодовСтажаПФР", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСвязиТекущиеКадровыеДанныеСотрудников", "ИСТИНА");
	Иначе
		УсловиеСвязиПараметрыПериодовСтажаПФР = Новый Массив;
		УсловиеСвязиТекущиеКадровыеДанныеСотрудников = Новый Массив;
		Разделитель = Символы.ПС + "И ";
		Для Каждого Измерение Из ИзмеренияОтбора Цикл
			УсловиеСвязиПараметрыПериодовСтажаПФР.Добавить(
				СтрШаблон("ПараметрыПериодовСтажаПФР.%1 = ИзменившиесяДанные.%1", Измерение));
			Если Измерение <> "ТипДоговора" Тогда
				УсловиеСвязиТекущиеКадровыеДанныеСотрудников.Добавить(
					СтрШаблон("ТекущиеКадровыеДанныеСотрудников.%1 = ИзменившиесяДанные.%1", Измерение));
			КонецЕсли;
		КонецЦикла;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСвязиПараметрыПериодовСтажаПФР",
			СтрСоединить(УсловиеСвязиПараметрыПериодовСтажаПФР, Разделитель));
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСвязиТекущиеКадровыеДанныеСотрудников",
			СтрСоединить(УсловиеСвязиТекущиеКадровыеДанныеСотрудников, Разделитель));
	КонецЕсли;
	
	ИсточникДанных = "ВТИсточникДанныхУчетаСтажаПФР";
	ЧастиЗапроса.Добавить(ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли