
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
	Этаформа.Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
 РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ЗаполнениеПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере(ЭтотОбъект.Элементы.Список.ТекущиеДанные.ИмяПоляExcel);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере(НачальноеПоле)
	
 НаборЗаписей = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьНаборЗаписей(); 
 НаборЗаписей.Прочитать();
 
 таблицаНабора = НаборЗаписей.Выгрузить();
 таблицаНабора.Сортировать("НомерПоляExcel");
 
 Пересчитывать = ложь;
 НачальныйНомер = 0;
 для каждого стр из таблицаНабора цикл
	 
	 если стр.ИмяПоляExcel = НачальноеПоле тогда	 		 
		
		Пересчитывать = истина;
        НачальныйНомер = стр.НомерПоляExcel;
		НовыйНомер = стр.НомерПоляExcel + 1;
 
	 конецесли;	 
	 
	 если Пересчитывать = истина тогда
	    стр.НомерПоляExcel = НовыйНомер;//стр.НомерПоляExcel + 1;				
		НовыйНомер = НовыйНомер + 1;
	 конецесли;	
	 
 конеццикла;
 
 Построитель = Новый ПостроительЗапроса;
 Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(таблицаНабора);
 
 тОтбор = Построитель.Отбор.Добавить("НомерПоляExcel");
 тОтбор.ВидСравнения = ВидСравнения.Больше;
 тОтбор.Значение = НачальныйНомер;
 тОтбор.Использование = Истина;
 
 Построитель.Выполнить();
 ТабРезультат = Построитель.Результат.Выгрузить();
 
 для каждого стр из ТабРезультат цикл 
	 
	  НаборЗаписей.Отбор.ИмяПоляExcel.Установить(стр.ИмяПоляExcel);	  
      НаборЗаписей.Прочитать();

      если НаборЗаписей.Количество() > 0 тогда
	    НаборЗаписей[0].НомерПоляExcel = стр.НомерПоляExcel; 
	    НаборЗаписей.Записать();
      конецесли;

 конеццикла;

 Этаформа.Элементы.Список.Обновить();
  
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок = "Сохранить настройки в файл";
	ДиалогВыбораФайла.Фильтр    = "XML (*.xml)|*.xml|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		СохранитьНаСервере(ДиалогВыбораФайла.ПолноеИмяФайла);		
	КонецЕсли;

	КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(ИмяФайла)
	РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ЗаписатьДанныеВФорматеXML(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Загрузка настройки из файла";
	ДиалогВыбораФайла.Фильтр    = "XML (*.xml)|*.xml|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ЗагрузитьНаСервере(ДиалогВыбораФайла.ПолноеИмяФайла);		
	КонецЕсли;	
	Этаформа.Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ИмяФайла)
	РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ПрочитатьДанныеВФорматеXML(ИмяФайла)
КонецПроцедуры
