 
#Область ПроцедурыИФункцииОбщегоНазначения
 
 // Процедура установки отбора.
 //
 &НаКлиенте
 Процедура ОтборИВыборПоВладельцу()
	 
	 ЭтаФорма.Список.Отбор.Элементы.Очистить();
	 ЭтаФорма.Дерево.Отбор.Элементы.Очистить();
	 
	 Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		 Если Строка(ЭтаФорма.ВладелецФормы) = "ТабличноеПоле" Тогда
			 
			 Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			 
			 Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			 Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			 Эл.ПравоеЗначение   = ЭтаФорма.ВладелецФормы.ТекущаяСтрока;
			 Эл.Использование    = Истина;
			 
			 Эл = ЭтаФорма.Дерево.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			 
			 Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			 Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			 Эл.ПравоеЗначение   = ЭтаФорма.ВладелецФормы.ТекущаяСтрока;
			 Эл.Использование    = Истина;
			 
			 Организация = ЭтаФорма.ВладелецФормы.ТекущаяСтрока;
		 Иначе
			 
			 Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			 
			 Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			 Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			 Эл.ПравоеЗначение   = ЭтаФорма.ВладелецФормы.Ссылка;
			 Эл.Использование    = Истина;
			 
			 Эл = ЭтаФорма.Дерево.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			 
			 Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			 Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			 Эл.ПравоеЗначение   = ЭтаФорма.ВладелецФормы.Ссылка;
			 Эл.Использование    = Истина;
			 
			 Организация = ЭтаФорма.ВладелецФормы.Ссылка;
			 
		 КонецЕсли;
	 Иначе
		 
		 Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 
		 Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
		 Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		 Эл.ПравоеЗначение   = Организация;
		 Эл.Использование    = Истина;
		 
		 Эл = ЭтаФорма.Дерево.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 
		 Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
		 Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		 Эл.ПравоеЗначение   = Организация;
		 Эл.Использование    = Истина;
		 
	 КонецЕсли;
	 
 КонецПроцедуры
 
 // Процедура обновляет заголовок формы по выбранному владельцу справочника.
 //
 // Параметры: 
 //  Нет.
 //
 // Возвращаемое значение:
 //  Нет.
 //
 Процедура ОбновитьЗаголовок()
	 
	 Заголовок = "Список подразделений организации " + Организация.Наименование;
	 
 КонецПроцедуры // ОбновитьЗаголовок()
 
#КонецОбласти
 
#Область ПроцедурыОбработчикиСобытийЭлементовФормы
 
 //  Процедура - обработчик события "ПриИзменении" поля ввода "Организация".
 // 
 &НаКлиенте
 Процедура ОрганизацияПриИзменении(Элемент)
	 Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		 
		 ЭтаФорма.Список.Отбор.Элементы[0].ПравоеЗначение = Организация;	
		 ЭтаФорма.Дерево.Отбор.Элементы[1].ПравоеЗначение = Организация;	
	 Иначе
		 ОтборИВыборПоВладельцу();
	 КонецЕсли;
	 ОбновитьЗаголовок();
	 
 КонецПроцедуры
 
#КонецОбласти
 
#Область ПроцедурыОбработчикиСобытийФормы

 // Процедура - обработчик события "ПриОткрытии" формы.
 &НаКлиенте
 Процедура ПриОткрытии(Отказ)
	 // Проставляем организацию пользователя по умолчанию.
	 Если Организация.Пустая() Тогда
		 
		 Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
		 
	 КонецЕсли;
	 
	 ОтборИВыборПоВладельцу();	
	 ОбновитьЗаголовок();
	 
 КонецПроцедуры
 // БИТ_ЖКХ_21112013_окончание_изменений
 
#КонецОбласти