
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаУстановкаРаспределенияНеВСписке") Тогда
		
	    Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.НеВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаУстановкаРаспределенияНеВСписке.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаУстановкаРаспределенияВСписке") Тогда
		
	    Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаУстановкаРаспределенияВСписке.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти