
#Область ДействияКомандФорм

&НаКлиенте
Процедура ВыходИзТСЖ(Команда)
	ОткрытьФормуНовогоДокумента(Команда.Имя);
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОткрытьФормуНовогоДокумента(ИмяВидаОперации)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииЗаявлениеТСЖ." + ИмяВидаОперации);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации", ВидОперации));
	ОткрытьФорму("Документ.бит_ЗаявлениеТСЖ.Форма.ФормаДокумента", СтруктураПараметры, Элементы.Список);
	
КонецПроцедуры // ()

#КонецОбласти