
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СисИнфо = Новый СистемнаяИнформация;
	Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.3" Тогда
		Элементы.ИскатьПо.КнопкаВыпадающегоСписка = Истина;
		Элементы.СвязьПоВладельцу.КнопкаВыпадающегоСписка = Истина;
	КонецЕсли;
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)
	
	ОповеститьОВыборе(Новый Структура("Источник, Результат, ИскатьПо, СвязьПоВладельцу, СвязьПоТипу", 
		"ФормаРедактированияСвязи", Истина, ИскатьПо, СвязьПоВладельцу, СвязьПоТипу));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.СвязьПоВладельцу.Видимость = ИспользоватьВладельца;
	Элементы.СвязьПоТипу.Видимость = ИспользоватьТипы;
КонецПроцедуры

#КонецОбласти
