
#Область ДействияКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	// БИТ_ЖКХ 17.11.2014{{
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		// БИТ_ЖКХ_30012014_начало_изменений
		// Результат = Документы.бит_СвидетельствоОРегистрацииПоМестуПроживания.Печать(ТекущаяСтрока.Ссылка);.
		Результат = ПолучитьРезультат(ТекущаяСтрока.Ссылка);
		// БИТ_ЖКХ_30012014_окончание_изменений
		
		Если Результат.НетОшибок Тогда
			АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат.ТабДокумент, АдресТабличногоДокументаВоВременномХранилище);
			
			бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
			,"бит_СвидетельствоОРегистрацииПоМестуПроживания"
			,"СОРПМЖ"
			,"Ф6:Свидетельство о регистрации по месту проживания"
			
			,АдресТабличногоДокументаВоВременномХранилище
			
			,ТекущаяСтрока.Ссылка);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
		КонецЕсли; 
		
	КонецЕсли; 
	// БИТ_ЖКХ 17.11.2014}}
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// БИТ_ЖКХ_30012014_начало_изменений
&НаСервере
Функция ПолучитьРезультат(Знач Ссылка)
	
	Возврат Документы.бит_СвидетельствоОРегистрацииПоМестуПроживания.Печать(Ссылка);
	
КонецФункции
// БИТ_ЖКХ_30012014_окончание_изменений

#КонецОбласти