
#Область ПеременныеМодуля

&НаКлиенте
Перем БылВопросБанковскиеСчета; //Флаг БылВопросШаблоны.

#КонецОбласти


#Область ПроцедурыИФункцииОбщегоНазначения

// Функция возвращает контрагента на лицевом счете.
//
&НаСервере
Функция ПолучитьКонтрагентаЛицевогоСчета(Знач Дата, Знач ЛицевойСчет)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ОтветственныеЛицаПоКУСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Контрагент;
		
	Иначе
		
		Возврат Справочники.Контрагенты.ПустаяСсылка();
		
	КонецЕсли; 
	
КонецФункции

// Функция возвращает счет кт. 
//
&НаСервере
Функция ПолучитьСчет(Знач Организация)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетАбонента
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"        , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация" , Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.СчетАбонента) Тогда
			
			СубконтоКонтрагент = Выборка.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
			
			Если СубконтоКонтрагент = Неопределено Тогда
				
				Возврат Выборка.ТранзитныйСчетОплаты;
				
			Иначе
				
				Возврат Выборка.СчетАбонента;
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.ТранзитныйСчетОплаты) Тогда
			
			Возврат Выборка.ТранзитныйСчетОплаты;
			
		Иначе
			
			Возврат ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			
		КонецЕсли; 
		
	Иначе
		
		Возврат ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		
	КонецЕсли; 
	
КонецФункции

// Процедура выполняет обновление Дерева значений.
// 
&НаСервере
Процедура ОбновитьДерево()
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	ДеревоПКОМ.Строки.Очистить();
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ВводПКО"));
	
	Для каждого Строка Из Объект.ОплатыКУ Цикл
		
		ОбработкаОбъект.ЗаполнитьДеревоПКО(Строка.ДокументОплаты, ДеревоПКОМ, Элементы.ДеревоПКО);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПКОНаСервере(ЭлементМассива)
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ВводПКО"));
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	ОбработкаОбъект.ЗаполнитьДеревоПКО(ЭлементМассива, ДеревоПКОМ, Элементы.ДеревоПКО);
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИЗаполнитьПКОНаСервере(ЭтоПоступлениеНаРасчетныйСчет, СтрокаТЧ, Оплата, ДокументЗаписан, РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых, БанковскийСчет, ИсточникОплаты);
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		ПлатежныйДокумент = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
		//31.07.2019
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "НомерДок") = истина тогда
    	 ПлатежныйДокумент.НомерВходящегоДокумента = СтрокаТЧ.НомерДок;
	     ПлатежныйДокумент.ДатаВходящегоДокумента = Оплата.Дата; 
		конецесли; 		
		
	ИначеЕсли ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		ПлатежныйДокумент = Документы.ОплатаПлатежнойКартой.СоздатьДокумент(); 
		
	Иначе
		ПлатежныйДокумент = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	КонецЕсли;
	
	ЗаполнитьПКО(ПлатежныйДокумент, СтрокаТЧ, Оплата, ДокументЗаписан, РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых
				,БанковскийСчет, ИсточникОплаты);
	
	Возврат ПлатежныйДокумент;
	
КонецФункции


&НаСервере
Функция ПолучитьИЗаполнитьСчетНаСервере(ПлатежныйДокумент,СтрокаТЧ, Оплата, СчетЗаписан, РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых, БанковскийСчет, ИсточникОплаты)

	Счет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	ЗаполнитьСчетНаСервере(Счет,ПлатежныйДокумент,СтрокаТЧ,Оплата,СчетЗаписан,РазбиватьПоЛицевымСчетам,ТранзитныйСчетОплаты,ПрименениеУСН,СуммаПринимаемых,БанковскийСчет,ИсточникОплаты);
	Возврат Счет 

КонецФункции

&НаСервере
Процедура ПолучитьПодстроки(Дерево)
	Для Каждого Подстрока Из Дерево.Строки Цикл
		
		Подстрока.Выбор = Ложь;
		// Обработка подстроки. 
		ПолучитьПодстроки(Подстрока);
		
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура СформироватьДеревоПКОНаСервере()
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	ПолучитьПодстроки(ДеревоПКОМ);	
	
	Для каждого СтрокаТЧ Из Объект.ОплатыКУ Цикл
		
		ОтсутствуетУслуга = Ложь;
		
		ТекстУслуги = "";	
		
		Для каждого стрУслуги из СтрокаТЧ.ДокументОплаты.СписокУслуг Цикл
			Если НЕ ЗначениеЗаполнено(стрУслуги.Услуга.Номенклатура) Тогда
				ТекстУслуги = СтрЗаменить(ТекстУслуги, Символы.ПС + Строка(стрУслуги.Услуга),"") + Символы.ПС + Строка(стрУслуги.Услуга);
				ОтсутствуетУслуга = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтсутствуетУслуга И СтрокаТЧ.СоздаватьСчета Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнена номенклатура в услугах:" + ТекстУслуги + Символы.ПС + "Без номенклатуры документы счетов и оплат для "+ СтрокаТЧ.ДокументОплаты +" не будут созданы!");
			Продолжить;	
			
		КонецЕсли;

		
		Оплата = СтрокаТЧ.ДокументОплаты;
		
		ПервыйУровень = ДеревоПКОМ.Строки.Найти(СтрокаТЧ.ДокументОплаты,"ПриходныйКассовыйОредер");
		
// Первый БИТ + --------------------------	
		//ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(Оплата.Организация, Оплата.Дата);
		ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(СтрокаТЧ.Организация, Оплата.Дата);
// Первый БИТ - --------------------------	
		
		Если ПервыйУровень = Неопределено Тогда
			
			ПервыйУровень = ДеревоПКОМ.Строки.Добавить();
			
			ПервыйУровень.ПриходныйКассовыйОредер = Оплата;
			ПервыйУровень.Выбор                   = Истина;
			
		КонецЕсли; 
		
		СписокЛС =  СтрокаТЧ.ДокументОплаты.СписокЛС;
		
		МассивНезаполненныхУслуг = Новый Массив();		
		
		ТранзитныйСчетОплаты = ПолучитьСчет(СтрокаТЧ.Организация);
		
		Если НЕ ЗначениеЗаполнено(ТранзитныйСчетОплаты) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Отказ = Ложь;
		
		ТаблицаУСН = ?(ПрименениеУСН, ПолучитьТаблицуУСН(Оплата),Неопределено);
		
		Если СтрокаТЧ.РазбиватьПоЛицевымСчетам Тогда
			
			//ТЗСписокЛС = СписокЛС.Выгрузить(,"ЛицевойСчет, НомерДок, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет" 
			//			+ ", Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, Сумма"
			//			+ ", СчетАбонента, СчетКУ, Услуга");
			//ТЗСписокЛС.Свернуть("ЛицевойСчет, НомерДок, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет" 
			//			+ ", Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3"
			//			+ ", СчетАбонента, СчетКУ, Услуга"
			//			, "Сумма");			

			ТЗСписокЛС = СписокЛС.Выгрузить(,"НомерДок, ЛицевойСчет, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет" 
						+ ", Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, Сумма"
						+ ", СчетАбонента, СчетКУ, Услуга");

			// БИТ ЖКХ 28.01.2020			
            ТЗСписокЛС = СвернутьПоЛицевымСчетам(ТЗСписокЛС);
						
						
			ТЗСписокЛС.Свернуть("НомерДок, ЛицевойСчет, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет" 
						+ ", Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3"
						+ ", СчетАбонента, СчетКУ, Услуга"
						, "Сумма");
			
			
			//// Одинаковы ЛС, должны идти с одинаковыми договорами в Оплате КУ или разноситься в разные документы.
			//ТЗСписокЛС.Индексы.Добавить("ЛицевойСчет");
			//ТаблицаПовторов =  ТЗСписокЛС.Скопировать(, "ЛицевойСчет, Сумма");
			//ТаблицаПовторов.ЗаполнитьЗначения(1, "Сумма");
			//ТаблицаПовторов.Свернуть("ЛицевойСчет", "Сумма");
			//Ошибки = Неопределено;
			//Для Каждого Стр Из ТаблицаПовторов Цикл
			//	Если Стр.Сумма > 1 Тогда
			//		ТекстОшибки = НСтр("ru = 'Для лицевого счета %1 не создан платежный документ!
			//								|""%2"", содержит несколько оплат по лицевому счету %1, с разными договорами.'");
			//		ТекстОшибки = СтрШаблон(ТекстОшибки, Стр.ЛицевойСчет, СтрокаТЧ.ДокументОплаты);
			//		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки, "");
			//		
			//		ПараметрыОтбора = Новый Структура("ЛицевойСчет", Стр.ЛицевойСчет);
			//		МассивДляУдаления = ТЗСписокЛС.НайтиСтроки(ПараметрыОтбора);
			//		
			//		Для Каждого Элт Из МассивДляУдаления Цикл
			//			ТЗСписокЛС.Удалить(Элт);
			//		КонецЦикла;
			//		
			//	КонецЕсли;
			//КонецЦикла;
			//ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
			
			Для каждого СтрокаЛС Из ТЗСписокЛС Цикл
				
				ПроверитьПовторныйВводДокумента(Отказ, Оплата);
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаПринимаемых = ПолучитьСуммуПолучаемых(ТаблицаУСН, СтрокаЛС.ЛицевойСчет);
				
				ДокументЗаписан = Ложь;
				
				СчетЗаписан = Ложь;
				
				ПлатежныйДокумент = ПолучитьИЗаполнитьПКОНаСервере(ЭтоПоступлениеНаРасчетныйСчет, СтрокаЛС, Оплата, ДокументЗаписан
				,СтрокаТЧ.РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН
				,СуммаПринимаемых, СтрокаТЧ.БанковскийСчет, СтрокаТЧ.ИсточникОплаты); 				
				
				Если ДокументЗаписан Тогда
					
					Если СтрокаТЧ.СоздаватьСчета Тогда
					
					СчетДокумент = ПолучитьИЗаполнитьСчетНаСервере(ПлатежныйДокумент,СтрокаЛС, Оплата, СчетЗаписан
					,СтрокаТЧ.РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН
					,СуммаПринимаемых, СтрокаТЧ.БанковскийСчет, СтрокаТЧ.ИсточникОплаты);
					
					Если СчетЗаписан Тогда
						
						//08.08.2019
						ПерезаполнитьРасшифровкуПоступленияПоСчету(ПлатежныйДокумент, СчетДокумент);
					
						ВторойУровень = ПервыйУровень.Строки.Добавить();
						
						ВторойУровень.Выбор                    = Истина;
						ВторойУровень.ПриходныйКассовыйОредер  = СчетДокумент.Ссылка;
						ВторойУровень.Сумма                    = СчетДокумент.СуммаДокумента;
						ВторойУровень.ЛицевойСчет              = СтрокаЛС.ЛицевойСчет;
						ВторойУровень.Этоновый                 = СчетДокумент.ЭтоНовый();
						ВторойУровень.СчетУчета                = Объект.СчетКасса;
						ВторойУровень.СтатьяДвиженийДенСредств = Объект.СтатьяДвиженияДенежныхСредств;
						
						мСписокИсключений.Добавить(СчетДокумент.Ссылка);
						
						ТретийУровень = ВторойУровень.Строки.Добавить();
						
						ТретийУровень.Выбор                    = Истина;
						ТретийУровень.ПриходныйКассовыйОредер  = ПлатежныйДокумент.Ссылка;
						ТретийУровень.Сумма                    = ПлатежныйДокумент.СуммаДокумента;
						ТретийУровень.ЛицевойСчет              = СтрокаЛС.ЛицевойСчет;
						ТретийУровень.Этоновый                 = ПлатежныйДокумент.ЭтоНовый();
						ТретийУровень.СчетУчета                = Объект.СчетКасса;
						ТретийУровень.СтатьяДвиженийДенСредств = Объект.СтатьяДвиженияДенежныхСредств;
						
						
						мСписокИсключений.Добавить(ПлатежныйДокумент.Ссылка);
						
						
					КонецЕсли;
					
					
				Иначе	
					
					ВторойУровень = ПервыйУровень.Строки.Добавить();
					
					ВторойУровень.Выбор                    = Истина;
					ВторойУровень.ПриходныйКассовыйОредер  = ПлатежныйДокумент.Ссылка;
					ВторойУровень.Сумма                    = ПлатежныйДокумент.СуммаДокумента;
					ВторойУровень.ЛицевойСчет              = СтрокаЛС.ЛицевойСчет;
					ВторойУровень.Этоновый                 = ПлатежныйДокумент.ЭтоНовый();
					ВторойУровень.СчетУчета                = Объект.СчетКасса;
					ВторойУровень.СтатьяДвиженийДенСредств = Объект.СтатьяДвиженияДенежныхСредств;
					
					мСписокИсключений.Добавить(ПлатежныйДокумент.Ссылка);	
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
			
		Иначе
			
			ПроверитьПовторныйВводДокумента(Отказ, Оплата);
			
			Если Отказ Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ДокументЗаписан = Ложь;
			
			СчетЗаписан = Ложь;
			
			СуммаПринимаемых = ПолучитьСуммуПолучаемых(ТаблицаУСН);
			
			ПлатежныйДокумент = ПолучитьИЗаполнитьПКОНаСервере(ЭтоПоступлениеНаРасчетныйСчет, СтрокаТЧ, Оплата, ДокументЗаписан
			,СтрокаТЧ.РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН
			,СуммаПринимаемых, СтрокаТЧ.БанковскийСчет, СтрокаТЧ.ИсточникОплаты);
			
			
			Если ДокументЗаписан Тогда
				
				Если СтрокаТЧ.СоздаватьСчета Тогда
					
					СчетДокумент = ПолучитьИЗаполнитьСчетНаСервере(ПлатежныйДокумент,СтрокаЛС, Оплата, СчетЗаписан
					,СтрокаТЧ.РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН
					,СуммаПринимаемых, СтрокаТЧ.БанковскийСчет, СтрокаТЧ.ИсточникОплаты);
					
					Если СчетЗаписан Тогда
						
						//08.08.2019
						ПерезаполнитьРасшифровкуПоступленияПоСчету(ПлатежныйДокумент, СчетДокумент);
						
						ВторойУровень = ПервыйУровень.Строки.Добавить();
						
						ВторойУровень.Выбор                    = Истина;
						ВторойУровень.ПриходныйКассовыйОредер  = СчетДокумент.Ссылка;
						ВторойУровень.Сумма                    = СчетДокумент.СуммаДокумента;
						ВторойУровень.Этоновый                 = СчетДокумент.ЭтоНовый();
						ВторойУровень.СчетУчета                = Объект.СчетКасса;
						ВторойУровень.СтатьяДвиженийДенСредств = Объект.СтатьяДвиженияДенежныхСредств;
						
						ТретийУровень = ВторойУровень.Строки.Добавить();
						
						ТретийУровень.Выбор                    = Истина;
						ТретийУровень.ПриходныйКассовыйОредер  = ПлатежныйДокумент.Ссылка;
						ТретийУровень.Сумма                    = ПлатежныйДокумент.СуммаДокумента;
						ТретийУровень.Этоновый                 = ПлатежныйДокумент.ЭтоНовый();
						ТретийУровень.СчетУчета                = Объект.СчетКасса;
						ТретийУровень.СтатьяДвиженийДенСредств = Объект.СтатьяДвиженияДенежныхСредств;
						
					КонецЕсли;
					
				Иначе
					
					ВторойУровень = ПервыйУровень.Строки.Добавить();
					
					ВторойУровень.Выбор                    = Истина;
					ВторойУровень.ПриходныйКассовыйОредер  = ПлатежныйДокумент.Ссылка;
					ВторойУровень.Сумма                    = ПлатежныйДокумент.СуммаДокумента;
					ВторойУровень.Этоновый                 = ПлатежныйДокумент.ЭтоНовый();
					ВторойУровень.СчетУчета                = Объект.СчетКасса;
					ВторойУровень.СтатьяДвиженийДенСредств = Объект.СтатьяДвиженияДенежныхСредств;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПервыйУровень.Сумма = ПервыйУровень.Строки.Итог("Сумма");
		
		Если ПервыйУровень.Строки.Количество()= 0 Тогда
			
			ДеревоПКОМ.Строки.Удалить(ПервыйУровень);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
	ПровестиДеревоПКОНаСервере(ПрименениеУСН, СуммаПринимаемых);
	
КонецПроцедуры

функция СвернутьПоЛицевымСчетам(табИсходная)

  табЛC = табИсходная.Скопировать();
  табЛC.Свернуть("ЛицевойСчет");
  списокЛС = табЛC.ВыгрузитьКолонку("ЛицевойСчет");
  
  для каждого стр из списокЛС цикл
	  
	строкиЛС = табИсходная.Найти(стр, "ЛицевойСчет");  
	
	для каждого стрЛС из табИсходная цикл
	  если стрЛС.ЛицевойСчет = стр тогда 	
		стрЛС.ПлательщикБИК = строкиЛС.ПлательщикБИК; 
		стрЛС.ПлательщикИНН = строкиЛС.ПлательщикИНН;
		стрЛС.ПлательщикКПП = строкиЛС.ПлательщикКПП;
		стрЛС.ПлательщикСчет = строкиЛС.ПлательщикСчет;
		стрЛС.НомерДок = строкиЛС.НомерДок;		
	  конецесли;		
	конеццикла;	
	
  конеццикла;	  
  
  возврат табИсходная;
конецфункции	
	
//08.08.2019
Процедура ПерезаполнитьРасшифровкуПоступленияПоСчету(ПлатежныйДокумент, СчетДокумент)
	
   СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СчетДокумент.ВалютаДокумента, СчетДокумент.Дата);
   КурсДокумента           = СтруктураКурсаДокумента.Курс;
   КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
   Если НЕ ЗначениеЗаполнено(КурсДокумента) Тогда
	КурсДокумента       = 1;
	КратностьДокумента  = 1;
   КонецЕсли;
		
   ВалютаВзаиморасчетов = СчетДокумент.ДоговорКонтрагента.ВалютаВзаиморасчетов;
   СтруктураКурсаВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, СчетДокумент.Дата);
	
   ПлатежныйДокумент.РасшифровкаПлатежа.Очистить();
   ВалютаВзаиморасчетов = СчетДокумент.ДоговорКонтрагента.ВалютаВзаиморасчетов;	
   ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();

   ТаблицаПлатежей = ПлатежныйДокумент.РасшифровкаПлатежа.Выгрузить();
	
   ТаблицаСуммДокументаОснования = СтатусыДокументов.ТаблицаСуммКОплатеВРазрезеСтавокНДС(
				Новый Структура("Основание, ДатаОснования, Организация", СчетДокумент.Ссылка, СчетДокумент.Дата, СчетДокумент.Организация),
					УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(СчетДокумент.Ссылка));
   ТаблицаСуммДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
	
   ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаСуммДокументаОснования, ТаблицаПлатежей);
   Если ТаблицаПлатежей.Количество() = 0 Тогда
		ТаблицаПлатежей.Добавить();
   КонецЕсли;
   ТаблицаПлатежей.ЗаполнитьЗначения(ПлатежныйДокумент.ДоговорКонтрагента,                     "ДоговорКонтрагента");
   ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,      "КурсВзаиморасчетов");
   ТаблицаПлатежей.ЗаполнитьЗначения(Перечисления.СпособыПогашенияЗадолженности.Автоматически, "СпособПогашенияЗадолженности");
   ТаблицаПлатежей.ЗаполнитьЗначения(СчетДокумент, "Сделка");
   // БИТ ЖКХ 20.01.2020   
   Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПлатежныйДокумент, "СтатьяДвиженияДенежныхСредств") = истина тогда
    ТаблицаПлатежей.ЗаполнитьЗначения(ПлатежныйДокумент.СтатьяДвиженияДенежныхСредств, "СтатьяДвиженияДенежныхСредств");
   конецесли;
		
   ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"), "СуммаВзаиморасчетов");  
 
		
   Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
		ПроверкаКурсовВалют(СтрокаПлатеж, СчетДокумент.КурсВзаиморасчетов, СчетДокумент.КратностьВзаиморасчетов);
		Если СчетДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах Тогда
			Если СчетДокумент.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
				СтрокаПлатеж.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
					СтрокаПлатеж.СуммаПлатежа,
					ВалютаРегламентированногоУчета, СчетДокумент.ВалютаВзаиморасчетов,
					1, СчетДокумент.КурсВзаиморасчетов,
					1, СчетДокумент.КратностьВзаиморасчетов);
				СтрокаПлатеж.СуммаНДС            = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
					СтрокаПлатеж.СуммаНДС,
					ВалютаРегламентированногоУчета, СчетДокумент.ВалютаДокумента,
					1, СчетДокумент.КурсВзаиморасчетов,
					1, СчетДокумент.КратностьВзаиморасчетов);
			КонецЕсли;
			
			СтрокаПлатеж.СуммаПлатежа = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаПлатеж.СуммаВзаиморасчетов,
				СчетДокумент.ВалютаДокумента, ВалютаРегламентированногоУчета,
				СтрокаПлатеж.КурсВзаиморасчетов, 1,
				СтрокаПлатеж.КратностьВзаиморасчетов, 1);
			СтрокаПлатеж.СуммаНДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаПлатеж.СуммаНДС,
				СчетДокумент.ВалютаДокумента, ВалютаРегламентированногоУчета,
				СтрокаПлатеж.КурсВзаиморасчетов, 1,
				СтрокаПлатеж.КратностьВзаиморасчетов, 1);
		КонецЕсли;
   КонецЦикла;
	
   ТаблицаПлатежей.ЗаполнитьЗначения(СчетДокумент.Ссылка, "СчетНаОплату");			
   ПлатежныйДокумент.РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
	
   об = ПлатежныйДокумент.Ссылка.ПолучитьОбъект();
   об.РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);	
   //21.08.2019
   если ТипЗнч(ПлатежныйДокумент) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") тогда   
    для каждого стр из об.РасшифровкаПлатежа цикл
	 стр.СтатьяДвиженияДенежныхСредств = ПлатежныйДокумент.СтатьяДвиженияДенежныхСредств;    
    конеццикла;
   конецесли;

   об.СуммаДокумента = об.РасшифровкаПлатежа.Итог("СуммаПлатежа");
   //21.08.2019
   если ТипЗнч(ПлатежныйДокумент) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") тогда
    об.СтатьяДвиженияДенежныхСредств = ПлатежныйДокумент.СтатьяДвиженияДенежныхСредств; 
   конецесли;	
   СчетаУчетаВДокументах.ЗаполнитьПередОтображениемПользователю(об);

   об.Записать();
  
КонецПроцедуры
// Процедура заполняет дерево документов введеных на основании.
//
&НаКлиенте
Процедура Сформировать(Знач Оповещение)
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	мСписокИсключений.Очистить();
	
	Текст = "";
	
	Если Объект.ОплатыКУ.Количество() = 0 Тогда
		
		ВыполнитьОбработкуОповещения(Оповещение);
		Возврат;	
		
	КонецЕсли; 
	
	Текст = "Не заполнены реквизиты: ";
	
	Если НЕ ЗначениеЗаполнено(Объект.СчетКасса) 
		И НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		
		Текст = Текст + """Счет учета"" ";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Текст = Текст +"""Вид операции"" ";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств)
		И НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		
		Текст = Текст +"""Статья движения ден. средств"" ";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОплаты)
		И ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		
		Текст = Текст +"""Вид оплаты"" ";
		
	КонецЕсли;
	
	Текст = Текст + ". Продолжить?";
	
	Если (НЕ ЗначениеЗаполнено(Объект.СчетКасса) И НЕ ЭтоПоступлениеНаРасчетныйСчет = 2)
		ИЛИ (НЕ ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) И НЕ ЭтоПоступлениеНаРасчетныйСчет = 2) 
		ИЛИ (НЕ ЗначениеЗаполнено(Объект.ВидОплаты) И ЭтоПоступлениеНаРасчетныйСчет = 2)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), Текст, РежимДиалогаВопрос.ДаНет);
        Возврат; 
		
	КонецЕсли; 
	
	СформироватьФрагмент(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        
        ВыполнитьОбработкуОповещения(Оповещение);
        Возврат;
        
    КонецЕсли; 
    
    СформироватьФрагмент(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьФрагмент(Знач Оповещение)
    
    Перем ИдентификаторСтроки, КоллекцияЭлементовДерева, Строка;
    
    СформироватьДеревоПКОНаСервере();
    
    КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
    // Развернуть дерево. 
    Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
        ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
        Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
    КонецЦикла;   
    
    ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры
// Процедура выполняет проверку на дублирование документов ПКО. 
//

&НаСервере
Процедура ПроверитьПовторныйВводДокумента(Отказ, Оплата)
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		
		ВидДокумента           	= "ПоступлениеНаРасчетныйСчет";
		ВидДокументаНаПроверку	= "ПриходныйКассовыйОрдер";
		ВидДокументаНаПроверку2 = "ОплатаПлатежнойКартой";
		
	ИначеЕсли ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		ВидДокумента           	= "ОплатаПлатежнойКартой";
		ВидДокументаНаПроверку	= "ПриходныйКассовыйОрдер";
		ВидДокументаНаПроверку2 = "ПоступлениеНаРасчетныйСчет";
		
	Иначе
		ВидДокумента          	= "ПриходныйКассовыйОрдер";
		ВидДокументаНаПроверку	= "ПоступлениеНаРасчетныйСчет";
		ВидДокументаНаПроверку2 = "ОплатаПлатежнойКартой"; // БИТ_ЖКХ 22.08.2016 15:22:08 	
		
	КонецЕсли;
	
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.бит_ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Оплата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивОснование = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	МассивОснование.Добавить(ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Ссылка
	|ИЗ
	|	Документ."+ВидДокумента+" КАК Документ
	|ГДЕ
	|	(Документ.ДокументОснование В(&МассивОснование)
	|	ИЛИ Документ.ДокументОснование = &Основание)
	|	И НЕ Документ.Ссылка В (&СписокИскл)
	|	И НЕ Документ.ПометкаУдаления
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка
	|ИЗ
	|	Документ."+ВидДокументаНаПроверку+" КАК Документ
	|ГДЕ
	|	Документ.ДокументОснование В(&МассивОснование)
	|	ИЛИ Документ.ДокументОснование = &Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка
	|ИЗ
	|	Документ."+ВидДокументаНаПроверку2+" КАК Документ
	|ГДЕ
	|	Документ.ДокументОснование В(&МассивОснование)
	|	ИЛИ Документ.ДокументОснование = &Основание";
		
	Запрос.УстановитьПараметр("МассивОснование", МассивОснование);
	Запрос.УстановитьПараметр("Основание", Оплата);
	Запрос.УстановитьПараметр("СписокИскл", мСписокИсключений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	
КонецПроцедуры

// Процедура выполняет проверку на дублирование документов ПКО. 
//
//&НаСервере
//Процедура ПроверитьПовторныйВводДокумента(Отказ, Оплата)
//	
//	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
//		
//		ВидДокумента           	= "ПоступлениеНаРасчетныйСчет";
//		ВидДокументаНаПроверку	= "ПриходныйКассовыйОрдер";
//		ВидДокументаНаПроверку2 = "ОплатаПлатежнойКартой";
//		
//	ИначеЕсли ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
//		ВидДокумента           	= "ОплатаПлатежнойКартой";
//		ВидДокументаНаПроверку	= "ПриходныйКассовыйОрдер";
//		ВидДокументаНаПроверку2 = "ПоступлениеНаРасчетныйСчет";
//		
//	Иначе
//		ВидДокумента          	= "ПриходныйКассовыйОрдер";
//		ВидДокументаНаПроверку	= "ПоступлениеНаРасчетныйСчет";
//		ВидДокументаНаПроверку2 = "ОплатаПлатежнойКартой"; // БИТ_ЖКХ 22.08.2016 15:22:08 
//		
//	КонецЕсли; 
//	
//	Отказ = Ложь;
//	
//	Запрос = Новый Запрос;
//	
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Документ.Ссылка
//	|ИЗ
//	|	Документ."+ВидДокумента+" КАК Документ
//	|ГДЕ
//	|	Документ.ДокументОснование = &Основание
//	|	И НЕ Документ.Ссылка В (&СписокИскл)
//	|	И НЕ Документ.ПометкаУдаления
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Документ.Ссылка
//	|ИЗ
//	|	Документ."+ВидДокументаНаПроверку+" КАК Документ
//	|ГДЕ
//	|	Документ.ДокументОснование = &Основание
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Документ.Ссылка
//	|ИЗ
//	|	Документ."+ВидДокументаНаПроверку2+" КАК Документ
//	|ГДЕ
//	|	Документ.ДокументОснование = &Основание";
//	
//	Запрос.УстановитьПараметр("Основание", Оплата);
//	Запрос.УстановитьПараметр("СписокИскл", мСписокИсключений);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		
//		Отказ = Истина;
//		
//	КонецЕсли; 
//	
//	НовыйПроверитьПовторныйВводДокумента(Отказ, Оплата);
//	
//КонецПроцедуры

&НаСервере
Процедура УстановитьВидОперации()
	
	ВидОперации = Неопределено;
	
	Элементы.ВидОперации.СписокВыбора.Очистить();
	
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочиеРасчетыСКонтрагентами);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление);
		ВидОперации =  Элементы.ВидОперации.ОграничениеТипа.ПривестиЗначение(Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПустаяСсылка());
		Элементы.СчетКасса.Видимость					 = Истина;
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Истина;
		Элементы.ВидОплаты.Видимость					 = Ложь;
		
	ИначеЕсли  ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда 
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя);
		ВидОперации =  Элементы.ВидОперации.ОграничениеТипа.ПривестиЗначение(Перечисления.ВидыОперацийОплатаПлатежнойКартой.ПустаяСсылка());
		Элементы.СчетКасса.Видимость					 = Ложь;
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Ложь;
		Элементы.ВидОплаты.Видимость					 = Истина;
		
		// БИТ ЖКХ 06.09.2020
		Элементы.ДатаПоступления.Видимость = истина;
		Элементы.СоздатьПоступление.Видимость = истина;
		// БИТ ЖКХ 22.01.2021
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = истина;		
		
	Иначе
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПКО.ОплатаПокупателя);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПКО.ПрочийПриход);
		ВидОперации =  Элементы.ВидОперации.ОграничениеТипа.ПривестиЗначение(Перечисления.ВидыОперацийПКО.ПустаяСсылка());
		Элементы.СчетКасса.Видимость					 = Истина;
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Истина;
		Элементы.ВидОплаты.Видимость					 = Ложь;
		
				
	КонецЕсли; 
	
КонецПроцедуры

// Получение ответственного на выбранном ЛС.
// Параметры:
//  <ЛицевойСчет> – <Справочник.бит_ЛицевыеСчета> – для получения ответственного по ЛС.
//
// Возвращаемое значение:
//  <ТаблицаЗначений.Строка> – <строка с ответственным по ЛС>.
//
&НаСервере
Функция ОтветственныйНаЛС(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ЛицевыеСчета.Ссылка
	|				ИЗ
	|					Справочник.бит_ЛицевыеСчета КАК ЛицевыеСчета
	|				ГДЕ
	|					ЛицевыеСчета.Ссылка = &ЛицевойСчет)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> &СтатусФизЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("Момент", 	 ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	//06.05.2019
	Запрос.УстановитьПараметр("СтатусФизЛица", справочники.бит_СтатусФизЛица.Выписан);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()> 0 Тогда
		
		РезультатФизЛицо = Результат[0].ФизЛицо
	Иначе
		РезультатФизЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФизЛицо;
	
КонецФункции 





// Процедура заполняет документ СчетНаОплатуПокупателю и выполняет его запись.
//
&НаСервере
Процедура ЗаполнитьСчетНаСервере(Счет,ПлатежныйДокумент, Строка, Оплата, СчетЗаписан = Ложь, РабитьПоЛС = Ложь, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых, БанковскийСчет, ИсточникОплаты)
	Счет.Дата = ПлатежныйДокумент.Дата;
	Счет.Организация = ПлатежныйДокумент.Организация;
	Счет.бит_ДокументОснование = Оплата;
	Счет.Ответственный = Оплата.Ответственный;
	Счет.Контрагент = ПлатежныйДокумент.Контрагент;
	Счет.ДоговорКонтрагента = ПлатежныйДокумент.ДоговорКонтрагента;
	Счет.ВалютаДокумента = ПлатежныйДокумент.ВалютаДокумента;
	Счет.Комментарий = ПлатежныйДокумент.Комментарий;
	Счет.СуммаДокумента = ПлатежныйДокумент.СуммаДокумента;
	Счет.СтруктурнаяЕдиница = БанковскийСчет;
	//21.08.2019
	Счет.СуммаВключаетНДС = истина;

	Если РабитьПоЛС Тогда
		
		Счет.бит_ЛицевойСчет = ПлатежныйДокумент.бит_ЛицевойСчет;
		
		Для каждого стр из Оплата.СписокУслуг.НайтиСтроки(Новый Структура ("ЛицевойСчет", Счет.бит_ЛицевойСчет)) Цикл
			
		    если Объект.УчитыватьАванс = истина тогда	
				// БИТ ЖКХ 31.12.2020 РТС
				//Быстрое решение
				Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
				                      |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
				                      |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
				                      |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления
				                      |ПОМЕСТИТЬ втСведения
				                      |ИЗ
				                      |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
				                      |			&Дата,
				                      |			ЛицевойСчет = &ЛицевойСчет
				                      |				И Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
				                      |;
				                      |
				                      |////////////////////////////////////////////////////////////////////////////////
				                      |ВЫБРАТЬ ПЕРВЫЕ 1
				                      |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
				                      |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры
				                      |ПОМЕСТИТЬ втКвартира
				                      |ИЗ
				                      |	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
				                      |			&Дата,
				                      |			Квартира В
				                      |				(ВЫБРАТЬ
				                      |					Справочник.бит_ЛицевыеСчета.Квартира
				                      |				ИЗ
				                      |					Справочник.бит_ЛицевыеСчета
				                      |				ГДЕ
				                      |					Справочник.бит_ЛицевыеСчета.Ссылка = &ЛицевойСчет)) КАК бит_СведенияОКвартиреСрезПоследних
				                      |;
				                      |
				                      |////////////////////////////////////////////////////////////////////////////////
				                      |ВЫБРАТЬ ПЕРВЫЕ 1
				                      |	Ставки.Тариф КАК Тариф,
				                      |	Ставки.ОсновнаяСтавка КАК ОсновнаяСтавка
				                      |ИЗ
				                      |	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
				                      |			&Дата,
				                      |			Услуга = &Услуга
				                      |				И (Поставщик, СпособРасчета, РежимПотребления) В
				                      |					(ВЫБРАТЬ
				                      |						втСведения.Поставщик,
				                      |						втСведения.СпособРасчета,
				                      |						втСведения.РежимПотребления
				                      |					ИЗ
				                      |						втСведения)
				                      |				И (ТипКвартиры, СтатусКвартиры) В
				                      |					(ВЫБРАТЬ
				                      |						втКвартира.ТипКвартиры,
				                      |						втКвартира.СтатусКвартиры
				                      |					ИЗ
				                      |						втКвартира)) КАК Ставки");	
				Запрос.УстановитьПараметр("Дата", НачалоМесяца(Счет.Дата)-1);
				Запрос.УстановитьПараметр("ЛицевойСчет", ПлатежныйДокумент.бит_ЛицевойСчет);
				Запрос.УстановитьПараметр("Услуга", Стр.Услуга);
			конецесли;
			Добавить = Счет.Товары.Добавить();
			Добавить.Номенклатура = стр.Услуга.Номенклатура;
			Добавить.Цена = стр.Сумма + стр.СуммаПени;
			Добавить.Количество = 1;
			Добавить.Сумма = Добавить.Цена * Добавить.Количество;
			//31.07.2019
			если НДСизНоменклатуры = Истина тогда
			 Добавить.СтавкаНДС = бит_ОбщегоНазначения.ПолучитьСтавкуНДСИзВидаСтавки(стр.Услуга.Номенклатура.ВидСтавкиНДС);
			иначе 
			 Добавить.СтавкаНДС = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
			конецесли;
			ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Добавить.СтавкаНДС);
			Добавить.СуммаНДС = Добавить.Сумма*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
			
			если Объект.УчитыватьАванс = истина тогда
			    // БИТ ЖКХ 31.12.2020 РТС
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Тариф = ?(Выборка.Тариф = 0, Выборка.ОсновнаяСтавка, Выборка.Тариф);
					Если Тариф <> 0 Тогда
						Добавить.Цена = Тариф;
						Добавить.Количество = Добавить.Сумма / Тариф;
					КонецЕсли;
				КонецЕсли;
			конецесли;
			
		КонецЦикла;
		
	Иначе
		// БИТ ЖКХ 19.03.2021
		таблицаОплат = Оплата.СписокУслуг.Выгрузить();
		таблицаОплат.Свернуть("Услуга", "Сумма, СуммаПени");
		таблицаОплат.Колонки.Добавить("Номенклатура");
		
		Для каждого стр из таблицаОплат цикл
		  стр.Номенклатура = стр.Услуга.Номенклатура;	
		КонецЦикла;     		
        таблицаОплат.Свернуть("Номенклатура", "Сумма, СуммаПени");

		Для каждого стр из таблицаОплат цикл //Оплата.СписокУслуг Цикл
			
			Добавить = Счет.Товары.Добавить();
			Добавить.Номенклатура = стр.Номенклатура;//стр.Услуга.Номенклатура;
			Добавить.Цена = стр.Сумма + стр.СуммаПени;
			Добавить.Количество = 1;
			Добавить.Сумма = Добавить.Цена * Добавить.Количество;
			////31.07.2019
			если НДСизНоменклатуры = Истина тогда
			 Добавить.СтавкаНДС = бит_ОбщегоНазначения.ПолучитьСтавкуНДСИзВидаСтавки(стр.Услуга.Номенклатура.ВидСтавкиНДС);
			иначе 
			 Добавить.СтавкаНДС = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
			конецесли;
            ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Добавить.СтавкаНДС);
			Добавить.СуммаНДС = Добавить.Сумма*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
		КонецЦикла;
		
	КонецЕсли;	
	
	Попытка
		
		Счет.Записать();
		
		СчетЗаписан = Истина;
		//РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(Счет.Ссылка, Перечисления.СтатусОплатыСчета.Оплачен);
	Исключение
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Счет на оплату' не записан по причине: " + ОписаниеОшибки());		
	КонецПопытки;
	
	// БИТ ЖКХ 09.04.2020
	Попытка		
		СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
	    СтатусыДокумента.Статус = Перечисления.СтатусОплатыСчета.Оплачен;
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(Счет.Ссылка, СтатусыДокумента);
	Исключение
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка установки статуса документа 'Счет на оплату' по причине: " + ОписаниеОшибки());		
	КонецПопытки;

	
	ЭтоДокумент = Истина;
	Попытка
		Если СтрНайти(Строка(ТипЗнч(ПлатежныйДокумент)),"сылка") > 0  Тогда
			ЭтоДокумент = Ложь;	
			ПлатежныйДокумент = ПлатежныйДокумент.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		ПлатежныйДокумент.ДокументОснование = Счет.Ссылка;
		
		Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			ПлатежныйДокумент.СчетКонтрагента = Счет.Ссылка;
		КонецЕсли;
		ПлатежныйДокумент.РасшифровкаПлатежа[0].СчетНаОплату = Счет.Ссылка;
		
		
		ПлатежныйДокумент.Записать();
	Исключение
		Если ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'ПКО' не записан по причине: " + ОписаниеОшибки());
		ИначеЕсли ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Поступление на расчетный счет' не записан по причине: " + ОписаниеОшибки());
		Иначе
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Оплата платежной картой' не записан по причине: " + ОписаниеОшибки());
		КонецЕсли;
	КонецПопытки;		
	
	Если Не ЭтоДокумент Тогда
		ПлатежныйДокумент = ПлатежныйДокумент.Ссылка;	
	КонецЕсли;		
	
КонецПроцедуры


// Процедура заполняет документ ПКО и выполняет его запись.
//
&НаСервере
Процедура ЗаполнитьПКО(ПлатежныйДокумент,Строка, Оплата, ДокументЗаписан = Ложь, РабитьПоЛС = Ложь, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых, БанковскийСчет, ИсточникОплаты)
	
	ПлатежныйДокумент.Дата				= Оплата.Дата;
// Первый БИТ + --------------------------	
	//ПлатежныйДокумент.Организация		= Оплата.Организация;
	ПлатежныйДокумент.Организация		= БанковскийСчет.Владелец;
// Первый БИТ - --------------------------	
	ПлатежныйДокумент.ВидОперации		= Объект.ВидОперации;	
	ПлатежныйДокумент.ДокументОснование	= Оплата;	
	ПлатежныйДокумент.Ответственный		= Оплата.Ответственный;	
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		ПлатежныйДокумент.СчетУчетаРасчетовСКонтрагентом = ТранзитныйСчетОплаты;
	Иначе
		ПлатежныйДокумент.ВидОплаты = Объект.ВидОплаты;
	КонецЕсли;
	
	Если НЕ РабитьПоЛС Тогда
		Контрагент = ?(РабитьПоЛС, ПолучитьКонтрагентаЛицевогоСчета(Оплата.Дата, Строка.ЛицевойСчет), Строка.ИсточникОплаты);
	Иначе
		Контрагент = Строка.СубконтоКУ1;
	КонецЕсли;
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.бит_КассыККМ") Тогда
		
		Контрагент = Контрагент.Контрагент;
		
		
	ИначеЕсли ТипЗнч(Контрагент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		
	Иначе
		
	КонецЕсли;
	
// Первый БИТ + --------------------------	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("НаименованиеПолное", "Жильцы");
	КонецЕсли; 
// Первый БИТ - --------------------------	
	
	Если РабитьПоЛС Тогда
		
		ПлатежныйДокумент.бит_ЛицевойСчет = Строка.ЛицевойСчет; 
		
		Ответственный = ОтветственныйНаЛС(Строка.ЛицевойСчет);
		ПлатежныйДокумент.Комментарий		= Строка(Строка.ЛицевойСчет)+ ";" + Строка(Ответственный)+ ";" + "Введен на основании" + Строка(Оплата);
		
		Если  ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			ПлатежныйДокумент.НазначениеПлатежа = Строка(Строка.ЛицевойСчет)+ ";" + Строка(Ответственный)+ ";" + "Введен на основании" + Строка(Оплата);
		КонецЕсли;
		
		
		Если  ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			ПлатежныйДокумент.Основание = "Оплата по лицевому счету " + Строка(Строка.ЛицевойСчет);
		КонецЕсли;
		
		Если ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
			//ПлатежныйДокумент.Контрагент = Контрагент;
		Иначе	
			ПлатежныйДокумент.СубконтоКт1 = Контрагент;
		КонецЕсли;	
		
		Если ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			
			ПлатежныйДокумент.ПринятоОт	= "" + ПлатежныйДокумент.СубконтоКт1; // БИТ_ЖКХ 18.11.2010 17:05:25
			
		КонецЕсли; 
		
	Иначе
		
		СтрокаСписокЛС = "";
		ТаблицаЛС = Оплата.СписокЛС.Выгрузить(,"ЛицевойСчет");
		ТаблицаЛС.Свернуть("ЛицевойСчет");
		
		Для Каждого СтрокаЛС из ТаблицаЛС Цикл
			СтрокаСписокЛС = СтрокаСписокЛС + СтрокаЛС.ЛицевойСчет + ";";
		КонецЦикла;
		Если  ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			ПлатежныйДокумент.Основание = "Оплата по лицевым счетам " + СтрокаСписокЛС;
		КонецЕсли; 
		
		ПлатежныйДокумент.Комментарий		= СтрокаСписокЛС + "Введен на основании " + Оплата;
		
		Если  ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			ПлатежныйДокумент.НазначениеПлатежа = СтрокаСписокЛС + "Введен на основании " + Оплата;
		КонецЕсли;
		
		Если ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
			//ПлатежныйДокумент.Контрагент = Контрагент;
		Иначе	
			ПлатежныйДокумент.СубконтоКт1 = Контрагент;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 И ТипЗнч(ПлатежныйДокумент.СубконтоКт1) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ПлатежныйДокумент.СубконтоКт1) Тогда
		
		ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		МассивВидовДоговоров = Новый Массив;
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,ПлатежныйДокумент.СубконтоКт1,ПлатежныйДокумент.Организация,МассивВидовДоговоров);
		ПлатежныйДокумент.СубконтоКт2 = ОсновнойДоговорКонтрагента;
		
	КонецЕсли; 
	
	СтрокаПлатеж = ПлатежныйДокумент.РасшифровкаПлатежа.Добавить();
	
	СтрокаПлатеж.СуммаПлатежа        = ?(РабитьПоЛС, Строка.Сумма, Строка.СуммаДокумента);
	СтрокаПлатеж.СуммаВзаиморасчетов = ?(РабитьПоЛС, Строка.Сумма, Строка.СуммаДокумента);
	
	ПлатежныйДокумент.Контрагент = Контрагент;
	
	СтрокаПлатеж.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
	
	Если ТипЗнч(ПлатежныйДокумент.Контрагент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ПлатежныйДокумент.Контрагент)  Тогда
		
		ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		МассивВидовДоговоров = Новый Массив;
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,ПлатежныйДокумент.Организация,МассивВидовДоговоров);
		СтрокаПлатеж.ДоговорКонтрагента		= ОсновнойДоговорКонтрагента;
		ПлатежныйДокумент.ДоговорКонтрагента= ОсновнойДоговорКонтрагента;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочиеРасчетыСКонтрагентами 
			И НЕ ОсновнойДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
			СтрокаПлатеж.ДоговорКонтрагента		= Неопределено;
			ПлатежныйДокумент.ДоговорКонтрагента= Неопределено;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ПлатежныйДокумент.ДоговорКонтрагента) Тогда
		ТекстСообщения = НСтр("ru = 'Не сформирован платежный документ по оплате ""%1""! Не указан основной договор для плательщика: %2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Оплата, Контрагент);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СтруктураКурсаВзаиморасчетов  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Оплата.Дата);
	
	ПроверкаКурсовВалют(СтрокаПлатеж,СтруктураКурсаВзаиморасчетов.Курс,СтруктураКурсаВзаиморасчетов.Кратность);
	
	СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
	
	ПлатежныйДокумент.Организация, ПлатежныйДокумент.Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
	
	СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
	СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
	
	ПлатежныйДокумент.СуммаДокумента = СтрокаПлатеж.СуммаПлатежа;
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		
		ПлатежныйДокумент.СчетБанк = Объект.СчетКасса;
		
		Если НЕ (Объект.СчетКасса.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента=Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
		
		ПлатежныйДокумент.СчетОрганизации = ?(ЗначениеЗаполнено(БанковскийСчет), БанковскийСчет
												,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.Организация, "ОсновнойБанковскийСчет"));
	ИначеЕсли  ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидОплаты, "Контрагент, ДоговорКонтрагента, СчетУчетаРасчетов");

		ПлатежныйДокумент.СчетКасса			= СтруктураРеквизитов.СчетУчетаРасчетов;
		ПлатежныйДокумент.Эквайер			= СтруктураРеквизитов.Контрагент;
		ПлатежныйДокумент.ДоговорЭквайринга = СтруктураРеквизитов.ДоговорКонтрагента;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитов.СчетУчетаРасчетов)
			И НЕ (СтруктураРеквизитов.СчетУчетаРасчетов.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
	Иначе	
		
		ПлатежныйДокумент.СчетКасса = Объект.СчетКасса;
		
		Если НЕ (Объект.СчетКасса.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда 
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств		= Объект.СтатьяДвиженияДенежныхСредств;
		ПлатежныйДокумент.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДвиженияДенежныхСредств;
	КонецЕсли;

	СтрокаПлатеж.СтавкаНДС = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаПлатеж.СтавкаНДС);
	
	СтрокаПлатеж.СуммаНДС = СтрокаПлатеж.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
	
	Если ПрименениеУСН Тогда
		ПлатежныйДокумент.Графа4_УСН	= ПлатежныйДокумент.СуммаДокумента;
		ПлатежныйДокумент.Графа5_УСН	= СуммаПринимаемых;
		ПлатежныйДокумент.Содержание_УСН= Строка(ПлатежныйДокумент.ВидОперации) + ". " + Строка(Объект.СтатьяДвиженияДенежныхСредств) + "."
	КонецЕсли;
	
	// БИТ ЖКХ 21.07.2020
	
	попытка
	 если Строка.СубконтоКУ2 <> неопределено и
		  Строка.СубконтоКУ2 <> справочники.ДоговорыКонтрагентов.ПустаяСсылка() тогда
		  
		  ПлатежныйДокумент.ДоговорКонтрагента = Строка.СубконтоКУ2;
		  если ПлатежныйДокумент.РасшифровкаПлатежа.Количество() > 0 тогда 
		   ПлатежныйДокумент.РасшифровкаПлатежа[0].ДоговорКонтрагента = Строка.СубконтоКУ2; 
		  конецесли; 
	 конецесли;	  
    исключение
	конецпопытки; 
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 0
		И ЗначениеЗаполнено(ИсточникОплаты) Тогда
		Если ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.Контрагенты") 
			ИЛИ ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			
			НаименованиеИсточникаОплаты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникОплаты,"Наименование, НаименованиеПолное");
			ПлатежныйДокумент.ПринятоОт	= ?(ПустаяСтрока(НаименованиеИсточникаОплаты.НаименованиеПолное),
			НаименованиеИсточникаОплаты.Наименование, НаименованиеИсточникаОплаты.НаименованиеПолное);
		Иначе    
			ПлатежныйДокумент.ПринятоОт	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникОплаты,"Наименование"); 
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		
		ПлатежныйДокумент.Записать();
		
		ДокументЗаписан = Истина;
		
	Исключение

		Если ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'ПКО' не записан по причине: " + ОписаниеОшибки());
		ИначеЕсли ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Поступление на расчетный счет' не записан по причине: " + ОписаниеОшибки());
		Иначе
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Оплата платежной картой' не записан по причине: " + ОписаниеОшибки());
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// БИТ ЖКХ 08.10.2020
Процедура ЗаполнитьПКОПоступлениеПлатежа(ПлатежныйДокумент,Строка, Оплата, ДокументЗаписан = Ложь, РабитьПоЛС = Ложь, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых, БанковскийСчет, ИсточникОплаты)
	
	ПлатежныйДокумент.Дата				= Оплата.Дата;
	ПлатежныйДокумент.Организация		= Оплата.Организация;
	ПлатежныйДокумент.ВидОперации		= Объект.ВидОперации;	
	ПлатежныйДокумент.ДокументОснование	= Оплата;	
	ПлатежныйДокумент.Ответственный		= Оплата.Ответственный;	
	ПлатежныйДокумент.СчетБанк          = Объект.СчетКасса;
	
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		ПлатежныйДокумент.СчетУчетаРасчетовСКонтрагентом = ТранзитныйСчетОплаты;
	Иначе
		ПлатежныйДокумент.ВидОплаты = Объект.ВидОплаты;
	КонецЕсли;
	
	Если НЕ РабитьПоЛС Тогда
		Контрагент = ?(РабитьПоЛС, ПолучитьКонтрагентаЛицевогоСчета(Оплата.Дата, Строка.ЛицевойСчет), Строка.ИсточникОплаты);
	Иначе
		Контрагент = Строка.СубконтоКУ1;
	КонецЕсли;
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.бит_КассыККМ") Тогда
		
		Контрагент = Контрагент.Контрагент;
		
		
	ИначеЕсли ТипЗнч(Контрагент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		
	Иначе
		
	КонецЕсли;
	
	Если РабитьПоЛС Тогда
		
		ПлатежныйДокумент.бит_ЛицевойСчет = Строка.ЛицевойСчет; 
		
		Ответственный = ОтветственныйНаЛС(Строка.ЛицевойСчет);
		ПлатежныйДокумент.Комментарий		= Строка(Строка.ЛицевойСчет)+ ";" + Строка(Ответственный)+ ";" + "Введен на основании" + Строка(Оплата);
		
		Если  ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			ПлатежныйДокумент.НазначениеПлатежа = Строка(Строка.ЛицевойСчет)+ ";" + Строка(Ответственный)+ ";" + "Введен на основании" + Строка(Оплата);
		КонецЕсли;
		
		
		Если  ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			ПлатежныйДокумент.Основание = "Оплата по лицевому счету " + Строка(Строка.ЛицевойСчет);
		КонецЕсли;
		
		Если ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
			//ПлатежныйДокумент.Контрагент = Контрагент;
		Иначе	
			ПлатежныйДокумент.СубконтоКт1 = Контрагент;
		КонецЕсли;	
		
		Если ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			
			ПлатежныйДокумент.ПринятоОт	= "" + ПлатежныйДокумент.СубконтоКт1; // БИТ_ЖКХ 18.11.2010 17:05:25
			
		КонецЕсли; 
		
	Иначе
		
		СтрокаСписокЛС = "";
		ТаблицаЛС = Оплата.СписокЛС.Выгрузить(,"ЛицевойСчет");
		ТаблицаЛС.Свернуть("ЛицевойСчет");
		
		Для Каждого СтрокаЛС из ТаблицаЛС Цикл
			СтрокаСписокЛС = СтрокаСписокЛС + СтрокаЛС.ЛицевойСчет + ";";
		КонецЦикла;
		Если  ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			ПлатежныйДокумент.Основание = "Оплата по лицевым счетам " + СтрокаСписокЛС;
		КонецЕсли; 
		
		ПлатежныйДокумент.Комментарий		= СтрокаСписокЛС + "Введен на основании " + Оплата;
		
		Если  ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			ПлатежныйДокумент.НазначениеПлатежа = СтрокаСписокЛС + "Введен на основании " + Оплата;
		КонецЕсли;
		
		Если ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
			//ПлатежныйДокумент.Контрагент = Контрагент;
		Иначе	
			ПлатежныйДокумент.СубконтоКт1 = Контрагент;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 И ТипЗнч(ПлатежныйДокумент.СубконтоКт1) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ПлатежныйДокумент.СубконтоКт1) Тогда
		
		ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		МассивВидовДоговоров = Новый Массив;
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,ПлатежныйДокумент.СубконтоКт1,ПлатежныйДокумент.Организация,МассивВидовДоговоров);
		ПлатежныйДокумент.СубконтоКт2 = ОсновнойДоговорКонтрагента;
		
	КонецЕсли; 
	
	СтрокаПлатеж = ПлатежныйДокумент.РасшифровкаПлатежа.Добавить();
	
	СтрокаПлатеж.СуммаПлатежа        = ?(РабитьПоЛС, Строка.Сумма, Строка.СуммаДокумента);
	СтрокаПлатеж.СуммаВзаиморасчетов = ?(РабитьПоЛС, Строка.Сумма, Строка.СуммаДокумента);
	
	ПлатежныйДокумент.Контрагент = Контрагент;
	
	СтрокаПлатеж.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
	
	Если ТипЗнч(ПлатежныйДокумент.Контрагент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ПлатежныйДокумент.Контрагент)  Тогда
		
		ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		МассивВидовДоговоров = Новый Массив;
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,ПлатежныйДокумент.Организация,МассивВидовДоговоров);
		СтрокаПлатеж.ДоговорКонтрагента		= ОсновнойДоговорКонтрагента;
		ПлатежныйДокумент.ДоговорКонтрагента= ОсновнойДоговорКонтрагента;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочиеРасчетыСКонтрагентами 
			И НЕ ОсновнойДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
			СтрокаПлатеж.ДоговорКонтрагента		= Неопределено;
			ПлатежныйДокумент.ДоговорКонтрагента= Неопределено;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ПлатежныйДокумент.ДоговорКонтрагента) Тогда
		ТекстСообщения = НСтр("ru = 'Не сформирован платежный документ по оплате ""%1""! Не указан основной договор для плательщика: %2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Оплата, Контрагент);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СтруктураКурсаВзаиморасчетов  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Оплата.Дата);
	
	ПроверкаКурсовВалют(СтрокаПлатеж,СтруктураКурсаВзаиморасчетов.Курс,СтруктураКурсаВзаиморасчетов.Кратность);
	
	СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
	
	ПлатежныйДокумент.Организация, ПлатежныйДокумент.Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
	
	СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
	СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
	
	ПлатежныйДокумент.СуммаДокумента = СтрокаПлатеж.СуммаПлатежа;
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		
		ПлатежныйДокумент.СчетБанк = Объект.СчетКасса;
		
		Если НЕ (Объект.СчетКасса.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента=Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
		
		ПлатежныйДокумент.СчетОрганизации = ?(ЗначениеЗаполнено(БанковскийСчет), БанковскийСчет
												,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.Организация, "ОсновнойБанковскийСчет"));
	ИначеЕсли  ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидОплаты, "Контрагент, ДоговорКонтрагента, СчетУчетаРасчетов");

		ПлатежныйДокумент.СчетКасса			= СтруктураРеквизитов.СчетУчетаРасчетов;
		ПлатежныйДокумент.Эквайер			= СтруктураРеквизитов.Контрагент;
		ПлатежныйДокумент.ДоговорЭквайринга = СтруктураРеквизитов.ДоговорКонтрагента;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитов.СчетУчетаРасчетов)
			И НЕ (СтруктураРеквизитов.СчетУчетаРасчетов.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
	Иначе	
		
		ПлатежныйДокумент.СчетКасса = Объект.СчетКасса;
		
		Если НЕ (Объект.СчетКасса.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда 
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств		= Объект.СтатьяДвиженияДенежныхСредств;
		ПлатежныйДокумент.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДвиженияДенежныхСредств;
	КонецЕсли;

	СтрокаПлатеж.СтавкаНДС = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаПлатеж.СтавкаНДС);
	
	СтрокаПлатеж.СуммаНДС = СтрокаПлатеж.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
	
	Если ПрименениеУСН Тогда
		ПлатежныйДокумент.Графа4_УСН	= ПлатежныйДокумент.СуммаДокумента;
		ПлатежныйДокумент.Графа5_УСН	= СуммаПринимаемых;
		ПлатежныйДокумент.Содержание_УСН= Строка(ПлатежныйДокумент.ВидОперации) + ". " + Строка(Объект.СтатьяДвиженияДенежныхСредств) + "."
	КонецЕсли;
	
	// БИТ ЖКХ 21.07.2020
	
	попытка
	 если Строка.СубконтоКУ2 <> неопределено и
		  Строка.СубконтоКУ2 <> справочники.ДоговорыКонтрагентов.ПустаяСсылка() тогда
		  
		  ПлатежныйДокумент.ДоговорКонтрагента = Строка.СубконтоКУ2;
		  если ПлатежныйДокумент.РасшифровкаПлатежа.Количество() > 0 тогда 
		   ПлатежныйДокумент.РасшифровкаПлатежа[0].ДоговорКонтрагента = Строка.СубконтоКУ2; 
		  конецесли; 
	 конецесли;	  
    исключение
	конецпопытки; 
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 0
		И ЗначениеЗаполнено(ИсточникОплаты) Тогда
		Если ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.Контрагенты") 
			ИЛИ ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			
			НаименованиеИсточникаОплаты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникОплаты,"Наименование, НаименованиеПолное");
			ПлатежныйДокумент.ПринятоОт	= ?(ПустаяСтрока(НаименованиеИсточникаОплаты.НаименованиеПолное),
			НаименованиеИсточникаОплаты.Наименование, НаименованиеИсточникаОплаты.НаименованиеПолное);
		Иначе    
			ПлатежныйДокумент.ПринятоОт	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникОплаты,"Наименование"); 
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		
		ПлатежныйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументЗаписан = Истина;
		
	Исключение

		Если ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'ПКО' не записан по причине: " + ОписаниеОшибки());
		ИначеЕсли ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Поступление на расчетный счет' не записан по причине: " + ОписаниеОшибки());
		Иначе
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Оплата платежной картой' не записан по причине: " + ОписаниеОшибки());
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуУСН(Оплата)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Оплата);
	Запрос.УстановитьПараметр("Дата"  , Оплата.Дата);
	
	Запрос.УстановитьПараметр("Организация"  , Оплата.Организация);
	
	Если НЕ НеПриниматьПениСобственныхУслугВДоход и НЕ НеПриниматьПениСтороннихУслугВДоход Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет,
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма + бит_ОплатаКУСписокУслуг.СуммаПени) КАК Сумма,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК СуммаБезПени,
		|	СУММА(бит_ОплатаКУСписокУслуг.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
		|ГДЕ
		|	бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Поставщики.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств ССЫЛКА Справочник.Организации
		|				ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ЛОЖЬ
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ЛОЖЬ
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|							ИНАЧЕ ВЫБОР
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ЛОЖЬ
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК Сумма,
		|	Поставщики.Услуга,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.Период) КАК Период,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств) КАК ПолучательДенежныхСредств,
		|	Поставщики.Поставщик
		|ИЗ
		|	(ВЫБРАТЬ
		|		Оплата.ЛицевойСчет КАК ЛицевойСчет,
		|		Оплата.Услуга КАК Услуга,
		|		Оплата.Сумма КАК Сумма,
		|		Оплата.СуммаБезПени КАК СуммаБезПени,
		|		Оплата.СуммаПени КАК СуммаПени,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
		|	ИЗ
		|		Оплата КАК Оплата
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|					&Дата,
		|					ЛицевойСчет В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.ЛицевойСчет
		|							ИЗ
		|								Оплата КАК Таб)
		|						И Услуга В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.Услуга
		|							ИЗ
		|								Оплата КАК Таб)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|			ПО Оплата.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|				И Оплата.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга) КАК Поставщики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Дата, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО Поставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|			И Поставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	Поставщики.ЛицевойСчет,
		|	Поставщики.Услуга,
		|	Поставщики.Поставщик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
	ИначеЕсли НЕ НеПриниматьПениСобственныхУслугВДоход и НеПриниматьПениСтороннихУслугВДоход Тогда	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ОплатаКУСписокУслуг.Услуга КАК Услуга,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма + бит_ОплатаКУСписокУслуг.СуммаПени) КАК Сумма,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК СуммаБезПени,
		|	СУММА(бит_ОплатаКУСписокУслуг.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
		|ГДЕ
		|	бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Поставщики.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств ССЫЛКА Справочник.Организации
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ЛОЖЬ
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ЛОЖЬ
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|							ИНАЧЕ ВЫБОР
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ЛОЖЬ
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК Сумма,
		|	Поставщики.Услуга,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.Период) КАК Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		Оплата.ЛицевойСчет КАК ЛицевойСчет,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
		|		Оплата.Услуга КАК Услуга,
		|		Оплата.Сумма КАК Сумма,
		|		Оплата.СуммаБезПени КАК СуммаБезПени,
		|		Оплата.СуммаПени КАК СуммаПени
		|	ИЗ
		|		Оплата КАК Оплата
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|					&Дата,
		|					ЛицевойСчет В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.ЛицевойСчет
		|							ИЗ
		|								Оплата КАК Таб)
		|						И Услуга В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.Услуга
		|							ИЗ
		|								Оплата КАК Таб)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|			ПО Оплата.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|				И Оплата.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга) КАК Поставщики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Дата, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО Поставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|			И Поставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	Поставщики.ЛицевойСчет,
		|	Поставщики.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
	ИначеЕсли НеПриниматьПениСобственныхУслугВДоход и НеПриниматьПениСтороннихУслугВДоход Тогда	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет,
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма + бит_ОплатаКУСписокУслуг.СуммаПени) КАК Сумма,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК СуммаБезПени,
		|	СУММА(бит_ОплатаКУСписокУслуг.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
		|ГДЕ
		|	бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Поставщики.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств ССЫЛКА Справочник.Организации
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.СуммаБезПени, 0)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.СуммаБезПени, 0)
		|							ИНАЧЕ ВЫБОР
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.СуммаБезПени, 0)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК Сумма,
		|	Поставщики.Услуга,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.Период) КАК Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		Оплата.ЛицевойСчет КАК ЛицевойСчет,
		| //21.11.2018
		|       бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
		|		Оплата.Услуга КАК Услуга,
		|		Оплата.Сумма КАК Сумма,
		|		Оплата.СуммаБезПени КАК СуммаБезПени,
		|		Оплата.СуммаПени КАК СуммаПени,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик.ПолучательДенежныхСредств КАК ПоставщикПолучательДенежныхСредств
		|	ИЗ
		|		Оплата КАК Оплата
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|					&Дата,
		|					ЛицевойСчет В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.ЛицевойСчет
		|							ИЗ
		|								Оплата КАК Таб)
		|						И Услуга В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.Услуга
		|							ИЗ
		|								Оплата КАК Таб)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|			ПО Оплата.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|				И Оплата.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга) КАК Поставщики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Дата, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО Поставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|       //21.11.2018
		|           И Поставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	Поставщики.ЛицевойСчет,
		|	Поставщики.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
	КонецЕсли;	
	
	Возврат  Запрос.Выполнить();
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуПолучаемых(ТаблицаУСН, ЛицевойСчет = Неопределено)
	
	Сумма = 0;
	
	Если ТипЗнч(ТаблицаУСН) = Тип("РезультатЗапроса") Тогда
		
		Выборка = ТаблицаУСН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Выборка.Следующий() Тогда
			
			Сумма = Выборка.Сумма;
			
			СуммаЛС = 0;
			
			Если НЕ ЛицевойСчет = Неопределено Тогда
				
				ВыборкаЛС = Выборка.Выбрать();
				
				Пока ВыборкаЛС.Следующий() Цикл
					
					Если ВыборкаЛС.ЛицевойСчет = ЛицевойСчет Тогда
						
						СуммаЛС = СуммаЛС + ВыборкаЛС.Сумма;
						
						Сумма = СуммаЛС;
						
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Сумма

КонецФункции

&НаСервере
Функция ПолучитьОрганизациюДокументаОплатыНаСервере(ДокументОплаты)
	
	Возврат ДокументОплаты.Организация;
	
КонецФункции

&НаСервере
Функция ПолучитьИсточникОплатыДокументаОплатыНаСервере(ДокументОплаты)
	
	Возврат ДокументОплаты.ИсточникОплаты;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммаДокументаДокументаОплатыНаСервере(ДокументОплаты)
	
	Возврат ДокументОплаты.СуммаДокумента;
	
КонецФункции

&НаСервере
Процедура ИзменитьСтатьяДвиженияДенежныхСредствИЗаписатьПриходныйКассовыйОрдерНаСервере(Знач ПриходныйКассовыйОредер, Знач СтатьяДвиженийДенСредств);
	
	ДокОбъект = ПриходныйКассовыйОредер.ПОлучитьОбъект();
	
	Если ДокОбъект.РасшифровкаПлатежа.Количество() > 0 Тогда
		
		СтрокаПлатеж = ДокОбъект.РасшифровкаПлатежа.Получить(0);
		
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтатьяДвиженийДенСредств;
		
	КонецЕсли; 
	
	Если ДокОбъект.ПометкаУдаления Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ помечен на удаление! Изменение статьи движения денежных средств не возможно.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если ДокОбъект.Проведен Тогда
		
		Попытка
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
		КонецПопытки; 
		
	Иначе
		
		Попытка
			
			ДокОбъект.Записать();
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСчетКассаИЗаписатьПриходныйКассовыйОрдерНаСервере(Знач ПриходныйКассовыйОредер, Знач СчетКасса);
	
	ДокОбъект = ПриходныйКассовыйОредер.ПОлучитьОбъект();
	
	ДокОбъект.СчетКасса = СчетКасса;
	
	Если ДокОбъект.ПометкаУдаления Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ помечен на удаление! Изменение счета учета не возможно.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если ДокОбъект.Проведен Тогда
		
		Попытка
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
		КонецПопытки; 
		
	Иначе
		
		Попытка
			
			ДокОбъект.Записать();
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьИЗаписатьПриходныйКассовыйОрдерНаСервере(Знач ПриходныйКассовыйОредер,ПрименениеУСН, СуммаПринимаемых);
	
	ОбъектДокумента = ПриходныйКассовыйОредер.ПолучитьОбъект();
	
	Если ОбъектДокумента = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ОбъектДокумента.Проведен И НЕ ОбъектДокумента.ПометкаУдаления Тогда
		
		Попытка
			НачатьТранзакцию();
			ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
			
			// РучнаяКорректировка. 
			Если ПрименениеУСН Тогда
				
				//05.07.2019
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектДокумента, "РучнаяКорректировка") = истина И
					НЕ ОбъектДокумента.РучнаяКорректировка Тогда
					ОбъектДокумента.РучнаяКорректировка = Истина;
					ОбъектДокумента.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;				
				//05.07.2019

				//05.07.2019
				если ТипЗнч(ОбъектДокумента.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") = ложь тогда
				 НаборЗаписей = РегистрыНакопления.КнигаУчетаДоходовИРасходов.СоздатьНаборЗаписей();
				 НаборЗаписей.Отбор.Регистратор.Установить(ПриходныйКассовыйОредер);
				 НаборЗаписей.УстановитьАктивность(НЕ ПриходныйКассовыйОредер.ПометкаУдаления);
				 НаборЗаписей.Прочитать();
				 Если НаборЗаписей.Количество() = 1 Тогда
					НаборЗаписей[0].Графа5 = ПриходныйКассовыйОредер.Графа5_УСН;
					//СтрокаРасшифровки.Графа5 = ПриходныйКассовыйОредер.Графа5_УСН;??
				 КонецЕсли;
				 НаборЗаписей.Записать(Истина);
				конецесли; 

			КонецЕсли;
		
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Корректировка движений'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), 
				УровеньЖурналаРегистрации.Ошибка,, 
				ПриходныйКассовыйОредер, 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИОтменитьПроведениеПриходныйКассовыйОрдерНаСервере(Знач ПриходныйКассовыйОредер);
	
	ОбъектДокумента = ПриходныйКассовыйОредер.ПолучитьОбъект();
	
	Если ОбъектДокумента = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если ОбъектДокумента.Проведен И НЕ ОбъектДокумента.ПометкаУдаления Тогда
		
		Попытка
			
			ОбъектДокумента.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИУстановитьПометкуУдаленияПриходныйКассовыйОрдерНаСервере(Знач ПриходныйКассовыйОредер)
	
	ОбъектДокумента = ПриходныйКассовыйОредер.ПолучитьОбъект();
	
	Если ОбъектДокумента = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если ОбъектДокумента.ПометкаУдаления Тогда
		
		ОбъектДокумента.УстановитьПометкуУдаления(Ложь);
		
	Иначе
		
		ОбъектДокумента.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиДеревоПКОНаСервере(Знач ДокументОплаты);
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	Строка = ДеревоПКОМ.Строки.Найти(ДокументОплаты, "ПриходныйКассовыйОредер");
	
	Если Строка <> Неопределено Тогда
		
		ДеревоПКОМ.Строки.Удалить(Строка);	
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ,"ДеревоПКО");
	
КонецПроцедуры

&НаСервере
Функция НайтиСтрокиДереваДокументОплатыПриходныйКассовыйОредерНаСервере(Знач ДокументОплаты);
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	СтрокаДерева = ДеревоПКОМ.Строки.Найти(ДокументОплаты, "ПриходныйКассовыйОредер");
	
	СтруктураОтвета = Новый Структура;
	
	Если СтрокаДерева <> Неопределено Тогда
		
		СтруктураОтвета.Вставить("СтрокаДереваНеопределено", Истина);
		
	Иначе
		
		СтруктураОтвета.Вставить("СтрокаДереваНеопределено", Ложь);
		
	КонецЕсли;
	
	Если СтрокаДерева <> Неопределено Тогда
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			
			СтруктураОтвета.Вставить("СтрокаДереваСтрокиКоличество", Истина);
			
		Иначе
			
			СтруктураОтвета.Вставить("СтрокаДереваСтрокиКоличество", Ложь);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураОтвета.Вставить("СтрокаДереваСтрокиКоличество", Истина);
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере
Процедура УстановитьПометкуУдаленияПриходныйКассовыйОредерНаСервере(Знач ДокументОплаты)
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	СтрокаДерева = ДеревоПКОМ.Строки.Найти(ДокументОплаты, "ПриходныйКассовыйОредер");
	
	Для каждого Строка Из СтрокаДерева.Строки Цикл
		
		ПКО =  Строка.ПриходныйКассовыйОредер.ПолучитьОбъект();
		
		Попытка
			
			ПКО.УстановитьПометкуУдаления(Истина);
			
		Исключение
			
		КонецПопытки; 
		
	КонецЦикла; 	
	
	ДеревоПКОМ.Строки.Удалить(СтрокаДерева);
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлажкиДеревоПКОНаСервере()
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	Для Каждого ПервыйУровень Из ДеревоПКОМ.Строки Цикл
		
		ПервыйУровень.Выбор = Истина;
		
		Для каждого ВторойУровень Из ПервыйУровень.Строки Цикл
			
			ВторойУровень.Выбор = Истина;
			
			Для каждого ТретийУровень Из ВторойУровень.Строки Цикл
				
				ТретийУровень.Выбор = Истина;	
				
			КонецЦикла
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
КонецПроцедуры

&НаСервере
Процедура СнятьФлажкиДеревоПКОНаСервере()
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	Для каждого ПервыйУровень Из ДеревоПКОМ.Строки Цикл
		
		ПервыйУровень.Выбор = Ложь;
		
		Для каждого ВторойУровень Из ПервыйУровень.Строки Цикл
			
			ВторойУровень.Выбор = Ложь;
			
			Для каждого ТретийУровень Из ВторойУровень.Строки Цикл
				
				ТретийУровень.Выбор = Ложь;	
				
			КонецЦикла
			
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДеревоПКОНаСервере(ПрименениеУСН, СуммаПринимаемых)
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	
	Для каждого ПервыйУровень Из ДеревоПКОМ.Строки Цикл
		
		Для каждого ВторойУровень Из ПервыйУровень.Строки Цикл
			
			Если ВторойУровень.Выбор Тогда
				
				ПолучитьИЗаписатьПриходныйКассовыйОрдерНаСервере(ВторойУровень.ПриходныйКассовыйОредер, ПрименениеУСН, СуммаПринимаемых);
				
				Если ВторойУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
					
					ВторойУровень.НомерКартинки = 1;
					
				ИначеЕсли ВторойУровень.ПриходныйКассовыйОредер.Проведен Тогда
					
					ВторойУровень.НомерКартинки = 0;
				Иначе 
					ВторойУровень.НомерКартинки = 2;
				КонецЕсли;	
				
				Для каждого ТретийУровень Из ВторойУровень.Строки Цикл
					
					Если ТретийУровень.Выбор Тогда
						ПолучитьИЗаписатьПриходныйКассовыйОрдерНаСервере(ТретийУровень.ПриходныйКассовыйОредер, ПрименениеУСН, СуммаПринимаемых);
						
						Если ТретийУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
							
							ТретийУровень.НомерКартинки = 1;
							
						ИначеЕсли ТретийУровень.ПриходныйКассовыйОредер.Проведен Тогда
							
							ТретийУровень.НомерКартинки = 0;
						Иначе 
							ТретийУровень.НомерКартинки = 2;
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
КонецПроцедуры

&НаСервере
Процедура РаспровестиДеревоПКОНаСервере()
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	Для каждого ПервыйУровень Из ДеревоПКОМ.Строки Цикл
		
		Для каждого ВторойУровень Из ПервыйУровень.Строки Цикл
			
			Если ВторойУровень.Выбор Тогда
				
				ПолучитьИОтменитьПроведениеПриходныйКассовыйОрдерНаСервере(ВторойУровень.ПриходныйКассовыйОредер);
				
				Если ВторойУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
					
					ВторойУровень.НомерКартинки = 1;
					
				ИначеЕсли ВторойУровень.ПриходныйКассовыйОредер.Проведен Тогда
					
					ВторойУровень.НомерКартинки = 0;
				Иначе 
					ВторойУровень.НомерКартинки = 2;
				КонецЕсли;	
				
			КонецЕсли;
			
			Для каждого ТретийУровень Из ВторойУровень.Строки Цикл
				
				Если ТретийУровень.Выбор Тогда
					
					ПолучитьИОтменитьПроведениеПриходныйКассовыйОрдерНаСервере(ТретийУровень.ПриходныйКассовыйОредер);
					
					Если ТретийУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
						
						ТретийУровень.НомерКартинки = 1;
						
					ИначеЕсли ТретийУровень.ПриходныйКассовыйОредер.Проведен Тогда
						
						ТретийУровень.НомерКартинки = 0;
					Иначе 
						ТретийУровень.НомерКартинки = 2;
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуУдаленияДеревоПКОНаСервере()
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	Для каждого ПервыйУровень Из ДеревоПКОМ.Строки Цикл
		
		Для каждого ВторойУровень Из ПервыйУровень.Строки Цикл
			
			Если ВторойУровень.Выбор Тогда
				
				ПолучитьИУстановитьПометкуУдаленияПриходныйКассовыйОрдерНаСервере(ВторойУровень.ПриходныйКассовыйОредер);
				
				Если ВторойУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
					
					ВторойУровень.НомерКартинки = 1;
					
				ИначеЕсли ВторойУровень.ПриходныйКассовыйОредер.Проведен Тогда
					
					ВторойУровень.НомерКартинки = 0;
				Иначе 
					ВторойУровень.НомерКартинки = 2;
				КонецЕсли;	
				
			КонецЕсли;
			
			
			Для каждого ТретийУровень Из ВторойУровень.Строки Цикл
				
				Если ТретийУровень.Выбор Тогда
					
					ПолучитьИУстановитьПометкуУдаленияПриходныйКассовыйОрдерНаСервере(ТретийУровень.ПриходныйКассовыйОредер);
					
					Если ТретийУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
						
						ТретийУровень.НомерКартинки = 1;
						
					ИначеЕсли ТретийУровень.ПриходныйКассовыйОредер.Проведен Тогда
						
						ТретийУровень.НомерКартинки = 0;
					Иначе 
						ТретийУровень.НомерКартинки = 2;
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЦикла;
			// БИТ ЖКХ 12.10.2020
			если ТретийУровень <> неопределено тогда
				Для каждого ЧУровень Из ТретийУровень.Строки Цикл
					
					Если ЧУровень.Выбор Тогда
						
						ПолучитьИУстановитьПометкуУдаленияПриходныйКассовыйОрдерНаСервере(ЧУровень.ПриходныйКассовыйОредер);
						
						Если ЧУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
							
							ЧУровень.НомерКартинки = 1;
							
						ИначеЕсли ЧУровень.ПриходныйКассовыйОредер.Проведен Тогда
							
							ЧУровень.НомерКартинки = 0;
						Иначе 
							ЧУровень.НомерКартинки = 2;
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЦикла;
			конецесли;  	

			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
КонецПроцедуры

&НаСервере
Процедура ДеревоПКОВыборПриИзмененииНаСервере(ДокументОплаты, Родитель)
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	ТекущийУровень = ДеревоПКОМ.Строки.Найти(ДокументОплаты, "ПриходныйКассовыйОредер");
	Если ТекущийУровень = Неопределено Тогда
		
		Для каждого стр из ДеревоПКОМ.Строки Цикл
			
			ТекущийУровень = стр.Строки.Найти(ДокументОплаты, "ПриходныйКассовыйОредер");
			
			Если НЕ ТекущийУровень = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТекущийУровень = Неопределено Тогда
		
		Для каждого стр из ДеревоПКОМ.Строки Цикл
			
			ТекущийУровеньРодитель = стр.Строки.Найти(Родитель, "ПриходныйКассовыйОредер");
			
			Если НЕ ТекущийУровеньРодитель = Неопределено Тогда
				ТекущийУровень = ТекущийУровеньРодитель.Строки.Найти(ДокументОплаты, "ПриходныйКассовыйОредер");	
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если (НЕ ТекущийУровеньРодитель = Неопределено) И ТекущийУровеньРодитель.Строки.Количество()=1 Тогда
			
			ТекущийУровеньРодитель.Выбор = ТекущийУровень.Выбор;
			ТекущийУровеньРодитель.Строки[0].Выбор = ТекущийУровень.Выбор;
			ТекущийУровень = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	Если Не ТекущийУровень = Неопределено Тогда
		
		Для каждого Строка Из ТекущийУровень.Строки Цикл
			
			Строка.Выбор = ТекущийУровень.Выбор;
			
			Для каждого Ещестрока Из Строка.Строки Цикл
				
				Ещестрока.Выбор = ТекущийУровень.Выбор;
				
			    // БИТ ЖКХ 12.10.2020
				Для каждого ЕщеОднастрока Из Ещестрока.Строки Цикл
				
				  ЕщеОднастрока.Выбор = ТекущийУровень.Выбор;
				  
				Конеццикла;  
				
			КонецЦикла;		
			            			
		КонецЦикла; 
		
		Если ТекущийУровень.Строки.Количество() = 0 Тогда
			
			ТекущийУровень.Родитель.Выбор = Ложь;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция	ЗначениеРеквизитаНаСервере(Ссылка, ИмяРеквизита);
	
	Если ЗначениеЗаполнено(Ссылка)
		И ЗначениеЗаполнено(ИмяРеквизита) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция	ЗначенияРеквизитовНаСервере(Ссылка, Реквизиты);
	
	Если ЗначениеЗаполнено(Ссылка)
		И ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	КонецЕсли;
	
	Возврат Новый Структура;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет") Тогда
		
		НоваяСтрока = Объект.ОплатыКУ.Добавить();
		
		НоваяСтрока.ДокументОплаты          = Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.ДокументОплаты;
		НоваяСтрока.ИсточникОплаты          = Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.ИсточникОплаты;
// Первый БИТ + --------------------------	
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация)
			ИЛИ НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация = Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.Организация Тогда
			НоваяСтрока.Организация             = Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.Организация;
			НоваяСтрока.БанковскийСчет			= Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.БанковскийСчет;
		Иначе
			НоваяСтрока.Организация             = НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация;
			НоваяСтрока.БанковскийСчет			= НоваяСтрока.Организация.ОсновнойБанковскийСчет;
		КонецЕсли; 
// Первый БИТ - --------------------------	
		НоваяСтрока.СуммаДокумента          = Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.СуммаДокумента;
		НоваяСтрока.РазбиватьПоЛицевымСчетам = Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.РазбиватьПоЛицевымСчетам;
		//19.07.2019
		НоваяСтрока.СоздаватьСчета = Ложь;
		
		ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ВводПКО"));
		
		ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
		
		ОбработкаОбъект.ЗаполнитьДеревоПКО(Параметры.ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет.ДокументОплаты, ДеревоПКОМ, Элементы.ДеревоПКО);
		
		ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
		
		ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
		
		ЭтоПоступлениеНаРасчетныйСчет = 1;
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаПриходныйКассовыйОрдер") Тогда
		
		НоваяСтрока = Объект.ОплатыКУ.Добавить();
		
		НоваяСтрока.ДокументОплаты          = Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.ДокументОплаты;
		НоваяСтрока.ИсточникОплаты          = Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.ИсточникОплаты;
// Первый БИТ + --------------------------	
		//НоваяСтрока.Организация             = Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.Организация;
		//НоваяСтрока.БанковскийСчет			= Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.БанковскийСчет;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация)
			ИЛИ НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация = Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.Организация Тогда
			НоваяСтрока.Организация             = Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.Организация;
			НоваяСтрока.БанковскийСчет			= Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.БанковскийСчет;
		Иначе
			НоваяСтрока.Организация             = НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация;
			НоваяСтрока.БанковскийСчет			= НоваяСтрока.Организация.ОсновнойБанковскийСчет;
		КонецЕсли; 
// Первый БИТ - --------------------------	
		НоваяСтрока.СуммаДокумента          = Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.СуммаДокумента;
		НоваяСтрока.РазбиватьПоЛицевымСчетам = Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.РазбиватьПоЛицевымСчетам;
		//19.07.2019
		НоваяСтрока.СоздаватьСчета = Ложь;

		ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ВводПКО"));
		
		ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
		
		ОбработкаОбъект.ЗаполнитьДеревоПКО(Параметры.ЗаполнитьИзДокументаПриходныйКассовыйОрдер.ДокументОплаты, ДеревоПКОМ, Элементы.ДеревоПКО);
		
		ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
		
		ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
		
		ЭтоПоступлениеНаРасчетныйСчет = 0;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаОплатаПлатежнойКартой") Тогда
		
		НоваяСтрока = Объект.ОплатыКУ.Добавить();
		
		НоваяСтрока.ДокументОплаты          = Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.ДокументОплаты;
		НоваяСтрока.ИсточникОплаты          = Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.ИсточникОплаты;
// Первый БИТ + --------------------------	
		//НоваяСтрока.Организация             = Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.Организация;
		//НоваяСтрока.БанковскийСчет			= Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.БанковскийСчет;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация)
			ИЛИ НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация = Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.Организация Тогда
			НоваяСтрока.Организация             = Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.Организация;
			НоваяСтрока.БанковскийСчет			= Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.БанковскийСчет;
		Иначе
			НоваяСтрока.Организация             = НоваяСтрока.ДокументОплаты.лб_ВидОплаты.Организация;
			НоваяСтрока.БанковскийСчет			= НоваяСтрока.Организация.ОсновнойБанковскийСчет;
		КонецЕсли; 
// Первый БИТ - --------------------------	
		НоваяСтрока.СуммаДокумента          = Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.СуммаДокумента;
		НоваяСтрока.РазбиватьПоЛицевымСчетам = Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.РазбиватьПоЛицевымСчетам;
		//19.07.2019
		НоваяСтрока.СоздаватьСчета = Ложь;


		ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ВводПКО"));
		
		ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
		
		ОбработкаОбъект.ЗаполнитьДеревоПКО(Параметры.ЗаполнитьИзДокументаОплатаПлатежнойКартой.ДокументОплаты, ДеревоПКОМ, Элементы.ДеревоПКО);
		
		ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");
		
		ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
		
		ЭтоПоступлениеНаРасчетныйСчет = 2;
		
		// БИТ ЖКХ 06.09.2020
		Элементы.ДатаПоступления.Видимость = истина;
		Элементы.СоздатьПоступление.Видимость = истина;
		// БИТ ЖКХ 22.01.2021
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = истина;
		
//		Элементы.НастройкаПоступления.Видимость = истина;
//		Элементы.ВидОперацииПоступления.Видимость = истина;
//		Элементы.СчетКассаПоступления.Видимость = истина;
		
	КонецЕсли;
	
	УстановитьВидОперации();
	
	НеПриниматьПениСтороннихУслугВДоход = Истина;
	Объект.УчитыватьАванс = ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаСервере
Процедура ПроверкаКурсовВалют(СтрокаПлатеж, КурсДокумента, КратностьДокумента) Экспорт
	
	КурсДокумента      = ?(КурсДокумента      = 0, 1, КурсДокумента);
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента);
	
	Если Не СтрокаПлатеж = Неопределено Тогда
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты Тогда
			СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов);
			СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);
		Иначе
			СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
			СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПоступлениеНаРасчетныйСчетПриИзменении(Элемент)
	
	Объект.СчетКасса = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка") ;
	Объект.СчетКасса = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПустаяСсылка") ;
	Элементы.СчетКасса.СписокВыбора.Очистить();	
	Элементы.ВидОперации.СписокВыбора.Очистить();
	
	УстановитьВидОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНижняяКоманднаяПанель(Команда)
	
	Этаформа.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляОплатыКУ

// Процедура - обработчик события "ПередУдалением" табличного поля "ОплатыКУ".
//
&НаКлиенте
Процедура ОплатыКУПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.ОплатыКУ.ТекущиеДанные;
	
	ОтветСервера = НайтиСтрокиДереваДокументОплатыПриходныйКассовыйОредерНаСервере(ТекСтрока.ДокументОплаты);
	
	Если ОтветСервера.СтрокаДереваНеопределено И ОтветСервера.СтрокаДереваСтрокиКоличество Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОплатыКУПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), "Пометить на удаление Приходные кассовые ордера?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКУПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		УстановитьПометкуУдаленияПриходныйКассовыйОредерНаСервере(ТекСтрока.ДокументОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			
			Отбор = Новый Структура("ДокументОплаты", ЭлементМассива); 
			
			Поиск = Объект.ОплатыКУ.НайтиСтроки(Отбор);
			
			Если Поиск.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.ОплатыКУ.Добавить();
				
				НоваяСтрока.ДокументОплаты = ЭлементМассива;
				//19.07.2019
		        НоваяСтрока.СоздаватьСчета = Ложь;

				ЗначенияРеквизитов = ЗначенияРеквизитовНаСервере(ЭлементМассива, "Организация, ИсточникОплаты, СуммаДокумента");
				ЗначенияРеквизитов.Свойство("Организация",НоваяСтрока.Организация);
				НоваяСтрока.БанковскийСчет = ЗначениеРеквизитаНаСервере(НоваяСтрока.Организация, "ОсновнойБанковскийСчет");
				ЗначенияРеквизитов.Свойство("ИсточникОплаты",НоваяСтрока.ИсточникОплаты);
				ЗначенияРеквизитов.Свойство("СуммаДокумента",НоваяСтрока.СуммаДокумента);
				
				ЗаполнитьДеревоПКОНаСервере(ЭлементМассива);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "ДокументОплаты".
// Табличного поля "ОплатыКУ".
//
&НаКлиенте
Процедура ОплатыКУДокументОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ОплатыКУ.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийОплатыКУ.ЗакрытиеКассовойСмены"));
	ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ТекущаяСтрока.ДокументОплаты);
	
	ОткрытьФорму("Документ.бит_ОплатаКУ.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзОбработкиВводПКО", ПараметрыФормы), Элемент);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ДокументОплаты".
// Табличного поля "ОплатыКУ".
//
&НаКлиенте
Процедура ОплатыКУДокументОплатыПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ОплатыКУ.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДокументОплаты) Тогда
		
		ТекСтрока.Организация    = ПолучитьОрганизациюДокументаОплатыНаСервере(ТекСтрока.ДокументОплаты);
		ТекСтрока.БанковскийСчет = ЗначениеРеквизитаНаСервере(ТекСтрока.Организация, "ОсновнойБанковскийСчет");
		ТекСтрока.ИсточникОплаты = ПолучитьИсточникОплатыДокументаОплатыНаСервере(ТекСтрока.ДокументОплаты);
		ТекСтрока.СуммаДокумента = ПолучитьСуммаДокументаДокументаОплатыНаСервере(ТекСтрока.ДокументОплаты);
		ЗаполнитьДеревоПКОНаСервере(ТекСтрока.ДокументОплаты);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "ДокументОплаты".
// Табличного поля "ОплатыКУ".
//
&НаКлиенте
Процедура ОплатыКУДокументОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ОплатыКУ.ТекущиеДанные;
	
	//19.07.2019
	Объект.ОплатыКУ[ТекСтрока.НомерСтроки-1].СоздаватьСчета = Ложь;
	
	УдалитьСтрокиДеревоПКОНаСервере(ТекСтрока.ДокументОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКУУстановитьФлажки(Команда)
	
 //23.08.2019	
 попытка
  если ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент.Имя = "ОплатыКУРазбиватьПоЛицевымСчетам" тогда	
	Для каждого Строка Из Объект.ОплатыКУ Цикл
		
		Строка.РазбиватьПоЛицевымСчетам = Истина;				
		
	КонецЦикла;
  конецесли;	

  если ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент.Имя = "ОплатыКУСоздаватьСчета" тогда	
	Для каждого Строка Из Объект.ОплатыКУ Цикл
		
		Строка.СоздаватьСчета = Истина;				
		
	КонецЦикла;
  конецесли;	
 исключение
 конецпопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКУСнятьФлажки(Команда)
	
//23.08.2019	
 попытка
  если ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент.Имя = "ОплатыКУРазбиватьПоЛицевымСчетам" тогда	
	Для каждого Строка Из Объект.ОплатыКУ Цикл
		
		Строка.РазбиватьПоЛицевымСчетам = ложь;				
		
	КонецЦикла;
  конецесли;	

  если ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент.Имя = "ОплатыКУСоздаватьСчета" тогда	
	Для каждого Строка Из Объект.ОплатыКУ Цикл
		
		Строка.СоздаватьСчета = ложь;				
		
	КонецЦикла;
  конецесли;	
 исключение
 конецпопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийОплатыКУ.ЗакрытиеКассовойСмены"));
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Документ.бит_ОплатаКУ.Форма.ФормаВыбораУправляемая", Новый Структура("ПодборИзОбработкиВводПКО", ПараметрыФормы), Элементы.ОплатыКУ, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКУБанковскийСчетПриИзменении(Элемент)
	
	// Больше одной строки в ТЧ.
	Если Объект.ОплатыКУ.Количество() > 1  Тогда
		
		ТекСтрока = Элементы.ОплатыКУ.ТекущиеДанные;
		// Больше одной строки с организацией.
		ПараметрыОтбора	  = Новый Структура("Организация", ТекСтрока.Организация);
		МассивОрганизаций =  Объект.ОплатыКУ.НайтиСтроки(ПараметрыОтбора);
		
		Если МассивОрганизаций.Количество() > 1
			И НЕ БылВопросБанковскиеСчета = ТекСтрока.Организация 
			И НЕ Элемент.ТекстРедактирования = "" Тогда
			
			ТекстВопроса = СтрШаблон(
								НСтр("ru = 'Установить текущий Банковский счет: ""%1"" для всех документов Оплаты КУ, организации ""%2""?'")
								,Элемент.ТекстРедактирования
								,Строка(ТекСтрока.Организация));
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Организация",ТекСтрока.Организация);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВводПКОБанковскийСчетПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВводПКОБанковскийСчетПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		БылВопросБанковскиеСчета = ДополнительныеПараметры.Организация;
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из Объект.ОплатыКУ Цикл
		Если Строка.Организация = ДополнительныеПараметры.Организация Тогда
			Строка.БанковскийСчет = Элементы.ОплатыКУ.ТекущиеДанные.БанковскийСчет;	
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляДеревоПКО

// Процедура - обработчик события "Выбор" табличного поля "ДеревоПКО".
//
&НаКлиенте
Процедура ДеревоПКОВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка) 
	
	Если  Колонка.Имя = "ДеревоПКОПриходныйКассовыйОредер" ИЛИ Колонка.Имя = "ДеревоПКОСумма" Тогда
		
		Выбор = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением" табличного поля "ДеревоПКО".
//
&НаКлиенте
Процедура ДеревоПКОПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОПриАктивизацииЯчейки(Элемент)
	
	ТекДанные = Элементы.ДеревоПКО.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда	
		
		Если Не ТекДанные.ПолучитьРодителя() = Неопределено Тогда
			
			Если Элемент.ТекущийЭлемент.Имя = "ДеревоПКОСтатьяДвиженийДенСредств" Тогда
				
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
			Если Элемент.ТекущийЭлемент.Имя = "ДеревоПКОСчетУчета" Тогда
				
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Элемент.ТекущийЭлемент.Имя = "ДеревоПКОЛицевойСчет" Тогда
			
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОВыборПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ДеревоПКО.ТекущиеДанные;
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	ДокументРодитель = ?(ТипЗнч(ТекущиеДанные.ПолучитьРодителя()) = Тип("ДанныеФормыЭлементДерева"),ТекущиеДанные.ПолучитьРодителя().ПриходныйКассовыйОредер, Неопределено);


	ДеревоПКОВыборПриИзмененииНаСервере(ТекущиеДанные.ПриходныйКассовыйОредер,ДокументРодитель);
	
	КоллекцияЭлементовДерева = ДеревоПКО.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);	
	КонецЦикла;   
	
КонецПроцедуры

Процедура ДеревоПКОПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СтатьяДвиженийДенСредств". 
// Табличного поля "ДеревоПКО".
//
&НаКлиенте
Процедура ДеревоПКОСтатьяДвиженийДенСредствПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоПКО.ТекущиеДанные;
	
	ИзменитьСтатьяДвиженияДенежныхСредствИЗаписатьПриходныйКассовыйОрдерНаСервере(ТекСтрока.ПриходныйКассовыйОредер, ТекСтрока.СтатьяДвиженийДенСредств);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетУчета". 
// Табличного поля "ДеревоПКО".
//
&НаКлиенте
Процедура ДеревоПКОСчетУчетаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоПКО.ТекущиеДанные;
	
	ИзменитьСчетКассаИЗаписатьПриходныйКассовыйОрдерНаСервере(ТекСтрока.ПриходныйКассовыйОредер, ТекСтрока.СчетКасса);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОСчетУчетаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	МассивОтбора = Новый Массив;
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		
		МассивОтбора.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасчетныеСчета"));
		МассивОтбора.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ВалютныеСчета"));
		МассивОтбора.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.СпециальныеСчета"));
		
	КонецЕсли;
	
	СписокВыбора = бит_РаботаСДиалогамиСервер.ЗаполнитьСписокВыбораСчетовДенежныхСредств(МассивОтбора);
	
	ВыбранныйЭлемент = Неопределено;
	
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ДеревоПКОСчетУчетаНачалоВыбораИзСпискаЗавершение", ЭтотОбъект), СписокВыбора, Элементы.ДеревоПКОСчетУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОСчетУчетаНачалоВыбораИзСпискаЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		
		Если НЕ ВыбранныйЭлемент.Значение = Неопределено Тогда
			
			СчетКасса = ВыбранныйЭлемент.Значение;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоПКО(Команда)
	
	Сформировать(Новый ОписаниеОповещения("СформироватьДеревоПКОЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоПКОЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
    // Развернуть дерево. 
    Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
        ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
        Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
    КонецЦикла;   

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОУстановитьФлажки(Команда)
	
	УстановитьФлажкиДеревоПКОНаСервере();
	
	КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОСнятьФлажки(Команда)
	
	СнятьФлажкиДеревоПКОНаСервере();
	
	КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОПровести(Команда)
	
	ПровестиДеревоПКОНаСервере(Ложь,Ложь);
	
	Элементы.ДеревоПКО.Обновить();
	
	КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОРазпровести(Команда)
	
	РаспровестиДеревоПКОНаСервере();
	
	Элементы.ДеревоПКО.Обновить();
	
	КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКОУдалить(Команда)
	
	УстановитьПометкуУдаленияДеревоПКОНаСервере(); 
	
	Элементы.ДеревоПКО.Обновить();
	
	КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПКООбновить(Команда)
	
	ОбновитьДерево();
	
	КоллекцияЭлементовДерева=ДеревоПКО.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПКО.Развернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура НеПриниматьПениСтороннихУслугВДоходПриИзменении(Элемент)
	
	Если НеПриниматьПениСобственныхУслугВДоход Тогда
		
		НеПриниматьПениСтороннихУслугВДоход = Истина;
		ПриниматьПениСтороннихУслугВДоход = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НеПриниматьПениСобственныхУслугВДоходПриИзменении(Элемент)
	
	Если НеПриниматьПениСтороннихУслугВДоход = Ложь Тогда
		
		НеПриниматьПениСобственныхУслугВДоход = Ложь;
		
	КонецЕсли;	
	
	Если ПриниматьПениСтороннихУслугВДоход Тогда
		
		НеПриниматьПениСобственныхУслугВДоход = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриниматьПениСтороннихУслугВДоходПриИзменении(Элемент)
	
	Если НеПриниматьПениСобственныхУслугВДоход Тогда
		
		НеПриниматьПениСтороннихУслугВДоход = Истина;
		ПриниматьПениСтороннихУслугВДоход = Ложь;
	Иначе
		
		НеПриниматьПениСтороннихУслугВДоход = НЕ ПриниматьПениСтороннихУслугВДоход;
		
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДокументыДляПечати()
	
	ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");
	
	Массив = Новый Массив();
	
	Для Каждого ПервыйУровень из ДеревоПКОМ.Строки Цикл
		
		Для Каждого ВторойУровень из ПервыйУровень.Строки Цикл
			
			Если ТипЗнч(ВторойУровень.ПриходныйКассовыйОредер) <> Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				Если ВторойУровень.Выбор Тогда
					Массив.Добавить(ВторойУровень.ПриходныйКассовыйОредер);
				КонецЕсли;
			Иначе
				
				Для Каждого ТретийУровень из ВторойУровень.Строки Цикл
					Если ТретийУровень.Выбор Тогда
						Массив.Добавить(ТретийУровень.ПриходныйКассовыйОредер);
					КонецЕсли;
				КонецЦикла;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
Возврат	 Массив;
	
	
КонецФункции


&НаКлиенте
Процедура ГрупповаяПечать(Команда)
	
	Массив = ПолучитьДокументыДляПечати();
	Параметр = Новый Структура("МассивДокументов", Массив);
	Параметр.Вставить("ФИО", Объект.ФизЛицаФИО);
	Параметр.Вставить("Адрес", Объект.ФизЛицаАдрес);
	Параметр.Вставить("ЛС", Объект.ФизЛицаЛС);
	Параметр.Вставить("УчитыватьАванс", Объект.УчитыватьАванс);

    СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Обработка.бит_ВводПКО.Форма.ФормаПечать", Параметр,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступление(Команда)
	СоздатьПоступлениеНаСервереНовый();
КонецПроцедуры

// БИТ ЖКХ 09.10.2020
&НаСервере
Процедура СоздатьПоступлениеНаСервереНовый()
	
  массивОплатПоКарте = ПолучитьДокументыДляПечати();
  ДеревоПКОМ = РеквизитФормыВЗначение("ДеревоПКО");	
  ПолучитьПодстроки(ДеревоПКОМ);  	
  
  РазбитьПоЛС = истина;
  
  Для каждого оплатаПоКарте Из массивОплатПоКарте Цикл
	  ПлатежныйДокумент = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
	  ПлатежныйДокумент.Дата = Объект.ДатаПоступления;	
	  ПлатежныйДокумент.ДокументОснование = оплатаПоКарте;
	  ПлатежныйДокумент.Заполнить(оплатаПоКарте);	  	
	  
	  если ТипЗнч(оплатаПоКарте.ДокументОснование) = Тип("ДокументСсылка.бит_ОплатаКУ") тогда
	   ДокОснование = оплатаПоКарте.ДокументОснование;  
      конецесли;
   
      если ТипЗнч(оплатаПоКарте.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") тогда
	   ДокОснование = оплатаПоКарте.ДокументОснование.бит_ДокументОснование;  
	  конецесли;	  
	  
	  //БИТ ЖКХ 22.01.2021
	  ПлатежныйДокумент.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДвиженияДенежныхСредств;
	  ПлатежныйДокумент.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Объект.СтатьяДвиженияДенежныхСредств;
	  
	  ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(ДокОснование.Организация, ДокОснование.Дата);	  
	  ТаблицаУСН = ?(ПрименениеУСН, ПолучитьТаблицуУСН(ДокОснование), Неопределено);
	  
	  ПараметрыОтбора = Новый Структура;
	  ПараметрыОтбора.Вставить("ДокументОплаты", ДокОснование);
		
	  НайденныеСтроки = Объект.ОплатыКУ.НайтиСтроки(ПараметрыОтбора);
	  Для Каждого СтрокаТЧНайденныеСтроки Из НайденныеСтроки Цикл
			РазбитьПоЛС = СтрокаТЧНайденныеСтроки.РазбиватьПоЛицевымСчетам;
	  КонецЦикла;
		
	  если РазбитьПоЛС = ложь тогда
	   СуммаПринимаемых = ПолучитьСуммуПолучаемых(ТаблицаУСН);
	  иначе 
	   СуммаПринимаемых = ПолучитьСуммуПолучаемых(ТаблицаУСН, оплатаПоКарте.бит_ЛицевойСчет);
	  конецесли; 
				
	  
	  Если ПрименениеУСН Тогда
		ПлатежныйДокумент.Графа4_УСН	= ПлатежныйДокумент.СуммаДокумента;
		ПлатежныйДокумент.Графа5_УСН	= СуммаПринимаемых;
		ПлатежныйДокумент.Содержание_УСН= Строка(ПлатежныйДокумент.ВидОперации) + ". " + Строка(Объект.СтатьяДвиженияДенежныхСредств) + "."
	  КонецЕсли;
	  ПлатежныйДокумент.Записать();//РежимЗаписиДокумента.Проведение);
	  
	  ПолучитьИЗаписатьПриходныйКассовыйОрдерНаСервере(ПлатежныйДокумент.Ссылка, ПрименениеУСН, СуммаПринимаемых);				
	  
      ПервыйУровень = ДеревоПКОМ.Строки.Найти(оплатаПоКарте.ДокументОснование,"ПриходныйКассовыйОредер");
	  если ПервыйУровень = неопределено тогда
		ПервыйУровень = ДеревоПКОМ.Строки.Найти(оплатаПоКарте.ДокументОснование.бит_ДокументОснование,"ПриходныйКассовыйОредер");  
		ПервыйУровень = ПервыйУровень.Строки.Найти(оплатаПоКарте.ДокументОснование,"ПриходныйКассовыйОредер");
	  конецесли;	  
	  ВторойУровень = ПервыйУровень.Строки.Найти(оплатаПоКарте,"ПриходныйКассовыйОредер");
	  
	  ТретийУровень = ВторойУровень.Строки.Добавить();			

	  ТретийУровень.Выбор                    = Истина;
 	  ТретийУровень.ПриходныйКассовыйОредер  = ПлатежныйДокумент.Ссылка;
	  ТретийУровень.Сумма                    = ПлатежныйДокумент.СуммаДокумента;
	  //ВторойУровень.Этоновый                 = ПлатежныйДокумент.ЭтоНовый();
	  //ВторойУровень.СчетУчета                = Объект.СчетКасса;
	  //ВторойУровень.СтатьяДвиженийДенСредств = Объект.СтатьяДвиженияДенежныхСредств;	

  конеццикла;
  
  ЗначениеВРеквизитФормы(ДеревоПКОМ, "ДеревоПКО");

конецПроцедуры

&НаСервере
Процедура СоздатьПоступлениеНаСервере()
	
  массивОплатПоКарте = ПолучитьДокументыДляПечати();
  Для каждого СтрокаТЧ Из Объект.ОплатыКУ Цикл
	
	 Оплата = СтрокаТЧ.ДокументОплаты;
     ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(Оплата.Организация, Оплата.Дата);
	 СписокЛС =  СтрокаТЧ.ДокументОплаты.СписокЛС;
   	 Отказ = Ложь;	 
	 
	 ТаблицаУСН = ?(ПрименениеУСН, ПолучитьТаблицуУСН(Оплата),Неопределено);
	 РазбиватьПоЛицевымСчетам = СтрокаТЧ.РазбиватьПоЛицевымСчетам;
	 ТранзитныйСчетОплаты = ПолучитьСчет(СтрокаТЧ.Организация);
	 
	 Если СтрокаТЧ.РазбиватьПоЛицевымСчетам Тогда
			
			ТЗСписокЛС = СписокЛС.Выгрузить(,"НомерДок, ЛицевойСчет, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет" 
						+ ", Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, Сумма"
						+ ", СчетАбонента, СчетКУ, Услуга");

			// БИТ ЖКХ 28.01.2020			
            ТЗСписокЛС = СвернутьПоЛицевымСчетам(ТЗСписокЛС);
						
						
			ТЗСписокЛС.Свернуть("НомерДок, ЛицевойСчет, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет" 
						+ ", Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3"
						+ ", СчетАбонента, СчетКУ, Услуга"
						, "Сумма");
    
			Для каждого СтрокаЛС Из ТЗСписокЛС Цикл
						
				//ПроверитьПовторныйВводДокумента(Отказ, Оплата);
				//
				//Если Отказ Тогда
				//	Продолжить;
				//КонецЕсли;
				
				СуммаПринимаемых = ПолучитьСуммуПолучаемых(ТаблицаУСН, СтрокаЛС.ЛицевойСчет);
				
				ДокументЗаписан = Ложь;
							

				ПлатежныйДокумент = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
				////31.07.2019
				если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "НомерДок") = истина тогда
				 ПлатежныйДокумент.НомерВходящегоДокумента = СтрокаТЧ.НомерДок;
				 ПлатежныйДокумент.ДатаВходящегоДокумента = Объект.ДатаПоступления; 
			    конецесли; 
			    ЭтоПоступлениеНаРасчетныйСчет = 1; 
				ЗаполнитьПКОПоступлениеПлатежа(ПлатежныйДокумент, СтрокаЛС, Оплата, ДокументЗаписан, РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых
				,СтрокаТЧ.БанковскийСчет, СтрокаТЧ.ИсточникОплаты);
			КонецЦикла;
    иначе
	       ПлатежныйДокумент = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
		    ////31.07.2019
		   если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "НомерДок") = истина тогда
			 ПлатежныйДокумент.НомерВходящегоДокумента = СтрокаТЧ.НомерДок;
			 ПлатежныйДокумент.ДатаВходящегоДокумента = Объект.ДатаПоступления; 
		   конецесли; 
		   ЭтоПоступлениеНаРасчетныйСчет = 1;
           ЗаполнитьПКОПоступлениеПлатежа(ПлатежныйДокумент, СтрокаТЧ, Оплата, ДокументЗаписан, РазбиватьПоЛицевымСчетам, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых
				,СтрокаТЧ.БанковскийСчет, СтрокаТЧ.ИсточникОплаты);
	КонецЕсли;
		
	

  КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоступления(Команда)
	НастройкаПоступленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастройкаПоступленияНаСервере()
	ЭтоПоступлениеНаРасчетныйСчет = 1;
	УстановитьВидОперации();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьВидОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетКассаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивОтбора = Новый Массив;
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		
		МассивОтбора.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасчетныеСчета"));
		МассивОтбора.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ВалютныеСчета"));
		МассивОтбора.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.СпециальныеСчета"));
		
		СписокВыбора = бит_РаботаСДиалогамиСервер.ЗаполнитьСписокВыбораСчетовДенежныхСредств(МассивОтбора);
		
		Элементы.СчетКасса.СписокВыбора.Очистить();
		
		Для каждого ЭлементМассива из СписокВыбора Цикл
			
			Элементы.СчетКасса.СписокВыбора.Добавить(ЭлементМассива.Значение,ЭлементМассива.Представление);
			
		КонецЦикла;	
		
	Иначе
		
		МассивОтбора = Новый Массив;
		
		МассивОтбора.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Касса"));
		
		МассивИсключений = Новый Массив;
		
		МассивИсключений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДенежныеДокументы"));
		МассивИсключений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДенежныеДокументыВал"));
		
		СписокВыбора = бит_РаботаСДиалогамиСервер.ЗаполнитьСписокВыбораСчетовДенежныхСредств(
		МассивОтбора, , ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.КассаОрганизации"), МассивИсключений);
		
		Элементы.СчетКасса.СписокВыбора.Очистить();
		
		Для каждого ЭлементМассива из СписокВыбора Цикл
			
			Элементы.СчетКасса.СписокВыбора.Добавить(ЭлементМассива.Значение,ЭлементМассива.Представление);
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

// Защита от спама по одной и той же организации.
БылВопросБанковскиеСчета = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");  

#КонецОбласти
