
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мКэшЗначений = Новый Структура;
	
	мКэшЗначений.Вставить("Тип", Неопределено);
	мКэшЗначений.Вставить("Вид", Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Ссылка = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	
	Для Каждого Эл Из Список.Отбор.Элементы Цикл
		
		Если Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизЛицо") Тогда
			
			Если Эл.Использование = Истина Тогда
				
				Ссылка = Эл.ПравоеЗначение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураЭлемента = Новый Структура;
	
	СтруктураЭлемента.Вставить("Тип", ПолучитьТипКонтактнойИнформации(мКэшЗначений.Тип));
	СтруктураЭлемента.Вставить("Вид", ПолучитьВидКонтактнойИнформации(мКэшЗначений.Вид));
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента, СтруктураЭлемента", "КонтактнаяИнформация", СтруктураЭлемента), Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	мКэшЗначений.Тип = ТекущиеДанные.Тип;
	мКэшЗначений.Вид = ТекущиеДанные.Вид;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТипКонтактнойИнформации(Тип)
	
	ТипВЗапросе = "";
	
	Если Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес Тогда
		
		ТипВЗапросе = "Адрес";
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.Телефон Тогда
		
		ТипВЗапросе = "Телефон";
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		
		ТипВЗапросе = "АдресЭлектроннойПочты";
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.Другое Тогда
		
		ТипВЗапросе = "Другое";
		
	КонецЕсли;
	
	Возврат ТипВЗапросе;
 
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидКонтактнойИнформации(Вид)
	
	ВидВЗапросе = "";
	
	Если Вид = Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресПоПрописке";
		
	ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ФактАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресПроживания";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ТелефонПроживающего Тогда
		
		ВидВЗапросе = "Телефон";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ИнформАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресДляИнформирования";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ИнострАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресЗапределамиРФ";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего Тогда
		
		ВидВЗапросе = "ТелефонСлужебный";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.EmailПроживающего Тогда
		
		ВидВЗапросе = "Email";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытияДрРегион Тогда
		
		ВидВЗапросе = "АдресПрибытияИзДругогоРегиона";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ДругаяИнформацияПроживающего Тогда
		
		ВидВЗапросе = "ДругаяИнформация";
		
    КонецЕсли;
	
	Возврат ВидВЗапросе;
 
КонецФункции

#КонецОбласти