Процедура ФоновыеМЛК() Экспорт
	Если Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить() Тогда
		Настройки = Справочники.МЛК_Настройки.Выбрать();
		Пока Настройки.Следующий() Цикл
			Если Настройки.ПометкаУдаления Или Настройки.НеИспользоватьИнтеграцию Или Не ЗначениеЗаполнено(Настройки.АдресКабинетов) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Настройки.ПервичнаяСинхронизацияВыполнена Тогда
				Попытка
					ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПервичнаяСинхронизация",,"ПервичнаяСинхронизация","Первичная синхронизация");
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового Первичная синхронизация","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;
				//Попытка
				//	ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ИмпортПереданныхПоказателейСчетчиков",,"ПоказанияСчетчиков","Загрузка показаний счетчиков");
				//Исключение
				//	МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового Импорт показания счетчиков","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				//КонецПопытки;
				//Попытка
				//	ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПроверкаЗапросовНаКвитанцию",,"Квитанция","Загрузка запросов квитанций");
				//Исключение
				//	МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового запрос квитанции","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				//КонецПопытки;
				//Попытка
				//	ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПроверкаЗапросовНаДетализациюНачислений",,"Детализация","Загрузка запросов детализаций");
				//Исключение
				//	МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового запрос детализаций","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				//КонецПопытки;
				
			Иначе
				Попытка
					ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ИмпортПереданныхПоказателейСчетчиков",,,"Загрузка показаний счетчиков");
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового импорт показаний","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;
				Попытка
					ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ЭкспортПринятыхПоказанийСчетчиков",,,"Выгрузка показаний счетчиков");
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового экспорт показаний в МЛК","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;
				Попытка
					ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ИмпортОплат",,"ЗагрузкаОплат","Загрузка оплат");
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового импорт оплат","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;
				Попытка
					ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПроверкаЗапросовНаКвитанцию",,,"Загрузка запросов квитанций");
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового запрос квитанции","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;
				Попытка
					ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПроверкаЗапросовНаДетализациюНачислений",,,"Загрузка запросов детализаций");
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового запрос детализации","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;
				Попытка
					ФоновыеЗадания.Выполнить("МЛК_Общий.ОбновлениеЛицевыхСчетовИСчетчиков",,,"Обновление ЛС И счетчиков");
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Запуск фонового обновление ЛС И СЧ","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры	

Процедура МЛК_ПервичнаяСинхронизация() Экспорт
	
	Если Не Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		Если  Не Настройки.ПервичнаяСинхронизацияВыполнена Тогда
			//ОбъектНастр = Настройки.ПолучитьОбъект();
			//ОбъектНастр.Прочитать();
			//
			//ОбъектНастр.ПервичнаяСинхронизацияВыполнена           = Ложь;
			//ОбъектНастр.ДатаПервичнойСинхронизации                = "";
			//ОбъектНастр.ДатаПоследнейВыгрузкиПоНачислениям        = "";
			//ОбъектНастр.ДатаПоследнейВыгрузкиПоОплатам            = "";
			//ОбъектНастр.ДатаПоследнейСинхронизацииПоЛицевымСчетам = "";
			//ОбъектНастр.ДатаПоследнейСинхронизацииПоСчетчикам     = "";
			//Попытка
			//	ОбъектНастр.Записать();
			//Исключение
			//КонецПопытки;
			//
			//Если ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоНачислениям) И ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоОплатам)
			//	И ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам) И ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоСчетчикам)
			//	И Не Настройки.ПервичнаяСинхронизацияВыполнена Тогда
			//	ПоставитьГалочкуСинхронизацияВыполнена(Настройки);
			//КонецЕсли;
			//
			
			
			СозданиеСправочников   = СоздатьСправочникиДляРаботыСМЛК(Настройки);
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Синхронизация. Справочники "+Строка(СозданиеСправочников),"",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
			
			СинхронизацияЛС        = ОтправитьВсеЛицевыеСчетаНаСервере(Истина);
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Синхронизация. Лицевые счета "+Строка(СинхронизацияЛС),"",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
			
			СинхронизацияСчетчиков = ОтправитьВсеСчетчикиНаСервереПервый(Истина);
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Синхронизация. Счетчики "+Строка(СинхронизацияСчетчиков),"",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
			
			КороткиеСсылки         = СоздатьКороткиеСсылки(Истина,Настройки);
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Синхронизация. Короткие ссылки "+Строка(КороткиеСсылки),"",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
			
			ИсторияОплат           = ОтправитьИсториюОплат();
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Синхронизация. История оплат "+Строка(ИсторияОплат),"",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
			
			ИсторияНачислений      = ОтправитьИсториюНачислений();
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Синхронизация. История начислений "+Строка(ИсторияНачислений),"",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
			
			
			Если ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоНачислениям) И ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоОплатам)
				И ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам) И ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоСчетчикам) Тогда
				ПоставитьГалочкуСинхронизацияВыполнена(Настройки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ПоставитьГалочкуСинхронизацияВыполнена(Настройки)
	МЛК_Общий.ЗаписатьДанныеВЖурнал("Синхронизация. Запись справочника ","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
	ОбъектНастройки = Настройки.ПолучитьОбъект();
	ОбъектНастройки.Прочитать();
	
	ОбъектНастройки.ПервичнаяСинхронизацияВыполнена             = Истина;
	ОбъектНастройки.ДатаПервичнойСинхронизации                  = ТекущаяДатаСеанса();
	Попытка
		ОбъектНастройки.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура МЛК_ОбновлениеЛицевыхСчетовИСчетчиков() Экспорт
	
	Если Не Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СинхронизацияЛС        = ОтправитьВсеЛицевыеСчетаНаСервере(Ложь);
	СинхронизацияСчетчиков = ОтправитьВсеСчетчикиНаСервереПервый(Ложь);
	
	ИсторияОплат           = ОтправитьИсториюОплат();
	ИсторияНачислений      = ОтправитьИсториюНачислений();
	
КонецПроцедуры

Процедура МЛК_ИмпортПереданныхПоказателейСчетчиков() Экспорт
	
	Если Не Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СинхронизацияСчетчиков = ПодгрузитьПоказания();
КонецПроцедуры

#Область Журнал
Функция ПроверитьЕстьЛиИнтернетСоединение()
	Прокси = Неопределено; 
	// устанавливаем соединение с сервером 
	Попытка 
		Соединение = Новый HTTPСоединение("yandex.ru", , , , Прокси, 300);
	Исключение 
		ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		ИмяСобытияВЖурнал = "Проверка интернета";
		КодСостояния = "";
		СтрокаОтвета = "Интернета нет";	
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,"",СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ТекущаяДатаСеанса());	
		Возврат Ложь; 
	КонецПопытки; 
	Возврат Истина;
КонецФункции
Процедура ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,СтрокаЗапроса,СтрокаОтвета,СтрокаОшибки1С,ВремяНачало) Экспорт
	
	СтрокаЗапросаНовая = ЗначениеВСтрокуВнутр(СтрокаЗапроса);
	
	НоваяЗапись = РегистрыСведений.МЛК_ЖурналОшибокИнтеграции.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период              = ТекущаяДатаСеанса();
	НоваяЗапись.ВидЗапроса          = ИмяСобытияВЖурнал;
	НоваяЗапись.КодОшибки           = КодСостояния;
	НоваяЗапись.СтрокаЗапроса       = СтрокаЗапросаНовая;
	НоваяЗапись.СтрокаОтвета        = СтрокаОтвета;
	НоваяЗапись.СтрокаОшибкиОт1с    = СтрокаОшибки1С;
	НоваяЗапись.ВремяНачало         = ВремяНачало;
	НоваяЗапись.Записать();
	
КонецПроцедуры
#КонецОбласти

#Область Создание_Справочников_МЛК
Функция СоздатьСправочникиДляРаботыСМЛК(Настройки)
	ЕстьАгент         = ПолучитьАгентаНаСервере(Настройки);
	ТипКомиссии       = ОтправитьТипКомиссииВМЛК(Настройки); 
	ДанныеОрганизации = ОтправитьДанныеОрганизацииВМЛК(Настройки);
	Если ЕстьАгент И ТипКомиссии И ДанныеОрганизации Тогда
		// Журнал
		ИмяСобытияВЖурнал = "СОЗДАНИЕ АГЕНТА ДА";
		КодСостояния = "СОЗДАНИЕ АГЕНТА ДА";
		СтрокаОтвета = "";	
		ЖурналСтрокаОписанияОшибки = "";
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,"",СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ТекущаяДатаСеанса());	
		
		Возврат Истина;
	Иначе
		// Журнал
		ИмяСобытияВЖурнал = "СОЗДАНИЕ АГЕНТА НЕТ"+СТрока(ЕстьАгент)+Строка(ТипКомиссии)+СТрока(ДанныеОрганизации);
		КодСостояния = "СОЗДАНИЕ АГЕНТА НЕТ";
		СтрокаОтвета = "";	
		ЖурналСтрокаОписанияОшибки = "";
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,"",СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецЕсли;
КонецФункции
Функция ПолучитьАгентаНаСервере(Настройки)
	
	АдресСервисаСтр = Настройки.АдресКабинетов;
	Соединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос        = Новый HTTPЗапрос("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	ЖурналВремяНачало = ТекущаяДатаСеанса();
	ЖурналЗапросБезКодировки   = Строка(АдресСервисаСтр)+Строка("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	
	Результат    = Соединение.Получить(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		ИмяСобытияВЖурнал = "Получение ключа для создания агента";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат ложь;	
	КонецЕсли; 
	
	РезультатПроверки    = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	Ключ = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Значение");
	Для Каждого стр Из ЗагруженныеДанные Цикл
		Если СокрЛП(стр.Ключ)= "access_token" Тогда
			Ключ            = Стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для клонирования";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	Иначе
		
	КонецЕсли;
	
	
	Успешных=0;Всего=0;
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса = "/api/v8/agentdata/"+Строка(СокрЛП(Настройки.НомерПриложения));	
	// Журнал
	ЖурналЗапросБезКодировки = Строка(АдресСервисаСтр)+Строка(АдресРесурса);
	
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer "+Строка(Ключ));  
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Получение данных агента","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
			РезультатПроверки = СтрокаОтвет;
			Если СокрЛП(РезультатПроверки)="false" Тогда
				
			Иначе
				
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
				ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
				ЧтениеJSON.Закрыть();
				
				ТЗ = РаспарситьДанныеАгентаИСоздатьВСправочнике(ЗагруженныеДанные,Настройки);
				// СоздатьАгентаАСправочнике(ТЗ,Настройки);
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции
Функция РаспарситьДанныеАгентаИСоздатьВСправочнике(Данные,Настройки)	
	Для Каждого стр Из Данные Цикл
		ИНН = стр.Значение[0]["attributes"]["agentdata"]["inn"];
		КПП = стр.Значение[0]["attributes"]["agentdata"]["kpp"];
		БИК = стр.Значение[0]["attributes"]["agentdata"]["inn"];
		НаименованиеБанка   = стр.Значение[0]["attributes"]["agentdata"]["bank"];
		НомерСчет           = стр.Значение[0]["attributes"]["agentdata"]["bankingAccount1"];
		КорСчет             = стр.Значение[0]["attributes"]["agentdata"]["bankingAccount2"];
		Наименование        = стр.Значение[0]["attributes"]["agentdata"]["shortName"];
		НаименованиеПолное  = стр.Значение[0]["attributes"]["agentdata"]["fullName"];
		
		
		// Создадим контрагента
		НайденнаяСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
		Если НайденнаяСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
			НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйЭлемент.Наименование       = Наименование;
			НовыйЭлемент.НаименованиеПолное = НаименованиеПолное;
			НовыйЭлемент.ИНН                = ИНН;
			НовыйЭлемент.КПП                = КПП;
			ЮрФизЛицо = ?(СтрДлина(СокрЛП(НовыйЭлемент.ИНН)) = 12 И ПустаяСтрока(НовыйЭлемент.КПП),
			Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо,
			Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
			НовыйЭлемент.ЮридическоеФизическоеЛицо = ЮрФизЛицо;
			Если НовыйЭлемент.ПолучитьСсылкуНового().Пустая() Тогда
				НовыйЭлемент.УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку());
			КонецЕсли;
			НовыйЭлемент.ГоловнойКонтрагент = НовыйЭлемент.ПолучитьСсылкуНового();
			НовыйЭлемент.Записать();
		Иначе
			НовыйЭлемент = НайденнаяСсылка.ПолучитьОбъект();
			НовыйЭлемент.Наименование       = Наименование;
			НовыйЭлемент.НаименованиеПолное = НаименованиеПолное;
			НовыйЭлемент.Записать();
		КонецЕсли;
		
		// Договор
		Попытка
			
			СуществующийДоговор = ПроверитьДоговор(НовыйЭлемент.Ссылка,Настройки.Организация);
			
			Если СуществующийДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
				НайденныйДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
				НайденныйДоговорОбъект.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
				НайденныйДоговорОбъект.Организация          = Настройки.Организация;
				НайденныйДоговорОбъект.Владелец             = НовыйЭлемент.Ссылка;
				
				НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
				
				НайденныйДоговорОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Основной договор (%1)'"), НРег(""));
				НайденныйДоговорОбъект.Записать();
				НайденныйДоговор = НайденныйДоговорОбъект.Ссылка;
				
				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				Если НЕ РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
					ОсновнойДоговорКонтрагента,
					НовыйЭлемент.Ссылка,
					Настройки.Организация) Тогда
					
					РаботаСДоговорамиКонтрагентовБП.УстановитьОсновнойДоговорКонтрагента(НайденныйДоговор);
				КонецЕсли;
			КонецЕсли;
			// СтекОповещений.Добавить(Новый Структура("Ссылка", НайденныйДоговор));
		Исключение
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Парсинг И создание агента","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		КонецПопытки;
		
		// Банковские счета
		НомерСчета = НомерСчет;
		
		СчетКонтрагента = ПроверитьСчетКонтрагента(НовыйЭлемент.Ссылка,НомерСчета);
		Если СчетКонтрагента = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
			НовыйСчет  = Справочники.БанковскиеСчета.СоздатьЭлемент();
			
			НовыйСчет.НомерСчета = НомерСчета;
			НовыйСчет.Владелец   = НовыйЭлемент.Ссылка;
			НовыйСчет.ВидСчета   = "Расчетный";
			НовыйСчет.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить();
			
			
			НовыйБанкКорр = НайтиБанкПоБикИлиКоррСчету(БИК, КорСчет);
			Если НовыйБанкКорр = Справочники.Банки.ПустаяСсылка() Тогда
				НовыйБанкКорр = Справочники.Банки.СоздатьЭлемент();
				НовыйБанкКорр.Наименование = НаименованиеБанка;
				НовыйБанкКорр.Город        = "";
				НовыйБанкКорр.Код          = БИК;
				НовыйБанкКорр.КоррСчет     = КорСчет;
				НовыйБанкКорр.Записать();
			КонецЕсли;
			НовыйСчет.БанкДляРасчетов = НовыйБанкКорр.Ссылка;
			НовыйСчет.Банк = НовыйБанкКорр.Ссылка;
			Если ЗначениеЗаполнено(НовыйСчет.Банк) ИЛИ ЗначениеЗаполнено(НовыйСчет.БанкДляРасчетов) Тогда
				БанкДляНаименования    = ?(ЗначениеЗаполнено(НовыйСчет.Банк), НовыйСчет.Банк, НовыйСчет.БанкДляРасчетов);
				НовыйСчет.Наименование = Лев(НовыйСчет.НомерСчета + ", " + БанкДляНаименования, 100);
				НовыйСчет.Записать();
				
				Если НЕ ЗначениеЗаполнено(НовыйЭлемент.ОсновнойБанковскийСчет) Тогда
					НовыйЭлемент.ОсновнойБанковскийСчет = НовыйСчет.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		НовыйЭлемент.Записать();
		Если Не ЗначениеЗаполнено(Настройки.ПлатежныйАгент) Тогда
			Об = Настройки.ПолучитьОбъект();
			Об.Прочитать();
			
			Об.ПлатежныйАгент = НовыйЭлемент.Ссылка;
			об.ВидОплатыОрганизации = Справочники.ВидыОплатОрганизаций.НайтиПоНаименованию("Mobsted");
			Попытка
				Об.Записать();
			Исключение
				
			КонецПопытки;
		КонецЕсли;
		ПолучитьИСоздатьВидОплатыСКомиссиейНаСервере(Настройки);
		Возврат Истина;
	КонецЦикла;	
КонецФункции
Функция ПроверитьДоговор(Контрагент,Организация)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	РЗ = Запрос.Выполнить();
	ВыборДоговора = РЗ.Выбрать();
	Если ВыборДоговора.Следующий() Тогда
		Возврат ВыборДоговора.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции	
Функция ПроверитьСчетКонтрагента(Контрагент,НомерСчета) 
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И БанковскиеСчета.НомерСчета = &НомерСчета";
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	Запрос.УстановитьПараметр("НомерСчета",НомерСчета);
	РЗ = Запрос.Выполнить();
	ВыборСчета = РЗ.Выбрать();
	Если ВыборСчета.Следующий() Тогда
		Возврат ВыборСчета.Ссылка;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
КонецФункции
Функция НайтиБанкПоБикИлиКоррСчету(БИК, КоррСчет)
	
	НайденныйБанк = Справочники.Банки.ПустаяСсылка();
	
	Если НЕ ПустаяСтрока(БИК) Тогда
		НайденныйБанк = Справочники.Банки.НайтиПоКоду(БИК);
	КонецЕсли;
	
	Если НайденныйБанк = Справочники.Банки.ПустаяСсылка() Тогда
		НайденныйБанк = Справочники.Банки.НайтиПоРеквизиту("КоррСчет", КоррСчет);
	КонецЕсли;
	
	Возврат НайденныйБанк;
	
КонецФункции
Функция ОтправитьТипКомиссииВМЛК(Настройки)
	
	
	ЖурналВремяНачало = ТекущаяДатаСеанса();
	АдресСервисаСтр=Настройки.АдресКабинетов;
	Соединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос        = Новый HTTPЗапрос("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	
	ЖурналЗапросБезКодировки   = Строка(АдресСервисаСтр)+Строка("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	
	
	Результат    = Соединение.Получить(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		ИмяСобытияВЖурнал = "Получение ключа для комиссии";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	КонецЕсли; 
	
	РезультатПроверки    = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	// в теле результата запроса - json
	Ключ = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Значение");
	Для Каждого стр Из ЗагруженныеДанные Цикл
		Если СокрЛП(стр.Ключ)= "access_token" Тогда
			Ключ            = Стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для комиссии";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	Иначе
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для комиссии";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
	КонецЕсли;
	
	АдресСервисаСтр = Настройки.АдресКабинетов;
	АдресРесурса1 = "/api/v8/taxtype/"+Настройки.НомерПриложения;
	
	ТипКомиссии = "";
	Если Настройки.Комиссия = Перечисления.МЛК_Комиссия.КомиссияСверху Тогда
		ТипКомиссии = "1";
	Иначе
		ТипКомиссии = "0";
	КонецЕсли;	
	
	СтрокаПараметров     = "taxtype="+Строка(КодироватьСтроку(ТипКомиссии,СпособКодированияСтроки.КодировкаURL));
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");  
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer "+Строка(Ключ));  
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка типа комиссии","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаОтвет);
			ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
			ЧтениеJSON.Закрыть();
			
			Возврат ИстинА;
			
		КонецЕсли;
		Возврат ИстинА;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
Функция ОтправитьДанныеОрганизацииВМЛК(Настройки)
	
	АдресСервисаСтр = Настройки.АдресКабинетов;
	Соединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос        = Новый HTTPЗапрос("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	ЖурналВремяНачало = ТекущаяДатаСеанса();
	ЖурналЗапросБезКодировки   = Строка(АдресСервисаСтр)+Строка("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	Результат    = Соединение.Получить(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		ИмяСобытияВЖурнал = "Получение ключа для отправки данных в МЛК";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	КонецЕсли; 
	
	РезультатПроверки    = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	// в теле результата запроса - json
	Ключ = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Значение");
	Для Каждого стр Из ЗагруженныеДанные Цикл
		Если СокрЛП(стр.Ключ)= "access_token" Тогда
			Ключ            = Стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для передачи параметров УК НЕТ";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	Иначе
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для передачи параметров УК ДА";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
	КонецЕсли;
	
	// Получили токен теперь клонируем
	
	// Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	// Журнал
	
	АдресСервисаСтр = Настройки.АдресКабинетов;
	АдресРесурса1 = "/api/v8/clientdata/"+Настройки.НомерПриложения;
	
	НаименованиеОрганизации = Настройки.Организация.НаименованиеПолное;
	НаименованиеОрганизации = СтрЗаменить(НаименованиеОрганизации,"""","\""");
	НаименованиеОрганизацииКратко = Настройки.Организация.НаименованиеСокращенное;
	НаименованиеОрганизацииКратко = СтрЗаменить(НаименованиеОрганизацииКратко,"""","\""");
	НаименованиеБанка = Настройки.БанковскийСчет.Банк.Наименование;
	НаименованиеБанка = СтрЗаменить(НаименованиеБанка,"""","\""");
	
	
	ОргСведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Настройки.Организация, ТекущаяДатаСеанса(), Неопределено);
	ИДОрганизации = СтрЗаменить(ИДОрганизации,"-","");	
	ТелефонОрганизации = УбратьНенужныеСимволы(ОргСведения.ТелОрганизации);
	
	ПараметрыОрганизации = 
	"{"
	+"""fullName"""             +":"+ """"+НаименованиеОрганизации+""""+","
	+"""shortName"""            +":"+ """"+НаименованиеОрганизацииКратко+""""+","
	+"""inn"""                  +":"+ """"+Настройки.Организация.ИНН+""""+","
	+"""kpp"""                  +":"+ """"+Настройки.Организация.КПП+""""+","
	+"""email"""                +":"+ """"+Строка(ОргСведения.АдресЭлектроннойПочтыОрганизации)+""""+","
	+"""phone"""                +":"+ """"+ТелефонОрганизации+""""+","
	+"""bankingAccount1"""      +":"+ """"+Настройки.БанковскийСчет.НомерСчета+""""+","
	+"""bank"""                 +":"+ """"+НаименованиеБанка+""""+","
	+"""bankingAccount2"""      +":"+ """"+Настройки.БанковскийСчет.Банк.КоррСчет+""""+","
	+"""bik"""                  +":"+ """"+Настройки.БанковскийСчет.банк.Код+""""
	+"}";
	
	ЖурналЗапросБезКодировки = ЖурналЗапросБезКодировки + "&params=" + ПараметрыОрганизации;
	
	СтрокаПараметров = "";
	
	СтрокаПараметров = СтрокаПараметров + "?clientdata=" + Строка(ПараметрыОрганизации);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1+СтрокаПараметров);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");  
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer "+Строка(Ключ));  
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Записать(HTTPЗапрос);
	Исключение
		ИмяСобытияВЖурнал = "Передача параметров организации нет 1";
		КодСостояния = "";
		СтрокаОтвета = "";	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаОтвет);
			ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
			ЧтениеJSON.Закрыть();
			
			РезультатПроверки = СтрокаОтвет;
			Результат = РезультатПроверки;
			Возврат Истина;
		КонецЕсли;
		ИмяСобытияВЖурнал = "Передача параметров организации УСПЕШНО";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат ИстинА;
	Иначе
		ИмяСобытияВЖурнал = "Передача параметров организации Нет 2";
		КодСостояния = Ответ.КодСостояния;
		СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,СтрокаПараметров,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	
Процедура ПолучитьИСоздатьВидОплатыСКомиссиейНаСервере(Настройки)
	
	АдресСервисаСтр = Настройки.АдресКабинетов;
	Соединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос        = Новый HTTPЗапрос("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	ЖурналВремяНачало = ТекущаяДатаСеанса();
	ЖурналЗапросБезКодировки   = Строка(АдресСервисаСтр)+Строка("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	
	
	Результат    = Соединение.Получить(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		ИмяСобытияВЖурнал = "Получение ключа для клонирования";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат;	
	КонецЕсли; 
	
	РезультатПроверки    = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	// в теле результата запроса - json
	Ключ = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Значение");
	Для Каждого стр Из ЗагруженныеДанные Цикл
		Если СокрЛП(стр.Ключ)= "access_token" Тогда
			Ключ            = Стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для клонирования";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат;	
	Иначе
		
	КонецЕсли;
	
	
	Успешных=0;Всего=0;
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса = "/api/v8/tax/"+Строка(СокрЛП(Настройки.НомерПриложения));	
	ЖурналЗапросБезКодировки = Строка(АдресСервисаСтр)+Строка(АдресРесурса);
	
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer "+Строка(Ключ));  
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Получение И создание вида оплат","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
			РезультатПроверки = СтрокаОтвет;
			Если СокрЛП(РезультатПроверки)="false" Тогда
				
			Иначе
				
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
				ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
				ЧтениеJSON.Закрыть();
				
				ТЗ = РаспарситьДанныеКомиссии(ЗагруженныеДанные,Настройки);
				// СоздатьАгентаАСправочнике(ТЗ,Настройки);
				
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
	КонецЕсли;
КонецПроцедуры
Функция РаспарситьДанныеКомиссии(Данные,Настройки)	
	
	Для Каждого стр Из Данные Цикл
		
		Комиссия1 = стр.Значение[0]["attributes"]["tax"]["bankTax"];
		Комиссия2 = стр.Значение[0]["attributes"]["tax"]["mbstTax"];
		
		ВиоОплаты  = НайтиВидОплаты(Комиссия1,Комиссия2,Настройки);
	КонецЦикла;	
	
КонецФункции
Функция НайтиВидОплаты(Комиссия1,Комиссия2,Настройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	|	ВидыОплатОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОплатОрганизаций КАК ВидыОплатОрганизаций
	|ГДЕ
	|	ВидыОплатОрганизаций.ПометкаУдаления = ЛОЖЬ
	|	И ВидыОплатОрганизаций.Организация = &Организация
	|	И ВидыОплатОрганизаций.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Организация",Настройки.Организация);
	Запрос.УстановитьПараметр("Контрагент",Настройки.ПлатежныйАгент);
	Если Запрос.Выполнить().Пустой() Тогда
		НовВид = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
		НовВид.ПроцентБанковскойКомиссии = Число(Комиссия1)+Число(Комиссия2);
		НовВид.Наименование = Настройки.ПлатежныйАгент.Наименование;
		НовВид.Контрагент = Настройки.ПлатежныйАгент;
		НовВид.Организация = Настройки.Организация;
		НовВид.ТипОплаты   = Перечисления.ТипыОплат.ПлатежнаяКарта;
		новвид.СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;
		НовВид.ДоговорКонтрагента = ПроверитьДоговор(Настройки.ПлатежныйАгент,Настройки.Организация);
		НовВид.Записать();
	Иначе
		РЗ = Запрос.Выполнить();
		Выб = РЗ.Выбрать();
		Если Выб.Следующий() Тогда
			Возврат Выб.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции	
Функция УбратьНенужныеСимволы(Элемент, Символ="")
	Перем Результат;
	Результат=Строка(Элемент);
	
	Результат = СтрЗаменить(Результат,Символы.Нпп,Символ);
	Результат = СтрЗаменить(Результат,"/",Символ);
	Результат = СтрЗаменить(Результат,"\",Символ);
	Результат = СтрЗаменить(Результат,".",Символ);
	Результат = СтрЗаменить(Результат,",",Символ);
	//Результат = СтрЗаменить(Результат,"+",Символ);
	Результат = СтрЗаменить(Результат,"-",Символ);
	Результат = СтрЗаменить(Результат,"!",Символ);
	Результат = СтрЗаменить(Результат,"@",Символ);
	Результат = СтрЗаменить(Результат,"#",Символ); 
	Результат = СтрЗаменить(Результат,"$",Символ);
	Результат = СтрЗаменить(Результат,"%",Символ);
	Результат = СтрЗаменить(Результат,"^",Символ);
	Результат = СтрЗаменить(Результат,"&",Символ);
	Результат = СтрЗаменить(Результат,"*",Символ);
	Результат = СтрЗаменить(Результат,"(",Символ);
	Результат = СтрЗаменить(Результат,")",Символ);
	Результат = СтрЗаменить(Результат,"№",Символ);
	Результат = СтрЗаменить(Результат,";",Символ);
	Результат = СтрЗаменить(Результат,":",Символ);
	Результат = СтрЗаменить(Результат,"?",Символ);
	Результат = СтрЗаменить(Результат," ",Символ);
	Возврат Результат;
	ТекНомерТелефона="";счетчик=0;ПервоеВхождение=ложь;
	Для Индекс = 1 По СтрДлина(Результат) Цикл
		Символ = Сред(Результат, Индекс, 1); 
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
			// ТекНомерТелефона = ТекНомерТелефона + Символ;
			Если Символ="9" И ПервоеВхождение=ложь Тогда
				ПервоеВхождение=Истина;
				
			КонецЕсли;
			Если ПервоеВхождение  Тогда
				ТекНомерТелефона = ТекНомерТелефона + Символ;
				Счетчик=Счетчик+1;
			КонецЕсли;
			Если Счетчик=10 Тогда
				ТекНомерТелефона="+7"+ТекНомерТелефона;
				Возврат ТекНомерТелефона;
			КонецЕсли;
			
		ИначеЕсли СтрДлина(ТекНомерТелефона) > 0 Тогда
			// ТекНомерТелефона = "";
		КонецЕсли;
	КонецЦикла;
	
КонецФункции
#КонецОбласти

#Область Отправка_Лицевых_Счетов_В_Систему_МЛК
Функция ОтправитьВсеЛицевыеСчетаНаСервере(Первичный)
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		// 1. Лицевые счета
		
		Если ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоНачислениям) И ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоОплатам)
			И ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам) И ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоСчетчикам)
			И Не Настройки.ПервичнаяСинхронизацияВыполнена Тогда
			ПоставитьГалочкуСинхронизацияВыполнена(Настройки);
		КонецЕсли;
		
		Если Первичный И Настройки.ПервичнаяСинхронизацияВыполнена Тогда
			Продолжить; 
		КонецЕсли;
		
		Если НачалоДня(Настройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Возврат Истина;
		КонецЕсли;
		
		ТаблицаЛС = ПолучитьТаблицуЛицевыхСчетов(Настройки);
		Если ОтправитьВСистемуМЛКЛицевойСчет(Настройки,ТаблицаЛС,Первичный) Тогда
			ОбъектНастройки = Настройки.ПолучитьОбъект();
			ОбъектНастройки.Прочитать();
			ОбъектНастройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам   = ТекущаяДатаСеанса();
			Попытка
				ОбъектНастройки.Записать();
			Исключение
			КонецПопытки;
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	КонецЦикла;	
	Возврат Ложь;
КонецФункции
Функция ПолучитьТаблицуЛицевыхСчетов(Настройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.ПометкаУдаления = ЛОЖЬ
	|	И бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И бит_ЛицевыеСчета.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Настройки.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
КонецФункции	
Функция ОтправитьВСистемуМЛКЛицевойСчет(Настройки,ТаблицаЛС,Первичный) Экспорт
	
	// Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	ЖурналЗапросБезКодировкиМассив = Новый Массив;
	// Журнал
	
	СтрокаПараметров = "";
	Счетчик = 0;
	Пакет = 0;
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса1 = "/api/v6/objects/createupdate";
	
	// Журнал
	ЖурналЗапросБезКодировки = Строка(АдресСервисаСтр)+Строка(АдресРесурса1);
	
	Для Каждого Выборка Из ТаблицаЛС Цикл
		
		Если Счетчик = 100 Тогда
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка ЛС в МЛК",,ЖурналЗапросБезКодировки,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				Возврат Ложь;
			КонецПопытки;
			
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				Если Не ПустаяСтрока(СтрокаОтвет) Тогда
					РезультатПроверки = СтрокаОтвет;
					Результат = РезультатПроверки;
					
				КонецЕсли;
			Иначе
				ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
				// Журнал
				ИмяСобытияВЖурнал = "Отправка всех лицевых счетов в МЛК - 1";
				КодСостояния = Ответ.КодСостояния;
				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				СтрокаОтвета = СтрокаОтвет;	
				МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
				Возврат Ложь;
			КонецЕсли;
			Счетчик = 0;
			Запрос1 = "";
			Запрос2 = "";
			ЖурналЗапросБезКодировки = "";
			СтрокаПараметров = "";
			
			Продолжить;
		КонецЕсли;	
		
		Структура = ПолучитьСтруктуруДанныхЛицевогоСчета(Выборка.Ссылка,Настройки);
		ТекущаяСтрока = Структура;
		Запрос1 = "{"+"""ApplicationId"""+":"++Строка(СокрЛП(Настройки.НомерПриложения))+","+"""НомерЛицевогоСчета"""+":"+""""+Строка(Выборка.Ссылка.Наименование)+""""+"}";
		Если Первичный Тогда
			Запрос2 = "{"+
			"""Код1С"""   +":"+""""+Строка(Выборка.Ссылка.Код)+""""+","+
			"""Наименование"""   +":"+""""+Строка(ТекущаяСтрока.Имя_Отчество)+""""+","+
			"""Phone"""   +":"+""""+Строка(ТекущаяСтрока.Phone)+""""+","+
			"""Email"""+":"+""""+Строка(ТекущаяСтрока.Email)+""""+","+
			"""1СТелефон"""     +":"+""""+Строка(ТекущаяСтрока.Phone)+""""+","+
			"""1СИмя"""   +":"+""""+Строка(ТекущаяСтрока.Имя_Отчество)+""""+","+
			"""1СEmail"""     +":"+""""+Строка(ТекущаяСтрока.Email)+""""+","+
			"""НомерЛицевогоСчета"""+":"+""""+Строка(Выборка.Ссылка.Наименование)+""""+","+
			"""ЛС"""+":"+""""+Строка(Выборка.Ссылка.Наименование)+""""+","+
			"""Помещение"""   +":"+""""+Строка(ТекущаяСтрока.Помещение)+""""+","+
			"""НомерКвартиры"""  +":"+""""+Строка(ТекущаяСтрока.Квартира)+""""+","+
			"""Enabled"""   +":"+""""+Строка(1)+""""+","+
			"""ApiSumma"""   +":"+""""+Формат(ТекущаяСтрока.ApiSumma,"ЧРД=.; ЧГ=0; ЧДЦ=2")+""""+","+    
			"""ApiDate"""   +":"+""""+Формат(ТекущаяДатаСеанса(),"ДЛФ=Д")+""""+"}";
		Иначе
			Запрос2 = "{"+
			"""Код1С"""   +":"+""""+Строка(Выборка.Ссылка.Код)+""""+","+
			"""1СТелефон"""     +":"+""""+Строка(ТекущаяСтрока.Phone)+""""+","+
			"""1СИмя"""   +":"+""""+Строка(ТекущаяСтрока.Имя_Отчество)+""""+","+
			"""1СEmail"""     +":"+""""+Строка(ТекущаяСтрока.Email)+""""+","+
			"""НомерЛицевогоСчета"""+":"+""""+Строка(Выборка.Ссылка.Наименование)+""""+","+
			"""ЛС"""+":"+""""+Строка(Выборка.Ссылка.Наименование)+""""+","+
			"""Помещение"""   +":"+""""+Строка(ТекущаяСтрока.Помещение)+""""+","+
			"""НомерКвартиры"""  +":"+""""+Строка(ТекущаяСтрока.Квартира)+""""+","+
			"""Enabled"""   +":"+""""+Строка(1)+""""+","+
			"""ApiSumma"""   +":"+""""+Формат(ТекущаяСтрока.ApiSumma,"ЧРД=.; ЧГ=0; ЧДЦ=2")+""""+","+    
			"""ApiDate"""   +":"+""""+Формат(ТекущаяДатаСеанса(),"ДЛФ=Д")+""""+"}";
		КонецЕсли;
		
		Если СтрокаПараметров = "" Тогда
			ЖурналЗапросБезКодировкиМассив.Добавить("create"+Счетчик+"="+Запрос1+"&update"+Счетчик+"="+Запрос2);
		Иначе
			ЖурналЗапросБезКодировкиМассив.Добавить("&create"+Формат(Счетчик,"ЧГ=")+"="+Запрос1+"&update"+Формат(Счетчик,"ЧГ=")+"="+Запрос2);
		КонецЕсли;
		
		Запрос1 = КодироватьСтроку(Запрос1,СпособКодированияСтроки.КодировкаURL);
		Запрос2 = КодироватьСтроку(Запрос2,СпособКодированияСтроки.КодировкаURL);
		
		Если СтрокаПараметров = "" Тогда
			СтрокаПараметров = "create"+Счетчик+"="+Запрос1+"&update"+Счетчик+"="+Запрос2;
		Иначе
			СтрокаПараметров = СтрокаПараметров+"&create"+Формат(Счетчик,"ЧГ=")+"="+Запрос1+"&update"+Формат(Счетчик,"ЧГ=")+"="+Запрос2;
		КонецЕсли;
		
		Счетчик=Счетчик+1;	
	КонецЦикла;
	
	
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		// Журнал
		ИмяСобытияВЖурнал = "Отправка всех лицевых счетов в МЛК - 2";
		// СтрокаОтвета = СтрокаОтвета + " Пакет " + Строка(Пакет);	
		СтрокаОтвета = "";	
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,,ЖурналЗапросБезКодировкиМассив,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		// МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка всех лицевых счетов в МЛК - 1.1",,ЖурналЗапросБезКодировкиМассив,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
	Иначе
		ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		// Журнал
		ИмяСобытияВЖурнал = "Отправка всех лицевых счетов в МЛК - 3";
		КодСостояния = Ответ.КодСостояния;
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировкиМассив,СтрокаОтвет,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции
Функция ПолучитьСтруктуруДанныхЛицевогоСчета(ЛицевойСчет,Настройки)
	Структура = Новый Структура("Phone, Email, Имя_Отчество, Город, Улица, Дом, Корпус, Квартира, ApiSumma, Помещение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиесяПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиесяПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиесяПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	ПроживающиесяПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиесяПоЛССрезПоследних.ДатаЗаписи,
	|	ПроживающиесяПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиесяПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиесяПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиесяПоЛССрезПоследних.СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиесяПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"		, КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ЛицевойСчет"	, ЛицевойСчет.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
			ОтветственноеЛицо = Выборка.ФизЛицо;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ВладелецЛицевогоСчета = ОтветственноеЛицо;
	
	Если Настройки.ПередаватьФамилию Тогда
		// Структура.Имя_Отчество        = ВладелецЛицевогоСчета.Наименование; 
		Структура.Имя_Отчество        = СтрЗаменить(ВладелецЛицевогоСчета.Наименование,"""","\"+"""");
	Иначе
		Попытка
			ИмяОтчество = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВладелецЛицевогоСчета.Наименование);
			Структура.Имя_Отчество        = СтрЗаменить(Строка(ИмяОтчество.Имя)+" "+Строка(ИмяОтчество.Отчество),"""","\"+"""");
		Исключение
			Структура.Имя_Отчество        = "";
		КонецПопытки;
	КонецЕсли;
	
	// Структура.Имя_Отчество = Транслит(Структура.Имя_Отчество);
	Если ЗначениеЗаполнено(ВладелецЛицевогоСчета) Тогда
		Телефон              = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(ВладелецЛицевогоСчета);
		Тел = СтрЗаменить(Телефон,"-","");
		Тел = СтрЗаменить(Тел,"+7","7");
		Тел = СтрЗаменить(Тел,"-","");
		Тел = СтрЗаменить(Тел,"(","");
		Тел = СтрЗаменить(Тел,")","");
		Тел = СтрЗаменить(Тел,Символы.НПП,"");
		Тел = СтрЗаменить(СокрЛП(Тел)," ","");
		Если Лев(Тел,1)="8" И СтрДлина(Тел)>6 Тогда
			//	Тел = СтрЗаменить(Лев(Тел,1),"8","7");
			тел="7" + Прав(тел,СтрДлина(тел)-1);
		КонецЕсли;
		
		Структура.Phone               = Тел;
		
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	КонтактнаяИнформация.Представление КАК Представление,
		//|	КонтактнаяИнформация.Вид КАК Вид
		//|ИЗ
		//|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		//|ГДЕ
		//|	КонтактнаяИнформация.Объект = &Объект
		//|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		//|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.EmailПроживающего)";
		//
		//Запрос.УстановитьПараметр("Объект", ВладелецЛицевогоСчета);
		//Выборка = Запрос.Выполнить().Выбрать();
		//
		//ЭлПочтаПроживающего = "";
		//Пока Выборка.Следующий() Цикл
		//	Если Выборка.Вид <> Справочники.Бит_ВидыКонтактнойИнформации.EmailПроживающего Тогда Продолжить; КонецЕсли;
		//	ЭлПочтаПроживающего = Выборка.Представление;
		//	Структура.Email     = ЭлПочтаПроживающего;
		//	Прервать;
		//КонецЦикла;
		Для каждого СтрЕм Из ОтветственноеЛицо.КонтактнаяИнформация Цикл
			Если Найти(Нрег(СтрЕм.Вид),"email")<>0 Тогда
				Структура.Email     = СтрЕм.Представление;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		
		
		Структура.Улица    = ЛицевойСчет.Здание.Улица;
		Структура.Город    = ЛицевойСчет.Здание.Район;
		Структура.Дом      = Строка(ЛицевойСчет.Здание.Улица)+", д. "+ЛицевойСчет.Здание.НомерДома+СТрока(?(ЛицевойСчет.Здание.Корпус="","",", корп. "+Строка(ЛицевойСчет.Здание.Корпус)));
		Структура.Корпус   = ЛицевойСчет.Здание.Корпус;
		Структура.Квартира = ЛицевойСчет.Квартира.Наименование;
		Структура.Помещение = ЛицевойСчет.Здание.ПочтовыйАдрес+", кв. "+Строка(ЛицевойСчет.Квартира.НомерКвартиры);
	Иначе
		Структура.Улица    = ЛицевойСчет.Здание.Улица;
		Структура.Город    = ЛицевойСчет.Здание.Район;
		Структура.Дом      = Строка(ЛицевойСчет.Здание.Улица)+", д. "+ЛицевойСчет.Здание.НомерДома+СТрока(?(ЛицевойСчет.Здание.Корпус="","",", корп. "+Строка(ЛицевойСчет.Здание.Корпус)));
		Структура.Корпус   = ЛицевойСчет.Здание.Корпус;
		Структура.Квартира = ЛицевойСчет.Квартира.Наименование;
		Структура.Помещение = ЛицевойСчет.Здание.ПочтовыйАдрес+", кв. "+Строка(ЛицевойСчет.Квартира.НомерКвартиры);
	КонецЕсли;
	// Долг + текущие начисления
	
	ДолгПоЛС           = ВывестиСуммуДолгаПоЛС(ЛицевойСчет,Настройки);
	Долг               = ДолгПоЛС.СтрокаДолга;
	Попытка
		Структура.ApiSumma = Число(Долг);
	Исключение
		Структура.ApiSumma = 0;
	КонецПопытки;
	
	Возврат Структура;
КонецФункции
Функция ПолучитьДатуДолга(Организация, Дата)
	// Взята Из конфигурации, получает дату долга
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(ВЫБОР
	|				КОГДА ДЕНЬ(&Дата) > бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДатаСеанса(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции
Функция ВывестиСуммуДолгаПоЛС(ЛицевойСчет,Настройки)
	
	ДатаДолга = ПолучитьДатуДолга(Настройки.Организация, ТекущаяДатаСеанса());
	
	// Определим сумму долга по начислениям для текущего лицевого счета.
	ЗапросПоНачислениям = Новый Запрос;
	ЗапросПоНачислениям.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДатаСеанса()));
	ЗапросПоНачислениям.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет.Ссылка);
	ЗапросПоНачислениям.УстановитьПараметр("ДатаДолга"   , ДатаДолга);
	ЗапросПоНачислениям.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|		СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаДолга {(&ДатаДолга)}, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет) КАК Долг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|						ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Оплата,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|						ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Разовые
	|		ИЗ
	|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(НАЧАЛОПЕРИОДА(&ДатаДолга, МЕСЯЦ) {(&ДатаДолга)}, &КонецПериода {(&КонецПериода)}, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ОплатаСДатыДолга
	|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет";
	
	тмпДолг = 0;
	
	Выборка = ЗапросПоНачислениям.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		тмпДолг = Выборка.Долг;
	КонецЕсли;
	
	Если тмпДолг > 0 Тогда
		ИнфСтрока = Строка(тмпДолг);
		ЦветНадписи = Новый Цвет(255, 0, 0); // Красный.
		
	Иначе
		ИнфСтрока = "0";
		ЦветНадписи = Новый Цвет(0, 0, 0);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СтрокаДолга", ИнфСтрока);
	СтруктураВозврата.Вставить("ЦветНадписи", ЦветНадписи);
	
	Возврат СтруктураВозврата;
	
КонецФункции  // ВывестиСуммуДолгаПоЛС()
#КонецОбласти

#Область Отправка_Счетчиков_В_Систему_МЛК
Функция ОтправитьВсеСчетчикиНаСервереПервый(Первичный)
	
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	НастройкиМЛК = Справочники.МЛК_Настройки.Выбрать();
	Пока НастройкиМЛК.Следующий() Цикл
		
		Если НастройкиМЛК.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		Если Первичный И НастройкиМЛК.ПервичнаяСинхронизацияВыполнена Тогда Продолжить; КонецЕсли;
		
		Если НачалоДня(НастройкиМЛК.ДатаПоследнейСинхронизацииПоСчетчикам) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Возврат Истина;
		КонецЕсли;
		
		ТаблицаЛС = ПолучитьТаблицуЛицевыхСчетов(НастройкиМЛК);
		Если ОтправитьВсеСчетчикиНаСервере(НастройкиМЛК,ТаблицаЛС,Истина) Тогда
			ОбъектНастройки = НастройкиМЛК.ПолучитьОбъект();
			ОбъектНастройки.ДатаПоследнейСинхронизацииПоСчетчикам       = ТекущаяДатаСеанса();
			ОбъектНастройки.Записать();
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;	
КонецФункции
Функция ОтправитьВсеСчетчикиНаСервере(Настройки,ТаблицаЛС,Все)
	
	// Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	ЖурналЗапросБезКодировкиМассив = Новый Массив;
	
	// 1 сначала ацес токен 
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	Соединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос        = Новый HTTPЗапрос("/api/v8/auth?login="+СокрЛП(Настройки.Логин)+"&password="+СокрЛП(Настройки.Пароль));
	
	Результат    = Соединение.Получить(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		
		ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для отправки счетчиков";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвет = Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировкиМассив,СтрокаОтвет,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;
	Иначе	
		
	КонецЕсли; 
	РезультатПроверки    = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	// в теле результата запроса - json
	Ключ = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Значение");
	Для Каждого стр Из ЗагруженныеДанные Цикл
		Если СокрЛП(стр.Ключ)= "access_token" Тогда
			Ключ            = Стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Счетчик = 0;
	СтрокаПараметров="";
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса1 = "/api/v8/list/createupdate";
	
	ЖурналЗапросБезКодировкиМассив.Добавить(Строка(АдресСервисаСтр)+Строка(АдресРесурса1));				
	
	Для каждого Выборка Из ТаблицаЛС Цикл
		ТаблицаДанныхПоСчетчикам =ПолучитьТаблицуДанныхПоСчетчикамЛицевогоСчета(Выборка.Ссылка,"ТаблицаПоСчетчикам",Настройки);
		
		ТаблицаСчетчиков = Новый ТаблицаЗначений;
		ТаблицаСчетчиков.Колонки.Добавить("ГрафаОтчетаГЦЖС");
		ТаблицаСчетчиков.Колонки.Добавить("ВидСчетчика");
		ТаблицаСчетчиков.Колонки.Добавить("Имя");
		ТаблицаСчетчиков.Колонки.Добавить("Серийный");
		ТаблицаСчетчиков.Колонки.Добавить("Код");
		ТаблицаСчетчиков.Колонки.Добавить("Показание");
		ТаблицаСчетчиков.Колонки.Добавить("ПредыдущееПоказание");
		ТаблицаСчетчиков.Колонки.Добавить("Период");
		ТаблицаСчетчиков.Колонки.Добавить("Услуга");
		ТаблицаСчетчиков.Колонки.Добавить("Активность");
		ТаблицаСчетчиков.Колонки.Добавить("Многотарифный");
		
		Для Каждого Стр Из ТаблицаДанныхПоСчетчикам Цикл
			Если Стр.Счетчик.ТипСчетчика<>Перечисления.бит_ТипСчетчика.Индивидуальный Тогда Продолжить; КонецЕсли;
			Нов = ТаблицаСчетчиков.Добавить();
			Нов.ГрафаОтчетаГЦЖС = Стр.Услуга.ГрафаОтчетаГЦЖС;
			Нов.ВидСчетчика     = "";
			Нов.Имя             = Стр.Счетчик.Наименование;
			Нов.Серийный        = Стр.Счетчик.ЗаводскойСерийныйНомерПУ; // Возможно серийный - наименование
			Нов.Код             = Стр.Счетчик.Код;
			// Нов.Показание       = Стр.ПоследниеПоказания;
			Нов.Показание       = Стр.ОтПоказаний;
			Нов.Период              = Лев(ТекущаяДатаСеанса(),10);
			Нов.Услуга          = СТр.Услуга;
			Если стр.Счетчик.ПометкаУдаления Тогда
				Нов.Активность = "0";
			Иначе
				Нов.Активность = "1";
			КонецЕсли;	
			Нов.Многотарифный              = Стр.Многотарифный;
		КонецЦикла;
		
		Если ТаблицаСчетчиков.Количество()<>0 Тогда
			ТаблицаСчетчиков.Сортировать("Услуга");
			СтрокаПараметров = "";
			Счетчик = 0;
			СтрокаПараметров="";
			Для Каждого ТекущаяСтрока Из ТаблицаСчетчиков Цикл
				
				Если  ТекущаяСтрока.Многотарифный Тогда
					Запрос1 = "{"+
					"""code"""+":"+""""+Строка(СокрЛП(ТекущаяСтрока.Код))+""""+","+
					""""+"nameCode1c"""   +":"+""""+Строка(ТекущаяСтрока.Услуга.Код)+""""+
					"}";
					Запрос2 = "{";
					Запрос2 =Запрос2 + 
					""""+"name"""   +":"+""""+Строка(ТекущаяСтрока.Услуга)+""""+","+
					""""+"serial"""   +":"+""""+Строка(ТекущаяСтрока.Серийный)+""""+","+
					""""+"lsCode1c"""     +":"+""""+Строка(Выборка.Ссылка.Код)+""""+","+
					""""+"active"""     +":"+""""+Строка(ТекущаяСтрока.Активность)+""""+","+
					""""+"value"""   +":"+""""+Строка(Формат(ТекущаяСтрока.Показание,"ЧРД=.; ЧГ=0; ЧДЦ=2"))+""""+","+
					""""+"period"""   +":"+""""+Строка(ТекущаяСтрока.Период)+""""+
					"}";
				Иначе
					Запрос1 = "{"+
					"""lsCode1c"""+":"+""""+Строка(Выборка.Ссылка.Код)+""""+","+
					""""+"code"""   +":"+""""+Строка(ТекущаяСтрока.Код)+""""+
					"}";
					Запрос2 = "{";
					Запрос2 =Запрос2 + 
					""""+"name"""   +":"+""""+Строка(ТекущаяСтрока.Услуга)+""""+","+
					""""+"serial"""   +":"+""""+Строка(ТекущаяСтрока.Серийный)+""""+","+
					""""+"nameCode1c"""     +":"+""""+Строка(ТекущаяСтрока.Услуга.Код)+""""+","+
					""""+"active"""     +":"+""""+Строка(ТекущаяСтрока.Активность)+""""+","+
					""""+"value"""   +":"+""""+Строка(Формат(ТекущаяСтрока.Показание,"ЧРД=.; ЧГ=0; ЧДЦ=2"))+""""+","+
					""""+"period"""   +":"+""""+Строка(ТекущаяСтрока.Период)+""""+
					"}";
				КонецЕсли;
				
				
				// Журнал
				Если СтрокаПараметров = "" Тогда
					ЖурналЗапросБезКодировкиМассив.Добавить("c"+Счетчик+"="+Запрос1+"&u"+Счетчик+"="+Запрос2);
				Иначе
					ЖурналЗапросБезКодировкиМассив.Добавить("&c"+Формат(Счетчик,"ЧГ=")+"="+Запрос1+"&u"+Формат(Счетчик,"ЧГ=")+"="+Запрос2);
				КонецЕсли;
				
				Запрос1 = КодироватьСтроку(Запрос1,СпособКодированияСтроки.КодировкаURL);
				Запрос2 = КодироватьСтроку(Запрос2,СпособКодированияСтроки.КодировкаURL);
				
				Если СтрокаПараметров = "" Тогда
					СтрокаПараметров = "c"+Счетчик+"="+Запрос1+"&u"+Счетчик+"="+Запрос2;
				Иначе
					СтрокаПараметров = СтрокаПараметров+"&c"+Формат(Счетчик,"ЧГ=")+"="+Запрос1+"&u"+Формат(Счетчик,"ЧГ=")+"="+Запрос2;
				КонецЕсли;
				
				Счетчик=Счетчик+1;
			КонецЦикла;
			
			СтрокаПараметров = СтрокаПараметров+"&tableName=meters"+"&listId=1";
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров,  "windows-1251");
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer "+Строка(Ключ));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
			
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка счетчиков в МЛК","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				Возврат Ложь;
			КонецПопытки;
			
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				Если Не ПустаяСтрока(СтрокаОтвет) Тогда
					РезультатПроверки = СтрокаОтвет;
					Результат = РезультатПроверки;
					
				КонецЕсли;
			Иначе
				ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
				// Журнал
				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				ИмяСобытияВЖурнал = "Отправка счетчиков в МЛК ошибка";
				КодСостояния = Ответ.КодСостояния;
				СтрокаОтвета = СтрокаОтвет;	
				МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировкиМассив,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
				Возврат Ложь;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	
	
	Возврат Истина;
	
КонецФункции
Функция ПолучитьТаблицуДанныхПоСчетчикамЛицевогоСчета(ЛицевойСчет,НазваниеТаблицы,Настройки)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		СписокЛС = Новый Массив;
		СписокЛС.Добавить(ЛицевойСчет.Ссылка);
	Иначе
		СписокЛС = Новый Массив;
	КонецЕсли;
	
	ТаблицаНач = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаСч  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТаблицаЛт  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
	ТаблицаРп  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	ТаблицаПр  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ТекущаяДатаСеанса(), 
	Настройки.Организация, 
	СписокЛС, 
	, 
	ложь, 
	Истина, 
	ТаблицаНач, 
	ТаблицаСч, 
	ТаблицаРп,
	ТаблицаЛт,
	,
	,
	Ложь,
	Ложь,
	Ложь,
	ТаблицаПр,
	Ложь,
	// bit_akozlov_04102013_начало_изменений
	// мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика);.
	Ложь,
	Ложь);
	
	
	Если НазваниеТаблицы = "ТаблицаНачислений" Тогда
		Возврат ТаблицаНач;
	Иначе
		Возврат ТаблицаСч;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#Область Создание_Регистра_С_Ссылками_На_МЛК
Функция СоздатьКороткиеСсылки(Первичный,Настройки)
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат ОтправитьЗапросНаСозданиеКороткихСсылок(Настройки);
КонецФункции
Функция ОтправитьЗапросНаСозданиеКороткихСсылок(Настройки);
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса = "/api/v4/objects?ApplicationId="+Настройки.НомерПриложения;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Создание коротких ссылок","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		ЕстьОтвет = Ложь;
		Возврат Ложь;
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
				ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
				ЧтениеJSON.Закрыть();
				
				
				ТЗ = РаспарситьОбъекты(ЗагруженныеДанные);
				СоздатьЗаписиВРегистре(ТЗ,Настройки);
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Ложь;	
		КонецЕсли;                                      
	КонецЕсли;	
КонецФункции
Процедура СоздатьЗаписиВРегистре(ТЗ,Настройки)
	
	Для каждого Стр Из ТЗ Цикл
		
		Попытка 
			
			ПроверкаИД = Число(Стр.ИД);
			
		Исключение
			
			Продолжить;
			
		КонецПопытки;
		
		
		Создан = СоздатьЗапросКороткойСсылки(Стр.ИД,Настройки);
		
	КонецЦикла;	
	
КонецПроцедуры
Функция СоздатьЗапросКороткойСсылки(ИД,Настройки)
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса = "/api/v4/objects/"+СТрока(ИД)+"?ApplicationId="+Настройки.НомерПриложения;
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Запрос коротких ссылок","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		ЕстьОтвет = Ложь;
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
				ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
				ЧтениеJSON.Закрыть();
				
				
				Ссылка = ЗагруженныеДанные["LoginLink"];
				Код1с  = ЗагруженныеДанные["Код1С"];
				ЛС = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(Код1С);
				Если ЛС <> Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда
					МенеджерЗаписи = РегистрыСведений.МЛК_АдресаЛичныхКабинетов.СоздатьНаборЗаписей();
					МенеджерЗаписи.Отбор.ЛицевойСчет.Установить(Справочники.бит_ЛицевыеСчета.НайтиПоКоду(Код1С));
					МенеджерЗаписи.Прочитать();
					
					Если МенеджерЗаписи.Выбран() Тогда
						Если МенеджерЗаписи.Количество()<>0 Тогда
							Если МенеджерЗаписи[0].СсылкаНаКабинет <> Ссылка Тогда
								МенеджерЗаписи[0].СсылкаНаКабинет = Ссылка;
								МенеджерЗаписи[0].ИДОбъекта = ИД;
							КонецЕсли;
						Иначе
							НоваяЗапись = МенеджерЗаписи.Добавить();
							НоваяЗапись.ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(Код1С);
							НоваяЗапись.СсылкаНаКабинет = Ссылка;
							НоваяЗапись.ИДОбъекта = ИД;
							
						КонецЕсли;
					Иначе
						МенеджерЗаписи.СсылкаНаКабинет = Ссылка;
					КонецЕсли;
					МенеджерЗаписи.Записать();
				КонецЕсли;
			Иначе
				
			КонецЕсли;                                      
		КонецЕсли;
	КонецЕсли;
КонецФункции	
Функция РаспарситьОбъекты(Данные)	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИД");
	Для Каждого стр Из Данные Цикл
		Нов = ТЗ.Добавить();
		Нов.ИД    = СтрЗаменить(СокрЛП(Стр["id"]),Символы.НПП,"");
	КонецЦикла;	
	Возврат ТЗ;
	
КонецФункции
#КонецОбласти

#Область Импорт_Показаний
Процедура МЛК_ЭкспортПринятыхПоказанийСчетчиков() Экспорт
	СинхронизацияСчетчиков = ПодгрузитьПоказания();
КонецПроцедуры
Функция ПодгрузитьПоказания()
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		Если Не ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам) И
			Не ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоСчетчикам) Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат ПодгрузитьПоказанияСчетчиковНаСервере(Настройки);
	КонецЦикла;	
	
КонецФункции	
Функция ПодгрузитьПоказанияСчетчиковНаСервере(Настройки)
	
	// Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	// Журнал
	
	СтатусЗавершено=Настройки.СтатусЗакрыто;
	СтатусНовое=Настройки.СтатусОтправленоВУК;
	СтатусНовое = СтрЗаменить(СтатусНовое," ","");
	СтатусНовое = СтрЗаменить(СтатусНовое,Символы.НПП,"");
	
	Успешных=0;Всего=0;
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса = "/api/v4/events?ApplicationId="+Строка(СокрЛП(Настройки.НомерПриложения))+"&query=";
	
	// Журнал
	ЖурналЗапросБезКодировки = Строка(АдресСервисаСтр)+Строка(АдресРесурса);
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Показания приборов учета"""+","
	+"""andor"""                +":"+"""and"""
	+"}"+","
	+"{"
	+"""field"""                +":"+ """StatusId"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(СтатусНовое)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";	
	
	ЖурналЗапросБезКодировки = ЖурналЗапросБезКодировки + Строка(СтрокаПараметров);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Загрузка показаний Из МЛК", "" ,ЖурналЗапросБезКодировки, "Нет связи с сервером", ОписаниеОшибки(),ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
			РезультатПроверки = СтрокаОтвет;
			Если СокрЛП(РезультатПроверки)="false" Тогда
				
			Иначе
				
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
				ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
				ЧтениеJSON.Закрыть();
				
				ТЗ = РаспарситьВТаблицуПоказания(ЗагруженныеДанные);
				ЗагрузитьТаблицуВДокумент(ТЗ,Настройки);
				
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		ИмяСобытияВЖурнал = "Загрузка показаний Из МЛК в 1С";
		КодСостояния = Ответ.КодСостояния;
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвет,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
КонецФункции
Процедура ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,КодСтатуса,Настройки)
	
	Для Каждого СТрСтатус Из ТаблицаДляИзмененияСтатуса Цикл
		
		ЕстьОтвет = Истина;
		
		АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
		
		АдресРесурса1 = "/api/v4/events/"+СТрока(СТрСтатус.ИД_События);
		СтрокаПараметров = "?StatusId="+СТрока(КодСтатуса);
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1+СтрокаПараметров);
		HTTPЗапрос.УстановитьТелоИзСтроки("", КодировкаТекста.UTF8);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
		Попытка
			Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		Исключение
			ЕстьОтвет = Ложь;
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Изменений статусов событий","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		КонецПопытки;
		
		Если ЕстьОтвет Тогда
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				СтрокаОтвет1 = Перевод(СтрокаОтвет1);
				
				СтрокаОтвет1 = "Изменение статуса события. Событие: "+Строка(СТрСтатус.ИД_События)+". "+ СтрокаОтвет1;
				
				
				Если Не ПустаяСтрока(СтрокаОтвет1) Тогда
					РезультатПроверки1 = СтрокаОтвет1;
					
					Если СокрЛП(РезультатПроверки1)="false" Тогда
						
					Иначе
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Ответ.КодСостояния = 500 Тогда
				
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
				
			ИначеЕсли Ответ.КодСостояния = 301 Тогда
				
			Иначе
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	
Процедура ЗагрузитьТаблицуВДокумент(ТЗ,Настройки)
	
	ТаблицаДляИзмененияСтатуса = Новый ТаблицаЗначений;
	ТаблицаДляИзмененияСтатуса.Колонки.Добавить("ИД_События");
	ИзменитьСтатусы = Ложь;
	
	ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
	
	ДокументВводПоказаний.Организация = Настройки.Организация;
	ДокументВводПоказаний.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	ДокументВводПоказаний.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
	ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
	ДокументВводПоказаний.ПоказанияНаселения = Истина;
	ДокументВводПоказаний.Дата = ТекущаяДатаСеанса();
	
	ДокументВводПоказаний.Комментарий    = "# загружен автоматически из системы МЛК";
	ДокументВводПоказаний.Ответственный    = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Для Каждого Стр Из ТЗ Цикл
		Если Стр.Статус = Строка(Настройки.СтатусЗакрыто) Тогда Продолжить; КонецЕсли;
		
		СпрЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(Стр.ЛС);
		Если СпрЛС<>Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда
			Счетчик = Справочники.бит_Счетчики.НайтиПоКоду(Стр.ПриборУчета);
			
			НовСтрСтатус = ТаблицаДляИзмененияСтатуса.Добавить();
			НовСтрСтатус.ИД_События   = Стр.ИД_События;
			
			Запрос = Новый Запрос;
			МВТ    = Новый МенеджерВременныхТаблиц;
			
			Запрос.МенеджерВременныхТаблиц = МВТ;
			
			ТекстИндивидуальныеСчетчики =  
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
			|ПОМЕСТИТЬ Проживающие
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_ПроживающиеПоЛССрезПоследних
			|ГДЕ
			|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
			|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата)
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
			|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
			|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
			|	бит_СведенияПоУслугамЛССрезПоследних.Использовать КАК Использовать,
			|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
			|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
			|ПОМЕСТИТЬ Услуги
			|ИЗ
			|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_СведенияПоУслугамЛССрезПоследних
			|ГДЕ
			|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
			|	И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Услуги.ЛицевойСчет КАК ЛицевойСчет,
			|	Услуги.Услуга КАК Услуга,
			|	Услуги.РежимПотребления КАК РежимПотребления,
			|	Услуги.Поставщик КАК Поставщик,
			|	Услуги.Использовать КАК Использовать,
			|	Услуги.СпособРасчета КАК СпособРасчета,
			|	Услуги.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
			|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
			|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
			|	Проживающие.КолПроживающих КАК КолПроживающих
			|ПОМЕСТИТЬ Сведения
			|ИЗ
			|	Услуги КАК Услуги
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних
			|		ПО Услуги.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
			|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
			|		ПО Услуги.ЛицевойСчет = Проживающие.ЛицевойСчет
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сведения.ЛицевойСчет КАК ЛицевойСчет,
			|	Сведения.Услуга КАК Услуга,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
			|	ЕСТЬNULL(Сведения.КолПроживающих, 0) КАК КолПроживающих,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного
			|ПОМЕСТИТЬ Нормы
			|ИЗ
			|	Сведения КАК Сведения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
			|				&Дата,
			|				Услуга В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						таб.Услуга КАК Услуга
			|					ИЗ
			|						Услуги КАК таб)) КАК бит_НормыНаУслугиСрезПоследних
			|		ПО Сведения.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
			|			И Сведения.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
			|			И Сведения.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
			|			И Сведения.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
			|			И Сведения.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
			|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания,
			|	ЕСТЬNULL(Нормы.НаОдного, 0) КАК НаОдного,
			|	ЕСТЬNULL(Нормы.НаДвоих, 0) КАК НаДвоих,
			|	ЕСТЬNULL(Нормы.НаСемью, 0) КАК НаСемью,
			|	ЕСТЬNULL(Нормы.НаСемью4, 0) КАК НаСемью4,
			|	ЕСТЬNULL(Нормы.НаСемью5, 0) КАК НаСемью5,
			|	ЕСТЬNULL(Нормы.НаСемью6, 0) КАК НаСемью6,
			|	ЕСТЬNULL(Нормы.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
			|	ЕСТЬNULL(Нормы.КолПроживающих, 0) КАК КолПроживающих,
			|	ЕСТЬNULL(Нормы.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
			|	ЕСТЬNULL(Нормы.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
			|	ЕСТЬNULL(Нормы.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
			|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный
			|ИЗ
			|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
			|			&Дата,
			|			Объект = &Объект
			|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
			|				&Дата,
			|				Объект = &Объект
			|					И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
			|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
			|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
			|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
			|		ЛЕВОЕ СОЕДИНЕНИЕ Нормы КАК Нормы
			|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = Нормы.ЛицевойСчет
			|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = Нормы.Услуга
			|ГДЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет
			|ИТОГИ ПО
			|	Счетчик";
			
			ТекстГрупповыеСчетчики =  
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
			|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания,
			|	0 КАК НаОдного,
			|	0 КАК НаДвоих,
			|	0 КАК НаСемью,
			|	0 КАК НаЛицевойСчет,
			|	0 КАК КолПроживающих,
			|	0 КАК ДопНормаНаСемью,
			|	0 КАК ДопНормаНаКаждого,
			|	ЛОЖЬ КАК ИспользоватьДопНормуНаОдного,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
			|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный
			|ИЗ
			|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
			|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
			|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
			|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
			|ГДЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет
			|ИТОГИ ПО
			|	Счетчик";
			
			Запрос.УстановитьПараметр("Дата"   , КонецДня(ТекущаяДатаСеанса()));
			Запрос.УстановитьПараметр("Счетчик", Счетчик);
			
			Дом = СпрЛС.Ссылка.Здание;
			Квартира = СпрЛС.Ссылка.Квартира;
			
			Если Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
				Запрос.УстановитьПараметр("Объект", Дом);
				Запрос.Текст = ТекстГрупповыеСчетчики;
			Иначе
				Запрос.УстановитьПараметр("Объект"  , СпрЛС.Ссылка);
				Запрос.УстановитьПараметр("Квартира", Квартира); 
				Запрос.Текст = ТекстИндивидуальныеСчетчики;
			КонецЕсли; 
			
			ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			
			Пока ВыборкаСЧ.Следующий() Цикл
				
				
				ТекПоказания = Стр.Показатель;
				Показания    = 0;
				Выборка   = ВыборкаСч.Выбрать();
				ПерваяСтрока = Истина;
				
				Пока Выборка.Следующий() Цикл
					// Проверка
					Если сокрЛП(Стр.ИмяСчетчика) <> СокрЛП(Выборка.Услуга) И Выборка.Многотарифный Тогда
						// ТекПоказания = 0;
						Продолжить; 
						
					КонецЕсли;
					//Если Число(ТекПоказания) < Выборка.ПредыдущиеПоказания Тогда Продолжить; КонецЕсли;
					
					
					Если ПерваяСтрока Тогда
						
						// Строка = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиПоИдентификатору(1);
						Строка = ДокументВводПоказаний.ПоказанияПоСчетчикам.Добавить();
						
					Иначе
						
						Строка = ДокументВводПоказаний.ПоказанияПоСчетчикам.Добавить();
						
					КонецЕсли;
					
					Если ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой  Тогда
						
						Строка.Улица = Выборка.Объект.Улица;
						Строка.Дом   = Выборка.Объект;
						
					Иначе
						
						Строка.Улица       = Выборка.Объект.УлицаЛицевогоСчета;
						Строка.Дом         = Выборка.Объект.Здание;
						Строка.ЛицевойСчет = Выборка.Объект;
						
					КонецЕсли; 
					
					Строка.Счетчик                    = Счетчик;
					Строка.Услуга                     = Выборка.Услуга;
					Строка.Разрядность                = Выборка.Разрядность;
					Строка.ПредыдущиеПоказания        = Выборка.ПредыдущиеПоказания;
					
					Строка.ТекущиеПоказания           = ТекПоказания;
					
					Строка.КоличествоЕдиницПоСчетчику = 0;
					Строка.Многотарифный              = Выборка.Многотарифный;
					
					Если ТекПоказания <> 0 Тогда
						
						// Строка.ТекущиеПоказания           = ТекПоказания;
						// Строка.КоличествоЕдиницПоСчетчику = Показания;
						КолЕдиниц = Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания;
						Строка.КоличествоЕдиницПоСчетчику = КолЕдиниц;
					Иначе
						
						Норма     = 0;
						Показания = 0;
						КолПроживающих = ?(Выборка.КолПроживающих = 0, 1, Выборка.КолПроживающих);
						
						Если КолПроживающих = 1 Тогда
							
							Норма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
							
						ИначеЕсли КолПроживающих = 2 Тогда
							
							Норма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;
							
						ИначеЕсли КолПроживающих = 3 Тогда
							
							Норма  = Выборка.НаСемью * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
							
						ИначеЕсли КолПроживающих = 4 Тогда
							
							Норма  = Выборка.НаСемью4 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
							
						ИначеЕсли КолПроживающих = 5 Тогда
							
							Норма  = Выборка.НаСемью5 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
							
						ИначеЕсли КолПроживающих > 5 Тогда
							
							Норма  = Выборка.НаСемью6 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
							
						КонецЕсли;
						
						
						Показания = Окр(Норма,4);
						
						
						ТекПоказания = Строка.ПредыдущиеПоказания + Показания;
						
						Если ТекПоказания > Строка.Разрядность Тогда
							
							ТекПоказания = ТекПоказания - Строка.Разрядность + 1;
							Показания    = Показания + 1 ;
							
						КонецЕсли;
						
						Строка.ТекущиеПоказания           = ТекПоказания;
						Строка.КоличествоЕдиницПоСчетчику = Показания;
						
						// КонецЕсли; 
						
					КонецЕсли;
					
					ПерваяСтрока  = Ложь;
					УдалитьСтарое = Истина;
					
				КонецЦикла; 
				
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;	
	
	Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество()<>0 Тогда
		ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Записаь показаний счетчиков","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		КонецПопытки;
		
		ИзменитьСтатусы = Истина;
	Иначе
		// Скорее всего показания были но неверные
		ИзменитьСтатусы = Истина;
	КонецЕсли;	
	
	Если ИзменитьСтатусы Тогда
		ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(СтрЗаменить(Настройки.СтатусЗакрыто,Символы.НПП,"")),Настройки);
		
		ТаблицаЛС = Новый Массив;
		Для Каждого Стр Из ТЗ Цикл
			СсылкаЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(Стр.ЛС);
			ТаблицаЛС.Добавить(СсылкаЛС);
		КонецЦикла;
		ОтправитьВсеСчетчикиНаСервере(Настройки,ТаблицаЛС,Ложь);
	КонецЕсли;	
	
КонецПроцедуры	
Функция РаспарситьВТаблицуПоказания(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЛС");
	ТЗ.Колонки.Добавить("Показатель");
	ТЗ.Колонки.Добавить("ПриборУчета");
	ТЗ.Колонки.Добавить("Дата");
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_События");
	ТЗ.Колонки.Добавить("ИмяСчетчика");
	Для Каждого стр Из Данные Цикл
		
		Попытка
			Показатель = Число(Стр["value_Показатель"]);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(Стр["object_Код1С"]) Тогда
			Продолжить;
		КонецЕсли;	
		
		Нов = ТЗ.Добавить();
		Нов.ЛС            = Стр["object_Код1С"];
		Нов.Показатель    = Число(Стр["value_Показатель"]);
		Нов.ПриборУчета   = Стр["value_ПриборУчета"];
		Нов.ИмяСчетчика   = Стр["value_Наименование прибора"]; 
		
		Нов.Дата          = Стр["UpdateDate"];
		Нов.Статус        = СтрЗаменить(Стр["StatusId"],Символы.НПП,""); 
		Нов.ИД_События    = СтрЗаменить(Стр["id"],Символы.НПП,"");       // ИД события по которому будем менять статус
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
КонецФункции	                     
Функция Перевод(ТекстСтроки)
	
	ТекстСтроки = СтрЗаменить(ТекстСтроки,"response","ответ");
	ТекстСтроки = СтрЗаменить(ТекстСтроки,"Updated","Обновлено");
	ТекстСтроки = СтрЗаменить(ТекстСтроки,"rows","строк");
	
	Возврат ТекстСтроки;
	
КонецФункции	
#КонецОбласти

#Область Квитанции
Процедура МЛК_ПроверкаЗапросовНаКвитанцию() Экспорт
	
	Если Не Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИмпортКвитанции = ОтправитьКвитанции(); 
КонецПроцедуры
Функция ОтправитьКвитанции()
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		Если Не ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам) И
			Не ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоСчетчикам) Тогда
			Продолжить;
		КонецЕсли;
		Возврат ПроверитьИОтправитьКвитанцииНаСервере(Настройки);
	КонецЦикла;
КонецФункции
Функция ПроверитьИОтправитьКвитанцииНаСервере(Настройки)
	ЕстьОтвет = Истина;
	// Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	// Журнал
	
	СтатусЗавершено=Настройки.СтатусЗакрыто;
	СтатусНовое=Настройки.СтатусОтправленоВУК;
	СтатусНовое = СтрЗаменить(СтатусНовое," ","");
	СтатусНовое = СтрЗаменить(СтатусНовое,Символы.НПП,"");
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса = "/api/v4/events?ApplicationId="+Настройки.НомерПриложения+"&query=";
	
	// Журнал
	ЖурналЗапросБезКодировки = Строка(АдресСервисаСтр)+Строка(АдресРесурса);
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """StatusId"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(СтатусНовое)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Запрос Квитанции-1"""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";
	
	ЖурналЗапросБезКодировки = Строка(ЖурналЗапросБезКодировки) + СТрока(СтрокаПараметров);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Запрос квитанции","",,"Нет связи с сервером",ОписаниеОшибки(),ТекущаяДатаСеанса());	
	КонецПопытки;
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					Если ЗагруженныеДанные.Количество()<>0 Тогда
						ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
						
						
						ПериодНачислений = КонецМесяца(ТекущаяДатаСеанса());
						ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений,Настройки);
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
			ИмяСобытияВЖурнал = "Запрос квитанции";
			КодСостояния = Ответ.КодСостояния;
			СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		КонецЕсли;
		
	КонецЕсли;
КонецФункции
Функция РаспарситьВТаблицуЗапросКвитанции(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЛС");
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_События");
	ТЗ.Колонки.Добавить("ИД_Объекта");
	
	Для Каждого стр Из Данные Цикл
		
		Нов = ТЗ.Добавить();
		
		Нов.ЛС            = Стр["object_Код1С"];
		Нов.Статус        = Стр["StatusId"]; // 17 - Обработан;  15 - В Работе
		Нов.ИД_События    = Стр["id"];       // ИД события по которому будем менять статус
		Нов.ИД_События    = СтрЗаменить(СокрЛП(Нов.ИД_События),Символы.НПП,"");
		Нов.ИД_Объекта    = Стр["object_id"];
		Нов.ИД_Объекта    = СтрЗаменить(СокрЛП(Нов.ИД_Объекта),Символы.НПП,"");
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
КонецФункции
Процедура ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений,Настройки)
	
	ТаблицаДляИзмененияСтатуса = Новый ТаблицаЗначений;
	ТаблицаДляИзмененияСтатуса.Колонки.Добавить("ИД_События");
	ИзменитьСтатусы = Ложь;
	
	Для Каждого СТр Из ТЗ Цикл
		
		ЕстьОтвет = Истина;
		//	Квитанция = ПечатьЕдиныйПлатежныйДокумент(Стр.ЛС);
		// ЛС = Справочники.бит_ЛицевыеСчета.НайтиПоКоду();
		
		ЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(СокрЛП(Стр.ЛС));
		// Квитанция = ПечатьПлатежныйДокументРК924(ЛС);
		
		ПериодНачисленийИзДокумента = ПолучитьПериодНачисленийПоЛицевомуСчету(ЛС);
		
		Квитанция = ПечатьПлатежныйДокументРК924(ЛС,ПериодНачисленийИзДокумента,Настройки);
		
		
		ИмяФ = Стр.ИД_События; 
		
		ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("pdf");
		Квитанция.Записать(ИмяПромежуточногоФайла, ТипФайлаТабличногоДокумента.PDF);
		
		// Квитанция.Записать(Строка(КаталогВременныхФайлов())+Строка(ИмяФ)+".pdf", ТипФайлаТабличногоДокумента.PDF) ;
		
		
		СодержимоеФайла = Base64Строка(Новый ДвоичныеДанные(ИмяПромежуточногоФайла)); 
		АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
		ИДСобытия = ""; РасширениеФайла = ""; ИмяФайла = ""; Содержимое = "";
		
		ИДСобытия = Строка(Стр.ИД_События);
		ИДСобытия = СтрЗаменить(ИДСобытия,Символы.НПП,"");
		ИДСобытия = КодироватьСтроку(ИДСобытия,СпособКодированияСтроки.КодировкаURL);
		РасширениеФайла = "pdf";
		РасширениеФайла = КодироватьСтроку(РасширениеФайла,СпособКодированияСтроки.КодировкаURL);
		ИмяФайла  = Строка(ИмяФ);
		ИмяФайла = КодироватьСтроку(ИмяФайла,СпособКодированияСтроки.КодировкаURL);
		Содержимое = СодержимоеФайла;
		Содержимое = КодироватьСтроку(Содержимое,СпособКодированияСтроки.КодировкаURL);
		
		АдресРесурса = "/api/v4/events/eventfile";
		ТелоPOSTЗапроса = "eventId="+ИДСобытия+"&fileExt="+РасширениеФайла+"&fileName="+ИмяФайла+"&fileBody="+Содержимое;
		СтрокаПараметров = ""; 
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
		
		Попытка
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоPOSTЗапроса);
			// Ответ = HTTPСоединение.ВызватьHTTPМетод("POST",HTTPЗапрос);	
			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение  
			ЕстьОтвет = Ложь;                  
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка квитанции","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		КонецПопытки;
		Если ЕстьОтвет Тогда
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				СтрокаОтвет1 = Перевод(СтрокаОтвет1);
				
				СтрокаОтвет1 = "Добавление квитанции. ЛС: "+Строка(СТр.ЛС)+". "+ СтрокаОтвет1;
				
				
				Если Не ПустаяСтрока(СтрокаОтвет1) Тогда
					РезультатПроверки1 = СтрокаОтвет1;
					
					НовСТр = ТаблицаДляИзмененияСтатуса.Добавить();
					НовСтр.ИД_События = Стр.ИД_События;
					
					Если СокрЛП(РезультатПроверки1)="false" Тогда
					Иначе
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Ответ.КодСостояния = 500 Тогда
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
			ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Иначе 
				Попытка
					СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка квитанции","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;	
			КонецЕсли;
		КонецЕсли;
		Попытка
			УдалитьФайлы(ИмяПромежуточногоФайла);
		Исключение
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Удаление файла квитанции","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		КонецПопытки;
	КонецЦикла;
	
	Если ТаблицаДляИзмененияСтатуса.Количество()<>0 Тогда 
		// ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(Настройки.СтатусЗакрыто),Настройки);
		ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(СтрЗаменить(Настройки.СтатусЗакрыто,Символы.НПП,"")),Настройки);
	КонецЕсли;
	
КонецПроцедуры	
Функция ПечатьПлатежныйДокументРК924(ЛС,Период,Настройки)
	
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛС;
	
	ОбработкаОбъект.МакетКв               = Настройки.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	// ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДатаСеанса()), -1);
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = ЛС.Организация;
	ОбработкаОбъект.РС                    = ЛС.Организация.ОсновнойБанковскийСчет;
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	ОбработкаОбъект.НеПечататьУслугиБезНачислений = Истина;
	ОбработкаОбъект.Период      = КонецМесяца(Период);
	
	ОбработкаОбъект.ПолучательПлатежа           = ЛС.Организация;
	
	ОбработкаОбъект.ОбновитьНастройкиЖКХ();
	ОбработкаОбъект.ОбновитьКэшОрганизации();
	ОбработкаОбъект.ОбновитьКэшПолучателяПлатежа();
	ОбработкаОбъект.ПолучитьНастройкуМакета();
	
	// Настроййки таб. док. поумолчанию.
	ТабличныйДокумент  = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// Формирование данных для макета.
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	
	
	Отбор = Новый Структура;
	// Отбор.Вставить("ВладелецЛС", Стр.ЛицевойСчет); // Без иерархии.
	Отбор.Вставить("ЛицевойСчет", ЛС);
	ПоискЛС = ТаблицаДанных.НайтиСтроки(Отбор);
	
	Если ПоискЛС.Количество()<>0 Тогда
		ОбработкаОбъект.ВывестиНаПечатьКвитанцию(ТабличныйДокумент, ПоискЛС[0]);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ()
Функция ПолучитьПериодНачисленийПоЛицевомуСчету(ЛС)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_НачислениеПоЛицевымСчетамЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.бит_НачислениеПоЛицевымСчетам.ЛицевыеСчета КАК бит_НачислениеПоЛицевымСчетамЛицевыеСчета
	|ГДЕ
	|	бит_НачислениеПоЛицевымСчетамЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|	И бит_НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И бит_НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛС);
	РезультатЗапроса = Запрос.Выполнить();
	Выб = РезультатЗапроса.Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.Дата;
	Иначе
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;	
КонецФункции	
#КонецОбласти

#Область Детализации
Процедура МЛК_ПроверкаЗапросовНаДетализациюНачислений() Экспорт
	
	Если Не Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИмпортДетализации = ОтправитьДетализациюПервая(); 
КонецПроцедуры
Функция ОтправитьДетализациюПервая()
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		Если Не ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоЛицевымСчетам) И
			Не ЗначениеЗаполнено(Настройки.ДатаПоследнейСинхронизацииПоСчетчикам) Тогда
			Продолжить;
		КонецЕсли;
		Возврат ПроверитьИОтправитьДетализацииНаСервере(Настройки);
	КонецЦикла;
КонецФункции
Функция ПроверитьИОтправитьДетализацииНаСервере(Настройки)
	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.ПометкаУдаления Или Настройки.НеИспользоватьИнтеграцию Или Не ЗначениеЗаполнено(Настройки.АдресКабинетов) Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОтвет = Истина;
		
		АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
		АдресРесурса = "/api/v4/events?ApplicationId="+Настройки.НомерПриложения+"&query=";
		
		СтрокаПараметров = 
		"["
		+"{"
		+"""field"""                +":"+ """StatusId"""+","
		+"""operation"""            +":"+ """="""+","
		+"""value"""                +":"+""""+СтрЗаменить(Строка(Настройки.СтатусОтправленоВУК),Символы.НПП,"")+""""+","
		+"""andor"""                +":"+"""and"""
		+"}"
		+","
		+"{"
		+"""field"""                +":"+ """ActionName"""+","
		+"""operation"""            +":"+ """="""+","
		+"""value"""                +":"+"""Запрос Детализации-1"""+","
		+"""andor"""                +":"+"""and"""
		+"}"
		+"]";
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
		Попытка
			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		Исключение
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Запрос детализации","",,"Нет связи с сервером",ОписаниеОшибки(),ТекущаяДатаСеанса());	
			ЕстьОтвет = Ложь;
		КонецПопытки;
		
		Если ЕстьОтвет Тогда
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				Если Не ПустаяСтрока(СтрокаОтвет) Тогда
					РезультатПроверки = СтрокаОтвет;
					Если СокрЛП(РезультатПроверки)="false" Тогда
					Иначе
						
						
						ЧтениеJSON = Новый ЧтениеJSON;
						ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
						ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
						ЧтениеJSON.Закрыть();
						
						ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
						
						ОтправитьДетализацию(ТЗ,Настройки);
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Ответ.КодСостояния = 500 Тогда
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
			ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Иначе
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
КонецФункции
Функция  ТаблицаДетализации(ЛицевойСчет,Настройки)
	
	ЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(СокрЛП(ЛицевойСчет));
	
	ПериодНачислений = ПолучитьПериодНачисленийПоЛицевомуСчету(ЛС);
	
	Квитанция = Новый ТабличныйДокумент;
	
	Результат = Неопределено;
	
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛС;
	
	ОбработкаОбъект.МакетКв               = Настройки.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	ОбработкаОбъект.Период                = КонецМесяца(ПериодНачислений);
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = ЛС.Организация;
	ОбработкаОбъект.РС                    = ЛС.Организация.ОсновнойБанковскийСчет;
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	
	ОбработкаОбъект.ПолучательПлатежа           = ЛС.Организация;
	
	ОбработкаОбъект.ОбновитьНастройкиЖКХ();
	ОбработкаОбъект.ОбновитьКэшОрганизации();
	ОбработкаОбъект.ОбновитьКэшПолучателяПлатежа();
	ОбработкаОбъект.ПолучитьНастройкуМакета();
	
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	
	ТаблицаДанныхНачислений = Новый ТаблицаЗначений;
	ТаблицаДанныхНачислений.Колонки.Добавить("Услуга");
	ТаблицаДанныхНачислений.Колонки.Добавить("Начислено");
	ТаблицаДанныхНачислений.Колонки.Добавить("Порядок");
	
	
	Если ТаблицаДанных.количество() <> 0 Тогда
		Для Каждого СтрТабл Из ТаблицаДанных Цикл
			Счетчик=1;
			Если СтрТабл.Значение.ТаблицаПечати.Количество()<>0 Тогда
				ИтогоКОплате = 0;
				Нов = ТаблицаДанныхНачислений.Добавить();
				Нов.Услуга = "Расчетный период";
				Нов.Начислено = формат(ПериодНачислений,"ДФ='ММММ гггг'")+" г.";
				Нов.Порядок = 1;
				
				Запрос = "[";
				Для Каждого СтрУсл Из СтрТабл.Значение.ТаблицаПечати Цикл
					Услуга = Строка(СтрУсл.УслугаПредставление)+" ("+СТрока(СтрУсл.ЕдИзм)+") ";
					
					Запрос = Строка(Запрос) + "{"+""""+"key"+""""+":"+""""+Строка(Услуга)+""""+","+""""+"value"+""""+":"+""""+Строка(СтрУсл.КОплатеЗаМесяц)+""""+"},";
					
					ИтогоКОплате = ИтогоКОплате + СтрУсл.КОплатеЗаМесяц;
				КонецЦикла;
				Запрос = Лев(Запрос,СтрДлина(Запрос)-1);
				Запрос = Запрос + "]";
				Запрос = СтрЗаменить(Запрос,"""","\""");
				Запрос = """"+"info"+""""+":" +""""+Запрос+"""";
				Запрос2 = "[";
				Запрос2 = Запрос2 + "{"+""""+"key"+""""+":"+""""+Строка("Лицевой счет")+""""+","+""""+"value"+""""+":"+""""+Строка(ЛС.Наименование)+""""+"},{"
				+""""+"key"+""""+":"+""""+Строка("Итого к оплате за расчетный период")+""""+","+""""+"value"+""""+":"+""""+Строка(ИтогоКОплате)+""""+"}";
				Запрос2 = Запрос2 + "]";
				Запрос2 = СтрЗаменить(Запрос2,"""","\""");
				Запрос2 = """"+"info1"+""""+":" +""""+Запрос2+"""";
				ИтоговаяСтрока = "{"+Запрос2+","+Запрос+"}";
				Нов = ТаблицаДанныхНачислений.Добавить();
				Нов.Услуга = "Итого к оплате за расчетный период";
				Нов.Начислено = ИтогоКОплате;
				Нов.Порядок = Счетчик+1;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;	
	
	// ТаблицаДанныхНачислений = ПолучитьТаблицуДанныхПоСчетчикамЛицевогоСчета(ЛС,"ТаблицаНачислений");
	
	Возврат ИтоговаяСтрока;
	
КонецФункции	
Процедура ОтправитьДетализацию(ТЗ,Настройки)
	
	ТаблицаДляИзмененияСтатуса = Новый ТаблицаЗначений;
	ТаблицаДляИзмененияСтатуса.Колонки.Добавить("ИД_События");
	ИзменитьСтатусы = Ложь;
	КодСтатуса = СтрЗаменить(Строка(Настройки.СтатусЗакрыто),Символы.НПП,""); // Закрыто обращение
	Для Каждого СТр Из ТЗ Цикл
		ЕстьОтвет = Истина;
		ТаблДетализации = ТаблицаДетализации(Стр.ЛС,Настройки);
		
		АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
		АдресРесурса1 = "/api/v4/events/"+СТрока(СТр.ИД_События);
		
		СтрокаПараметров = "";
		Запрос = ТаблДетализации;
		Запрос = КодироватьСтроку(Запрос,СпособКодированияСтроки.КодировкаURL);
		СтрокаПараметров = СтрокаПараметров+"?ApplicationId="+Настройки.НомерПриложения+"&Value="+Запрос;
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1+СтрокаПараметров);
		HTTPЗапрос.УстановитьТелоИзСтроки("", КодировкаТекста.UTF8);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
		Попытка
			Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		Исключение
			ЕстьОтвет = Ложь;
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка детализации","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		КонецПопытки;
		Если ЕстьОтвет Тогда 
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				Результат = Перевод(СтрокаОтвет1);
				
				Результат = "Обновление детализации по лицевым счетам. ЛС: "+Строка(СТр.ЛС)+". "+ Результат;
				
				НовСТр = ТаблицаДляИзмененияСтатуса.Добавить();
				НовСтр.ИД_События = Стр.ИД_События;
				
				
				Если Не ПустаяСтрока(Результат) Тогда
					РезультатПроверки1 = Результат;
					Если СокрЛП(РезультатПроверки1)="false" Тогда
					Иначе
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Ответ.КодСостояния = 500 Тогда
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
			ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Иначе
				
				Попытка
					СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				Исключение
					МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка детализации","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				КонецПопытки;	
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДляИзмененияСтатуса.Количество()<>0 Тогда 
		ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(СтрЗаменить(Настройки.СтатусЗакрыто,Символы.НПП,"")),Настройки);
	КонецЕсли;
	
КонецПроцедуры	
#КонецОбласти

#Область История_Оплат
Функция ОтправитьИсториюОплат()
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		// 1. Лицевые счета
		Если НачалоДня(Настройки.ДатаПоследнейВыгрузкиПоОплатам) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Возврат Истина;
		КонецЕсли;
		
		ТаблицаЛС = ПолучитьТаблицуЛицевыхСчетов(Настройки);
		Если ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоОплатам) Тогда
			ДатаС = Настройки.ДатаПоследнейВыгрузкиПоОплатам - (60*60*24*30);
		Иначе
			ДатаС = ТекущаяДатаСеанса() - (60*60*24*365);
		КонецЕсли;
		
		Если ОтправитьВСистемуИсториюОплат(Настройки,ТаблицаЛС,ДатаС) Тогда
			
			ОбъектНастройки = Настройки.ПолучитьОбъект();
			ОбъектНастройки.Прочитать();
			ОбъектНастройки.ДатаПоследнейВыгрузкиПоОплатам   = ТекущаяДатаСеанса();
			Попытка
				ОбъектНастройки.Записать();
			Исключение
			КонецПопытки;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;
КонецФункции
Функция ОтправитьВСистемуИсториюОплат(Настройки,ТаблицаЛС,ДатаС)
	СтрокаСобытий = "";
	СтрокаПараметров="";	
	ТаблицаОплат = ПолучитьДанныеПоОплатам(ТаблицаЛС,ДатаС,ТекущаяДатаСеанса());
	Сч=0;
	Если ТаблицаОплат.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрЛС Из ТаблицаОплат Цикл
		ИдОбъекта = ПолучитьИДЛицевогоСчета(СтрЛС.ЛицевойСчет);
		Если ИдОбъекта = "" Тогда Продолжить; КонецЕсли;
		
		Если Найти(СтрЛС.Регистратор,"Оплата КУ")=0 Тогда Продолжить; КонецЕсли;
		
		ИдентификаторПлатежа = СтрЛС.Регистратор.УникальныйИдентификатор();
		ИдентификаторПлатежа = СтрЗаменить(ИдентификаторПлатежа,"-","");
		Запрос1="";
		Запрос1 = Запрос1 + """"+"PaymentDocNumber"+""""+":"+""""+ИдентификаторПлатежа+""""+","+
		""""+"ActionName"+""""+":"+""""+"Оплата"+""""+","+
		""""+"ObjectId"+""""+":"+""""+Строка(ИдОбъекта)+""""+","+
		""""+"НомерЛицевогоСчета"+""""+":"+""""+Строка(СтрЛС.ЛицевойСчет.Наименование)+"""";
		Запрос1 = "{"+Запрос1+"}"; 
		СтрокаПараметров = СтрокаПараметров + "&create"+Строка(Сч)+"="+Строка(Запрос1);
		
		Запрос2="";
		Запрос2 = Запрос2 + """"+"Сумма"+""""+":"+""""+Строка(СтрЛС.Сумма)+""""+","+
		""""+"Дата"+""""+":"+""""+Лев(СтрЛС.Регистратор.Дата,10)+"""";
		Запрос2 = "{"+Запрос2+"}"; 
		СтрокаПараметров = СтрокаПараметров +"&update"+Строка(Сч)+"="+Строка(Запрос2);
		Сч = Сч + 1;
		Если Сч = 100 Тогда 
			ТекущаяСтрокаСобытия = СтрокаПараметров;
			
			Если СтрокаСобытий = "" Тогда
				СтрокаСобытий = ТекущаяСтрокаСобытия;
			Иначе
				СтрокаСобытий = СтрокаСобытий+"&"+ТекущаяСтрокаСобытия;
			КонецЕсли;
			
			СтрокаПриложения = "ApplicationId=" + КодироватьСтроку(Строка(СокрЛП(Настройки.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
			СтрокаСобытий = Строка(СтрокаПриложения) + СтрокаСобытий;
			
			АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
			АдресРесурса1 = "/api/v6/events/createupdate";
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаСобытий, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории оплат 3","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				Возврат Ложь;
			КонецПопытки;
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			Иначе
				МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории оплат 4","",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				Возврат Ложь;
			КонецЕсли;
			
			СтрокаПараметров = "";
			СтрокаСобытий = "";
			Сч=0;
			продолжить;
		КонецЕсли;
	КонецЦикла;
	
	
	Если ТаблицаОплат.Количество() <> 0 Тогда
		ТекущаяСтрокаСобытия = СтрокаПараметров;
		// ТекущаяСтрокаСобытия=СоздатьСтрокаСобытиеНеКодированное(ТаблицаЛС,Действие_Для_События,Сумма_Для_События,Период_Для_События,Статус_Для_События,Номер_Док_Оплата_Для_События,НомерТекущейСтроки);
		Если СтрокаСобытий = "" Тогда
			СтрокаСобытий = ТекущаяСтрокаСобытия;
		Иначе
			СтрокаСобытий = СтрокаСобытий+"&"+ТекущаяСтрокаСобытия;
		КонецЕсли;
		
		СтрокаПриложения = "ApplicationId=" + КодироватьСтроку(Строка(СокрЛП(Настройки.НомерПриложения)),СпособКодированияСтроки.КодировкаURL) + "&";
		СтрокаСобытий = Строка(СтрокаПриложения) + СтрокаСобытий;
		
		АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
		АдресРесурса1 = "/api/v6/events/createupdate";
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаСобытий, КодировкаТекста.UTF8);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300, Новый ЗащищенноеСоединениеOpenSSL);
		Попытка
			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории оплат 1","",СтрокаСобытий,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
			Возврат Ложь;
		КонецПопытки;
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Иначе
			МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории оплат 2",Ответ.КодСостояния,СтрокаСобытий,Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8),ОписаниеОшибки(),ТекущаяДатаСеанса());	
			Возврат Ложь;
		КонецЕсли;
		
		//Иначе 
		//	Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
Функция ПолучитьИДЛицевогоСчета(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МЛК_АдресаЛичныхКабинетов.ИДОбъекта КАК ИДОбъекта
	|ИЗ
	|	РегистрСведений.МЛК_АдресаЛичныхКабинетов КАК МЛК_АдресаЛичныхКабинетов
	|ГДЕ
	|	МЛК_АдресаЛичныхКабинетов.ЛицевойСчет = &ЛицевойСчет";
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	РЗ = Запрос.Выполнить();
	Выб = РЗ.Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.ИДОбъекта;
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции	
Функция ПолучитьДанныеПоОплатам(ЛС,Дата1,Дата2)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХ.Период КАК Период,
	|	бит_НачисленияПоУслугамЖКХ.Регистратор КАК Регистратор,
	|	бит_НачисленияПоУслугамЖКХ.ВидДвижения КАК ВидДвижения,
	|	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(бит_НачисленияПоУслугамЖКХ.Сумма) КАК Сумма
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ КАК бит_НачисленияПоУслугамЖКХ
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет В(&ЛицевойСчет)
	|	И бит_НачисленияПоУслугамЖКХ.ВидДвижения = &ВидДвижения
	|	И бит_НачисленияПоУслугамЖКХ.Период >= &Дата1
	|	И бит_НачисленияПоУслугамЖКХ.Период <= &Дата2
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХ.Регистратор,
	|	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХ.ВидДвижения,
	|	бит_НачисленияПоУслугамЖКХ.Период";
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛС);
	Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
#КонецОбласти

#Область История_Начислений
Функция ОтправитьИсториюНачислений()
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		Если НачалоДня(Настройки.ДатаПоследнейВыгрузкиПоНачислениям) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Возврат Истина;
		КонецЕсли;
		ТаблицаЛС = ПолучитьТаблицуЛицевыхСчетов(Настройки);
		
		Если ЗначениеЗаполнено(Настройки.ДатаПоследнейВыгрузкиПоНачислениям) Тогда
			ДатаС = Настройки.ДатаПоследнейВыгрузкиПоНачислениям - (60*60*24*30);
		Иначе
			ДатаС = ТекущаяДатаСеанса() - (60*60*24*365);
		КонецЕсли;
		
		Если СоздатьСобытиеНачислениеНовое(Настройки, ТаблицаЛС, ДатаС, ТекущаяДатаСеанса()) Тогда
			ОбъектНастроек = Настройки.ПолучитьОбъект();
			ОбъектНастроек.Прочитать();
			ОбъектНастроек.ДатаПоследнейВыгрузкиПоНачислениям = ТекущаяДатаСеанса();
			Попытка
				ОбъектНастроек.Записать();
			Исключение
				
			КонецПопытки;
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	КонецЦикла;	
КонецФункции
Функция ПолучитьДанныеПоНачислениям(ЛС,Настройки,ДатаНачала,ДатаОкончания)
	Квитанция = Новый ТабличныйДокумент;
	
	Результат = Неопределено;
	
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	ОбработкаОбъект.МакетКв               = Настройки.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	// ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДатаСеанса()), -1);
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = Настройки.Организация;
	ОбработкаОбъект.РС                    = Настройки.Организация.ОсновнойБанковскийСчет;
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	
	НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛС;
	
	Обработка = ОбработкаОбъект;
	// Периоды
	ТаблицаДанныхНачислений = Новый ТаблицаЗначений;
	ТаблицаДанныхНачислений.Колонки.Добавить("Период");
	ТаблицаДанныхНачислений.Колонки.Добавить("Начислено");
	
	
	КоличествоМесяцев = Окр((ДатаОкончания - ДатаНачала) / (60*60*24*30),0);
	ПериодДанных = КонецМесяца(ДатаНачала);	
	Для Мес = 1 По КоличествоМесяцев Цикл
		ПериодНачислений = ПолучитьПериодНачисленийПоЛицевомуСчету(ЛС);
		
		Обработка.Период      = ПериодНачислений;
		Обработка.ОбновитьНастройкиЖКХ();
		Обработка.ОбновитьКэшОрганизации();
		// БИТ_В.Калинин 24.01.2017 13:35:35 Начало правки...
		Обработка.ОбновитьКэшПолучателяПлатежа();
		// БИТ_В.Калинин 24.01.2017 13:35:35 Конец правки.
		Обработка.ПолучитьНастройкуМакета();
		//
		ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
		//
		Если ТаблицаДанных.количество() <> 0 Тогда
			Для Каждого СтрТабл Из ТаблицаДанных Цикл
				Если СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц = 0 Тогда Продолжить; КонецЕсли;
				Нов = ТаблицаДанныхНачислений.Добавить();
				Нов.Период   = СтрТабл.Значение.СтруктураДанных.Дата; 
				Нов.Начислено= СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц;
			КонецЦикла;
		КонецЕсли;
		ПериодДанных = КонецМесяца(КонецМесяца(ПериодДанных)+(60*60*24));
	КонецЦикла;
	Возврат ТаблицаДанныхНачислений;
КонецФункции	
Функция СоздатьСобытиеНачислениеНовое(Настройки, ТаблицаЛС, НачалоПериода, КонецПериода)
	
	ТаблицаНачислений = ТаблицаНачисленийЗаПериод(Настройки, ТаблицаЛС,  НачалоПериода, КонецПериода);
	
	СтрокаСобытий = "";
	СтрокаПараметров="";	
	Сч=0;
	Если ТаблицаНачислений = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Для Каждого СтрЛС Из ТаблицаНачислений Цикл
		
		// ТаблицаОплат = ПолучитьДанныеПоНачислениям(СтрЛС,Настройки,ТекущаяДата()-(60*60*24*365*2),КонецМесяца(ТекущаяДата()));
		
		ИдОбъекта = ПолучитьИДЛицевогоСчета(СтрЛС.ЛицевойСчет);
		Если ИдОбъекта = "" Тогда Продолжить; КонецЕсли;
		
		ИдентификаторПлатежа = Формат(СтрЛС.Период,"ДФ = 'ММММ гггг'");
		ИдентификаторПлатежа = СтрЗаменить(ИдентификаторПлатежа,"-","");
		ИдентификаторПлатежа = СтрЗаменить(ИдентификаторПлатежа," ","");
		ИдентификаторПлатежа = СтрЗаменить(ИдентификаторПлатежа,Символы.НПП,"");			
		Запрос1="";
		Запрос1 = Запрос1 + """"+"PaymentDocNumber"+""""+":"+""""+ИдентификаторПлатежа+""""+","+
		""""+"ActionName"+""""+":"+""""+"Начисление"+""""+","+
		""""+"ObjectId"+""""+":"+""""+Строка(ИдОбъекта)+""""+","+
		""""+"НомерЛицевогоСчета"+""""+":"+""""+Строка(СтрЛС.ЛицевойСчет.Наименование)+"""";
		Запрос1 = "{"+Запрос1+"}"; 
		// Запрос1 = КодироватьСтроку(Запрос1,СпособКодированияСтроки.КодировкаURL);
		СтрокаПараметров = СтрокаПараметров + "&create"+Строка(Сч)+"="+Строка(Запрос1);
		Запрос2="";
		Запрос2 = Запрос2 + """"+"Сумма"+""""+":"+""""+Строка(СтрЛС.Сумма)+""""+","+
		""""+"Дата"+""""+":"+""""+Лев(СтрЛС.Период,10)+""""+","+
		""""+"CreateDate"+""""+":"+""""+Лев(СтрЛС.Период,10)+"""";
		Запрос2 = "{"+Запрос2+"}"; 
		// Запрос2 = КодироватьСтроку(Запрос2,СпособКодированияСтроки.КодировкаURL);
		СтрокаПараметров = СтрокаПараметров +"&update"+Строка(Сч)+"="+Строка(Запрос2);
		
		
		Сч = Сч + 1;
		Если Сч = 100 Тогда 
			ТекущаяСтрокаСобытия = СтрокаПараметров;
			
			Если СтрокаСобытий = "" Тогда
				СтрокаСобытий = ТекущаяСтрокаСобытия;
			Иначе
				СтрокаСобытий = СтрокаСобытий+"&"+ТекущаяСтрокаСобытия;
			КонецЕсли;
			
			СтрокаПриложения = "ApplicationId=" + КодироватьСтроку(Строка(СокрЛП(Настройки.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
			СтрокаСобытий = Строка(СтрокаПриложения)+СтрокаСобытий;
			
			АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
			АдресРесурса1 = "/api/v6/events/createupdate";
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаСобытий, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 300,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории начислений 5",Ответ.КодСостояния,Строка(АдресСервисаСтр)+Строка(АдресРесурса1)+Строка(СтрокаСобытий),,ОписаниеОшибки(),ТекущаяДатаСеанса());	
				Возврат Ложь;
			КонецПопытки;
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			Иначе
				МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории начислений 6",Ответ.КодСостояния,Строка(АдресСервисаСтр)+Строка(АдресРесурса1)+Строка(СтрокаСобытий),Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8),ОписаниеОшибки(),ТекущаяДатаСеанса());	
				Возврат Ложь;
			КонецЕсли;
			СтрокаПараметров = "";
			СтрокаСобытий = "";
			Сч=0;
			// Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаПараметров = "" Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ТекущаяСтрокаСобытия = СтрокаПараметров;
	// ТекущаяСтрокаСобытия=СоздатьСтрокаСобытиеНеКодированное(ТаблицаЛС,Действие_Для_События,Сумма_Для_События,Период_Для_События,Статус_Для_События,Номер_Док_Оплата_Для_События,НомерТекущейСтроки);
	Если СтрокаСобытий = "" Тогда
		СтрокаСобытий = ТекущаяСтрокаСобытия;
	Иначе
		СтрокаСобытий = СтрокаСобытий+"&"+ТекущаяСтрокаСобытия;
	КонецЕсли;
	
	СтрокаПриложения = "ApplicationId=" + КодироватьСтроку(Строка(СокрЛП(Настройки.НомерПриложения)),СпособКодированияСтроки.КодировкаURL) + "&";
	СтрокаСобытий=Строка(СтрокаПриложения) + СтрокаСобытий;
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса1 = "/api/v6/events/createupdate";
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаСобытий, КодировкаТекста.UTF8);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , ,300 ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории начислений",Ответ.КодСостояния,Строка(АдресСервисаСтр)+Строка(АдресРесурса1)+Строка(СтрокаСобытий),,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецПопытки;
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Иначе
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Отправка истории начислений",Ответ.КодСостояния,Строка(АдресСервисаСтр)+Строка(АдресРесурса1)+Строка(СтрокаСобытий),Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8),ОписаниеОшибки(),ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции	
Функция ТаблицаНачисленийЗаПериод(Настройки, ТаблицаЛС, НачалоПериода, КОнецПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, Настройки.Организация);
	Запрос.УстановитьПараметр("СписокЛС"	, ТаблицаЛС);
	
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(КонецПериода));
	
	
	Если ЗначениеЗаполнено(Настройки.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	
	Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	ЕСТЬNULL(бит_Квартиры.Наименование, """") КАК НомерКвартиры
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК УслугаЖКХ
	|ПОМЕСТИТЬ ВТ_СведенияПоУслугам
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор,
	|	бит_НачисленияПоУслугамЖКХОбороты.Период КАК Период,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХОбороты.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Период,
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачислениеПениПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обороты.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Обороты.Регистратор КАК Регистратор,
	|	ВТ_Обороты.Период КАК Период,
	|	СУММА(ВТ_Обороты.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ГрОбороты
	|ИЗ
	|	ВТ_Обороты КАК ВТ_Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обороты.ЛицевойСчет,
	|	ВТ_Обороты.Регистратор,
	|	ВТ_Обороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	|	ВТ_ГрОбороты.Регистратор КАК Регистратор,
	|	ВТ_ГрОбороты.Период КАК Период,
	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	|	ВТ_ЛицевыеСчета.Квартира КАК Квартира,
	|	ВТ_ЛицевыеСчета.НомерКвартиры КАК НомерКвартиры,
	|	СУММА(ВТ_ГрОбороты.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрОбороты КАК ВТ_ГрОбороты
	|		ПО ВТ_ЛицевыеСчета.ЛицевойСчет = ВТ_ГрОбороты.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС,
	|	ВТ_ЛицевыеСчета.Здание,
	|	ВТ_ЛицевыеСчета.Квартира,
	|	ВТ_ЛицевыеСчета.НомерКвартиры,
	|	ВТ_ГрОбороты.Регистратор,
	|	ВТ_ГрОбороты.Период";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество()<>0 Тогда
		Выборка.Свернуть("ЛицевойСчет, Период","Сумма");
		Выборка.Сортировать("Период");
		
		Возврат Выборка;
	КонецЕсли;
	ВОзврат Неопределено;
КонецФункции	
#КонецОбласти

#Область Загрузка_Реестра_Оплат_В_Регистр
Процедура МЛК_ИмпортОплат() Экспорт
	
	Если Не Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СинхронизацияОплат = ПодгрузитьОплаты();	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл 
		СинхронизироватьПлатежки(Настройки);
	КонецЦикла;
	
КонецПроцедуры
Функция ПодгрузитьОплаты()
	Если Не ПроверитьЕстьЛиИнтернетСоединение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		Возврат ПодгрузитьОплатыОнлайн(Настройки);
	КонецЦикла;	
КонецФункции	
Функция ПодгрузитьОплатыОнлайн(Настройки)
	//Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	//Журнал
	
	СтатусЗавершено=Настройки.СтатусЗакрыто;
	СтатусНовое=Настройки.СтатусОтправленоВУК;
	СтатусНовое = СтрЗаменить(СтатусНовое," ","");
	СтатусНовое = СтрЗаменить(СтатусНовое,Символы.НПП,"");
	
	Успешных=0;Всего=0;
	
	
	АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	АдресРесурса = "/api/v4/events?ApplicationId="+Строка(СокрЛП(Настройки.НомерПриложения))+"&query=";
	
	// Журнал
	ЖурналЗапросБезКодировки = Строка(АдресСервисаСтр)+Строка(АдресРесурса);
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Оплата Онлайн"""+","
	+"""andor"""                +":"+"""and"""
	+"}"+","
	+"{"
	+"""field"""                +":"+ """value_ID пакета платежа"""+","
	+"""operation"""            +":"+ """!="""+","
	+"""value"""                +":"+""""""+","
	+"""andor"""                +":"+"""and"""
	+"}"+","
	+"{"
	+"""field"""                +":"+ """StatusId"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(СтатусНовое)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";	
	
	ЖурналЗапросБезКодировки = ЖурналЗапросБезКодировки + Строка(СтрокаПараметров);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Загрузка оплат онлайн из МЛК",,,ОписаниеОшибки(),ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецПопытки;
	
	
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
			РезультатПроверки = СтрокаОтвет;
			Если СокрЛП(РезультатПроверки)="false" Тогда
				МЛК_Общий.ЗаписатьДанныеВЖурнал("Загрузка оплат онлайн из МЛК",Ответ.КодСостояния,ЖурналЗапросБезКодировки,Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8),ОписаниеОшибки(),ТекущаяДатаСеанса());	
				Возврат Ложь;
			Иначе
				
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
				ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
				ЧтениеJSON.Закрыть();
				
				
				
				ТЗ = РаспарситьВТаблицуОплаты(ЗагруженныеДанные);
				
				ЗагрузитьТаблицуВРегистр(ТЗ,Настройки);
				
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал("Загрузка оплат онлайн из МЛК",Ответ.КодСостояния,ЖурналЗапросБезКодировки,Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8),ОписаниеОшибки(),ТекущаяДатаСеанса());	
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции
Функция РаспарситьВТаблицуОплаты(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Пакет");
	ТЗ.Колонки.Добавить("Код1С");
	ТЗ.Колонки.Добавить("СуммаОплаты");
	ТЗ.Колонки.Добавить("Описание");
	
	ТЗ.Колонки.Добавить("Дата");
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_События");
	Для Каждого стр из Данные Цикл
		
		Нов = ТЗ.Добавить();
		Нов.Пакет            = Стр["value_ID пакета платежа"];
		Нов.Код1С            = Стр["object_Код1С"];
		Нов.СуммаОплаты      = Стр["value_Amount"];
		Нов.Описание         = Стр["value_Description"];
		Нов.Статус           = СтрЗаменить(Стр["StatusId"],Символы.НПП,""); 
		Нов.ИД_События       = СтрЗаменить(Стр["id"],Символы.НПП,"");       //ИД события по которому будем менять статус
		
		СтрДата              = Стр["CreateDate"]; //"CreateDate"  UpdateDate
		Нов.Дата             = Дата(Лев(СтрДата,4),Сред(СтрДата,6,2),Сред(СтрДата,9,2));		
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
	
КонецФункции
Процедура ЗагрузитьТаблицуВРегистр(ТЗ,Настройки)
	
	Для Каждого  Стр Из ТЗ Цикл
		
		Если ПроверитьСобытие(Стр.ИД_События) Тогда Продолжить; КонецЕсли;
		СсылкаЛС =  Справочники.бит_ЛицевыеСчета.НайтиПоКоду(Стр.Код1с);
		Если ССылкаЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
		НоваяЗапись = РегистрыСведений.МЛК_РеестрОплат.СоздатьМенеджерЗаписи();
		НоваяЗапись.ДатаЗагрузки         = ТекущаяДата();
		НоваяЗапись.ЛицевойСчет          = СсылкаЛС;
		НоваяЗапись.Пакет                = Стр.Пакет;
		НоваяЗапись.Сумма                = Стр.СуммаОплаты;
		НоваяЗапись.Описание             = Стр.Описание;
		НоваяЗапись.ИД_События           = Стр.ИД_События;
		НоваяЗапись.Дата                 = Стр.Дата;
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
	//Теперь создадим документ оплаты КУ
	
	СоздатьДокументыОплатыКУ(Настройки);
КонецПроцедуры
Функция ПроверитьСобытие(ИД_События)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МЛК_РеестрОплат.ИД_События КАК ИД_События
	|ИЗ
	|	РегистрСведений.МЛК_РеестрОплат КАК МЛК_РеестрОплат
	|ГДЕ
	|	МЛК_РеестрОплат.ИД_События = &ИД_События";
	Запрос.УстановитьПараметр("ИД_События",ИД_События);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
Процедура СоздатьДокументыОплатыКУ(Настройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	МЛК_РеестрОплат.ЛицевойСчет КАК ЛицевойСчет,
	|	МЛК_РеестрОплат.Пакет КАК Пакет,
	|	МЛК_РеестрОплат.Дата КАК Дата,
	|	МЛК_РеестрОплат.ДатаЗагрузки КАК ДатаЗагрузки,
	|	МЛК_РеестрОплат.ИД_События КАК ИД_События,
	|	МЛК_РеестрОплат.Сумма КАК Сумма,
	|	МЛК_РеестрОплат.Описание КАК Описание,
	|	МЛК_РеестрОплат.Платежка КАК Платежка,
	|	МЛК_РеестрОплат.ДокОплатыБит КАК ДокОплатыБит
	|ИЗ
	|	РегистрСведений.МЛК_РеестрОплат КАК МЛК_РеестрОплат
	|ГДЕ
	|	МЛК_РеестрОплат.Пакет <> """"
	|	И МЛК_РеестрОплат.ДокОплатыБит = &ДокОплатыБит" ;
	
	Запрос.УстановитьПараметр("ДокОплатыБит",Документы.бит_ОплатаКУ.ПустаяСсылка());
	КопияТЗ = Запрос.Выполнить().Выгрузить();
	КопияТЗ.Свернуть("Пакет,Дата","Сумма");
	
	Для Каждого Стр Из КопияТЗ Цикл
		
		Документ = Документы.бит_ОплатаКУ.СоздатьДокумент();
		
		Дата = Стр.дата; //Дата пакета
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Документ.Дата           = Дата;
		Документ.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
		Документ.Организация    = Настройки.Организация;
		Документ.Ответственный  = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		НайденнаяСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","7203468252");
		Документ.ИсточникОплаты = НайденнаяСсылка;
		
		//Документ.ВводВРучную    = Объект.Вручную;
		//Документ.НомерРеестра   = Объект.НомерРеестра;
		Документ.Комментарий    = Строка(Стр.Пакет)+" "+"""МЛК ОПЛАТЫ"".";
		
		ИтогПоДокументу      = Стр.Сумма;
		СуммаИтогПоДокументу = 0;
		
		
		МассивЛС = Новый Массив;
		
		ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата,Настройки);
		
		ТЗОплатыПакета = ПолучитьТаблицуПакета(Стр.Пакет);
		
		Для каждого СтрокаВторогоУровня Из ТЗОплатыПакета Цикл
			
			Если ЗначениеЗаполнено(СтрокаВторогоУровня.Дата) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
				
				НоваяСтрокаЛС = Документ.СписокЛС.Добавить();
				НоваяСтрокаЛС.ЛицевойСчет     = СтрокаВторогоУровня.ЛицевойСчет;
				НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
				
				ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
				СуммаИтогПоЛС = 0;
				
				
				//Документ.ВводВРучную    = Объект.Вручную;
				НоваяСтрокаЛС.Сумма = СтрокаВторогоУровня.Сумма;
				
				тмпСписокЛС = Новый Массив;
				тмпСписокЛС.Добавить(СтрокаВторогоУровня.ЛицевойСчет);
				//НоваяСтрокаЛС.ВыгрузитьКолонку("ЛицевойСчет");
				
				Колонки  =  Документ.СписокЛС.ВыгрузитьКолонки();
				
				УдалитКолоку = Колонки.Найти("Услуга");
				
				//Колонки.Удалить(УдалитКолоку);
				
				бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Документ.СписокЛС, Колонки, тмпСписокЛС, Документ.Организация , Документ.Дата, Документ.ИсточникОплаты, Истина);
				
				
				
				ТаблицаЛС          = Документ.СписокЛС.Выгрузить();
				КоммунальныеУслуги = Документ.СписокУслуг.ВыгрузитьКолонки();
				
				бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Дата,
				Настройки.Организация,
				ТаблицаЛС,
				КоммунальныеУслуги,
				ПараметрыЖКХ.ЛьготаПерсонифицированная,
				ПараметрыЖКХ.РасчетСУчетомДолейВладения,
				ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта,
				ПараметрыЖКХ.НачислениеСУчетомДнейПроживания,
				ПараметрыЖКХ.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.НачислятьПениСУчетомПереплаты); 
				
				Документ.СписокУслуг.Очистить();
				Документ.СписокУслуг.Загрузить(КоммунальныеУслуги);
				
				СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
				
			КонецЕсли; 
		КонецЦикла; 
		
		Документ.СуммаДокумента = СуммаИтогПоДокументу;
		
		Документ.ЗапролнитьСчета();
		
		Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
			
			// Тут создадим оплату по карте
			МенеджерЗаписи = РегистрыСведений.МЛК_РеестрОплат.СоздатьНаборЗаписей();
			МенеджерЗаписи.Отбор.пакет.Установить(Стр.Пакет);
			МенеджерЗаписи.Прочитать();
			
			Для каждого СтрНабор Из  МенеджерЗаписи Цикл
				// Изменить существующую запись
				СтрНабор.ДокОплатыБит = Документ.Ссылка;
			КонецЦикла;
			
			МенеджерЗаписи.Записать();			
			
			СоздатьОперацииПоПлатежнойКарте(Документ.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
Функция ОбновитьПараметрыЖКХ(Дата,Настройки)
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты", Ложь); 
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Настройки.Организация, ПараметрыЖКХ);
	
	Возврат ПараметрыЖКХ;
	
КонецФункции
Функция ПолучитьТаблицуПакета(Пакет)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	МЛК_РеестрОплат.ЛицевойСчет КАК ЛицевойСчет,
	|	МЛК_РеестрОплат.Пакет КАК Пакет,
	|	МЛК_РеестрОплат.Дата КАК Дата,
	|	МЛК_РеестрОплат.ДатаЗагрузки КАК ДатаЗагрузки,
	|	МЛК_РеестрОплат.ИД_События КАК ИД_События,
	|	МЛК_РеестрОплат.Сумма КАК Сумма,
	|	МЛК_РеестрОплат.Описание КАК Описание,
	|	МЛК_РеестрОплат.Платежка КАК Платежка,
	|	МЛК_РеестрОплат.ДокОплатыБит КАК ДокОплатыБит
	|ИЗ
	|	РегистрСведений.МЛК_РеестрОплат КАК МЛК_РеестрОплат
	|ГДЕ
	|	МЛК_РеестрОплат.Пакет <> """"
	|	И МЛК_РеестрОплат.Пакет = &Пакет" ;
	Запрос.УстановитьПараметр("Пакет",Пакет);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции	
Процедура СоздатьОперацииПоПлатежнойКарте(ОплатаКу)
	// Тут создадим оплату по карте
	МенеджерЗаписи = РегистрыСведений.МЛК_РеестрОплат.СоздатьНаборЗаписей();
	МенеджерЗаписи.Отбор.ДокОплатыБит.Установить(ОплатаКу);
	МенеджерЗаписи.Прочитать();
	
	Для каждого СтрНабор Из  МенеджерЗаписи Цикл
		// Изменить существующую запись
		// СтрНабор.ДокОплатыБит = Документ.Ссылка;
		
		ПлатежныйДокумент = Документы.ОплатаПлатежнойКартой.СоздатьДокумент(); 
		ПлатежныйДокумент.Дата              = ОплатаКУ.Дата;
		ПлатежныйДокумент.ДокументОснование = ОплатаКУ.Ссылка;
		ТранзитныйСчетОплаты = ПолучитьСчет(ОплатаКу.Организация);
		ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(ОплатаКу.Организация, ОплатаКу.Дата);
		ТаблицаУСН = ?(ПрименениеУСН, ПолучитьТаблицуУСН(ОплатаКу),Неопределено);
		СуммаПринимаемых = ПолучитьСуммуПолучаемых(ТаблицаУСН, СтрНабор.ЛицевойСчет);
		БанковскийСчет = "";
		ИсточникОплаты = "";
		ДокументЗаписан = Ложь;
		ЗаполнитьПКО(ПлатежныйДокумент, СтрНабор, ОплатаКу, Истина, ДокументЗаписан, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых
		,БанковскийСчет, ИсточникОплаты,СтрНабор.ИД_События);
		
		
	КонецЦикла;
КонецПроцедуры
Функция ПолучитьСчет(Знач Организация)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетАбонента
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"        , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация" , Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.СчетАбонента) Тогда
			
			СубконтоКонтрагент = Выборка.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
			
			Если СубконтоКонтрагент = Неопределено Тогда
				
				Возврат Выборка.ТранзитныйСчетОплаты;
				
			Иначе
				
				Возврат Выборка.СчетАбонента;
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.ТранзитныйСчетОплаты) Тогда
			
			Возврат Выборка.ТранзитныйСчетОплаты;
			
		Иначе
			
			Возврат ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			
		КонецЕсли; 
		
	Иначе
		
		Возврат ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		
	КонецЕсли; 
	
КонецФункции
Функция ПолучитьТаблицуУСН(Оплата)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Оплата);
	Запрос.УстановитьПараметр("Дата"  , Оплата.Дата);
	
	Запрос.УстановитьПараметр("Организация"  , Оплата.Организация);
	НеПриниматьПениСобственныхУслугВДоход = Истина;
	НеПриниматьПениСтороннихУслугВДоход   = Истина;
	
	Если НЕ НеПриниматьПениСобственныхУслугВДоход и НЕ НеПриниматьПениСтороннихУслугВДоход Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет,
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма + бит_ОплатаКУСписокУслуг.СуммаПени) КАК Сумма,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК СуммаБезПени,
		|	СУММА(бит_ОплатаКУСписокУслуг.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
		|ГДЕ
		|	бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Поставщики.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств ССЫЛКА Справочник.Организации
		|				ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ЛОЖЬ
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ЛОЖЬ
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|							ИНАЧЕ ВЫБОР
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ЛОЖЬ
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК Сумма,
		|	Поставщики.Услуга,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.Период) КАК Период,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств) КАК ПолучательДенежныхСредств,
		|	Поставщики.Поставщик
		|ИЗ
		|	(ВЫБРАТЬ
		|		Оплата.ЛицевойСчет КАК ЛицевойСчет,
		|		Оплата.Услуга КАК Услуга,
		|		Оплата.Сумма КАК Сумма,
		|		Оплата.СуммаБезПени КАК СуммаБезПени,
		|		Оплата.СуммаПени КАК СуммаПени,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
		|	ИЗ
		|		Оплата КАК Оплата
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|					&Дата,
		|					ЛицевойСчет В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.ЛицевойСчет
		|							ИЗ
		|								Оплата КАК Таб)
		|						И Услуга В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.Услуга
		|							ИЗ
		|								Оплата КАК Таб)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|			ПО Оплата.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|				И Оплата.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга) КАК Поставщики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Дата, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО Поставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|			И Поставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	Поставщики.ЛицевойСчет,
		|	Поставщики.Услуга,
		|	Поставщики.Поставщик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
	ИначеЕсли НЕ НеПриниматьПениСобственныхУслугВДоход и НеПриниматьПениСтороннихУслугВДоход Тогда	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ОплатаКУСписокУслуг.Услуга КАК Услуга,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма + бит_ОплатаКУСписокУслуг.СуммаПени) КАК Сумма,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК СуммаБезПени,
		|	СУММА(бит_ОплатаКУСписокУслуг.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
		|ГДЕ
		|	бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Поставщики.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств ССЫЛКА Справочник.Организации
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ЛОЖЬ
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ЛОЖЬ
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|							ИНАЧЕ ВЫБОР
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ЛОЖЬ
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.СуммаПени, 0)
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.Сумма, 0)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК Сумма,
		|	Поставщики.Услуга,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.Период) КАК Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		Оплата.ЛицевойСчет КАК ЛицевойСчет,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
		|		Оплата.Услуга КАК Услуга,
		|		Оплата.Сумма КАК Сумма,
		|		Оплата.СуммаБезПени КАК СуммаБезПени,
		|		Оплата.СуммаПени КАК СуммаПени
		|	ИЗ
		|		Оплата КАК Оплата
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|					&Дата,
		|					ЛицевойСчет В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.ЛицевойСчет
		|							ИЗ
		|								Оплата КАК Таб)
		|						И Услуга В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.Услуга
		|							ИЗ
		|								Оплата КАК Таб)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|			ПО Оплата.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|				И Оплата.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга) КАК Поставщики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Дата, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО Поставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|			И Поставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	Поставщики.ЛицевойСчет,
		|	Поставщики.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
	ИначеЕсли НеПриниматьПениСобственныхУслугВДоход и НеПриниматьПениСтороннихУслугВДоход Тогда	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет,
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма + бит_ОплатаКУСписокУслуг.СуммаПени) КАК Сумма,
		|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК СуммаБезПени,
		|	СУММА(бит_ОплатаКУСписокУслуг.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
		|ГДЕ
		|	бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ОплатаКУСписокУслуг.Услуга,
		|	бит_ОплатаКУСписокУслуг.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Поставщики.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств ССЫЛКА Справочник.Организации
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Аренда)
		|							И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды.НалоговыйУчет = ИСТИНА
		|						ТОГДА ЕСТЬNULL(Поставщики.СуммаБезПени, 0)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Коммунальная)
		|									И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ.НалоговыйУчет = ИСТИНА
		|								ТОГДА ЕСТЬNULL(Поставщики.СуммаБезПени, 0)
		|							ИНАЧЕ ВЫБОР
		|									КОГДА Поставщики.Услуга.ТипыНачислений = ЗНАЧЕНИЕ(Перечисление.бит_ТипыНачисленийпоЖКХ.Эксплуатационная)
		|											И бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС.НалоговыйУчет = ИСТИНА
		|										ТОГДА ЕСТЬNULL(Поставщики.СуммаБезПени, 0)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК Сумма,
		|	Поставщики.Услуга,
		|	МАКСИМУМ(бит_ПолучателиДенежныхСредствСрезПоследних.Период) КАК Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		Оплата.ЛицевойСчет КАК ЛицевойСчет,
		|		Оплата.Услуга КАК Услуга,
		|		Оплата.Сумма КАК Сумма,
		|		Оплата.СуммаБезПени КАК СуммаБезПени,
		|		Оплата.СуммаПени КАК СуммаПени,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик.ПолучательДенежныхСредств КАК ПоставщикПолучательДенежныхСредств
		|	ИЗ
		|		Оплата КАК Оплата
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|					&Дата,
		|					ЛицевойСчет В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.ЛицевойСчет
		|							ИЗ
		|								Оплата КАК Таб)
		|						И Услуга В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Таб.Услуга
		|							ИЗ
		|								Оплата КАК Таб)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|			ПО Оплата.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|				И Оплата.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга) КАК Поставщики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Дата, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО Поставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга,
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	Поставщики.ЛицевойСчет,
		|	Поставщики.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
	КонецЕсли;	
	
	Возврат  Запрос.Выполнить();
	
КонецФункции
Функция ПолучитьСуммуПолучаемых(ТаблицаУСН, ЛицевойСчет = Неопределено)
	
	Сумма = 0;
	
	Если ТипЗнч(ТаблицаУСН) = Тип("РезультатЗапроса") Тогда
		
		Выборка = ТаблицаУСН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Выборка.Следующий() Тогда
			
			Сумма = Выборка.Сумма;
			
			СуммаЛС = 0;
			
			Если НЕ ЛицевойСчет = Неопределено Тогда
				
				ВыборкаЛС = Выборка.Выбрать();
				
				Пока ВыборкаЛС.Следующий() Цикл
					
					Если ВыборкаЛС.ЛицевойСчет = ЛицевойСчет Тогда
						
						СуммаЛС = СуммаЛС + ВыборкаЛС.Сумма;
						
						Сумма = СуммаЛС;
						
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Сумма
	
КонецФункции
Функция ПолучитьКонтрагентаЛицевогоСчета(Знач Дата, Знач ЛицевойСчет)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ОтветственныеЛицаПоКУСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Контрагент;
		
	Иначе
		
		Возврат Справочники.Контрагенты.ПустаяСсылка();
		
	КонецЕсли; 
	
КонецФункции
Процедура ПроверкаКурсовВалют(СтрокаПлатеж, КурсДокумента, КратностьДокумента) Экспорт
	
	КурсДокумента      = ?(КурсДокумента      = 0, 1, КурсДокумента);
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента);
	
	Если Не СтрокаПлатеж = Неопределено Тогда
		СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);
		
	КонецЕсли;
	
КонецПроцедуры
Процедура ЗаполнитьПКО(ПлатежныйДокумент,Строка, Оплата, ДокументЗаписан = Ложь, РабитьПоЛС = Ложь, ТранзитныйСчетОплаты, ПрименениеУСН, СуммаПринимаемых, БанковскийСчет, ИсточникОплаты, ИД_События)
	
	Объект = ПлатежныйДокумент;
	
	ПлатежныйДокумент.Дата				= Оплата.Дата;
	ПлатежныйДокумент.Организация		= Оплата.Организация;
	ПлатежныйДокумент.ВидОперации		= Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя;	
	ПлатежныйДокумент.ДокументОснование	= Оплата;	
	ПлатежныйДокумент.Ответственный		= Оплата.Ответственный;	
	ЭтоПоступлениеНаРасчетныйСчет = 2;
	ПлатежныйДокумент.ВидОплаты   = Справочники.ВидыОплатОрганизаций.НайтиПоНаименованию("МЛК");
	
	Если НЕ РабитьПоЛС Тогда
		Контрагент = ПолучитьКонтрагентаЛицевогоСчета(Оплата.Дата, Строка.ЛицевойСчет);
	Иначе
		Контрагент = Строка.СубконтоКУ1;
	КонецЕсли;
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.бит_КассыККМ") Тогда
		
		Контрагент = Контрагент.Контрагент;
		
		
	ИначеЕсли ТипЗнч(Контрагент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		
	Иначе
		
	КонецЕсли;
	
	ЭтоПоступлениеНаРасчетныйСчет = 2;
	
	
	СтрокаСписокЛС = "";
	ТаблицаЛС = Оплата.СписокЛС.Выгрузить(,"ЛицевойСчет");
	ТаблицаЛС.Свернуть("ЛицевойСчет");
	
	Для Каждого СтрокаЛС из ТаблицаЛС Цикл
		СтрокаСписокЛС = СтрокаСписокЛС + СтрокаЛС.ЛицевойСчет + ";";
	КонецЦикла;
	Если  ЭтоПоступлениеНаРасчетныйСчет = 0 Тогда
		ПлатежныйДокумент.Основание = "Оплата по лицевым счетам " + СтрокаСписокЛС;
	КонецЕсли; 
	
	ПлатежныйДокумент.Комментарий		= СтрокаСписокЛС + "Введен на основании " + Оплата;
	
	//Если  ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
	//	ПлатежныйДокумент.НазначениеПлатежа = СтрокаСписокЛС + "Введен на основании " + Оплата;
	//КонецЕсли;
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		//ПлатежныйДокумент.Контрагент = Контрагент;
	Иначе	
		ПлатежныйДокумент.СубконтоКт1 = Контрагент;
	КонецЕсли;	
	
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 И ТипЗнч(ПлатежныйДокумент.СубконтоКт1) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ПлатежныйДокумент.СубконтоКт1) Тогда
		
		ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		МассивВидовДоговоров = Новый Массив;
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,ПлатежныйДокумент.СубконтоКт1,ПлатежныйДокумент.Организация,МассивВидовДоговоров);
		ПлатежныйДокумент.СубконтоКт2 = ОсновнойДоговорКонтрагента;
		
	КонецЕсли; 
	
	СтрокаПлатеж = ПлатежныйДокумент.РасшифровкаПлатежа.Добавить();
	
	СтруктураКурсаВзаиморасчетов  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Оплата.Дата);
	
	ПроверкаКурсовВалют(СтрокаПлатеж,СтруктураКурсаВзаиморасчетов.Курс,СтруктураКурсаВзаиморасчетов.Кратность);
	
	СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	СтрокаПлатеж.СуммаПлатежа        = Строка.Сумма;
	СтрокаПлатеж.СуммаВзаиморасчетов = Строка.Сумма;
	
	ПлатежныйДокумент.Контрагент = Контрагент;
	
	СтрокаПлатеж.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
	
	Если ТипЗнч(ПлатежныйДокумент.Контрагент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ПлатежныйДокумент.Контрагент)  Тогда
		
		ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		МассивВидовДоговоров = Новый Массив;
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,ПлатежныйДокумент.Организация,МассивВидовДоговоров);
		СтрокаПлатеж.ДоговорКонтрагента			= ОсновнойДоговорКонтрагента;
		ПлатежныйДокумент.ДоговорКонтрагента	= ОсновнойДоговорКонтрагента;
		
		
	КонецЕсли; 
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
	
	ПлатежныйДокумент.Организация, ПлатежныйДокумент.Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
	
	СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
	СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
	
	ПлатежныйДокумент.СуммаДокумента = СтрокаПлатеж.СуммаПлатежа;
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 1 Тогда
		
		ПлатежныйДокумент.СчетБанк = Объект.СчетКасса;
		
		Если НЕ (Объект.СчетКасса.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента=Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
		
		ПлатежныйДокумент.СчетОрганизации = ?(ЗначениеЗаполнено(БанковскийСчет), БанковскийСчет
		,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.Организация, "ОсновнойБанковскийСчет"));
	ИначеЕсли  ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда
		
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПлатежныйДокумент.ВидОплаты, "Контрагент, ДоговорКонтрагента, СчетУчетаРасчетов");
		
		ПлатежныйДокумент.СчетКасса			= СтруктураРеквизитов.СчетУчетаРасчетов;
		ПлатежныйДокумент.Эквайер			= СтруктураРеквизитов.Контрагент;
		ПлатежныйДокумент.ДоговорЭквайринга = СтруктураРеквизитов.ДоговорКонтрагента;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитов.СчетУчетаРасчетов)
			И НЕ (СтруктураРеквизитов.СчетУчетаРасчетов.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
	Иначе	
		
		ПлатежныйДокумент.СчетКасса = Объект.СчетКасса;
		
		Если НЕ (Объект.СчетКасса.Валютный) Тогда
			
			ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЭтоПоступлениеНаРасчетныйСчет = 2 Тогда 
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств		= Объект.СтатьяДвиженияДенежныхСредств;
		ПлатежныйДокумент.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДвиженияДенежныхСредств;
	КонецЕсли;
	
	СтрокаПлатеж.СтавкаНДС = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаПлатеж.СтавкаНДС);
	
	СтрокаПлатеж.СуммаНДС = СтрокаПлатеж.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
	
	Если ПрименениеУСН Тогда
		
		ПлатежныйДокумент.Графа4_УСН          = ПлатежныйДокумент.СуммаДокумента;
		ПлатежныйДокумент.Графа5_УСН          = СуммаПринимаемых;
		
		ПлатежныйДокумент.Содержание_УСН      = "" + ПлатежныйДокумент.ВидОперации + "."
		
	КонецЕсли;
	
	Если ЭтоПоступлениеНаРасчетныйСчет = 0
		И ЗначениеЗаполнено(ИсточникОплаты) Тогда
		Если ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.Контрагенты") 
			ИЛИ ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			
			НаименованиеИсточникаОплаты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникОплаты,"Наименование, НаименованиеПолное");
			ПлатежныйДокумент.ПринятоОт	= ?(ПустаяСтрока(НаименованиеИсточникаОплаты.НаименованиеПолное),
			НаименованиеИсточникаОплаты.Наименование, НаименованиеИсточникаОплаты.НаименованиеПолное);
		Иначе    
			ПлатежныйДокумент.ПринятоОт	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникОплаты,"Наименование"); 
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		
		ПлатежныйДокумент.Записать();
		
		ДокументЗаписан = Истина;
		МенеджерЗаписи = РегистрыСведений.МЛК_РеестрОплат.СоздатьНаборЗаписей();
		МенеджерЗаписи.Отбор.ИД_События.Установить(ИД_События);
		МенеджерЗаписи.Прочитать();
		
		Для каждого СтрНабор Из  МенеджерЗаписи Цикл
			// Изменить существующую запись
			СтрНабор.ОперацияПоПлатежнойКарте = ПлатежныйДокумент.Ссылка;
		КонецЦикла;
		
		МенеджерЗаписи.Записать();			
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ 'Оплата платежной картой' не записан по причине: " + ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СинхронизироватьПлатежки(Настройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	МЛК_РеестрОплат.Пакет КАК Пакет,
	|	СУММА(МЛК_РеестрОплат.Сумма) КАК Сумма,
	|	СУММА(МЛК_РеестрОплат.Сумма - МЛК_РеестрОплат.Сумма * &Процент) КАК БезКомиссии
	|ИЗ
	|	РегистрСведений.МЛК_РеестрОплат КАК МЛК_РеестрОплат
	|ГДЕ
	|	МЛК_РеестрОплат.Платежка = &Платежка
	|	И МЛК_РеестрОплат.Пакет <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	МЛК_РеестрОплат.Пакет";
	
	Запрос.УстановитьПараметр("Платежка",Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка());
	
	ВидОплаты   = Настройки.ВидОплатыОрганизации;
	
	Запрос.УстановитьПараметр("Процент",ВидОплаты.ПроцентБанковскойКомиссии/100);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗапросПлатежки = Новый Запрос;
		ЗапросПлатежки.Текст = "ВЫБРАТЬ
		|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
		|	ПоступлениеНаРасчетныйСчет.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|ГДЕ
		|	ПоступлениеНаРасчетныйСчет.ПометкаУдаления = ЛОЖЬ
		|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент 
		|	И ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &Комментарий";
		Контрагент = Настройки.ПлатежныйАгент;
		ЗапросПлатежки.УстановитьПараметр("Комментарий","%"+Выборка.Пакет+"%");
		ЗапросПлатежки.УстановитьПараметр("Контрагент",Контрагент);
		// ЗапросПлатежки.УстановитьПараметр("СуммаДокумента",Выборка.БезКомиссии);
		
		
		РезультатЗапроса = ЗапросПлатежки.Выполнить();
		ВыборкаПлатежек = РезультатЗапроса.Выбрать();
		Если ВыборкаПлатежек.Следующий() Тогда
			МенеджерЗаписи = РегистрыСведений.МЛК_РеестрОплат.СоздатьНаборЗаписей();
			МенеджерЗаписи.Отбор.пакет.Установить(Выборка.Пакет);
			МенеджерЗаписи.Прочитать();
			
			Для каждого СтрНабор Из  МенеджерЗаписи Цикл
				// Изменить существующую запись
				СтрНабор.Платежка = ВыборкаПлатежек.Ссылка;
			КонецЦикла;
			
			МенеджерЗаписи.Записать();			
			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	
#КонецОбласти

Функция ЭтоКопияБазы()
	
	Результат = Ложь;
	
	ИнформацияОБазе = Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить();
	Если ИнформацияОБазе <> Неопределено тогда
		Результат =  ИнформацияОБазе.РаботаСВнешнимиРесурсамиЗаблокирована;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции


Процедура ВыполнитьСинхронизациюСMobsted() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

