#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем ПроверятьРежимПотребления Экспорт; // Хранит флаг проверять режим потребления.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Проверяет уникальность Приоритета
Процедура ПроверитьУникальностьПриоритета(Отказ)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_УслугиЖКХ.Ссылка
	|ИЗ
	|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|ГДЕ
	|	бит_УслугиЖКХ.Приоритет = &Приоритет
	|	И бит_УслугиЖКХ.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Приоритет" ,Приоритет);
	Запрос.УстановитьПараметр("Ссылка"             ,Ссылка);
	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный ""Приоритет"" уже существует.",Отказ,,СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" объекта справочника 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку
		Возврат;
	КонецЕсли;	
	
	// Выполним проверку заполненности обязательных реквизитов для элемента справочника.
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		// БИТ_ЖКХ 02.03.2015{{
		// Сообщить("Не заполнено наименование!", СтатусСообщения.Важное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнено наименование!";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 02.03.2015}}
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Укажем, что надо проверить:
	СтруктураРеквизитов = Новый Структура("НаименованиеПолное,ТипУслуги,ОсновнойСпособРасчета");
	Если ПроверятьРежимПотребления Тогда
		
		СтруктураРеквизитов.Вставить("ОсновнойРежимПотребления");
		
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""Услуги ЖКХ"".");
	
	// Укажем, что надо проверить из реквизитов табличной части:
	СтруктураОбязательныхПолей = Новый Структура("Поставщик");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Поставщики", СтруктураОбязательныхПолей, Отказ, "");
	
	// Укажем, что надо проверить из реквизитов табличной части:
	СтруктураОбязательныхПолей = Новый Структура("СпособРасчета");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СпособыРасчета", СтруктураОбязательныхПолей, Отказ, "");
	
	// Укажем, что надо проверить из реквизитов табличной части:
	СтруктураОбязательныхПолей = Новый Структура("РежимПотребленияУслуг");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "РежимыПотребленияУслуг", СтруктураОбязательныхПолей, Отказ, "");
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Поставщик");
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "Поставщики", СтруктураОбязательныхПолей, Отказ);
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("СпособРасчета");
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "СпособыРасчета", СтруктураОбязательныхПолей, Отказ);
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("РежимПотребленияУслуг");
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "РежимыПотребленияУслуг", СтруктураОбязательныхПолей, Отказ);
	
	Если Не Отказ Тогда 
		ПроверитьУникальностьПриоритета(Отказ);
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 07.06.2016 16:45:51 Начало правки... 
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	// Актуализация услуг шаблонов учета капитального ремонта.
	Если ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда
		
		СсылкаШаблон = Справочники.бит_ШаблоныИзвещений.КапитальныйРемонт; 
		Шаблон = СсылкаШаблон.ПолучитьОбъект();
		Шаблон.Услуги.Свернуть("Услуга,ПроцедураПечати,ФормаПечати");
		Если Шаблон.Услуги.Найти(Ссылка,"Услуга") = Неопределено Тогда
			
			Попытка
				Стр		   = Шаблон.Услуги.Добавить();
				Стр.Услуга = Ссылка;
				Шаблон.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		СсылкаШаблон = Справочники.бит_ШаблоныИзвещений.БезКапитальногоРемонта;
		Шаблон = СсылкаШаблон.ПолучитьОбъект();
		Шаблон.Услуги.Свернуть("Услуга,ПроцедураПечати,ФормаПечати");
		НайденнаяСтрока = Шаблон.Услуги.Найти(Ссылка,"Услуга");
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			
			Попытка
				Шаблон.Услуги.Удалить(НайденнаяСтрока);
				Шаблон.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		
	Иначе
		
		СсылкаШаблон = Справочники.бит_ШаблоныИзвещений.КапитальныйРемонт; 
		Шаблон = СсылкаШаблон.ПолучитьОбъект();
		Шаблон.Услуги.Свернуть("Услуга,ПроцедураПечати,ФормаПечати");
		НайденнаяСтрока = Шаблон.Услуги.Найти(Ссылка,"Услуга");
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			
			Попытка
				Шаблон.Услуги.Удалить(НайденнаяСтрока);
				Шаблон.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		СсылкаШаблон = Справочники.бит_ШаблоныИзвещений.БезКапитальногоРемонта;
		Шаблон = СсылкаШаблон.ПолучитьОбъект();
		Шаблон.Услуги.Свернуть("Услуга,ПроцедураПечати,ФормаПечати");
		Если Шаблон.Услуги.Найти(Ссылка,"Услуга") = Неопределено Тогда
			
			Попытка
				Стр		   = Шаблон.Услуги.Добавить();
				Стр.Услуга = Ссылка;
				Шаблон.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 07.06.2016 16:45:53 Конец правки. 

#КонецОбласти

#Область ОператорыОсновнойПрограммы

ПроверятьРежимПотребления = Истина;

#КонецОбласти

#КонецЕсли