
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОткрытьИзДокументаРегистрацияПроживающихПоЛС") Тогда
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВидПричины");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Параметры.ОткрытьИзДокументаРегистрацияПроживающихПоЛС.ВидПричины;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

		Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;

	КонецЕсли;
	
	Если Параметры.Свойство("ТекЭлемент") Тогда
		
		Элементы.Список.ТекущаяСтрока = Параметры.ТекЭлемент;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти