// Устанавливает статус нескольких документов бит_ИсполнительныйЛист
// Параметры:
//  МассивДокументов     - Массив - содержит ссылки на документы 
//
// Возвращаемое значение:
//  Булево - Истина, если статус хотя бы одного документа изменен
//
Функция УстановитьСтатусыДокументов(МассивДокументов, НовыйСтатус) Экспорт
	
	СтатусИзменен = Ложь;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат СтатусИзменен;
	КонецЕсли;
	
	ИзменитьСтатус = (НовыйСтатус <> Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК ИсполнительныйЛист,
	|	ЕСТЬNULL(СтатусыПоИсполнительнымЛистамСрезПоследних.СтатусДокумента, &СтатусПоУмолчанию) КАК СтатусДокумента
	|ИЗ
	|	Документ.бит_ИсполнительныйЛист КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоИсполнительнымЛистам.СрезПоследних(, ) КАК СтатусыПоИсполнительнымЛистамСрезПоследних
	|		ПО (СтатусыПоИсполнительнымЛистамСрезПоследних.ИсполнительныйЛист = ТаблицаДокументов.Ссылка)
	|ГДЕ
	|	ТаблицаДокументов.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("СтатусПоУмолчанию", Перечисления.СтатусыПоИсполнительнымЛистам.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если (Не ИзменитьСтатус Или Выборка.СтатусДокумента = НовыйСтатус) Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = РегистрыСведений.СтатусыПоИсполнительнымЛистам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИсполнительныйЛист.Установить(Выборка.ИсполнительныйЛист);
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Если ИзменитьСтатус Тогда
			Запись.СтатусДокумента = НовыйСтатус;
			Запись.Период = ТекущаяДата();
		КонецЕсли;
		
		НаборЗаписей.Записать(Ложь);
		
		УстановитьПривилегированныйРежим(Ложь);
		
		СтатусИзменен = Истина;
		
	КонецЦикла;
	
	Возврат СтатусИзменен;
	
КонецФункции

