
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипКомнатыПриИзменении(Элемент)
	КоэффициентНачисленийЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура ПринадлежностьПриИзменении(Элемент)
	КоэффициентНачисленийЗаполнить();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура КоэффициентНачисленийЗаполнить()
	
	Если ЗначениеЗаполнено(Объект.ТипКомнаты) И Объект.ТипКомнаты = ПредопределенноеЗначение("Справочник.бит_ТипыКомнат.Жилая")
		И ЗначениеЗаполнено(Объект.Принадлежность) И Объект.Принадлежность = ПредопределенноеЗначение("Перечисление.бит_ПринадлежностьКомнат.Внутренняя") Тогда
		
		Объект.КоэффициентНачислений = 1;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти