
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаборЗаписей.Очистить();
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	бит_СвидетельстваОСмерти.ФизЛицо,
	    |	бит_СвидетельстваОСмерти.ДатаВыдачи,
	    |	бит_СвидетельстваОСмерти.ДатаСмерти,
	    |	бит_СвидетельстваОСмерти.ДатаСоставления,
	    |	бит_СвидетельстваОСмерти.КемВыдано,
	    |	бит_СвидетельстваОСмерти.Номер,
	    |	бит_СвидетельстваОСмерти.НомерСвидетельства,
	    |	бит_СвидетельстваОСмерти.СерияСвидетельства
	    |ИЗ
	    |	РегистрСведений.бит_СвидетельстваОСмерти КАК бит_СвидетельстваОСмерти
	    |ГДЕ
	    |	бит_СвидетельстваОСмерти.ФизЛицо = &ФизЛицо");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.Ключ.ФизЛицо);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;

	КонецЕсли;

	Если НаборЗаписей.Количество() = 0 Тогда
		
		НаборЗаписей.Добавить();
		
		ЗаписьИзНабора = НаборЗаписей[0];
		
		Если Параметры.Свойство("ЗаполнитьИзСправочникаПроживающие") Тогда
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("ФизЛицо") Тогда
				
				ЗаписьИзНабора.ФизЛицо = Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо;
				
			КонецЕсли;
		
		КонецЕсли;

	КонецЕсли;
	
	ЗаписьИзНабора     = НаборЗаписей[0];
	
	ДатаВыдачи         = ЗаписьИзНабора.ДатаВыдачи;
	ДатаСмерти         = ЗаписьИзНабора.ДатаСмерти;
	Номер              = ЗаписьИзНабора.Номер;
	ДатаСоставления    = ЗаписьИзНабора.ДатаСоставления;
	КемВыдано          = ЗаписьИзНабора.КемВыдано;
	ФизЛицо            = ЗаписьИзНабора.ФизЛицо;
	НомерСвидетельства = ЗаписьИзНабора.НомерСвидетельства;
	СерияСвидетельства = ЗаписьИзНабора.СерияСвидетельства;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы И Модифицированность Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ОтветНаВопрос = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ОтветНаВопрос = РезультатВопроса;
    
    Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
        
        ЗаписатьИзменения();
        
        ЭтаФорма.Закрыть();
        
    ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
        
        // Отказ = Истина;.
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КемВыданоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.бит_ОрганыФМС.Форма.ФормаВыбора", , Элемент);

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ПодтвердитьИзменения(Команда)
	
	ЗаписатьИзменения();
	Закрыть();
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "СвидетельствоОСмерти"), ФизЛицо);

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзменения()
	
	// БИТ ЖКХ 10.08.2020
	Набор = РегистрыСведений.бит_СвидетельстваОСмерти.СоздатьНаборЗаписей();
	Набор.Отбор.ФизЛицо.Установить(ФизЛицо);
	Набор.Прочитать();
	
	если Набор.Количество() = 0 тогда
		ЗаписьИзНабора = Набор.Добавить();
		
		ЗаписьИзНабора.ФизЛицо = ФизЛицо;
		ЗаписьИзНабора.Период = ТекущаяДата();
		ЗаписьИзНабора.ДатаВыдачи         = ДатаВыдачи;
		ЗаписьИзНабора.ДатаСмерти         = ДатаСмерти;
		ЗаписьИзНабора.ДатаСоставления    = ДатаСоставления;
		ЗаписьИзНабора.Номер              = Номер;
		ЗаписьИзНабора.КемВыдано          = КемВыдано;
		ЗаписьИзНабора.НомерСвидетельства = НомерСвидетельства;
		ЗаписьИзНабора.СерияСвидетельства = СерияСвидетельства;
		Набор.Записать();
		
		ЗначениеВДанныеФормы(Набор, НаборЗаписей);
	иначе
		ЗаписьИзНабора = Набор[0];

		ЗаписьИзНабора.ФизЛицо = ФизЛицо;
		ЗаписьИзНабора.Период = ТекущаяДата();
		ЗаписьИзНабора.ДатаВыдачи         = ДатаВыдачи;
		ЗаписьИзНабора.ДатаСмерти         = ДатаСмерти;
		ЗаписьИзНабора.ДатаСоставления    = ДатаСоставления;
		ЗаписьИзНабора.Номер              = Номер;
		ЗаписьИзНабора.КемВыдано          = КемВыдано;
		ЗаписьИзНабора.НомерСвидетельства = НомерСвидетельства;
		ЗаписьИзНабора.СерияСвидетельства = СерияСвидетельства;
		Набор.Записать();
		
		ЗначениеВДанныеФормы(Набор, НаборЗаписей);
	конецесли;	     
	
	//ЗаписьИзНабораНабор = ДанныеФормыВЗначение(НаборЗаписей,Тип("РегистрСведенийНаборЗаписей.бит_СвидетельстваОСмерти"));
	//			
	//ЗаписьИзНабора = ЗаписьИзНабораНабор[0];
	
		    
	//	ЗаписьИзНабора = Набор[0];
	//	// Если что-то поменяли тогда запишем 
	//	Если ДатаВыдачиПриОткрытии <> ДатаВыдачи ИЛИ
	//		ДатаСмертиПриОткрытии <> ДатаСмерти ИЛИ
	//		ДатаСоставленияПриОткрытии <> ДатаСоставления ИЛИ
	//		НомерПриОткрытии <> Номер ИЛИ
	//		КемВыданоПриОткрытии <> КемВыдано ИЛИ
	//		НомерСвидетельстваПриОткрытии <> НомерСвидетельства ИЛИ
	//		СерияСвидетельстваПриОткрытии <> СерияСвидетельства  Тогда
	//	
	//		ЗаписьИзНабора.ДатаВыдачи         = ДатаВыдачи;
	//		ЗаписьИзНабора.ДатаСмерти         = ДатаСмерти;
	//		ЗаписьИзНабора.ДатаСоставления    = ДатаСоставления;
	//		ЗаписьИзНабора.Номер              = Номер;
	//		ЗаписьИзНабора.КемВыдано          = КемВыдано;
	//		ЗаписьИзНабора.НомерСвидетельства = НомерСвидетельства;
	//		ЗаписьИзНабора.СерияСвидетельства = СерияСвидетельства;
	//		
	//		Попытка
	//		
	//		    ЗаписьИзНабораНабор.Записать(); 			
	//			
	//		Исключение
	//			
	//			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
	//			
	//		КонецПопытки;
	//		
	//		ЗначениеВДанныеФормы(ЗаписьИзНабораНабор, НаборЗаписей);
	//		
	//	КонецЕсли;
	// конецесли;
КонецПроцедуры

#КонецОбласти