#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбщегоНазначения

// Проверяет уникальность Приоритета.
//
Процедура ПроверитьУникальностьПриоритета(Отказ)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_БиллинговыеУслуги.Ссылка
	|ИЗ
	|	Справочник.бит_бу_БиллинговыеУслуги КАК бит_бу_БиллинговыеУслуги
	|ГДЕ
	|	бит_бу_БиллинговыеУслуги.Приоритет = &Приоритет
	|	И бит_бу_БиллинговыеУслуги.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Приоритет" ,Приоритет);
	Запрос.УстановитьПараметр("Ссылка"    ,Ссылка);
	
	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный ""Приоритет"" уже существует.",Отказ,,СтатусСообщения.Важное);
	// БИТ_ЖКХ 14.11.2013 		
	Иначе Отказ =Ложь;	
	// БИТ_ЖКХ 14.11.2013 Конец		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() и Не ПометкаУдаления = Ссылка.ПометкаУдаления тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Поставщик");
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "Поставщики", СтруктураОбязательныхПолей, Отказ);
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("РежимПотребленияУслуг");
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "РежимыПотребленияУслуг", СтруктураОбязательныхПолей, Отказ);
	
	Если Не Отказ Тогда 
		ПроверитьУникальностьПриоритета(Отказ);
	// БИТ_ЖКХ 14.11.2013 добавлен код, убирающий ошибку одинакового приоритета.
Пока Отказ = Истина Цикл
	
	ЭтотОбъект.Приоритет = ЭтотОбъект.Приоритет +1;
	ПроверитьУникальностьПриоритета(Отказ);
КонецЦикла;		
	// БИТ_ЖКХ 14.11.2013 Конец		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#КонецЕсли