	  
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область ПроцедурыИФункцииУправленияВнешнимВидомФорм

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Текст = Элементы.Декорация1.Заголовок + ": "+ Формат(ТекущаяДата(), "ДЛФ=DD");
	Элементы.Декорация1.Заголовок = Текст;	
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзМодуляОбычногоПриложения") Тогда
		
		Результат = Параметры.ЗаполнитьИзМодуляОбычногоПриложения.Результат;
		
		Объект.Счетчики.Загрузить(Результат);
		
	КонецЕсли;
	
	Объект.ДатаПоказанийПодкрутки = КонецДня(КонецМесяца(ТекущаяДата())) - 30;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	УправлениеЭлементамиФормы();
	
	// БИТ ЖКХ 09.04.2021
	ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = ложь;
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ВыполнитьПроверкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьСчетчик(Команда)
	
	Если Объект.Счетчики.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ТекСтрока = Элементы.Счетчики.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика"));
		
		// БИТ_ЖКХ 04.06.2014
		ТекСтрокаСчетчикТипСчетчика = ТипСчетчикаНаСервере(ТекСтрока.Счетчик);
		
		Если ТекСтрокаСчетчикТипСчетчика = ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Групповой") Тогда
			// БИТ_ЖКХ 04.06.2014
			
			ПараметрыФормы.Вставить("Объект");
		Иначе
			ПараметрыФормы.Вставить("Объект"     , ТекСтрока.ВладелецСчетчика);
		КонецЕсли; 
		
		ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
		ПараметрыФормы.Вставить("Счетчик"    , ТекСтрока.Счетчик);
		
		ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	Иначе

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите строку содержащую счетчик для снятия.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуПоверки(Команда)
	
	Если Объект.Счетчики.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииИзменениеДатыПоверки.УстановкаДатыПоверки"));
	ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьДатуПоверкиЗавершение", ЭтотОбъект, Новый Структура("ПараметрыФормы", ПараметрыФормы)), "Заполнить документ на основании таблицы ""Счетчики""?", РежимДиалогаВопрос.ДаНетОтмена); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуПоверкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		МассивСчетчиков = ПолучитьМассивСчетчиковНаСервере();
		
		ПараметрыФормы.Вставить("МассивСчетчиков", МассивСчетчиков);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		ПараметрыФормы.Вставить("МассивСчетчиков", Неопределено);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьДатуПоверки(Команда)
	
	Если Объект.Счетчики.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииИзменениеДатыПоверки.СнятьДатуПоверки"));
	ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СнятьДатуПоверкиЗавершение", ЭтотОбъект, Новый Структура("ПараметрыФормы", ПараметрыФормы)), "Заполнить документ на основании таблицы ""Счетчики""?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьДатуПоверкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		МассивСчетчиков = ПолучитьМассивСчетчиковНаСервере();
		
		ПараметрыФормы.Вставить("МассивСчетчиков", МассивСчетчиков);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		ПараметрыФормы.Вставить("МассивСчетчиков", Неопределено);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ПроверкаДатыПоверки"));
	ОбработкаОбъект.ВыполнитьПроверку();
	
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	
	// БИТ ЖКХ 09.04.2021
	если Объект.Счетчики.Количество() > 0 тогда
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = истина;	
	иначе
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = ложь;	
	конецесли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСчетчиковНаСервере()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Счетчик");
	ТаблицаЗначений.Колонки.Добавить("ДатаПоверки");
	ТаблицаЗначений.Колонки.Добавить("ВладелецСчетчика");
	ТаблицаЗначений.Колонки.Добавить("Улица");
	ТаблицаЗначений.Колонки.Добавить("Здание");
	ТаблицаЗначений.Колонки.Добавить("Квартира");
	ТаблицаЗначений.Колонки.Добавить("НоваяДатаПоверки");
	
	Для каждого Строка Из Объект.Счетчики Цикл
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.НоваяДатаПоверки = Строка.ДатаПоверки;
		
	КонецЦикла;
	
	МассивСчетчиков = бит_ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
	
	Возврат МассивСчетчиков;
	
КонецФункции

// БИТ_ЖКХ 04.06.2014
&НаСервере
Функция ТипСчетчикаНаСервере(Счетчик)
	
	Возврат Счетчик.ТипСчетчика;	
	
КонецФункции	

// БИТ_ЖКХ 13.04.2021
&НаКлиенте
Процедура ВводПоказанийПодкрутки(Команда)
	ВводПоказанийПодкруткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВводПоказанийПодкруткиНаСервере()
	
	    ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
		
		ДокументВводПоказаний.Дата        = Объект.ДатаПоказанийПодкрутки;
		ДокументВводПоказаний.Организация = Объект.Счетчики[0].ВладелецСчетчика.Организация;
		ДокументВводПоказаний.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки;
		ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
		ДокументВводПоказаний.Комментарий = "Документ создан автоматически при поверке счетчиков " + Формат(ДокументВводПоказаний.Дата, "ДФ='ММММ гггг'");
		ДокументВводПоказаний.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		
		СписокСчетчиков = Объект.Счетчики.Выгрузить().ВыгрузитьКолонку("Счетчик");
		ДокументВводПоказаний.ЗаполнитьТаблицуПоказанийПоСпискуСчетчиков(СписокСчетчиков);		
		// БИТ_ЖКХ 25.07.2014
		// Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 1 Тогда.
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 0 Тогда
			// БИТ_ЖКХ 25.07.2014
			
			Попытка
				
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СчетчикиПриИзменении(Элемент)
	
	// БИТ ЖКХ 09.04.2021
	если Объект.Счетчики.Количество() > 0 тогда
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = истина;	
	иначе
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = ложь;	
	конецесли;

КонецПроцедуры
// БИТ_ЖКХ 04.06.2014

#КонецОбласти