
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	         
	Если Параметры.Свойство("НаДату") Тогда
		НаДату = Параметры.НаДату;
	КонецЕсли;
	
	ОбновитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СоздатьАдрес();	  
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЧастьПомещенияПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НомерКомнатыПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
    СоздатьАдрес();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНовый(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьНовыйЗавершение1", ЭтотОбъект), "Элемент еще не записан. Записать?", РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	СоздатьНовыйФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Попытка	
            ЗаписатьЭлемент();
        Исключение

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("" + ОписаниеОшибки());
			
            Возврат;
        КонецПопытки;	
    Иначе
        Возврат;                                            
    КонецЕсли;
    
    СоздатьНовыйФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйФрагмент()
    
    Перем ПараметрыФормы;
    
    Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Возврат;
    КонецЕсли; 
    
    Если ЗначениеЗаполнено(НаДату) Тогда
        ПараметрыФормы = Новый Структура("Основание", Новый Структура("Комната, Период", Объект.Ссылка, НаДату));
    Иначе	
        ПараметрыФормы = Новый Структура("Основание", Новый Структура("Комната, Период", Объект.Ссылка, ТекущаяДата()));
    КонецЕсли; 
    
    ОткрытьФорму("РегистрСведений.бит_СведенияОКомнате.Форма.ФормаЗаписиУправляемая", ПараметрыФормы,,,,, Новый ОписаниеОповещения("СоздатьНовыйЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ОбновитьОтбор();

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьЭлемент()

	Записать();

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтбор()

	Отбор = ДинСписок.Отбор.Элементы;
	
	Отбор.Очистить();
	
	УсловиеОтбора = Отбор.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Комната");
	УсловиеОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	УсловиеОтбора.ПравоеЗначение = Объект.Ссылка;

	Если ЗначениеЗаполнено(НаДату) Тогда
		
		УсловиеОтбора = Отбор.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Период");
		УсловиеОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		УсловиеОтбора.ПравоеЗначение = НаДату;
		
	КонецЕсли;
	
КонецПроцедуры //бит() 

&НаКлиенте
Процедура СоздатьНаименование()
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		Если Объект.НомерКомнаты <> 0 И ЗначениеЗаполнено(Объект.ЧастьПомещения) Тогда
			
			Объект.Наименование = Строка(Объект.НомерКомнаты) + " " + Строка(Объект.ЧастьПомещения);
			
		Иначе
			
			Объект.Наименование = Строка(Объект.ЧастьПомещения);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьАдрес()

	Район = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец.Район),"р-н "+Строка(Объект.Владелец.Владелец.Район),"");
	Улица = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец.Улица)," ул. "+Строка(Объект.Владелец.Владелец.Улица),"");
	Корпус = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец.Корпус)," корп. "+Строка(Объект.Владелец.Владелец.Корпус),"");
	Дом = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец)," д. "+Строка(Объект.Владелец.Владелец),"");
	Адрес = Район + ?(ЗначениеЗаполнено(Улица),","+Улица,"")+ ?(ЗначениеЗаполнено(Корпус),","+Корпус,"") + ?(ЗначениеЗаполнено(Дом),","+Дом,"");

	Если ЗначениеЗаполнено(Адрес) Тогда
		АдресКвартиры = Строка(Адрес) + ", кв. " + Строка(Объект.Владелец);
	Иначе
		АдресКвартиры = "Нет адреса здания!";
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти