     
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , "");
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
																,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьЗаголовокФормыДокумента();
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_УслугиЖКХ") Тогда
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("Услуга", ВыбранноеЗначение);
			
			СтрокаТабличнойЧасти = Объект.СписокУслуг.НайтиСтроки(Отбор);
			
			Если СтрокаТабличнойЧасти.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.СписокУслуг.Добавить();
				
				НоваяСтрока.Услуга = ВыбранноеЗначение;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Подбор(Команда) 
		
	ПараметрыФормы = Новый Структура;
		
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого Строка Из Объект.СписокУслуг Цикл
	
		Строка.ИспользоватьНормуНаОдного = Ложь;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого Строка Из Объект.СписокУслуг Цикл
		
		Если Строка.Распространение = ПредопределенноеЗначение("Перечисление.бит_РаспространениеЛьготы.ПоФакту") Тогда
			
			Строка.ИспользоватьНормуНаОдного = Ложь;
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("При распределению ""По факту"" не используется норма на одного.");
			
		Иначе
			
			Строка.ИспользоватьНормуНаОдного = Истина;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	мКэшЗначений.Дата = Объект.Дата;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура СписокУслугИспользоватьНормуНаОдногоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СписокУслуг.ТекущиеДанные;
	
	Если ТекущаяСтрока.Распространение = ПредопределенноеЗначение("Перечисление.бит_РаспространениеЛьготы.ПоФакту")
		И ТекущаяСтрока.ИспользоватьНормуНаОдного Тогда
		
		ТекущаяСтрока.ИспользоватьНормуНаОдного = Ложь;
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("При распределению ""По факту"" не используется норма на одного.");
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
		
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Дата"                , Объект.Дата);
	КэшированныеЗначения.Вставить("мПоставщик"          , Справочники.бит_ПоставщикиУслуг.ПустаяСсылка());
    КэшированныеЗначения.Вставить("мРежимПотребления"   , Справочники.бит_РежимыПотребленияУслуг.ПустаяСсылка());
    КэшированныеЗначения.Вставить("мСпособРасчета"      , Перечисления.бит_СпособыРасчетаПоУслугам.ПустаяСсылка());

КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

#КонецОбласти