#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("Структура")) И (ДанныеЗаполнения.Свойство("Основание")) И
		ТипЗнч(ДанныеЗаполнения.Основание) = Тип("СправочникСсылка.бит_ЭлектронноеПисьмоИсходящее")Тогда
		
		бит_УправлениеЭлектроннойПочтойСервер.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект, Неопределено);
		ЗаполнитьНаОснованииПисьма(ДанныеЗаполнения.Основание, ДанныеЗаполнения.Команда);
		
	Иначе
		бит_УправлениеЭлектроннойПочтойСервер.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
		
	Важность     = Перечисления.бит_ВариантыВажностиЭлектронногоПисьма.Обычная;
	СтатусПисьма = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Черновик;
	
	Если ПустаяСтрока(Кодировка) Тогда
		Кодировка = "utf-8";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
	
		УчетнаяЗапись = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
	
	КонецЕсли;
	
	ОтправительПредставление = ПолучитьПредставлениеДляУчетнойЗаписи(УчетнаяЗапись);
	
КонецПроцедуры

Функция ПолучитьПредставлениеДляУчетнойЗаписи(УчетнаяЗапись) Экспорт

	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка = &УчетнаяЗапись";
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Представление = Выборка.ИмяПользователя;
	Если ПустаяСтрока(Представление) Тогда
		Возврат Выборка.АдресЭлектроннойПочты;
	Иначе
		Возврат Представление + " <" + Выборка.АдресЭлектроннойПочты + ">";
	КонецЕсли;

КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = "Письмо: " + СтатусПисьма + ?(ЗначениеЗаполнено(ДатаОтправления),", от " + Формат(ДатаОтправления,"ДФ='дд.ММ.гггг Ч:мм'"), "");
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	// БИТ_ЖКХ 2015.08.24 Начало правки...
	//ЭтотОбъект.ДополнительныеСвойства.Вставить("ПометкаУдаления", ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "ПометкаУдаления"));
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ПометкаУдаления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления"));
	// БИТ_ЖКХ 2014.08.24 Конец правки.
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_УправлениеЭлектроннойПочтойСервер.УстановитьПометкуУдаленияУВложенийПисьма(Ссылка, ПометкаУдаления);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	бит_УправлениеЭлектроннойПочтойСервер.УдалитьВложенияУПисьма(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииПисьма(Основание, ТипОтвета)
	
	ДобавлятьКТеме = "FW: ";
	ПереноситьОтправителя = Ложь;
	ПереноситьВложения = Истина;
	
	ЗаполнитьПараметрыИзПисьма(Основание, ДобавлятьКТеме, ПереноситьВложения,ТипОтвета);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИзПисьма(Письмо, ДобавлятьКТеме, ПереноситьВложения, ТипОтвета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмо.ИдентификаторСообщения,
	|	ЭлектронноеПисьмо.Кодировка,
	|	ЭлектронноеПисьмо.Тема,
	|	ЭлектронноеПисьмо.УчетнаяЗапись,
	|	ЭлектронноеПисьмо.ТипТекста,
	|	ЭлектронноеПисьмо.Ссылка
	|ИЗ
	|	Справочник.бит_ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмо
	|ГДЕ
	|	ЭлектронноеПисьмо.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Письмо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Кодировка                    = Выборка.Кодировка;
	Тема                         = ДобавлятьКТеме + Выборка.Тема;
	УчетнаяЗапись                = Выборка.УчетнаяЗапись;
	ТипТекста                    = Выборка.ТипТекста;
			
	СписокПолучателейПисьма = бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(ПолучателиПисьма, Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли