#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" объекта справочника.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	// Выполним проверку заполненности обязательных реквизитов для элемента справочника.
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнено наименование!");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Укажем, что надо проверить:
	СтруктураРеквизитов = Новый Структура();
		
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""Режимы потребления услуг"".");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли