#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПростыеНастройки() Экспорт
	
	ПростыеНастройки = Новый Массив;
	ПростыеНастройки.Добавить(ОбъемВыпуска);
	ПростыеНастройки.Добавить(ПлановаяСебестоимость);
	ПростыеНастройки.Добавить(ПрямыеЗатраты);
	ПростыеНастройки.Добавить(МатериальныеЗатраты);
	ПростыеНастройки.Добавить(ОплатаТруда);
	ПростыеНастройки.Добавить(Выручка);
	
	Возврат ПростыеНастройки;
	
	
КонецФункции

#КонецОбласти

#КонецЕсли
