
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:58:53 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:58:53 Конец правки.

	МассивЕдиницИзмерений = Новый Массив;
	
	Для каждого СтрМас из Элементы.Список.ВыделенныеСтроки Цикл
		
		МассивЕдиницИзмерений .Добавить(Элементы.Список.ДанныеСтроки(СтрМас).Ссылка);
		
	КонецЦикла;	
	
	АдресЕдиницИзмеренийВХранилище = ПоместитьВоВременноеХранилище(МассивЕдиницИзмерений, УникальныйИдентификатор);
	
	Структура = Новый Структура("АдресЕдиницИзмеренийВХранилище", АдресЕдиницИзмеренийВХранилище);
	
	ОповеститьОВыборе(Структура);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОткрытьИзДокументаУстановкаСоставаРаботы") Тогда
				
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ОткрытьИзДокументаУстановкаСоставаРаботы.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
	КонецЕсли;
	
	Если Параметры.Свойство("ОткрытьИзДокументаУстановкаЦенРабот") Тогда
				
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ОткрытьИзДокументаУстановкаЦенРабот.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ПодборИз_ОКЕИ(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторЕдиницИзмерения.Форма.ФормаВыбораИзКлассификатора", , ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти