#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

Процедура ПроверитьУникальностьПриоритета(Отказ)  Экспорт 
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ГруппыУслуг.Ссылка
	               |ИЗ
	               |	Справочник.бит_ГруппыУслуг КАК бит_ГруппыУслуг
	               |ГДЕ
	               |	бит_ГруппыУслуг.Приоритет = &Приоритет
	               |	И бит_ГруппыУслуг.Ссылка <> &Ссылка";

				   Запрос.УстановитьПараметр("Приоритет" ,Приоритет);
	Запрос.УстановитьПараметр("Ссылка"             ,Ссылка);

	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный ""Приоритет"" уже существует.",Отказ,,СтатусСообщения.Важное);
	// БИТ_ЖКХ 14.11.2013		
	Иначе Отказ =Ложь;
	// БИТ_ЖКХ 14.11.2013 Конец		
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ПроверитьУникальностьПриоритета(Отказ);
	// БИТ_ЖКХ 14.11.2013 добавлен код, убирающий ошибку одинакового приоритета.
	Пока Отказ = Истина Цикл
	
	ЭтотОбъект.Приоритет = ЭтотОбъект.Приоритет +1;
	ПроверитьУникальностьПриоритета(Отказ);
КонецЦикла;
	// БИТ_ЖКХ 14.11.2013 Конец		
КонецПроцедуры

#КонецОбласти

#КонецЕсли