#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрочиеПроцедурыИФункции

//  Процедура изменяет признак "ИспользоватьПриОткрытии" у указнанного варианта.
// При установке признака в "Истина" выполняется проверка в рамках варианта у других настроек.
// Признак сбрасывается в "Ложь".
//
// Параметры:
//  ТекущийВариант  - СправочникСсылка.бит_ВариантОтчета.
//  ИспользоватьПриОткрытии - Булево.
//
Процедура ИзменитьИспользоватьПриОткрытии(ТекущийВариант, ИспользоватьПриОткрытии) Экспорт

	Если ТекущийВариант.ИспользоватьПриОткрытии <> ИспользоватьПриОткрытии Тогда
		
		СпрОб = ТекущийВариант.ПолучитьОбъект();
		СпрОб.ИспользоватьПриОткрытии = ИспользоватьПриОткрытии;
		флДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,, "Ошибки");
		
		Если флДействиеВыполнено И ИспользоватьПриОткрытии Тогда
			
			СброситьИспользоватьПриОткрытии(ТекущийВариант);
			
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры // ИзменитьОткрыватьПоУмолчанию()

//  Процедура сбрасывает признак "ИспользоватьПриОткрытии" у всех вариантов. 
// не равных текущей в пределах варианта.
//
// Параметры:
//  ТекущийВариант  - СправочникСсылка.бит_ВариантОтчета.
//
Процедура СброситьИспользоватьПриОткрытии(ТекущийВариант) Экспорт

	Если Не ТекущийВариант.ИспользоватьПриОткрытии Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийВариант", ТекущийВариант);
	Запрос.УстановитьПараметр("КлючОбъекта", ТекущийВариант.КлючОбъекта);
	Запрос.Текст = " 
	|ВЫБРАТЬ
    |	бит_ВариантыОтчетов.Ссылка
    |ИЗ
    |	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
    |ГДЕ
    |	бит_ВариантыОтчетов.ИспользоватьПриОткрытии
    |	И бит_ВариантыОтчетов.Ссылка <> &ТекущийВариант
    |	И бит_ВариантыОтчетов.КлючОбъекта = &КлючОбъекта
	|";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ИзменитьИспользоватьПриОткрытии(Выборка.Ссылка, Ложь);
	
	КонецЦикла; 

КонецПроцедуры // СброситьИспользоватьПриОткрытии()
   
//  Функция создает и записывает элемент справочника бит_ВариантыОтчетов.
//
// Параметры:
//  СтруктураПараметров  - Структура.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_ВариантыОтчетов.
//
Функция СоздатьВариант(СтруктураПараметров) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СпрОб = Справочники.бит_ВариантыОтчетов.СоздатьЭлемент();
	// Заполним Наименование, КлючОбъекта, Ответственный, ИспользоватьПриОткрытии, ТипВарианта.  
	ЗаполнитьЗначенияСвойств(СпрОб, СтруктураПараметров);
	СпрОб.КлючВарианта       	  = Строка(Новый УникальныйИдентификатор());
	
	флДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,, "Ошибки");
	
	Если флДействиеВыполнено Тогда
	   РезВариант = СпрОб.Ссылка;
	   Если СтруктураПараметров.ИспользоватьПриОткрытии Тогда
	   
	   		Справочники.бит_ВариантыОтчетов.СброситьИспользоватьПриОткрытии(СпрОб.Ссылка);
	   
	   КонецЕсли; 
	Иначе	
	   РезВариант = Справочники.бит_ВариантыОтчетов.ПустаяСсылка();
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	                   	
	Возврат РезВариант;
	
КонецФункции // СоздатьВариант()

#КонецОбласти

#КонецЕсли