
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
Функция ЕстьВыгрузка(ПараметрыВыгрузки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПлатежныеДокументыГИСЖКХ.Ссылка,
	|	бит_ПлатежныеДокументыГИСЖКХ.ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ПлатежныеДокументыГИСЖКХ КАК бит_ПлатежныеДокументыГИСЖКХ
	|ГДЕ
	|	НЕ бит_ПлатежныеДокументыГИСЖКХ.ЭтоГруппа
	|	И бит_ПлатежныеДокументыГИСЖКХ.РасчетныйПериод = &Период
	|	И бит_ПлатежныеДокументыГИСЖКХ.ШаблонИзвещений = &ШаблонИзвещений
	|	И бит_ПлатежныеДокументыГИСЖКХ.ИдентификаторПД <> """"
	|	И НЕ бит_ПлатежныеДокументыГИСЖКХ.Отозван
	|	И бит_ПлатежныеДокументыГИСЖКХ.ЛицевойСчет В(&ЛицевыеСчета)";
	
	Запрос.УстановитьПараметр("Период"			, ПараметрыВыгрузки.Период);
	Запрос.УстановитьПараметр("ШаблонИзвещений"	, ПараметрыВыгрузки.ШаблонИзвещений);
	Запрос.УстановитьПараметр("ЛицевыеСчета"	, ПараметрыВыгрузки.ЛицевыеСчета);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ТекстСообщения = НСтр("ru = 'Существуют ранее отправленные платежные документы ГИС ЖКХ, за %1, по шаблону ""%2"" для ЛС:'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, НРег(ПараметрыВыгрузки.ПредставлениеПериода), Строка(ПараметрыВыгрузки.ШаблонИзвещений));
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + Строка(Выборка.ЛицевойСчет) + ";";
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	Возврат Истина;
	
КонецФункции
	
Функция ПолучитьПечатныйДокумент(Ссылка) Экспорт
	
	ТабВложения = бит_ПрисоединенныеФайлыСервер.ПолучитьВложения(Ссылка);
	Если ТабВложения.Количество() = 1 Тогда  
		ДанныеФайла = бит_ПрисоединенныеФайлыСервер.ПолучитьДанныеФайла(ТабВложения[0].Ссылка);
	Иначе
		Возврат Неопределено
	КонецЕсли;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяФайла);
	//ТабДок = Новый ТабличныйДокумент;
	//ТабДок.Прочитать(ФайлТабДок); 
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
    ХранЗн = Сериализатор.ПрочитатьXML(ЧтениеXML, Тип("ХранилищеЗначения"));
    ЧтениеXML.Закрыть();
	СтруктураТЗ = ХранЗн.Получить();
	УдалитьФайлы(ИмяФайла);
	Возврат СтруктураТЗ;
	
КонецФункции

Функция ПолучитьГруппуДокументов(ДатаСоздания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПлатежныеДокументыГИСЖКХ.Ссылка
	|ИЗ
	|	Справочник.бит_ПлатежныеДокументыГИСЖКХ КАК бит_ПлатежныеДокументыГИСЖКХ
	|ГДЕ
	|	бит_ПлатежныеДокументыГИСЖКХ.РасчетныйПериод = &ДатаСоздания
	|	И бит_ПлатежныеДокументыГИСЖКХ.ЭтоГруппа
	|	И НЕ бит_ПлатежныеДокументыГИСЖКХ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе	
		Возврат СоздатьГруппу();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДокументы(Парам) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПлатежныеДокументыГИСЖКХ.Ссылка,
	|	бит_ПлатежныеДокументыГИСЖКХ.ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ПлатежныеДокументыГИСЖКХ КАК бит_ПлатежныеДокументыГИСЖКХ
	|ГДЕ
	|	НЕ бит_ПлатежныеДокументыГИСЖКХ.ЭтоГруппа
	|	И бит_ПлатежныеДокументыГИСЖКХ.ИдентификаторПД = """"
	|	И НЕ бит_ПлатежныеДокументыГИСЖКХ.Отозван
	|	И бит_ПлатежныеДокументыГИСЖКХ.ШаблонИзвещений = &ШаблонИзвещений
	|	И бит_ПлатежныеДокументыГИСЖКХ.ЛицевойСчет В(&ЛицевойСчет)
	|	И бит_ПлатежныеДокументыГИСЖКХ.РасчетныйПериод = &ДатаСоздания";
	
	Запрос.УстановитьПараметр("ШаблонИзвещений"	, Парам.ШаблонИзвещений);
	Запрос.УстановитьПараметр("ЛицевойСчет"		, Парам.ЛицевыеСчета);
	Запрос.УстановитьПараметр("ДатаСоздания"	, Парам.Период);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Перенос нумерации в новый реквизит. (Требование ГИС ЖКХ, не более 30 символов и уникальность)
Процедура ПереносНумерации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПлатежныеДокументыГИСЖКХ.Ссылка КАК Ссылка,
	|	бит_ПлатежныеДокументыГИСЖКХ.Код КАК Код
	|ИЗ
	|	Справочник.бит_ПлатежныеДокументыГИСЖКХ КАК бит_ПлатежныеДокументыГИСЖКХ
	|ГДЕ
	|	бит_ПлатежныеДокументыГИСЖКХ.ЭтоГруппа = ЛОЖЬ
	|	И бит_ПлатежныеДокументыГИСЖКХ.НомерПД = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Об			= Выборка.Ссылка.ПолучитьОбъект();
		Об.НомерПД	= Выборка.Код;
		
		Попытка
			Об.Записать();
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
