#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПометкуУдаленияПрисоединенногоФайла(Ссылка, ПометкаУдаления);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Присоеденяет файлы к элементам справочника. 
// 
// Параметры: 
//  ПараметрыЗаписи		 		- <Структура>. Структура параметров записи. Обязательный параметр.
//								Обязательно должна содержать свойства:
//								"Период" - <Дата> - Дата на которую сформированны данные.
//									Например: "01.01.2017"
//								"Файл" - <Структура или ТабличныйДокумент> - тип таблицы, на которую накладывается блокировка.
//									Пространство блокировки состоит из типа таблицы и имени таблицы.
//									Например: ТабличныйДокумент или Структура из ТаблицЗначений
// Возвращаемое значение:
//  Ссылка - ссылка на созданный объект.
//
Функция ПрисоденитьФайл(ПараметрыЗаписи) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'Перед прикрепление файла объект необходимо записать.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяФайла		= "Квитанция по ЛС " + Строка(ЛицевойСчет) + " (" + НРег(Формат(ПараметрыЗаписи.Период, "ДФ='ММММ гггг'")) + ")";
	РазрешениеФайла = "mxl";
	ВремяИзменения  = ТекущаяДатаСеанса();
	АдресФайлаВоВременномХранилище = ПоместитьОбъектВоВременноеХранилище(ПараметрыЗаписи.Файл);
	
	ТабВложения = бит_ПрисоединенныеФайлыСервер.ПолучитьВложения(Ссылка);
	Если ТабВложения.Количество() = 1 Тогда  
		
		//ФайлВложение = бит_ПрисоединенныеФайлыСервер.ПолучитьДанныеФайла(ТабВложения[0].Ссылка);
		//ФайлВложение = бит_ПрисоединенныеФайлыСервер.ПолучитьВложения(Ссылка);
		ФайлВложение = ТабВложения[0].Ссылка;
		ИнформацияОФайле = Новый Структура();
		ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", АдресФайлаВоВременномХранилище);
		ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
		бит_ПрисоединенныеФайлыСервер.ОбновитьПрисоединенныйФайл(ФайлВложение, ИнформацияОФайле);
		Возврат ФайлВложение
		
	Иначе
		
		Возврат бит_ПрисоединенныеФайлыСервер.ДобавитьФайл(Ссылка,
		ИмяФайла,
		РазрешениеФайла,
		ВремяИзменения,
		ВремяИзменения,
		АдресФайлаВоВременномХранилище);
		
	КонецЕсли;

КонецФункции

Функция ПоместитьОбъектВоВременноеХранилище(ПрикрепленныйФайл, Знач АдресВХ = Неопределено)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	ПрикрепленныйФайл.Записать(ВременныйФайл);
	
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременныйФайл), АдресВХ);
	УдалитьФайлы(ВременныйФайл);
	
	Возврат АдресВХ;
	
КонецФункции // ()

Процедура УстановитьПометкуУдаленияПрисоединенногоФайла(ПлатежныеДокументыГИСЖКХП, ПометкаУдаления)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПометкаУдаления"	, ПометкаУдаления);
	Запрос.УстановитьПараметр("ВладелецФайла"	, ПлатежныеДокументыГИСЖКХП);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПлатежныеДокументыГИСЖКХПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ПлатежныеДокументыГИСЖКХПрисоединенныеФайлы КАК бит_ПлатежныеДокументыГИСЖКХПрисоединенныеФайлы
	|ГДЕ
	|	бит_ПлатежныеДокументыГИСЖКХПрисоединенныеФайлы.ПометкаУдаления <> &ПометкаУдаления
	|	И бит_ПлатежныеДокументыГИСЖКХПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
