
#Область ПеременныеМодуля
#КонецОбласти


#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм
#КонецОбласти


#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.СуммаДокумента = Объект.СписокУслугПоПериоду.Итог("Сумма");

КонецПроцедуры

#КонецОбласти


#Область ДействияКомандФорм

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Проведен Тогда
		ТекстСообщения = НСтр("ru = 'Перед заполнением, необходимо отменить проведение документа.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить(); //Чтобы меньше пересылать на сервер при конвертации	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере();
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_РаспределениеАванса"));
	
	ДокументОбъект.ЗаполнитьСписокУслуг();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.СписокУслугПоПериоду.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.Организация = мКэшЗначений.мОрганизация;
		Возврат;
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить();
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Если Объект.СписокУслугПоПериоду.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("УлицаПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.Улица = мКэшЗначений.мУлица;
		Возврат;
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить();
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мУлица = Объект.Улица;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если Объект.СписокУслугПоПериоду.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗданиеПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.Здание = мКэшЗначений.мЗдание;
		Возврат;
	КонецЕсли;
	
	Объект.СписокУслугПоПериоду.Очистить();
	//ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мЗдание = Объект.Здание;
	
КонецПроцедуры


#КонецОбласти


#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура СписокУслугПоПериодуЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПоПериодуЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти


#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("мТекущаяДатаДокумента", Объект.Дата);
	
	КэшированныеЗначения.Вставить("мОрганизация",		 Объект.Организация);
	КэшированныеЗначения.Вставить("мЗдание",			 Объект.Здание);
	КэшированныеЗначения.Вставить("мУлица",				 Объект.Улица);
	КэшированныеЗначения.Вставить("мТекущийЛицевойСчет", Неопределено);	
	КэшированныеЗначения.Вставить("мЛицевойСчет",		 Неопределено);
	КэшированныеЗначения.Вставить("мСумма",				 Неопределено);
	КэшированныеЗначения.Вставить("ВыбЗначение",		 Неопределено);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти