     
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
																,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СчетчикиНоваяДатаПоверки.Видимость = (Объект.ВидОперации = Перечисления.бит_ВидыОперацииИзменениеДатыПоверки.УстановкаДатыПоверки);
		
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если Параметры.Свойство("ЗаполнитьИзОбработкиПоверки") Тогда
		
		Объект.ВидОперации = Параметры.ЗаполнитьИзОбработкиПоверки.ВидОперации;
		Объект.Дата        = Параметры.ЗаполнитьИзОбработкиПоверки.Дата;
		
		МассивСчетчиков    = Параметры.ЗаполнитьИзОбработкиПоверки.МассивСчетчиков;
		
		Если МассивСчетчиков <> Неопределено Тогда
			
			Для каждого Строка Из МассивСчетчиков Цикл
				
				НоваяСтрока = Объект.Счетчики.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
		
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
    УправлениеЭлементамиФормы();
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" формы.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	Для каждого Строка Из ВыбранноеЗначение Цикл
		
		СтрокаПоиска = ПолучитьТабличнуюЧасть(Строка.Счетчик);
		
		Если СтрокаПоиска <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = Объект.Счетчики.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииИзменениеДатыПоверки.СнятьДатуПоверки") Тогда
		
			НоваяСтрока.НоваяДатаПоверки = Строка.ДатаПоверки;
		
		КонецЕсли;  
				
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ОбновитьСписокСчетчиков", Объект.Проведен);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм
 
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Счетчики.Количество() > 0 Тогда
	
		Ответ = Неопределено;
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
        Возврат; 
	
	КонецЕсли; 
	
	ЗаполнитьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        
        Возврат;
        
    Иначе
        
        Объект.Счетчики.Очистить();
        
    КонецЕсли; 
    
    ЗаполнитьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагмент()
    
    ЗаполнитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Объект.Здание   = Неопределено;
	Объект.Квартира = Неопределено;
	
	Объект.Счетчики.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Объект.Квартира = Неопределено;
	
	Объект.Счетчики.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	Объект.Счетчики.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Владелец", Объект.Здание);
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура СчетчикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
	
		Отказ = Истина;
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СчетчикиСчетчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	СписокСч = ЗаполнитьСписокСчетчиковНаСервере(КонецДня(ТекущаяДата()), Объект.Улица, Объект.Здание, Объект.Квартира);
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Ссылка", СписокСч);
	
	ОткрытьФорму("Справочник.бит_Счетчики.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СчетчикиСчетчикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Счетчики.ТекущиеДанные;
	
	Если ТекСтрока.Счетчик <> ВыбранноеЗначение Тогда
		
		СтрокаПоиска = ПолучитьТабличнуюЧастьСчетчик(ТекСтрока.Счетчик,ВыбранноеЗначение);
		
		Если СтрокаПоиска Тогда
			
			СтандартнаяОбработка = Ложь;
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Счетчик: "+ ВыбранноеЗначение + " уже занесен в таблицу.";
			Сообщение.Сообщить();
			Возврат;
			
		КонецЕсли; 
		
		СтруктураСтроки = ПолучитьСтруктуруСтрокиНаСервере(ВыбранноеЗначение, КонецДня(ТекущаяДата()));
		
		Если СтруктураСтроки.ДатаПоверки <> Неопределено 
			ИЛИ СтруктураСтроки.ВладелецСчетчика <> Неопределено Тогда
			
			ТекСтрока.ДатаПоверки      = СтруктураСтроки.ДатаПоверки;
			ТекСтрока.ВладелецСчетчика = СтруктураСтроки.ВладелецСчетчика;
			
			Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииИзменениеДатыПоверки.СнятьДатуПоверки") Тогда
				
				ТекСтрока.НоваяДатаПоверки = СтруктураСтроки.ДатаПоверки;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСтрокиНаСервере(Знач Счетчик, Знач Дата)
	
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК ВладелецСчетчика
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, ) КАК бит_ПоверкаСчетчиковСрезПоследних
		|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = бит_ПоверкаСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВладелецСчетчика";
		
		Запрос.УстановитьПараметр("Счетчик", Счетчик);
		Запрос.УстановитьПараметр("Дата"   , Дата);
		
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("ДатаПоверки",      Выборка.ДатаПоверки);
			СтруктураСтроки.Вставить("ВладелецСчетчика", Выборка.ВладелецСчетчика);
						
		Иначе
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("ДатаПоверки",      Неопределено);
			СтруктураСтроки.Вставить("ВладелецСчетчика", Неопределено);
			
		КонецЕсли; 
	
	Возврат СтруктураСтроки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьСписокСчетчиковНаСервере(Знач Дата, Знач Улица, Знач Здание, Знач Квартира)
	
	УсловиеИнд  = "";
	УсловиеГруп = "";
	
	Если ЗначениеЗаполнено(Улица) Тогда
	
		УсловиеИнд  = "И Объект.УлицаЛицевогоСчета = &Улица ";
	    УсловиеГруп = "И Объект.Улица = &Улица ";
		Если ЗначениеЗаполнено(Здание) Тогда
		
			УсловиеИнд  = УсловиеИнд +"И Объект.Здание = &Здание ";
			УсловиеГруп = УсловиеГруп +"И Объект.Ссылка = &Здание";
			
			Если ЗначениеЗаполнено(Квартира) Тогда
			
				УсловиеИнд  = УсловиеИнд + "И Объект.Квартира = &Квартира";
			
			КонецЕсли; 
		
		КонецЕсли; 
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)"+УсловиеИнд+") КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)"+УсловиеГруп+" ) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"    , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Улица"   , Улица);
	Запрос.УстановитьПараметр("Здание"  , Здание);
	Запрос.УстановитьПараметр("Квартира", Квартира);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокСч = Новый СписокЗначений;
	СписокСч.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Счетчик"));
	
	Возврат СписокСч;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	УсловиеИнд  = "";
	УсловиеГруп = "";
	
	Если ЗначениеЗаполнено(Объект.Улица) Тогда
		
		УсловиеИнд  = "И Объект.УлицаЛицевогоСчета = &Улица ";
		УсловиеГруп = "И Объект.Улица = &Улица ";
		
		Если ЗначениеЗаполнено(Объект.Здание) Тогда
			
			УсловиеИнд  = УсловиеИнд  + "И Объект.Здание = &Здание ";
			УсловиеГруп = УсловиеГруп + "И Объект.Ссылка = &Здание";
			
			Если ЗначениеЗаполнено(Объект.Квартира) Тогда
				
				УсловиеИнд  = УсловиеИнд + "И Объект.Квартира = &Квартира";
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК ВладелецСчетчика
	|ПОМЕСТИТЬ ТабСч
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)"+УсловиеИнд+") КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)"+УсловиеГруп+") КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСч.Счетчик,
	|	ТабСч.ВладелецСчетчика,
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки,
	|	ВЫБОР
	|		КОГДА &ВидОперации = Значение(Перечисление.бит_ВидыОперацииИзменениеДатыПоверки.СнятьДатуПоверки)
	|			ТОГДА бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК НоваяДатаПоверки
	|ИЗ
	|	ТабСч КАК ТабСч
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, ) КАК бит_ПоверкаСчетчиковСрезПоследних
	|		ПО ТабСч.Счетчик = бит_ПоверкаСчетчиковСрезПоследних.Счетчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТабСч.ВладелецСчетчика";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Улица"      , Объект.Улица);
	Запрос.УстановитьПараметр("Здание"     , Объект.Здание);
	Запрос.УстановитьПараметр("Квартира"   , Объект.Квартира);
    Запрос.УстановитьПараметр("ВидОперации", Объект.ВидОперации);
	
	Результат = ЗАпрос.Выполнить().Выгрузить();
	
	Объект.Счетчики.Загрузить(Результат);

КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
		
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличнуюЧасть(Счетчик)
	
	ТабЗначений =  Объект.Счетчики.Выгрузить();
	
	СтрокаПоиска = ТабЗначений.Найти(Счетчик, "Счетчик");
	
	Возврат СтрокаПоиска;
  
КонецФункции

&НаСервере
Функция ПолучитьТабличнуюЧастьСчетчик(Счетчик,ВыбранноеЗначение)
	
	ТабЗначений =  Объект.Счетчики.Выгрузить();
	
	Если ТабЗначений.Найти(ВыбранноеЗначение, "Счетчик") <> Неопределено Тогда
		
		Возврат Истина;
		
	КонецЕсли; 
	
	Возврат Ложь;
  
КонецФункции

#КонецОбласти

