
#Область РаботаСПрефиксами

Процедура ДобавитьПрефиксИБ(Источник, Префикс) Экспорт

	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Или бит_ОбщегоНазначения.ЭтоУТ() Тогда
		
		Выполнить("ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(Источник, Истина, Префикс)");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда	
		
		Выполнить("ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс)");	
		
	КонецЕсли; 

КонецПроцедуры // ДобавитьПрефиксИБ()

Процедура ДобавитьПрефиксОрганизации(Источник, Префикс) Экспорт

	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Или бит_ОбщегоНазначения.ЭтоУТ() Тогда
		
		Выполнить("ПрефиксацияОбъектовСобытия.УстановитьПрефиксОрганизации(Источник, Истина, Префикс)");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда	
		
		Выполнить("ОбщегоНазначения.ДобавитьПрефиксОрганизации(Источник, Префикс)");	
		
	КонецЕсли; 

КонецПроцедуры // ДобавитьПрефиксОрганизации()

#КонецОбласти

#Область УправлениеВзаиморасчетами

Процедура ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, ДоговорОрганизация, Отказ, Заголовок="") Экспорт
	
	ТекстСообщения =  НСтр("ru = 'Выбран договор контрагента, не соответствующий организации, указанной в документе!'");
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Если ЗначениеЗаполнено(Организация) 
			И ЗначениеЗаполнено(ДоговорКонтрагента)
			И Организация <> ДоговорОрганизация Тогда
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Или бит_ОбщегоНазначения.ЭтоУТ() Тогда
		
		Если ЗначениеЗаполнено(Организация) 
			И ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов()	

// Получает договор контрагента по умолчанию с учетом условий отбора. 
// Возвращается основной договор или единственный или пустая ссылка.
//
Функция УстановитьДоговорКонтрагента(ДоговорКонтрагента,ВладелецДоговора, ОрганизацияДоговора, СписокВидовДоговора = Неопределено, СтруктураПараметров = Неопределено) Экспорт
	
	флВыполнено = Ложь;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("флВыполнено = УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(ДоговорКонтрагента,ВладелецДоговора,ОрганизацияДоговора,СписокВидовДоговора, СтруктураПараметров);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда	
		
		Выполнить("флВыполнено = БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(ДоговорКонтрагента, ВладелецДоговора, ОрганизацияДоговора, СписокВидовДоговора, СтруктураПараметров);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоУТ() Тогда
		
	КонецЕсли; 
	
	Возврат флВыполнено;
	
КонецФункции // УстановитьДоговорКонтрагента()	

// Устанавливает банковский счет по умолчанию. Возвращает состояние установлен/не установлен.
//
Функция УстановитьБанковскийСчет(Счет, ВладелецСчета, Валюта, СовпадениеВалюты = Истина) Экспорт

	флВыполнено = Ложь;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("флВыполнено = УправлениеДенежнымиСредствами.УстановитьБанковскийСчет(Счет, ВладелецСчета, Валюта, СовпадениеВалюты);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда	
		
		Выполнить("флВыполнено = УчетДенежныхСредствБП.УстановитьБанковскийСчет(Счет, ВладелецСчета, Валюта, СовпадениеВалюты);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоУТ() Тогда
		
	КонецЕсли; 
	
	Возврат флВыполнено;
	
КонецФункции // УстановитьБанковскийСчет()	

#КонецОбласти

#Область УниверсальныеМеханизмы

// Выводит на печать подготовленный макет. 
//
// Параметры:
//  ПечДокумент            - ТабличныйДокумент, макет на печать,
//  КоличествоЭкземпляров  - Число, количество экземпляров на печать,
//  НаПринтер              - Булево, Если истина, то выводим сразу на принтер,
//  Заголовок              - Заголовок окна табличного документа,
//  НепосредственнаяПечать - Определяет необходимость показа диалога печати перед печатью.
//
Процедура НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", НепосредственнаяПечать = Ложь, Ссылка = Неопределено, ИмяМакета = "") Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("УниверсальныеМеханизмы.НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров, НаПринтер, Заголовок, НепосредственнаяПечать);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Или бит_ОбщегоНазначения.ЭтоУТ() Тогда
		
		Если ПечДокумент = Неопределено тогда
			Возврат;
		КонецЕсли;
		
		// Получить необходимое количество копий.
		Если КоличествоЭкземпляров > 0 Тогда
			ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
		КонецЕсли;
		
		Если НЕ ПечДокумент.АвтоМасштаб
			И НЕ ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
			ПечДокумент.АвтоМасштаб = Истина;
		КонецЕсли;
		
		Если НаПринтер Тогда
			
			ПечДокумент.Напечатать(НепосредственнаяПечать = Истина);
			
		Иначе
			
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры	

#Если ТолстыйКлиентОбычноеПриложение Тогда
	
// Печатает документ полученный по нажатию кнопки в форме списка.
//
// Параметры:
//  Документ - документ,который нужно отпечатать.
//
Процедура НапечататьДокументИзФормыСписка(Ссылка) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("УниверсальныеМеханизмы.НапечататьДокументИзФормыСписка(Ссылка);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		Если Ссылка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НаПринтер = бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("ПечатьДокументовБезПредварительногоПросмотра", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")) = Истина;
		
		Если Не НапечататьДокументПоУмолчанию(Ссылка.ПолучитьОбъект(), 0, НаПринтер) Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("НапечататьДокументИзФормыСпискаЗавершение", бит_МеханизмыТиповых), "Операция не выполнена");
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НапечататьДокументИзФормыСпискаЗавершение(ДополнительныеПараметры) Экспорт
    
	Завершение = Истина;

КонецПроцедуры	

// Процедура формирует дерево кнопок для подменю "Печать".
//
Функция ПолучитьДеревоМакетовПечати(СсылкаОбъекта, ВнутренниеПечатныеФормы, Действие = Неопределено, ДействиеУстановитьПечатьПоУмолчанию = Неопределено) Экспорт
	
	ДеревоКнопок = ИнициализироватьДеревоДополнительныхКнопок();
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("ДеревоКнопок = УниверсальныеМеханизмы.ПолучитьДеревоМакетовПечати(СсылкаОбъекта, ВнутренниеПечатныеФормы, Действие, ДействиеУстановитьПечатьПоУмолчанию);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		ДеревоКнопок = ИнициализироватьДеревоДополнительныхКнопок();
		
		Если Не ВнутренниеПечатныеФормы = Неопределено Тогда
			ДобавитьВДеревоМакетовВстроенныеФормы(ДеревоКнопок, ВнутренниеПечатныеФормы, Действие);
			
		КонецЕсли;
		
		ДобавитьВДеревоМакетовДополнительныеФормы(ДеревоКнопок, СсылкаОбъекта, Действие);
		
		СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(СсылкаОбъекта.Метаданные().Имя ,ДеревоКнопок);
		
		Если Не СтрокаПоУмолчанию = Неопределено Тогда
			
			СтрокаПоУмолчанию.Пометка = Истина;
			
		КонецЕсли;
		
		
		Если ДеревоКнопок.Строки.Количество() > 0 Тогда
			
			ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, Строка(Новый УникальныйИдентификатор), ТипКнопкиКоманднойПанели.Разделитель);
			
			ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, "ПечатьПоУмолчанию", ТипКнопкиКоманднойПанели.Действие, "По умолчанию...", ДействиеУстановитьПечатьПоУмолчанию, "ПечатьПоУмолчанию");
			
		КонецЕсли; 
		
	КонецЕсли;

	Возврат ДеревоКнопок;
	
КонецФункции

// Процедура устанавливает Подменю "Печать". 
//
// Параметры:
//  ПодменюПечати.
//  КоманднаяПанель.
//  СоздаватьПриНеобходимости - Булево.
//
Процедура УстановитьПодменюПечати(ПодменюПечати, КоманднаяПанель, СоздаватьПриНеобходимости) Экспорт
	
	Если Не ПодменюПечати = Неопределено или  Не СоздаватьПриНеобходимости Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяПодменю = Строка (Новый УникальныйИдентификатор);
	
	Если КоманднаяПанель.ВыравниваниеКнопок = ВыравниваниеКнопокКоманднойПанели.Право Тогда
		
		КоманднаяПанель.Кнопки.Вставить(0, , ТипКнопкиКоманднойПанели.Разделитель);
		ПодменюПечати = КоманднаяПанель.Кнопки.Вставить(0, ИмяПодменю, ТипКнопкиКоманднойПанели.Подменю, "Печать");
		
	Иначе
		
		КоманднаяПанель.Кнопки.Добавить(,ТипКнопкиКоманднойПанели.Разделитель);
		ПодменюПечати = КоманднаяПанель.Кнопки.Добавить(ИмяПодменю, ТипКнопкиКоманднойПанели.Подменю, "Печать");
		
	КонецЕсли;
	
	ПодменюПечати.Подсказка = "Меню выбора печатных форм";

КонецПроцедуры // УстановитьПодменюПечати()

// Процедура Устанавливает кнопку "Печать по умолчанию".
//
Процедура УстановитьПечатьПоУмолчанию(ПечатьПоУмолчанию, КоманднаяПанель, ДеревоМакетов, ИмяМетаданных, ДействиеПечатьПоУмолчанию) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("УниверсальныеМеханизмы.УстановитьПечатьПоУмолчанию(ПечатьПоУмолчанию, КоманднаяПанель, ДеревоМакетов, ИмяМетаданных,ДействиеПечатьПоУмолчанию);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(ИмяМетаданных,ДеревоМакетов);
		
		
		Если Не СтрокаПоУмолчанию = Неопределено Тогда
			Если ПечатьПоУмолчанию = Неопределено Тогда
				
				ИмяКнопки = Строка (Новый УникальныйИдентификатор);
				
				Если КоманднаяПанель.ВыравниваниеКнопок = ВыравниваниеКнопокКоманднойПанели.Право Тогда
					КоманднаяПанель.Кнопки.Вставить(0,,ТипКнопкиКоманднойПанели.Разделитель);
					ПечатьПоУмолчанию = КоманднаяПанель.Кнопки.Вставить(0,ИмяКнопки,ТипКнопкиКоманднойПанели.Действие,"",ДействиеПечатьПоУмолчанию);
				Иначе
					КоманднаяПанель.Кнопки.Добавить(,ТипКнопкиКоманднойПанели.Разделитель);
					ПечатьПоУмолчанию = КоманднаяПанель.Кнопки.Добавить(ИмяКнопки,ТипКнопкиКоманднойПанели.Действие,"",ДействиеПечатьПоУмолчанию);
				КонецЕсли;
				
				ПечатьПоУмолчанию.Подсказка = "Печать по умолчанию";
				
			КонецЕсли; 
			
			ПечатьПоУмолчанию.Текст       = СтрокаПоУмолчанию.Текст;
			ПечатьПоУмолчанию.Доступность = Истина; 
			
		ИначеЕсли Не ПечатьПоУмолчанию = Неопределено Тогда
			
			ПечатьПоУмолчанию.Текст       = "Печать по умолчанию не назначена"; 
			ПечатьПоУмолчанию.Доступность = Ложь; 
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура формирует подменю по дереву значений.
// Параметры:
//	< СтрокаПодменю > (обязательный)
//		Тип: Дерево или элемент дерева значений, по данным которого необходимо построить подменю.
//	< Подменю> (обязательный).
//		Тип: Элемент командной панели «Кнопка» типа «Подменю». На которой необходимо сформировать новое подменю.
//	< Очищать> (по умолчанию «Ложь»).
//		Тип: булево. Определяет: следует ли очищать переданное подменю.
//	< ДобавлятьРазделительВНачало > (по умолчанию «Ложь»).
//		Тип: булево. Определяет: следует ли добавить в начало подменю разделитель.
Процедура СформироватьПодменю(СтрокаПодменю, Подменю, Очищать = Ложь, ДобавлятьРазделительВНачало = Ложь) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("УниверсальныеМеханизмы.СформироватьПодменю(СтрокаПодменю, Подменю,Очищать,ДобавлятьРазделительВНачало);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		Строки = СтрокаПодменю.Строки;
		Кнопки = Подменю.Кнопки;
		
		Если Очищать Тогда
			Кнопки.Очистить();
			
		КонецЕсли; 
		
		Если ДобавлятьРазделительВНачало и Строки.Количество() > 0 Тогда
			Кнопки.Добавить(,ТипКнопкиКоманднойПанели.Разделитель);
			
		КонецЕсли; 
		
		Для каждого СтрокаКнопки Из Строки Цикл
			
			Кнопка = Кнопки.Добавить(СтрокаКнопки.Имя,СтрокаКнопки.ТипКнопки, СтрокаКнопки.Текст, СтрокаКнопки.Действие);
			
			Если СтрокаКнопки.Строки.Количество() > 0 Тогда
				
				СформироватьПодменю(СтрокаКнопки, Подменю, Ложь, Ложь)
				
			КонецЕсли; 
			
			Если Не СтрокаКнопки.Картинка = Неопределено Тогда
				
				Кнопка.Картинка  = СтрокаКнопки.Картинка;
				
			КонецЕсли; 
			
			Кнопка.Подсказка      = СтрокаКнопки.Подсказка;
			Кнопка.Пометка        = СтрокаКнопки.Пометка;
			//	Кнопка.ИзменяетДанные = Истина;   откат 00072100, т.к. невозможно работать с печ.формами док.закрытие месяца.
			// Остальные свойства кнопки.
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик нажатия любой из дополнительных кнопок печати.
// Параметры:
//    ДеревоМакетов: ДеревоЗначений, макетов печатных форм.
//    Объект       : ДокументОбъект, СправочникОбъект, из формы которого вызвана процедура.
//    Форма        : Форма, вызвавшая процедуру.
//    ТекстКнопки  : Строка, заголовок нажатой кнопки.
Процедура ПечатьПоДополнительнойКнопке(УдалитьДеревоМакетов, Объект, Форма = Неопределено, ТекстКнопки) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("УниверсальныеМеханизмы.ПечатьПоДополнительнойКнопке(УдалитьДеревоМакетов, Объект, Форма, ТекстКнопки);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		Если Не Форма = Неопределено Тогда

			Возврат;

		КонецЕсли;
		
		ЭтоДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
		
		Попытка
			СтруктураВнутреннихПечатныхФорм = Объект.ПолучитьСтруктуруПечатныхФорм()
		Исключение
			СтруктураВнутреннихПечатныхФорм = Новый Структура;
		КонецПопытки;
		
		ДеревоМакетовПечати = ПолучитьДеревоМакетовПечати(Объект.Ссылка, СтруктураВнутреннихПечатныхФорм);
		
		СтрокаКнопки = ДеревоМакетовПечати.Строки.Найти(ТекстКнопки,"Текст");
		
		Если СтрокаКнопки = Неопределено Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПечатьПоДополнительнойКнопкеЗавершение", бит_МеханизмыТиповых), "Печать не доступна. Изменился набор реквизитов!");
			Возврат;
			
		КонецЕсли;
		
		НаПринтер = бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("ПечатьДокументовБезПредварительногоПросмотра", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")) = Истина;
		
		Расшифровка = СтрокаКнопки.Расшифровка;
		Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
			ТабДокумент = НапечататьВнешнююФорму(Объект.Ссылка, Расшифровка);
			НапечататьДокумент(ТабДокумент, 0, НаПринтер, ?(ЭтоДокумент, бит_ОбщегоНазначения.СформироватьЗаголовокДокумента(Объект), Строка(Объект)), Объект.Ссылка);
		Иначе
			Объект.Печать(СтрокаКнопки.Имя, 0, НаПринтер);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПечатьПоДополнительнойКнопкеЗавершение(ДополнительныеПараметры) Экспорт
    
	Завершение = Истина;  

КонецПроцедуры

// Процедура назначает макет по умолчанию.
//
Функция НазначитьКнопкуПечатиПоУмолчанию(ДеревоМакетов, ИмяМетаданных) Экспорт
	
	Результат = Ложь;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("Результат = УниверсальныеМеханизмы.НазначитьКнопкуПечатиПоУмолчанию(ДеревоМакетов, ИмяМетаданных);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(ИмяМетаданных,ДеревоМакетов);
		
		СписокМакетов = Новый СписокЗначений;
		
		Для каждого Строка Из ДеревоМакетов.Строки Цикл
			
			Если Строка.ТипКнопки = ТипКнопкиКоманднойПанели.Действие и Не Строка.Расшифровка = "ПечатьПоУмолчанию" Тогда
				
				СписокМакетов.Добавить(Строка.Текст,,СтрокаПоУмолчанию = Строка);
				
			КонецЕсли; 
			
			
		КонецЦикла; 
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Процедура - обработчик нажатия любой из дополнительных кнопок заполнения табличных частей.
// Параметры:
//    Форма       : Форма, вызвавшая процедуру.
Процедура ОбработатьНажатиеНаДополнительнуюКнопкуЗаполненияТЧ(СтрокаКнопки,ЭтотОбъект) Экспорт
	
	Перем СсылкаНаВнешнююОбработку;
	Перем ДополнительныеПараметры;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("УниверсальныеМеханизмы.ОбработатьНажатиеНаДополнительнуюКнопкуЗаполненияТЧ(СтрокаКнопки,ЭтотОбъект);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		// Получить ссылку на внешнюю обработку.
		СтрокаКнопки.Расшифровка.Свойство("СсылкаНаВнешнююОбработку", СсылкаНаВнешнююОбработку);
		
		// Получить дополнительные параметры внешней обработки.
		СтрокаКнопки.Расшифровка.Свойство("ДополнительныеПараметрыОбработки", ДополнительныеПараметры);
		
		//Расшифровка = СтрокаКнопки.Расшифровка;.
		
		Если ТипЗНЧ(СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.УдалитьВнешниеОбработки") Тогда
			ИмяФайла = КаталогВременныхФайлов()+"PrnForm.tmp";
			ОбъектВнешнейФормы = СсылкаНаВнешнююОбработку.ПолучитьОбъект();
			
			Если ОбъектВнешнейФормы = Неопределено Тогда
				ТекстСообщения = НСтр("ru = 'Ошибка получения внешней обработки заполнения табличной части документа. Возможно обработка была удалена.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
			
			ДвоичныеДанные = ОбъектВнешнейФормы.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			
			Попытка
				
				Обработка = ВнешниеОбработки.Создать(ИмяФайла);
				
				// Передать внешней обработке дополнительные параметры.
				Если ДополнительныеПараметры <> Неопределено Тогда
					
					// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение.
					Если НЕ Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
						Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
					КонецЕсли;
					
				КонецЕсли;
				
			Исключение
				
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстСообщения = НСтр("ru = 'Ошибка исполнения внешней обработки табличной части документа.
											|%1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
				
			КонецПопытки;
			
			Попытка
				
				Обработка.Инициализировать(ЭтотОбъект, СтрокаКнопки.Родитель.Имя, СтрокаКнопки.Родитель.Расшифровка);
				
			Исключение
				
				бит_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, "Заполнение ТЧ не произведено!");
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура формирует подменю "Заполнить" у ТЧ по дереву значений.
//
Функция СформироватьПодменюЗаполненияТЧ(Ссылка, СоответствиеТЧ, Действие) Экспорт
	
	ДеревоКнопок = ИнициализироватьДеревоДополнительныхКнопок();
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("ДеревоКнопок = УниверсальныеМеханизмы.СформироватьПодменюЗаполненияТЧ(Ссылка, СоответствиеТЧ, Действие);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнешниеОбработкиПринадлежность.Ссылка,
		|	ВнешниеОбработкиПринадлежность.ДополнительныеПараметрыОбработки КАК ДополнительныеПараметрыОбработки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВнешниеОбработкиПринадлежность.ПредставлениеКнопки, """") <> """" ТОГДА ВнешниеОбработкиПринадлежность.ПредставлениеКнопки
		|		ИНАЧЕ ВнешниеОбработкиПринадлежность.Ссылка.Наименование
		|	КОНЕЦ КАК Наименование,
		|	ВнешниеОбработкиПринадлежность.ТабличнаяЧастьИмя КАК ТабличнаяЧастьИмя
		|ИЗ
		|	Справочник.УдалитьВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
		|ГДЕ
		|	(НЕ ВнешниеОбработкиПринадлежность.Ссылка.ПометкаУдаления)
		|	И ВнешниеОбработкиПринадлежность.СсылкаОбъекта = &Ссылка
		|	И ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки = &ВидОбработки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТабличнаяЧастьИмя
		|ИТОГИ ПО
		|	ТабличнаяЧастьИмя";
		
		МетаданныеОбъекта = Ссылка.Метаданные();
		ДеревоКнопок = ИнициализироватьДеревоДополнительныхКнопок();
		
		Запрос.УстановитьПараметр("ВидОбработки", "");
		Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
			Запрос.УстановитьПараметр("Ссылка", Документы[МетаданныеОбъекта.Имя].ПустаяСсылка());
		ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
			Запрос.УстановитьПараметр("Ссылка", Справочники[МетаданныеОбъекта.Имя].ПустаяСсылка());
		Иначе
			Возврат ДеревоКнопок;
		КонецЕсли;
		
		НомерКнопки = 0;
		
		ДеревоТЧ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для каждого КлючИЗначение Из СоответствиеТЧ Цикл
			ИмяТабличнойЧасти = КлючИЗначение.Ключ.Данные;
			
			СтрокаДереваТЧ = ДеревоТЧ.Строки.Найти(ИмяТабличнойЧасти,"ТабличнаяЧастьИмя");
			
			Если Не СтрокаДереваТЧ = Неопределено Тогда
				
				СтрокаПодменю  = ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок,ИмяТабличнойЧасти, ТипКнопкиКоманднойПанели.Действие , , , КлючИЗначение.Ключ, , , ,Истина);
				
				Для каждого ПодСтрокаДереваТЧ Из СтрокаДереваТЧ.Строки Цикл
					
					НомерКнопки = НомерКнопки + 1;
					
					СтруктураРасшифровки = Новый Структура("СсылкаНаВнешнююОбработку, ДополнительныеПараметрыОбработки", ПодСтрокаДереваТЧ.Ссылка, ПодСтрокаДереваТЧ.ДополнительныеПараметрыОбработки.Получить());
					
					ДобавитьСтрокуВДеревоКнопок(СтрокаПодменю, "ЗаполнениеТЧ"+НомерКнопки, ТипКнопкиКоманднойПанели.Действие, ПодСтрокаДереваТЧ.Наименование, Действие , СтруктураРасшифровки, , , ,Истина)
					
				КонецЦикла;
				
				ПодменюИлиКоманднаяПанель = КлючИЗначение.Значение;
				
				Если ТипЗНЧ(ПодменюИлиКоманднаяПанель) = Тип("КоманднаяПанель") Тогда
					
					ПодменюИлиКоманднаяПанель = ПодменюИлиКоманднаяПанель.Кнопки.Добавить(,ТипКнопкиКоманднойПанели.Подменю,"Заполнить");
					
				КонецЕсли;
				
				СформироватьПодменю(СтрокаПодменю, ПодменюИлиКоманднаяПанель,Ложь,Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДеревоКнопок;
	
КонецФункции

// Функция вызывает печать документа с макетом по умолчанию.
//
// Параметры:
//	Объект.
//	КоличествоЭкземпляров.
//	НаПринтер.
//	НепосредственнаяПечать.
//	
// Возвращаемое значение:
//	Булево.
//
Функция НапечататьДокументПоУмолчанию(Объект, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ЭтоДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	
	Попытка
		
		СтруктураВнутреннихПечатныхФорм = Объект.ПолучитьСтруктуруПечатныхФорм()
		
	Исключение
		
		СтруктураВнутреннихПечатныхФорм = Новый Структура;
		
	КонецПопытки;
	
	ДеревоМакетов = ПолучитьДеревоМакетовПечати(Объект.Ссылка, СтруктураВнутреннихПечатныхФорм);
	
	СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(Объект.Метаданные().Имя, ДеревоМакетов);
	
	Если СтрокаПоУмолчанию = Неопределено Тогда
		ТекстСообщения = НСтр("ru = '%1: Печать по умолчанию не определена!'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Объект));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли; 
	
	Если ТипЗнч(СтрокаПоУмолчанию.Расшифровка) = Тип("Структура") Тогда
		
		ТабДокумент = НапечататьВнешнююФорму(Объект.Ссылка, СтрокаПоУмолчанию.Расшифровка);
		НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ?(ЭтоДокумент, бит_ОбщегоНазначения.СформироватьЗаголовокДокумента(Объект.Ссылка), Строка(Объект)), НепосредственнаяПечать);
		
	Иначе
		
		Объект.Печать(СтрокаПоУмолчанию.Имя, КоличествоЭкземпляров, НаПринтер, НепосредственнаяПечать);
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ()

Функция ПолучитьСтрокуДереваМакетовПоУмолчанию(ИмяМетаданных,ДеревоКнопок)
	
	ИмяМакетаПоУмолчанию = ВосстановитьЗначение(ИмяМетаданных+ "МакетПечати");
	
	Если ИмяМакетаПоУмолчанию = Ложь или ДеревоКнопок.Строки.Количество() = 0 Тогда
		
		СтрокаПоУмолчанию = Неопределено;
		
	Иначе
		
		СтрокаПоУмолчанию = ДеревоКнопок.Строки.Найти(ИмяМакетаПоУмолчанию,"Текст");
		
		Если СтрокаПоУмолчанию = Неопределено Тогда
			
			СтрокаПоУмолчанию = ДеревоКнопок.Строки[0];
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаПоУмолчанию;
	
КонецФункции // ()

// Функция получает ТабличныйДокумент для печати из внешней печатной формы.
//
// Параметры:
//  Ссылка         - Ссылка, для которой необходимо напечатать документ.
//  ДвоичныеДанные - ДвоичныеДанные, внешняя обработка для печати.
//
// Возвращаемое значение:
//   ТабличныйДокумент
//
Функция НапечататьВнешнююФорму(Ссылка, ИсточникМакета) Экспорт

	Перем ДополнительныеПараметры;
	
	ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.Принадлежность[ИсточникМакета.НомерСтроки - 1].ХранилищеВнешнейОбработки.Получить();
	
	// Получить дополнительные параметры внешней обработки.
	ИсточникМакета.Свойство("ДополнительныеПараметрыОбработки", ДополнительныеПараметры);
	
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Обработка.СсылкаНаОбъект = Ссылка;
		
		// Передать внешней обработке дополнительные параметры.
		Если ДополнительныеПараметры <> Неопределено Тогда
			
			// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение.
			Если НЕ Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
				Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент = Обработка.Печать();
		УдалитьФайлы(ИмяФайла);
	Исключение
		бит_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось сформировать внешнюю печатную форму!");
	КонецПопытки;
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция инициализирует дерево дополнительных кнопок.
//	Параметры:
//		Нет.
// Возвращаемое значение:
//		Тип: ДереваЗначений.
Функция ИнициализироватьДеревоДополнительныхКнопок() Экспорт
	
	ДеревоКнопок = Новый ДеревоЗначений;
	
	ДеревоКнопок.Колонки.Добавить("Имя");
	ДеревоКнопок.Колонки.Добавить("ТипКнопки");
	ДеревоКнопок.Колонки.Добавить("Текст");
	ДеревоКнопок.Колонки.Добавить("Подсказка");
	ДеревоКнопок.Колонки.Добавить("Картинка");
	ДеревоКнопок.Колонки.Добавить("Действие");
	ДеревоКнопок.Колонки.Добавить("Пометка");
	
	ДеревоКнопок.Колонки.Добавить("ИзменяетДанные");
	
	ДеревоКнопок.Колонки.Добавить("Расшифровка");
	
	Возврат ДеревоКнопок;
	
КонецФункции // ()

// Процедура добавляет в дерево кнопок макетов встроенные печатные формы.
//
Процедура ДобавитьВДеревоМакетовВстроенныеФормы(ДеревоКнопок, ВнутренниеПечатныеФормы, Действие)

	Для каждого КлючИЗначение Из ВнутренниеПечатныеФормы Цикл
		Если КлючИЗначение.Значение = Неопределено Тогда
			
			ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, , ТипКнопкиКоманднойПанели.Разделитель);
			
		Иначе
			
			ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, КлючИЗначение.Ключ, ТипКнопкиКоманднойПанели.Действие, КлючИЗначение.Значение, Действие);
			
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры

// Функция добавляет новую строку в дерево кнопок.
// Параметры:
//	< СтрокаПодменю > (обязательный).
//		Тип: Дерево или элемент дерева значений, в который необходимо добавить новое описание кнопки.
//	< Имя > (обязательный).
//		Тип: Строка. Имя создаваемой кнопки;
//	< ТипКнопки > (по умолчанию «Действие»).
//		Тип: ТипКнопкиКоманднойПанели. Тип создаваемой кнопки (Кнопка, разделитель, подменю);
//	< Текст > (по умолчанию пустая строка).
//		Тип: Строка. Текст кнопки.
//	< Текст > (по умолчанию пустая строка).
//		Тип: Строка. Текст кнопки.
//	< Действие > (по умолчанию «Не Определено»).
//		Тип: Действие. Действие кнопки (процедура должна быть описана в форме объекта, на который навешивается подменю).
//	< Расшифровка > (по умолчанию не определено).
//		Тип: Произвольный.
//	< Пометка > (по умолчанию «Ложь»).
//		Тип: Булево.
//	< Подсказка > (по умолчанию пустая строка).
//		Тип: Строка. Подсказка создаваемой кнопки.
//	< Картинка > (по умолчанию «Не Определено»).
//		Тип: Картинка. Картинка создаваемой кнопки.
// Возвращаемое значение:
//		Тип: СтрокаДереваЗначений.
Функция ДобавитьСтрокуВДеревоКнопок(СтрокаПодменю, Имя, Знач ТипКнопки = Неопределено ,Текст = "", Действие = Неопределено, Расшифровка = Неопределено, Пометка = Ложь, Подсказка = "", Картинка = Неопределено, ИзменяетДанные = Ложь)
	
	Если ТипКнопки = Неопределено Тогда
	
		ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
		 
	КонецЕсли; 
	
	СтрокаКнопки             = СтрокаПодменю.Строки.Добавить();
	
	СтрокаКнопки.Имя         = Имя;
	СтрокаКнопки.ТипКнопки   = ТипКнопки;
	СтрокаКнопки.Текст       = Текст;
	СтрокаКнопки.Действие    = Действие;
	СтрокаКнопки.Картинка    = Картинка;
	СтрокаКнопки.Подсказка   = Подсказка;
	СтрокаКнопки.Пометка     = Пометка;
	
	СтрокаКнопки.ИзменяетДанные   = ИзменяетДанные;
	
	СтрокаКнопки.Расшифровка = Расшифровка;
	Возврат СтрокаКнопки;
	
КонецФункции

// Процедура дополняет таблицу печатных форма (ТаблицаМакетов) объекта из справочника "Дополнительные печатные формы".
Процедура ДобавитьВДеревоМакетовДополнительныеФормы(ДеревоМакетов, СсылкаОбъекта, Действие)
	
	СтрокиДерева = ДеревоМакетов.Строки;
	Если ТипЗнч(СсылкаОбъекта) = Тип("ОбъектМетаданных") Тогда
		Возврат;
	КонецЕсли; 
	
	МетаданныеОбъекта = СсылкаОбъекта.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеОбработкиПринадлежность.Ссылка КАК Ссылка,
	|	ВнешниеОбработкиПринадлежность.ДополнительныеПараметрыОбработки КАК ДополнительныеПараметрыОбработки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВнешниеОбработкиПринадлежность.ПредставлениеКнопки, """") <> """"
	|			ТОГДА ВнешниеОбработкиПринадлежность.ПредставлениеКнопки
	|		ИНАЧЕ ВнешниеОбработкиПринадлежность.Ссылка.Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВнешниеОбработкиПринадлежность.Ссылка.ХранилищеВнешнейОбработки КАК СсылкаХранилищеВнешнейОбработки,
	|	ВнешниеОбработкиПринадлежность.НастройкиПостроителяДляОтбора КАК НастройкиПостроителяДляОтбора,
	|	ВнешниеОбработкиПринадлежность.ХранилищеВнешнейОбработки КАК ХранилищеВнешнейОбработки,
	|	ВнешниеОбработкиПринадлежность.ЗаменяемаяПечатнаяФорма КАК ЗаменяемаяПечатнаяФорма,
	|	ВнешниеОбработкиПринадлежность.НомерСтроки
	|ИЗ
	|	Справочник.УдалитьВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
	|ГДЕ
	|	(НЕ ВнешниеОбработкиПринадлежность.Ссылка.ПометкаУдаления)
	|	И ВнешниеОбработкиПринадлежность.СсылкаОбъекта = &Ссылка
	|	И ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки = &ВидОбработки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВнешниеОбработкиПринадлежность.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	ИмяТаблицыОбъекта = "";

	Запрос.УстановитьПараметр("ВидОбработки", "");
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("Ссылка", Документы[МетаданныеОбъекта.Имя].ПустаяСсылка());
		ИмяТаблицыОбъекта = "Документ." + МетаданныеОбъекта.Имя;
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("Ссылка", Справочники[МетаданныеОбъекта.Имя].ПустаяСсылка());
		ИмяТаблицыОбъекта = "Справочник." + МетаданныеОбъекта.Имя;
	Иначе
		Возврат;
	КонецЕсли;
	
	БылРазделитель = СтрокиДерева.Количество() = 0 ;
	ВыборкаСсылок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылок.Следующий() Цикл
		ПорядковыйНомер = 0;
		Выборка = ВыборкаСсылок.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяОбработка = Неопределено;
			ОбработкаСтроки = Выборка.ХранилищеВнешнейОбработки.Получить();
			Если ТипЗнч(ОбработкаСтроки) = Тип("ДвоичныеДанные") Тогда
				НоваяОбработка = ОбработкаСтроки;
			Иначе
				ОбработкаЭлемента = Выборка.СсылкаХранилищеВнешнейОбработки.Получить();
				Если ТипЗнч(ОбработкаЭлемента) = Тип("ДвоичныеДанные") Тогда
					НоваяОбработка = ОбработкаЭлемента;
				КонецЕсли; 
			КонецЕсли; 
			
			Если НоваяОбработка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураРасшифровки = Новый Структура("СсылкаНаВнешнююОбработку, НомерСтроки, ДополнительныеПараметрыОбработки", ВыборкаСсылок.Ссылка, Выборка.НомерСтроки, Выборка.ДополнительныеПараметрыОбработки.Получить());
			
			// Проверим, удовлетворяет ли подключаемый отчет указанным в нем условиям.
			НастройкиПостроителя = Выборка.НастройкиПостроителяДляОтбора.Получить();
			Если ТипЗнч(НастройкиПостроителя) = Тип("НастройкиПостроителяОтчета") Тогда
				ПостроительОтчета = ИнициализироватьПостроительДопПечатныхФорм(ИмяТаблицыОбъекта, МетаданныеОбъекта.Синоним);
				ПостроительОтчета.Параметры.Вставить("Ссылка", СсылкаОбъекта);
				ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя, Истина, Ложь, Ложь, Ложь, Ложь);
				ПостроительОтчета.Выполнить();
				Если ПостроительОтчета.Результат.Пустой() Тогда
					Продолжить;
				КонецЕсли;
				Подсказка = "Отбор";
			Иначе
				Подсказка = "";
			КонецЕсли;
			
			// Теперь проверим, надо ли заменять существующую печ.форму или нужно добавить новую.
			Если ЗначениеЗаполнено(Выборка.ЗаменяемаяПечатнаяФорма) Тогда
				
				Подсказка = "Печатная форма заменена подключаемой" + Подсказка;
				
				СтрокаДерева = СтрокиДерева.Найти(Выборка.ЗаменяемаяПечатнаяФорма, "Имя");
				
				Если СтрокаДерева = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				// ПодменятьВстроеннуюФорму = Ложь;.
				СтрокаДерева.Расшифровка = СтруктураРасшифровки;
				СтрокаДерева.Подсказка = Подсказка;
				
				Продолжить;
				
			КонецЕсли; 
			
			// Только тут будем добавлять новую печ. форму в дополнение списка.
			Если Не БылРазделитель Тогда
				ДобавитьСтрокуВДеревоКнопок(ДеревоМакетов, Строка(Новый УникальныйИдентификатор), ТипКнопкиКоманднойПанели.Разделитель);
				БылРазделитель = Истина;
			КонецЕсли;
			
			Суффикс = ?(ПорядковыйНомер = 0 ,"" , "("+ПорядковыйНомер+")");
			ДобавитьСтрокуВДеревоКнопок(ДеревоМакетов, Строка(Новый УникальныйИдентификатор), ТипКнопкиКоманднойПанели.Действие, Выборка.Наименование + Суффикс, Действие ,СтруктураРасшифровки,);
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

// Функция заполняет начальные параметры построителю отчета, который.
//  используется для настройки отбора в механизме подключения внешних печатных форм.
//
// Параметры:
//  ИмяТаблицы     - Строка, имя таблицы БД к которой необходимо определить запрос.
//  СинонимТаблицы - Строка, синоним таблицы БД к которой необходимо определить запрос.
//
// Возвращаемое значение:
//   ПостроительОтчета.
//
Функция ИнициализироватьПостроительДопПечатныхФорм(ИмяТаблицы, СинонимТаблицы) Экспорт

	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Объект.Ссылка КАК Ссылка
	|ИЗ
	|	" + ИмяТаблицы + " КАК Объект
	|ГДЕ
	|	Объект.Ссылка = &Ссылка
	|{ГДЕ
	|	Объект.Ссылка.*}
	|";
	
	ПолеОбъекта = ПостроительОтчета.ДоступныеПоля.Найти("Ссылка");
	ПолеОбъекта.Представление = ?(НЕ ЗначениеЗаполнено(СинонимТаблицы), ИмяТаблицы, СинонимТаблицы);
	
	Возврат ПостроительОтчета;

КонецФункции // ()

#КонецЕсли

#КонецОбласти