
#Область ПроцедурыПечати

// Процедура формирования отчета.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	// БИТ_ЖКХ 15.03.2017 11:07:12 Начало правки... 
	Если ПараметрыОтчета.Свойство("НачалоПериода") И ПараметрыОтчета.Свойство("КонецПериода")
		И ПараметрыОтчета.НачалоПериода > ПараметрыОтчета.КонецПериода Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Период построения отчета указан с ошибкой!");
		
	Иначе
		
		Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Выписка Тогда
			ЗаполнитьМакетВыписки(ПараметрыОтчета, ТабличныйДокумент);
		ИначеЕсли ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Справка Тогда
			ЗаполнитьМакетСправки(ПараметрыОтчета, ТабличныйДокумент);
		ИначеЕсли ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.СправкаБалашиха Тогда
			ЗаполнитьМакетСправки(ПараметрыОтчета, ТабличныйДокумент, "МакетСправкиБалашиха");
		ИначеЕсли ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Остатки Тогда
			ЗаполнитьМакетОстатки(ПараметрыОтчета, ТабличныйДокумент);
		//28.08.2019	
		ИначеЕсли ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСПеня Тогда
			ЗаполнитьМакетПолныйСПеня(ПараметрыОтчета, ТабличныйДокумент);
		ИначеЕсли ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный
			ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Основной
			 ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСтр2
			 ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСПеняСтр2 Тогда
			ЗаполнитьМакетПолный(ПараметрыОтчета, ТабличныйДокумент);
		КонецЕсли;
		
	КонецЕсли;
	// БИТ_ЖКХ 15.03.2017 11:07:14 Конец правки. 
	
	ПоместитьВоВременноеХранилище(ТабличныйДокумент, АдресХранилища);
	
КонецПроцедуры // ()

// Процедура заполнения макета выписки.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьМакетВыписки(ПараметрыОтчета, ТабличныйДокумент)
	
	ТабличныйДокумент.Очистить();
	
	СведенияОбЛС = ПолучитьСведенияОбЛицевомСчете(ПараметрыОтчета);
	
	Если СведенияОбЛС = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КоличествоПроживающих = 0;
	
	ТаблицаПроживающих    = ПолучитьТаблицуПроживающих(КонецДня(ПараметрыОтчета.КонецПериода), ПараметрыОтчета.ЛицевойСчет);
	
	// БИТ_ЖКХ 18.07.2014
	// КоличествоПроживающих = ТаблицаПроживающих.Количество();.
	Для каждого СтрокаПроживающий из ТаблицаПроживающих Цикл 
		
		Если СтрокаПроживающий.СтатусФизЛица.ПроживаниеВДанныйМомент Тогда
			КоличествоПроживающих = КоличествоПроживающих + 1;
		КонецЕсли; 
		
	КонецЦикла;
	// БИТ_ЖКХ 18.07.2014	
	
	Макет = ПолучитьМакет("МакетВыписка");
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог         = Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	ТаблицаРасчетов.Колонки.Добавить("Услуга");
	ТаблицаРасчетов.Колонки.Добавить("Объем");
	ТаблицаРасчетов.Колонки.Добавить("Тариф");
	ТаблицаРасчетов.Колонки.Добавить("БезЛьгот");
	ТаблицаРасчетов.Колонки.Добавить("СУчетомЛьгот");
	ТаблицаРасчетов.Колонки.Добавить("Льготы");
	ТаблицаРасчетов.Колонки.Добавить("ЕдИзм");
	ТаблицаРасчетов.Колонки.Добавить("Площадь");
	ТаблицаРасчетов.Колонки.Добавить("ОсновнаяСтавка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("СписокУслуг"  , СведенияОбЛС.СписокУслуг);
	Запрос.Текст = ПолучитьТекстЗапросаВыписка_Список();
	
	Результат = Запрос.Выполнить();
	ВыборкаЛС = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВхСальдо     = 0;
	ИсхСальдо    = 0;
	Оплата       = 0;
	Разовые      = 0;
	Льгота       = 0;
	БезЛьгот     = 0;
	СУчетомЛьгот = 0;
	
	Если ВыборкаЛС.Следующий() Тогда
		
		Льгота    = ВыборкаЛС.Льгота;
		Оплата    = ВыборкаЛС.Оплата;
		Разовые   = ВыборкаЛС.Разовые;
		ВхСальдо  = ВыборкаЛС.ВхСальдо;
		ИсхСальдо = ВыборкаЛС.ИсхСальдо;
		
		Выборка = ВыборкаЛС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ПараметрыОтчета.ВыводитьВсеУслугиВСправку Тогда
				
				Если (ПараметрыОтчета.ЗаполненоГЦЖС И Выборка.ГрафаОтчетаГЦЖС.Пустая())
					ИЛИ (НЕ ПараметрыОтчета.ЗаполненоГЦЖС И Выборка.Начислено = 0) Тогда
					Продолжить;
				КонецЕсли; 
				
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.Услуга         = Выборка.Услуга;
			НоваяСтрока.Объем          = Выборка.Объем;
			НоваяСтрока.Тариф          = Выборка.Тариф; 
			НоваяСтрока.БезЛьгот       = Выборка.Начислено;
			НоваяСтрока.СУчетомЛьгот   = Выборка.Начислено  - Выборка.Льгота;
			НоваяСтрока.Льготы         = Выборка.Льгота;
			НоваяСтрока.ЕдИзм          = Выборка.ЕдИзм;
			НоваяСтрока.ОсновнаяСтавка = Выборка.ОсновнаяСтавка;
			
			Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
				НоваяСтрока.Площадь = СведенияОбЛС.ОбщаяПлощадь;
			ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
				НоваяСтрока.Площадь = СведенияОбЛС.ЖилаяПлощадь;
			ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади Тогда
				НоваяСтрока.Площадь = СведенияОбЛС.ОтапливаемаяПлощадь;
			КонецЕсли; 
			
			БезЛьгот     = БезЛьгот     + НоваяСтрока.БезЛьгот;
			СУчетомЛьгот = СУчетомЛьгот + НоваяСтрока.СУчетомЛьгот;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ИтогЛьготыСтр     = Формат(Льгота      , "Л=ru; ЧДЦ=2; ЧН=0,00; ЧГ=3,0") + " руб.";
	ИтогоБезЛьготСтр  = Формат(БезЛьгот    , "Л=ru; ЧДЦ=2; ЧН=0,00; ЧГ=3,0") + " руб.";
	ИтогСоЛьготамиСтр = Формат(СУчетомЛьгот, "Л=ru; ЧДЦ=2; ЧН=0,00; ЧГ=3,0") + " руб.";
	
	// Вывод Шапки отчета.
	ОбластьШапка.Параметры.Отвественный = Строка(СведенияОбЛС.Ответственный);
	
	АдресЛС = Строка(СведенияОбЛС.Улица) + ", дом "+ Строка(СведенияОбЛС.Здание)
	+ ?(ЗначениеЗаполнено(СведенияОбЛС.Корпус),", корп." + Строка(СведенияОбЛС.Корпус),"");
	
	Если ПараметрыОтчета.ВыводитьПочтовыйАдрес И ЗначениеЗаполнено(СведенияОбЛС.ПочтовыйАдрес) Тогда
		АдресЛС = СведенияОбЛС.ПочтовыйАдрес;
	Иначе

	КонецЕсли;
	
	ОбластьШапка.Параметры.АдресЛС      = "" + АдресЛС + ?(ЗначениеЗаполнено(СведенияОбЛС.Квартира),", кв." + Строка(СведенияОбЛС.Квартира),"");
	ОбластьШапка.Параметры.ЛицевойСчет  = СведенияОбЛС.НаименованиеЛС;
	ОбластьШапка.Параметры.ЖилаяПлощадь = СведенияОбЛС.ЖилаяПлощадь;
	ОбластьШапка.Параметры.ОбщаяПлощадь = СведенияОбЛС.ОбщаяПлощадь;
	
	ОбластьШапка.Параметры.КоличествоПроживающих = КоличествоПроживающих;
	
	ОбластьШапка.Параметры.СуммаОплаты = ИтогСоЛьготамиСтр + "  "+Формат(ПараметрыОтчета.НачалоПериода,"ДФ='""(на"" MMMM yyyy""г.)""'");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	// Вывод строк отчета.
	Для каждого СтрокаТаблицы Из ТаблицаРасчетов Цикл
		
		ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
		
		Если СтрокаТаблицы.Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Эксплуатационная тогда
			ОбластьСтрока.Параметры.Объем_ЕдИзм = Строка(СтрокаТаблицы.Площадь) + " " + Строка(СтрокаТаблицы.ЕдИзм);
			ОбластьСтрока.Параметры.Тариф       = СтрокаТаблицы.ОсновнаяСтавка;
		иначе                                     
			ОбластьСтрока.Параметры.Объем_ЕдИзм = Строка(СтрокаТаблицы.Объем) + " " + Строка(СтрокаТаблицы.ЕдИзм);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	// Вывод итога.
	ОбластьИтог.Параметры.ИтогоБезЛьгот  = БезЛьгот;
	ОбластьИтог.Параметры.ИтогСоЛьготами = СУчетомЛьгот;
	
	ТабличныйДокумент.Вывести(ОбластьИтог);
	
	// Вывод подвала.
	ВХСальдо = ВХСальдо - Оплата - Разовые;
	
	Если ВХСальдо <= 0 тогда
		ВХСальдоСтр = "Задолженности нет"; 
	Иначе
		ВХСальдоСтр = Формат(ВХСальдо, "Л=ru; ЧДЦ=2; ЧГ=3,0") + " руб."; 
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ВХСальдо = ВХСальдоСтр;
	
	ОбластьПодвал.Параметры.Организация = Строка(ПараметрыОтчета.ЛицевойСчет.Организация);
	ОбластьПодвал.Параметры.Дата = Формат(ПараметрыОтчета.Период,"ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры // () 

// Процедура заполнения макета справки.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьМакетСправки(ПараметрыОтчета, ТабличныйДокумент, ИмяМакета = "")
	
	ТабличныйДокумент.Очистить();
	
	СведенияОбЛС = ПолучитьСведенияОбЛицевомСчете(ПараметрыОтчета);
	
	Если СведенияОбЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоПроживающих = 0;
	
	ТаблицаПроживающих    = ПолучитьТаблицуПроживающих(КонецДня(ПараметрыОтчета.КонецПериода), ПараметрыОтчета.ЛицевойСчет);
	
	// БИТ_ЖКХ 18.07.2014
	// КоличествоПроживающих = ТаблицаПроживающих.Количество();.
	Для каждого СтрокаПроживающий из ТаблицаПроживающих Цикл 
		
		Если СтрокаПроживающий.СтатусФизЛица.ПроживаниеВДанныйМомент Тогда
			КоличествоПроживающих = КоличествоПроживающих + 1;
		КонецЕсли; 
		
	КонецЦикла;
	// БИТ_ЖКХ 18.07.2014	
	
	если ИмяМакета = "" тогда 
	 Макет = ПолучитьМакет("МакетСправки");
    иначе 
	 Макет = ПолучитьМакет(ИмяМакета);
	конецесли; 
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог         = Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	ТаблицаРасчетов.Колонки.Добавить("Услуга");
	ТаблицаРасчетов.Колонки.Добавить("Объем");
	ТаблицаРасчетов.Колонки.Добавить("Тариф");
	ТаблицаРасчетов.Колонки.Добавить("БезЛьгот");
	ТаблицаРасчетов.Колонки.Добавить("СУчетомЛьгот");
	ТаблицаРасчетов.Колонки.Добавить("Льготы");
	ТаблицаРасчетов.Колонки.Добавить("ЕдИзм");
	ТаблицаРасчетов.Колонки.Добавить("Площадь");
	ТаблицаРасчетов.Колонки.Добавить("ОсновнаяСтавка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("СписокУслуг"  , СведенияОбЛС.СписокУслуг);
	Запрос.Текст = ПолучитьТекстЗапросаВыписка_Список();
	
	Результат = Запрос.Выполнить();
	ВыборкаЛС = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВхСальдо     = 0;
	ИсхСальдо    = 0;
	Оплата       = 0;
	Разовые      = 0;
	Льгота       = 0;
	БезЛьгот     = 0;
	СУчетомЛьгот = 0;
	
	Если ВыборкаЛС.Следующий() Тогда
		
		Льгота    = ВыборкаЛС.Льгота;
		Оплата    = ВыборкаЛС.Оплата;
		Разовые   = ВыборкаЛС.Разовые;
		ВхСальдо  = ВыборкаЛС.ВхСальдо;
		ИсхСальдо = ВыборкаЛС.ИсхСальдо;
		
		Выборка = ВыборкаЛС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ПараметрыОтчета.ВыводитьВсеУслугиВСправку Тогда
				
				Если (ПараметрыОтчета.ЗаполненоГЦЖС И Выборка.ГрафаОтчетаГЦЖС.Пустая())
					ИЛИ (НЕ ПараметрыОтчета.ЗаполненоГЦЖС И Выборка.Начислено = 0) Тогда
					Продолжить;
				КонецЕсли; 
				
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.Услуга         = Выборка.Услуга;
			НоваяСтрока.Объем          = Выборка.Объем;
			НоваяСтрока.Тариф          = Выборка.Тариф; 
			НоваяСтрока.БезЛьгот       = Выборка.Начислено;
			НоваяСтрока.СУчетомЛьгот   = Выборка.Начислено  - Выборка.Льгота;
			НоваяСтрока.Льготы         = Выборка.Льгота;
			НоваяСтрока.ЕдИзм          = Выборка.ЕдИзм;
			НоваяСтрока.ОсновнаяСтавка = Выборка.ОсновнаяСтавка;
			
			Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
				НоваяСтрока.Площадь = СведенияОбЛС.ОбщаяПлощадь;
			ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
				НоваяСтрока.Площадь = СведенияОбЛС.ЖилаяПлощадь;
			ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади Тогда
				НоваяСтрока.Площадь = СведенияОбЛС.ОтапливаемаяПлощадь;
			КонецЕсли; 
			
			БезЛьгот     = БезЛьгот     + НоваяСтрока.БезЛьгот;
			СУчетомЛьгот = СУчетомЛьгот + НоваяСтрока.СУчетомЛьгот;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ИтогЛьготыСтр     = Формат(Льгота      , "Л=ru; ЧДЦ=2; ЧН=0,00; ЧГ=3,0") + " руб.";
	ИтогоБезЛьготСтр  = Формат(БезЛьгот    , "Л=ru; ЧДЦ=2; ЧН=0,00; ЧГ=3,0") + " руб.";
	ИтогСоЛьготамиСтр = Формат(СУчетомЛьгот, "Л=ru; ЧДЦ=2; ЧН=0,00; ЧГ=3,0") + " руб.";
	
	// Вывод Шапки отчета.
	ОбластьШапка.Параметры.Отвественный = Строка(СведенияОбЛС.Ответственный) + " - " + СведенияОбЛС.НаименованиеЛС;
	
	АдресЛС = Строка(СведенияОбЛС.Улица) + ", дом "+ Строка(СведенияОбЛС.Здание)
	+ ?(ЗначениеЗаполнено(СведенияОбЛС.Корпус),", корп." + Строка(СведенияОбЛС.Корпус),"");
	
	Если ПараметрыОтчета.ВыводитьПочтовыйАдрес И ЗначениеЗаполнено(СведенияОбЛС.ПочтовыйАдрес) Тогда
		АдресЛС = СведенияОбЛС.ПочтовыйАдрес;
	Иначе

	КонецЕсли;
	
	ОбластьШапка.Параметры.АдресЛС      = "" + АдресЛС + ?(ЗначениеЗаполнено(СведенияОбЛС.Квартира),", кв." + Строка(СведенияОбЛС.Квартира),"");
	ОбластьШапка.Параметры.ЛицевойСчет  = СведенияОбЛС.НаименованиеЛС;
	ОбластьШапка.Параметры.ЖилаяПлощадь = СведенияОбЛС.ЖилаяПлощадь;
	ОбластьШапка.Параметры.ОбщаяПлощадь = СведенияОбЛС.ОбщаяПлощадь;
	
	ОбластьШапка.Параметры.КоличествоПроживающих = КоличествоПроживающих;
	
	ОбластьШапка.Параметры.СуммаОплаты = ИтогСоЛьготамиСтр + "  "+Формат(ПараметрыОтчета.НачалоПериода,"ДФ='""(на"" MMMM yyyy""г.)""'");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	// Вывод строк отчета.
	Для каждого СтрокаТаблицы Из ТаблицаРасчетов Цикл
		
		ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
		
		Если СтрокаТаблицы.Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Эксплуатационная тогда
			ОбластьСтрока.Параметры.Объем_ЕдИзм = Строка(СтрокаТаблицы.Площадь) + " " + Строка(СтрокаТаблицы.ЕдИзм);
			ОбластьСтрока.Параметры.Тариф       = СтрокаТаблицы.ОсновнаяСтавка;
		иначе                                     
			ОбластьСтрока.Параметры.Объем_ЕдИзм = Строка(СтрокаТаблицы.Объем) + " " + Строка(СтрокаТаблицы.ЕдИзм);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	// Вывод итога.
	ОбластьИтог.Параметры.ИтогоБезЛьгот  = БезЛьгот;
	ОбластьИтог.Параметры.ИтогСоЛьготами = СУчетомЛьгот;
	
	ТабличныйДокумент.Вывести(ОбластьИтог);
	
	// Вывод подвала.
	ВХСальдо = ВХСальдо - Оплата - Разовые;
	
	Если ВХСальдо <= 0 тогда
		ВХСальдоСтр = "Задолженности нет"; 
	Иначе
		ВХСальдоСтр = Формат(ВХСальдо, "Л=ru; ЧДЦ=2; ЧГ=3,0") + " руб."; 
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ВХСальдо                 = ВХСальдоСтр;
	ОбластьПодвал.Параметры.ТипЗапирающегоУстройства = СведенияОбЛС.ТипЗапирающегоУстройства;
	ОбластьПодвал.Параметры.ИтогоБезЛьгот            = ИтогоБезЛьготСтр;
	ОбластьПодвал.Параметры.ИтогЛьготы               = ИтогЛьготыСтр;
	ОбластьПодвал.Параметры.СтатусКвартиры           = ВРег(Строка(СведенияОбЛС.СтатусКвартиры));
	
	ОбластьПодвал.Параметры.Организация = Строка(ПараметрыОтчета.ЛицевойСчет.Организация);
	ОбластьПодвал.Параметры.Дата = Формат(ПараметрыОтчета.Период,"ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры // () 

// Процедура заполняет макет остатки.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьМакетОстатки(ПараметрыОтчета, ТабличныйДокумент)
	
	ТабличныйДокумент.Очистить();
	
	СведенияОбЛС = ПолучитьСведенияОбЛицевомСчете(ПараметрыОтчета);
	
	Если СведенияОбЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("ФинансовоЛицевойСчет_Остатки");
	
	ПодвалОборот        = Макет.ПолучитьОбласть("ПодвалОборот");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	СтрокаМесяцГод      = Макет.ПолучитьОбласть("СтрокаМесяцГод");
	СтрокаМесяцГодКол   = Макет.ПолучитьОбласть("СтрокаМесяцГодКол");
	ШапкаУслуги         = Макет.ПолучитьОбласть("ШапкаУслуги");
	ШапкаУслуга         = Макет.ПолучитьОбласть("ШапкаУслуга");
	ШапкаУслуг          = Макет.ПолучитьОбласть("ШапкаУслуг");
	СтрокаУслуга        = Макет.ПолучитьОбласть("СтрокаУслуга");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"  , ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"   , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"    , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("ТаблицаОстатков", ПолучитьТаблицуОстатков(ПараметрыОтчета));
	Запрос.Текст = ПолучитьТекстЗапросаОстатки();
	
	ОбластьШапка.Параметры.НомерЛС       = СведенияОбЛС.ЛицевойСчет;
	ОбластьШапка.Параметры.Организация   = СведенияОбЛС.Организация;
	// БИТ_ЖКХ_05082013_начало_изменений
	// ОбластьШапка.Параметры.Улица         = СведенияОбЛС.Улица;. 
	Если ПараметрыОтчета.ВыводитьПочтовыйАдрес Тогда
		Если ЗначениеЗаполнено(ПараметрыОтчета.ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
			АдресСтруктура = бит_ПаспортныйСтолСервер.ПолучитьСтруктуруАдресаИзКонтактнойИнформации(ПараметрыОтчета.ЛицевойСчет.Здание,
			Перечисления.бит_ТипыКонтактнойИнформации.Адрес,Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
			АдресЛС = ?(ЗначениеЗаполнено(АдресСтруктура.Индекс),АдресСтруктура.Индекс + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Регион),АдресСтруктура.Регион + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Район),АдресСтруктура.Район + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Город),АдресСтруктура.Город + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.НасПункт),АдресСтруктура.НасПункт + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Улица),АдресСтруктура.Улица, "");			
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните почтовый адрес у здания");
			
			АдресЛС = Строка(ПараметрыОтчета.ЛицевойСчет.УлицаЛицевогоСчета);			
		КонецЕсли;
	Иначе
		АдресЛС = Строка(ПараметрыОтчета.ЛицевойСчет.УлицаЛицевогоСчета);
	КонецЕсли;
	ОбластьШапка.Параметры.Улица         = АдресЛС;
	// БИТ_ЖКХ_05082013_окончание_изменений
	ОбластьШапка.Параметры.Дом           = СведенияОбЛС.Здание;
	ОбластьШапка.Параметры.Квартира      = СведенияОбЛС.Квартира;
	ОбластьШапка.Параметры.Корпус        = СведенияОбЛС.Корпус;
	ОбластьШапка.Параметры.Этаж          = СведенияОбЛС.Этаж;
	ОбластьШапка.Параметры.ДД            = Формат(ПараметрыОтчета.КонецПериода,"ДФ=dd");
	ОбластьШапка.Параметры.месяц         = Формат(ПараметрыОтчета.КонецПериода,"ДФ=ММMM");
	ОбластьШапка.Параметры.ГГГГ          = Формат(ПараметрыОтчета.КонецПериода,"ДФ=yyyy");
	ОбластьШапка.Параметры.Ответственный = СведенияОбЛС.Ответственный;
	ОбластьШапка.Параметры.Телефон       = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(СведенияОбЛС.Ответственный);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаУслуга = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга");
	// БИТ_ЖКХ_05082013_начало_изменений
	ТаблицаУслуг = Результат.Выгрузить();
	// БИТ_ЖКХ_05082013_окончание_изменений
	ТабличныйДокумент.Вывести(ШапкаУслуги);
	
	СписокУслуг = Новый Массив;
	
	Пока ВыборкаУслуга.Следующий() Цикл
		
		// БИТ_ЖКХ_05082013_начало_изменений
		ОтборУслуг = Новый Структура("Услуга",ВыборкаУслуга.Услуга);
		МассивУслуг = ТаблицаУслуг.НайтиСтроки(ОтборУслуг);
		ВыводитьУслугу = Ложь;
		Для Каждого ЭлементМассива Из МассивУслуг Цикл
			Если ЭлементМассива.Сумма <> 0 Тогда
				ВыводитьУслугу = Истина;
			КонецЕсли;
		КонецЦикла;

		Если ВыводитьУслугу Тогда
			// БИТ_ЖКХ_05082013_окончание_изменений
			
			ШапкаУслуга.Параметры.Заполнить(ВыборкаУслуга);
			ТабличныйДокумент.Присоединить(ШапкаУслуга );
			
			СписокУслуг.Добавить(ВыборкаУслуга.Услуга);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ТабличныйДокумент.Присоединить(ШапкаУслуг);
	
	ВыборкаМесяцГод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМесяцГод.Следующий() Цикл
		
		ИсхСальдо = ?(ПараметрыОтчета.СУчетомПереплаты, ВыборкаМесяцГод.ИсхСальдо, ВыборкаМесяцГод.КОплате);
		
		Если НЕ ЗначениеЗаполнено(ВыборкаМесяцГод.Сумма) И НЕ ЗначениеЗаполнено(ВыборкаМесяцГод.Оплата) Тогда
			Продолжить;
		КонецЕсли; 
		
		ТаблицаПроживающих = ПолучитьТаблицуПроживающих(КонецМесяца(Дата(ВыборкаМесяцГод.МесяцГод)), ПараметрыОтчета.ЛицевойСчет);
		Ответственный         = Справочники.бит_Проживающие.ПустаяСсылка();
		КоличествоПроживающих = 0;
		
		Для каждого СтрокаТабилцы Из ТаблицаПроживающих Цикл
			
			Если СтрокаТабилцы.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
				Ответственный = СтрокаТабилцы.ФизЛицо;
			КонецЕсли; 
			
			Если СтрокаТабилцы.СтатусФизЛица.ПроживаниеВДанныйМомент Тогда
				КоличествоПроживающих = КоличествоПроживающих + 1;
			КонецЕсли; 
			
		КонецЦикла; 
		
		СтрокаМесяцГод.Параметры.Заполнить(ВыборкаМесяцГод);
		СтрокаМесяцГод.Параметры.Ответственный = Ответственный;
		ТабличныйДокумент.Вывести(СтрокаМесяцГод,ВыборкаМесяцГод.Уровень(), "МесяцГод");
		
		ВыборкаУслуга = ВыборкаМесяцГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга", "ВСЕ");
		
		Пока ВыборкаУслуга.Следующий() Цикл
			
			Если НЕ СписокУслуг.Найти(ВыборкаУслуга.Услуга) = Неопределено Тогда
				
				СтрокаУслуга.Параметры.Заполнить(ВыборкаУслуга);
				
				ТабличныйДокумент.Присоединить(СтрокаУслуга);
				
			КонецЕсли;
			
		КонецЦикла;
		СтрокаМесяцГодКол.Параметры.Заполнить(ВыборкаМесяцГод);
		СтрокаМесяцГодКол.Параметры.Начислено  = ВыборкаМесяцГод.Сумма;
		СтрокаМесяцГодКол.Параметры.Количество = КоличествоПроживающих;
		ТабличныйДокумент.Присоединить(СтрокаМесяцГодКол);
		
	КонецЦикла;
	
	ПодвалОборот.Параметры.ДатаФормОтчета = Формат(ПараметрыОтчета.КонецПериода,"ДФ=dd.MM.yyyy");
	ПодвалОборот.Параметры.Сумма = ИсхСальдо;
	
	// Kordo-sysoev 17.01.2014 
	ОтветственныеЛица = бит_ОбщегоНазначения.бит_ОтветственныеЛица(СведенияОбЛС.Организация, КонецДня(ПараметрыОтчета.КонецПериода));
	ПодвалОборот.Параметры.РуководительРасчетнойСлужбы = ?(ОтветственныеЛица.РуководительРасчетнойСлужбы = Неопределено, "",ОтветственныеЛица.РуководительРасчетнойСлужбы);
	ПодвалОборот.Параметры.Специалист = ?(ОтветственныеЛица.Специалист = Неопределено, "",ОтветственныеЛица.Специалист);
	ПодвалОборот.Параметры.РуководительРасчетнойСлужбыДолжность = ?(ОтветственныеЛица.РуководительРасчетнойСлужбыДолжность = Неопределено, "Руководитель расчетной службы",ОтветственныеЛица.РуководительРасчетнойСлужбыДолжность);
	ПодвалОборот.Параметры.СпециалистДолжность   = ?(ОтветственныеЛица.СпециалистДолжность = Неопределено, "Специалист",ОтветственныеЛица.СпециалистДолжность);
	// Kordo-sysoev 17.01.2014
	
	ТабличныйДокумент.Вывести(ПодвалОборот);
	
КонецПроцедуры // () 

// Процедура заполняет полный макет.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьМакетПолный(ПараметрыОтчета, ТабличныйДокумент)
	
	ТабличныйДокумент.Очистить();
	
	СведенияОбЛС = ПолучитьСведенияОбЛицевомСчете(ПараметрыОтчета);
	
	Если СведенияОбЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный
		ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Основной Тогда
		
		ПолныйСтраница1(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС);
		
	КонецЕсли;
	
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли; 
	
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный
		ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСтр2 Тогда
		
		ПолныйСтраница2(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС);
		
	КонецЕсли; 
	
	//29.08.2019
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСПеня
		ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСПеняСтр2 Тогда
		
		ПолныйСтраница2СПеня(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС);
		
	КонецЕсли; 

	
КонецПроцедуры // ()

//28.08.2019
// Процедура заполняет полный макет.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьМакетПолныйСПеня(ПараметрыОтчета, ТабличныйДокумент)
	
	ТабличныйДокумент.Очистить();
	
	СведенияОбЛС = ПолучитьСведенияОбЛицевомСчете(ПараметрыОтчета);
	
	Если СведенияОбЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный
		ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Основной Тогда
		
		ПолныйСтраница1(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС);
		
	КонецЕсли;
	
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли; 
	
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный
		ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСтр2 Тогда
		
		ПолныйСтраница2(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС);
		
	КонецЕсли; 
	
	//29.08.2019
	Если ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСПеня
		ИЛИ ПараметрыОтчета.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.ПолныйСПеняСтр2 Тогда
		
		ПолныйСтраница2СПеня(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС);
		
	КонецЕсли; 

	
КонецПроцедуры // ()


// Процедура заполняет страницу 1.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ПолныйСтраница1(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС)
	
	Макет = ПолучитьМакет("ФинансовоЛицевойСчет");
	
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслуги       = Макет.ПолучитьОбласть("ОбластьУслуги");
	ОбластьУслугиПустая	= Макет.ПолучитьОбласть("ОбластьУслугиПустая");
	ОбластьХарКвартиры  = Макет.ПолучитьОбласть("ОбластьХарКвартиры");
	ОбластьКомнаты      = Макет.ПолучитьОбласть("ОбластьКомнаты");
	
	ОбластьШапка.Параметры.НомерЛС       = СведенияОбЛС.ЛицевойСчет;
	ОбластьШапка.Параметры.Организация   = СведенияОбЛС.Организация;
	// БИТ_ЖКХ_05082013_начало_изменений
	// ОбластьШапка.Параметры.Улица         = СведенияОбЛС.Улица;.
	Если ПараметрыОтчета.ВыводитьПочтовыйАдрес Тогда
		Если ЗначениеЗаполнено(ПараметрыОтчета.ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
			АдресСтруктура = бит_ПаспортныйСтолСервер.ПолучитьСтруктуруАдресаИзКонтактнойИнформации(ПараметрыОтчета.ЛицевойСчет.Здание,
			Перечисления.бит_ТипыКонтактнойИнформации.Адрес,Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
			АдресЛС = ?(ЗначениеЗаполнено(АдресСтруктура.Индекс),АдресСтруктура.Индекс + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Регион),АдресСтруктура.Регион + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Район),АдресСтруктура.Район + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Город),АдресСтруктура.Город + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.НасПункт),АдресСтруктура.НасПункт + ", ","")
			+ ?(ЗначениеЗаполнено(АдресСтруктура.Улица),АдресСтруктура.Улица, "");			
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните почтовый адрес у здания");
			
			АдресЛС = Строка(ПараметрыОтчета.ЛицевойСчет.УлицаЛицевогоСчета);			
		КонецЕсли;
	Иначе
		АдресЛС = Строка(ПараметрыОтчета.ЛицевойСчет.УлицаЛицевогоСчета);
	КонецЕсли;
	ОбластьШапка.Параметры.Улица         = АдресЛС;
	// БИТ_ЖКХ_05082013_окончание_изменений
	ОбластьШапка.Параметры.Дом           = СведенияОбЛС.Здание;
	ОбластьШапка.Параметры.Квартира      = СведенияОбЛС.Квартира;
	ОбластьШапка.Параметры.Корпус        = СведенияОбЛС.Корпус;
	ОбластьШапка.Параметры.Этаж          = СведенияОбЛС.Этаж;
	ОбластьШапка.Параметры.ДД            = Формат(ПараметрыОтчета.КонецПериода,"ДФ=dd");
	ОбластьШапка.Параметры.месяц         = Формат(ПараметрыОтчета.КонецПериода,"ДФ=ММMM");
	ОбластьШапка.Параметры.ГГГГ          = Формат(ПараметрыОтчета.КонецПериода,"ДФ=yyyy");
	ОбластьШапка.Параметры.Ответственный = СведенияОбЛС.Ответственный;
	ОбластьШапка.Параметры.Телефон       = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(СведенияОбЛС.Ответственный);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Правоустанавливающие документы.
	ТаблицаСписокДокументов = ПолучитьТаблицуПравоустанавливающихДокументов(КонецДня(ПараметрыОтчета.КонецПериода), ПараметрыОтчета.ЛицевойСчет);
	
	// Сведения о комнатах квартиры.
	ТаблицаКомнат =  ПолучитьТаблицуКомнат(КонецДня(ПараметрыОтчета.КонецПериода), СведенияОбЛС.Квартира);
	
	ПлощадьКухни = 0;
	
	Для каждого СтрокаКухня Из ТаблицаКомнат Цикл
		
		Если СтрокаКухня.Комната = Справочники.бит_НазначениеЧастейПомещения.Кухня Тогда
			ПлощадьКухни = ПлощадьКухни + СтрокаКухня.ПлощадьКомнаты;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураПлощадьКухни = Новый Структура;
	СтруктураПлощадьКухни.Вставить("ПлощадьКухни",ПлощадьКухни);
	
	мНомерСтроки = 7;
	
	Индекс       = 0;
	ИндексКомнат = 0;
	
	ТаблицаПроживающих    = ПолучитьТаблицуПроживающих(КонецДня(ПараметрыОтчета.КонецПериода), ПараметрыОтчета.ЛицевойСчет);
	КоличествоПроживающих = 0;
	
	// БИТ_ЖКХ 18.07.2014
	// КоличествоПроживающих = ТаблицаПроживающих.Количество();.
	Для каждого СтрокаПроживающий из ТаблицаПроживающих Цикл 
		
		Если СтрокаПроживающий.СтатусФизЛица.ПроживаниеВДанныйМомент Тогда
			КоличествоПроживающих = КоличествоПроживающих + 1;
		КонецЕсли; 
		
	КонецЦикла;
	// БИТ_ЖКХ 18.07.2014	
	
	Для каждого СтрокаТаблицы Из СведенияОбЛС.СписокУслуг Цикл
		
		Если СтрокаТаблицы.РежимПотребления = Справочники.бит_РежимыПотребленияУслуг.Нет Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыОтчета.ЗаполненоГЦЖС И СтрокаТаблицы.ГрафаОтчетаГЦЖС.Пустая() Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Индекс < 16 Тогда
			Индекс = Индекс + 1;
			ОбластьУслуги.Параметры.Заполнить(СтрокаТаблицы);
			ТабличныйДокумент.Вывести(ОбластьУслуги);  
			
			Секция = Макет.ПолучитьОбласть("R"+мНомерСтроки+"C36:R"+мНомерСтроки+"C69");
			Секция.Параметры.Заполнить(СведенияОбЛС);
			
			Если Индекс > 7 Тогда                                 
				Если ТаблицаКомнат.Количество()> 0 И ИндексКомнат < ТаблицаКомнат.Количество() Тогда
					Если ТаблицаКомнат[Индекс - 8].Комната <> Справочники.бит_НазначениеЧастейПомещения.Кухня  Тогда
						
						Попытка	
							Секция.Параметры.НомерКомнаты = ИндексКомнат+1;
							Секция.Параметры.Заполнить(ТаблицаКомнат[Индекс - 8]);
						Исключение
						КонецПопытки;	
					КонецЕсли; 
					
					ИндексКомнат = ИндексКомнат + 1;
				КонецЕсли; 
				
			КонецЕсли;
			
			Попытка
				Секция.Параметры.КоличествоПроживающих = КоличествоПроживающих;
			Исключение
			КонецПопытки; 
			
			ТабличныйДокумент.Присоединить(Секция);
			
			ТабличныйДокумент.Присоединить(Секция);
			
		КонецЕсли;
		
		мНомерСтроки = мНомерСтроки + 1;
		
	КонецЦикла;
	
	Пока мНомерСтроки < 22 Цикл 
		
		ТабличныйДокумент.Вывести(ОбластьУслугиПустая);
		Секция = Макет.ПолучитьОбласть("R"+мНомерСтроки+"C36:R"+мНомерСтроки+"C69");
		Секция.Параметры.Заполнить(СведенияОбЛС);
		
		Индекс = Индекс + 1;
		
		Если Индекс > 7 Тогда                                 
			Если ТаблицаКомнат.Количество()> 0 И ИндексКомнат < ТаблицаКомнат.Количество() Тогда
				Если ТаблицаКомнат[Индекс - 8].Комната <> Справочники.бит_НазначениеЧастейПомещения.Кухня  Тогда
					
					Попытка
						Секция.Параметры.НомерКомнаты = ИндексКомнат+1;
						Секция.Параметры.Заполнить(ТаблицаКомнат[Индекс - 8]);
					Исключение
						
					КонецПопытки;
				КонецЕсли; 
				
				ИндексКомнат = ИндексКомнат + 1;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			Секция.Параметры.КоличествоПроживающих = КоличествоПроживающих;
		Исключение
		КонецПопытки;
		Секция.Параметры.Заполнить(СтруктураПлощадьКухни);
		ТабличныйДокумент.Присоединить(Секция);
		мНомерСтроки = мНомерСтроки + 1;
		
	КонецЦикла;
	
	// Формирование блока - заполнение документов-оснований, до 6 док-тов.
	Секция = Макет.ПолучитьОбласть("R7C70:R7C103");
	ТабличныйДокумент.ВставитьОбласть(Секция.Область(), ТабличныйДокумент.Область("R7C70:R7C103"),,Истина);
	
	СчетчикСтрок = 8;
	
	Если ТаблицаСписокДокументов.Количество()>0 Тогда
		// Формирование строк с данными документов.
		Для каждого СтрокаДокументов Из ТаблицаСписокДокументов Цикл
			Адрес 	= Строка("R" + СчетчикСтрок + "C70:R" + (СчетчикСтрок+1) + "C103");
			Секция 	= Макет.ПолучитьОбласть(Адрес);
			Секция.Параметры.Заполнить(СтрокаДокументов);
			Секция.Параметры.ДатаДокумента = Формат(СтрокаДокументов.ДатаДокумента,"ДФ=dd.MM.yy");
			Если ЗначениеЗаполнено(СтрокаДокументов.ОрганизацияВыдавшаяДокумент.НаименованиеПолное) Тогда
				Секция.Параметры.ОрганизацияВыдавшаяДокумент =  СтрокаДокументов.ОрганизацияВыдавшаяДокумент.НаименованиеПолное;
			КонецЕсли; 
			ТабличныйДокумент.ВставитьОбласть(Секция.Область(), ТабличныйДокумент.Область(Адрес),,Истина);
			СчетчикСтрок  = СчетчикСтрок + 2;
		КонецЦикла;
	КонецЕсли;
	
	// Формирование строк в списке документов без данных.
	Если СчетчикСтрок < 20 Тогда
		Пока СчетчикСтрок < 20 Цикл
			Адрес = Строка("R" + СчетчикСтрок + "C70:R" + (СчетчикСтрок+1) + "C103");
			Секция = Макет.ПолучитьОбласть(Адрес);
			ТабличныйДокумент.ВставитьОбласть(Секция.Область(), ТабличныйДокумент.Область(Адрес),,Истина);
			СчетчикСтрок  = СчетчикСтрок + 2;
			
		КонецЦикла; 
	КонецЕсли;
	
	// Вывод строки после списка документов.
	Если СчетчикСтрок = 20 Тогда
		
		Секция = Макет.ПолучитьОбласть("R" + СчетчикСтрок + "C70:R" + СчетчикСтрок + "C103");
		ТабличныйДокумент.ВставитьОбласть(Секция.Область(), ТабличныйДокумент.Область("R" + СчетчикСтрок + "C70:R" + СчетчикСтрок + "C103"),,Ложь);
		
	КонецЕсли;
	
	ТаблицаПроживающихИстория = ПолучитьТаблицуПроживающих(КонецДня(ПараметрыОтчета.КонецПериода)
	, ПараметрыОтчета.ЛицевойСчет
	, ПараметрыОтчета.ИсторияПроживающих);
	
	ШапкаПровающие    = Макет.ПолучитьОбласть("ШапкаПровающие");
	СтрокаПроживающие = Макет.ПолучитьОбласть("СтрокаПроживающие");
	
	ТабличныйДокумент.Вывести(ШапкаПровающие);
	
	Для Каждого СтрокаТаблицы Из ТаблицаПроживающихИстория Цикл 
		
		СтрокаПроживающие.Параметры.Заполнить(СтрокаТаблицы);
		
		Если ПараметрыОтчета.СтатусФизЛица Тогда
			Если СтрокаТаблицы.СтатусФизЛица <> Справочники.бит_СтатусФизЛица.Выписан 
				И СтрокаТаблицы.СтатусФизЛица.ПроживаниеВДанныйМомент = Ложь Тогда
				
				СтрокаПроживающие.Параметры.ДатаСнятияСРегистрации = "бронь";
			Иначе
				СтрокаПроживающие.Параметры.ДатаСнятияСРегистрации =  Формат(СтрокаТаблицы.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy");
				
			КонецЕсли; 
			
		Иначе
			СтрокаПроживающие.Параметры.ДатаСнятияСРегистрации =  Формат(СтрокаТаблицы.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		СтрокаПроживающие.Параметры.ФИО = СтрокаТаблицы.ФизЛицо;
		
		// БИТ_ЖКХ 28.05.2014
		// ТабличныйДокумент.Вывести(СтрокаПроживающие);.
		
		Если НЕ ПараметрыОтчета.НеВыводитьНеПроживающих Тогда
			
			ТабличныйДокумент.Вывести(СтрокаПроживающие);
			
		Иначе
			
			Если НЕ СтрокаПроживающие.Параметры.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
				
				ТабличныйДокумент.Вывести(СтрокаПроживающие);
				
			КонецЕсли;
			
		КонецЕсли;
		// БИТ_ЖКХ 28.05.2014
		
	КонецЦикла;
	
	// Заполнения таблицы "Льготы".
	Если НЕ ПараметрыОтчета.СведенияОЛьготах Тогда
		
		ТаблицаЛьготников = ПолучитьТаблицуИнформацииОЛьготниках(КонецДня(ПараметрыОтчета.КонецПериода)
		, ПараметрыОтчета.ЛицевойСчет);
		
		ШапкаЛьготы   = Макет.ПолучитьОбласть("ШапкаЛьготы");
		СтрокаЛьготы  = Макет.ПолучитьОбласть("СтрокаЛьготы");
		
		ТабличныйДокумент.Вывести(ШапкаЛьготы);
		
		Для каждого СтрокаТаблицы Из ТаблицаЛьготников Цикл
			
			СтрокаЛьготы.Параметры.Заполнить(СтрокаТаблицы);
			СтрокаЛьготы.Параметры.ДокументНаЛьготу = ""+СтрокаТаблицы.ДокументНаЛьготу+Формат(СтрокаТаблицы.ДатаВыдачи,"ДФ=dd.MM.yyyy"); 
			
			ТабличныйДокумент.Вывести(СтрокаЛьготы);
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОтветственныеЛица = бит_ОбщегоНазначения.бит_ОтветственныеЛица(СведенияОбЛС.Организация, КонецДня(ПараметрыОтчета.КонецПериода));
	Подвал.Параметры.Руководитель = ОтветственныеЛица.Руководитель;
	Подвал.Параметры.Паспортист   = ОтветственныеЛица.Паспортист;
	
	// БИТ_ЖКХ_05082013_начало_изменений
	Подвал.Параметры.РуководительДолжность = ?(ОтветственныеЛица.РуководительДолжность = Неопределено, "Руководитель",ОтветственныеЛица.РуководительДолжность);
	Подвал.Параметры.ПаспортистДолжность   = ?(ОтветственныеЛица.ПаспортистДолжность = Неопределено, "Паспортист",ОтветственныеЛица.ПаспортистДолжность);
	// БИТ_ЖКХ_05082013_начало_изменений
	
	ТабличныйДокумент.Вывести(Подвал);
	
КонецПроцедуры // ()

// Процедура заполняет страницу 2.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ПолныйСтраница2(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС)
	
	Макет = ПолучитьМакет("ФинансовоЛицевойСчет");
	
	ШапкаОборот = Макет.ПолучитьОбласть("ШапкаОборот");
	ШапкаОборот.Параметры.НомерЛС      = СведенияОбЛС.ЛицевойСчет;
	ШапкаОборот.Параметры.Организация  = СведенияОбЛС.Организация;
	ШапкаОборот.Параметры.ДД    = Формат(ПараметрыОтчета.КонецПериода,"ДФ=dd");
	ШапкаОборот.Параметры.месяц = Формат(ПараметрыОтчета.КонецПериода,"ДФ=ММMM");
	ШапкаОборот.Параметры.ГГГГ  = Формат(ПараметрыОтчета.КонецПериода,"ДФ=yyyy");
	
	ТабличныйДокумент.Вывести(ШапкаОборот);
	
	ШапкаУслуги         = Макет.ПолучитьОбласть("ШапкаУслуги");
	ШапкаУслуга         = Макет.ПолучитьОбласть("ШапкаУслуга");
	ШапкаУслуг          = Макет.ПолучитьОбласть("ШапкаУслг");
	СтрокаМесяцГод      = Макет.ПолучитьОбласть("СтрокаМесяцГод");
	СтрокаМесяцГодКол   = Макет.ПолучитьОбласть("СтрокаМесяцГодКол");
	СтрокаВидНачисления = Макет.ПолучитьОбласть("СтрокаВидНачисления");
	СтрокаУслугаВидНач  = Макет.ПолучитьОбласть("СтрокаУслугаВидНач");
	СтрокаУслуга        = Макет.ПолучитьОбласть("СтрокаУслуга");
	СтрокаВидНачКол     = Макет.ПолучитьОбласть("СтрокаВидНачКол");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ПараметрыОтчета.ЛицевойСчет);
	Запрос.Текст = ПолучитьТекстЗапросаПолный();
	
	Результат = Запрос.Выполнить(); 
	
	ТабличныйДокумент.Вывести(ШапкаУслуги);
	
	ВыборкаУслуга = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга");
	
	Пока ВыборкаУслуга.Следующий() Цикл
		
		ШапкаУслуга.Параметры.Заполнить(ВыборкаУслуга);
		ТабличныйДокумент.Присоединить(ШапкаУслуга );
		
	КонецЦикла;
	
	ТабличныйДокумент.Присоединить(ШапкаУслуг);
	
	ТаблицаОстатков = ПолучитьОстаткиПоПериодам(ПараметрыОтчета);
	
	ВыборкаМесяцГод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцГод");
	
	КОплате = 0;
	
	Пока ВыборкаМесяцГод.Следующий() Цикл
		
		СтрокаМесяцГод.Параметры.Заполнить(ВыборкаМесяцГод);
		
		Отбор = Новый Структура;
		СтрокаПоиска = ТаблицаОстатков.Найти(ВыборкаМесяцГод.МесяцГод, "МесяцГод");
		
		Если НЕ СтрокаПоиска = Неопределено Тогда
			ВХСальдо  = СтрокаПоиска.ВХСальдо;
			ИСХСальдо = СтрокаПоиска.ИСХСальдо;
		Иначе
			ВХСальдо  = 0;
			ИСХСальдо = 0;
		КонецЕсли; 
		
		Если ВыборкаМесяцГод.МесяцГод = НачалоМесяца(ПараметрыОтчета.НачалоПериода) Тогда
			КОплате = КОплате + ВХСальдо;
		КонецЕсли; 
		
		СтрокаМесяцГод.Параметры.ВХСальдо  = ВХСальдо;
		
		ТаблицаПроживающих = ПолучитьТаблицуПроживающих(КонецМесяца(Дата(ВыборкаМесяцГод.МесяцГод)), ПараметрыОтчета.ЛицевойСчет);
		Ответственный         = Справочники.бит_Проживающие.ПустаяСсылка();
		КоличествоПроживающих = 0;
		
		Для каждого СтрокаТабилцы Из ТаблицаПроживающих Цикл
			
			Если СтрокаТабилцы.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
				Ответственный = СтрокаТабилцы.ФизЛицо;
			КонецЕсли; 
			
			Если СтрокаТабилцы.СтатусФизЛица.ПроживаниеВДанныйМомент Тогда
				КоличествоПроживающих = КоличествоПроживающих + 1;
			КонецЕсли; 
			
		КонецЦикла; 
		
		СтрокаМесяцГод.Параметры.Ответственный = Ответственный;
		
		ТабличныйДокумент.Вывести(СтрокаМесяцГод,ВыборкаМесяцГод.Уровень(), "МесяцГод");
		
		ВыборкаУслуга = ВыборкаМесяцГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга", "ВСЕ");
		
		Пока ВыборкаУслуга.Следующий() Цикл
			СтрокаУслуга.Параметры.Заполнить(ВыборкаУслуга);
			ТабличныйДокумент.Присоединить(СтрокаУслуга);
		КонецЦикла;
		
		СтрокаМесяцГодКол.Параметры.Заполнить(ВыборкаМесяцГод);
		
		СтрокаМесяцГодКол.Параметры.ИСХСальдо  = ИСХСальдо;
		
		СтрокаМесяцГодКол.Параметры.Количество = КоличествоПроживающих;
		ТабличныйДокумент.Присоединить(СтрокаМесяцГодКол);
		
		ВыборкаВидНач = ВыборкаМесяцГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидНачисления");
		Пока ВыборкаВидНач.Следующий() Цикл 
			
			СтрокаВидНачисления.Параметры.Заполнить(ВыборкаВидНач);
			ТабличныйДокумент.Вывести(СтрокаВидНачисления);
			
			ВыборкаУслугаВидНач = ВыборкаВидНач.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга", "ВСЕ");
			ИтогоСумма = 0;
			Пока ВыборкаУслугаВидНач.Следующий() Цикл
				СтрокаУслугаВидНач.Параметры.Заполнить(ВыборкаУслугаВидНач);
				ТабличныйДокумент.Присоединить(СтрокаУслугаВидНач);
				ИтогоСумма = ИтогоСумма + ?(ВыборкаУслугаВидНач.Сумма = Null,0,ВыборкаУслугаВидНач.Сумма);
			КонецЦикла;
			
			Если ВыборкаМесяцГод.МесяцГод = НачалоМесяца(ПараметрыОтчета.НачалоПериода) Тогда
				КОплате = КОплате + ВыборкаВидНач.Сумма;
			КонецЕсли;
			
			// Сюда положить ИСХ сальдо.
			СтрокаВидНачКол.Параметры.Заполнить(ВыборкаВидНач);
			СтрокаВидНачКол.Параметры.Итого = ИтогоСумма;
			ТабличныйДокумент.Присоединить(СтрокаВидНачКол);
			
		КонецЦикла;
		
	КонецЦикла;
	
	КОплате = ?(КОплате < 0, 0, КОплате);
	
	ПодвалОборот = Макет.ПолучитьОбласть("ПодвалОборот");
	ПодвалОборот.Параметры.ДатаФормОтчета = Формат(КонецМесяца(ПараметрыОтчета.КонецПериода),"ДФ=dd.MM.yyyy");
	ПодвалОборот.Параметры.Сумма = ?(ПараметрыОтчета.СУчетомПереплаты, ИСХСальдо, ДолгОстаток(ПараметрыОтчета));
	// БИТ_ЖКХ_05082013_начало_изменений
	ОтветственныеЛица = бит_ОбщегоНазначения.бит_ОтветственныеЛица(СведенияОбЛС.Организация, КонецДня(ПараметрыОтчета.КонецПериода));
	ПодвалОборот.Параметры.РуководительРасчетнойСлужбы = ?(ОтветственныеЛица.РуководительРасчетнойСлужбы = Неопределено, "",ОтветственныеЛица.РуководительРасчетнойСлужбы);
	ПодвалОборот.Параметры.Специалист = ?(ОтветственныеЛица.Специалист = Неопределено, "",ОтветственныеЛица.Специалист);
	ПодвалОборот.Параметры.РуководительРасчетнойСлужбыДолжность = ?(ОтветственныеЛица.РуководительРасчетнойСлужбыДолжность = Неопределено, "Руководитель расчетной службы",ОтветственныеЛица.РуководительРасчетнойСлужбыДолжность);
	ПодвалОборот.Параметры.СпециалистДолжность   = ?(ОтветственныеЛица.СпециалистДолжность = Неопределено, "Специалист",ОтветственныеЛица.СпециалистДолжность);
	// БИТ_ЖКХ_05082013_начало_изменений
	ТабличныйДокумент.Вывести(ПодвалОборот);
	
КонецПроцедуры // ()


// Процедура заполняет страницу 2.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ПолныйСтраница2СПеня(ПараметрыОтчета, ТабличныйДокумент, СведенияОбЛС)
	
	Макет = ПолучитьМакет("ФинансовоЛицевойСчет");
	
	ШапкаОборот = Макет.ПолучитьОбласть("ШапкаОборот");
	ШапкаОборот.Параметры.НомерЛС      = СведенияОбЛС.ЛицевойСчет;
	ШапкаОборот.Параметры.Организация  = СведенияОбЛС.Организация;
	ШапкаОборот.Параметры.ДД    = Формат(ПараметрыОтчета.КонецПериода,"ДФ=dd");
	ШапкаОборот.Параметры.месяц = Формат(ПараметрыОтчета.КонецПериода,"ДФ=ММMM");
	ШапкаОборот.Параметры.ГГГГ  = Формат(ПараметрыОтчета.КонецПериода,"ДФ=yyyy");
	
	ТабличныйДокумент.Вывести(ШапкаОборот);
	
	ШапкаУслуги         = Макет.ПолучитьОбласть("ШапкаУслуги");
	ШапкаУслуга         = Макет.ПолучитьОбласть("ШапкаУслуга");
	ШапкаУслуг          = Макет.ПолучитьОбласть("ШапкаУслг");
	СтрокаМесяцГод      = Макет.ПолучитьОбласть("СтрокаМесяцГод");
	СтрокаМесяцГодКол   = Макет.ПолучитьОбласть("СтрокаМесяцГодКол");
	СтрокаВидНачисления = Макет.ПолучитьОбласть("СтрокаВидНачисления");
	СтрокаУслугаВидНач  = Макет.ПолучитьОбласть("СтрокаУслугаВидНач");
	СтрокаУслуга        = Макет.ПолучитьОбласть("СтрокаУслуга");
	СтрокаВидНачКол     = Макет.ПолучитьОбласть("СтрокаВидНачКол");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ПараметрыОтчета.ЛицевойСчет);
	Запрос.Текст = ПолучитьТекстЗапросаПолныйСПеней();//ПолучитьТекстЗапросаПолный();
	
	Результат = Запрос.Выполнить(); 
	
//	29.08.2019
	Запрос.Текст = ПолучитьТекстЗапросаПолныйСПеней();	
	таблицаПени = Запрос.Выполнить().Выгрузить(); 

	ТабличныйДокумент.Вывести(ШапкаУслуги);
	
	ВыборкаУслуга = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга");
	
	Пока ВыборкаУслуга.Следующий() Цикл
		
		ШапкаУслуга.Параметры.Заполнить(ВыборкаУслуга);
		ТабличныйДокумент.Присоединить(ШапкаУслуга );
		
	КонецЦикла;
	
	ТабличныйДокумент.Присоединить(ШапкаУслуг);
	
	ТаблицаОстатков = ПолучитьОстаткиПоПериодам(ПараметрыОтчета);
	
	ВыборкаМесяцГод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцГод");
	
	КОплате = 0;
	
	Пока ВыборкаМесяцГод.Следующий() Цикл
		
		СтрокаМесяцГод.Параметры.Заполнить(ВыборкаМесяцГод);
		
		Отбор = Новый Структура;
		СтрокаПоиска = ТаблицаОстатков.Найти(ВыборкаМесяцГод.МесяцГод, "МесяцГод");
		
		Если НЕ СтрокаПоиска = Неопределено Тогда
			ВХСальдо  = СтрокаПоиска.ВХСальдо;
			ИСХСальдо = СтрокаПоиска.ИСХСальдо;
		Иначе
			ВХСальдо  = 0;
			ИСХСальдо = 0;
		КонецЕсли; 
		
		Если ВыборкаМесяцГод.МесяцГод = НачалоМесяца(ПараметрыОтчета.НачалоПериода) Тогда
			КОплате = КОплате + ВХСальдо;
		КонецЕсли; 
		
		СтрокаМесяцГод.Параметры.ВХСальдо  = ВХСальдо;
		
		ТаблицаПроживающих = ПолучитьТаблицуПроживающих(КонецМесяца(Дата(ВыборкаМесяцГод.МесяцГод)), ПараметрыОтчета.ЛицевойСчет);
		Ответственный         = Справочники.бит_Проживающие.ПустаяСсылка();
		КоличествоПроживающих = 0;
		
		Для каждого СтрокаТабилцы Из ТаблицаПроживающих Цикл
			
			Если СтрокаТабилцы.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
				Ответственный = СтрокаТабилцы.ФизЛицо;
			КонецЕсли; 
			
			Если СтрокаТабилцы.СтатусФизЛица.ПроживаниеВДанныйМомент Тогда
				КоличествоПроживающих = КоличествоПроживающих + 1;
			КонецЕсли; 
			
		КонецЦикла; 
		
		СтрокаМесяцГод.Параметры.Ответственный = Ответственный;
		
		ТабличныйДокумент.Вывести(СтрокаМесяцГод,ВыборкаМесяцГод.Уровень(), "МесяцГод");
		
		ВыборкаУслуга = ВыборкаМесяцГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга", "ВСЕ");
		
		Пока ВыборкаУслуга.Следующий() Цикл
			СтрокаУслуга.Параметры.Заполнить(ВыборкаУслуга);
			ТабличныйДокумент.Присоединить(СтрокаУслуга);
		КонецЦикла;	
		
		
		СтрокаМесяцГодКол.Параметры.Заполнить(ВыборкаМесяцГод);
		
		СтрокаМесяцГодКол.Параметры.ИСХСальдо  = ИСХСальдо;
		
		СтрокаМесяцГодКол.Параметры.Количество = КоличествоПроживающих;
		ТабличныйДокумент.Присоединить(СтрокаМесяцГодКол);
		
		ВыборкаВидНач = ВыборкаМесяцГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидНачисления");
		Пока ВыборкаВидНач.Следующий() Цикл 
			
			СтрокаВидНачисления.Параметры.Заполнить(ВыборкаВидНач);
			ТабличныйДокумент.Вывести(СтрокаВидНачисления);
			
			ВыборкаУслугаВидНач = ВыборкаВидНач.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Услуга", "ВСЕ");
			ИтогоСумма = 0;
			Пока ВыборкаУслугаВидНач.Следующий() Цикл
				СтрокаУслугаВидНач.Параметры.Заполнить(ВыборкаУслугаВидНач);
				ТабличныйДокумент.Присоединить(СтрокаУслугаВидНач);
				ИтогоСумма = ИтогоСумма + ?(ВыборкаУслугаВидНач.Сумма = Null,0,ВыборкаУслугаВидНач.Сумма);
			КонецЦикла;
			
			Если ВыборкаМесяцГод.МесяцГод = НачалоМесяца(ПараметрыОтчета.НачалоПериода) Тогда
				КОплате = КОплате + ВыборкаВидНач.Сумма;
			КонецЕсли;
			
			// Сюда положить ИСХ сальдо.
			СтрокаВидНачКол.Параметры.Заполнить(ВыборкаВидНач);
			СтрокаВидНачКол.Параметры.Итого = ИтогоСумма;
			ТабличныйДокумент.Присоединить(СтрокаВидНачКол);
			
		КонецЦикла;
		
	КонецЦикла;
	
	КОплате = ?(КОплате < 0, 0, КОплате);
	
	ПодвалОборот = Макет.ПолучитьОбласть("ПодвалОборот");
	ПодвалОборот.Параметры.ДатаФормОтчета = Формат(КонецМесяца(ПараметрыОтчета.КонецПериода),"ДФ=dd.MM.yyyy");
	ПодвалОборот.Параметры.Сумма = ?(ПараметрыОтчета.СУчетомПереплаты, ИСХСальдо, ДолгОстаток(ПараметрыОтчета));
	// БИТ_ЖКХ_05082013_начало_изменений
	ОтветственныеЛица = бит_ОбщегоНазначения.бит_ОтветственныеЛица(СведенияОбЛС.Организация, КонецДня(ПараметрыОтчета.КонецПериода));
	ПодвалОборот.Параметры.РуководительРасчетнойСлужбы = ?(ОтветственныеЛица.РуководительРасчетнойСлужбы = Неопределено, "",ОтветственныеЛица.РуководительРасчетнойСлужбы);
	ПодвалОборот.Параметры.Специалист = ?(ОтветственныеЛица.Специалист = Неопределено, "",ОтветственныеЛица.Специалист);
	ПодвалОборот.Параметры.РуководительРасчетнойСлужбыДолжность = ?(ОтветственныеЛица.РуководительРасчетнойСлужбыДолжность = Неопределено, "Руководитель расчетной службы",ОтветственныеЛица.РуководительРасчетнойСлужбыДолжность);
	ПодвалОборот.Параметры.СпециалистДолжность   = ?(ОтветственныеЛица.СпециалистДолжность = Неопределено, "Специалист",ОтветственныеЛица.СпециалистДолжность);
	// БИТ_ЖКХ_05082013_начало_изменений
	ТабличныйДокумент.Вывести(ПодвалОборот);
	
КонецПроцедуры // ()

#КонецОбласти

#Область ВспомогательныеФункцииИПроцедуры

// Функция получает текст запроса полного макета.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТекстЗапросаПолный()
	
	Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Оплата,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ) КАК МесяцГод,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|			ТОГДА ""Льгота""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|			ТОГДА ""Разовые""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|			ТОГДА ""Ввод нач. остатков""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|			ТОГДА ""Оплата""
	|	КОНЕЦ КАК ВидНачисления,
	|	СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)) КАК Сумма,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|			ТОГДА ""Льгота""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|			ТОГДА ""Разовые""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|			ТОГДА ""Ввод нач. остатков""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|			ТОГДА ""Оплата""
	|	КОНЕЦ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцГод,
	|	Приоритет
	|ИТОГИ
	|	СУММА(Оплата),
	|	СУММА(Сумма)
	|ПО
	|	МесяцГод,
	|	ВидНачисления,
	|	Услуга";
	
	Возврат Текст;
	
КонецФункции // ()

//29.08.2019
// Функция получает текст запроса полного макета.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТекстЗапросаПолныйСПеней()
	
	Текст = 
	"ВЫБРАТЬ
	| бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК Услуга,
	| СУММА(ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|			ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ * -1) КАК Оплата,
	| НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ) КАК МесяцГод,
	| ВЫБОР
	|	КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|			ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|			ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|		ТОГДА ""Начисления""
	|	КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|		ТОГДА ""Льгота""
	|	КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|		ТОГДА ""Разовые""
	|	КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|		ТОГДА ""Ввод нач. остатков""
	|	КОГДА бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|		ТОГДА ""Пеня""
	|	КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|		ТОГДА ""Оплата""
	| КОНЕЦ КАК ВидНачисления,        
    |
	| СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)) КАК Сумма,
	| бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет КАК Приоритет,
	| бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениОборот КАК СуммаПениОборот
	| ИЗ
	|  РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|	ПО (бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет = бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет)
    |
    |  СГРУППИРОВАТЬ ПО
    |
	|   бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|   НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ),
	|   ВЫБОР
	|	 КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|			ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|			ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|		ТОГДА ""Начисления""
	|	 КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|		ТОГДА ""Льгота""
	|	 КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|		ТОГДА ""Разовые""
	|	 КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|		ТОГДА ""Ввод нач. остатков""
	|	 КОГДА бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|		ТОГДА ""Пеня""
	|	 КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|		ТОГДА ""Оплата""
	|   КОНЕЦ,
	|                            	
	|  бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет,
	|  бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениОборот
    |
    |  УПОРЯДОЧИТЬ ПО
	|   МесяцГод,
	|   Приоритет
    |  ИТОГИ
	|   СУММА(Оплата),
	|   СУММА(Сумма)
    |  ПО
	|   МесяцГод,
	|   ВидНачисления,
	|   Услуга";
	
	Возврат Текст;
	
КонецФункции // ()


// Функция получает текст запроса полного макета.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТекстЗапросаПени()
	
	Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Оплата,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ) КАК МесяцГод,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|			ТОГДА ""Льгота""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|			ТОГДА ""Разовые""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|			ТОГДА ""Ввод нач. остатков""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|			ТОГДА ""Оплата""
	|	КОНЕЦ КАК ВидНачисления,
	|	СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)) КАК Сумма,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет КАК Приоритет,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
	|		ПО бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет = бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|			ТОГДА ""Льгота""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|			ТОГДА ""Разовые""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|			ТОГДА ""Ввод нач. остатков""
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|			ТОГДА ""Оплата""
	|	КОНЕЦ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцГод,
	|	Приоритет
	|ИТОГИ
	|	СУММА(Оплата),
	|	СУММА(Сумма)
	|ПО
	|	МесяцГод,
	|	ВидНачисления,
	|	Услуга";
	
	Возврат Текст;
	
КонецФункции // ()


// Функция получает остатки по периодам.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьОстаткиПоПериодам(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ПараметрыОтчета.ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК ВхСальдо,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК ИсхСальдо,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период КАК МесяцГод
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()

Функция ДолгОстаток(ПараметрыОтчета)
	
	ДолгОстаток = Новый Запрос;
	ДолгОстаток.УстановитьПараметр("ЛицевойСчет"  , ПараметрыОтчета.ЛицевойСчет);
	ДолгОстаток.УстановитьПараметр("КонецПериода" , КонецМесяца(ПараметрыОтчета.КонецПериода));
	ДолгОстаток.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПараметрыОтчета.КонецПериода));
	ДолгОстаток.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК МесяцГод,
	|	НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Льгота
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ЛицевойСчет = &ЛицевойСчет) КАК НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
	|	НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК Остаток,
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&НачалоПериода, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.Остаток, 0) + ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Оплата, 0) - ЕСТЬNULL(Обороты.Льгота, 0) > 0
	|				ТОГДА ЕСТЬNULL(Остатки.Остаток, 0) + ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Оплата, 0) - ЕСТЬNULL(Обороты.Льгота, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОплате,
	|	Остатки.ЛицевойСчет
	|ИЗ
	|	Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО Остатки.УслугаЖКХ = Обороты.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки";
	
	РезультатТаблицы = ДолгОстаток.Выполнить().Выгрузить();
	Если НЕ ДолгОстаток.Выполнить().Пустой() Тогда
		
		Долг = РезультатТаблицы.Получить(РезультатТаблицы.Количество()-1).КОплате;
		
	Иначе
		
		Долг = 0;
		
	КонецЕсли;
	
	
	Возврат Долг;
	
КонецФункции // ()

// Функция текст запроса макета остатки.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТекстЗапросаОстатки()
	
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаОстатков.Услуга,
	|	ТаблицаОстатков.МесяцГод,
	|	ТаблицаОстатков.ВхСальдо,
	|	ТаблицаОстатков.ИсхСальдо,
	|	ТаблицаОстатков.Приоритет
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	&ТаблицаОстатков КАК ТаблицаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начислено,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Льгота,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ) КАК МесяцГод
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.МесяцГод КАК МесяцГод,
	|	Остатки.Услуга КАК Услуга,
	|	Остатки.ВхСальдо КАК ВхСальдо,
	|	Остатки.ИсхСальдо КАК ИсхСальдо,
	|	ЕСТЬNULL(Обороты.Начислено, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА Остатки.ВхСальдо + ЕСТЬNULL(Обороты.Начислено, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.Оплата, 0) > 0
	|			ТОГДА Остатки.ВхСальдо + ЕСТЬNULL(Обороты.Начислено, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.Оплата, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КОплате,
	|	ЕСТЬNULL(Обороты.Оплата, 0) КАК Оплата,
	|	Остатки.Приоритет КАК Приоритет
	|ИЗ
	|	Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО Остатки.Услуга = Обороты.УслугаЖКХ
	|			И Остатки.МесяцГод = Обороты.МесяцГод
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцГод,
	|	Приоритет
	|ИТОГИ
	|	СУММА(ВхСальдо),
	|	СУММА(ИсхСальдо),
	|	СУММА(Сумма),
	|	СУММА(КОплате),
	|	СУММА(Оплата)
	|ПО
	|	МесяцГод,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты";
	
	Возврат Текст;
	
КонецФункции // ()

Функция ПолучитьТаблицуОстатков(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("КонецПериода" , КонецМесяца(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ) КАК МесяцГод,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК СуммаНачальныйОстаток,
	|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК СуммаКонечныйОстаток,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.МесяцГод КАК МесяцГод,
	|	Остатки.УслугаЖКХ КАК Услуга,
	|	Остатки.СуммаНачальныйОстаток КАК ВхСальдо,
	|	Остатки.СуммаКонечныйОстаток КАК ИсхСальдо,
	|	Остатки.Приоритет КАК Приоритет
	|ИЗ
	|	Остатки КАК Остатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцГод,
	|	Приоритет
	|ИТОГИ
	|	СУММА(ВхСальдо),
	|	СУММА(ИсхСальдо)
	|ПО
	|	Услуга,
	|	МесяцГод ПЕРИОДАМИ(МЕСЯЦ, &НачалоПериода, &КонецПериода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки";
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("МесяцГод" , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("Услуга"   , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	Таблица.Колонки.Добавить("ВхСальдо" , ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Таблица.Колонки.Добавить("ИсхСальдо", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Таблица.Колонки.Добавить("Приоритет", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаУС = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцГод", "ВСЕ");
		
		Пока ВыборкаУС.Следующий() Цикл
			
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаУС);
			
		КонецЦикла; 
		
	КонецЦикла;               
	
	Возврат Таблица;
	
КонецФункции // () 

// Функция текст запроса выписки.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТекстЗапросаВыписка_Список()
	
	Текст = 
	"ВЫБРАТЬ
	|	СписокУслуг.Услуга,
	|	СписокУслуг.ЕдИзм,
	|	СписокУслуг.Тариф,
	|	СписокУслуг.ОсновнаяСтавка,
	|	СписокУслуг.ГрафаОтчетаГЦЖС,
	|	СписокУслуг.СпособРасчета
	|ПОМЕСТИТЬ тмпСписокУслуг
	|ИЗ
	|	&СписокУслуг КАК СписокУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток КАК ВхСальдо,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК ИсхСальдо,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начислено,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ТОГДА ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ * -1) КАК Льгота
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК ОбъемОборот
	|ПОМЕСТИТЬ Объемы
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет = &ЛицевойСчет) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тмпСписокУслуг.Услуга,
	// БИТ_ЖКХ_03102013_начало_изменений
	// Остатки.ВхСальдо КАК ВхСальдо,.
	// Остатки.ИсхСальдо КАК ИсхСальдо,.
	|	ЕСТЬNULL(Остатки.ВхСальдо, 0) КАК ВхСальдо,
	|	ЕСТЬNULL(Остатки.ИсхСальдо, 0) КАК ИсхСальдо,
	// БИТ_ЖКХ_03102013_окончание_изменений
	|	ЕСТЬNULL(Обороты.Начислено, 0) КАК Начислено,
	|	ЕСТЬNULL(Обороты.Разовые, 0) КАК Разовые,
	|	ЕСТЬNULL(Обороты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(Обороты.Льгота, 0) КАК Льгота,
	|	Остатки.Приоритет КАК Приоритет,
	|	ЕСТЬNULL(Объемы.ОбъемОборот, 0) КАК Объем,
	|	тмпСписокУслуг.ЕдИзм,
	|	тмпСписокУслуг.Тариф,
	|	тмпСписокУслуг.ОсновнаяСтавка,
	|	тмпСписокУслуг.ГрафаОтчетаГЦЖС,
	|	тмпСписокУслуг.СпособРасчета
	|ИЗ
	|	тмпСписокУслуг КАК тмпСписокУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО тмпСписокУслуг.Услуга = Остатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО тмпСписокУслуг.Услуга = Обороты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	|		ПО тмпСписокУслуг.Услуга = Объемы.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	СУММА(ВхСальдо),
	|	СУММА(ИсхСальдо),
	|	СУММА(Начислено),
	|	СУММА(Разовые),
	|	СУММА(Оплата),
	|	СУММА(Льгота)
	|ПО
	|	ОБЩИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Объемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ тмпСписокУслуг";
	
	Возврат Текст;
	
КонецФункции // ()

// Функция получает сведения о лицевом счете.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСведенияОбЛицевомСчете(ПараметрыОтчета)
	
	СведенияОбЛс = Новый Структура;
	СведенияОбЛс.Вставить("ЛицевойСчет"             , Справочники.бит_ЛицевыеСчета.ПустаяСсылка());
	СведенияОбЛс.Вставить("Организация"             , Справочники.Организации.ПустаяСсылка());
	СведенияОбЛс.Вставить("НаименованиеЛС"          , "");
	СведенияОбЛс.Вставить("ПочтовыйАдрес"           , "");
	СведенияОбЛс.Вставить("Район"                   , Справочники.бит_АдминистративныеОкруга.ПустаяСсылка());
	СведенияОбЛс.Вставить("Участок"                 , Справочники.бит_ТехническиеУчастки.ПустаяСсылка());
	СведенияОбЛс.Вставить("Улица"                   , Справочники.бит_СписокУлиц.ПустаяСсылка());
	СведенияОбЛс.Вставить("Здание"                  , Справочники.бит_СписокЗданий.ПустаяСсылка());
	СведенияОбЛс.Вставить("Корпус"                  , "");
	СведенияОбЛс.Вставить("Строение"                , "");
	СведенияОбЛс.Вставить("Этаж"                    , 0);
	СведенияОбЛс.Вставить("Квартира"                , Справочники.бит_Квартиры.ПустаяСсылка());
	СведенияОбЛс.Вставить("Идентификатор"           , 0);
	СведенияОбЛс.Вставить("ОбщаяПлощадь"            , 0);
	СведенияОбЛс.Вставить("ЖилаяПлощадь"            , 0);
	СведенияОбЛс.Вставить("МОП"                     , 0);
	СведенияОбЛс.Вставить("ОтапливаемаяПлощадь"     , 0);
	СведенияОбЛс.Вставить("СовокупнаяПлощадь"       , 0);
	СведенияОбЛс.Вставить("ТипКвартиры"             , Справочники.бит_ТипыКвартиры.ПустаяСсылка());
	СведенияОбЛс.Вставить("СтатусКвартиры"          , Справочники.бит_СтатусыКвартиры.ПустаяСсылка());
	СведенияОбЛс.Вставить("ТипПлиты"                , Справочники.бит_ТипыПлиты.ПустаяСсылка());
	СведенияОбЛс.Вставить("ТипЗапирающегоУстройства", Справочники.бит_ТипыЗапирающихУстройств.ПустаяСсылка());
	СведенияОбЛс.Вставить("Ответственный"            , Справочники.бит_Проживающие.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет", ПараметрыОтчета.ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование КАК НаименованиеЛС,
	|	бит_ЛицевыеСчета.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ЛицевыеСчета.Здание.Район КАК Район,
	|	бит_ЛицевыеСчета.Здание.Участок КАК Участок,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Здание.Строение КАК Строение,
	|	бит_ЛицевыеСчета.Квартира,
	|	бит_ЛицевыеСчета.Идентификатор,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства,
	|	бит_ЛицевыеСчета.Организация,
	|	бит_ЛицевыеСчета.Квартира.Этаж КАК Этаж
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Период, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &ЛицевойСчет";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СведенияОбЛс, Выборка);
	
	СведенияОбЛс.Ответственный = ОтветственноеЛицоПоЛС(КонецДня(ПараметрыОтчета.КонецПериода), ПараметрыОтчета.ЛицевойСчет);
	
	СведенияОбЛс.Вставить("СписокУслуг"      , ПолучитьТаблицуУслуг(ПараметрыОтчета, СведенияОбЛс.СтатусКвартиры, СведенияОбЛс.ТипКвартиры));
	
	Возврат СведенияОбЛс;
	
КонецФункции // ()

// Функция получает таблицу услуг.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТаблицуУслугСПеней(ПараметрыОтчета, СтатусКвартиры, ТипКвартиры)
	
	Число_17_4 = ОбщегоНазначения.ОписаниеТипаЧисло(17,4);
	Число_15_4 = ОбщегоНазначения.ОписаниеТипаЧисло(17,4);
	
	СписокУслуг = Новый ТаблицаЗначений;
	СписокУслуг.Колонки.Добавить("Услуга"                         , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	СписокУслуг.Колонки.Добавить("РежимПотребления"               , Новый ОписаниеТипов("СправочникСсылка.бит_РежимыПотребленияУслуг"));
	СписокУслуг.Колонки.Добавить("Поставщик"                      , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	СписокУслуг.Колонки.Добавить("СпособРасчета"                  , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	СписокУслуг.Колонки.Добавить("ГрафаОтчетаГЦЖС"                , Новый ОписаниеТипов("ПеречислениеСсылка.бит_ГрафыОтчетаПоГЦЖС"));
	СписокУслуг.Колонки.Добавить("КоличествоЕдиницПотребления"    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	СписокУслуг.Колонки.Добавить("ПлановаяСтавка"                 , Число_17_4);
	СписокУслуг.Колонки.Добавить("ОсновнаяСтавка"                 , Число_17_4);
	СписокУслуг.Колонки.Добавить("СверхНормативнаяСтавка"         , Число_17_4);
	СписокУслуг.Колонки.Добавить("Тариф"                          , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаОдного"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаДвоих"                        , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью"                        , Число_15_4);
	СписокУслуг.Колонки.Добавить("ДопНормаНаСемью"                , Число_15_4);
	СписокУслуг.Колонки.Добавить("ДопНормаНаКаждого"              , Число_15_4);
	СписокУслуг.Колонки.Добавить("ИспользоватьДопНормуНаОдного"   , Новый ОписаниеТипов("Булево"));
	СписокУслуг.Колонки.Добавить("ИспользоватьДопНормуНаЛьготника", Новый ОписаниеТипов("Булево"));
	СписокУслуг.Колонки.Добавить("НаЛицевойСчет"                  , Число_15_4);
	СписокУслуг.Колонки.Добавить("НормативПотребленияПоКу"        , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью4"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью5"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью6"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("ЕдИзм"                          , Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	СписокУслуг.Колонки.Добавить("Приоритет"                      , ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	//28.08.2019
	СписокУслуг.Колонки.Добавить("СуммаПени"                      , Число_15_4);

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"        , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"   , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("СтатусКвартиры", СтатусКвартиры);
	Запрос.УстановитьПараметр("ТипКвартиры"   , ТипКвартиры);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	|	бит_СтавкиНаУслугиСрезПоследних.ПлановаяСтавка КАК ПлановаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка КАК ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка КАК СверхНормативнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.Тариф КАК Тариф,
	|	бит_НормыНаУслугиСрезПоследних.НаОдного КАК НаОдного,
	|	бит_НормыНаУслугиСрезПоследних.НаДвоих КАК НаДвоих,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью КАК НаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью КАК ДопНормаНаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого КАК ДопНормаНаКаждого,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного КАК ИспользоватьДопНормуНаОдного,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника КАК ИспользоватьДопНормуНаЛьготника,
	|	бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет КАК НаЛицевойСчет,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу КАК НормативПотребленияПоКу,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью4 КАК НаСемью4,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью5 КАК НаСемью5,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью6 КАК НаСемью6,
	|	бит_УслугиЖКХСпособыРасчета.ЕдИзм КАК ЕдИзм,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_НачислениеПениПоУслугамЖКХ.СуммаПени КАК СуммаПени
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ КАК бит_НачислениеПениПоУслугамЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|					&Период,
	|					СтатусКвартиры = &СтатусКвартиры
	|						И ТипКвартиры = &ТипКвартиры) КАК бит_СтавкиНаУслугиСрезПоследних
	|			ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|				И бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|				И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|				И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|					&Период,
	|					СтатусКвартиры = &СтатусКвартиры
	|						И ТипКвартиры = &ТипКвартиры) КАК бит_НормыНаУслугиСрезПоследних
	|			ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|				И бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|				И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|			ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|				И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|		ПО бит_НачислениеПениПоУслугамЖКХ.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|			И бит_НачислениеПениПоУслугамЖКХ.УслугаЖКХ = бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла; 
	
	Возврат СписокУслуг;
	
КонецФункции // ()

// Функция получает таблицу услуг.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТаблицуУслуг(ПараметрыОтчета, СтатусКвартиры, ТипКвартиры)
	
	Число_17_4 = ОбщегоНазначения.ОписаниеТипаЧисло(17,4);
	Число_15_4 = ОбщегоНазначения.ОписаниеТипаЧисло(17,4);
	
	СписокУслуг = Новый ТаблицаЗначений;
	СписокУслуг.Колонки.Добавить("Услуга"                         , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	СписокУслуг.Колонки.Добавить("РежимПотребления"               , Новый ОписаниеТипов("СправочникСсылка.бит_РежимыПотребленияУслуг"));
	СписокУслуг.Колонки.Добавить("Поставщик"                      , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	СписокУслуг.Колонки.Добавить("СпособРасчета"                  , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	СписокУслуг.Колонки.Добавить("ГрафаОтчетаГЦЖС"                , Новый ОписаниеТипов("ПеречислениеСсылка.бит_ГрафыОтчетаПоГЦЖС"));
	СписокУслуг.Колонки.Добавить("КоличествоЕдиницПотребления"    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	СписокУслуг.Колонки.Добавить("ПлановаяСтавка"                 , Число_17_4);
	СписокУслуг.Колонки.Добавить("ОсновнаяСтавка"                 , Число_17_4);
	СписокУслуг.Колонки.Добавить("СверхНормативнаяСтавка"         , Число_17_4);
	СписокУслуг.Колонки.Добавить("Тариф"                          , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаОдного"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаДвоих"                        , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью"                        , Число_15_4);
	СписокУслуг.Колонки.Добавить("ДопНормаНаСемью"                , Число_15_4);
	СписокУслуг.Колонки.Добавить("ДопНормаНаКаждого"              , Число_15_4);
	СписокУслуг.Колонки.Добавить("ИспользоватьДопНормуНаОдного"   , Новый ОписаниеТипов("Булево"));
	СписокУслуг.Колонки.Добавить("ИспользоватьДопНормуНаЛьготника", Новый ОписаниеТипов("Булево"));
	СписокУслуг.Колонки.Добавить("НаЛицевойСчет"                  , Число_15_4);
	СписокУслуг.Колонки.Добавить("НормативПотребленияПоКу"        , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью4"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью5"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("НаСемью6"                       , Число_15_4);
	СписокУслуг.Колонки.Добавить("ЕдИзм"                          , Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	СписокУслуг.Колонки.Добавить("Приоритет"                      , ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"        , КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"   , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("СтатусКвартиры", СтатусКвартиры);
	Запрос.УстановитьПараметр("ТипКвартиры"   , ТипКвартиры);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления,
	|	бит_СтавкиНаУслугиСрезПоследних.ПлановаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.Тариф,
	|	бит_НормыНаУслугиСрезПоследних.НаОдного,
	|	бит_НормыНаУслугиСрезПоследних.НаДвоих,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника,
	|	бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью4,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью5,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью6,
	|	бит_УслугиЖКХСпособыРасчета.ЕдИзм,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|				&Период,
	|				СтатусКвартиры = &СтатусКвартиры
	|					И ТипКвартиры = &ТипКвартиры) КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|				&Период,
	|				СтатусКвартиры = &СтатусКвартиры
	|					И ТипКвартиры = &ТипКвартиры) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|			И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла; 
	
	Возврат СписокУслуг;
	
КонецФункции // ()

// Функция получает таблицу проживающих.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТаблицуПроживающих(Период, ЛицевойСчет, ИсторияПроживающих = Ложь)
	
	СписокПроживающих = Новый ТаблицаЗначений;
	
	СписокПроживающих.Колонки.Добавить("ФизЛицо"                      , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	СписокПроживающих.Колонки.Добавить("СтатусФизЛица"                , Новый ОписаниеТипов("СправочникСсылка.бит_СтатусФизЛица"));
	СписокПроживающих.Колонки.Добавить("СтепеньРодства"               , Новый ОписаниеТипов("СправочникСсылка.бит_СтепениРодстваФизЛиц"));
	СписокПроживающих.Колонки.Добавить("СтатусПроживания"             , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СтатусПроживания"));
	СписокПроживающих.Колонки.Добавить("ДатаРегистрации"              , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СписокПроживающих.Колонки.Добавить("ДатаСнятияСРегистрации"       , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СписокПроживающих.Колонки.Добавить("ВладелецКвартиры"             , Новый ОписаниеТипов("ПеречислениеСсылка.ДаНет"));
	СписокПроживающих.Колонки.Добавить("ДоляПлощади"                  , ОбщегоНазначения.ОписаниеТипаЧисло(3,2));
	СписокПроживающих.Колонки.Добавить("ПравоустанавливающиеДокументы", Новый ОписаниеТипов("СправочникСсылка.бит_ПравоустанавливающиеДокументы")); 
	// БИТ_ЖКХ_25092013_начало_измерения
	СписокПроживающих.Колонки.Добавить("ДатаРождения"                 , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	// БИТ_ЖКХ_25092013_окончание_измерения
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , Период);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	// БИТ_ЖКХ_25092013_начало_измерения
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	// БИТ_ЖКХ_25092013_окончание_измерения
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних";
	
	Если НЕ ИсторияПроживающих Тогда
		
		Запрос.Текст  = Запрос.Текст + " 
		|ГДЕ
		|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокПроживающих.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Возврат СписокПроживающих;
	
КонецФункции // ()

// Функция получает ответственного по лицевому счету.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ОтветственноеЛицоПоЛС(Период, ЛицевойСчет)
	
	Ответственный = Справочники.бит_Проживающие.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , Период);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Ответственный = Выборка.ФизЛицо;;
	КонецЕсли; 
	
	Возврат Ответственный;
	
КонецФункции // ()

// Функция получает таблицу правоустанавливающих документов.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТаблицуПравоустанавливающихДокументов(Период, ЛицевойСчет)
	
	// БИТ_ЖКХ_22072013 изменен текст запроса
	// Добавлена проверка на статус "выписан" для правоустанавливающих документов.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы КАК НаименованиеДокумента,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.НомерДокумента КАК НомерДокумента,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.ДатаДокумента КАК ДатаДокумента,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.ОрганизацияВыдавшаяДокумент КАК ОрганизацияВыдавшаяДокумент,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.ВидДокумента КАК ПравоустанавливающиеДокументы,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Период,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И ПравоустанавливающиеДокументы <> ЗНАЧЕНИЕ(Справочник.бит_ПравоустанавливающиеДокументы.ПустаяСсылка)
	|				И СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|				И ФизЛицо В
	|					(ВЫБРАТЬ
	|						бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|					ИЗ
	|						РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|					ГДЕ
	|						(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период
	|							ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)))) КАК бит_ПроживающиеПоЛССрезПоследних";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период"     , Период);
	
	ТаблицаСписокДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСписокДокументов;
	
КонецФункции // ()

// Функция получает таблицу комнат.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТаблицуКомнат(Период, Квартира)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_Комнаты.Наименование,
	|	ЕСТЬNULL(бит_СведенияОКомнатеСрезПоследних.Площадь, 0) КАК ПлощадьКомнаты,
	|	бит_Комнаты.ЧастьПомещения КАК Комната
	|ИЗ
	|	Справочник.бит_Комнаты КАК бит_Комнаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКомнате.СрезПоследних(&Период, Комната.Владелец = &Квартира) КАК бит_СведенияОКомнатеСрезПоследних
	|		ПО (бит_СведенияОКомнатеСрезПоследних.Комната = бит_Комнаты.Ссылка)
	|ГДЕ
	|	бит_СведенияОКомнатеСрезПоследних.Комната.ЧастьПомещения.Принадлежность = ЗНАЧЕНИЕ(Перечисление.бит_ПринадлежностьКомнат.Внутренняя)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Комната";
	
	Запрос.УстановитьПараметр("Квартира", Квартира);
	Запрос.УстановитьПараметр("Период"  , Период);
	
	ТаблицаКомнат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаКомнат;
	
КонецФункции // ()

// Функция получает таблицу информации о льготниках.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьТаблицуИнформацииОЛьготниках(Период, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Льготы.ФизЛицо,
	|	Льготы.Льгота,
	|	Льготы.СрокДействияЛьготы,
	|	ФизЛица.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	ФизЛица.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	Льготы.Период,
	|	Льготы.ДокументНаЛьготуНаименование,
	|	Льготы.НомерДокумента,
	|	Льготы.ДатаВыдачи,
	|	Льготы.ДокументНаЛьготуНаименование + "" №"" + Льготы.НомерДокумента + "" выдан "" КАК ДокументНаЛьготу
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|		ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|		ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|		ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|		ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|		ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации
	|	ИЗ
	|		РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|	ГДЕ
	|		(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период
	|				ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))) КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ЛьготыПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|			бит_ЛьготыПоЛССрезПоследних.Льготы КАК Льгота,
	|			бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы КАК СрокДействияЛьготы,
	|			бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу КАК ДокументНаЛьготу,
	|			бит_ЛьготыПоЛССрезПоследних.Период КАК Период,
	|			бит_ЛьготыПоЛССрезПоследних.НомерДокумента КАК НомерДокумента,
	|			бит_ЛьготыПоЛССрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|			бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу.Наименование КАК ДокументНаЛьготуНаименование
	|		ИЗ
	|			РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ЛьготыПоЛССрезПоследних
	|		ГДЕ
	|			(бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &Период
	|					ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1))) КАК Льготы
	|		ПО ФизЛица.ФизЛицо = Льготы.ФизЛицо
	|ГДЕ
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы = ИСТИНА";
	
	Запрос.УстановитьПараметр("Период"     , Период);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	ТаблицаЛьготников = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЛьготников;
	
КонецФункции // ()

#КонецОбласти