
#Область ПроцедурыОбработчикиСобытий

//  Процедура - обработчик события "НачалоВыбора" поля ввода "ПодразделениеОрганизации".
// 
&НаКлиенте
Процедура ПодразделениеОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Форма = ОткрытьФорму("Справочник.бит_ПодразделенияОрганизаций.Форма.ФормаВыбораУправляемая",,Элемент);
	Форма.Организация = Объект.Владелец;
	Форма.Элементы.Организация.Доступность = Ложь;
	
КонецПроцедуры

//  Процедура - обработчик события "ОбработкаВыбора" поля ввода "Владелец".
// 
&НаКлиенте	
Процедура ВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Владелец <> ВыбранноеЗначение Тогда
	
		Объект.ПодразделениеОрганизации = ПредопределенноеЗначение("Справочник.бит_ПодразделенияОрганизаций.ПустаяСсылка");
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

