
&НаКлиенте
Процедура СписокИндПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ= истина;
	Если Элемент.имя = "СписокИнд" тогда
		ФормаИзмененияСтатуса = ПолучитьФорму("РегистрСведений.БИТ_ТарифыЛифт.ФормаЗаписи");
		ФормаИзмененияСтатуса.Запись.Период = НачалоМесяца(ТекущаяДата());
		ФормаИзмененияСтатуса.элементы.объект.видимость = истина;
		ФормаИзмененияСтатуса.Открыть();
	иначе
		ФормаИзмененияСтатуса = ПолучитьФорму("РегистрСведений.БИТ_ТарифыЛифт.ФормаЗаписи");
		ФормаИзмененияСтатуса.Запись.Период = НачалоМесяца(ТекущаяДата());
		ФормаИзмененияСтатуса.элементы.объект.видимость = ложь;
		ФормаИзмененияСтатуса.Открыть();
	КонецЕсли;
	
КонецПроцедуры
