
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	ДатаНач = НачалоГода(ТекущаяДата());
	ДатаКон = КонецГода(ТекущаяДата());
     Момент = ТекущаяДата();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Попытка
		СформироватьНаСервере();
	Исключение	
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_СпискиПроживающихРодившихсяЗаПериод"));
	РезультатЗапроса = СпискиПроживающихРодившихсяЗаПериодИнициализация();
	
	ОтчетОбъект.СпискиПроживающихРодившихсяЗаПериодВывести(Момент,ДатаНач, ДатаКон,Результат,РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Функция СпискиПроживающихРодившихсяЗаПериодИнициализация()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание КАК Здание,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира КАК Квартира
	|ПОМЕСТИТЬ СписокПроживающих
	|{ВЫБРАТЬ
	|	ДатаРегистрации,
	|	ФизЛицо.*,
	|	ДатаРождения,
	|	Фамилия,
	|	Отчество,
	|	Имя,
	|	ФизЛицоПол.*,
	|	Улица.*,
	|	Здание.*,
	|	Квартира.*}
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения >= &ДатаНач
	|	И бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения <= &ДатаКон
	|	И бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации <= &Момент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокПроживающих.ДатаРегистрации,
	|	СписокПроживающих.ФизЛицо КАК ФизЛицо,
	|	ФактАдрес.Представление КАК ФактАдрес,
	|	ЮрАдрес.Представление КАК ЮрАдрес,
	|	СписокПроживающих.ДатаРождения,
	|	СписокПроживающих.Фамилия,
	|	СписокПроживающих.Отчество,
	|	СписокПроживающих.Имя,
	|	СписокПроживающих.ФизЛицоПол,
	|	СписокПроживающих.Улица КАК Улица,
	|	СписокПроживающих.Здание КАК Здание,
	|	СписокПроживающих.Квартира КАК Квартира
	|ИЗ
	|	СписокПроживающих КАК СписокПроживающих
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_КонтактнаяИнформация.Объект КАК Объект,
	|			бит_КонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ГДЕ
	|			бит_КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Адрес)
	|			И бит_КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ФактАдресПроживающего)
	|			И бит_КонтактнаяИнформация.Объект ССЫЛКА Справочник.бит_Проживающие) КАК ФактАдрес
	|		ПО СписокПроживающих.ФизЛицо = ФактАдрес.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_КонтактнаяИнформация.Объект КАК Объект,
	|			бит_КонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ГДЕ
	|			бит_КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Адрес)
	|			И бит_КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего)
	|			И бит_КонтактнаяИнформация.Объект ССЫЛКА Справочник.бит_Проживающие) КАК ЮрАдрес
	|		ПО СписокПроживающих.ФизЛицо = ЮрАдрес.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Улица,
	|	Здание,
	|	Квартира,
	|	ФизЛицо
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокПроживающих";        
	
	
	Запрос.УстановитьПараметр("Момент",Момент);
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",ДатаКон);

	 РезультатЗапроса = Запрос.Выполнить();
	 
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти
