
#Область ПеременныеМодуля

Перем мСчет;						// Хранит значение счета.
Перем мСчетПени;					// Хранит значение счета пени.
Перем мСчетПениУСО;					// Хранит значение счета пени УСО.
Перем мСчетЛьготСУ;					// Хранит значение счета льгот СУ.
Перем мСчетЛьготУСО;				// Хранит значение счета льгот УСО.
Перем мСчетЛьготКапРемонта;		// Хранит значение счета льгот капитального ремонта.
Перем мСчетПениКапРемонта;			// Хранит значение счета пени капитального ремонта.
Перем мЛьготаПерсонифицированная;	// Хранит значение персонифицированной льготы при открытии.

Перем мСчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг; // Хранит значение счета начислений собственных услуг.
Перем мСчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями; // Хранит значение счета начислений сторонних организаций.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НадписьИнфоПоАдресу = Строка("Настройки адреса применяются для вывода в счета-извещения адреса лицевого счета.
	|Адрес лицевого счета состоит из частей: район (город), улица, дом, корпус, квартиры. Для настройки структуры адреса заполнить настройки:
	|1) Указать префиксы. Например, для улицы - ул., дома - д., корпуса - корп. и квартиры - кв.
	|2) Если какую-либо часть адреса не надо выводить в счета-извещения, тогда установить соответствующий флажок.
	|Префикс района можно использовать при выводе названия района или города.
	|Кнопка ""Заполнить по умолчанию"" автоматически заполняет префиксы значениями: район (), улица (ул.), дом (д.) корпус (корп.), квартира (кв.).");
	
	НадписьИнфоПоАдресу1= Строка(" - первые пять символов в штрих-коде. Служит 
	|для идентификации организации при приеме 
	|счет-извещений в банке.");
	
	НадписьИнфоПоЧеку = Строка("1) На чеке ККМ фискального регистратора выбор возможности печати получателей денежных средств с номерами телефонов (по умолчанию ""не печатать"").
	|2) Установите флажок ""Разбить оплату КУ по датам"" если требуется вести учет согласно дате поступления ДС в кассу.
	|3) ""Группировать услуги в чеке"" - печать чека ККМ по группам услуг.");
	
	НадписьПояснениеКонтрагент = Строка("- Значение ""Контрагент"" будет использовано в 
	|документах ""Акт об оказании производственных услуг""
	|и ""РеализацияТоваровУслуг"" при использовании счета
	|""76.КУ"" как счет абонента. Иначе при установленом
	|флаге ""Формировать акт и реализацию по
	|контрагенту"" будет сформирован единственных
	|документ по контрагенту за закрытый месяц.");
	
	// БИТ_ЖКХ 20.01.2016 15:40:51 Начало правки...
	НадписьИнфоПоФорматуДаты= Строка("Формат даты:
	|д (d) - день месяца (цифрами) без лидирующего нуля; 
	|дд (dd) - день месяца (цифрами) с лидирующим нулем; 
	|ддд (ddd) - краткое название дня недели *); 
	|дддд (dddd) - полное название дня недели *); 
	|М (M) - номер месяца (цифрами) без лидирующего нуля; 
	|ММ (MM) - номер месяца (цифрами) с лидирующим нулем; 
	|МММ (MMM) - краткое название месяца *); 
	|ММММ (MMMM) - полное название месяца *); 
	|к (q) - номер квартала в году; 
	|г (y) - номер года без века и лидирующего нуля; 
	|гг (yy) - номер года без века с лидирующим нулем; 
	|гггг (yyyy) - номер года с веком; 
	|ч (h) - час в 12 часовом варианте без лидирующих нулей; 
	|чч (hh) - час в 12 часовом варианте с лидирующим нулем; 
	|Ч (H) - час в 24 часовом варианте без лидирующих нулей; 
	|ЧЧ (HH) - час в 24 часовом варианте с лидирующим нулем; 
	|м (m) - минута без лидирующего нуля; 
	|мм (mm) - минута с лидирующим нулем; 
	|с (s) - секунда без лидирующего нуля; 
	|сс (ss) - секунда с лидирующим нулем;");
	// БИТ_ЖКХ 20.01.2016 15:40:51 Конец правки.
	
	ЗаписьМенеджерЗаписи = ДанныеФормыВЗначение(Запись, Тип("РегистрСведенийМенеджерЗаписи.бит_НастройкаПараметровЖКХ"));
	
	Переключатель = ?(Запись.ОбщедомовыеРасходыВГрафеНачисления = Ложь,2,1);
	
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
// 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьСубконто();
	
	мЛьготаПерсонифицированная = Запись.ЛьготаПерсонифицированная;
	
	УправлениеЭлементамиФормы();
	// БИТ_ЖКХ 26.03.2014	
	ЗаполнениеОрганизации();
	// БИТ_ЖКХ 26.03.2014
	
	// БИТ_ЖКХ 22.05.2015{{
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготСУ, "ЛьготСУ", Ложь, Истина);
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготСторП, "ЛьготУСО", Ложь, Истина);
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготКапРемонта, "ЛьготКапРем", Ложь, Истина);
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг, "НачисленийРасчетаПредельногоИндексаСобственныхУслуг", Ложь, Истина);
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями, "НачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями", Ложь, Истина);
	// БИТ_ЖКХ 22.05.2015}}
	
	// БИТ_ЖКХ 27.01.2017 11:18:05 Начало правки...
	ПоказатьФорматДаты();
	// БИТ_ЖКХ 27.01.2017 11:18:05 Конец правки.
	
КонецПроцедуры

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьПараметрыЖКХ");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" реквизита "СчетчикиПодкрутка".
//
&НаКлиенте
Процедура СчетчикиПодкруткаПриИзменении(Элемент)
	
	Если Не Запись.СчетчикиПодкрутка Тогда
		
		Запись.ПодкруткаНаЛС                                     = Ложь;
		
	КонецЕсли;
	
	Если Запись.СчетчикиПодкрутка И Запись.ВариантПодкрутки.Пустая() Тогда
		
		Запись.ВариантПодкрутки = ПредопределенноеЗначение("Перечисление.бит_ВариантыПодкрутки.ПоНорме");
		
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" реквизита "Последний день приема платежей".
//
&НаКлиенте
Процедура ПоследнийДеньПриемаПлатежейОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Число(Текст) > 31 Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Последний день приема платежей не может быть больше 31");
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписьюНаСервере" формы.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Запись.ЛьготаПерсонифицированная И НЕ мЛьготаПерсонифицированная Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Запись.Период));
		Запрос.УстановитьПараметр("КонецПериода" , КонецМесяца(Запись.Период));
		Запрос.УстановитьПараметр("Организация"  , Запись.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)) КАК СуммаОборот,
		|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.Организация
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.Организация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() И НЕ Выборка.СуммаОборот = 0 Тогда
			
			Текст = "В текущем периоде: " + Формат(Запись.Период,"ДФ=ММMM.yyyy") + " выполнено начисление льгот.
			|Удалите документы начисления льгот. Флаг ""Льгота персонифицированная"" снят.";
			
			Запись.ЛьготаПерсонифицированная = Ложь;
			
			бит_ОбщегоНазначения.СообщитьОбОшибке(Текст);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетАбонента".
// 
&НаКлиенте
Процедура СчетАбонентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение)
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетСУКУ".
// 
&НаКлиенте
Процедура СчетСУКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетСУЦС".
//
&НаКлиенте
Процедура СчетСУЦСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетЛьготСУ".
//
&НаКлиенте
Процедура СчетЛьготСУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "ТранзитныйСчетОплаты".
//
&НаКлиенте
Процедура ТранзитныйСчетОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение)
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетСторПКУ".
//
&НаКлиенте
Процедура СчетСторПКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетЛьготСторП".
//
&НаКлиенте
Процедура СчетЛьготСторПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетДохода".
//
&НаКлиенте
Процедура СчетДоходаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" реквизита "Льгота персонифицированная".
//
&НаКлиенте
Процедура ЛьготаПерсонифицированнаяПриИзменении(Элемент)                   
	
	Элементы.ВыводитьЛьготыНаСчетИзвещение.Видимость = Запись.ЛьготаПерсонифицированная;
	Элементы.Декорация1.Видимость = Запись.ЛьготаПерсонифицированная;
	
	Если Не Запись.ЛьготаПерсонифицированная Тогда
		Запись.ВыводитьЛьготыНаСчетИзвещение = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетДохода".
// 
&НаКлиенте
Процедура СчетДоходаПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетДохода, "", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"Субконто1", "Субконто2", "Субконто3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетДохода, Запись, ПоляОбъекта, Истина);
	
	мСчетЛьготСУ = Запись.СчетДохода;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля переключателя "ВариантПодкрутки".
//
&НаКлиенте
Процедура ВариантПодкруткиПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
	Если Запись.ВариантПодкрутки = ПредопределенноеЗначение("Перечисление.бит_ВариантыПодкрутки.ПоСреднему") Тогда
		
		Запись.ПодкруткаНаЛС = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля флажка "ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц".
//
&НаКлиенте
Процедура ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛицПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетЛьготСУ".
//
&НаКлиенте
Процедура СчетЛьготСУПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготСУ, "ЛьготСУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоЛьготСУ1", "СубконтоЛьготСУ2", "СубконтоЛьготСУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетЛьготСУ, Запись, ПоляОбъекта, Истина);
	
	мСчет = Запись.СчетЛьготСУ;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетЛьготСторП".
//
&НаКлиенте
Процедура СчетЛьготСторППриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготСторП, "ЛьготУСО", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоЛьготУСО1", "СубконтоЛьготУСО2", "СубконтоЛьготУСО3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетЛьготСторП, Запись, ПоляОбъекта, Истина);
	
	мСчетЛьготУСО = Запись.СчетЛьготСторП;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетПениУСО".
//
&НаКлиенте
Процедура СчетПениУСООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "НачислятьПени".
//
&НаКлиенте
Процедура НачислятьПениПриИзменении(Элемент)
	
	Если НЕ Запись.НачислятьПени Тогда
		
		Запись.НачислятьПениСУчетомПереплаты = Ложь;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг".
//
&НаКлиенте
Процедура СчетНачисленийРасчетаПредельногоИндексаСобственныхУслугПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг, "НачисленийРасчетаПредельногоИндексаСобственныхУслуг", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг1", "СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг2", "СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг, Запись, ПоляОбъекта, Истина);
	
	мСчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг = Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг".
//
&НаКлиенте
Процедура СчетНачисленийРасчетаПредельногоИндексаСобственныхУслугОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями".
//
&НаКлиенте
Процедура СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациямиПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями, "НачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями1", "СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями2", "СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями, Запись, ПоляОбъекта, Истина);
	
	мСчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями = Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями".
//
&НаКлиенте
Процедура СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациямиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля флажка "РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика".
//
&НаКлиенте
Процедура РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчикаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
	Если НЕ Запись.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика Тогда
		
		Запись.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетПениСУ".
//
&НаКлиенте
Процедура СчетПениСУПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетПениСУ, "ПениСУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоПениСУ1", "СубконтоПениСУ2", "СубконтоПениСУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетПениСУ, Запись, ПоляОбъекта, Истина);
	
	мСчетПени = Запись.СчетПениСУ;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "СчетПениУСО".
//
&НаКлиенте
Процедура СчетПениУСОПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетПениУСО, "ПениУСО", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоПениУСО1", "СубконтоПениУСО2", "СубконтоПениУСО3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетПениУСО, Запись, ПоляОбъекта, Истина);
	
	мСчетПениУСО = Запись.СчетПениУСО;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля флажка "ИспользоватьНомерПолучателяВШК".
//
&НаКлиенте
Процедура ИспользоватьНомерПолучателяВШКПриИзменении(Элемент)
	
	Элементы.НомерПолучателяПоБанку.Доступность        = Запись.ИспользоватьНомерПолучателяВШК;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля переключателя "Переключатель".
//
&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	
	ПереключательПриИзмененииНаСервере();	
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "СчетПениСУ".
//
&НаКлиенте
Процедура СчетПениСУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

// БИТ_ЖКХ 27.01.2017 11:18:31 Начало правки... 
// Процедура - обработчик события "ПриИзменении" поля ввода "ФорматДаты".
&НаКлиенте
Процедура ФорматДатыПриИзменении(Элемент)
	
	ПоказатьФорматДаты();
	
КонецПроцедуры
// БИТ_ЖКХ 27.01.2017 11:18:27 Конец правки.

// БИТ_ЖКХ 24.08.2017 18:24:09 Начало правки...
&НаКлиенте
Процедура СчетЛьготКапРемонтаПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготКапРемонта, "ЛьготКапРем", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоЛьготКапРем1", "СубконтоЛьготКапРем2", "СубконтоЛьготКапРем3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетЛьготКапРемонта, Запись, ПоляОбъекта, Истина);
	
	мСчетЛьготКапРемонта = Запись.СчетЛьготКапРемонта;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПениКапРемонтаПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетПениКапРемонта, "ПениКапРем", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоПениКапРем1", "СубконтоПениКапРем2", "СубконтоПениКапРем3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетПениКапРемонта, Запись, ПоляОбъекта, Истина);
	
	мСчетПениКапРемонта = Запись.СчетПениКапРемонта;
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПениКапРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетЛьготКапРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры
// БИТ_ЖКХ 24.08.2017 18:24:09 Конец правки.

#КонецОбласти

#Область ДействияКомандФормы

// Процедура - обработчик события "Нажатие" кнопки "ЗаполнитьПоУмолчанию".
//
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Запись.ПрефиксРайон 	= "";
	Запись.НеПечататьРайон  = Истина;
	Запись.ПрефиксУлица    	= "ул.";
	Запись.ПрефиксДом      	= "д.";
	Запись.ПрефиксКорпус   	= "корп.";
	Запись.ПрефиксКвартира 	= "кв.";
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ЗаполнитьСчетаПоУмолчанию".
//
&НаКлиенте
Процедура ЗаполнитьСчетаПоУмолчанию(Команда)
	
	СтруктураСчетов = ПланыСчетовНаСервере();
	
	Счет76_КУ   = СтруктураСчетов.Счет76_КУ;
	Счет86_03   = СтруктураСчетов.Счет86_03;
	Счет90_01_1 = СтруктураСчетов.Счет90_01_1;
	Счет76_05   = СтруктураСчетов.Счет76_05;
	Счет76_06   = СтруктураСчетов.Счет76_06;
	Счет60_01   = СтруктураСчетов.Счет60_01;
	
	ЗаполнитьСчета = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.СчетАбонента) ИЛИ НЕ Запись.СчетАбонента = Счет76_КУ
		ИЛИ НЕ ЗначениеЗаполнено(Запись.ТранзитныйСчетОплаты) ИЛИ НЕ Запись.ТранзитныйСчетОплаты = Счет76_06 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетСУКУ)             ИЛИ НЕ Запись.СчетСУКУ = Счет86_03 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетСУЦС)             ИЛИ НЕ Запись.СчетСУЦС = Счет86_03 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетСУАренды)         ИЛИ НЕ Запись.СчетСУАренды = Счет90_01_1 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетЛьготСУ)          ИЛИ НЕ Запись.СчетЛьготСУ = Счет76_05 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетСторПКУ)          ИЛИ НЕ Запись.СчетСторПКУ = Счет76_05 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетСторПКУОплата)    ИЛИ НЕ Запись.СчетСторПКУОплата = Счет60_01
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетЛьготСторП)       ИЛИ НЕ Запись.СчетЛьготСторП = Счет76_05
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг)          
		ИЛИ НЕ Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг = Счет76_05
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями)       
		ИЛИ НЕ Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями = Счет76_05
		ИЛИ НЕ ЗначениеЗаполнено(Запись.СчетДохода)           ИЛИ НЕ Запись.СчетДохода = Счет90_01_1 Тогда
		
		ЗаполнитьСчета = Истина;
		
	КонецЕсли;
	
	Если ЗаполнитьСчета Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьСчетаПоУмолчаниюЗавершение", ЭтотОбъект, Новый Структура("Счет60_01, Счет76_05, Счет76_06, Счет76_КУ, Счет86_03, Счет90_01_1", Счет60_01, Счет76_05, Счет76_06, Счет76_КУ, Счет86_03, Счет90_01_1)), "Все счета будут заполнены по умолчанию. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заменяет заголовок у надписей субконто в зависимости от типа субконто.
//
&НаСервере
Процедура УстановитьВидимостьСубконто()
	
	Для Ном = 1 по 3 Цикл
		
		Если (Ном <= Запись.СчетДохода.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетДохода)) Тогда
			Элементы["Субконто"+Ном].Заголовок = Строка(Запись.СчетДохода.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["Субконто"+Ном].Видимость        = Истина;
		Иначе
			Элементы["Субконто"+Ном].Видимость        = Ложь;
			
		КонецЕсли;
		
		Если (Ном <= Запись.СчетПениСУ.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетПениСУ)) Тогда
			Элементы["СубконтоПениСУ"+Ном].Заголовок = Строка(Запись.СчетПениСУ.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоПениСУ"+Ном].Видимость        = Истина;
		Иначе
			Элементы["СубконтоПениСУ"+Ном].Видимость        = Ложь;
			
		КонецЕсли;
		
		Если (Ном <= Запись.СчетПениКапРемонта.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетПениКапРемонта)) Тогда
			Элементы["СубконтоПениКапРем"+Ном].Заголовок = Строка(Запись.СчетПениКапРемонта.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоПениКапРем"+Ном].Видимость        = Истина;
		Иначе
			Элементы["СубконтоПениКапРем"+Ном].Видимость        = Ложь;
		КонецЕсли;
		
		ЕстьСубконтоКонтрагент = Запись.СчетПениУСО.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
		
		Если (Ном <= Запись.СчетПениУСО.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетПениУСО)) И ЕстьСубконтоКонтрагент = Неопределено Тогда
			Элементы["СубконтоПениУСО"+Ном].Заголовок = Строка(Запись.СчетПениУСО.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоПениУСО"+Ном].Видимость        = Истина;
		Иначе
			Элементы["СубконтоПениУСО"+Ном].Видимость        = Ложь;
			
		КонецЕсли;
		
		Если (Ном <= Запись.СчетЛьготСторП.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетЛьготСторП)) Тогда
			Элементы["СубконтоЛьготУСО"+Ном].Заголовок = Строка(Запись.СчетЛьготСторП.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоЛьготУСО"+Ном].Видимость        = Истина;
		Иначе
			Элементы["СубконтоЛьготУСО"+Ном].Видимость        = Ложь;
			
		КонецЕсли;
		
		Если (Ном <= Запись.СчетЛьготСУ.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетЛьготСУ)) Тогда
			Элементы["СубконтоЛьготСУ"+Ном].Заголовок = Строка(Запись.СчетЛьготСУ.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоЛьготСУ"+Ном].Видимость        = Истина;
		Иначе
			Элементы["СубконтоЛьготСУ"+Ном].Видимость        = Ложь;
			
		КонецЕсли;
		
		Если (Ном <= Запись.СчетЛьготКапРемонта.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетЛьготКапРемонта)) Тогда
			Элементы["СубконтоЛьготКапРем"+Ном].Заголовок = Строка(Запись.СчетЛьготКапРемонта.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоЛьготКапРем"+Ном].Видимость        = Истина;
		Иначе
			Элементы["СубконтоЛьготКапРем"+Ном].Видимость        = Ложь;
		КонецЕсли;
		
		Если (Ном <= Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг)) Тогда
			
			Элементы["СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг"+Ном].Заголовок = Строка(Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг"+Ном].Видимость        = Истина;
			
		Иначе
			
			Элементы["СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг"+Ном].Видимость        = Ложь;
			
		КонецЕсли;
		
		Если (Ном <= Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями.ВидыСубконто.Количество()) и (ЗначениеЗаполнено(Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями)) Тогда
			
			Элементы["СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями"+Ном].Заголовок = Строка(Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг.ВидыСубконто[Ном-1].ВидСубконто);
			Элементы["СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями"+Ном].Видимость        = Истина;
			
		Иначе
			
			Элементы["СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями"+Ном].Видимость        = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчетаПоУмолчаниюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Счет60_01 = ДополнительныеПараметры.Счет60_01;
	Счет76_05 = ДополнительныеПараметры.Счет76_05;
	Счет76_06 = ДополнительныеПараметры.Счет76_06;
	Счет76_КУ = ДополнительныеПараметры.Счет76_КУ;
	Счет86_03 = ДополнительныеПараметры.Счет86_03;
	Счет90_01_1 = ДополнительныеПараметры.Счет90_01_1;
	
	Ответ = РезультатВопроса ;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат
	КонецЕсли;
	
	// БИТ_ЖКХ 24.03.2014
	Запись.СчетАбонента         = Счет76_КУ;
	Запись.ТранзитныйСчетОплаты = Счет76_06; 
	Запись.СчетСУКУ             = Счет86_03; 
	Запись.СчетСУЦС             = Счет86_03; 
	Запись.СчетСУАренды         = Счет90_01_1; 
	Запись.СчетЛьготСУ          = Счет76_05; 
	Запись.СчетСторПКУ          = Счет76_05; 
	Запись.СчетСторПКУОплата    = Счет60_01; 
	Запись.СчетЛьготСторП       = Счет76_05;
	Запись.СчетДохода           = Счет90_01_1;
	Запись.СчетЛьготКапРемонта	= Счет76_05;
	// БИТ_ЖКХ 24.03.2014
	
	Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг = Счет76_05;
	Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями = Счет76_05;
	
	СчетДоходаПриИзменении(Элементы.СчетДохода);
	
	// БИТ_ЖКХ 22.05.2015{{
	// Автоматическое заполнение аналитик счета льготы и счета расчета предельного индекса.
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготСУ, "ЛьготСУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоЛьготСУ1", "СубконтоЛьготСУ2", "СубконтоЛьготСУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетЛьготСУ, Запись, ПоляОбъекта, Истина);
	
	мСчет = Запись.СчетЛьготСУ;
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготСторП, "ЛьготУСО", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоЛьготУСО1", "СубконтоЛьготУСО2", "СубконтоЛьготУСО3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетЛьготСторП, Запись, ПоляОбъекта, Истина);
	
	мСчетЛьготУСО = Запись.СчетЛьготСторП;
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг, "НачисленийРасчетаПредельногоИндексаСобственныхУслуг", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг1", "СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг2", "СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг, Запись, ПоляОбъекта, Истина);
	
	мСчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг = Запись.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг;
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями, "НачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями1", "СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями2", "СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями, Запись, ПоляОбъекта, Истина);
	
	мСчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями = Запись.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями;
	
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, Запись.СчетЛьготКапРемонта, "ЛьготКапРем", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоЛьготКапРем1", "СубконтоЛьготКапРем2", "СубконтоЛьготКапРем3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Запись.СчетЛьготКапРемонта, Запись, ПоляОбъекта, Истина);

	мСчетЛьготКапРемонта = Запись.СчетЛьготКапРемонта;
	
	УстановитьВидимостьСубконто();
	// БИТ_ЖКХ 22.05.2015}}

КонецПроцедуры

// Процедура - изменяет видимость элементов формы.
//
&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ВыводитьЛьготыНаСчетИзвещение.Видимость            = Запись.ЛьготаПерсонифицированная;
	
	Элементы.НомерПолучателяПоБанку.Доступность                 = Запись.ИспользоватьНомерПолучателяВШК;
	
	Элементы.ВариантПодкрутки.Видимость                         = Запись.СчетчикиПодкрутка;
	Элементы.ПодкруткаНаЛС.Видимость                            = Запись.СчетчикиПодкрутка;
	Элементы.КоличествоМесяцевПодкрутки.Видимость               = Запись.СчетчикиПодкрутка;
	
	Элементы.КоличествоМесяцевПодкрутки.Доступность             = Запись.ВариантПодкрутки = ПредопределенноеЗначение("Перечисление.бит_ВариантыПодкрутки.ПоСреднему");
	
	
	Элементы.ПодкруткаНаЛС.Доступность = НЕ Запись.ВариантПодкрутки = ПредопределенноеЗначение("Перечисление.бит_ВариантыПодкрутки.ПоСреднему");
	
	Элементы.Контрагент.Доступность                             = НЕ Запись.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц;
	Элементы.ФормироватьАктИРеализациюПоКонтрагенту.Доступность = НЕ Запись.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц;
	
	Элементы.НачислятьПениСУчетомПереплаты.Доступность = Запись.НачислятьПени;
	
	Элементы.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика.Видимость = Запись.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	
КонецПроцедуры

// Функция - получает и возвращает планы счетов на сервере.
//
&НаСервере
Функция ПланыСчетовНаСервере()
	
	Счет76_КУ   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.КУ");
	Счет86_03   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("86.03");
	Счет90_01_1 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.01.1");
	Счет76_05   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05");
	Счет76_06   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06");
	Счет60_01   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01");
	
	СтруктураСчетов = Новый Структура;
	СтруктураСчетов.Вставить("Счет76_КУ",Счет76_КУ);
	СтруктураСчетов.Вставить("Счет86_03",Счет86_03);
	СтруктураСчетов.Вставить("Счет90_01_1",Счет90_01_1);
	СтруктураСчетов.Вставить("Счет76_05",Счет76_05);
	СтруктураСчетов.Вставить("Счет76_06",Счет76_06);
	СтруктураСчетов.Вставить("Счет60_01",Счет60_01);
	
	Возврат СтруктураСчетов;
	
КонецФункции	

// Процедура - записывает данные в ресурс при переключении.
//
&НаСервере
Процедура ПереключательПриИзмененииНаСервере()
	
	ЗаписьМенеджерЗаписи = ДанныеФормыВЗначение(Запись, Тип("РегистрСведенийМенеджерЗаписи.бит_НастройкаПараметровЖКХ"));
	
	Если Переключатель = 2 Тогда	
		Запись.ОбщедомовыеРасходыВГрафеНачисления = Ложь;
		
		
		ЗаписьМенеджерЗаписи.ОбщедомовыеРасходыВГрафеНачисления = Ложь;
		Начисления = Истина;
	Иначе
		Запись.ОбщедомовыеРасходыВГрафеНачисления = Истина;
		
		ЗаписьМенеджерЗаписи.ОбщедомовыеРасходыВГрафеНачисления = Истина;
		Начисления = Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

// Процедура - определяет тип субконто 1, 2, 3.
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоНачисления(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
	"Субконто" + Постфикс + "1", 
	"Субконто" + Постфикс + "2", 
	"Субконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);
	
КонецПроцедуры

// БИТ_ЖКХ 26.03.2014
&НаКлиенте
Процедура ЗаполнениеОрганизации()
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		
		Запись.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
		
	КонецЕсли;	
	
КонецПроцедуры
// БИТ_ЖКХ 26.03.2014

// БИТ_ЖКХ 27.01.2017 11:10:30 Начало правки...
&НаКлиенте
Процедура ПоказатьФорматДаты()
	
	Если ЗначениеЗаполнено(Запись.ФорматДаты) Тогда
		Попытка
			Элементы.Декорация13.Заголовок = "Формат: " + Формат(ТекущаяДата(), "ДФ='" + Запись.ФорматДаты + "'");
		Исключение
			Элементы.Декорация13.Заголовок = "Ошибка в настройке формата!";
		КонецПопытки;
	Иначе
		Элементы.Декорация13.Заголовок = "Формат: " + Формат(ТекущаяДата(), "ДФ='ММ.гггг'");
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 27.01.2017 11:10:30 Конец правки.

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мЛьготаПерсонифицированная = Ложь; // Устанавливает значение льготы персонифицированной.

#КонецОбласти