//Функция СведенияОВнешнейОбработке() Экспорт
//	
//	//Назначения = Новый Массив ;
//	//Назначения.Добавить("Документ.бит_РеестрПлатежей") ;
//	
//	ПараметрыРегистрации = Новый Структура ;
//	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
//	//ПараметрыРегистрации.Вставить("Назначение",Назначения);
//	ПараметрыРегистрации.Вставить("Наименование","Выгрузка информации о начислениях по услугам (csv)");
//	ПараметрыРегистрации.Вставить("Версия","1.0");
//	ПараметрыРегистрации.Вставить("Информация","Выгрузка информации о начислениях по услугам (csv)");
//	ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
//	
//	Команды = Новый ТаблицаЗначений ;
//	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
//	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
//	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
//	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
//	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
//	
//	НоваяКоманда = Команды.Добавить();
//	НоваяКоманда.Представление = "Выгрузка информации о начислениях по услугам (csv)";
//	НоваяКоманда.Идентификатор = "бит_ВыгрузкаНачислений";
//	НоваяКоманда.Использование = "ОткрытиеФормы";
//	НоваяКоманда.ПоказыватьОповещение = Ложь;
//	НоваяКоманда.Модификатор = Неопределено;
//	
//	ПараметрыРегистрации.Вставить("Команды",Команды) ;
//	
//	Возврат ПараметрыРегистрации;
//	
//КонецФункции