
&НаКлиенте
Процедура Запуск(Команда)
	ЗапускНаСервере();
	Сообщить("Заполнено " + строка(Количество) + " значений");
КонецПроцедуры

&НаСервере
Процедура ЗапускНаСервере()
	Количество = 0;
	Выборка = Справочники.бит_Проживающие.Выбрать(); // Получение выборки всех элементов справочника
    Пока Выборка.Следующий() Цикл
     объектПроживающий = Выборка.Ссылка.ПолучитьОбъект();
	 
	 Отбор = Новый Структура();
	 Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПроживающего"));
	
	 Строки = объектПроживающий.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	 Если Строки.количество() > 0 и ЗначениеЗаполнено(объектПроживающий.EmailПроживающего) = ложь Тогда	
		
		объектПроживающий.EmailПроживающего = Строки[0].Представление;
		Количество = Количество + 1;
	 КонецЕсли;		
     
	 объектПроживающий.Записать();
    КонецЦикла;
КонецПроцедуры
