
#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

&НаСервере
Процедура ВызватьРасчет()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ВыполнитьРасчет();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти


#Область ДействияКомандФорм

&НаКлиенте
Процедура ВыполнитьРасчет(Команда)
	
	Если НЕ Объект.Проведен Тогда
		
		Объект.Начисления.Очистить();
		
		ВызватьРасчет();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед выполнением расчетов, распроведите документ.";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Объект.Здание = Неопределено;
	Объект.Начисления.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ВыбранноеЗначение = Объект.Здание Тогда
	
		Объект.Начисления.Очистить();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НачисленияСчетАбонентаПриИзменении(Элемент)
	
	СтрокаПлатеж  = Элементы.Начисления.ТекущиеДанные;
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
								  "Субконто1", "Субконто2", "Субконто3");
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСчетАбонентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура НачисленияСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.Начисления.ТекущиеДанные;
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.Начисления.ТекущиеДанные;
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
								  "СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);

КонецПроцедуры

&НаКлиенте
Процедура НачисленияСчетКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
								"НачисленияСубконто" + Постфикс + "1", 
								"НачисленияСубконто" + Постфикс + "2", 
								"НачисленияСубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(Форма)
	
	СтрокаПлатеж       = Форма.Объект.Начисления.НайтиПоИдентификатору(Форма.Элементы.Начисления.ТекущаяСтрока);
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "НачисленияСубконто%Индекс%", ПараметрыДокумента);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "НачисленияСубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	
	Для Индекс = 1 По 3 Цикл
		
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

#КонецОбласти
