
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЛицевойСчет") Тогда
		
		ИспользоватьЛицевойСчет = Истина;
		ЛицевойСчет = Параметры.ЛицевойСчет;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_ЛицевойСчет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = Параметры.ЛицевойСчет;
	   	
		ЭлементОтбора = СписокАрхивный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_ЛицевойСчет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = Параметры.ЛицевойСчет;
	   	
	КонецЕсли;
	
	Если Параметры.Свойство("Проживающий") Тогда
		
		ИспользоватьПроживающего = Истина;
		Проживающий = Параметры.Проживающий;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Проживающий");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = Параметры.Проживающий;
	   	
		ЭлементОтбора = СписокАрхивный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Проживающий");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = Параметры.Проживающий;
	   	
	КонецЕсли;
	
	Элементы.ЛицевойСчет.Доступность = ИспользоватьЛицевойСчет;
	Элементы.Проживающий.Доступность = ИспользоватьПроживающего;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Архивный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементОтбора = СписокАрхивный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Архивный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОтбора.ПравоеЗначение = Истина;
	   	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОформление()
	Элементы.ЛицевойСчет.Доступность = ИспользоватьЛицевойСчет;
	Элементы.Проживающий.Доступность = ИспользоватьПроживающего;
	НастроитьВидимостьСписков();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЛицевойСчетПриИзменении(Элемент)
	НастроитьОформление();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьСписков()
	
	Список.Отбор.Элементы.Очистить();
	СписокАрхивный.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Архивный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементОтбора = СписокАрхивный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Архивный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	Если ИспользоватьЛицевойСчет Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_ЛицевойСчет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = ЛицевойСчет;
	   	
		ЭлементОтбора = СписокАрхивный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_ЛицевойСчет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = ЛицевойСчет;
		
	КонецЕсли;
	
	Если ИспользоватьПроживающего Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Проживающий");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = Проживающий;
	   	
		ЭлементОтбора = СписокАрхивный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("бит_Проживающий");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = Проживающий;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПроживающегоПриИзменении(Элемент)
	НастроитьОформление();
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	НастроитьОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПроживающийПриИзменении(Элемент)
	НастроитьОформление();
КонецПроцедуры

&НаСервере
Процедура УстановитьАрихвНаСервере(МассивДокументов)
	
	Для Каждого Элем Из МассивДокументов Цикл
		
	   	Док = Элем.ПолучитьОбъект();
		Док.бит_Архивный = Не Элем.бит_Архивный;
		Док.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАрихв(Команда)
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "АктуальныеДокументы" Тогда
		МассивДокументов = Элементы.Список.ВыделенныеСтроки;
	ИначеЕсли Элементы.Группа1.ТекущаяСтраница.Имя = "АрхивныеДокументы" Тогда
		МассивДокументов = Элементы.СписокАрхивный.ВыделенныеСтроки;
	КонецЕсли;
	УстановитьАрихвНаСервере(МассивДокументов);
	Элементы.Список.Обновить();
	Элементы.СписокАрхивный.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПроживающего", ЭтаФорма);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЛицевойСчет", ЛицевойСчет);
	ОткрытьФорму("Справочник.бит_Проживающие.ФормаВыбора", ПараметрыОтбора, , , , , ОписаниеВыбора, );
		
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборПроживающего(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда 
		Возврат;	
	КонецЕсли;
	
	Проживающий = РезультатЗакрытия;
	
КонецПроцедуры // ОбработатьВыборПроживающего()





