
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоУлицеЗданию") Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Параметры.ОтборПоУлицеЗданию.Здание;
		Эл.Использование    = ?(ЗначениеЗаполнено(Параметры.ОтборПоУлицеЗданию.Здание),Истина,Ложь);
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Если Эл.Использование Тогда
			
			Эл.ПравоеЗначение      = Параметры.ОтборПоУлицеЗданию.Здание;
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
