
#Область ПроцедурыИФункцииРаботыСоСчетамиИСубконто

Функция ПолучитьСвойстваСчета(Счет) Экспорт
	
	ДанныеСчета = Новый Структура;
	
	ДанныеСчета.Вставить("Ссылка"                         , Счет.Ссылка);
	ДанныеСчета.Вставить("Наименование"                   , Счет.Наименование);
	ДанныеСчета.Вставить("Код"                            , Счет.Код);
	ДанныеСчета.Вставить("Родитель"                       , Счет.Родитель);
	ДанныеСчета.Вставить("Наименование"                   , Счет.Наименование);
	ДанныеСчета.Вставить("Вид"                            , Счет.Вид);
	ДанныеСчета.Вставить("Забалансовый"                   , Счет.Забалансовый);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Счет.ЗапретитьИспользоватьВПроводках);
	ДанныеСчета.Вставить("Валютный"                       , Счет.Валютный);
	ДанныеСчета.Вставить("Количественный"                 , Счет.Количественный);
	ДанныеСчета.Вставить("УчетПоПодразделениям"           , Счет.УчетПоПодразделениям);
	ДанныеСчета.Вставить("НалоговыйУчет"                  , Счет.НалоговыйУчет);
	ДанныеСчета.Вставить("КоличествоСубконто"             , Счет.ВидыСубконто.Количество());
	
	МаксКоличествоСубконто = ПолучитьМаксКоличествоСубконто();
	Для Индекс = 1 По МаксКоличествоСубконто Цикл
		Если Индекс <= Счет.ВидыСубконто.Количество() Тогда
			ДанныеСчета.Вставить("ВидСубконто" + Индекс,                   Счет.ВидыСубконто[Индекс - 1].ВидСубконто);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "Наименование",  Строка(Счет.ВидыСубконто[Индекс - 1].ВидСубконто));
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "ТипЗначения",   Счет.ВидыСубконто[Индекс - 1].ВидСубконто.ТипЗначения);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "Суммовой",      Строка(Счет.ВидыСубконто[Индекс - 1].Суммовой));
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "ТолькоОбороты", Строка(Счет.ВидыСубконто[Индекс - 1].ТолькоОбороты));
		Иначе
			ДанныеСчета.Вставить("ВидСубконто" + Индекс,                   Неопределено);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "Наименование",  Неопределено);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "ТипЗначения",   Неопределено);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "Суммовой",      Ложь);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "ТолькоОбороты", Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеСчета;
	
КонецФункции

Функция ПолучитьМаксКоличествоСубконто() Экспорт
	
	Возврат Метаданные.ПланыСчетов.Хозрасчетный.МаксКоличествоСубконто;
	
КонецФункции

// Функция проверяет возможность использования счета в проводках.
//
// Параметры:
//  Счет     - Проверяемый счет.
//  Сообщать - признак вывода сообщений.
//
// Возвращаемое значение:
//  Булево - возможность использования счета в проводках.
//  
//
Функция СчетМожноИспользоватьВПроводках(Счет, Сообщать = Истина) Экспорт
	
	Если ТипЗнч(Счет) <> Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		
		Возврат Ложь; // Неправильный тип.
		
	КонецЕсли;
	
	Если Счет = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
		
		Возврат Истина; // Пустая ссылка может использоваться.
		
	КонецЕсли;
	
	Если Счет.ЗапретитьИспользоватьВПроводках Тогда
		
		Если Сообщать Тогда
			ТекстСообщения = НСтр("ru = 'Счет %1 ""%2"" нельзя использовать в проводках.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СокрЛП(Счет), Счет.Наименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Возврат Ложь; // Счет использовать в проводках нельзя.
		
	КонецЕсли;
	
	Возврат Истина; // Счет можно использовать в проводках. 
	
КонецФункции // СчетМожноИспользоватьВПроводках()

#КонецОбласти
