
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОткрытьИзПодразделенийОрганизации") Тогда
		
		 ПодразделениеОрганизации = Параметры.ОткрытьИзПодразделенийОрганизации.Владелец;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборИВыборПоВладельцу();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	
	ОтборИВыборПоВладельцу();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура уставноки отбора.
//                                                 
&НаКлиенте
Процедура ОтборИВыборПоВладельцу()
	
	Список.Отбор.Элементы.Очистить();
	
	Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = ПодразделениеОрганизации;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры

#КонецОбласти