
#Область ЭкспортныеПроцедруыИФункции

// Функция проверяет проведенность документав для выполнения печати.
//
// Параметры:
//  ПараметрКоманды - Массив, Ссылка.
//
// Возвращаемое значение:
//  Результат - Тип.
// 
Функция ПроверитьПроведенностьДокументов(ПараметрКоманды) Экспорт
	
	МассивДокументов = ПолучитьМассивСсылок(ПараметрКоманды);
	
	Если МассивДокументов.Количество() = 0 Тогда
		// Нет документов.
		Возврат Ложь;
	КонецЕсли;
	
	// Получим количество непроведенных документов.
	МассивНепроведенных 	= бит_ПечатьСервер.ПолучитьМассивНепроведенныхДокументов(МассивДокументов);
	КоличествоНепроведенных = МассивНепроведенных.Количество();
	
	Если КоличествоНепроведенных > 0 Тогда
		
		Если КоличествоНепроведенных = 1 Тогда
			ТекстВопроса = НСтр("ru = 'Чтобы распечатать документ, его требуется провести. 
								|Выполнить проведение документа и продолжить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Чтобы распечатать документы, их требуется провести. 
								|Выполнить проведение документов и продолжить?'");
		КонецЕсли;
		
		МассивНепроведенных = бит_ПечатьСервер.ПровестиНепроведенныеДокументы(МассивНепроведенных);
		ОповеститьОбИзменении(ТипЗнч(МассивДокументов[0]));
		
	КонецЕсли;
	
	Для Каждого ТекДокумент Из МассивНепроведенных Цикл
		
		НайденныйДокумент = МассивДокументов.Найти(ТекДокумент);
		
		Если Не НайденныйДокумент = Неопределено Тогда
			
			МассивДокументов.Удалить(НайденныйДокумент);
			
			ТекстСообщения = НСтр("ru = 'Документ " + Строка(ТекДокумент) + " не проведен. Печать не возможна.'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения, ТекДокумент);
			
		КонецЕсли;
				
	КонецЦикла;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		// Возможно количество документов для печати было уменьшино, запишем массив документов для печати.
		ПараметрКоманды = МассивДокументов;
	КонецЕсли;
	
	Если МассивДокументов.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПроверитьПроведенностьДокументов()

// Процедура обрабатывает команду печати.
//
// Параметры:
//  ИмяКоллекции		- Строка. ("Справочники", "Документы"...).
//  ИмяОбъекта			- Строка.
//  ИмяМакета	   		- Строка.
//  ПредставлениеМакета - Строка. По умолчанию "".
//  ПараметрКоманды		- Массив, Ссылка.
//  ВладелецФормы		- Произвольный. По умолчанию Неопределено.
//  ПараметрыПечати 	- Структура. По умолчанию Неопределено.
// 
Процедура ОбработатьКомандуПечати(ИмяКоллекции
								 ,ИмяОбъекта
								 ,ИмяМакета
								 ,ПредставлениеМакета = ""
								 
								 ,АдресТабличногоДокументаВоВременномХранилище
								 
								 ,ПараметрКоманды
								 ,ВладелецФормы   = Неопределено
								 ,ПараметрыПечати = Неопределено) Экспорт
	
	// Получим ключ уникальности открываемой формы.
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяКоллекции"	 	 , ИмяКоллекции);
	ПараметрыФормы.Вставить("ИмяОбъекта"	 	 , ИмяОбъекта);
	ПараметрыФормы.Вставить("ИмяМакета"		 	 , ИмяМакета);
	ПараметрыФормы.Вставить("ПредставлениеМакета", ПредставлениеМакета);
	ПараметрыФормы.Вставить("Ссылка" 	 	     , ПараметрКоманды);
	ПараметрыФормы.Вставить("ПараметрыПечати"	 , ПараметрыПечати);
	
	ПараметрыФормы.Вставить("Адрес"	             , АдресТабличногоДокументаВоВременномХранилище);
	
	// Откроем форму печати документов.
	ОткрытьФорму("ОбщаяФорма.бит_ФормаПечатиУправляемая", ПараметрыФормы, ВладелецФормы, КлючУникальности);
	
КонецПроцедуры // ОбработатьКомандуПечати()

// Функция получает массив ссылок.
//
// Параметры:
//  ПараметрКоманды - Массив, Ссылка.
//
// Возвращаемое значение:
//  МассивСсылок - Массив.
// 
Функция ПолучитьМассивСсылок(ПараметрКоманды) Экспорт
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Возврат ПараметрКоманды;
	Иначе
		
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(ПараметрКоманды);
		
		Возврат МассивСсылок;
	КонецЕсли;
	
КонецФункции // ПолучитьМассивСсылок()

// БИТ_ЖКХ 14.09.2015 16:24:31 Начало правки...

//Процедуры ищут торговое оборудование добавленное в табличную часть КассыККМ. В случае наличия нескольких ФР предлагает их на выбор.
//
Процедура ПредложитьВыбратьУстройство(ОповещениеВыбора, ТипОборудования, ТекстЗаголовкаВыбора, СообщениеНеПодключен, КассаККМ, БезСообщений = Ложь) Экспорт
	
	СписокДоступныхУстройств = бит_ПечатьСервер.ПолучитьСписокОборудования(ТипОборудования, КассаККМ);

	Если СписокДоступныхУстройств.Количество() = 0 Тогда
		Если Не ПустаяСтрока(СообщениеНеПодключен) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеНеПодключен);
		КонецЕсли;
		ВыполнитьОбработкуОповещения(ОповещениеВыбора, Неопределено);
	Иначе
		СписокУстройств = Новый СписокЗначений();
		Для Каждого Устройства Из СписокДоступныхУстройств Цикл
			СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
		КонецЦикла;
		Если СписокУстройств.Количество() = 1 Тогда
			Идентификатор = СписокУстройств[0].Значение;
			ВыполнитьОбработкуОповещения(ОповещениеВыбора, Идентификатор); 
		Иначе
			Контекст = Новый Структура;
			Контекст.Вставить("СледующееОповещение", ОповещениеВыбора);
			Контекст.Вставить("СообщениеНеВыбран"  , СообщениеНеПодключен);
			Контекст.Вставить("БезСообщений"       , БезСообщений);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
			СписокУстройств.ПоказатьВыборЭлемента(ОписаниеОповещения, ТекстЗаголовкаВыбора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредложитьВыбратьУстройствоЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено И НЕ Параметры.БезСообщений И Не ПустаяСтрока(Параметры.СообщениеНеВыбран) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Параметры.СообщениеНеВыбран);
	КонецЕсли;
	
	Если Параметры.СледующееОповещение <> Неопределено Тогда
		Идентификатор = ?(Результат = Неопределено, Неопределено, Результат.Значение);
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Идентификатор);
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 14.09.2015 16:24:31 Конец правки.

#КонецОбласти