///////////////////////////////////////////////////////////////////////////////////////////////////////////


Перем мСтруктураДанных;                  // Структура        - хранит данные шапки печатных документов.
Перем мНастройкиМакета Экспорт;          // СправочникСсылка, Структура - Хранит настройки печати макета.
Перем мТаблицаСвойств;                   // Таблица дополнительны сведений по лицевому счету.
Перем мВнешняяКомпонента;                // COMОбъект - хранит внешнюю компоненту.
Перем мКэшПараметрыЖКХ Экспорт;          // Структура                   - хранит параметры учета ЖУХ и настройки печати.
Перем мТаблицаПечати;                    // Таблица значений - Таблица начислений по лицевому счету.
Перем мТаблицаПечатиСчетчиков;           // Таблица значений - Таблица приборов учета.
Перем мТаблицаОбщедомовыхСчетчиков;      // Таблица общедомовых счетчиков.
Перем мТаблицаПерерасчетов;              // Таблица значений - Таблица перерасчетов по лицевому счету.
Перем мМакет;
Перем мКэшПолучателяПлатежа  Экспорт;    // Структура                   - хранит информацию по организации.

&НаСервере
Процедура ТестСоединенияНаСервере()
	
	ДобавитьЛог("Тест соединения");
	
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v2/applications/"+Строка(СокрЛП(Объект.НомерПриложения));
	СтрокаПараметров = "";
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		ДобавитьЛог("Тест соединения. Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					ДобавитьЛог("Соединение не установлено");
					Сообщить("Соединение не установлено");
				Иначе
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Ложь, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					ДобавитьЛог("Соединение установлено с "+Строка(ЗагруженныеДанные.ShortDescription));
					Сообщить("Соединение установлено с "+Строка(ЗагруженныеДанные.ShortDescription));
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			ДобавитьЛог("Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			ДобавитьЛог("Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			ДобавитьЛог("Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			ДобавитьЛог("Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;
	//Теперь заполним данные о статусах обращений
	ПодгрузитьСтатусы();
	
КонецПроцедуры

Процедура ПодгрузитьСтатусы()
	//вместо objects или events пиши statuses. например api/v2/statuses
	
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v4/statuses?ApplicationId="+Объект.НомерПриложения;
	//Запрос1 = КодироватьСтроку(Строка(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
	//СтрокаПараметров = "ApplicationId="+Запрос1;
	//
	//HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса+ СтрокаПараметров);
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
		ЕстьОтвет = Ложь;
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					Сообщить("Соединение не установлено");
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					ТЗ = РаспарситьСтатусы(ЗагруженныеДанные);
					
					Для Каждого СтрСтатус Из ТЗ Цикл
						Если Найти(нрег(СтрСтатус.Статус),"закрыт")<>0 Тогда
							Объект.СтатусЗакрыто = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"отклонен")<>0 Тогда
							Объект.СтатусОтклонено = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"обработан")<>0 Тогда
							Объект.СтатусОбработано = СтрСтатус.Ид_Статуса;
	                    ИначеЕсли Найти(нрег(СтрСтатус.Статус),"работе")<>0 Тогда
							Объект.СтатусВРаботе = СтрСтатус.Ид_Статуса;
						КонецЕсли;	
						
					КонецЦикла;	
					//
					//ОтправитьДетализацию(ТЗ);
					//
					//Сообщить(РезультатПроверки);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Обновление статусов. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Обновление статусов. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Обновление статусов. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Обновление статусов. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	
&НаКлиенте
Процедура ТестСоединения(Команда)
	ТестСоединенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьДанныеПоЛицевымСчетамНаСервере() Экспорт
	
	Если Объект.ЭкспортНачисления Тогда
		ДетализацияНачислений();
	КонецЕсли;
	
	Если Объект.ЭкспортКвитанции Тогда
		ПроверитьЗапросыИОтправитьКвитанции();
	КонецЕсли;	
	
	
	Если Объект.ЭкспортПлатежи Тогда
		ЭкспортПлатежи();
	КонецЕсли;
	
	Если Объект.ИмпортПоказанияСчетчиков Тогда
		СДаты = НачалоМесяца(ТекущаяДата());
		ПоДату = КонецМесяца(ТекущаяДата());
		ПолучитьПоказанияСчетчиков(СДаты, ПоДату);
	Конецесли;	
	
	Если Объект.ИмпортПлатежи Тогда
		ИмпортПлатежейВМобстед();
	КонецЕсли;	
КонецПроцедуры
&НаСервере
Процедура ОтправитьИОбновитьДанныеПоЛицевымСчетамНаСервере() Экспорт
	//Phone, Email, Имя_Отчество, Город, Улица, Дом, Корпус, Квартира, ApiSumma, 	
	Для Каждого Стр Из ТаблицаЛицевыхСчетов Цикл
		Если Стр.ЕстьВМобстед Тогда
			//Сообщить(Стр.ЛицевойСчет.Наименование);
			Если Объект.ЭкспортЛицевыеСчета Тогда
				ОтправитьВМобстедЛицевойСчет(Стр.ЛицевойСчет);
			КонецЕсли;
			Если Объект.ЭкспортСчетчики Тогда
				СоздатьСчетчики(Стр.ЛицевойСчет);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ОтправитьВМобстедЛицевойСчет(ЛицевойСчет)
	
	ЕстьОтвет = Истина;
	
	Структура = ПолучитьСтруктуруДанныхЛицевогоСчета(ЛицевойСчет);
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса1 = "/api/v2/objects/createupdate";
	
	Запрос1 = "{"+"""ApplicationId"""+":"+СТрока(СокрЛП(Объект.НомерПриложения))+","+"""ЛС"""+":"+""""+СокрЛП(ЛицевойСчет.Наименование)+""""+"}"; 
	Запрос1 = КодироватьСтроку(Запрос1,СпособКодированияСтроки.КодировкаURL);
	Запрос2 = "{"+"""ApiSumma"""+":"+""""+Строка(Структура.ApiSumma)+""""+","+
	"""Phone"""   +":"+""""+Строка(Структура.Phone)+""""+","+
	//"""Phone"""   +":"+""""+Строка(Структура.Phone)+""""+","+
	"""Email"""   +":"+""""+Строка(Структура.Email)+""""+","+
	"""Наименование"""+":"+""""+Строка(Структура.Имя_Отчество)+""""+","+
	"""НомерЛицевогоСчета"""+":"+""""+Строка(ЛицевойСчет.Наименование)+""""+","+
	"""Имя_Отчество"""+":"+""""+Строка(Структура.Имя_Отчество)+""""+","+
	"""Код1С"""   +":"+""""+Строка(ЛицевойСчет.Код)+""""+","+
	"""Помещение"""   +":"+""""+Строка(Структура.Помещение)+""""+","+
	"""Улица"""   +":"+""""+Строка(Структура.Улица)+""""+","+
	"""Enabled"""   +":"+""""+Строка(1)+""""+","+
	"""Здание"""     +":"+""""+Строка(Структура.Дом)+""""+","+
	"""Корпус"""  +":"+""""+Строка(Структура.Корпус)+""""+","+
	"""Город"""   +":"+""""+Строка(Структура.Город)+""""+","+
	"""НомерКвартиры"""+":"+""""+Строка(Структура.Квартира)+""""+"}";
	Запрос2 = КодироватьСтроку(Запрос2,СпособКодированияСтроки.КодировкаURL);
	
	СтрокаПараметров = "create="+Запрос1+"&update="+Запрос2;
	//СтрокаПараметров = КодироватьСтроку(СтрокаПараметров,СпособКодированияСтроки.КодировкаURL);
	//Сообщить(СтрокаПараметров);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		Сообщить("Экспорт данных по лицевому счету: "+Строка(ЛицевойСчет.Код)+". Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				//Сообщить(РезультатПроверки);
				Результат = Перевод(РезультатПроверки);
				
				Результат = "Добавление / обновление данных по лицевым счетам. ЛС: "+Строка(ЛицевойСчет.Наименование)+". "+ Результат;
				
				Сообщить(Результат);
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Добавление/обновление ЛС "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Добавление/обновление ЛС "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Добавление/обновление ЛС "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Добавление/обновление ЛС "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Процедура СоздатьСчетчики(ЛицевойСчет)
	
	ЕстьОтвет = Истина;
	
	//ТаблицаОплатПоЛицевомуСчету = ПолучитьТаблицуОплатПоЛицевомуСчету(ЛицевойСчет);
	
	//ТаблицаДанныхНачислений = ПолучитьТаблицуДанныхПоСчетчикамЛицевогоСчета(ЛицевойСчет,"ТаблицаНачислений");
	
	ТаблицаДанныхПоСчетчикам =ПолучитьТаблицуДанныхПоСчетчикамЛицевогоСчета(ЛицевойСчет,"ТаблицаПоСчетчикам");
	
	ТаблицаСчетчиков = Новый ТаблицаЗначений;
	ТаблицаСчетчиков.Колонки.Добавить("ГрафаОтчетаГЦЖС");
	ТаблицаСчетчиков.Колонки.Добавить("ВидСчетчика");
	ТаблицаСчетчиков.Колонки.Добавить("Имя");
	ТаблицаСчетчиков.Колонки.Добавить("Серийный");
	ТаблицаСчетчиков.Колонки.Добавить("Код");
	ТаблицаСчетчиков.Колонки.Добавить("Показание");
	ТаблицаСчетчиков.Колонки.Добавить("ПредыдущееПоказание");
	ТаблицаСчетчиков.Колонки.Добавить("Период");
	ТаблицаСчетчиков.Колонки.Добавить("Услуга");
	
	Для Каждого Стр Из ТаблицаДанныхПоСчетчикам Цикл
		Если Стр.Счетчик.ТипСчетчика<>Перечисления.бит_ТипСчетчика.Индивидуальный Тогда Продолжить; КонецЕсли;
		Нов = ТаблицаСчетчиков.Добавить();
		Нов.ГрафаОтчетаГЦЖС = Стр.Услуга.ГрафаОтчетаГЦЖС;
		Нов.ВидСчетчика     = "";
		Нов.Имя             = Стр.Счетчик.Наименование;
		
		Нов.Серийный        = Стр.Счетчик.ЗаводскойСерийныйНомерПУ; //Возможно серийный - наименование
		
		Нов.Код             = Стр.Счетчик.Код;
		Нов.Показание       = Стр.ДоПоказаний;
		Нов.ПредыдущееПоказание = Стр.ОтПоказаний;
		Нов.Период              = Лев(Стр.ПериодСравнения,10);
		Нов.Услуга          = СТр.Услуга;
	КонецЦикла;	
	
	Если ТаблицаСчетчиков.Количество()<>0 Тогда
		ТаблицаСчетчиков.Сортировать("ГрафаОтчетаГЦЖС");
		ТекГрафа = ""; Сч = 0;
		Для Каждого Стр Из ТаблицаСчетчиков Цикл
			Если ТекГрафа = Стр.ГрафаОтчетаГЦЖС Тогда
				Сч = СЧ + 1;
			Иначе
				Сч = 1;
			КонецЕсли;
			ТекГрафа = Стр.ГрафаОтчетаГЦЖС;
			
			//Сообщить(Строка(Стр.Имя)+"-"+Строка(Стр.ГрафаОтчетаГЦЖС));
			Если Стр.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда
				Стр.ВидСчетчика = "СчГВС"+Строка(Сч);
			ИначеЕсли Стр.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
				Стр.ВидСчетчика = "СчХВС"+Строка(Сч);
			ИначеЕсли Стр.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда
				Стр.ВидСчетчика = "СчОтопление"+Строка(Сч);
			ИначеЕсли Стр.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда
				Если Найти(Стр.Услуга,"Т3")<>0 Тогда  //Третий   
					Стр.ВидСчетчика = "СчЭЭТретий1";
				ИначеЕсли Найти(Стр.Услуга,"Т2")<>0 Тогда //Ночь
					Стр.ВидСчетчика = "СчЭЭНочь1";
				ИначеЕсли Найти(Стр.Услуга,"Т1")<>0 Тогда   //День
					Стр.ВидСчетчика = "СчЭЭДень1";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ОставитьСчетчики = ТаблицаСчетчиков.Скопировать();
		ОставитьСчетчики.Очистить();
		
		Для Каждого Стр Из ТаблицаСчетчиков Цикл
			Если ЗначениеЗаполнено(Стр.ВидСчетчика) Тогда 
				Нов = ОставитьСчетчики.Добавить();
				ЗаполнитьЗначенияСвойств(Нов,Стр);
			КонецЕсли;	
		КонецЦикла;	
		
		Если ОставитьСчетчики.Количество()<>0 Тогда
			АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
			АдресРесурса1 = "/api/v2/objects/createupdate";
			
			Запрос1 = "{"+"""ApplicationId"""+":"+СТрока(СокрЛП(Объект.НомерПриложения))+","+"""ЛС"""+":"+""""+СокрЛП(ЛицевойСчет.Наименование)+""""+"}"; 
			Запрос1 = КодироватьСтроку(Запрос1,СпособКодированияСтроки.КодировкаURL);
			Запрос2 = "{";
			Для Каждого СчСтр Из ОставитьСчетчики Цикл
				
				Запрос2 =Запрос2 + 
				""""+Строка(СчСтр.ВидСчетчика)+"_Имя"""   +":"+""""+Строка(СчСтр.Имя)+""""+","+
				""""+Строка(СчСтр.ВидСчетчика)+"_СерийныйНомер"""     +":"+""""+Строка(СчСтр.Серийный)+""""+","+
				""""+Строка(СчСтр.ВидСчетчика)+"_Код"""   +":"+""""+Строка(СчСтр.Код)+""""+","+
				""""+Строка(СчСтр.ВидСчетчика)+"_Показание"""+":"+""""+Строка(СчСтр.Показание)+""""+","+
				//""""+Строка(СчСтр.ВидСчетчика)+"_ВидУслуги"""+":"+""""+Строка(СчСтр.Услуга)+""""+","+
				""""+Строка(СчСтр.ВидСчетчика)+"_ПредыдущееПоказание"""   +":"+""""+Строка(СчСтр.ПредыдущееПоказание)+""""+","+
				""""+Строка(СчСтр.ВидСчетчика)+"_Период"""     +":"+""""+Строка(Лев(Стр.Период,10))+""""+",";
				
			КонецЦикла;
			Запрос2 = Запрос2+"}";
			
			Запрос2 = КодироватьСтроку(Запрос2,СпособКодированияСтроки.КодировкаURL);
			
			СтрокаПараметров = "create="+Запрос1+"&update="+Запрос2;
			//СтрокаПараметров = КодироватьСтроку(СтрокаПараметров,СпособКодированияСтроки.КодировкаURL);
			//Сообщить(СтрокаПараметров);
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			
			
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				ЕстьОтвет = Ложь;
				Сообщить("Экспорт данных по счетчикам. ЛС: "+СокрЛП(ЛицевойСчет.Код)+". Ошибка при отправке запроса: " + ОписаниеОшибки());
			КонецПопытки;
			
			Если ЕстьОтвет Тогда
				Если Ответ.КодСостояния = 200 Тогда
					СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					
					Если Не ПустаяСтрока(СтрокаОтвет) Тогда
						РезультатПроверки = СтрокаОтвет;
						Результат = РезультатПроверки;
						Результат = Перевод(РезультатПроверки);
						Результат = "Добавление / обновление данных по счетчикам. ЛС: "+Строка(ЛицевойСчет.Наименование)+". "+ Результат;
						Сообщить(Результат);
					КонецЕсли;
				ИначеЕсли Ответ.КодСостояния = 500 Тогда
					Сообщить("Добавление/обновление счетчиков "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 404 Тогда
					Сообщить("Добавление/обновление счетчиков "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 301 Тогда
					Сообщить("Добавление/обновление счетчиков "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
				Иначе
					Сообщить("Добавление/обновление счетчиков "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ДетализацияНачисленийЗаВесьПериод()
	
	ЧислоДней = Окр(Число(ТекущаяДата() - Дата(2017,1,1)) / (60*60*24));
	НачальнаяДата = Дата(2017,1,1);
	Для Счет = 1 по ЧислоДней Цикл
		ДатаОтчета = НачальнаяДата + (60*60*24*Счет);
		Если Конецдня(ДатаОтчета) = КонецДня(КонецМесяца(ДатаОтчета)) Тогда
			
			
			Квитанция = Новый ТабличныйДокумент;
			
			Результат = Неопределено;
			
			ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
			
			ОбработкаОбъект.МакетКв               = объект.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
			//ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
			ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
			ОбработкаОбъект.Организация           = Объект.Организация;
			ОбработкаОбъект.РС                    = Объект.Организация.ОсновнойБанковскийСчет;
			ОбработкаОбъект.ТекущийПакет          = 1;
			ОбработкаОбъект.РазмерПакетаПечати    = 500;
			ОбработкаОбъект.РазмерПакетаПросмотра = 50;
			Для Каждого Стр Из ТаблицаЛицевыхСчетов Цикл
				Если Не Стр.ЕстьВМобстед Тогда ПРодолжить КонецЕсли;
				НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
				НоваяСтрока.ЛицевойСчет = Стр.ЛицевойСчет;
			КонецЦикла;	
			
			Обработка = ОбработкаОбъект;
			ПериодНачислений    = КонецМесяца(ДатаОтчета);
			Обработка.Период      = КонецМесяца(ДатаОтчета);
			
			Обработка.ОбновитьНастройкиЖКХ();
			Обработка.ОбновитьКэшОрганизации();
			// БИТ_ЖКХ 24.01.2017 13:35:35 Начало правки...
			Обработка.ОбновитьКэшПолучателяПлатежа();
			// БИТ_ЖКХ 24.01.2017 13:35:35 Конец правки.
			
			Обработка.ПолучитьНастройкуМакета();
			
			ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
			
			Если ТаблицаДанных.количество() <> 0 Тогда
				
				Для Каждого СтрТабл Из ТаблицаДанных Цикл
					
					Если СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц = 0 Тогда Продолжить; КонецЕсли; //Нет начислений 
					
					Период = СтрТабл.Значение.СтруктураДанных.Дата;
					УИН = Лев(КонецМесяца(Период),10);
					
					Если ПроверитьНачисленияВМобстед(УИН,СтрТабл.ЛицевойСчет.Наименование) Тогда Продолжить; КонецЕсли;
					
					ЕстьОтвет = Истина;
					
					АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
					АдресРесурса1 = "/api/v4/events/";
					Запрос1 = КодироватьСтроку(Строка(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
					
					Запрос4 = 
					"["
					+"{"
					+"""field"""                +":"+ """НомерЛицевогоСчета"""+","
					+"""operation"""            +":"+ """="""+","
					+"""value"""                +":"+""""+Строка(СтрТабл.ЛицевойСчет.Наименование)+""""+","
					+"""andor"""                +":"+"""and"""
					+"}"
					+"]";
					
					
					Запрос4 = КодироватьСтроку(Запрос4,СпособКодированияСтроки.КодировкаURL);
					Запрос5 = "{"+"""Сумма"""+":"+""""+СтрЗаменить(СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц,Символы.НПП,"")+""""+"}";  //{"Сумма":"100500"}
					Запрос2 = КодироватьСтроку("Начисление",СпособКодированияСтроки.КодировкаURL);
					Запрос3 = КодироватьСтроку(Строка(Объект.СтатусВРаботе),СпособКодированияСтроки.КодировкаURL);
					Запрос5 = КодироватьСтроку(Запрос5,СпособКодированияСтроки.КодировкаURL);
					Дата = Сред(УИН,7,4)+"-"+Сред(УИН,4,2)+"-"+Сред(УИН,1,2);
					УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
					Запрос6 = КодироватьСтроку(Дата,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
					СтрокаПараметров = "ApplicationId="+Запрос1+"&ActionName="+Запрос2+"&PaymentDocNumber="+УИН+"&StatusId="+Запрос3+"&Object="+Запрос4+"&Value="+Запрос5+"&CreateDate="+Запрос6;
					
					HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
					HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
					HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
					HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
					HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
					Попытка
						Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
					Исключение
						ЕстьОтвет = Ложь;
						Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
					КонецПопытки;
					
					Если ЕстьОтвет Тогда
						Если Ответ.КодСостояния = 200 Тогда
							СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
							
							Если Не ПустаяСтрока(СтрокаОтвет) Тогда
								РезультатПроверки = СтрокаОтвет;
								Результат = РезультатПроверки;
								Сообщить(Результат);
							КонецЕсли;
						ИначеЕсли Ответ.КодСостояния = 500 Тогда
							Сообщить("Детализация. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
						ИначеЕсли Ответ.КодСостояния = 404 Тогда
							Сообщить("Детализация. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
						ИначеЕсли Ответ.КодСостояния = 301 Тогда
							Сообщить("Детализация. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
						Иначе
							Сообщить("Детализация. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			//Создали события с начислениями со статусом в работе
			//Теперь их обработаем
			ЕстьОтвет = Истина;	
			
			АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
			АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
			
			СтрокаПараметров = 
			"["
			+"{"
			+"""field"""                +":"+ """StatusId"""+","
			+"""operation"""            +":"+ """="""+","
			+"""value"""                +":"+""""+Строка(Объект.СтатусВРаботе)+""""+","
			+"""andor"""                +":"+"""and"""
			+"}"
			+","
			+"{"
			+"""field"""                +":"+ """ActionName"""+","
			+"""operation"""            +":"+ """="""+","
			+"""value"""                +":"+"""Начисление"""+","
			+"""andor"""                +":"+"""and"""
			+"}"
			+"]";
			//Сообщить(СтрокаПараметров);
			
			
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.Получить(HTTPЗапрос);
			Исключение
				ЕстьОтвет = Ложь;
				Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
			КонецПопытки;
			Если ЕстьОтвет Тогда
				Если Ответ.КодСостояния = 200 Тогда
					СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					
					Если Не ПустаяСтрока(СтрокаОтвет) Тогда
						РезультатПроверки = СтрокаОтвет;
						Если СокрЛП(РезультатПроверки)="false" Тогда
							Сообщить("Соединение не установлено");
						Иначе
							
							
							ЧтениеJSON = Новый ЧтениеJSON;
							ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
							ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
							ЧтениеJSON.Закрыть();
							
							Если ЗагруженныеДанные.Количество()<>0 Тогда
								
								ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
								
								ОтправитьДетализацию(ТЗ);
								
								ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений);
								
								Если Объект.НомерШаблонаСМС<>0 Тогда
									
									//ОтправитьСМС(ТЗ);
									
								КонецЕсли;
								
							КонецЕсли;
							//Сообщить(РезультатПроверки);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Ответ.КодСостояния = 500 Тогда
					Сообщить("Детализация. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 404 Тогда
					Сообщить("Детализация. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 301 Тогда
					Сообщить("Детализация. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
				Иначе
					Сообщить("Детализация. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	//
КонецПроцедуры	

Процедура ДетализацияНачислений()
	
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """StatusId"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(Объект.СтатусВРаботе)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Запрос Детализации"""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";
	//Сообщить(СтрокаПараметров);
	
	
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
		ЕстьОтвет = Ложь;
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					Сообщить("Соединение не установлено");
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
					
					ОтправитьДетализацию(ТЗ);
					
					//Сообщить(РезультатПроверки);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Детализация. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Детализация. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Детализация. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Детализация. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;	
	//ЧислоДней = Окр(Число(ТекущаяДата() - Дата(2017,1,1)) / (60*60*24));
	//НачальнаяДата = Дата(2017,1,1);
	//Для Счет = 1 по ЧислоДней Цикл
	//	ДатаОтчета = НачальнаяДата + (60*60*24*Счет);
	//	Если Конецдня(ДатаОтчета) = КонецДня(КонецМесяца(ДатаОтчета)) Тогда
	//		
	//		
	//		Квитанция = Новый ТабличныйДокумент;
	//		
	//		Результат = Неопределено;
	//		
	//		ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	//		
	//		ОбработкаОбъект.МакетКв               = объект.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	//		//ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
	//		ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	//		ОбработкаОбъект.Организация           = Объект.Организация;
	//		ОбработкаОбъект.РС                    = Объект.Организация.ОсновнойБанковскийСчет;
	//		ОбработкаОбъект.ТекущийПакет          = 1;
	//		ОбработкаОбъект.РазмерПакетаПечати    = 500;
	//		ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	//		Для Каждого Стр Из ТаблицаЛицевыхСчетов Цикл
	//			Если Не Стр.ЕстьВМобстед Тогда ПРодолжить КонецЕсли;
	//			НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	//			НоваяСтрока.ЛицевойСчет = Стр.ЛицевойСчет;
	//		КонецЦикла;	
	//		
	//		Обработка = ОбработкаОбъект;
	//		ПериодНачислений    = КонецМесяца(ДатаОтчета);
	//		Обработка.Период      = КонецМесяца(ДатаОтчета);
	//		
	//		Обработка.ОбновитьНастройкиЖКХ();
	//		Обработка.ОбновитьКэшОрганизации();
	//		// БИТ_ЖКХ 24.01.2017 13:35:35 Начало правки...
	//		Обработка.ОбновитьКэшПолучателяПлатежа();
	//		// БИТ_ЖКХ 24.01.2017 13:35:35 Конец правки.
	//		
	//		Обработка.ПолучитьНастройкуМакета();
	//		
	//		ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	//		
	//		Если ТаблицаДанных.количество() <> 0 Тогда
	//			
	//			Для Каждого СтрТабл Из ТаблицаДанных Цикл
	//				
	//				Если СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц = 0 Тогда Продолжить; КонецЕсли; //Нет начислений 
	//				
	//				Период = СтрТабл.Значение.СтруктураДанных.Дата;
	//				УИН = Лев(КонецМесяца(Период),10);
	//				
	//				Если ПроверитьНачисленияВМобстед(УИН,СтрТабл.ЛицевойСчет.Наименование) Тогда Продолжить; КонецЕсли;
	//				
	//				ЕстьОтвет = Истина;
	//				
	//				АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	//				АдресРесурса1 = "/api/v4/events/";
	//				Запрос1 = КодироватьСтроку(Строка(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
	//				
	//				Запрос4 = 
	//				"["
	//				+"{"
	//				+"""field"""                +":"+ """НомерЛицевогоСчета"""+","
	//				+"""operation"""            +":"+ """="""+","
	//				+"""value"""                +":"+""""+Строка(СтрТабл.ЛицевойСчет.Наименование)+""""+","
	//				+"""andor"""                +":"+"""and"""
	//				+"}"
	//				+"]";
	//				
	//				
	//				Запрос4 = КодироватьСтроку(Запрос4,СпособКодированияСтроки.КодировкаURL);
	//				Запрос5 = "{"+"""Сумма"""+":"+""""+СтрЗаменить(СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц,Символы.НПП,"")+""""+"}";  //{"Сумма":"100500"}
	//				Запрос2 = КодироватьСтроку("Начисление",СпособКодированияСтроки.КодировкаURL);
	//				Запрос3 = КодироватьСтроку("15",СпособКодированияСтроки.КодировкаURL);
	//				Запрос5 = КодироватьСтроку(Запрос5,СпособКодированияСтроки.КодировкаURL);
	//				Дата = Сред(УИН,7,4)+"-"+Сред(УИН,4,2)+"-"+Сред(УИН,1,2);
	//				УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
	//				Запрос6 = КодироватьСтроку(Дата,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
	//				СтрокаПараметров = "ApplicationId="+Запрос1+"&ActionName="+Запрос2+"&PaymentDocNumber="+УИН+"&StatusId="+Запрос3+"&Object="+Запрос4+"&Value="+Запрос5+"&CreateDate="+Запрос6;
	//				
	//				HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	//				HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	//				HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
	//				HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	//				HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	//				Попытка
	//					Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//				Исключение
	//					ЕстьОтвет = Ложь;
	//					Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	//				КонецПопытки;
	//				
	//				Если ЕстьОтвет Тогда
	//					Если Ответ.КодСостояния = 200 Тогда
	//						СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	//						
	//						Если Не ПустаяСтрока(СтрокаОтвет) Тогда
	//							РезультатПроверки = СтрокаОтвет;
	//							Результат = РезультатПроверки;
	//							Сообщить(Результат);
	//						КонецЕсли;
	//					ИначеЕсли Ответ.КодСостояния = 500 Тогда
	//						Сообщить("Ошибка на сервере. Код ошибки: 500");
	//					ИначеЕсли Ответ.КодСостояния = 404 Тогда
	//						Сообщить("Неверная ссылка. Код ошибки: 404");
	//					ИначеЕсли Ответ.КодСостояния = 301 Тогда
	//						Сообщить("Ошибка на сервере. Код ошибки: 301");
	//					Иначе
	//						Сообщить("Неизвестная ошибка");
	//					КонецЕсли;
	//				КонецЕсли;
	//			КонецЦикла;
	//			
	//		КонецЕсли;
	//		
	//		//Создали события с начислениями со статусом в работе
	//		//Теперь их обработаем
	//		ЕстьОтвет = Истина;	
	//		
	//		АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	//		АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
	//		
	//		СтрокаПараметров = 
	//		"["
	//		+"{"
	//		+"""field"""                +":"+ """StatusId"""+","
	//		+"""operation"""            +":"+ """="""+","
	//		+"""value"""                +":"+"""15"""+","
	//		+"""andor"""                +":"+"""and"""
	//		+"}"
	//		+","
	//		+"{"
	//		+"""field"""                +":"+ """ActionName"""+","
	//		+"""operation"""            +":"+ """="""+","
	//		+"""value"""                +":"+"""Начисление"""+","
	//		+"""andor"""                +":"+"""and"""
	//		+"}"
	//		+"]";
	//		//Сообщить(СтрокаПараметров);
	//		
	//		
	//		
	//		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	//		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	//		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	//		Попытка
	//			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	//		Исключение
	//			ЕстьОтвет = Ложь;
	//			Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	//		КонецПопытки;
	//		Если ЕстьОтвет Тогда
	//			Если Ответ.КодСостояния = 200 Тогда
	//				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	//				
	//				Если Не ПустаяСтрока(СтрокаОтвет) Тогда
	//					РезультатПроверки = СтрокаОтвет;
	//					Если СокрЛП(РезультатПроверки)="false" Тогда
	//						Сообщить("Соединение не установлено");
	//					Иначе
	//						
	//						
	//						ЧтениеJSON = Новый ЧтениеJSON;
	//						ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	//						ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	//						ЧтениеJSON.Закрыть();
	//						
	//						ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
	//						
	//						ОтправитьДетализацию(ТЗ);
	//						
	//						ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений);
	//						
	//						//Сообщить(РезультатПроверки);
	//					КонецЕсли;
	//				КонецЕсли;
	//			ИначеЕсли Ответ.КодСостояния = 500 Тогда
	//				Сообщить("Ошибка на сервере. Код ошибки: 500");
	//			ИначеЕсли Ответ.КодСостояния = 404 Тогда
	//				Сообщить("Неверная ссылка. Код ошибки: 404");
	//			ИначеЕсли Ответ.КодСостояния = 301 Тогда
	//				Сообщить("Ошибка на сервере. Код ошибки: 301");
	//			Иначе
	//				Сообщить("Неизвестная ошибка");
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	////
	////Квитанция = Новый ТабличныйДокумент;
	////
	////Результат = Неопределено;
	////
	////ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	////
	////ОбработкаОбъект.МакетКв               = объект.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	//////ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
	////ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	////ОбработкаОбъект.Организация           = Объект.Организация;
	////ОбработкаОбъект.РС                    = Объект.Организация.ОсновнойБанковскийСчет;
	////ОбработкаОбъект.ТекущийПакет          = 1;
	////ОбработкаОбъект.РазмерПакетаПечати    = 500;
	////ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	////Для Каждого Стр Из ТаблицаЛицевыхСчетов Цикл
	////	Если Не Стр.ЕстьВМобстед Тогда ПРодолжить КонецЕсли;
	////	НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	////	НоваяСтрока.ЛицевойСчет = Стр.ЛицевойСчет;
	////КонецЦикла;	
	////
	////Обработка = ОбработкаОбъект;
	////ПериодНачислений    = КонецМесяца(ТекущаяДата()-(60*60*24*15));
	////Обработка.Период      = КонецМесяца(ТекущаяДата()-(60*60*24*15));
	////
	////Обработка.ОбновитьНастройкиЖКХ();
	////Обработка.ОбновитьКэшОрганизации();
	////// БИТ_ЖКХ 24.01.2017 13:35:35 Начало правки...
	////Обработка.ОбновитьКэшПолучателяПлатежа();
	////// БИТ_ЖКХ 24.01.2017 13:35:35 Конец правки.
	////
	////Обработка.ПолучитьНастройкуМакета();
	////
	////ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	////
	////Если ТаблицаДанных.количество() <> 0 Тогда
	////	
	////	Для Каждого СтрТабл Из ТаблицаДанных Цикл
	////		
	////		Если СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц = 0 Тогда Продолжить; КонецЕсли; //Нет начислений 
	////		
	////		Период = СтрТабл.Значение.СтруктураДанных.Дата;
	////		УИН = Лев(КонецМесяца(Период),10);
	////		
	////		Если ПроверитьНачисленияВМобстед(УИН,СтрТабл.ЛицевойСчет.Наименование) Тогда Продолжить; КонецЕсли;
	////		
	////		ЕстьОтвет = Истина;
	////		
	////		АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	////		АдресРесурса1 = "/api/v4/events/";
	////		Запрос1 = КодироватьСтроку(Строка(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
	////		
	////		Запрос4 = 
	////		"["
	////		+"{"
	////		+"""field"""                +":"+ """НомерЛицевогоСчета"""+","
	////		+"""operation"""            +":"+ """="""+","
	////		+"""value"""                +":"+""""+Строка(СтрТабл.ЛицевойСчет.Наименование)+""""+","
	////		+"""andor"""                +":"+"""and"""
	////		+"}"
	////		+"]";
	////		
	////		
	////		Запрос4 = КодироватьСтроку(Запрос4,СпособКодированияСтроки.КодировкаURL);
	////		Запрос5 = "{"+"""Сумма"""+":"+""""+СтрЗаменить(СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц,Символы.НПП,"")+""""+"}";  //{"Сумма":"100500"}
	////		Запрос2 = КодироватьСтроку("Начисление",СпособКодированияСтроки.КодировкаURL);
	////		Запрос3 = КодироватьСтроку("15",СпособКодированияСтроки.КодировкаURL);
	////		Запрос5 = КодироватьСтроку(Запрос5,СпособКодированияСтроки.КодировкаURL);
	////		Дата = Сред(УИН,7,4)+"-"+Сред(УИН,4,2)+"-"+Сред(УИН,1,2);
	////		УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
	////		Запрос6 = КодироватьСтроку(Дата,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
	////		СтрокаПараметров = "ApplicationId="+Запрос1+"&ActionName="+Запрос2+"&PaymentDocNumber="+УИН+"&StatusId="+Запрос3+"&Object="+Запрос4+"&Value="+Запрос5+"&CreateDate="+Запрос6;
	////		
	////		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	////		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	////		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
	////		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	////		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	////		Попытка
	////			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	////		Исключение
	////			ЕстьОтвет = Ложь;
	////			Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	////		КонецПопытки;
	////		
	////		Если ЕстьОтвет Тогда
	////			Если Ответ.КодСостояния = 200 Тогда
	////				СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	////				
	////				Если Не ПустаяСтрока(СтрокаОтвет) Тогда
	////					РезультатПроверки = СтрокаОтвет;
	////					Результат = РезультатПроверки;
	////					Сообщить(Результат);
	////				КонецЕсли;
	////			ИначеЕсли Ответ.КодСостояния = 500 Тогда
	////				Сообщить("Ошибка на сервере. Код ошибки: 500");
	////			ИначеЕсли Ответ.КодСостояния = 404 Тогда
	////				Сообщить("Неверная ссылка. Код ошибки: 404");
	////			ИначеЕсли Ответ.КодСостояния = 301 Тогда
	////				Сообщить("Ошибка на сервере. Код ошибки: 301");
	////			Иначе
	////				Сообщить("Неизвестная ошибка");
	////			КонецЕсли;
	////		КонецЕсли;
	////	КонецЦикла;
	////	
	////КонецЕсли;
	////
	//////Создали события с начислениями со статусом в работе
	//////Теперь их обработаем
	////ЕстьОтвет = Истина;	
	////
	////АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	////АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
	////
	////СтрокаПараметров = 
	////"["
	////+"{"
	////+"""field"""                +":"+ """StatusId"""+","
	////+"""operation"""            +":"+ """="""+","
	////+"""value"""                +":"+"""15"""+","
	////+"""andor"""                +":"+"""and"""
	////+"}"
	////+","
	////+"{"
	////+"""field"""                +":"+ """ActionName"""+","
	////+"""operation"""            +":"+ """="""+","
	////+"""value"""                +":"+"""Начисление"""+","
	////+"""andor"""                +":"+"""and"""
	////+"}"
	////+"]";
	//////Сообщить(СтрокаПараметров);
	////
	////
	////
	////HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	////HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	////HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	////Попытка
	////	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	////Исключение
	////	ЕстьОтвет = Ложь;
	////	Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	////КонецПопытки;
	////Если ЕстьОтвет Тогда
	////	Если Ответ.КодСостояния = 200 Тогда
	////		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	////		
	////		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
	////			РезультатПроверки = СтрокаОтвет;
	////			Если СокрЛП(РезультатПроверки)="false" Тогда
	////				Сообщить("Соединение не установлено");
	////			Иначе
	////				
	////				
	////				ЧтениеJSON = Новый ЧтениеJSON;
	////				ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	////				ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	////				ЧтениеJSON.Закрыть();
	////				
	////				ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
	////				
	////				ОтправитьДетализацию(ТЗ);
	////				
	////				ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений);
	////				
	////				//Сообщить(РезультатПроверки);
	////			КонецЕсли;
	////		КонецЕсли;
	////	ИначеЕсли Ответ.КодСостояния = 500 Тогда
	////		Сообщить("Ошибка на сервере. Код ошибки: 500");
	////	ИначеЕсли Ответ.КодСостояния = 404 Тогда
	////		Сообщить("Неверная ссылка. Код ошибки: 404");
	////	ИначеЕсли Ответ.КодСостояния = 301 Тогда
	////		Сообщить("Ошибка на сервере. Код ошибки: 301");
	////	Иначе
	////		Сообщить("Неизвестная ошибка");
	////	КонецЕсли;
	////КонецЕсли;
КонецПроцедуры	

Функция ПроверитьНачисленияВМобстед(Период,ЛицевойСчет)
	ЕстьОтвет = Истина;
	УИН = Период;
	УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);
	НомПриложения = Объект.НомерПриложения;
	НомПриложения =  КодироватьСтроку(НомПриложения,СпособКодированияСтроки.КодировкаURL);
	ПеремЛицевойСчет   =  КодироватьСтроку(ЛицевойСчет,СпособКодированияСтроки.КодировкаURL);
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v4/events?ApplicationId="+НомПриложения+"&query=";
	//////http://requestb.in/z5d323z5   http://requestb.in/1il9nj21
	//АдресСервисаСтр = "requestb.in";
	//АдресРесурса = "1il9nj21";
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """object_НомерЛицевогоСчета"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(ПеремЛицевойСчет)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Начисление"""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"                                 
	+"""field"""                +":"+ """PaymentDocNumber"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(УИН)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";
	
	СтрокаПараметров =  КодироватьСтроку(СтрокаПараметров,СпособКодированияСтроки.КодировкаURL);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Если ЕстьОтвет Тогда 	
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				Если СокрЛП(СтрокаОтвет) = "[]" Тогда
					Возврат Ложь;	
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Проверка начислений в Мобстед. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Проверка начислений в Мобстед. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Проверка начислений в Мобстед. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Проверка начислений в Мобстед. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
КонецФункции	

Функция ЕстьЛиЭтаОплатаВПриложении(Стр)
	ЕстьОтвет = Истина;
	
	УИН = Стр.Регистратор.УникальныйИдентификатор();
	УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """object_НомерЛицевогоСчета"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(Стр.ЛицевойСчет)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Оплата"""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """PaymentDocNumber"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(УИН)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";
	//Сообщить(СтрокаПараметров);
	
	
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		Сообщить("Поиск ранее созданных оплат. Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				Если СокрЛП(СтрокаОтвет) = "[]" Тогда
					Возврат Ложь;	
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Проверка оплат в Мобстед. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Проверка оплат в Мобстед. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Проверка оплат в Мобстед. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Проверка оплат в Мобстед. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции	

Процедура ЭкспортПлатежиЗаВесьПериод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.СуммаРасход,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.ОстаткиИОбороты(&Дата1, &Дата2, Регистратор, , ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата(2017,1,1)));
	Запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТЗ Цикл
		
		
		й=0;
		УИН = Стр.Регистратор.УникальныйИдентификатор();
		УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);
		Если не ЕстьЛиЭтаОплатаВПриложении(Стр) Тогда
			ЕстьОтвет = Истина;
			//Добавим новую оплату
			АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
			АдресРесурса1 = "/api/v4/events/";
			Запрос1 = КодироватьСтроку(СТрока(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
			
			Запрос4 = 
			"["
			+"{"
			+"""field"""                +":"+ """НомерЛицевогоСчета"""+","
			+"""operation"""            +":"+ """="""+","
			+"""value"""                +":"+""""+Строка(Стр.ЛицевойСчет)+""""+","
			+"""andor"""                +":"+"""and"""
			+"}"
			+"]";
			Запрос4 = КодироватьСтроку(Запрос4,СпособКодированияСтроки.КодировкаURL);
			Запрос5 = "{"+"""Сумма"""+":"+""""+СтрЗаменить(Стр.СуммаРасход,Символы.НПП,"")+""""+"}";  //{"Сумма":"100500"}
			Запрос2 = КодироватьСтроку("Оплата",СпособКодированияСтроки.КодировкаURL);
			Запрос3 = КодироватьСтроку(Строка(Объект.СтатусВРаботе),СпособКодированияСтроки.КодировкаURL);
			Запрос5 = КодироватьСтроку(Запрос5,СпособКодированияСтроки.КодировкаURL);
			Дата = Сред(Стр.Регистратор.Дата,7,4)+"-"+Сред(Стр.Регистратор.Дата,4,2)+"-"+Сред(Стр.Регистратор.Дата,1,2);
			Запрос6 = КодироватьСтроку(Дата,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
			
			СтрокаПараметров = "ApplicationId="+Запрос1+"&ActionName="+Запрос2+"&PaymentDocNumber="+УИН+"&StatusId="+Запрос3+"&Object="+Запрос4+"&Value="+Запрос5+"&CreateDate="+Запрос6;
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				ЕстьОтвет = Истина;
				Сообщить("Импорт платежей. Ошибка при отправке запроса: " + ОписаниеОшибки());
			КонецПопытки;
			Если ЕстьОтвет Тогда
				Если Ответ.КодСостояния = 200 Тогда
					СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					
					Если Не ПустаяСтрока(СтрокаОтвет) Тогда
						РезультатПроверки = СтрокаОтвет;
						Результат = РезультатПроверки;
						Сообщить(Результат);
					КонецЕсли;
				ИначеЕсли Ответ.КодСостояния = 500 Тогда
					Сообщить("Экспорт платежей. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 404 Тогда
					Сообщить("Экспорт платежей. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 301 Тогда
					Сообщить("Экспорт платежей. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
				Иначе
					Сообщить("Экспорт платежей. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Прервать;
	КонецЦикла;	
КонецПроцедуры	

Процедура ЭкспортПлатежи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.СуммаРасход,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.ОстаткиИОбороты(&Дата1, &Дата2, Регистратор, , ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТЗ Цикл
		
		
		й=0;
		УИН = Стр.Регистратор.УникальныйИдентификатор();
		УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);
		Если не ЕстьЛиЭтаОплатаВПриложении(Стр) Тогда
			ЕстьОтвет = Истина;
			//Добавим новую оплату
			АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
			АдресРесурса1 = "/api/v4/events/";
			Запрос1 = КодироватьСтроку(СТрока(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
			
			Запрос4 = 
			"["
			+"{"
			+"""field"""                +":"+ """НомерЛицевогоСчета"""+","
			+"""operation"""            +":"+ """="""+","
			+"""value"""                +":"+""""+Строка(Стр.ЛицевойСчет)+""""+","
			+"""andor"""                +":"+"""and"""
			+"}"
			+"]";
			Запрос4 = КодироватьСтроку(Запрос4,СпособКодированияСтроки.КодировкаURL);
			Запрос5 = "{"+"""Сумма"""+":"+""""+СтрЗаменить(Стр.СуммаРасход,Символы.НПП,"")+""""+"}";  //{"Сумма":"100500"}
			Запрос2 = КодироватьСтроку("Оплата",СпособКодированияСтроки.КодировкаURL);
			Запрос3 = КодироватьСтроку(Строка(Объект.СтатусВРаботе),СпособКодированияСтроки.КодировкаURL);
			Запрос5 = КодироватьСтроку(Запрос5,СпособКодированияСтроки.КодировкаURL);
			Дата = Сред(Стр.Регистратор.Дата,7,4)+"-"+Сред(Стр.Регистратор.Дата,4,2)+"-"+Сред(Стр.Регистратор.Дата,1,2);
			Запрос6 = КодироватьСтроку(Дата,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
			
			СтрокаПараметров = "ApplicationId="+Запрос1+"&ActionName="+Запрос2+"&PaymentDocNumber="+УИН+"&StatusId="+Запрос3+"&Object="+Запрос4+"&Value="+Запрос5+"&CreateDate="+Запрос6;
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				ЕстьОтвет = Истина;
				Сообщить("Импорт платежей. Ошибка при отправке запроса: " + ОписаниеОшибки());
			КонецПопытки;
			Если ЕстьОтвет Тогда
				Если Ответ.КодСостояния = 200 Тогда
					СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					
					Если Не ПустаяСтрока(СтрокаОтвет) Тогда
						РезультатПроверки = СтрокаОтвет;
						Результат = РезультатПроверки;
						Сообщить(Результат);
					КонецЕсли;
				ИначеЕсли Ответ.КодСостояния = 500 Тогда
					Сообщить("Экспорт платежей. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 404 Тогда
					Сообщить("Экспорт платежей. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 301 Тогда
					Сообщить("Экспорт платежей. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
				Иначе
					Сообщить("Экспорт платежей. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Прервать;
	КонецЦикла;	
КонецПроцедуры	

Процедура ИмпортПлатежейВМобстед()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.СуммаРасход,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.ОстаткиИОбороты(&Дата1, &Дата2, Регистратор, , ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТЗ Цикл
		
		
		й=0;
		УИН = Стр.Регистратор.УникальныйИдентификатор();
		УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);
		Если не ЕстьЛиЭтаОплатаВПриложении(Стр) Тогда
			ЕстьОтвет = Истина;
			//Добавим новую оплату
			АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
			АдресРесурса1 = "/api/v4/events/";
			Запрос1 = КодироватьСтроку(СТрока(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
			
			Запрос4 = 
			"["
			+"{"
			+"""field"""                +":"+ """НомерЛицевогоСчета"""+","
			+"""operation"""            +":"+ """="""+","
			+"""value"""                +":"+""""+Строка(Стр.ЛицевойСчет)+""""+","
			+"""andor"""                +":"+"""and"""
			+"}"
			+"]";
			Запрос4 = КодироватьСтроку(Запрос4,СпособКодированияСтроки.КодировкаURL);
			Запрос5 = "{"+"""Сумма"""+":"+""""+СтрЗаменить(Стр.СуммаРасход,Символы.НПП,"")+""""+"}";  //{"Сумма":"100500"}
			Запрос2 = КодироватьСтроку("Оплата",СпособКодированияСтроки.КодировкаURL);
			Запрос3 = КодироватьСтроку(Строка(Объект.СтатусВРаботе),СпособКодированияСтроки.КодировкаURL);
			Запрос5 = КодироватьСтроку(Запрос5,СпособКодированияСтроки.КодировкаURL);
			Дата = Сред(Стр.Регистратор.Дата,7,4)+"-"+Сред(Стр.Регистратор.Дата,4,2)+"-"+Сред(Стр.Регистратор.Дата,1,2);
			Запрос6 = КодироватьСтроку(Дата,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
			
			СтрокаПараметров = "ApplicationId="+Запрос1+"&ActionName="+Запрос2+"&PaymentDocNumber="+УИН+"&StatusId="+Запрос3+"&Object="+Запрос4+"&Value="+Запрос5+"&CreateDate="+Запрос6;
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				ЕстьОтвет = Истина;
				Сообщить("Импорт платежей. Ошибка при отправке запроса: " + ОписаниеОшибки());
			КонецПопытки;
			Если ЕстьОтвет Тогда
				Если Ответ.КодСостояния = 200 Тогда
					СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					
					Если Не ПустаяСтрока(СтрокаОтвет) Тогда
						РезультатПроверки = СтрокаОтвет;
						Результат = РезультатПроверки;
						Сообщить(Результат);
					КонецЕсли;
				ИначеЕсли Ответ.КодСостояния = 500 Тогда
					Сообщить("Импорт платежей. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 404 Тогда
					Сообщить("Импорт платежей. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 301 Тогда
					Сообщить("Импорт платежей. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
				Иначе
					Сообщить("Импорт платежей. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Прервать;
	КонецЦикла;	
КонецПроцедуры	

Процедура ПроверитьЗапросыИОтправитьКвитанции()
	
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """StatusId"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(Объект.СтатусВРаботе)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Запрос Квитанции"""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		Сообщить("Проверка запросов и отправка квитанции. Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					Сообщить("Соединение не установлено");
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					Если ЗагруженныеДанные.Количество()<>0 Тогда
						ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
						
						
						ПериодНачислений = КонецМесяца(ТекущаяДата());
						ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений);
						
					КонецЕсли;
					//Сообщить(РезультатПроверки);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Проверка запросов и отправка квитанции. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Проверка запросов и отправка квитанции. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Проверка запросов и отправка квитанции. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Проверка запросов и отправка квитанции. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

Процедура ОтправитьДетализацию(ТЗ)
	
	ТаблицаДляИзмененияСтатуса = Новый ТаблицаЗначений;
	ТаблицаДляИзмененияСтатуса.Колонки.Добавить("ИД_События");
	ИзменитьСтатусы = Ложь;
	КодСтатуса = Строка(Объект.СтатусЗакрыто); //Закрыто обращение
	Для Каждого СТр Из ТЗ Цикл
		ЕстьОтвет = Истина;
		ТаблДетализации = ТаблицаДетализации(Стр.ЛС);
		
		Если ТаблДетализации.Количество() <> 0 Тогда
			АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
			АдресРесурса1 = "/api/v4/events/"+СТрока(СТр.ИД_События);
			
			СтрокаПараметров = "";
			Для Каждого СтрТабл из ТаблДетализации Цикл
				
				
				СтрокаПараметров = СтрокаПараметров + "value_"+СТрЗаменить(СтрТабл.Услуга," ","_")+"="+СтрЗаменить(Строка(СтрТабл.Начислено),Символы.НПП,"")+"&"; 
				
			КонецЦикла;
			
			СтрокаПараметров = "?"+ Лев(СтрокаПараметров,СтрДлина(СтрокаПараметров)-1);
			
			//Прибавим статус 
			СтрокаПараметров = СтрокаПараметров + "&StatusId="+СТрока(КодСтатуса)+"&ApplicationId="+Объект.НомерПриложения;
			
			//СтрокаПараметров = "?StatusId="+СТрока(КодСтатуса);
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1+СтрокаПараметров);
			HTTPЗапрос.УстановитьТелоИзСтроки("", КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.Записать(HTTPЗапрос);
			Исключение
				ЕстьОтвет = Ложь;
				Сообщить("Детализация по счету. Ошибка при отправке запроса: " + ОписаниеОшибки());
			КонецПопытки;
			Если ЕстьОтвет Тогда 
				Если Ответ.КодСостояния = 200 Тогда
					СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					
					Результат = Перевод(СтрокаОтвет1);
					
					Результат = "Обновление детализации по лицевым счетам. ЛС: "+Строка(СТр.ЛС)+". "+ Результат;
					
					НовСТр = ТаблицаДляИзмененияСтатуса.Добавить();
					НовСтр.ИД_События = Стр.ИД_События;
					
					
					Сообщить(Результат);
					Если Не ПустаяСтрока(Результат) Тогда
						РезультатПроверки1 = Результат;
						Если СокрЛП(РезультатПроверки1)="false" Тогда
							Сообщить("Соединение не установлено");
						Иначе
							
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Ответ.КодСостояния = 500 Тогда
					Сообщить("Отправка детализации. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 404 Тогда
					Сообщить("Отправка детализации. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 301 Тогда
					Сообщить("Отправка детализации. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
				Иначе
					
					Попытка
						СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
						Сообщить(Строка(СтрокаОтвет1));
					Исключение
						Сообщить("Отправка детализации. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
					КонецПопытки;	
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	Если ТаблицаДляИзмененияСтатуса.Количество()<>0 Тогда 
		ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(Объект.СтатусЗакрыто));
	КонецЕсли;
	
КонецПроцедуры	

Функция  ТаблицаДетализации(ЛицевойСчет)
	
	ЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(СокрЛП(ЛицевойСчет));
	
	
	
	Квитанция = Новый ТабличныйДокумент;
	
	Результат = Неопределено;
	
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	ОбработкаОбъект.МакетКв               = объект.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	//ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = Объект.Организация;
	ОбработкаОбъект.РС                    = Объект.Организация.ОсновнойБанковскийСчет;
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	
	НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛС;
	
	Обработка = ОбработкаОбъект;
	ПериодНачислений    = КонецМесяца(ТекущаяДата()-(60*60*24*15));
	Обработка.Период      = КонецМесяца(ТекущаяДата()-(60*60*24*15));
	
	Обработка.ОбновитьНастройкиЖКХ();
	Обработка.ОбновитьКэшОрганизации();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Начало правки...
	Обработка.ОбновитьКэшПолучателяПлатежа();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Конец правки.
	
	Обработка.ПолучитьНастройкуМакета();
	////
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	////
	
	ТаблицаДанныхНачислений = Новый ТаблицаЗначений;
	ТаблицаДанныхНачислений.Колонки.Добавить("Услуга");
	ТаблицаДанныхНачислений.Колонки.Добавить("Начислено");
	
	Если ТаблицаДанных.количество() <> 0 Тогда
		////	
		Для Каждого СтрТабл Из ТаблицаДанных Цикл
			й=0;
			
			Если СтрТабл.Значение.ТаблицаПечати.Количество()<>0 Тогда
				ИтогоКОплате = 0;
				Для Каждого СтрУсл Из СтрТабл.Значение.ТаблицаПечати Цикл
					Нов = ТаблицаДанныхНачислений.Добавить();
					Нов.Услуга = СтрУсл.Услуга;
					Нов.Начислено = СтрУсл.КОплатеЗаМесяц;
					ИтогоКОплате = ИтогоКОплате + СтрУсл.КОплатеЗаМесяц;
				КонецЦикла;
				//Нов = ТаблицаДанныхНачислений.Добавить();
				//Нов.Услуга = "Итого:";
				//Нов.Начислено = ИтогоКОплате;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;	
	
	
	
	
	//ТаблицаДанныхНачислений = ПолучитьТаблицуДанныхПоСчетчикамЛицевогоСчета(ЛС,"ТаблицаНачислений");
	
	Возврат ТаблицаДанныхНачислений;
	
КонецФункции	

Процедура ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений)
	ТаблицаДляИзмененияСтатуса = Новый ТаблицаЗначений;
	ТаблицаДляИзмененияСтатуса.Колонки.Добавить("ИД_События");
	ИзменитьСтатусы = Ложь;
	
	Для Каждого СТр Из ТЗ Цикл
		
		ЕстьОтвет = Истина;
		//	Квитанция = ПечатьЕдиныйПлатежныйДокумент(Стр.ЛС);
		//ЛС = Справочники.бит_ЛицевыеСчета.НайтиПоКоду();
		
		ЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(СокрЛП(Стр.ЛС));// Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию("100000");    //!Переделать
		//Квитанция = ПечатьПлатежныйДокументРК924(ЛС);
		Квитанция = ПечатьПлатежныйДокументРК924(ЛС,ПериодНачислений);
		
		ИмяФ = Стр.ИД_События; 
		Квитанция.Записать(Строка(КаталогВременныхФайлов())+Строка(ИмяФ)+".pdf", ТипФайлаТабличногоДокумента.PDF) ;
		
		СодержимоеФайла = Base64Строка(Новый ДвоичныеДанные(СТрока(КаталогВременныхФайлов())+Строка(ИмяФ)+".pdf")); 
		АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
		ИДСобытия = ""; РасширениеФайла = ""; ИмяФайла = ""; Содержимое = "";
		
		ИДСобытия = Строка(Стр.ИД_События);
		ИДСобытия = СтрЗаменить(ИДСобытия,Символы.НПП,"");
		ИДСобытия = КодироватьСтроку(ИДСобытия,СпособКодированияСтроки.КодировкаURL);
		РасширениеФайла = "pdf";
		РасширениеФайла = КодироватьСтроку(РасширениеФайла,СпособКодированияСтроки.КодировкаURL);
		ИмяФайла  = Строка(ИмяФ);
		ИмяФайла = КодироватьСтроку(ИмяФайла,СпособКодированияСтроки.КодировкаURL);
		Содержимое = СодержимоеФайла;
		Содержимое = КодироватьСтроку(Содержимое,СпособКодированияСтроки.КодировкаURL);
		
		АдресРесурса = "/api/v4/events/eventfile";
		ТелоPOSTЗапроса = "eventId="+ИДСобытия+"&fileExt="+РасширениеФайла+"&fileName="+ИмяФайла+"&fileBody="+Содержимое;
		СтрокаПараметров = ""; 
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
		
		Попытка
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоPOSTЗапроса);
			//Ответ = HTTPСоединение.ВызватьHTTPМетод("POST",HTTPЗапрос);	
			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение  
			ЕстьОтвет = Ложь;                  
			Сообщить("Экспорт квитанции по лицевому счету: "+Строка(Стр.ЛС)+". Ошибка при отправке запроса: " + ОписаниеОшибки());
		КонецПопытки;
		Если ЕстьОтвет Тогда
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				СтрокаОтвет1 = Перевод(СтрокаОтвет1);
				
				СтрокаОтвет1 = "Добавление квитанции. ЛС: "+Строка(СТр.ЛС)+". "+ СтрокаОтвет1;
				
				
				Сообщить(СтрокаОтвет1);
				Если Не ПустаяСтрока(СтрокаОтвет1) Тогда
					РезультатПроверки1 = СтрокаОтвет1;
					
					НовСТр = ТаблицаДляИзмененияСтатуса.Добавить();
					НовСтр.ИД_События = Стр.ИД_События;
					
					Если СокрЛП(РезультатПроверки1)="false" Тогда
						Сообщить("Соединение не установлено");
					Иначе
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Ответ.КодСостояния = 500 Тогда
				Сообщить("Отправка квитанции. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
				Сообщить("Отправка квитанции. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
			ИначеЕсли Ответ.КодСостояния = 301 Тогда
				Сообщить("Отправка квитанции. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
			Иначе 
				Попытка
					СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					Сообщить(Строка(СтрокаОтвет1));
				Исключение
				КонецПопытки;	
			КонецЕсли;
		КонецЕсли;
		Попытка
			УдалитьФайлы(Строка(КаталогВременныхФайлов())+Строка(ИмяФ)+".pdf");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	Если ТаблицаДляИзмененияСтатуса.Количество()<>0 Тогда 
		ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(Объект.СтатусЗакрыто));
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОтправитьСМС(ТЗ)
	
	ЕстьОтвет = Истина;
	
	Для Каждого Стр Из ТЗ Цикл
		ИДОбъекта = Стр.ИД_Объекта;
		ИДОбъекта = СтрЗаменить(ИДОбъекта,Символы.НПП,"");
		ИДОбъекта = КодироватьСтроку(ИДОбъекта,СпособКодированияСтроки.КодировкаURL);
		АдресСервиса = СокрЛП(Объект.АдресСервиса);
		АдресРесурса = "/api/v1/objects/sendmessage?";
		НомерПриложения = Объект.НомерПриложения;
		НомерПриложения = КодироватьСтроку(НомерПриложения,СпособКодированияСтроки.КодировкаURL);
		НомерШаблона = Объект.НомерШаблонаСМС;
		НомерШаблона = КодироватьСтроку(НомерШаблона,СпособКодированияСтроки.КодировкаURL);
		Токен = "abadevzaXazZfa433kk";
		Токен = КодироватьСтроку(Токен,СпособКодированияСтроки.КодировкаURL);
		Дата = Лев(ТекущаяДата(),10);
		Время = "05:00";
		ДатаВремя = Строка(Дата)+" "+Строка(Время);
		ДатаВремя = КодироватьСтроку(ДатаВремя,СпособКодированияСтроки.КодировкаURL);
		
		СтрокаПараметров = "objid="+Строка(ИДОбъекта)+"&appid="+Строка(НомерПриложения)+"&DueDate="+Строка(ДатаВремя)+"&messageid="+Строка(НомерШаблона)+"&method=SMS&Token="+Строка(Токен);
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
		ssl = Новый ЗащищенноеСоединениеOpenSSL;  
		HTTPСоединение = Новый HTTPСоединение(АдресСервиса,443,,,,,ssl);
		Попытка
			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		Исключение
			ЕстьОтвет = Ложь;
			Сообщить("Отправка СМС сообщения. Ошибка при отправке запроса: " + ОписаниеОшибки());
		КонецПопытки;
		Если ЕстьОтвет ТОгда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Сообщить(РезультатПроверки);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,КодСтатуса)
	
	Для Каждого СТрСтатус Из ТаблицаДляИзмененияСтатуса Цикл
		
		ЕстьОтвет = Истина;
		
		АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
		АдресРесурса1 = "/api/v2/events/"+СТрока(СТрСтатус.ИД_События);
		СтрокаПараметров = "?StatusId="+СТрока(КодСтатуса);
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1+СтрокаПараметров);
		HTTPЗапрос.УстановитьТелоИзСтроки("", КодировкаТекста.UTF8);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
		Попытка
			Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		Исключение
			ЕстьОтвет = Ложь;
			Сообщить("Изменение статуса события: "+СТрока(СТрСтатус.ИД_События)+". Ошибка при отправке запроса: " + ОписаниеОшибки());
		КонецПопытки;
		
		Если ЕстьОтвет Тогда
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				СтрокаОтвет1 = Перевод(СтрокаОтвет1);
				
				СтрокаОтвет1 = "Изменение статуса события. Событие: "+Строка(СТрСтатус.ИД_События)+". "+ СтрокаОтвет1;
				
				
				Сообщить(СтрокаОтвет1);
				Если Не ПустаяСтрока(СтрокаОтвет1) Тогда
					РезультатПроверки1 = СтрокаОтвет1;
					
					Если СокрЛП(РезультатПроверки1)="false" Тогда
						Сообщить("Соединение не установлено");
					Иначе
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Ответ.КодСостояния = 500 Тогда
				Сообщить("Изменение статусов события. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
				Сообщить("Изменение статусов события. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
			ИначеЕсли Ответ.КодСостояния = 301 Тогда
				Сообщить("Изменение статусов события. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
			Иначе
				Сообщить("Изменение статусов события. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьДанныеПоЛицевымСчетам() Экспорт
	
	ОтправитьДанныеПоЛицевымСчетамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьИОбновитьДанныеПоЛицевымСчетам() Экспорт
	
	ОтправитьИОбновитьДанныеПоЛицевымСчетамНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	//Интервал = Объект.ИнтервалАвтономнойРаботы*60;
	//Если Интервал = 0 Тогда
	//	Интервал = 5 ;
	//КонецЕсли;
	
	Объект.СтатусВРаботе    = 27;
	Объект.СтатусОбработано = 29;
	Объект.СтатусОтклонено  = 30;
	Объект.СтатусЗакрыто    = 28;
	
	//ПодключитьОбработчикОжидания("ОтправитьДанныеПоЛицевымСчетам",Интервал,Ложь);
	//ПодключитьОбработчикОжидания("ОтправитьИОбновитьДанныеПоЛицевымСчетам",43200,Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЛС = Справочники.бит_ЛицевыеСчета.Выбрать();
	Пока ЛС.Следующий() Цикл
		Если ЛС.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		НовЛС = ТаблицаЛицевыхСчетов.Добавить();
		НовЛС.ЛицевойСчет       = ЛС.Ссылка;
		НовЛС.ЕстьВМобстед      = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого Стр Из ТаблицаЛицевыхСчетов Цикл
		Если СТр.ЕстьВМобстед Тогда
			Стр.ЕстьВМобстед = Ложь;
		Иначе
			Стр.ЕстьВМобстед = Истина;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура СоздатьОплатуКУНаСервере()
	
	Документ = Документы.бит_ОплатаКУ.СоздатьДокумент();
	
	Дата = ТекущаяДата();
	
	Документ.Дата           = Дата;
	Документ.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
	Документ.Организация    = Объект.Организация;
	
	// бит_RAKordo-sysoev 15.04.2014
	Документ.Ответственный  = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	// бит_RAKordo-sysoev 15.04.2014
	
	//Документ.ИсточникОплаты = СтрокаКорня.ИсточникОплаты;
	// bit_akozlov_12082013_начало_изменений
	//Документ.ВводВРучную    = Объект.Вручную;
	//Документ.НомерРеестра   = Объект.НомерРеестра;
	// bit_akozlov_12082013_окончание_изменений
	Документ.Комментарий    = "Документ создан автоматически из обработки ""Интеграция с Mobsted"".";
	
	//ИтогПоДокументу      = СтрокаКорня.Сумма;
	СуммаИтогПоДокументу = 0;
	
	//ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
	
	МассивЛС = Новый Массив;
	
	ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
	
	Для каждого СтрокаВторогоУровня Из ТаблицаЛицевыхСчетов Цикл
		
		Если НЕ СтрокаВторогоУровня.ПоследняяОплата = 0 Тогда
			
			НоваяСтрокаЛС = Документ.СписокЛС.Добавить();
			НоваяСтрокаЛС.ЛицевойСчет     = СтрокаВторогоУровня.ЛицевойСчет;
			//НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
			НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
			
			ИтогПоЛС      = СтрокаВторогоУровня.ПоследняяОплата;
			СуммаИтогПоЛС = 0;
			
			
			// bit_akozlov_12082013_начало_изменений
			//Документ.ВводВРучную    = Объект.Вручную;
			// bit_akozlov_12082013_окончание_изменений
			НоваяСтрокаЛС.Сумма = СтрокаВторогоУровня.ПоследняяОплата;
			
			ТаблицаЛС          = Документ.СписокЛС.Выгрузить();
			КоммунальныеУслуги = Документ.СписокУслуг.ВыгрузитьКолонки();
			
			бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Дата,
			Объект.Организация,
			ТаблицаЛС,
			КоммунальныеУслуги,
			ПараметрыЖКХ.ЛьготаПерсонифицированная,
			ПараметрыЖКХ.РасчетСУчетомДолейВладения,
			ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта,
			ПараметрыЖКХ.НачислениеСУчетомДнейПроживания,
			// bit_akozlov_06102013_начало_изменений
			ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
			ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
			// bit_akozlov_06102013_окончание_изменений
			
			// бит_RAKordo-sysoev 02.09.2014
			ПараметрыЖКХ.НачислятьПениСУчетомПереплаты); 
			// бит_RAKordo-sysoev 02.09.2014
			
			Документ.СписокУслуг.Очистить();
			Документ.СписокУслуг.Загрузить(КоммунальныеУслуги);
			
			СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.ПоследняяОплата;
			
			
		КонецЕсли; 
	КонецЦикла; 
	
	Документ.СуммаДокумента = СуммаИтогПоДокументу;
	
	Документ.ЗапролнитьСчета();
	
	Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
		
		//СтрокаКорня.ДокументОплаты = Документ.Ссылка;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОплатуКУ(Команда)
	СоздатьОплатуКУНаСервере();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////////
//Процедуры и функции получения данных////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////

//Получает структуру данных лицевого счета для выгрузки в мобстед
&НаСервере
Функция ПолучитьСтруктуруДанныхЛицевогоСчета(ЛицевойСчет)
	
	Структура = Новый Структура("Phone, Email, Имя_Отчество, Город, Улица, Дом, Корпус, Квартира, ApiSumma, Помещение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиесяПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиесяПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиесяПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	ПроживающиесяПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиесяПоЛССрезПоследних.ДатаЗаписи,
	|	ПроживающиесяПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиесяПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиесяПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиесяПоЛССрезПоследних.СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиесяПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"		, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет"	, ЛицевойСчет.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
			ОтветсвенноеЛицо = Выборка.ФизЛицо;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ВладелецЛицевогоСчета = ОтветсвенноеЛицо;
	
	Если Объект.ПередаватьФамилию Тогда
		//Структура.Имя_Отчество        = ВладелецЛицевогоСчета.Наименование; 
		Структура.Имя_Отчество        = СтрЗаменить(ВладелецЛицевогоСчета.Наименование,"""","\"+"""");
	Иначе
		ИмяОтчество = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВладелецЛицевогоСчета.Наименование);
		Структура.Имя_Отчество        = СтрЗаменить(Строка(ИмяОтчество.Имя)+" "+Строка(ИмяОтчество.Отчество),"""","\"+"""");
	КонецЕсли;
	
	//Структура.Имя_Отчество = Транслит(Структура.Имя_Отчество);
	
	Телефон              = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(ВладелецЛицевогоСчета);
	Тел = СтрЗаменить(Телефон,"-","");
	Тел = СтрЗаменить(Тел,"+7","7");
	Тел = СтрЗаменить(Тел,"-","");
	Тел = СтрЗаменить(Тел,"(","");
	Тел = СтрЗаменить(Тел,")","");
	Тел = СтрЗаменить(Тел,Символы.НПП,"");
	Тел = СтрЗаменить(сокрлп(Тел)," ","");
	Если Лев(Тел,1)="8" и СтрДлина(Тел)>6 Тогда
		//	Тел = СтрЗаменить(Лев(Тел,1),"8","7");
		тел="7" + Прав(тел,СтрДлина(тел)-1);
	КонецЕсли;
	
	Структура.Phone               = Тел;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.EmailПроживающего)";
	
	Запрос.УстановитьПараметр("Объект", ВладелецЛицевогоСчета);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЭлПочтаПроживающего = "";
	Если Выборка.Следующий() Тогда
		ЭлПочтаПроживающего = Выборка.Представление;
		Структура.Email     = ЭлПочтаПроживающего;
	КонецЕсли;
	Структура.Улица    = ЛицевойСчет.Здание.Улица;
	Структура.Город    = ЛицевойСчет.Здание.Район;
	Структура.Дом      = Строка(ЛицевойСчет.Здание.Улица)+", д. "+ЛицевойСчет.Здание.НомерДома+СТрока(?(ЛицевойСчет.Здание.Корпус="","",", корп. "+Строка(ЛицевойСчет.Здание.Корпус)));
	Структура.Корпус   = ЛицевойСчет.Здание.Корпус;
	Структура.Квартира = ЛицевойСчет.Квартира.Наименование;
	Структура.Помещение = ЛицевойСчет.Здание.ПочтовыйАдрес+", кв. "+Строка(ЛицевойСчет.Квартира.НомерКвартиры);
	
	//Структура.Улица    = Транслит(ЛицевойСчет.Здание.Улица);
	//Структура.Город    = Транслит(ЛицевойСчет.Здание.Район);
	//Структура.Дом      = ЛицевойСчет.Здание.НомерДома;
	//Структура.Корпус   = ЛицевойСчет.Здание.Корпус;
	//Структура.Квартира = ЛицевойСчет.Квартира.Наименование;
	
	
	//Долг + текущие начисления
	
	ДолгПоЛС = ВывестиСуммуДолгаПоЛС(ЛицевойСчет);
	Долг     = ДолгПоЛС.СтрокаДолга;
	Структура.ApiSumma = Долг;
	
	Возврат Структура;
	
КонецФункции	

Функция ПолучитьПоказанияСчетчиков(СДаты, ПоДату)
	
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """StatusId"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(Объект.СтатусВРаботе)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Показания приборов учета"""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";
	
	СтрокаПараметров = КодироватьСтроку(СтрокаПараметров,СпособКодированияСтроки.КодировкаURL);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		Сообщить("Получение показаний счетчиков. Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					Сообщить("Соединение не установлено");
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					ТЗ = РаспарситьВТаблицуПоказания(ЗагруженныеДанные);
					
					ЗагрузитьТаблицуВДокумент(ТЗ);
					
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Получение показаний. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Получение показаний. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Получение показаний. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Получение показаний. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция РаспарситьВТаблицуПоказания(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЛС");
	ТЗ.Колонки.Добавить("Показатель");
	ТЗ.Колонки.Добавить("ПриборУчета");
	ТЗ.Колонки.Добавить("Дата");
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_События");
	ТЗ.Колонки.Добавить("ИмяСчетчика");
	ТЗ.Колонки.Добавить("УслугаСчетчика");
	Для Каждого стр из Данные Цикл
		
		Нов = ТЗ.Добавить();
		
		Нов.ЛС            = Стр["object_Код1С"];
		Нов.Показатель    = Стр["value_Показатель"];
		Нов.ПриборУчета   = Стр["value_ПриборУчета"];
		Нов.ИмяСчетчика   = Стр["value_Наименование_прибора"]; // value_Сч":"СчЭЭНочь1"
		Нов.ИмяСчетчика   = СтрЗаменить(СокрЛП(Нов.ИмяСчетчика),"Счетчик электроэнергии ","");
		Нов.ИмяСчетчика   = СтрЗаменить(СокрЛП(Нов.ИмяСчетчика),"Счетчик горячего водоснабжения ","");
		Нов.ИмяСчетчика   = СтрЗаменить(СокрЛП(Нов.ИмяСчетчика),"Счетчик холодного водоснабжения ","");
		Нов.ИмяСчетчика   = СтрЗаменить(СокрЛП(Нов.ИмяСчетчика),"Счетчик отопления ","");
		
		Нов.УслугаСчетчика          = Стр["value_Имя"];
		
		
		Нов.Дата          = Стр["UpdateDate"];
		Нов.Статус        = Стр["StatusId"]; //17 - Обработан;  15 - В Работе
		Нов.ИД_События    = Стр["id"];       //ИД события по которому будем менять статус
		Нов.ИД_События    = СтрЗаменить(СокрЛП(Нов.ИД_События),Символы.НПП,"");       //ИД события по которому будем менять статус
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
КонецФункции	                     

Функция РаспарситьВТаблицуЗапросКвитанции(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЛС");
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_События");
	ТЗ.Колонки.Добавить("ИД_Объекта");
	
	Для Каждого стр из Данные Цикл
		
		Нов = ТЗ.Добавить();
		
		Нов.ЛС            = Стр["object_Код1С"];
		Нов.Статус        = Стр["StatusId"]; //17 - Обработан;  15 - В Работе
		Нов.ИД_События    = Стр["id"];       //ИД события по которому будем менять статус
		Нов.ИД_События    = СтрЗаменить(СокрЛП(Нов.ИД_События),Символы.НПП,"");
		Нов.ИД_Объекта    = Стр["object_id"];
		Нов.ИД_Объекта    = СтрЗаменить(СокрЛП(Нов.ИД_Объекта),Символы.НПП,"");
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
КонецФункции

Функция РаспарситьСтатусы(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_Статуса");
	
	Для Каждого стр из Данные Цикл
		
		Нов = ТЗ.Добавить();
		
		Нов.Статус            = Стр["Name"];
		Нов.ИД_Статуса    = Стр["id"];       //ИД события по которому будем менять статус
		Нов.ИД_Статуса    = СтрЗаменить(СокрЛП(Нов.ИД_Статуса),Символы.НПП,"");
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
КонецФункции

&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

//Загрузим таблицу с показаниями в БД
Процедура ЗагрузитьТаблицуВДокумент(ТЗ)
	
	ТаблицаДляИзмененияСтатуса = Новый ТаблицаЗначений;
	ТаблицаДляИзмененияСтатуса.Колонки.Добавить("ИД_События");
	ИзменитьСтатусы = Ложь;
	
	ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
	
	ДокументВводПоказаний.Организация = Объект.Организация;
	ДокументВводПоказаний.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	ДокументВводПоказаний.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
	ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
	ДокументВводПоказаний.ПоказанияНаселения = Истина;
	ДокументВводПоказаний.Дата = ТекущаяДата();
	
	ДокументВводПоказаний.Комментарий    = "Документ создан автоматически из обработки mobsted_integration.";
	ДокументВводПоказаний.Ответственный    = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	
	//	ДокументОбъект           = ДанныеФормыВЗначение(ДокументВводПоказаний, ПолучитьТипОбъекта(ДокументВводПоказаний.Ссылка));
	//	
	//ДокументОбъект.ОбновитьПараметрыЖКХ();
	//мСчетчикиПодкруткаСервер = ДокументОбъект.мСчетчикиПодкрутка;
	//мПодкруткаНаЛСНаСервере  = ДокументОбъект.мПодкруткаНаЛС;
	
	
	
	
	Для Каждого Стр Из ТЗ Цикл
		Если Стр.Статус = Строка(Объект.СтатусЗакрыто) Тогда Продолжить; КонецЕсли;
		
		СпрЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоКоду(Стр.ЛС);
		Если СпрЛС<>Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда
			Счетчик = Справочники.бит_Счетчики.НайтиПоКоду(Стр.ПриборУчета);
			////////////////////
			
			НовСтрСтатус = ТаблицаДляИзмененияСтатуса.Добавить();
			НовСтрСтатус.ИД_События   = Стр.ИД_События;
			
			Запрос = Новый Запрос;
			МВТ    = Новый МенеджерВременныхТаблиц;
			
			Запрос.МенеджерВременныхТаблиц = МВТ;
			
			ТекстИндивидуальныеСчетчики =  
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
			|ПОМЕСТИТЬ Проживающие
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_ПроживающиеПоЛССрезПоследних
			|ГДЕ
			|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
			|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата)
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
			|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
			|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
			|	бит_СведенияПоУслугамЛССрезПоследних.Использовать КАК Использовать,
			|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
			|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
			|ПОМЕСТИТЬ Услуги
			|ИЗ
			|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_СведенияПоУслугамЛССрезПоследних
			|ГДЕ
			|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
			|	И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Услуги.ЛицевойСчет КАК ЛицевойСчет,
			|	Услуги.Услуга КАК Услуга,
			|	Услуги.РежимПотребления КАК РежимПотребления,
			|	Услуги.Поставщик КАК Поставщик,
			|	Услуги.Использовать КАК Использовать,
			|	Услуги.СпособРасчета КАК СпособРасчета,
			|	Услуги.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
			|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
			|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
			|	Проживающие.КолПроживающих КАК КолПроживающих
			|ПОМЕСТИТЬ Сведения
			|ИЗ
			|	Услуги КАК Услуги
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних
			|		ПО Услуги.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
			|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
			|		ПО Услуги.ЛицевойСчет = Проживающие.ЛицевойСчет
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сведения.ЛицевойСчет КАК ЛицевойСчет,
			|	Сведения.Услуга КАК Услуга,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
			|	ЕСТЬNULL(Сведения.КолПроживающих, 0) КАК КолПроживающих,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
			|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного
			|ПОМЕСТИТЬ Нормы
			|ИЗ
			|	Сведения КАК Сведения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
			|				&Дата,
			|				Услуга В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						таб.Услуга КАК Услуга
			|					ИЗ
			|						Услуги КАК таб)) КАК бит_НормыНаУслугиСрезПоследних
			|		ПО Сведения.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
			|			И Сведения.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
			|			И Сведения.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
			|			И Сведения.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
			|			И Сведения.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
			|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания,
			|	ЕСТЬNULL(Нормы.НаОдного, 0) КАК НаОдного,
			|	ЕСТЬNULL(Нормы.НаДвоих, 0) КАК НаДвоих,
			|	ЕСТЬNULL(Нормы.НаСемью, 0) КАК НаСемью,
			|	ЕСТЬNULL(Нормы.НаСемью4, 0) КАК НаСемью4,
			|	ЕСТЬNULL(Нормы.НаСемью5, 0) КАК НаСемью5,
			|	ЕСТЬNULL(Нормы.НаСемью6, 0) КАК НаСемью6,
			|	ЕСТЬNULL(Нормы.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
			|	ЕСТЬNULL(Нормы.КолПроживающих, 0) КАК КолПроживающих,
			|	ЕСТЬNULL(Нормы.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
			|	ЕСТЬNULL(Нормы.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
			|	ЕСТЬNULL(Нормы.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
			|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный
			|ИЗ
			|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
			|			&Дата,
			|			Объект = &Объект
			|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
			|				&Дата,
			|				Объект = &Объект
			|					И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
			|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
			|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
			|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
			|		ЛЕВОЕ СОЕДИНЕНИЕ Нормы КАК Нормы
			|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = Нормы.ЛицевойСчет
			|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = Нормы.Услуга
			|ГДЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет
			|ИТОГИ ПО
			|	Счетчик";
			
			ТекстГрупповыеСчетчики =  
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
			|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
			|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания,
			|	0 КАК НаОдного,
			|	0 КАК НаДвоих,
			|	0 КАК НаСемью,
			|	0 КАК НаЛицевойСчет,
			|	0 КАК КолПроживающих,
			|	0 КАК ДопНормаНаСемью,
			|	0 КАК ДопНормаНаКаждого,
			|	ЛОЖЬ КАК ИспользоватьДопНормуНаОдного,
			|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
			|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный
			|ИЗ
			|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
			|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
			|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
			|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
			|ГДЕ
			|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет
			|ИТОГИ ПО
			|	Счетчик";
			
			Запрос.УстановитьПараметр("Дата"   , КонецДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("Счетчик", Счетчик);
			
			Дом = СпрЛС.Ссылка.Здание;
			Квартира = СпрЛС.Ссылка.Квартира;
			
			Если Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
				Запрос.УстановитьПараметр("Объект", Дом);
				Запрос.Текст = ТекстГрупповыеСчетчики;
			Иначе
				Запрос.УстановитьПараметр("Объект"  , СпрЛС.Ссылка);
				Запрос.УстановитьПараметр("Квартира", Квартира); 
				Запрос.Текст = ТекстИндивидуальныеСчетчики;
			КонецЕсли; 
			
			ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			
			Пока ВыборкаСЧ.Следующий() Цикл
				//НовСтр = ДокументВводПоказаний.ПоказанияПоСчетчикам.Добавить();
				//		НовСТр.ЛицевойСчет        = СпрЛС.Ссылка;
				//		НовСтр.Счетчик            = Справочники.бит_Счетчики.НайтиПоКоду(Стр.ПриборУчета);
				//		НовСтр.Услуга             = НовСтр.Счетчик.Услуги;
				//		
				//		НовСтр.ТекущиеПоказания   = Стр.Показатель;
				
				
				ТекПоказания = Стр.Показатель;
				Показания    = 0;
				Выборка   = ВыборкаСч.Выбрать();
				ПерваяСтрока = Истина;
				
				Пока Выборка.Следующий() Цикл
					
					Если ПерваяСтрока Тогда
						
						////Строка = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиПоИдентификатору(1);
						Строка = ДокументВводПоказаний.ПоказанияПоСчетчикам.Добавить();
						
					Иначе
						
						Строка = ДокументВводПоказаний.ПоказанияПоСчетчикам.Добавить();
						
					КонецЕсли;
					
					Если ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой  Тогда
						
						Строка.Улица = Выборка.Объект.Улица;
						Строка.Дом   = Выборка.Объект;
						
					Иначе
						
						Строка.Улица       = Выборка.Объект.УлицаЛицевогоСчета;
						Строка.Дом         = Выборка.Объект.Здание;
						Строка.ЛицевойСчет = Выборка.Объект;
						
					КонецЕсли; 
					
					Строка.Счетчик                    = Счетчик;
					Строка.Услуга                     = Выборка.Услуга;
					Строка.Разрядность                = Выборка.Разрядность;
					Строка.ПредыдущиеПоказания        = Выборка.ПредыдущиеПоказания;
					
					//Если СокрЛП(Стр.ИмяСчетчика)      = СокрЛП(Выборка.Услуга) Тогда
					Если   Найти(нрег(Стр.УслугаСчетчика),нрег(Выборка.Услуга)) <> 0 ТОгда
						
						Строка.ТекущиеПоказания           = ТекПоказания;
						
					КонецЕсли;
					
					Строка.КоличествоЕдиницПоСчетчику = 0;
					Строка.Многотарифный              = Выборка.Многотарифный;
					
					//Если ДокументВводПоказаний.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки Тогда
						
						//Если НЕ мСчетчикиПодкруткаСервер Тогда
						//	
						//	// бит_RAKordo-sysoev 03.03.2015{{
						//	// Сообщить("Подкрутка счетчиков не ведется по этой организации!", СтатусСообщения.ОченьВажное);.
						//	Сообщение = Новый СообщениеПользователю();
						//	Сообщение.Текст = "Подкрутка счетчиков не ведется по этой организации!";
						//	Сообщение.Сообщить();
						//	// бит_RAKordo-sysoev 03.03.2015}}
						//	
						//	ДокументВводПоказаний.ПоказанияПоСчетчикам.Очистить();
						//	Возврат;
						//	
						//КонецЕсли; 
						
						Если ТекПоказания <> 0 Тогда
							
							//Строка.ТекущиеПоказания           = ТекПоказания;
							//Строка.КоличествоЕдиницПоСчетчику = Показания;
							
						Иначе
							
							Норма     = 0;
							Показания = 0;
							КолПроживающих = ?(Выборка.КолПроживающих = 0, 1, Выборка.КолПроживающих);
							
							Если КолПроживающих = 1 Тогда
								
								Норма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
								
							ИначеЕсли КолПроживающих = 2 Тогда
								
								Норма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;
								
							ИначеЕсли КолПроживающих = 3 Тогда
								
								Норма  = Выборка.НаСемью * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
								
							ИначеЕсли КолПроживающих = 4 Тогда
								
								Норма  = Выборка.НаСемью4 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
								
							ИначеЕсли КолПроживающих = 5 Тогда
								
								Норма  = Выборка.НаСемью5 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
								
							ИначеЕсли КолПроживающих > 5 Тогда
								
								Норма  = Выборка.НаСемью6 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
								
							КонецЕсли;
							
							//Если мПодкруткаНаЛСНаСервере Тогда
							//	
							//	Показания = Окр(Выборка.НаЛицевойСчет,4);
							//	
							//Иначе
							
							Показания = Окр(Норма,4);
							
							//КонецЕсли; 
							
							ТекПоказания = Строка.ПредыдущиеПоказания + Показания;
							
							Если ТекПоказания > Строка.Разрядность Тогда
								
								ТекПоказания = ТекПоказания - Строка.Разрядность + 1;
								Показания    = Показания + 1 ;
								
							КонецЕсли;
							
							Строка.ТекущиеПоказания           = ТекПоказания;
							Строка.КоличествоЕдиницПоСчетчику = Показания;
							
						//КонецЕсли; 
						
					КонецЕсли;
					
					ПерваяСтрока  = Ложь;
					УдалитьСтарое = Истина;
					
				КонецЦикла; 
				
			КонецЦикла; 
			
			
			
			
			
			
			//
			//НовСтр = ДокументВводПоказаний.ПоказанияПоСчетчикам.Добавить();
			//НовСТр.ЛицевойСчет        = СпрЛС.Ссылка;
			//НовСтр.Счетчик            = Справочники.бит_Счетчики.НайтиПоКоду(Стр.ПриборУчета);
			//НовСтр.Услуга             = НовСтр.Счетчик.Услуги;
			//
			//НовСтр.ТекущиеПоказания   = Стр.Показатель;
			
			//НовСтрСтатус = ТаблицаДляИзмененияСтатуса.Добавить();
			//НовСтрСтатус.ИД_События   = Стр.ИД_События;
		КонецЕсли;
	КонецЦикла;	
	
	Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество()<>0 Тогда
		ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Запись);
		ПОпытка
			ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;	
		ИзменитьСтатусы = Истина;
	КонецЕсли;	
	
	Если ИзменитьСтатусы Тогда
		ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(Объект.СтатусЗакрыто));
	КонецЕсли;	
	
КонецПроцедуры	

//Взята из конфигурации, получает дату долга
&НаСервере
Функция ПолучитьДатуДолга(Организация, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(ВЫБОР
	|				КОГДА ДЕНЬ(&Дата) > бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДата(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции // ()

//Типовая из конфигурации
&НаСервере
Функция ВывестиСуммуДолгаПоЛС(ЛицевойСчет)
	
	ДатаДолга = ПолучитьДатуДолга(Объект.Организация, ТекущаяДата());
	
	// Определим сумму долга по начислениям для текущего лицевого счета.
	ЗапросПоНачислениям = Новый Запрос;
	ЗапросПоНачислениям.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	ЗапросПоНачислениям.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет.Ссылка);
	ЗапросПоНачислениям.УстановитьПараметр("ДатаДолга"   , ДатаДолга);
	ЗапросПоНачислениям.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|		СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаДолга {(&ДатаДолга)}, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет) КАК Долг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|						ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Оплата,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|						ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Разовые
	|		ИЗ
	|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(НАЧАЛОПЕРИОДА(&ДатаДолга, МЕСЯЦ) {(&ДатаДолга)}, &КонецПериода {(&КонецПериода)}, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ОплатаСДатыДолга
	|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет";
	
	тмпДолг = 0;
	
	Выборка = ЗапросПоНачислениям.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		тмпДолг = Выборка.Долг;
	КонецЕсли;
	
	Если тмпДолг > 0 Тогда
		ИнфСтрока = Строка(тмпДолг);
		ЦветНадписи = Новый Цвет(255, 0, 0); // Красный.
		
	Иначе
		ИнфСтрока = "0";
		ЦветНадписи = Новый Цвет(0, 0, 0);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СтрокаДолга", ИнфСтрока);
	СтруктураВозврата.Вставить("ЦветНадписи", ЦветНадписи);
	
	Возврат СтруктураВозврата;
	
КонецФункции  //ВывестиСуммуДолгаПоЛС()

//Возвращает таблицу с данными посчетчикам по лицевому счету
&НаСервере
Функция ПолучитьТаблицуДанныхПоСчетчикамЛицевогоСчета(ЛицевойСчет,НазваниеТаблицы)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		СписокЛС = Новый Массив;
		СписокЛС.Добавить(ЛицевойСчет.Ссылка);
	Иначе
		СписокЛС = Новый Массив;
	КонецЕсли;
	
	//СписокЗданий = Новый Массив;
	//СписокЗданий.Добавить(Объект.Здание);
	
	
	ТаблицаНач = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаСч  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТаблицаЛт  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
	ТаблицаРп  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	ТаблицаПр  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ТекущаяДата(), 
	Объект.Организация, 
	СписокЛС, 
	, 
	ложь, 
	Истина, 
	ТаблицаНач, 
	ТаблицаСч, 
	ТаблицаРп,
	ТаблицаЛт,
	,
	,
	Ложь,
	Ложь,
	Ложь,
	ТаблицаПр,
	Ложь,
	// bit_akozlov_04102013_начало_изменений
	// мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика);.
	Ложь,
	Ложь);
	
	
	Если НазваниеТаблицы = "ТаблицаНачислений" Тогда
		Возврат ТаблицаНач;
	Иначе
		Возврат ТаблицаСч;
	КонецЕсли;
	
	Для Каждого Стр из ТаблицаСч Цикл
		й=0;
		
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	//ТаблицаС = ДанныеФормыВЗначение(ТаблицаСчетчиков, Тип("ТаблицаЗначений"));
	
	Запрос.УстановитьПараметр("ТаблицаСЧ", ТаблицаСч);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСЧ.Счетчик,
	|	ТаблицаСЧ.Услуга,
	|	ТаблицаСЧ.Приоритет,
	|	ТаблицаСЧ.ДоПоказаний,
	|	ТаблицаСЧ.СпособРасчета,
	|	ТаблицаСЧ.ОтПоказаний,
	|	ТаблицаСЧ.КоличествоЕдиницПоЛС,
	|	ТаблицаСЧ.Многотарифный,
	|	ТаблицаСЧ.Норматив
	|ПОМЕСТИТЬ ТаблицаСчетчиков
	|ИЗ
	|	&ТаблицаСЧ КАК ТаблицаСЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетчиков.Счетчик КАК Счетчик,
	|	ТаблицаСчетчиков.Услуга,
	|	ТаблицаСчетчиков.Услуга.НаименованиеСокращенное КАК СокрНаименование,
	|	ТаблицаСчетчиков.Услуга.ОбщедомовыеНачисления КАК ОбщедомовыеНачисления,
	|	ТаблицаСчетчиков.Приоритет,
	|	ТаблицаСчетчиков.ДоПоказаний,
	|	ТаблицаСчетчиков.ОтПоказаний,
	|	ТаблицаСчетчиков.КоличествоЕдиницПоЛС КАК КоличествоЕдиниц,
	|	ТаблицаСчетчиков.Многотарифный КАК Многотарифный,
	|	ТаблицаСчетчиков.Норматив
	|ИЗ
	|	ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|ГДЕ
	|	ТаблицаСчетчиков.СпособРасчета = Значение(Перечисление.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам)
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(Многотарифный)
	|ПО
	|	Счетчик";
	
	ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСЧ.Следующий() Цикл
		
		
		Выборка = ВыборкаСЧ.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			//НоваяСтрока = мТаблицаПечатиСчетчиков.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Если НЕ ВыборкаСЧ.Многотарифный Тогда
				Прервать;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация"  , Объект.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ЛицевойСчет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.ВидОперации КАК Основание,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга КАК Услуга,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга.Приоритет КАК Приоритет,
	|	СУММА(бит_РазовыеПоУслугамЖКХСписокУслуг.Сумма) КАК Сумма
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ.СписокУслуг КАК бит_РазовыеПоУслугамЖКХСписокУслуг
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Организация = &Организация
	|	И бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Проведен
	|	И (бит_РазовыеПоУслугамЖКХСписокУслуг.ЛицевойСчет = &ЛицевойСчет
	|			ИЛИ бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.ЛицевойСчет = &ЛицевойСчет)
	|	И бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка.ВидОперации,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга,
	|	бит_РазовыеПоУслугамЖКХСписокУслуг.Услуга.Приоритет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.ВидОперации,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга.Приоритет,
	|	СУММА(бит_РазовыеПоУслугамЖКХЛицевыеСчета.Сумма)
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ.ЛицевыеСчета КАК бит_РазовыеПоУслугамЖКХЛицевыеСчета
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Проведен
	|	И бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Организация = &Организация
	|	И (бит_РазовыеПоУслугамЖКХЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|			ИЛИ бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.ЛицевойСчет = &ЛицевойСчет)
	|	И бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.Дата,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка.ВидОперации,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга,
	|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основание,
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//НоваяСтрока = мТаблицаПерерасчетов.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла; 
	
	
	
	
	
КонецФункции

//Типовая из конфигурации
&НаСервере
Функция ОбновитьПараметрыЖКХ(Дата)
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика", Ложь);
	
	// bit_akozlov_06102013_начало_изменений
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	// bit_akozlov_06102013_окончание_изменений
	
	// бит_RAKordo-sysoev 02.09.2014
	ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты", Ложь); 
	// бит_RAKordo-sysoev 02.09.2014
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Объект.Организация, ПараметрыЖКХ);
	
	Возврат ПараметрыЖКХ;
	
КонецФункции

Функция ПолучитьТаблицуОплатПоЛицевомуСчету(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.СуммаРасход,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.ОстаткиИОбороты(, , Регистратор, , ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.ЛицевойСчет = &ЛицевойСчет
	|	И бит_НачисленияПоУслугамЖКХПоПериодуОстаткиИОбороты.Организация = &Организация";
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Возврат		Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция Транслит(РусскоеСлово) 
	РусскийАлфавит = "абвгдеёжзийклмнопрстуфхцчшщыэюяabcdefghijklmnopqrstuvwxyz1234567890"; 
	ТранслитАлфавит = "a 1b 2v 3g 4d 5e 6yo7zh8z 9i 10i 11k 12l 13m 14n 15o 16p 17r 18s 19t 20u 21f 22h 23c 24ch25sh26sh27i 28e 29yu30ya31a 32b 33c 34d 35e 36f 37g 38h 39i 40j 41k 42l 43m 44n 45o 46p 47q 48r 49s 50t 51u 52v 53w 54x 55y 56z 571 582 593 604 615 626 637 648 659 660 67"; 
	ц=0;
	СловоВТранслите = ""; 
	ОП=0;
	Для Х=1 По СтрДлина(РусскоеСлово) Цикл 
		РусскаяБуква = НРег(Сред(РусскоеСлово,Х,1)); 
		Н = Найти(РусскийАлфавит,РусскаяБуква); 
		Если Н>0 Тогда
			Т = Найти(ТранслитАлфавит,Н); 
			ТранслитБуква = СокрЛП(Сред(ТранслитАлфавит,Т-2,2)); 
			Если ОП=0 Тогда  ТранслитБуква = ВРег(ТранслитБуква); ОП=1; КонецЕсли;
			
			СловоВТранслите = СловоВТранслите+ТранслитБуква;
		Иначе
			Если РусскаяБуква = "ь" или РусскаяБуква = "ъ" Тогда ПродолжиТЬ; КонецЕсли;
			СловоВТранслите = СловоВТранслите+" ";
			ОП=0;
			ц=ц+1;
			если ц=2 Тогда прервать; КонецЕсли;
			
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СловоВТранслите; 
КонецФункции

&НаСервере
Процедура СформироватьФайлКвитанцииНаСервере()
	// Вставить содержимое обработчика.
	ЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию("100000");
	//Квитанция = ПечатьЕдиныйПлатежныйДокумент(ЛС);
	//ЛС  = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию("100000");    //!Переделать
	
	Квитанция = ПечатьПлатежныйДокументРК924(ЛС,ТекущаяДата());
	Квитанция.Записать("C:\Users\mobsted1\Desktop\Mobsted\1.pdf", ТипФайлаТабличногоДокумента.PDF);
	
	//
	//АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	//АдресРесурса = "/api/v4/events/eventfile";
	//ТелоPOSTЗапроса = "?eventid=17";
	//
	//СтрокаПараметров = ""; 
	//
	//
	//HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	//
	//Попытка
	//	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	//	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	//	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоPOSTЗапроса);
	//	Ответ = HTTPСоединение.ВызватьHTTPМетод("PUT",HTTPЗапрос);	
	//Исключение
	//	Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	//КонецПопытки;
	//
	//Если Ответ.КодСостояния = 200 Тогда
	//	СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	//	Сообщить(СтрокаОтвет1);
	//	Если Не ПустаяСтрока(СтрокаОтвет1) Тогда
	//		РезультатПроверки1 = СтрокаОтвет1;
	//		Если СокрЛП(РезультатПроверки1)="false" Тогда
	//			Сообщить("Соединение не установлено");
	//		Иначе
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//ИначеЕсли Ответ.КодСостояния = 500 Тогда
	//	Сообщить("Ошибка на сервере. Код ошибки: 500");
	//ИначеЕсли Ответ.КодСостояния = 404 Тогда
	//	Сообщить("Неверная ссылка. Код ошибки: 404");
	//ИначеЕсли Ответ.КодСостояния = 301 Тогда
	//	Сообщить("Ошибка на сервере. Код ошибки: 301");
	//КонецЕсли;
	
	
КонецПроцедуры

// Процедура Заполняет параметр.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьПараметр(Область, ИмяПараметра, ЗначениеПараметра)
	
	Попытка
		
		Область.Параметры[ИмяПараметра] = ЗначениеПараметра;
		
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры // ()

Функция ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода) Экспорт
	
	// Зададим размер картинки.
	мВнешняяКомпонента.Ширина = ПараметрыШтрихкода.Ширина;
	мВнешняяКомпонента.Высота = ПараметрыШтрихкода.Высота;
	
	// Разрешим компоненте самой определять тип кода.
	мВнешняяКомпонента.АвтоТип = Ложь;
	мВнешняяКомпонента.ТипКода         = ПараметрыШтрихкода.ТипКода;
	мВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	Попытка
		мВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	Исключение
		
	КонецПопытки;
	
	мВнешняяКомпонента.СодержитКС = СтрДлина(ПараметрыШтрихкода.Штрихкод) = 43;
	
	// Если отображать контрольный символ не нужно.
	мВнешняяКомпонента.ВидимостьКС = Ложь;
	
	// Формируем картинку штрихкода.
	мВнешняяКомпонента.ЗначениеКода = ПараметрыШтрихкода.Штрихкод;
	
	// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
	Если мВнешняяКомпонента.Ширина < мВнешняяКомпонента.МинимальнаяШиринаКода Тогда
		// Скорректируем ширину.
		мВнешняяКомпонента.Ширина = мВнешняяКомпонента.МинимальнаяШиринаКода + 10;
	КонецЕсли;
	
	// Сформируем картинку.
	ДвоичныеДанныеКартинки = мВнешняяКомпонента.ПолучитьШтрихкод();
	
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		// Формируем из двоичных данных.
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ВывестиЗамечания(ТабличныйДокумент, Знач ЛицевойСчет)
	
	ЗапросЗамечание = Новый Запрос;
	ЗапросЗамечание.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗамечанияПоЛС.ЛицевойСчет,
	|	бит_ЗамечанияПоЛС.Наименование,
	|	бит_ЗамечанияПоЛС.ТекстЗамечания,
	|	бит_ЗамечанияПоЛС.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.бит_ЗамечанияПоЛС КАК бит_ЗамечанияПоЛС
	|ГДЕ
	|	бит_ЗамечанияПоЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_ЗамечанияПоЛС.Исполнено = ЛОЖЬ
	|	И бит_ЗамечанияПоЛС.ВыводитьНаПечать = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	ЗапросЗамечание.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	РезультатЗапроса = ЗапросЗамечание.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ШапкаЗамечания         = мМакет.ПолучитьОбласть("ШапкаЗамечания");
		ОбластьСтрокаОбращение = мМакет.ПолучитьОбласть("СтрокаОбращение");
		
		ТабличныйДокумент.Вывести(ШапкаЗамечания);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьПараметр(ОбластьСтрокаОбращение, "ОбращениеСтрока", Выборка.Номер + ".  " + Выборка.ТекстЗамечания);
			ТабличныйДокумент.Вывести(ОбластьСтрокаОбращение);
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруДанных() Экспорт
	
	СтруктураДанных = Новый Структура;
	
	// Данные общие для печати.
	СтруктураДанных.Вставить("ПолучательПредставление"          , "");
	СтруктураДанных.Вставить("ПолучательСокращенноеНаименование", "");
	СтруктураДанных.Вставить("ПолучательРС"                     , Справочники.БанковскиеСчета.ПустаяСсылка());
	СтруктураДанных.Вставить("ПолучательБанк"                   , "");
	СтруктураДанных.Вставить("ПолучательКоррСчет"               , "");
	СтруктураДанных.Вставить("ПолучательИНН"                    , "");
	СтруктураДанных.Вставить("ПолучательКПП"                    , "");
	СтруктураДанных.Вставить("Период"                           , "");
	СтруктураДанных.Вставить("ПолучательАдрес"                  , "");
	СтруктураДанных.Вставить("ПолучательТелефон"                , "");
	СтруктураДанных.Вставить("ПолучательДопИнформация"          , "");
	СтруктураДанных.Вставить("ПолучательКоррСчет2"              , "");
	СтруктураДанных.Вставить("ПолучательБИК"                    , "");
	СтруктураДанных.Вставить("Дата"                             , КонецМесяца(ТекущаяДата()));
	СтруктураДанных.Вставить("ДатаПечатиКвитанций"              , "");
	СтруктураДанных.Вставить("ПериодМесяц"                      , "");
	СтруктураДанных.Вставить("ПериодГод"                        , "");
	СтруктураДанных.Вставить("ДатаНачалоМесяца"                 , НачалоМесяца(ТекущаяДата()));
	// bit_akozlov_080813_начало_изменений
	СтруктураДанных.Вставить("ДатаОкончанияМесяца"              , КонецМесяца(ТекущаяДата()));
	// bit_akozlov_080813_окончание_изменений
	СтруктураДанных.Вставить("ПолучательПлатежа");
	СтруктураДанных.Вставить("ПроцентОтОплаты"                  , 0);
	// Данные заполняемы по ЛС.
	СтруктураДанных.Вставить("ЛицевойСчетФио"                   , Справочники.бит_Проживающие.ПустаяСсылка());
	СтруктураДанных.Вставить("ЛицевойСчетНомер"                 , "");
	СтруктураДанных.Вставить("ЛицевойСчетАдрес"                 , "");
	СтруктураДанных.Вставить("КоличествоПроживающих"            , 0);
	СтруктураДанных.Вставить("ОписаниеОбщейПлощади"             , 0);
	СтруктураДанных.Вставить("ОписаниеЖилойПлощади"             , 0);
	СтруктураДанных.Вставить("ОписаниеОтапливаемойПлощади"      , 0);
	
	СтруктураДанных.Вставить("Сальдо"                           , 0);
	СтруктураДанных.Вставить("СальдоЗнак"                       , "");
	СтруктураДанных.Вставить("СальдоСоЗнаком"                   , 0);
	СтруктураДанных.Вставить("Оплата"                           , 0);
	СтруктураДанных.Вставить("Льгота"                           , 0);
	СтруктураДанных.Вставить("Разовые"                          , 0);
	СтруктураДанных.Вставить("ЛицевойСчет"                      , Справочники.бит_ЛицевыеСчета.ПустаяСсылка());
	СтруктураДанных.Вставить("ИтогПени"                         , 0);
	СтруктураДанных.Вставить("КолЛьготников"                    , 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплаты"              , 0);
	// БИТ_ЖКХ 18.08.2016 10:46:20 Начало правки...
	СтруктураДанных.Вставить("ДатаПоследнейОплатыКапРем"        , 0);
	СтруктураДанных.Вставить("ДатаПоследнейОплатыНеКапРем"      , 0);
	// БИТ_ЖКХ 18.08.2016 10:46:20 Конец правки.
	СтруктураДанных.Вставить("СтатусКвартиры"                   , Справочники.бит_СтатусыКвартиры.ПустаяСсылка());
	СтруктураДанных.Вставить("КоличествоКомнат"                 , 0);
	СтруктураДанных.Вставить("Переплата"                        , 0);
	СтруктураДанных.Вставить("Долг"                             , 0);
	СтруктураДанных.Вставить("Авансы"                           , 0);
	СтруктураДанных.Вставить("ПереплатаНаНачало"                , 0);
	СтруктураДанных.Вставить("Оплата"                           , 0);
	СтруктураДанных.Вставить("Начислено"                        , 0);
	СтруктураДанных.Вставить("НачисленоИнд"                     , 0);
	СтруктураДанных.Вставить("НачисленоОбщДом"                  , 0);
	СтруктураДанных.Вставить("КОплате"                          , 0);
	СтруктураДанных.Вставить("КОплатеЗаМесяц"                   , 0);
	СтруктураДанных.Вставить("Сальдо"                           , 0);
	СтруктураДанных.Вставить("ДолгНач"                          , 0);
	СтруктураДанных.Вставить("ДолгКон"                          , 0);
	СтруктураДанных.Вставить("Разовые"                          , 0);
	СтруктураДанных.Вставить("ТипКвартиры"                      , Справочники.бит_ТипыКвартиры.ПустаяСсылка());
	СтруктураДанных.Вставить("ОписаниеЛьгот"                    , "");
	СтруктураДанных.Вставить("ОписаниеСложнойЛьготы"            , "");
	СтруктураДанных.Вставить("ГруппироватьУслуги"               , Ложь);
	СтруктураДанных.Вставить("ПечатьЗависимыхЛС"                , Ложь);
	СтруктураДанных.Вставить("ДолгСУчетомОплаты"                , 0);
	СтруктураДанных.Вставить("РежимРаботы"                      ,"");
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПредоплаты"    ,0);
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПени"          ,0);
	// бит_DMarkin 22.05.2013
	// Добавлены данные об оплате пени.
	СтруктураДанных.Вставить("ОплатаСУчетомПени"                , 0);
	СтруктураДанных.Вставить("ОплатаПени"                       , 0);
	
	// bit_akozlov_29082013_начало_изменений
	СтруктураДанных.Вставить("СубсидияПИ"                       , 0);
	// bit_akozlov_29082013_начало_изменений
	
	// бит_RAKordo-sysoev 28.05.2014
	СтруктураДанных.Вставить("ВходящееСальдоПени"               , 0);
	СтруктураДанных.Вставить("НачисленоПениЗаПериод"            , 0);
	// бит_RAKordo-sysoev 28.05.2014
	
	// бит_RAKordo-sysoev 01.10.2014
	СтруктураДанных.Вставить("ОплатитьДо"                       , "");
	// бит_RAKordo-sysoev 01.10.2014
	
	// бит_RAKordo-sysoev 24.10.2014
	СтруктураДанных.Вставить("КОплатеНаМоментПечати"            , "");
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПредоплатыНаМоментПечати"            , "");
	СтруктураДанных.Вставить("ИтогоКОплатеСУчетомПениНаМоментПечати"            , "");
	// бит_RAKordo-sysoev 01.10.2014
	
	// бит_RAKordo-sysoev 24.11.2014{{
	СтруктураДанных.Вставить("ОбщаяПлощадьЖилогоЗдания"         , 0);
	СтруктураДанных.Вставить("МестОбщегоПользования"            , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьЖилыхПомещений"       , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьНежилыхПомещений"     , 0);
	СтруктураДанных.Вставить("ПлощадьЖилыхНежилых"              , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьПридомовойТерритории" , 0);
	СтруктураДанных.Вставить("ОбщаяПлощадьГрунта"               , 0);
	СтруктураДанных.Вставить("ПлощадьПринадлежащаяЧленамТСЖ"               , 0);
	СтруктураДанных.Вставить("КоличествоПодъездов"              , 0);
	СтруктураДанных.Вставить("КоличествоЭтажей"                 , 0);
	// бит_RAKordo-sysoev 24.11.2014}}                  
	
	// БИТ_ЖКХ 07.10.2016 12:09:26 Начало правки...
	СтруктураДанных.Вставить("ДолгСУчетомОплатыБезШаблона"      , 0);
	// БИТ_ЖКХ 07.10.2016 12:09:26 Конец правки.
	
	Возврат СтруктураДанных
	
КонецФункции // ()

Функция ПолучитьТаблицуПечати() Экспорт
	
	ОписаниеЧисла_15_2 = ОбщегоНазначения.ОписаниеТипаЧисло(15,2);
	ОписаниеЧисла_16_4 = ОбщегоНазначения.ОписаниеТипаЧисло(16,4);
	
	// Таблица печати услуг - содержит информацию по услугам.
	ТаблицаПечати = Новый ТаблицаЗначений;
	ТаблицаПечати.Колонки.Добавить("Услуга"                ,Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ, СправочникСсылка.бит_ГруппыУслуг"));
	ТаблицаПечати.Колонки.Добавить("ГруппаУслуги"          ,Новый ОписаниеТипов("СправочникСсылка.бит_ГруппыУслуг"));
	// БИТ_ЖКХ 16.08.2016 10:56:53 Начало правки...
	ТаблицаПечати.Колонки.Добавить("ГрафаОтчетаГЦЖС"	   ,Новый ОписаниеТипов("ПеречислениеСсылка.бит_ГрафыОтчетаПоГЦЖС"));
	// БИТ_ЖКХ 16.08.2016 10:56:53 Конец правки.
	ТаблицаПечати.Колонки.Добавить("Сальдо"                ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("ЕдИзм"                 ,Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаПечати.Колонки.Добавить("Количество"            ,ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ТаблицаПечати.Колонки.Добавить("Пени"                  ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Норма"                 ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("СверхНорма"            ,ОписаниеЧисла_15_2);
	// bit_akozlov_13122013_начало_изменений
	ТаблицаПечати.Колонки.Добавить("Ставка"                ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("СверхНормативнаяСтавка",ОписаниеЧисла_16_4);
	// bit_akozlov_13122013_окончание_изменений
	ТаблицаПечати.Колонки.Добавить("Начислено"             ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Льгота"                ,ОписаниеЧисла_15_2);
	// bit_akozlov_29082013_начало_изменений
	ТаблицаПечати.Колонки.Добавить("СубсидияПИ"            ,ОписаниеЧисла_15_2);
	// bit_akozlov_29082013_окончание_изменений
	ТаблицаПечати.Колонки.Добавить("Оплата"                ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Разовые"               ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("КОплатеЗаМесяц"        ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("КОплате"               ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Долг"                  ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("ПереплатаНаНачало"     ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("Поставщик"             ,Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	// БИТ_ЖКХ 19.08.2016 13:40:32 Начало правки...
	ТаблицаПечати.Колонки.Добавить("ПолучательПлатежа"     ,Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.Организации"));
	ТаблицаПечати.Колонки.Добавить("ПолучательПлатежаИмя"  ,ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПечати.Колонки.Добавить("ПолучательИНН"         ,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПечати.Колонки.Добавить("ПолучательКПП"         ,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("ПолучательРС"          ,ОбщегоНазначения.ОписаниеТипаСтрока(34));
	ТаблицаПечати.Колонки.Добавить("ПолучательКоррСчет"    ,ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаПечати.Колонки.Добавить("ПолучательБИК"         ,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("ПолучательБанк"        ,ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаПечати.Колонки.Добавить("КапПолучательПлатежа"  ,Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.Организации"));
	ТаблицаПечати.Колонки.Добавить("КапПолучательПлатежаИмя",ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПечати.Колонки.Добавить("КапПолучательИНН"      ,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПечати.Колонки.Добавить("КапПолучательКПП"      ,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("КапПолучательРС"       ,ОбщегоНазначения.ОписаниеТипаСтрока(34));
	ТаблицаПечати.Колонки.Добавить("КапПолучательКоррСчет" ,ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаПечати.Колонки.Добавить("КапПолучательБИК"      ,ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаПечати.Колонки.Добавить("КапПолучательБанк"     ,ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаПечати.Колонки.Добавить("ЗакрытиеВхДолга"	   ,ОписаниеЧисла_15_2);
	// БИТ_ЖКХ 19.08.2016 13:40:32 Конец правки.
	ТаблицаПечати.Колонки.Добавить("Приоритет"             ,ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПечати.Колонки.Добавить("ПриоритетГруп"         ,ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПечати.Колонки.Добавить("Тариф"                 ,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечати.Колонки.Добавить("НастройкаСтавки"       ,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечати.Колонки.Добавить("Объем"                 ,ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаПечати.Колонки.Добавить("Объем_точность3"       ,ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("Объем_точность2"       ,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПечати.Колонки.Добавить("Норматив"              ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("УслугаПредставление"   ,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	// Колонки Платежного документа.
	ТаблицаПечати.Колонки.Добавить("ОбъемИНД"             ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ОбъемИНД_точность3"   ,ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ОбъемИНД_точность2"   ,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПечати.Колонки.Добавить("ОбъемОбщДом"          ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ОбъемОбщДом_точность3",ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ОбъемОбщДом_точность2",ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПечати.Колонки.Добавить("НачисленоИНД"         ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("НачисленоОбщДом"      ,ОписаниеЧисла_15_2);
	ТаблицаПечати.Колонки.Добавить("НормативИНД"          ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("НормативОбщДом"       ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("КоличествоЕдиницИНД"  ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("КоличествоЕдиницГУРП" ,ОписаниеЧисла_16_4);
	
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИнд"          ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИнд_точность3",ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИнд_точность2",ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемОбщедомовых"          ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемОбщедомовых_точность3",ОбщегоНазначения.ОписаниеТипаЧисло(16,3));
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемОбщедомовых_точность2",ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	// бит_RAKordo-sysoev 17.03.2014                                
	ТаблицаПечати.Колонки.Добавить("АдресИТелефонПоставщика",ОбщегоНазначения.ОписаниеТипаСтрока(20));
	// бит_RAKordo-sysoev 17.03.2014
	
	// бит_RAKordo-sysoev 30.01.2015{{
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИндИПУ"        ,ОписаниеЧисла_16_4);
	ТаблицаПечати.Колонки.Добавить("ИтогоОбъемИндНорматив"   ,ОписаниеЧисла_16_4);
	// бит_RAKordo-sysoev 30.01.2015}}
	
	Возврат ТаблицаПечати;
	
КонецФункции // ()

Функция ПолучитьТаблицуПечатиСчетчиков() Экспорт
	
	// Таблица печати счетчиков - содержит информацию по счетчикам на лс.
	ТаблицаПечатиСчетчиков = Новый ТаблицаЗначений;
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ЛицевойСчет"      ,Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Счетчик"          ,Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Услуга"           ,Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Приоритет"        ,ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДоПоказаний"      ,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ОтПоказаний"      ,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("КоличествоЕдиниц" ,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));	
	ТаблицаПечатиСчетчиков.Колонки.Добавить("Многотарифный"    ,Новый ОписаниеТипов("Булево"));
	// bit_akozlov_04102013_начало_изменений
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДатаПоверки"      ,ОбщегоНазначения.ОписаниеТипаСтрока(50));
	// bit_akozlov_04102013_окончание_изменений
	ТаблицаПечатиСчетчиков.Колонки.Добавить("СокрНаименование" ,ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("НормативИнд"      ,ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("НормативОбщДом"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ОбъемОбщДом"      , ОбщегоНазначения.ОписаниеТипаЧисло(15,4)); 
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДоПоказанийИнд"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ДоПоказанийОбщДом",ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПечатиСчетчиков.Колонки.Добавить("ОбъемИнд"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	
	Возврат ТаблицаПечатиСчетчиков;
	
КонецФункции // ()

Функция ПолучитьТаблицуПерерасчетов() Экспорт
	
	// Таблица печати счетчиков - содержит информацию по счетчикам на лс.
	ТаблицаПерерасчетов = Новый ТаблицаЗначений;
	ТаблицаПерерасчетов.Колонки.Добавить("Услуга"     , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПерерасчетов.Колонки.Добавить("Основание"  , ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПерерасчетов.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(999));
	ТаблицаПерерасчетов.Колонки.Добавить("Сумма"      , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Возврат ТаблицаПерерасчетов;
	
КонецФункции // () 

&НаКлиенте
Процедура СформироватьФайлКвитанции(Команда)
	СформироватьФайлКвитанцииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	//ОтключитьОбработчикОжидания( "ОбработчикОбновленияДанныхФормы" );
	
	
КонецПроцедуры

Функция Перевод(ТекстСтроки)
	
	ТекстСтроки = СтрЗаменить(ТекстСтроки,"response","ответ");
	ТекстСтроки = СтрЗаменить(ТекстСтроки,"Updated","Обновлено");
	ТекстСтроки = СтрЗаменить(ТекстСтроки,"rows","строк");
	
	Возврат ТекстСтроки;
	
КонецФункции	

Функция ПечатьПлатежныйДокументРК924(ЛС,Период) Экспорт
	
	//НеПечататьУслугиБезНачислений = Истина;
	//ИспользоватьКомментарийКакОснование = Истина;
	//ПечататьУслугиСОплатой = Истина; 
	//ИспользоватьQR = Истина;
	
	Квитанция = Новый ТабличныйДокумент;
	
	Результат = Неопределено;
	
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	ОбработкаОбъект.МакетКв               = объект.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	//ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = ЛС.Организация;
	ОбработкаОбъект.РС                    = ЛС.Организация.ОсновнойБанковскийСчет;
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	
	ОбработкаОбъект.НеПечататьУслугиБезНачислений = Истина;
	
	
	НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛС;
	
	
	Обработка = ОбработкаОбъект;
	Обработка.Период      = КонецМесяца(Период);
	
	Обработка.ОбновитьНастройкиЖКХ();
	Обработка.ОбновитьКэшОрганизации();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Начало правки...
	Обработка.ОбновитьКэшПолучателяПлатежа();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Конец правки.
	
	
	Обработка.ПолучитьНастройкуМакета();
	
	
	//СформироватьДанныеПоНастрокамМакета(Обработка, АдресСтруктурыВХранилище);
	//
	//Результат = Обработка.ПолучитьКвитанциюПоЛС(АдресСтруктурыВХранилище);
	//
	//
	
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	
	Попытка
		Результат = ОбработкаОбъект.ПолучитьКвитанциюПоЛС(ТаблицаДанных[0]);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	//Результат = ОбработкаОбъект.ПечатьКвитанций(ТаблицаДанных);
	
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	Возврат Результат;
	
КонецФункции // ()

// БИТ_ЖКХ 01.12.2015 11:26:27 Начало правки...
// Процедура Обновляет кэш получателя платежа.
Процедура ОбновитьКэшПолучателяПлатежа() Экспорт
	
	мКэшПолучателяПлатежа = Новый Структура;
	мКэшПолучателяПлатежа.Вставить("ПолучательРС"                      , "");
	мКэшПолучателяПлатежа.Вставить("ПолучательИНН"                     , "");
	мКэшПолучателяПлатежа.Вставить("ПолучательКПП"                     , "");
	мКэшПолучателяПлатежа.Вставить("ПолучательБанк"                    , "");
	мКэшПолучателяПлатежа.Вставить("ПолучательКоррСчет"                , "");
	ПолучательПлатежа = Объект.Организация;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);
	Если ТипЗнч(ПолучательПлатежа) = Тип("СправочникСсылка.Организации") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		//|	Организации.ОсновнойБанковскийСчет,
		//|	Организации.НаименованиеПолное,
		|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК ПолучательРС,
		|	Организации.ИНН КАК ПолучательИНН,
		|	Организации.КПП КАК ПолучательКПП,
		|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК ПолучательБанк,
		|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
		|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &ПолучательПлатежа";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		//|	Контрагенты.ОсновнойБанковскийСчет,
		//|	Контрагенты.НаименованиеПолное,
		|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК ПолучательРС,
		|	Контрагенты.ИНН КАК ПолучательИНН,
		|	Контрагенты.КПП КАК ПолучательКПП,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК ПолучательБанк,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &ПолучательПлатежа";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		мКэшПолучателяПлатежа.ПолучательРС                       = Выборка.ПолучательРС;
		мКэшПолучателяПлатежа.ПолучательИНН                      = Выборка.ПолучательИНН;
		мКэшПолучателяПлатежа.ПолучательКПП                      = Выборка.ПолучательКПП;
		мКэшПолучателяПлатежа.ПолучательБанк                     = Выборка.ПолучательБанк;
		мКэшПолучателяПлатежа.ПолучательКоррСчет                 = Строка(Выборка.КоррСчет)+" \ "+Строка(Выборка.БИК);
		
	КонецЕсли;
	
	//Запрос.УстановитьПараметр("РС", РС);
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	БанковскиеСчета.НомерСчета КАК ПолучательРС,
	//|	БанковскиеСчета.Банк.Наименование КАК ПолучательБанк,
	//|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет,
	//|	БанковскиеСчета.Банк.Код КАК БИК
	//|ИЗ
	//|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	//|ГДЕ
	//|	БанковскиеСчета.Владелец = &ПолучательПлатежа
	//|	И БанковскиеСчета.Ссылка = &РС";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	мКэшПолучателяПлатежа.ПолучательРС		 = Выборка.ПолучательРС;
	//	мКэшПолучателяПлатежа.ПолучательБанк 	 = Выборка.ПолучательБанк;
	//	мКэшПолучателяПлатежа.ПолучательКоррСчет = Строка(Выборка.КоррСчет)+" \ "+Строка(Выборка.БИК);
	//	
	//КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура НастройкаКвитанции(Команда)
	Форма = ПолучитьФорму("Обработка.бит_ПечатьСчетИзвещений.Форма.ФормаУправляемая");
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Синхронизация(Команда)
	
	ДобавитьЛог("Начало ручной операции синхронизации данных");
	
	Для Каждого Стр Из ТаблицаЛицевыхСчетов Цикл
		Если Стр.ЕстьВМобстед Тогда
			
			Если Объект.ЭкспортЛицевыеСчета Тогда
				ОтправитьВМобстедЛицевойСчет(Стр.ЛицевойСчет);
			КонецЕсли;
			
			Если Объект.ЭкспортСчетчики Тогда
				СоздатьСчетчики(Стр.ЛицевойСчет);
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;	
	
	Если Объект.ЭкспортНачисления Тогда 
		ДетализацияНачисленийЗаВесьПериод();
	КонецЕсли;
	
	Если Объект.ЭкспортПлатежи Тогда
		ЭкспортПлатежиЗаВесьПериод();
	КонецЕсли;
	
	ДобавитьЛог("Окончание ручной синхронизации данных");
	
	Состояние("Синхронизация окончена");
	
КонецПроцедуры

&НаКлиенте
Процедура СМС(Команда)
	Перем ЛС;
	ОтправитьСМС(ЛС);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналСобытий(Команда)
	
	ИмяФайла = КаталогВременныхФайлов()+"Журнал_Событий.txt";
	
	ВыбранныйФайл = Новый Файл(ИмяФайла);
	Если ВыбранныйФайл.Существует() Тогда
		ЗапуститьПриложение(ИмяФайла);
	Иначе
		ФайлНов = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8, , Истина); 
		ФайлНов.Записать(Строка(ТекущаяДата())+" - "+" создание файла с журналом событий"); 
		ФайлНов.Закрыть(); 			
		Объект.ЖурналСобытий = ИмяФайла;
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;			
	
КонецПроцедуры


//&НаКлиенте
Процедура ДобавитьЛог(Лог)
	
	//ЗаписьТекста = Новый ЗаписьТекста(Объект.ЖурналСобытий, КодировкаТекста.UTF8, , Истина); 
	//ТекстСообщений     = Строка(ТекущаяДата())+" - "+Строка(Лог);
	//ЗаписьТекста.ЗаписатьСтроку(ТекстСообщений);
	//
	////	ТекстСообщений     = "Окончание проведения: " + ТекущаяДата();
	////	ЗаписьТекста.ЗаписатьСтроку(ТекстСообщений);
	//ЗаписьТекста.Закрыть();
	
КонецПроцедуры	

Процедура РучнаяПрогрузкаНачисленийНаСервере()
	
	ДатаОтчета = ТекущаяДата();
	
	Квитанция = Новый ТабличныйДокумент;
	
	Результат = Неопределено;
	
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	ОбработкаОбъект.МакетКв               = объект.ШаблонКвитанции;  // ВОТ ТУТ ШАБЛОН КВИТАНЦИИ ЭТО НЕ МАКЕТ А ЭЛЕМЕНТ СПРАВОЧНИКА
	//ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = Объект.Организация;
	ОбработкаОбъект.РС                    = Объект.Организация.ОсновнойБанковскийСчет;
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	Для Каждого Стр Из ТаблицаЛицевыхСчетов Цикл
		Если Не Стр.ЕстьВМобстед Тогда ПРодолжить КонецЕсли;
		НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
		НоваяСтрока.ЛицевойСчет = Стр.ЛицевойСчет;
	КонецЦикла;	
	
	Обработка = ОбработкаОбъект;
	ПериодНачислений    = КонецМесяца(ДатаОтчета);
	Обработка.Период      = КонецМесяца(ДатаОтчета);
	
	Обработка.ОбновитьНастройкиЖКХ();
	Обработка.ОбновитьКэшОрганизации();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Начало правки...
	Обработка.ОбновитьКэшПолучателяПлатежа();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Конец правки.
	
	Обработка.ПолучитьНастройкуМакета();
	
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	
	Если ТаблицаДанных.количество() <> 0 Тогда
		
		Для Каждого СтрТабл Из ТаблицаДанных Цикл
			
			Если СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц = 0 Тогда Продолжить; КонецЕсли; //Нет начислений 
			
			Период = СтрТабл.Значение.СтруктураДанных.Дата;
			УИН = Лев(КонецМесяца(Период),10);
			
			Если ПроверитьНачисленияВМобстед(УИН,СтрТабл.ЛицевойСчет.Наименование) Тогда Продолжить; КонецЕсли;
			
			ЕстьОтвет = Истина;
			
			АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
			АдресРесурса1 = "/api/v4/events/";
			Запрос1 = КодироватьСтроку(Строка(СокрЛП(Объект.НомерПриложения)),СпособКодированияСтроки.КодировкаURL);
			
			Запрос4 = 
			"["
			+"{"
			+"""field"""                +":"+ """НомерЛицевогоСчета"""+","
			+"""operation"""            +":"+ """="""+","
			+"""value"""                +":"+""""+Строка(СтрТабл.ЛицевойСчет.Наименование)+""""+","
			+"""andor"""                +":"+"""and"""
			+"}"
			+"]";
			
			
			Запрос4 = КодироватьСтроку(Запрос4,СпособКодированияСтроки.КодировкаURL);
			Запрос5 = "{"+"""Сумма"""+":"+""""+СтрЗаменить(СтрТабл.Значение.СтруктураДанных.КОплатеЗаМесяц,Символы.НПП,"")+""""+"}";  //{"Сумма":"100500"}
			Запрос2 = КодироватьСтроку("Начисление",СпособКодированияСтроки.КодировкаURL);
			Запрос3 = КодироватьСтроку(Строка(Объект.СтатусВРаботе),СпособКодированияСтроки.КодировкаURL);
			Запрос5 = КодироватьСтроку(Запрос5,СпособКодированияСтроки.КодировкаURL);
			Дата = Сред(УИН,7,4)+"-"+Сред(УИН,4,2)+"-"+Сред(УИН,1,2);
			УИН = КодироватьСтроку(УИН,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
			Запрос6 = КодироватьСтроку(Дата,СпособКодированияСтроки.КодировкаURL);       // Y-m-d
			СтрокаПараметров = "ApplicationId="+Запрос1+"&ActionName="+Запрос2+"&PaymentDocNumber="+УИН+"&StatusId="+Запрос3+"&Object="+Запрос4+"&Value="+Запрос5+"&CreateDate="+Запрос6;
			
			HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
			HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
			HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
			HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
			Попытка
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				ЕстьОтвет = Ложь;
				Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
			КонецПопытки;
			
			Если ЕстьОтвет Тогда
				Если Ответ.КодСостояния = 200 Тогда
					СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
					
					Если Не ПустаяСтрока(СтрокаОтвет) Тогда
						РезультатПроверки = СтрокаОтвет;
						Результат = РезультатПроверки;
						Сообщить(Результат);
					КонецЕсли;
				ИначеЕсли Ответ.КодСостояния = 500 Тогда
					Сообщить("Ручная прогрузка начислений. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 404 Тогда
					Сообщить("Ручная прогрузка начислений. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
				ИначеЕсли Ответ.КодСостояния = 301 Тогда
					Сообщить("Ручная прогрузка начислений. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
				Иначе
					Сообщить("Ручная прогрузка начислений. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//Создали события с начислениями со статусом в работе
	//Теперь их обработаем
	ЕстьОтвет = Истина;	
	
	АдресСервисаСтр = СокрЛП(Объект.АдресСервиса);
	АдресРесурса = "/api/v4/events?ApplicationId="+Объект.НомерПриложения+"&query=";
	
	СтрокаПараметров = 
	"["
	+"{"
	+"""field"""                +":"+ """StatusId"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+""""+Строка(Объект.СтатусВРаботе)+""""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+","
	+"{"
	+"""field"""                +":"+ """ActionName"""+","
	+"""operation"""            +":"+ """="""+","
	+"""value"""                +":"+"""Начисление"""+","
	+"""andor"""                +":"+"""and"""
	+"}"
	+"]";
	//Сообщить(СтрокаПараметров);
	
	
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					Сообщить("Соединение не установлено");
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					Если ЗагруженныеДанные.Количество()<>0 Тогда
						
						ТЗ = РаспарситьВТаблицуЗапросКвитанции(ЗагруженныеДанные);
						
						ОтправитьДетализацию(ТЗ);
						
						ОтправитьКвитанцииПоЛицевымСчетам(ТЗ,ПериодНачислений);
						
						ОтправитьСМС(ТЗ);
						
					КонецЕсли;
					//Сообщить(РезультатПроверки);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура РучнаяПодгрузкаНачисленийСКвитанциями(Команда)
	// Вставить содержимое обработчика.
	
	РучнаяПрогрузкаНачисленийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Синхронизировать(Команда)
	Сообщить("Синхронизация запущена");
	ОтправитьДанныеПоЛицевымСчетамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалАвтономнойРаботыПриИзменении(Элемент)
	
	Интервал = Объект.ИнтервалАвтономнойРаботы*60;
	
	Если Интервал = 0 Тогда
		Интервал = 5 ;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОтправитьДанныеПоЛицевымСчетам",Интервал,Ложь);
	ПодключитьОбработчикОжидания("ОтправитьИОбновитьДанныеПоЛицевымСчетам",43200,Ложь);
КонецПроцедуры

