
#Область ПеременныеМодуля

Перем мСписокФормОтчета Экспорт; // Хранит список значений форм отчета.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Формирует заголовок отчета.
//
// Возвращаемое значение:
//  Строка - заголовок отчета.
//
Функция ЗаголовокОтчета() Экспорт

	ТекОтчет = мСписокФормОтчета.НайтиПоЗначению(ВидФормы);

	Если ТекОтчет = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат ТекОтчет.Представление;

КонецФункции // ЗаголовокОтчета()

// Формирует и выводит отчет.
//
// Параметры:
//  ДокументРезультатТитульный - ТабличныйДокумент - элемент управления,.
//                 В который будет осуществлен вывод титульного листа.
//  ДокументРезультатРаздел12 - ТабличныйДокумент - элемент управления,.
//                 В который будет осуществлен вывод разделов 1 и 2.
//  ДокументРезультатРаздел3 - ТабличныйДокумент - элемент управления,.
//                 В который будет осуществлен вывод раздела 3.
//
Процедура ОбновитьОтчет(ДокументРезультат) Экспорт
	
	// Проверка на заполнение значений.
	Если Не ПроверкаЗаполненияШапки() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументРезультат.Очистить();
	
	Если ВидФормы = "22" Тогда
		ЗаполнитьДокумент_Ф22(ДокументРезультат, СборСведенийОбОрганизации());
	КонецЕсли;	
	
	//26.08.2019
	Если ВидФормы = "22_Жилище" Тогда
		ЗаполнитьДокумент_Ф22_ЖилищеНовая(ДокументРезультат, СборСведенийОбОрганизации());
	КонецЕсли;	
	
	Если ВидФормы = "26" Тогда
		ЗаполнитьДокумент_Ф26(ДокументРезультат, СборСведенийОбОрганизации());
	КонецЕсли;
	
КонецПроцедуры // ОбновитьОтчет()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Собирает сведения об организации.
Функция СборСведенийОбОрганизации()
	
	СведенияОбОрганизации = Новый Структура;
	СведенияОбОрганизации.Вставить("Наименование");
	СведенияОбОрганизации.Вставить("Адрес");
	СведенияОбОрганизации.Вставить("КодПоОКПО");
	
	// БИТ_ЖКХ 12.11.2015 10:54:44 Начало правки... 
	//СведенияОбОрганизации["Наименование"] = Организация.НаименованиеПолное + " (" + Организация.НаименованиеСокращенное + ")";
	СведенияОбОрганизации["Наименование"] = Организация.НаименованиеПолное;
	// БИТ_ЖКХ 12.11.2015 10:54:45 Конец правки. 
	
	ЮрАдресОрганизации   = "";
	ФактАдресОрганизации = "";
	// БИТ_ЖКХ 28.10.2015 17:29:42 Начало правки...
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Вид,
	|	ОрганизацииКонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Тип = &Тип
	|	И ОрганизацииКонтактнаяИнформация.Вид В(&Вид)
	|	И ОрганизацииКонтактнаяИнформация.Ссылка = &Организация";
	
	ВидАдреса = Новый Массив;
	ВидАдреса.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ВидАдреса.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Тип",		 Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид",		 ВидАдреса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			ЮрАдресОрганизации = Выборка.Представление;
		Иначе
			ФактАдресОрганизации = Выборка.Представление;
		КонецЕсли;
	КонецЦикла; 
	
	//РСКонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//РСКонтактнаяИнформация.Объект = Организация;
	//РСКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	//РСКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	//РСКонтактнаяИнформация.Прочитать();
	//Если РСКонтактнаяИнформация.Выбран() Тогда
	//	ЮрАдресОрганизации = РСКонтактнаяИнформация.Представление;
	//КонецЕсли;
	//РСКонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//РСКонтактнаяИнформация.Объект = Организация;
	//РСКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	//РСКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	//РСКонтактнаяИнформация.Прочитать();
	//Если РСКонтактнаяИнформация.Выбран() Тогда
	//	ФактАдресОрганизации = РСКонтактнаяИнформация.Представление;
	//КонецЕсли;
	
	// БИТ_ЖКХ 28.10.2015 17:29:46 Конец правки.
	
	Если ЮрАдресОрганизации = ФактАдресОрганизации Тогда
		СведенияОбОрганизации["Адрес"] = ЮрАдресОрганизации;
	Иначе
		СведенияОбОрганизации["Адрес"] = ЮрАдресОрганизации + ", " + ФактАдресОрганизации;
	КонецЕслИ;
	
	СведенияОбОрганизации["КодПоОКПО"] = Организация.КодПоОКПО;
	
	Возврат СведенияОбОрганизации;
	
КонецФункции  //СборСведенийОбОрганизации()

// Проверяет корректность заполнения реквизитов отчета.
//
// Возвращаемое значение:
//  Булево – корректно ли заполнение.
//
Функция ПроверкаЗаполненияШапки(ВыводитьПредупреждение = Истина)

	Если ПустаяСтрока(ВидФормы) Тогда
		Если ВыводитьПредупреждение Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не указан номер требуемой формы.");
		КонецЕсли;
		Возврат Ложь;

	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Если ВыводитьПредупреждение Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не указана дата.");
			
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Если ВыводитьПредупреждение Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбрана организация.");
			
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции 

// БИТ_ЖКХ 20.04.2017 10:55:11 Начало правки... 

// Заполняет указанный табличный документ по форме №22 по данным.
// В указанной структуре параметров.
Процедура ЗаполнитьДокумент_Ф22(ДокументРезультат, СведенияОбОрганизации)
	
	Макет = ПолучитьМакет("Форма22_2017Кв1");
	ДокументРезультат.Вывести(Макет);
	
	// ОсновнаяЧасть1а
	ДокументРезультат.Области.ПериодОтчета.Значение = "за январь - "
		+ НРег(Формат(Дата, "ДФ = 'ММММ гггг'")) + " г.";
															
	// ПолеНомерКорректировки.
	
	// ОсновнаяЧасть1б
	ДокументРезультат.Области.ОргНазв.Значение	  = СведенияОбОрганизации["Наименование"];
	ДокументРезультат.Области.ОргАдрес.Значение	  = СведенияОбОрганизации["Адрес"];
	ДокументРезультат.Области.ОргКодОКПО.Значение = СведенияОбОрганизации["КодПоОКПО"];
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты
	|ПОМЕСТИТЬ ВТ_бит_СведенияОКвартиреСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ЛицевыеСчета.Квартира
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	ВТ_ЛицевыеСчета.Квартира,
	|	ВТ_бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	ВТ_ЛицевыеСчета.Здание
	|ПОМЕСТИТЬ ПоставщикиИУслуги
	|ИЗ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_бит_СведенияОКвартиреСрезПоследних КАК ВТ_бит_СведенияОКвартиреСрезПоследних
	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Оплата
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемИнд,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемОбщеДом,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемРазовых
	|ПОМЕСТИТЬ Объемы
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, Услуга) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоставщикиИУслуги.Услуга КАК Услуга,
	|	ПоставщикиИУслуги.Здание КАК Здание,
	|	ПоставщикиИУслуги.ТипПлиты КАК ТипПлиты,
	|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0) КАК ОбъемРазовых,
	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0) КАК ОбъемИнд,
	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0) КАК ОбъемОбщеДом,
	|	СУММА(ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток,
	|	СУММА(ЕСТЬNULL(Обороты.Начисления, 0)) КАК Начисления,
	|	СУММА(ЕСТЬNULL(Обороты.Оплата, 0)) КАК Оплата,
	|	СУММА(ЕСТЬNULL(Обороты.Разовые, 0)) КАК Разовые
	|ПОМЕСТИТЬ ИтоговаяТаб
	|ИЗ
	|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Обороты.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Обороты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	|		ПО ПоставщикиИУслуги.Услуга = Объемы.Услуга
	|			И ПоставщикиИУслуги.ЛицевойСчет = Объемы.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоставщикиИУслуги.Услуга,
	|	ПоставщикиИУслуги.ЛицевойСчет,
	|	ПоставщикиИУслуги.Здание,
	|	ПоставщикиИУслуги.ТипПлиты,
	|	ЕСТЬNULL(Объемы.Объем, 0),
	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0),
	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0),
	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоставщикиИУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Объемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
	|	ИтоговаяТаб.ТипПлиты КАК ТипПлиты,
	|	СУММА(ИтоговаяТаб.Объем) КАК Объем,
	|	СУММА(ИтоговаяТаб.ОбъемРазовых) КАК ОбъемРазовых,
	|	СУММА(ИтоговаяТаб.ОбъемИнд) КАК ОбъемИнд,
	|	СУММА(ИтоговаяТаб.ОбъемОбщеДом) КАК ОбъемОбщеДом,
	|	СУММА(ИтоговаяТаб.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	|	СУММА(ИтоговаяТаб.Начисления) КАК Начисления,
	|	СУММА(ИтоговаяТаб.Оплата) КАК Оплата,
	|	СУММА(ИтоговаяТаб.Разовые) КАК Разовые
	|ИЗ
	|	ИтоговаяТаб КАК ИтоговаяТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ИтоговаяТаб.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО ИтоговаяТаб.Здание = бит_СписокЗданий.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ИтоговаяТаб.ТипПлиты
	|ИТОГИ
	|	СУММА(Объем),
	|	СУММА(ОбъемРазовых),
	|	СУММА(ОбъемИнд),
	|	СУММА(ОбъемОбщеДом),
	|	СУММА(СуммаКонечныйОстаток),
	|	СУММА(Начисления),
	|	СУММА(Оплата),
	|	СУММА(Разовые)
	|ПО
	|	ГрафаОтчетаГЦЖС,
	|	ВидБлагоустройстваЗданий,
	|	ТипПлиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтоговаяТаб";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьДок = ДокументРезультат.Области;
	
	Пока ВыборкаГЦЖС.Следующий() Цикл
		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
			// Раздел1
			ОбластьДок["П010103"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010203"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			// Раздел2 
			ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
			// Раздел3
			ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
			ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение +  ВыборкаГЦЖС.Оплата;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045503"].Значение = ВыборкаГЦЖС.ОбъемИнд;
				ОбластьДок["П045504"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			КонецЕсли;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда	
			// Раздел1
			ОбластьДок["П010104"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010204"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			// Раздел2 
			ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
			// Раздел3
			ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
			ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение +  ВыборкаГЦЖС.Оплата;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045603"].Значение = ВыборкаГЦЖС.ОбъемИнд;
				ОбластьДок["П045604"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			КонецЕсли;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
			// Раздел1
			ОбластьДок["П010105"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010205"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			// Раздел2
			ОбластьДок["П020905"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022205"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			// Раздел3
			ОбластьДок["П034003"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034004"].Значение = ВыборкаГЦЖС.Оплата;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
			// Раздел1
			ОбластьДок["П010106"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010206"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			// Раздел2
			ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
			// Раздел3
			ОбластьДок["П034203"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034204"].Значение = ВыборкаГЦЖС.Оплата;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045403"].Значение = ОбластьДок["П045403"].Значение + ВыборкаГЦЖС.ОбъемИнд; 
			КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
			// Раздел1
			ОбластьДок["П010107"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010207"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			// Раздел2
			ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
			// Раздел3
			ОбластьДок["П034103"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034104"].Значение = ВыборкаГЦЖС.Оплата;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045403"].Значение = ОбластьДок["П045403"].Значение + ВыборкаГЦЖС.ОбъемИнд; 
			КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
			// Раздел1
			ОбластьДок["П010108"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010208"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			// Раздел2
			ОбластьДок["П020907"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022207"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			// Раздел3
			ОбластьДок["П034303"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034304"].Значение = ВыборкаГЦЖС.Оплата;
			//Суммируем данные по типам плит
			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТипПлиты.Следующий() Цикл
					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
						ОбластьДок["П034403"].Значение = ОбластьДок["П034403"].Значение + ВыборкаТипПлиты.Начисления;
						ОбластьДок["П034404"].Значение = ОбластьДок["П034404"].Значение + ВыборкаТипПлиты.Оплата;
					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
						ОбластьДок["П034503"].Значение = ОбластьДок["П034503"].Значение + ВыборкаТипПлиты.Начисления;
						ОбластьДок["П034504"].Значение = ОбластьДок["П034504"].Значение + ВыборкаТипПлиты.Оплата;
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045303"].Значение = ВыборкаГЦЖС.ОбъемИнд;
				ОбластьДок["П045304"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			КонецЕсли;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
			// Раздел1
			ОбластьДок["П010109"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010209"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			// Раздел2
			ОбластьДок["П020908"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022208"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			// Раздел3
			ОбластьДок["П034603"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034604"].Значение = ВыборкаГЦЖС.Оплата;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045703"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
			//// Раздел1
			//ДокументРезультат.Области.П000001000111.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ДокументРезультат.Области.П000001000211.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//Раздел2 
			ОбластьДок["П020910"].Значение = ОбластьДок["П020910"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022210"].Значение = ОбластьДок["П022210"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			//Раздел 3
			//ОбластьДок["П000003004103"].Значение = ОбластьДок["П000003004103"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			//ОбластьДок["П000003004104"].Значение = ОбластьДок["П000003004104"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
			ОбластьДок["П035103"].Значение = ВыборкаГЦЖС.Начисления; 
			ОбластьДок["П035104"].Значение = ВыборкаГЦЖС.Оплата;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
			// Раздел2 
			ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			// Раздел 3
			ОбластьДок["П033703"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
			ОбластьДок["П033704"].Значение = ВыборкаГЦЖС.Оплата;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда	
			// Раздел2 
			ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			//Раздел 3
			ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено

			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
					ОбластьДок["П033503"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления;
					ОбластьДок["П033504"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
					ОбластьДок["П033603"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления; //Строка 43
					ОбластьДок["П033604"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда	
			// Раздел2 
			ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			//Раздел 3
			ОбластьДок["П033303"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П033304"].Значение = ВыборкаГЦЖС.Оплата;
			
		Иначе
			// Раздел2 
			ОбластьДок["П020911"].Значение = ОбластьДок["П020911"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			// Дебиторская задолженность
			ОбластьДок["П022211"].Значение = ОбластьДок["П022211"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Прочие
		КонецЕсли;
		
	КонецЦикла;
	
	// тыс. руб
	ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение/1000;
	ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение/1000;
	ОбластьДок["П020905"].Значение = ОбластьДок["П020905"].Значение/1000;
	ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение/1000;
	ОбластьДок["П020907"].Значение = ОбластьДок["П020907"].Значение/1000;
	ОбластьДок["П020908"].Значение = ОбластьДок["П020908"].Значение/1000;
	ОбластьДок["П020910"].Значение = ОбластьДок["П020910"].Значение/1000;
	ОбластьДок["П020911"].Значение = ОбластьДок["П020911"].Значение/1000;
	ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение/1000;
	ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение/1000;
	ОбластьДок["П022205"].Значение = ОбластьДок["П022205"].Значение/1000;
	ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение/1000;
	ОбластьДок["П022207"].Значение = ОбластьДок["П022207"].Значение/1000;
	ОбластьДок["П022208"].Значение = ОбластьДок["П022208"].Значение/1000;
	ОбластьДок["П022210"].Значение = ОбластьДок["П022210"].Значение/1000;
	ОбластьДок["П022211"].Значение = ОбластьДок["П022211"].Значение/1000;
	
	ОбластьДок["П033303"].Значение = ОбластьДок["П033303"].Значение/1000;
	ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение/1000;
	ОбластьДок["П033503"].Значение = ОбластьДок["П033503"].Значение/1000;
	ОбластьДок["П033603"].Значение = ОбластьДок["П033603"].Значение/1000;
	ОбластьДок["П035103"].Значение = ОбластьДок["П035103"].Значение/1000;
	ОбластьДок["П033703"].Значение = ОбластьДок["П033703"].Значение/1000;
	ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение/1000;
	ОбластьДок["П034003"].Значение = ОбластьДок["П034003"].Значение/1000;
	ОбластьДок["П034103"].Значение = ОбластьДок["П034103"].Значение/1000;
	ОбластьДок["П034203"].Значение = ОбластьДок["П034203"].Значение/1000;
	ОбластьДок["П034303"].Значение = ОбластьДок["П034303"].Значение/1000;
	ОбластьДок["П034403"].Значение = ОбластьДок["П034403"].Значение/1000;
	ОбластьДок["П034503"].Значение = ОбластьДок["П034503"].Значение/1000;
	ОбластьДок["П034603"].Значение = ОбластьДок["П034603"].Значение/1000;
	
	ОбластьДок["П033304"].Значение = ОбластьДок["П033304"].Значение/1000;
	ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение/1000;
	ОбластьДок["П033504"].Значение = ОбластьДок["П033504"].Значение/1000;
	ОбластьДок["П033604"].Значение = ОбластьДок["П033604"].Значение/1000;
	ОбластьДок["П035104"].Значение = ОбластьДок["П035104"].Значение/1000;
	ОбластьДок["П033704"].Значение = ОбластьДок["П033704"].Значение/1000;
	ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение/1000;
	ОбластьДок["П034004"].Значение = ОбластьДок["П034004"].Значение/1000;
	ОбластьДок["П034104"].Значение = ОбластьДок["П034104"].Значение/1000;
	ОбластьДок["П034204"].Значение = ОбластьДок["П034204"].Значение/1000;
	ОбластьДок["П034304"].Значение = ОбластьДок["П034304"].Значение/1000;
	ОбластьДок["П034404"].Значение = ОбластьДок["П034404"].Значение/1000;
	ОбластьДок["П034504"].Значение = ОбластьДок["П034504"].Значение/1000;
	ОбластьДок["П034604"].Значение = ОбластьДок["П034604"].Значение/1000;
	
	// Раздел2
	ОбластьДок["П020703"].Значение = ОбластьДок["П020903"].Значение;	
	ОбластьДок["П020803"].Значение = ОбластьДок["П020903"].Значение;	
	ОбластьДок["П020704"].Значение = ОбластьДок["П020904"].Значение;	
	ОбластьДок["П020804"].Значение = ОбластьДок["П020904"].Значение;	
	ОбластьДок["П020705"].Значение = ОбластьДок["П020905"].Значение;	
	ОбластьДок["П020805"].Значение = ОбластьДок["П020905"].Значение;	
	ОбластьДок["П020706"].Значение = ОбластьДок["П020906"].Значение;	
	ОбластьДок["П020806"].Значение = ОбластьДок["П020906"].Значение;	
	ОбластьДок["П020707"].Значение = ОбластьДок["П020907"].Значение;	
	ОбластьДок["П020807"].Значение = ОбластьДок["П020907"].Значение;	
	ОбластьДок["П020708"].Значение = ОбластьДок["П020908"].Значение;	
	ОбластьДок["П020808"].Значение = ОбластьДок["П020908"].Значение;	
	ОбластьДок["П020710"].Значение = ОбластьДок["П020910"].Значение;	
	ОбластьДок["П020810"].Значение = ОбластьДок["П020910"].Значение;	
	ОбластьДок["П020711"].Значение = ОбластьДок["П020911"].Значение;	
	ОбластьДок["П020811"].Значение = ОбластьДок["П020911"].Значение;	
	// Дебиторская задолженность
	ОбластьДок["П021803"].Значение = ОбластьДок["П022203"].Значение; //Жилищные
	ОбластьДок["П021804"].Значение = ОбластьДок["П022204"].Значение; //Водоснабжение
	ОбластьДок["П021805"].Значение = ОбластьДок["П022205"].Значение;
	ОбластьДок["П021806"].Значение = ОбластьДок["П022206"].Значение; //Теплоснабжение
	ОбластьДок["П021807"].Значение = ОбластьДок["П022207"].Значение;
	ОбластьДок["П021808"].Значение = ОбластьДок["П022208"].Значение;
	ОбластьДок["П021810"].Значение = ОбластьДок["П022210"].Значение; //Прочие
	ОбластьДок["П021811"].Значение = ОбластьДок["П022211"].Значение; //Прочие
	
	//Раздел 3
	//Дублирование колонки 3 в 7
	//Жилищные услуги
	ОбластьДок["П033307"].Значение = ОбластьДок["П033303"].Значение;
	ОбластьДок["П033407"].Значение = ОбластьДок["П033403"].Значение;
	ОбластьДок["П033507"].Значение = ОбластьДок["П033503"].Значение;
	ОбластьДок["П033607"].Значение = ОбластьДок["П033603"].Значение;
	ОбластьДок["П033707"].Значение = ОбластьДок["П033703"].Значение;
	//Комунальные услуги
	ОбластьДок["П033907"].Значение = ОбластьДок["П033903"].Значение;
	ОбластьДок["П034007"].Значение = ОбластьДок["П034003"].Значение;
	ОбластьДок["П034107"].Значение = ОбластьДок["П034103"].Значение;
	ОбластьДок["П034207"].Значение = ОбластьДок["П034203"].Значение;
	ОбластьДок["П034307"].Значение = ОбластьДок["П034303"].Значение;
	ОбластьДок["П034407"].Значение = ОбластьДок["П034403"].Значение;
	ОбластьДок["П034507"].Значение = ОбластьДок["П034503"].Значение;
	ОбластьДок["П034607"].Значение = ОбластьДок["П034603"].Значение;
	ОбластьДок["П035107"].Значение = ОбластьДок["П035103"].Значение;
	
	//Дублирование колонки 3 в 8
	//Жилищные услуги
	ОбластьДок["П033308"].Значение = ОбластьДок["П033303"].Значение;
	ОбластьДок["П033408"].Значение = ОбластьДок["П033403"].Значение;
	ОбластьДок["П033508"].Значение = ОбластьДок["П033503"].Значение;
	ОбластьДок["П033608"].Значение = ОбластьДок["П033603"].Значение;
	ОбластьДок["П033708"].Значение = ОбластьДок["П033703"].Значение;
	//Комунальные услуги
	ОбластьДок["П033908"].Значение = ОбластьДок["П033903"].Значение;
	ОбластьДок["П034008"].Значение = ОбластьДок["П034003"].Значение;
	ОбластьДок["П034108"].Значение = ОбластьДок["П034103"].Значение;
	ОбластьДок["П034208"].Значение = ОбластьДок["П034203"].Значение;
	ОбластьДок["П034308"].Значение = ОбластьДок["П034303"].Значение;
	ОбластьДок["П034408"].Значение = ОбластьДок["П034403"].Значение;
	ОбластьДок["П034508"].Значение = ОбластьДок["П034503"].Значение;
	ОбластьДок["П034608"].Значение = ОбластьДок["П034603"].Значение;
	ОбластьДок["П035108"].Значение = ОбластьДок["П035103"].Значение;
	
	//Площадь и Число проживающих
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Здание,
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КоличествоПроживающих
	|ПОМЕСТИТЬ СписокПроживающих
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент = ИСТИНА
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания <> ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга КАК Услуга,
	|	МАКСИМУМ(бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Норма + бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.СверхНорма) КАК ЖилищныйФонд
	|ПОМЕСТИТЬ ВТ_ОбщаяПлощадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОНормативахНачисленийЗакрытогоПериода.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК КомунальнаяПлощадь
	|ПОМЕСТИТЬ ВТ_ОбщаяКомунальнаяПлощадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.Квартира
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
	|	СписокПроживающих.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВТ_ЛицевыеСчета.Здание,
	|	МАКСИМУМ(ВТ_ОбщаяПлощадь.ЖилищныйФонд) КАК ЖилищныйФонд,
	|	МАКСИМУМ(ВТ_ОбщаяКомунальнаяПлощадь.КомунальнаяПлощадь) КАК КомунальнаяПлощадь
	|ПОМЕСТИТЬ УслугиГЦЖС
	|ИЗ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокПроживающих КАК СписокПроживающих
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = СписокПроживающих.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|			ПО ВТ_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяКомунальнаяПлощадь КАК ВТ_ОбщаяКомунальнаяПлощадь
	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_ОбщаяКомунальнаяПлощадь.Квартира
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяПлощадь КАК ВТ_ОбщаяПлощадь
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ОбщаяПлощадь.ЛицевойСчет
	|			И ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = ВТ_ОбщаяПлощадь.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
	|	СписокПроживающих.КоличествоПроживающих,
	|	ВТ_ЛицевыеСчета.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования)
	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ОбщиеПлощади
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|		ПО ВТ_ЛицевыеСчета.Здание = бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ГДЕ
	|	(бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|			ИЛИ бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Здание
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ШаблоныУслугСрезПоследних.Здание КАК Здание,
	|	бит_ШаблоныУслугСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_ШаблоныУслуг
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			,
	|			Здание В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					УслугиГЦЖС.Здание
	|				ИЗ
	|					УслугиГЦЖС КАК УслугиГЦЖС)) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Здание,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШаблоныУслуг.Здание КАК Здание,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ПредварительноОбщиеПлощади
	|ИЗ
	|	ВТ_ШаблоныУслуг КАК ВТ_ШаблоныУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_ШаблоныУслуг.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощади КАК ВТ_ОбщиеПлощади
	|		ПО ВТ_ШаблоныУслуг.Здание = ВТ_ОбщиеПлощади.Здание
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ШаблоныУслуг.Здание,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ОбщиеПлощадиИтог
	|ИЗ
	|	ВТ_ПредварительноОбщиеПлощади КАК ВТ_ПредварительноОбщиеПлощади
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	УслугиГЦЖС.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
	|	УслугиГЦЖС.ТипПлиты КАК ТипПлиты,
	|	СУММА(УслугиГЦЖС.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	СУММА(УслугиГЦЖС.ЖилищныйФонд) КАК ЖилищныйФонд,
	|	СУММА(УслугиГЦЖС.КомунальнаяПлощадь) КАК КомунальнаяПлощадь,
	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ИЗ
	|	УслугиГЦЖС КАК УслугиГЦЖС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощадиИтог КАК ВТ_ОбщиеПлощадиИтог
	|		ПО УслугиГЦЖС.ГрафаОтчетаГЦЖС = ВТ_ОбщиеПлощадиИтог.ГрафаОтчетаГЦЖС
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС,
	|	УслугиГЦЖС.ВидБлагоустройстваЗданий,
	|	УслугиГЦЖС.ТипПлиты
	|ИТОГИ
	|	СУММА(КоличествоПроживающих),
	|	СУММА(ЖилищныйФонд),
	|	СУММА(КомунальнаяПлощадь),
	|	МАКСИМУМ(ОбщаяПлощадьЖилогоЗдания),
	|	МАКСИМУМ(ОбщаяПлощадьМестОбщегоПользования)
	|ПО
	|	ГрафаОтчетаГЦЖС,
	|	ВидБлагоустройстваЗданий,
	|	ТипПлиты";
	// БИТ_ЖКХ 24.11.2015 9:51:23 Конец правки. 
	
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГЦЖС.Следующий() Цикл
		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
            //Раздел 3
			ОбластьДок["П033910"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			ОбластьДок["П033911"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045608"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			КонецЕсли;	
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
            //Раздел 3
			ОбластьДок["П034010"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			ОбластьДок["П034011"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
            //Раздел 3
			ОбластьДок["П034110"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			ОбластьДок["П034111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
            //Раздел 3
			ОбластьДок["П034210"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			ОбластьДок["П034211"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045407"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
			КонецЕсли;	
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
            //Раздел 3
			ОбластьДок["П034310"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			ОбластьДок["П034311"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			//Суммируем данные по типам плит
			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТипПлиты.Следующий() Цикл
					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
						ОбластьДок["П034410"].Значение = ОбластьДок["П034410"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
//						ОбластьДок["П034411"].Значение = ОбластьДок["П034411"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
						ОбластьДок["П034510"].Значение = ОбластьДок["П034510"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
//						ОбластьДок["П034511"].Значение = ОбластьДок["П034511"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045306"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьМестОбщегоПользования;
				ОбластьДок["П045307"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
			КонецЕсли;	
	
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
            //Раздел 3
			ОбластьДок["П034610"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			ОбластьДок["П034611"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;

		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда
            //Раздел 3
			ОбластьДок["П033310"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			ОбластьДок["П033311"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда
            //Раздел 3
			ОбластьДок["П033410"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			ОбластьДок["П033411"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
					ОбластьДок["П033510"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
					ОбластьДок["П033511"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
					ОбластьДок["П033610"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
					ОбластьДок["П033611"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
            //Раздел 3
			ОбластьДок["П035110"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			ОбластьДок["П035111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
            //Раздел 3
			ОбластьДок["П033710"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			ОбластьДок["П033711"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
		КонецЕсли;
	КонецЦикла; 
	
	
	// Справочно (Раз в год)
	Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
		ОбластьДок["П045405"].Значение = ОбластьДок["П034210"].Значение;
		ОбластьДок["П045308"].Значение = ОбластьДок["П034311"].Значение;
		ОбластьДок["П045508"].Значение = ОбластьДок["П033911"].Значение;
		ОбластьДок["П045708"].Значение = ОбластьДок["П034611"].Значение;
	КонецЕсли;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
Конецпроцедуры  // ЗаполнитьДокумент_Ф22()

//26.08.2019
Процедура ЗаполнитьДокумент_Ф22_Жилище(ДокументРезультат, СведенияОбОрганизации)
	
	Макет = ПолучитьМакет("Форма22_2017Кв1_Жилище1");
	ДокументРезультат.Вывести(Макет);
	
	//// ОсновнаяЧасть1а
	//ДокументРезультат.Области.ПериодОтчета.Значение = "за январь - "
	//	+ НРег(Формат(Дата, "ДФ = 'ММММ гггг'")) + " г.";
															
	// ПолеНомерКорректировки.
	
	// ОсновнаяЧасть1б
	ДокументРезультат.Области.ОргНазв.Значение	  = СведенияОбОрганизации["Наименование"];
	ДокументРезультат.Области.ОргАдрес.Значение	  = СведенияОбОрганизации["Адрес"];
	ДокументРезультат.Области.ОргКодОКПО.Значение = СведенияОбОрганизации["КодПоОКПО"];
	
	//26.08.2019
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты
	|ПОМЕСТИТЬ ВТ_бит_СведенияОКвартиреСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ЛицевыеСчета.Квартира
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	ВТ_ЛицевыеСчета.Квартира,
	|	ВТ_бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	ВТ_ЛицевыеСчета.Здание
	|ПОМЕСТИТЬ ПоставщикиИУслуги
	|ИЗ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_бит_СведенияОКвартиреСрезПоследних КАК ВТ_бит_СведенияОКвартиреСрезПоследних
	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Оплата
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемИнд,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемОбщеДом,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемРазовых
	|ПОМЕСТИТЬ Объемы
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, Услуга) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоставщикиИУслуги.Услуга КАК Услуга,
	|	ПоставщикиИУслуги.Здание КАК Здание,
	|	ПоставщикиИУслуги.ТипПлиты КАК ТипПлиты,
	|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0) КАК ОбъемРазовых,
	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0) КАК ОбъемИнд,
	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0) КАК ОбъемОбщеДом,
	|	СУММА(ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток,
	|	СУММА(ЕСТЬNULL(Обороты.Начисления, 0)) КАК Начисления,
	|	СУММА(ЕСТЬNULL(Обороты.Оплата, 0)) КАК Оплата,
	|	СУММА(ЕСТЬNULL(Обороты.Разовые, 0)) КАК Разовые
	|ПОМЕСТИТЬ ИтоговаяТаб
	|ИЗ
	|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Обороты.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Обороты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	|		ПО ПоставщикиИУслуги.Услуга = Объемы.Услуга
	|			И ПоставщикиИУслуги.ЛицевойСчет = Объемы.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоставщикиИУслуги.Услуга,
	|	ПоставщикиИУслуги.ЛицевойСчет,
	|	ПоставщикиИУслуги.Здание,
	|	ПоставщикиИУслуги.ТипПлиты,
	|	ЕСТЬNULL(Объемы.Объем, 0),
	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0),
	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0),
	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоставщикиИУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Объемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
	|	ИтоговаяТаб.ТипПлиты КАК ТипПлиты,
	|	СУММА(ИтоговаяТаб.Объем) КАК Объем,
	|	СУММА(ИтоговаяТаб.ОбъемРазовых) КАК ОбъемРазовых,
	|	СУММА(ИтоговаяТаб.ОбъемИнд) КАК ОбъемИнд,
	|	СУММА(ИтоговаяТаб.ОбъемОбщеДом) КАК ОбъемОбщеДом,
	|	СУММА(ИтоговаяТаб.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	|	СУММА(ИтоговаяТаб.Начисления) КАК Начисления,
	|	СУММА(ИтоговаяТаб.Оплата) КАК Оплата,
	|	СУММА(ИтоговаяТаб.Разовые) КАК Разовые
	|ИЗ
	|	ИтоговаяТаб КАК ИтоговаяТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ИтоговаяТаб.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО ИтоговаяТаб.Здание = бит_СписокЗданий.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ИтоговаяТаб.ТипПлиты
	|ИТОГИ
	|	СУММА(Объем),
	|	СУММА(ОбъемРазовых),
	|	СУММА(ОбъемИнд),
	|	СУММА(ОбъемОбщеДом),
	|	СУММА(СуммаКонечныйОстаток),
	|	СУММА(Начисления),
	|	СУММА(Оплата),
	|	СУММА(Разовые)
	|ПО
	|	ГрафаОтчетаГЦЖС,
	|	ВидБлагоустройстваЗданий,
	|	ТипПлиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтоговаяТаб";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьДок = ДокументРезультат.Области;
	
	Пока ВыборкаГЦЖС.Следующий() Цикл
		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
			// Раздел1
			ОбластьДок["П010103"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			ОбластьДок["П010203"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2 
			ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
			//// Раздел3
			ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
			ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение +  ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045503"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//	ОбластьДок["П045504"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			//КонецЕсли;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда	
			//// Раздел1
			//ОбластьДок["П010104"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010204"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2 
			//ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
			//// Раздел3
			ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
			ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение +  ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045603"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//	ОбластьДок["П045604"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			//КонецЕсли;
			//
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
			// Раздел1
			ОбластьДок["П010105"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010205"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			ОбластьДок["П020905"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022205"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			//// Раздел3
			ОбластьДок["П034003"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034004"].Значение = ВыборкаГЦЖС.Оплата;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
			// Раздел1
			ОбластьДок["П010106"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010206"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			//ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
			//// Раздел3
			ОбластьДок["П034203"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034204"].Значение = ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045403"].Значение = ОбластьДок["П045403"].Значение + ВыборкаГЦЖС.ОбъемИнд; 
			//КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
			// Раздел1
			ОбластьДок["П010107"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010207"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
			//// Раздел3
			ОбластьДок["П034103"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034104"].Значение = ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045403"].Значение = ОбластьДок["П045403"].Значение + ВыборкаГЦЖС.ОбъемИнд; 
			//КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
			// Раздел1
			ОбластьДок["П010108"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010208"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			//ОбластьДок["П020907"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			ОбластьДок["П020707"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			
			//// Дебиторская задолженность
			ОбластьДок["П022207"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			//// Раздел3
			ОбластьДок["П034303"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034304"].Значение = ВыборкаГЦЖС.Оплата;
			//Суммируем данные по типам плит
			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТипПлиты.Следующий() Цикл
					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
						ОбластьДок["П034403"].Значение = ОбластьДок["П034403"].Значение + ВыборкаТипПлиты.Начисления;
						ОбластьДок["П034404"].Значение = ОбластьДок["П034404"].Значение + ВыборкаТипПлиты.Оплата;
					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
						ОбластьДок["П034503"].Значение = ОбластьДок["П034503"].Значение + ВыборкаТипПлиты.Начисления;
						ОбластьДок["П034504"].Значение = ОбластьДок["П034504"].Значение + ВыборкаТипПлиты.Оплата;
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045303"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//	ОбластьДок["П045304"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			//КонецЕсли;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
			// Раздел1
			ОбластьДок["П010109"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010209"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			//ОбластьДок["П020908"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			ОбластьДок["П020708"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022208"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			//// Раздел3
			ОбластьДок["П034603"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034604"].Значение = ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045703"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
			////// Раздел1
			////ДокументРезультат.Области.П000001000111.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			////ДокументРезультат.Области.П000001000211.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			////Раздел2 
			//ОбластьДок["П020910"].Значение = ОбластьДок["П020910"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			//ОбластьДок["П022210"].Значение = ОбластьДок["П022210"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			////Раздел 3
			////ОбластьДок["П000003004103"].Значение = ОбластьДок["П000003004103"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			////ОбластьДок["П000003004104"].Значение = ОбластьДок["П000003004104"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
			ОбластьДок["П035103"].Значение = ВыборкаГЦЖС.Начисления; 
			ОбластьДок["П035104"].Значение = ВыборкаГЦЖС.Оплата;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
			//// Раздел2 
			//26.08.2019
			ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			//// Раздел 3
			ОбластьДок["П033703"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
			ОбластьДок["П033704"].Значение = ВыборкаГЦЖС.Оплата;
			//
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда	
			// Раздел2 
			// 26.08.2019
            ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			
			//ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			////Раздел 3
			ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено

			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
					ОбластьДок["П033503"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления;
					ОбластьДок["П033504"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
					ОбластьДок["П033603"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления; //Строка 43
					ОбластьДок["П033604"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда	
		//	// Раздел2 
		    // 26.08.2019
			ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
		//	ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
		//	// Дебиторская задолженность
			ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
		//	//Раздел 3
			ОбластьДок["П033303"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П033304"].Значение = ВыборкаГЦЖС.Оплата;
		//	
		//Иначе
		//	// Раздел2 
		//	ОбластьДок["П020911"].Значение = ОбластьДок["П020911"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
		//	// Дебиторская задолженность
		//	ОбластьДок["П022211"].Значение = ОбластьДок["П022211"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Прочие
		КонецЕсли;
		
	КонецЦикла;
	
	//   // тыс. руб
	//ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение/1000;
	ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение/1000;
	ОбластьДок["П020905"].Значение = ОбластьДок["П020905"].Значение/1000;
	ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение/1000;
//	ОбластьДок["П020907"].Значение = ОбластьДок["П020907"].Значение/1000;
	ОбластьДок["П020908"].Значение = ОбластьДок["П020908"].Значение/1000;
	//ОбластьДок["П020910"].Значение = ОбластьДок["П020910"].Значение/1000;
	//ОбластьДок["П020911"].Значение = ОбластьДок["П020911"].Значение/1000;
	ОбластьДок["П022203"].Значение = ОбластьДок["П022203"].Значение/1000;
	ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение/1000;
	ОбластьДок["П022205"].Значение = ОбластьДок["П022205"].Значение/1000;
	ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение/1000;
	ОбластьДок["П022207"].Значение = ОбластьДок["П022207"].Значение/1000;
    ОбластьДок["П022208"].Значение = ОбластьДок["П022208"].Значение/1000;
	//ОбластьДок["П022210"].Значение = ОбластьДок["П022210"].Значение/1000;
	//ОбластьДок["П022211"].Значение = ОбластьДок["П022211"].Значение/1000;
	//
	ОбластьДок["П033303"].Значение = ОбластьДок["П033303"].Значение/1000;
	ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение/1000;
	ОбластьДок["П033503"].Значение = ОбластьДок["П033503"].Значение/1000;
	ОбластьДок["П033603"].Значение = ОбластьДок["П033603"].Значение/1000;
	ОбластьДок["П035103"].Значение = ОбластьДок["П035103"].Значение/1000;
	ОбластьДок["П033703"].Значение = ОбластьДок["П033703"].Значение/1000;
	ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение/1000;
	ОбластьДок["П034003"].Значение = ОбластьДок["П034003"].Значение/1000;
	ОбластьДок["П034103"].Значение = ОбластьДок["П034103"].Значение/1000;
	ОбластьДок["П034203"].Значение = ОбластьДок["П034203"].Значение/1000;
	ОбластьДок["П034303"].Значение = ОбластьДок["П034303"].Значение/1000;
	ОбластьДок["П034403"].Значение = ОбластьДок["П034403"].Значение/1000;
	ОбластьДок["П034503"].Значение = ОбластьДок["П034503"].Значение/1000;
	ОбластьДок["П034603"].Значение = ОбластьДок["П034603"].Значение/1000;
	//
	ОбластьДок["П033304"].Значение = ОбластьДок["П033304"].Значение/1000;
	ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение/1000;
	ОбластьДок["П033504"].Значение = ОбластьДок["П033504"].Значение/1000;
	ОбластьДок["П033604"].Значение = ОбластьДок["П033604"].Значение/1000;
	ОбластьДок["П035104"].Значение = ОбластьДок["П035104"].Значение/1000;
	ОбластьДок["П033704"].Значение = ОбластьДок["П033704"].Значение/1000;
	ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение/1000;
	ОбластьДок["П034004"].Значение = ОбластьДок["П034004"].Значение/1000;
	ОбластьДок["П034104"].Значение = ОбластьДок["П034104"].Значение/1000;
	ОбластьДок["П034204"].Значение = ОбластьДок["П034204"].Значение/1000;
	ОбластьДок["П034304"].Значение = ОбластьДок["П034304"].Значение/1000;
	ОбластьДок["П034404"].Значение = ОбластьДок["П034404"].Значение/1000;
	ОбластьДок["П034504"].Значение = ОбластьДок["П034504"].Значение/1000;
	ОбластьДок["П034604"].Значение = ОбластьДок["П034604"].Значение/1000;
	
	// Раздел2
	//26.08.2019
	ОбластьДок["П020703"].Значение = ОбластьДок["П020903"].Значение;	
	ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение;	
	ОбластьДок["П020803"].Значение = ОбластьДок["П020703"].Значение;	
	//ОбластьДок["П020704"].Значение = ОбластьДок["П020904"].Значение;	
	//ОбластьДок["П020804"].Значение = ОбластьДок["П020904"].Значение;	
	//ОбластьДок["П020705"].Значение = ОбластьДок["П020905"].Значение;	
	//ОбластьДок["П020805"].Значение = ОбластьДок["П020905"].Значение;	
	ОбластьДок["П020706"].Значение = ОбластьДок["П020906"].Значение;	
	//ОбластьДок["П020806"].Значение = ОбластьДок["П020906"].Значение;	
	ОбластьДок["П020707"].Значение = ОбластьДок["П020707"].Значение;	
	//ОбластьДок["П020807"].Значение = ОбластьДок["П020907"].Значение;	
	//ОбластьДок["П020708"].Значение = ОбластьДок["П020908"].Значение;	
	//ОбластьДок["П020808"].Значение = ОбластьДок["П020908"].Значение;	
	//ОбластьДок["П020710"].Значение = ОбластьДок["П020910"].Значение;	
	//ОбластьДок["П020810"].Значение = ОбластьДок["П020910"].Значение;	
	//ОбластьДок["П020711"].Значение = ОбластьДок["П020911"].Значение;	
	//ОбластьДок["П020811"].Значение = ОбластьДок["П020911"].Значение;	
	// Дебиторская задолженность
//	ОбластьДок["П021803"].Значение = ОбластьДок["П022203"].Значение; //Жилищные
	//ОбластьДок["П021804"].Значение = ОбластьДок["П022204"].Значение; //Водоснабжение
	//ОбластьДок["П021805"].Значение = ОбластьДок["П022205"].Значение;
	//ОбластьДок["П021806"].Значение = ОбластьДок["П022206"].Значение; //Теплоснабжение
	//ОбластьДок["П021807"].Значение = ОбластьДок["П022207"].Значение;
	//ОбластьДок["П021808"].Значение = ОбластьДок["П022208"].Значение;
	//ОбластьДок["П021810"].Значение = ОбластьДок["П022210"].Значение; //Прочие
	//ОбластьДок["П021811"].Значение = ОбластьДок["П022211"].Значение; //Прочие
	//
	////Раздел 3
	////Дублирование колонки 3 в 7
	////Жилищные услуги
	ОбластьДок["П033307"].Значение = ОбластьДок["П033303"].Значение;
	ОбластьДок["П033407"].Значение = ОбластьДок["П033403"].Значение;
	ОбластьДок["П033507"].Значение = ОбластьДок["П033503"].Значение;
	ОбластьДок["П033607"].Значение = ОбластьДок["П033603"].Значение;
	ОбластьДок["П033707"].Значение = ОбластьДок["П033703"].Значение;
	////Комунальные услуги
	ОбластьДок["П033907"].Значение = ОбластьДок["П033903"].Значение;
	ОбластьДок["П034007"].Значение = ОбластьДок["П034003"].Значение;
	ОбластьДок["П034107"].Значение = ОбластьДок["П034103"].Значение;
	ОбластьДок["П034207"].Значение = ОбластьДок["П034203"].Значение;
	ОбластьДок["П034307"].Значение = ОбластьДок["П034303"].Значение;
	ОбластьДок["П034407"].Значение = ОбластьДок["П034403"].Значение;
	ОбластьДок["П034507"].Значение = ОбластьДок["П034503"].Значение;
	ОбластьДок["П034607"].Значение = ОбластьДок["П034603"].Значение;
	ОбластьДок["П035107"].Значение = ОбластьДок["П035103"].Значение;
	//
	////Дублирование колонки 3 в 8
	////Жилищные услуги
	ОбластьДок["П033308"].Значение = ОбластьДок["П033303"].Значение;
	ОбластьДок["П033408"].Значение = ОбластьДок["П033403"].Значение;
	ОбластьДок["П033508"].Значение = ОбластьДок["П033503"].Значение;
	ОбластьДок["П033608"].Значение = ОбластьДок["П033603"].Значение;
	ОбластьДок["П033708"].Значение = ОбластьДок["П033703"].Значение;
	////Комунальные услуги
	ОбластьДок["П033908"].Значение = ОбластьДок["П033903"].Значение;
	ОбластьДок["П034008"].Значение = ОбластьДок["П034003"].Значение;
	ОбластьДок["П034108"].Значение = ОбластьДок["П034103"].Значение;
	ОбластьДок["П034208"].Значение = ОбластьДок["П034203"].Значение;
	ОбластьДок["П034308"].Значение = ОбластьДок["П034303"].Значение;
	ОбластьДок["П034408"].Значение = ОбластьДок["П034403"].Значение;
	ОбластьДок["П034508"].Значение = ОбластьДок["П034503"].Значение;
	ОбластьДок["П034608"].Значение = ОбластьДок["П034603"].Значение;
	ОбластьДок["П035108"].Значение = ОбластьДок["П035103"].Значение;
	
	//06.09.2019
	ОбластьДок["П033203"].Значение = ОбластьДок["П033303"].Значение + ОбластьДок["П033403"].Значение; 
	ОбластьДок["П033204"].Значение = ОбластьДок["П033304"].Значение + ОбластьДок["П033404"].Значение;
	ОбластьДок["П033207"].Значение = ОбластьДок["П033307"].Значение + ОбластьДок["П033407"].Значение;
	ОбластьДок["П033208"].Значение = ОбластьДок["П033308"].Значение + ОбластьДок["П033408"].Значение;


	ОбластьДок["П033803"].Значение = ОбластьДок["П033903"].Значение + ОбластьДок["П034003"].Значение +
	                                 ОбластьДок["П034103"].Значение + ОбластьДок["П034203"].Значение + 
									 ОбластьДок["П034303"].Значение + ОбластьДок["П034603"].Значение +
									 ОбластьДок["П034703"].Значение + ОбластьДок["П034903"].Значение + 
	                                 ОбластьДок["П035003"].Значение + ОбластьДок["П035103"].Значение; 	
	
									 
	ОбластьДок["П033804"].Значение = ОбластьДок["П033904"].Значение + ОбластьДок["П034004"].Значение +
	                                 ОбластьДок["П034104"].Значение + ОбластьДок["П034204"].Значение + 
									 ОбластьДок["П034304"].Значение + ОбластьДок["П034604"].Значение +
									 ОбластьДок["П034704"].Значение + ОбластьДок["П034904"].Значение + 
	                                 ОбластьДок["П035004"].Значение + ОбластьДок["П035104"].Значение; 	
									 
    ОбластьДок["П033807"].Значение = ОбластьДок["П033907"].Значение + ОбластьДок["П034007"].Значение +
	                                 ОбластьДок["П034107"].Значение + ОбластьДок["П034207"].Значение + 
									 ОбластьДок["П034307"].Значение + ОбластьДок["П034607"].Значение +
									 ОбластьДок["П034707"].Значение + ОбластьДок["П034907"].Значение + 
	                                 ОбластьДок["П035007"].Значение + ОбластьДок["П035107"].Значение; 	
									 
    ОбластьДок["П033808"].Значение = ОбластьДок["П033908"].Значение + ОбластьДок["П034008"].Значение +
	                                 ОбластьДок["П034108"].Значение + ОбластьДок["П034208"].Значение + 
									 ОбластьДок["П034308"].Значение + ОбластьДок["П034608"].Значение +
									 ОбластьДок["П034708"].Значение + ОбластьДок["П034908"].Значение + 
	                                 ОбластьДок["П035008"].Значение + ОбластьДок["П035108"].Значение; 										 									 
									 
    ОбластьДок["П035203"].Значение = ОбластьДок["П033203"].Значение + ОбластьДок["П033703"].Значение +
	                                 ОбластьДок["П033803"].Значение;
									 
    ОбластьДок["П035204"].Значение = ОбластьДок["П033204"].Значение + ОбластьДок["П033704"].Значение +
	                                 ОбластьДок["П033804"].Значение;
									 
    ОбластьДок["П035207"].Значение = ОбластьДок["П033207"].Значение + ОбластьДок["П033707"].Значение +
	                                 ОбластьДок["П033807"].Значение;
									 
	ОбластьДок["П035208"].Значение = ОбластьДок["П033208"].Значение + ОбластьДок["П033708"].Значение +
	                                 ОбластьДок["П033808"].Значение;						 
									 


	
	//Площадь и Число проживающих
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Здание,
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КоличествоПроживающих
	|ПОМЕСТИТЬ СписокПроживающих
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент = ИСТИНА
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания <> ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга КАК Услуга,
	|	МАКСИМУМ(бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Норма + бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.СверхНорма) КАК ЖилищныйФонд
	|ПОМЕСТИТЬ ВТ_ОбщаяПлощадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОНормативахНачисленийЗакрытогоПериода.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК КомунальнаяПлощадь
	|ПОМЕСТИТЬ ВТ_ОбщаяКомунальнаяПлощадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.Квартира
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
	|	СписокПроживающих.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВТ_ЛицевыеСчета.Здание,
	|	МАКСИМУМ(ВТ_ОбщаяПлощадь.ЖилищныйФонд) КАК ЖилищныйФонд,
	|	МАКСИМУМ(ВТ_ОбщаяКомунальнаяПлощадь.КомунальнаяПлощадь) КАК КомунальнаяПлощадь
	|ПОМЕСТИТЬ УслугиГЦЖС
	|ИЗ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокПроживающих КАК СписокПроживающих
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = СписокПроживающих.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|			ПО ВТ_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяКомунальнаяПлощадь КАК ВТ_ОбщаяКомунальнаяПлощадь
	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_ОбщаяКомунальнаяПлощадь.Квартира
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяПлощадь КАК ВТ_ОбщаяПлощадь
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ОбщаяПлощадь.ЛицевойСчет
	|			И ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = ВТ_ОбщаяПлощадь.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
	|	СписокПроживающих.КоличествоПроживающих,
	|	ВТ_ЛицевыеСчета.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования)
	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ОбщиеПлощади
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|		ПО ВТ_ЛицевыеСчета.Здание = бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ГДЕ
	|	(бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|			ИЛИ бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Здание
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ШаблоныУслугСрезПоследних.Здание КАК Здание,
	|	бит_ШаблоныУслугСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_ШаблоныУслуг
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			,
	|			Здание В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					УслугиГЦЖС.Здание
	|				ИЗ
	|					УслугиГЦЖС КАК УслугиГЦЖС)) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Здание,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШаблоныУслуг.Здание КАК Здание,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ПредварительноОбщиеПлощади
	|ИЗ
	|	ВТ_ШаблоныУслуг КАК ВТ_ШаблоныУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_ШаблоныУслуг.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощади КАК ВТ_ОбщиеПлощади
	|		ПО ВТ_ШаблоныУслуг.Здание = ВТ_ОбщиеПлощади.Здание
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ШаблоныУслуг.Здание,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ОбщиеПлощадиИтог
	|ИЗ
	|	ВТ_ПредварительноОбщиеПлощади КАК ВТ_ПредварительноОбщиеПлощади
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	УслугиГЦЖС.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
	|	УслугиГЦЖС.ТипПлиты КАК ТипПлиты,
	|	СУММА(УслугиГЦЖС.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	СУММА(УслугиГЦЖС.ЖилищныйФонд) КАК ЖилищныйФонд,
	|	СУММА(УслугиГЦЖС.КомунальнаяПлощадь) КАК КомунальнаяПлощадь,
	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ИЗ
	|	УслугиГЦЖС КАК УслугиГЦЖС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощадиИтог КАК ВТ_ОбщиеПлощадиИтог
	|		ПО УслугиГЦЖС.ГрафаОтчетаГЦЖС = ВТ_ОбщиеПлощадиИтог.ГрафаОтчетаГЦЖС
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС,
	|	УслугиГЦЖС.ВидБлагоустройстваЗданий,
	|	УслугиГЦЖС.ТипПлиты
	|ИТОГИ
	|	СУММА(КоличествоПроживающих),
	|	СУММА(ЖилищныйФонд),
	|	СУММА(КомунальнаяПлощадь),
	|	МАКСИМУМ(ОбщаяПлощадьЖилогоЗдания),
	|	МАКСИМУМ(ОбщаяПлощадьМестОбщегоПользования)
	|ПО
	|	ГрафаОтчетаГЦЖС,
	|	ВидБлагоустройстваЗданий,
	|	ТипПлиты";
	// БИТ_ЖКХ 24.11.2015 9:51:23 Конец правки. 
	
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГЦЖС.Следующий() Цикл
		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
            //Раздел 3
			ОбластьДок["П033910"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П033911"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				//ОбластьДок["П045608"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			КонецЕсли;	
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
            //Раздел 3
			ОбластьДок["П034010"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034011"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
            //Раздел 3
			ОбластьДок["П034110"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
			////Раздел 3
			ОбластьДок["П034210"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034211"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			//// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			  ОбластьДок["П045407"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
			КонецЕсли;	
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
            //Раздел 3
			ОбластьДок["П034310"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034311"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			//Суммируем данные по типам плит
			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТипПлиты.Следующий() Цикл
					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
						ОбластьДок["П034410"].Значение = ОбластьДок["П034410"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
//						ОбластьДок["П034411"].Значение = ОбластьДок["П034411"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
						ОбластьДок["П034510"].Значение = ОбластьДок["П034510"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
						//ОбластьДок["П034511"].Значение = ОбластьДок["П034511"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045306"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьМестОбщегоПользования;
				ОбластьДок["П045307"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
			КонецЕсли;	
	
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
            //Раздел 3
			ОбластьДок["П034610"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034611"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;

		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда
            //Раздел 3
			ОбластьДок["П033310"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П033311"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда
            //Раздел 3
			ОбластьДок["П033410"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П033411"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			//ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
					ОбластьДок["П033510"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
//					ОбластьДок["П033511"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
					ОбластьДок["П033610"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
//					ОбластьДок["П033611"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
            //Раздел 3
			ОбластьДок["П035110"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П035111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
            //Раздел 3
			ОбластьДок["П033710"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П033711"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
		КонецЕсли;
	КонецЦикла; 
	
	
	// Справочно (Раз в год)
	Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
		ОбластьДок["П045405"].Значение = ОбластьДок["П034210"].Значение;
	//	ОбластьДок["П045308"].Значение = ОбластьДок["П034311"].Значение;
	//	ОбластьДок["П045508"].Значение = ОбластьДок["П033911"].Значение;
	//	ОбластьДок["П045708"].Значение = ОбластьДок["П034611"].Значение;
	КонецЕсли;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
Конецпроцедуры  // ЗаполнитьДокумент_Ф22()

//26.08.2019
Процедура ЗаполнитьДокумент_Ф22_ЖилищеНовая(ДокументРезультат, СведенияОбОрганизации)
	
	если ЭтотОбъект.СтараяВерсия = истина тогда	
	 Макет = ПолучитьМакет("Форма22_2017Кв1_Жилище1");
    иначе
	 // 06.05.2020 
	 если ЭтотОбъект.Версия2019 = истина тогда
	  Макет = ПолучитьМакет("ФормаОтчета2019Кв1_ФормаОтчета");
	 иначе
	 //если ЭтотОбъект.ВидФормы = "22_Жилище_2020" тогда
	  Макет = ПолучитьМакет("ФормаОтчета2020Кв1");
	 конецесли;
	 
	конецесли; 
	ДокументРезультат.Вывести(Макет);
	
	// ОсновнаяЧасть1а
	ДокументРезультат.Области.ПериодОтчета.Значение = "за январь - "
		+ НРег(Формат(Дата, "ДФ = 'ММММ гггг'")) + " г.";
															
	// ПолеНомерКорректировки.
	
	// ОсновнаяЧасть1б
	ДокументРезультат.Области.ОргНазв.Значение	  = СведенияОбОрганизации["Наименование"];
	ДокументРезультат.Области.ОргАдрес.Значение	  = СведенияОбОрганизации["Адрес"];
	ДокументРезультат.Области.ОргКодОКПО.Значение = СведенияОбОрганизации["КодПоОКПО"];
	
	//26.08.2019
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты
	|ПОМЕСТИТЬ ВТ_бит_СведенияОКвартиреСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ЛицевыеСчета.Квартира
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	ВТ_ЛицевыеСчета.Квартира,
	|	ВТ_бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	ВТ_ЛицевыеСчета.Здание
	|ПОМЕСТИТЬ ПоставщикиИУслуги
	|ИЗ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_бит_СведенияОКвартиреСрезПоследних КАК ВТ_бит_СведенияОКвартиреСрезПоследних
	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|		КОНЕЦ) КАК Оплата
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемИнд,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемОбщеДом,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемРазовых
	|ПОМЕСТИТЬ Объемы
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, Услуга) В
	|				(ВЫБРАТЬ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоставщикиИУслуги.Услуга КАК Услуга,
	|	ПоставщикиИУслуги.Здание КАК Здание,
	|	ПоставщикиИУслуги.ТипПлиты КАК ТипПлиты,
	|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0) КАК ОбъемРазовых,
	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0) КАК ОбъемИнд,
	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0) КАК ОбъемОбщеДом,
	|	СУММА(ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток,
	|	СУММА(ЕСТЬNULL(Обороты.Начисления, 0)) КАК Начисления,
	|	СУММА(ЕСТЬNULL(Обороты.Оплата, 0)) КАК Оплата,
	|	СУММА(ЕСТЬNULL(Обороты.Разовые, 0)) КАК Разовые,
	|ПоставщикиИУслуги.Услуга.ОбщедомовыеНачисления КАК УслугаОбщедомовыеНачисления
	|ПОМЕСТИТЬ ИтоговаяТаб
	|ИЗ
	|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Обороты.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Обороты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	|		ПО ПоставщикиИУслуги.Услуга = Объемы.Услуга
	|			И ПоставщикиИУслуги.ЛицевойСчет = Объемы.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоставщикиИУслуги.Услуга,
	|	ПоставщикиИУслуги.ЛицевойСчет,
	|	ПоставщикиИУслуги.Здание,
	|	ПоставщикиИУслуги.ТипПлиты,
	|	ЕСТЬNULL(Объемы.Объем, 0),
	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0),
	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0),
	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоставщикиИУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Объемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
	|	ИтоговаяТаб.ТипПлиты КАК ТипПлиты,
	|	СУММА(ИтоговаяТаб.Объем) КАК Объем,
	|	СУММА(ИтоговаяТаб.ОбъемРазовых) КАК ОбъемРазовых,
	|	СУММА(ИтоговаяТаб.ОбъемИнд) КАК ОбъемИнд,
	|	СУММА(ИтоговаяТаб.ОбъемОбщеДом) КАК ОбъемОбщеДом,
	|	СУММА(ИтоговаяТаб.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	|	СУММА(ИтоговаяТаб.Начисления) КАК Начисления,
	|	СУММА(ИтоговаяТаб.Оплата) КАК Оплата,
	|	СУММА(ИтоговаяТаб.Разовые) КАК Разовые
	|ИЗ
	|	ИтоговаяТаб КАК ИтоговаяТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ИтоговаяТаб.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО ИтоговаяТаб.Здание = бит_СписокЗданий.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ИтоговаяТаб.ТипПлиты
	|ИТОГИ
	|	СУММА(Объем),
	|	СУММА(ОбъемРазовых),
	|	СУММА(ОбъемИнд),
	|	СУММА(ОбъемОбщеДом),
	|	СУММА(СуммаКонечныйОстаток),
	|	СУММА(Начисления),
	|	СУММА(Оплата),
	|	СУММА(Разовые)
	|ПО
	|	ГрафаОтчетаГЦЖС,
	|	ВидБлагоустройстваЗданий,
	|	ТипПлиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтоговаяТаб";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьДок = ДокументРезультат.Области;
	
	//20.11.2019
	ДополнительныеСуммы = ПолучитьДополнительныеСуммы();
	
	Пока ВыборкаГЦЖС.Следующий() Цикл
		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
			// Раздел1
			ОбластьДок["П010103"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
	//19.11.2019		
	//		ОбластьДок["П010203"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2 
			ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
			//// Раздел3
			ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
			ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение +  ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045503"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//	ОбластьДок["П045504"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			//КонецЕсли;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда	
			//// Раздел1
			//ОбластьДок["П010104"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010204"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2 
			//ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
			//// Раздел3
			ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
			ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение +  ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045603"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//	ОбластьДок["П045604"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			//КонецЕсли;
			//
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
			// Раздел1
			ОбластьДок["П010105"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010205"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			ОбластьДок["П020905"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022205"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			//// Раздел3
			ОбластьДок["П034003"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034004"].Значение = ВыборкаГЦЖС.Оплата;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
			// Раздел1
			ОбластьДок["П010106"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010206"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			ОбластьДок["П020706"].Значение = ОбластьДок["П020706"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
			//// Раздел3
			ОбластьДок["П034203"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034204"].Значение = ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045403"].Значение = ОбластьДок["П045403"].Значение + ВыборкаГЦЖС.ОбъемИнд; 
			//КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
			// Раздел1
			
			ОбластьДок["П010107"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010207"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П023604"].Значение = ОбластьДок["П023604"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
			//// Раздел3
			ОбластьДок["П034103"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034104"].Значение = ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045403"].Значение = ОбластьДок["П045403"].Значение + ВыборкаГЦЖС.ОбъемИнд; 
			//КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
			// Раздел1
			ОбластьДок["П010108"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010208"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			//ОбластьДок["П020907"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			ОбластьДок["П020707"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			
			//// Дебиторская задолженность
			ОбластьДок["П022207"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			//// Раздел3
			ОбластьДок["П034303"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034304"].Значение = ВыборкаГЦЖС.Оплата;
			//Суммируем данные по типам плит
			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТипПлиты.Следующий() Цикл
					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
						ОбластьДок["П034403"].Значение = ОбластьДок["П034403"].Значение + ВыборкаТипПлиты.Начисления;
						ОбластьДок["П034404"].Значение = ОбластьДок["П034404"].Значение + ВыборкаТипПлиты.Оплата;
					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
						ОбластьДок["П034503"].Значение = ОбластьДок["П034503"].Значение + ВыборкаТипПлиты.Начисления;
						ОбластьДок["П034504"].Значение = ОбластьДок["П034504"].Значение + ВыборкаТипПлиты.Оплата;
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045303"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//	ОбластьДок["П045304"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
			//КонецЕсли;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
			// Раздел1
			ОбластьДок["П010109"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//ОбластьДок["П010209"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			//// Раздел2
			//ОбластьДок["П020908"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			ОбластьДок["П020708"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П022208"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
			//// Раздел3
			ОбластьДок["П034603"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П034604"].Значение = ВыборкаГЦЖС.Оплата;
			//// Справочно (Раз в год)
			//Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			//	ОбластьДок["П045703"].Значение = ВыборкаГЦЖС.ОбъемИнд;
			//КонецЕсли;
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
			////// Раздел1
			// БИТ ЖКХ 7.05.2020
			попытка
			 ОбластьДок["П010111"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			исключение 
			конецпопытки; 
			////ДокументРезультат.Области.П000001000111.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			////ДокументРезультат.Области.П000001000211.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
			////Раздел2 
			ОбластьДок["П020709"].Значение = ОбластьДок["П020709"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
			ОбластьДок["П22210"].Значение = ОбластьДок["П22210"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			////Раздел 3
			////ОбластьДок["П000003004103"].Значение = ОбластьДок["П000003004103"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			////ОбластьДок["П000003004104"].Значение = ОбластьДок["П000003004104"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
			ОбластьДок["П035103"].Значение = ВыборкаГЦЖС.Начисления; 
			ОбластьДок["П035104"].Значение = ВыборкаГЦЖС.Оплата;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
			//// Раздел2 
			//26.08.2019
			ОбластьДок["П20907"].Значение = ОбластьДок["П20907"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
//			ОбластьДок["П024104"].Значение = ОбластьДок["П024104"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			//// Раздел 3
			ОбластьДок["П033703"].Значение = ВыборкаГЦЖС.Начисления;
			//21.11.2019
			//ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			//ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
			ОбластьДок["П033704"].Значение = ВыборкаГЦЖС.Оплата;
			//
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда	
			// Раздел2 
			// 26.08.2019
			ОбластьДок["П20907"].Значение = ОбластьДок["П20907"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
            //ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			
			//ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
			//// Дебиторская задолженность
//			ОбластьДок["П024104"].Значение = ОбластьДок["П024104"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
			////Раздел 3
			ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
			ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено

			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
					ОбластьДок["П033503"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления;
					ОбластьДок["П033504"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
					ОбластьДок["П033603"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления; //Строка 43
					ОбластьДок["П033604"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда	
		//	// Раздел2 
		    // 26.08.2019
			
			ОбластьДок["П20907"].Значение = ОбластьДок["П20907"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
           //ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
		//	ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
		//	// Дебиторская задолженность
		// 20.11.2019
		//	ОбластьДок["П024104"].Значение = ОбластьДок["П024104"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
		//	//Раздел 3
			ОбластьДок["П033303"].Значение = ВыборкаГЦЖС.Начисления;
			ОбластьДок["П033304"].Значение = ВыборкаГЦЖС.Оплата;
		//	
		//Иначе
		//	// Раздел2 
		//	ОбластьДок["П020911"].Значение = ОбластьДок["П020911"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
		//	// Дебиторская задолженность
		//	ОбластьДок["П022211"].Значение = ОбластьДок["П022211"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Прочие
		КонецЕсли;
		
	КонецЦикла;
	
	//   // тыс. руб
	//ОбластьДок["П020903"].Значение = ОбластьДок["П020903"].Значение/1000;
	ОбластьДок["П020904"].Значение = ОбластьДок["П020904"].Значение/1000;
	ОбластьДок["П020905"].Значение = ОбластьДок["П020905"].Значение/1000;
	ОбластьДок["П020906"].Значение = ОбластьДок["П020906"].Значение/1000;
	//20.11.2019
//	ОбластьДок["П20907"].Значение = ОбластьДок["П20907"].Значение/1000;
//	ОбластьДок["П021404"].Значение = ОбластьДок["П20907"].Значение;
	ОбластьДок["П021504"].Значение = ДополнительныеСуммы.НачисленияТехОбслуживанияНайм/1000;
	ОбластьДок["П021604"].Значение = ДополнительныеСуммы.НачисленияТехОбслуживанияНаймОДН/1000;
	ОбластьДок["П021704"].Значение = ДополнительныеСуммы.НачисленияПрочие/1000;
	// БИТ ЖКХ 07.05.2020
	ОбластьДок["П20907"].Значение = ОбластьДок["П021404"].Значение + 
	                                  ОбластьДок["П021504"].Значение + 
	                                    ОбластьДок["П021604"].Значение +
										  ОбластьДок["П021704"].Значение;
	//ОбластьДок["П020908"].Значение = ОбластьДок["П020908"].Значение/1000;
	//ОбластьДок["П020910"].Значение = ОбластьДок["П020910"].Значение/1000;
	//ОбластьДок["П020911"].Значение = ОбластьДок["П020911"].Значение/1000;
	
	//20.11.2019	
	//П022204 П023604 П022205 П022206 П022207   	
	
	//21.11.2019ОбластьДок["П022203"].Значение; 		                        
	
	//ОбластьДок["П024104"].Значение = ОбластьДок["П024104"].Значение/1000;
	ОбластьДок["П022204"].Значение = ОбластьДок["П022204"].Значение/1000;
	ОбластьДок["П023604"].Значение = ОбластьДок["П023604"].Значение/1000;
	ОбластьДок["П022205"].Значение = ОбластьДок["П022205"].Значение/1000;
	ОбластьДок["П022206"].Значение = ОбластьДок["П022206"].Значение/1000;
	ОбластьДок["П022207"].Значение = ОбластьДок["П022207"].Значение/1000;
    ОбластьДок["П022208"].Значение = ОбластьДок["П022208"].Значение/1000;
	ОбластьДок["П22210"].Значение = ОбластьДок["П22210"].Значение/1000;
	//ОбластьДок["П022211"].Значение = ОбластьДок["П022211"].Значение/1000;
	//
	ОбластьДок["П022203"].Значение = ОбластьДок["П022204"].Значение + ОбластьДок["П023604"].Значение +  
	                                   ОбластьДок["П022205"].Значение + ОбластьДок["П022206"].Значение +
									     ОбластьДок["П022207"].Значение + ОбластьДок["П22210"].Значение + ОбластьДок["П022208"].Значение;										 										 
				
	
	// БИТ ЖКХ 24.04.2020
	ОбластьДок["П024304"].Значение = ?(ДополнительныеСуммы.ОстатокТехОбслуживанияНайм = Неопределено, "", ДополнительныеСуммы.ОстатокТехОбслуживанияНайм/1000);
   //ОбластьДок["П024404"].Значение = ?(ДополнительныеСуммы.ОстатокТехОбслуживанияНаймОДН = Неопределено, "", ДополнительныеСуммы.ОстатокТехОбслуживанияНаймОДН/1000);
	
	ОбластьДок["П024104"].Значение = ОбластьДок["П024304"].Значение + ОбластьДок["П024404"].Значение; 
	
	//21.11.2019
	ОбластьДок["П021804"].Значение = ОбластьДок["П024304"].Значение + ОбластьДок["П024404"].Значение + ОбластьДок["П022203"].Значение; 
	
	// БИТ ЖКХ 24.04.2020
    ОбластьДок["П035904"].Значение = ?(ДополнительныеСуммы.НачисленияКапРемонт = неопределено, "", ДополнительныеСуммы.НачисленияКапРемонт/1000);
	ОбластьДок["П036004"].Значение = ?(ДополнительныеСуммы.ОплатаКапРемонт = неопределено, "", ДополнительныеСуммы.ОплатаКапРемонт/1000);

	// БИТ ЖКХ 24.04.2020
	ОбластьДок["П033303"].Значение = ?(ОбластьДок["П033303"].Значение = неопределено, "", ОбластьДок["П033303"].Значение/1000);
	
	//21.11.2019
	//ОбластьДок["П033403"].Значение = ОбластьДок["П033403"].Значение/1000;
	// БИТ ЖКХ 24.04.2020
	//          8.5.2020
	ОбластьДок["П033403"].Значение = ?(ДополнительныеСуммы.НачисленияТехОбслуживанияНайм = неопределено, 0, ДополнительныеСуммы.НачисленияТехОбслуживанияНайм/1000) +
	                                 ?(ДополнительныеСуммы.НачисленияТехОбслуживанияНаймОДН = неопределено, 0, ДополнительныеСуммы.НачисленияТехОбслуживанияНаймОДН/1000) +
									   ?(ОбластьДок["П033303"].Значение = неопределено, 0, Число(ОбластьДок["П033303"].Значение));
									  
    //21.11.2019									  
	//ОбластьДок["П033503"].Значение = ОбластьДок["П033503"].Значение/1000;
	// БИТ ЖКХ 24.04.2020
	// 8.5.2020
	ОбластьДок["П033503"].Значение = ?(ДополнительныеСуммы.НачисленияТехОбслуживанияНайм = неопределено, "", ДополнительныеСуммы.НачисленияТехОбслуживанияНайм/1000) +
	                                   ?(ОбластьДок["П033303"].Значение = неопределено, 0, Число(ОбластьДок["П033303"].Значение));

	
	ОбластьДок["П033533"].Значение = ?(ДополнительныеСуммы.НачисленияТехОбслуживанияНаймОДН = неопределено, "", ДополнительныеСуммы.НачисленияТехОбслуживанияНаймОДН/1000);
	
	ОбластьДок["П033603"].Значение = ОбластьДок["П033603"].Значение/1000;
	ОбластьДок["П035103"].Значение = ОбластьДок["П035103"].Значение/1000;
	ОбластьДок["П033703"].Значение = ОбластьДок["П033703"].Значение/1000;
	ОбластьДок["П033903"].Значение = ОбластьДок["П033903"].Значение/1000;
	ОбластьДок["П034003"].Значение = ОбластьДок["П034003"].Значение/1000;
	ОбластьДок["П034103"].Значение = ОбластьДок["П034103"].Значение/1000;
	ОбластьДок["П034203"].Значение = ОбластьДок["П034203"].Значение/1000;
	ОбластьДок["П034303"].Значение = ОбластьДок["П034303"].Значение/1000;
	ОбластьДок["П034403"].Значение = ОбластьДок["П034403"].Значение/1000;
	ОбластьДок["П034503"].Значение = ОбластьДок["П034503"].Значение/1000;
	ОбластьДок["П034603"].Значение = ОбластьДок["П034603"].Значение/1000;
	//
	ОбластьДок["П033304"].Значение = ОбластьДок["П033304"].Значение/1000;
	ОбластьДок["П033404"].Значение = ОбластьДок["П033404"].Значение/1000;
	ОбластьДок["П033504"].Значение = ОбластьДок["П033504"].Значение/1000;
	ОбластьДок["П033604"].Значение = ОбластьДок["П033604"].Значение/1000;
	ОбластьДок["П035104"].Значение = ОбластьДок["П035104"].Значение/1000;
	ОбластьДок["П033704"].Значение = ОбластьДок["П033704"].Значение/1000;
	ОбластьДок["П033904"].Значение = ОбластьДок["П033904"].Значение/1000;
	ОбластьДок["П034004"].Значение = ОбластьДок["П034004"].Значение/1000;
	ОбластьДок["П034104"].Значение = ОбластьДок["П034104"].Значение/1000;
	ОбластьДок["П034204"].Значение = ОбластьДок["П034204"].Значение/1000;
	ОбластьДок["П034304"].Значение = ОбластьДок["П034304"].Значение/1000;
	ОбластьДок["П034404"].Значение = ОбластьДок["П034404"].Значение/1000;
	ОбластьДок["П034504"].Значение = ОбластьДок["П034504"].Значение/1000;
	ОбластьДок["П034604"].Значение = ОбластьДок["П034604"].Значение/1000;
	
	// Раздел2
	//26.08.2019
	//ОбластьДок["П020703"].Значение = ОбластьДок["П020903"].Значение;	
	ОбластьДок["П020703"].Значение = ОбластьДок["П020703"].Значение/1000;
	ОбластьДок["П020803"].Значение = ОбластьДок["П020703"].Значение;	
	//ОбластьДок["П020704"].Значение = ОбластьДок["П020904"].Значение;	
	//ОбластьДок["П020804"].Значение = ОбластьДок["П020904"].Значение;	
	//ОбластьДок["П020705"].Значение = ОбластьДок["П020905"].Значение;	
	//ОбластьДок["П020805"].Значение = ОбластьДок["П020905"].Значение;	
	
	//19.11.2019
	ОбластьДок["П020706"].Значение = ОбластьДок["П020706"].Значение/1000;	
	ОбластьДок["П020708"].Значение = ОбластьДок["П020708"].Значение/1000;		
	
	//ОбластьДок["П020806"].Значение = ОбластьДок["П020906"].Значение;	
	ОбластьДок["П020707"].Значение = ОбластьДок["П020707"].Значение/1000;
	ОбластьДок["П020709"].Значение = ОбластьДок["П020709"].Значение/1000;
	//ОбластьДок["П020807"].Значение = ОбластьДок["П020907"].Значение;	
	//ОбластьДок["П020708"].Значение = ОбластьДок["П020908"].Значение;	
	//ОбластьДок["П020808"].Значение = ОбластьДок["П020908"].Значение;	
	//ОбластьДок["П020710"].Значение = ОбластьДок["П020910"].Значение;	
	//ОбластьДок["П020810"].Значение = ОбластьДок["П020910"].Значение;	
	//ОбластьДок["П020711"].Значение = ОбластьДок["П020911"].Значение;	
	//ОбластьДок["П020811"].Значение = ОбластьДок["П020911"].Значение;	
	// Дебиторская задолженность
//	ОбластьДок["П021803"].Значение = ОбластьДок["П022203"].Значение; //Жилищные
	//ОбластьДок["П021804"].Значение = ОбластьДок["П022204"].Значение; //Водоснабжение
	//ОбластьДок["П021805"].Значение = ОбластьДок["П022205"].Значение;
	//ОбластьДок["П021806"].Значение = ОбластьДок["П022206"].Значение; //Теплоснабжение
	//ОбластьДок["П021807"].Значение = ОбластьДок["П022207"].Значение;
	//ОбластьДок["П021808"].Значение = ОбластьДок["П022208"].Значение;
	//ОбластьДок["П021810"].Значение = ОбластьДок["П022210"].Значение; //Прочие
	//ОбластьДок["П021811"].Значение = ОбластьДок["П022211"].Значение; //Прочие
	//
	ОбластьДок["П020604"].Значение = ОбластьДок["П020904"].Значение + ОбластьДок["П020906"].Значение +  
	                                   ОбластьДок["П020905"].Значение + ОбластьДок["П020706"].Значение +
									     ОбластьДок["П020707"].Значение + ОбластьДок["П020708"].Значение + ОбластьДок["П020709"].Значение;
	
	ОбластьДок["П020803"].Значение = ОбластьДок["П020604"].Значение + ОбластьДок["П20907"].Значение;
	ОбластьДок["П020703"].Значение = ОбластьДок["П020803"].Значение + ОбластьДок["П021704"].Значение;

	////Раздел 3
	////Дублирование колонки 3 в 7
	////Жилищные услуги
	ОбластьДок["П033307"].Значение = ОбластьДок["П033303"].Значение;
	ОбластьДок["П033407"].Значение = ОбластьДок["П033403"].Значение;
	ОбластьДок["П033507"].Значение = ОбластьДок["П033503"].Значение;	
	ОбластьДок["П033607"].Значение = ОбластьДок["П033603"].Значение;
	ОбластьДок["П033707"].Значение = ОбластьДок["П033703"].Значение;
	//21.11.2019
	ОбластьДок["П033577"].Значение = ОбластьДок["П033533"].Значение;	
	ОбластьДок["П033388"].Значение = ОбластьДок["П033533"].Значение;
	
	
	////Комунальные услуги
	ОбластьДок["П033907"].Значение = ОбластьДок["П033903"].Значение;
	ОбластьДок["П034007"].Значение = ОбластьДок["П034003"].Значение;
	ОбластьДок["П034107"].Значение = ОбластьДок["П034103"].Значение;
	ОбластьДок["П034207"].Значение = ОбластьДок["П034203"].Значение;
	ОбластьДок["П034307"].Значение = ОбластьДок["П034303"].Значение;
	ОбластьДок["П034407"].Значение = ОбластьДок["П034403"].Значение;
	ОбластьДок["П034507"].Значение = ОбластьДок["П034503"].Значение;
	ОбластьДок["П034607"].Значение = ОбластьДок["П034603"].Значение;
	ОбластьДок["П035107"].Значение = ОбластьДок["П035103"].Значение;
	//
	////Дублирование колонки 3 в 8
	////Жилищные услуги
	ОбластьДок["П033308"].Значение = ОбластьДок["П033303"].Значение;
	ОбластьДок["П033408"].Значение = ОбластьДок["П033403"].Значение;
	ОбластьДок["П033508"].Значение = ОбластьДок["П033503"].Значение;
	ОбластьДок["П033608"].Значение = ОбластьДок["П033603"].Значение;
	ОбластьДок["П033708"].Значение = ОбластьДок["П033703"].Значение;
	////Комунальные услуги
	ОбластьДок["П033908"].Значение = ОбластьДок["П033903"].Значение;
	ОбластьДок["П034008"].Значение = ОбластьДок["П034003"].Значение;
	ОбластьДок["П034108"].Значение = ОбластьДок["П034103"].Значение;
	ОбластьДок["П034208"].Значение = ОбластьДок["П034203"].Значение;
	ОбластьДок["П034308"].Значение = ОбластьДок["П034303"].Значение;
	ОбластьДок["П034408"].Значение = ОбластьДок["П034403"].Значение;
	ОбластьДок["П034508"].Значение = ОбластьДок["П034503"].Значение;
	ОбластьДок["П034608"].Значение = ОбластьДок["П034603"].Значение;
	ОбластьДок["П035108"].Значение = ОбластьДок["П035103"].Значение;
	
	//06.09.2019
	//08.05.2020
	//ОбластьДок["П033203"].Значение = ОбластьДок["П033303"].Значение + ОбластьДок["П033403"].Значение; 
	//ОбластьДок["П033204"].Значение = ОбластьДок["П033304"].Значение + ОбластьДок["П033404"].Значение;
	//ОбластьДок["П033207"].Значение = ОбластьДок["П033307"].Значение + ОбластьДок["П033407"].Значение;
	//ОбластьДок["П033208"].Значение = ОбластьДок["П033308"].Значение + ОбластьДок["П033408"].Значение;
	//
	ОбластьДок["П033203"].Значение = ОбластьДок["П033403"].Значение + ОбластьДок["П033703"].Значение + ОбластьДок["П033303"].Значение; 
	
	ОбластьДок["П033204"].Значение = ОбластьДок["П033404"].Значение;
	ОбластьДок["П033207"].Значение = ОбластьДок["П033407"].Значение;
	ОбластьДок["П033208"].Значение = ОбластьДок["П033408"].Значение;



	ОбластьДок["П033803"].Значение = ОбластьДок["П033903"].Значение + ОбластьДок["П034003"].Значение +
	                                 ОбластьДок["П034103"].Значение + ОбластьДок["П034203"].Значение + 
									 ОбластьДок["П034303"].Значение + ОбластьДок["П034603"].Значение +
									 ОбластьДок["П034703"].Значение + ОбластьДок["П034903"].Значение + 
	                                 ОбластьДок["П035003"].Значение + ОбластьДок["П035103"].Значение; 	
	
									 
	ОбластьДок["П033804"].Значение = ОбластьДок["П033904"].Значение + ОбластьДок["П034004"].Значение +
	                                 ОбластьДок["П034104"].Значение + ОбластьДок["П034204"].Значение + 
									 ОбластьДок["П034304"].Значение + ОбластьДок["П034604"].Значение +
									 ОбластьДок["П034704"].Значение + ОбластьДок["П034904"].Значение + 
	                                 ОбластьДок["П035004"].Значение + ОбластьДок["П035104"].Значение; 	
									 
    ОбластьДок["П033807"].Значение = ОбластьДок["П033907"].Значение + ОбластьДок["П034007"].Значение +
	                                 ОбластьДок["П034107"].Значение + ОбластьДок["П034207"].Значение + 
									 ОбластьДок["П034307"].Значение + ОбластьДок["П034607"].Значение +
									 ОбластьДок["П034707"].Значение + ОбластьДок["П034907"].Значение + 
	                                 ОбластьДок["П035007"].Значение + ОбластьДок["П035107"].Значение; 	
									 
    ОбластьДок["П033808"].Значение = ОбластьДок["П033908"].Значение + ОбластьДок["П034008"].Значение +
	                                 ОбластьДок["П034108"].Значение + ОбластьДок["П034208"].Значение + 
									 ОбластьДок["П034308"].Значение + ОбластьДок["П034608"].Значение +
									 ОбластьДок["П034708"].Значение + ОбластьДок["П034908"].Значение + 
	                                 ОбластьДок["П035008"].Значение + ОбластьДок["П035108"].Значение; 										 									 
									 
    ОбластьДок["П035203"].Значение = ОбластьДок["П033203"].Значение + ОбластьДок["П033703"].Значение +
	                                 ОбластьДок["П033803"].Значение;
									 
    ОбластьДок["П035204"].Значение = ОбластьДок["П033204"].Значение + ОбластьДок["П033704"].Значение +
	                                 ОбластьДок["П033804"].Значение;
									 
    ОбластьДок["П035207"].Значение = ОбластьДок["П033207"].Значение + ОбластьДок["П033707"].Значение +
	                                 ОбластьДок["П033807"].Значение;
									 
	ОбластьДок["П035208"].Значение = ОбластьДок["П033208"].Значение + ОбластьДок["П033708"].Значение +
	                                 ОбластьДок["П033808"].Значение;						 
									 

		
	//Площадь и Число проживающих
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Здание,
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КоличествоПроживающих
	|ПОМЕСТИТЬ СписокПроживающих
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент = ИСТИНА
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания <> ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга КАК Услуга,
	|	МАКСИМУМ(бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Норма + бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.СверхНорма) КАК ЖилищныйФонд
	|ПОМЕСТИТЬ ВТ_ОбщаяПлощадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОНормативахНачисленийЗакрытогоПериода.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК КомунальнаяПлощадь
	|ПОМЕСТИТЬ ВТ_ОбщаяКомунальнаяПлощадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.Квартира
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
	|	СписокПроживающих.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВТ_ЛицевыеСчета.Здание,
	|	МАКСИМУМ(ВТ_ОбщаяПлощадь.ЖилищныйФонд) КАК ЖилищныйФонд,
	|	МАКСИМУМ(ВТ_ОбщаяКомунальнаяПлощадь.КомунальнаяПлощадь) КАК КомунальнаяПлощадь
	|ПОМЕСТИТЬ УслугиГЦЖС
	|ИЗ
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокПроживающих КАК СписокПроживающих
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = СписокПроживающих.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|			ПО ВТ_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяКомунальнаяПлощадь КАК ВТ_ОбщаяКомунальнаяПлощадь
	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_ОбщаяКомунальнаяПлощадь.Квартира
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяПлощадь КАК ВТ_ОбщаяПлощадь
	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ОбщаяПлощадь.ЛицевойСчет
	|			И ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = ВТ_ОбщаяПлощадь.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
	|	СписокПроживающих.КоличествоПроживающих,
	|	ВТ_ЛицевыеСчета.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования)
	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ОбщиеПлощади
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|		ПО ВТ_ЛицевыеСчета.Здание = бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ГДЕ
	|	(бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|			ИЛИ бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Здание
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ШаблоныУслугСрезПоследних.Здание КАК Здание,
	|	бит_ШаблоныУслугСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_ШаблоныУслуг
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			,
	|			Здание В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					УслугиГЦЖС.Здание
	|				ИЗ
	|					УслугиГЦЖС КАК УслугиГЦЖС)) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Здание,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ШаблоныУслуг.Здание КАК Здание,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ПредварительноОбщиеПлощади
	|ИЗ
	|	ВТ_ШаблоныУслуг КАК ВТ_ШаблоныУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_ШаблоныУслуг.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощади КАК ВТ_ОбщиеПлощади
	|		ПО ВТ_ШаблоныУслуг.Здание = ВТ_ОбщиеПлощади.Здание
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ШаблоныУслуг.Здание,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ПОМЕСТИТЬ ВТ_ОбщиеПлощадиИтог
	|ИЗ
	|	ВТ_ПредварительноОбщиеПлощади КАК ВТ_ПредварительноОбщиеПлощади
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	УслугиГЦЖС.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
	|	УслугиГЦЖС.ТипПлиты КАК ТипПлиты,
	|	СУММА(УслугиГЦЖС.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	СУММА(УслугиГЦЖС.ЖилищныйФонд) КАК ЖилищныйФонд,
	|	СУММА(УслугиГЦЖС.КомунальнаяПлощадь) КАК КомунальнаяПлощадь,
	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
	|ИЗ
	|	УслугиГЦЖС КАК УслугиГЦЖС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощадиИтог КАК ВТ_ОбщиеПлощадиИтог
	|		ПО УслугиГЦЖС.ГрафаОтчетаГЦЖС = ВТ_ОбщиеПлощадиИтог.ГрафаОтчетаГЦЖС
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС,
	|	УслугиГЦЖС.ВидБлагоустройстваЗданий,
	|	УслугиГЦЖС.ТипПлиты
	|ИТОГИ
	|	СУММА(КоличествоПроживающих),
	|	СУММА(ЖилищныйФонд),
	|	СУММА(КомунальнаяПлощадь),
	|	МАКСИМУМ(ОбщаяПлощадьЖилогоЗдания),
	|	МАКСИМУМ(ОбщаяПлощадьМестОбщегоПользования)
	|ПО
	|	ГрафаОтчетаГЦЖС,
	|	ВидБлагоустройстваЗданий,
	|	ТипПлиты";
	// БИТ_ЖКХ 24.11.2015 9:51:23 Конец правки. 
	
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГЦЖС.Следующий() Цикл
	 // БИТ ЖКХ 28.04.2020
	 попытка
		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
            //Раздел 3
			ОбластьДок["П033910"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П033911"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				//ОбластьДок["П045608"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			КонецЕсли;	
		
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
            //Раздел 3
			ОбластьДок["П034010"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034011"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
            //Раздел 3
			ОбластьДок["П034110"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
			////Раздел 3
			ОбластьДок["П034210"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034211"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			//// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
			  ОбластьДок["П045407"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
			КонецЕсли;	
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
            //Раздел 3
			ОбластьДок["П034310"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034311"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			//Суммируем данные по типам плит
			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТипПлиты.Следующий() Цикл
					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
						ОбластьДок["П034410"].Значение = ОбластьДок["П034410"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
//						ОбластьДок["П034411"].Значение = ОбластьДок["П034411"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
						ОбластьДок["П034510"].Значение = ОбластьДок["П034510"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
//						ОбластьДок["П034511"].Значение = ОбластьДок["П034511"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			// Справочно (Раз в год)
			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
				ОбластьДок["П045306"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьМестОбщегоПользования;
				ОбластьДок["П045307"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
			КонецЕсли;	
	
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
            //Раздел 3
			ОбластьДок["П034610"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
			//ОбластьДок["П034611"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;

		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда
            //Раздел 3
			ОбластьДок["П033310"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П033311"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда
            //Раздел 3
			ОбластьДок["П033410"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П033411"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			//ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
					ОбластьДок["П033510"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
//					ОбластьДок["П033511"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
					ОбластьДок["П033610"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
//					ОбластьДок["П033611"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
            //Раздел 3
			ОбластьДок["П035110"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П035111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
			
		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
            //Раздел 3
			ОбластьДок["П033710"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
			//ОбластьДок["П033711"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
		КонецЕсли;
	 исключение
	 конецпопытки;	
	КонецЦикла; 
	
	
	// Справочно (Раз в год)
	Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
		ОбластьДок["П045405"].Значение = ОбластьДок["П034210"].Значение;
	//	ОбластьДок["П045308"].Значение = ОбластьДок["П034311"].Значение;
	//	ОбластьДок["П045508"].Значение = ОбластьДок["П033911"].Значение;
	//	ОбластьДок["П045708"].Значение = ОбластьДок["П034611"].Значение;
	КонецЕсли;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	
Конецпроцедуры  // ЗаполнитьДокумент_Ф22()

//20.11.2019 
Функция ПолучитьДополнительныеСуммы()

	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|бит_ЛицевыеСчета.Квартира КАК Квартира,
	|бит_ЛицевыеСчета.Здание КАК Здание
|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
|ИЗ
|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
|ГДЕ
|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
|
|ИНДЕКСИРОВАТЬ ПО
|	ЛицевойСчет
|;
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
|ИЗ
|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
|			&КонецПериода,
|			ЛицевойСчет В
|				(ВЫБРАТЬ
|					ВТ_ЛицевыеСчета.ЛицевойСчет
|				ИЗ
|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
|ГДЕ
|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
|
|ИНДЕКСИРОВАТЬ ПО
|	ЛицевойСчет
|;
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты
|ПОМЕСТИТЬ ВТ_бит_СведенияОКвартиреСрезПоследних
|ИЗ
|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
|			&КонецПериода,
|			Квартира В
|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
|					ВТ_ЛицевыеСчета.Квартира
|				ИЗ
|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
|
|ИНДЕКСИРОВАТЬ ПО
|	бит_СведенияОКвартиреСрезПоследних.Квартира
|;
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
|	ВТ_ЛицевыеСчета.Квартира КАК Квартира,
|	ВТ_бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
|	ВТ_ЛицевыеСчета.Здание КАК Здание
|ПОМЕСТИТЬ ПоставщикиИУслуги
|ИЗ
|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_бит_СведенияОКвартиреСрезПоследних КАК ВТ_бит_СведенияОКвартиреСрезПоследних
|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_бит_СведенияОКвартиреСрезПоследних.Квартира
|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
|
|ИНДЕКСИРОВАТЬ ПО
|	ЛицевойСчет,
|	Услуга
|;
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
|	СУММА(ВЫБОР
|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
|		КОНЕЦ) КАК Начисления,
|	СУММА(ВЫБОР
|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
|		КОНЕЦ) КАК Разовые,
|	СУММА(ВЫБОР
|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
|				ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
|		КОНЕЦ) КАК Оплата
|ПОМЕСТИТЬ Обороты
|ИЗ
|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
|			&НачалоПериода,
|			&КонецПериода,
|			Регистратор,
|			(ЛицевойСчет, УслугаЖКХ) В
|				(ВЫБРАТЬ
|					ПоставщикиИУслуги.ЛицевойСчет,
|					ПоставщикиИУслуги.Услуга
|				ИЗ
|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОбороты
|
|СГРУППИРОВАТЬ ПО
|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
|
|ИНДЕКСИРОВАТЬ ПО
|	ЛицевойСчет,
|	УслугаЖКХ
|;
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
|ПОМЕСТИТЬ Остатки
|ИЗ
|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
|			&НачалоПериода,
|			&КонецПериода,
|			,
|			,
|			(ЛицевойСчет, УслугаЖКХ) В
|				(ВЫБРАТЬ
|					ПоставщикиИУслуги.ЛицевойСчет,
|					ПоставщикиИУслуги.Услуга
|				ИЗ
|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
|
|ИНДЕКСИРОВАТЬ ПО
|	ЛицевойСчет,
|	УслугаЖКХ
|;
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем,
|	СУММА(ВЫБОР
|			КОГДА (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
|					ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
|			ИНАЧЕ 0
|		КОНЕЦ) КАК ОбъемИнд,
|	СУММА(ВЫБОР
|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
|			ИНАЧЕ 0
|		КОНЕЦ) КАК ОбъемОбщеДом,
|	СУММА(ВЫБОР
|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
|			ИНАЧЕ 0
|		КОНЕЦ) КАК ОбъемРазовых
|ПОМЕСТИТЬ Объемы
|ИЗ
|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
|			&НачалоПериода,
|			&КонецПериода,
|			Регистратор,
|			(ЛицевойСчет, Услуга) В
|				(ВЫБРАТЬ
|					ПоставщикиИУслуги.ЛицевойСчет,
|					ПоставщикиИУслуги.Услуга
|				ИЗ
|					ПоставщикиИУслуги)) КАК бит_ОбъемыПоУслугамЖКХОбороты
|
|СГРУППИРОВАТЬ ПО
|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
|
|ИНДЕКСИРОВАТЬ ПО
|	ЛицевойСчет,
|	Услуга
|;
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
|	ПоставщикиИУслуги.Услуга КАК Услуга,
|	ПоставщикиИУслуги.Здание КАК Здание,
|	ПоставщикиИУслуги.ТипПлиты КАК ТипПлиты,
|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем,
|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0) КАК ОбъемРазовых,
|	ЕСТЬNULL(Объемы.ОбъемИнд, 0) КАК ОбъемИнд,
|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0) КАК ОбъемОбщеДом,
|	СУММА(ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток,
|	СУММА(ЕСТЬNULL(Обороты.Начисления, 0)) КАК Начисления,
|	СУММА(ЕСТЬNULL(Обороты.Оплата, 0)) КАК Оплата,
|	СУММА(ЕСТЬNULL(Обороты.Разовые, 0)) КАК Разовые,
|	ПоставщикиИУслуги.Услуга.ГрафаОтчетаГЦЖС КАК УслугаГрафаОтчетаГЦЖС,
|	ПоставщикиИУслуги.Услуга.ОбщедомовыеНачисления КАК УслугаОбщедомовыеНачисления
|ИЗ
|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
|		ПО (ПоставщикиИУслуги.ЛицевойСчет = Обороты.ЛицевойСчет)
|			И (ПоставщикиИУслуги.Услуга = Обороты.УслугаЖКХ)
|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
|		ПО (ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет)
|			И (ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ)
|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
|		ПО (ПоставщикиИУслуги.Услуга = Объемы.Услуга)
|			И (ПоставщикиИУслуги.ЛицевойСчет = Объемы.ЛицевойСчет)
|
|СГРУППИРОВАТЬ ПО
|	ПоставщикиИУслуги.Услуга,
|	ПоставщикиИУслуги.ЛицевойСчет,
|	ПоставщикиИУслуги.Здание,
|	ПоставщикиИУслуги.ТипПлиты,
|	ЕСТЬNULL(Объемы.Объем, 0),
|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0),
|	ЕСТЬNULL(Объемы.ОбъемИнд, 0),
|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0)";
	
	запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Дата));
	запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
	запрос.УстановитьПараметр("Организация",   Организация);


	таб = запрос.Выполнить().Выгрузить();
	
	структураВозврата = Новый Структура();
	НачисленияТехОбслуживанияНаймОДН = 0;
	ОплатаТехОбслуживанияНаймОДН = 0;

	НачисленияТехОбслуживанияНайм = 0;
	ОплатаТехОбслуживанияНайм = 0;

	НачисленияКапРемонт = 0;
	СуммаКонечныйОстатокКапРемонт = 0;
	ОплатаКапРемонт = 0;

	таблицаСумм = таб.Скопировать();
	таблицаСумм.Свернуть("УслугаГрафаОтчетаГЦЖС, УслугаОбщедомовыеНачисления", "Объем, Начисления, Оплата, СуммаКонечныйОстаток");
	
	Отбор = Новый Структура();
	Отбор.Вставить("УслугаОбщедомовыеНачисления", истина);
	Отбор.Вставить("УслугаГрафаОтчетаГЦЖС", Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание);	
	НайденныеСтроки = таблицаСумм.НайтиСтроки(Отбор);
	если ЗначениеЗаполнено(НайденныеСтроки) = истина тогда
	 НачисленияТехОбслуживанияНаймОДН = НайденныеСтроки[0].Начисления;
	 ОстатокТехОбслуживанияНаймОДН = НайденныеСтроки[0].СуммаКонечныйОстаток;
	 ОплатаТехОбслуживанияНаймОДН = НайденныеСтроки[0].Оплата;
	 // БИТ ЖКХ 23.04.2020
	иначе
	  НачисленияТехОбслуживанияНаймОДН = 0;
	  ОстатокТехОбслуживанияНаймОДН = 0;
	конецесли; 
	
	Отбор.Вставить("УслугаОбщедомовыеНачисления", истина);
	Отбор.Вставить("УслугаГрафаОтчетаГЦЖС", Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм);	
	НайденныеСтроки = таблицаСумм.НайтиСтроки(Отбор);
	если ЗначениеЗаполнено(НайденныеСтроки) = истина тогда
     НачисленияТехОбслуживанияНаймОДН = НачисленияТехОбслуживанияНаймОДН + НайденныеСтроки[0].Начисления;
	 ОстатокТехОбслуживанияНаймОДН = ОстатокТехОбслуживанияНаймОДН + НайденныеСтроки[0].СуммаКонечныйОстаток;
	 ОплатаТехОбслуживанияНаймОДН = ОплатаТехОбслуживанияНаймОДН + НайденныеСтроки[0].Оплата; 
	конецесли; 
	структураВозврата.Вставить("НачисленияТехОбслуживанияНаймОДН", НачисленияТехОбслуживанияНаймОДН);
	структураВозврата.Вставить("ОстатокТехОбслуживанияНаймОДН", ОстатокТехОбслуживанияНаймОДН);
	
	Отбор = Новый Структура();
	Отбор.Вставить("УслугаОбщедомовыеНачисления", ложь);
	Отбор.Вставить("УслугаГрафаОтчетаГЦЖС", Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание);	
	НайденныеСтроки = таблицаСумм.НайтиСтроки(Отбор);
	если ЗначениеЗаполнено(НайденныеСтроки) = истина тогда
	 НачисленияТехОбслуживанияНайм = НайденныеСтроки[0].Начисления;
	 ОстатокТехОбслуживанияНайм = НайденныеСтроки[0].СуммаКонечныйОстаток;
	 ОплатаТехОбслуживанияНайм = НайденныеСтроки[0].Оплата;
	конецесли; 
	
	Отбор.Вставить("УслугаОбщедомовыеНачисления", ложь);
	Отбор.Вставить("УслугаГрафаОтчетаГЦЖС", Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм);	
	НайденныеСтроки = таблицаСумм.НайтиСтроки(Отбор);
	если ЗначениеЗаполнено(НайденныеСтроки) тогда
     НачисленияТехОбслуживанияНайм = НачисленияТехОбслуживанияНайм + НайденныеСтроки[0].Начисления;
	 ОстатокТехОбслуживанияНайм = ОстатокТехОбслуживанияНайм + НайденныеСтроки[0].СуммаКонечныйОстаток;
	 ОплатаТехОбслуживанияНайм = ОплатаТехОбслуживанияНайм + НайденныеСтроки[0].Оплата; 
	конецесли; 
	структураВозврата.Вставить("НачисленияТехОбслуживанияНайм", НачисленияТехОбслуживанияНайм);
    структураВозврата.Вставить("ОстатокТехОбслуживанияНайм", ОстатокТехОбслуживанияНайм);

	
	Отбор = Новый Структура();
	Отбор.Вставить("УслугаГрафаОтчетаГЦЖС", Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт);
	НайденныеСтроки = таблицаСумм.НайтиСтроки(Отбор);
	// БИТ ЖКХ 23.04.2020	
	если ЗначениеЗаполнено(НайденныеСтроки) тогда		
	    структураВозврата.Вставить("НачисленияКапРемонт", НайденныеСтроки[0].Начисления);
		структураВозврата.Вставить("СуммаКонечныйОстатокКапРемонт", НайденныеСтроки[0].СуммаКонечныйОстаток);
	    структураВозврата.Вставить("ОплатаКапРемонт", НайденныеСтроки[0].Оплата);
	иначе
		структураВозврата.Вставить("НачисленияКапРемонт", 0);
		структураВозврата.Вставить("СуммаКонечныйОстатокКапРемонт", 0);
	    структураВозврата.Вставить("ОплатаКапРемонт", 0);
	конецесли;

	Отбор = Новый Структура();
	Отбор.Вставить("УслугаГрафаОтчетаГЦЖС", Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПустаяСсылка());
	НайденныеСтроки = таблицаСумм.НайтиСтроки(Отбор);
	// БИТ ЖКХ 20.04.2020
	если ЗначениеЗаполнено(НайденныеСтроки) тогда
     структураВозврата.Вставить("НачисленияПрочие", НайденныеСтроки[0].Начисления);
	иначе 
     структураВозврата.Вставить("НачисленияПрочие", 0);
	конецесли;	
    возврат структураВозврата;
КонецФункции // ПолучитьСуммуОДН()


// БИТ_ЖКХ 05.05.2017 14:24:00 Начало правки...  Проверка модулей (не используется). 
//// Заполняет указанный табличный документ по форме №22 2015Кв1 по данным.
//// В указанной структуре параметров.
//Процедура ЗаполнитьДокумент_Ф22_2015Кв1(ДокументРезультат, СведенияОбОрганизации)
//	
//	// БИТ_ЖКХ 27.10.2015 12:59:43 Начало правки... 
//	Макет = ПолучитьМакет("Форма22_2015Кв1");
//	ДокументРезультат.Вывести(Макет);
//	
//	// ОсновнаяЧасть1а
//	ДокументРезультат.Области.ПериодОтчета.Значение = "за январь - "
//		+ НРег(Формат(Дата, "ДФ = 'ММММ гггг'")) + " г.";
//															
//	// ПолеНомерКорректировки.
//	
//	// ОсновнаяЧасть1б
//	ДокументРезультат.Области.ОргНазв.Значение	  = СведенияОбОрганизации["Наименование"];
//	ДокументРезультат.Области.ОргАдрес.Значение	  = СведенияОбОрганизации["Адрес"];
//	ДокументРезультат.Области.ОргКодОКПО.Значение = СведенияОбОрганизации["КодПоОКПО"];
//	
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
//	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
//	|	бит_ЛицевыеСчета.Здание КАК Здание
//	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
//	|ИЗ
//	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
//	|ГДЕ
//	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
//	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
//	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
//	|ИЗ
//	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
//	|			&КонецПериода,
//	|			ЛицевойСчет В
//	|				(ВЫБРАТЬ
//	|					ВТ_ЛицевыеСчета.ЛицевойСчет
//	|				ИЗ
//	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
//	|ГДЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
//	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты
//	|ПОМЕСТИТЬ ВТ_бит_СведенияОКвартиреСрезПоследних
//	|ИЗ
//	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
//	|			&КонецПериода,
//	|			Квартира В
//	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|					ВТ_ЛицевыеСчета.Квартира
//	|				ИЗ
//	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	бит_СведенияОКвартиреСрезПоследних.Квартира
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
//	|	ВТ_ЛицевыеСчета.Квартира,
//	|	ВТ_бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
//	|	ВТ_ЛицевыеСчета.Здание
//	|ПОМЕСТИТЬ ПоставщикиИУслуги
//	|ИЗ
//	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_бит_СведенияОКвартиреСрезПоследних КАК ВТ_бит_СведенияОКвартиреСрезПоследних
//	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_бит_СведенияОКвартиреСрезПоследних.Квартира
//	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	Услуга
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Начисления,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
//	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Разовые,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
//	|				ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Оплата
//	|ПОМЕСТИТЬ Обороты
//	|ИЗ
//	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
//	|			&НачалоПериода,
//	|			&КонецПериода,
//	|			Регистратор,
//	|			(ЛицевойСчет, УслугаЖКХ) В
//	|				(ВЫБРАТЬ
//	|					ПоставщикиИУслуги.ЛицевойСчет,
//	|					ПоставщикиИУслуги.Услуга
//	|				ИЗ
//	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОбороты
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	УслугаЖКХ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
//	|ПОМЕСТИТЬ Остатки
//	|ИЗ
//	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
//	|			&НачалоПериода,
//	|			&КонецПериода,
//	|			,
//	|			,
//	|			(ЛицевойСчет, УслугаЖКХ) В
//	|				(ВЫБРАТЬ
//	|					ПоставщикиИУслуги.ЛицевойСчет,
//	|					ПоставщикиИУслуги.Услуга
//	|				ИЗ
//	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	УслугаЖКХ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
//	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем,
//	|	СУММА(ВЫБОР
//	|			КОГДА (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|					ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
//	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
//	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК ОбъемИнд,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//	|					ИЛИ (бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|						ИЛИ бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
//	|						И бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
//	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК ОбъемОбщеДом,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
//	|					И НЕ бит_ОбъемыПоУслугамЖКХОбороты.Услуга.ОбщедомовыеНачисления
//	|				ТОГДА бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК ОбъемРазовых
//	|ПОМЕСТИТЬ Объемы
//	|ИЗ
//	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
//	|			&НачалоПериода,
//	|			&КонецПериода,
//	|			Регистратор,
//	|			(ЛицевойСчет, Услуга) В
//	|				(ВЫБРАТЬ
//	|					ПоставщикиИУслуги.ЛицевойСчет,
//	|					ПоставщикиИУслуги.Услуга
//	|				ИЗ
//	|					ПоставщикиИУслуги)) КАК бит_ОбъемыПоУслугамЖКХОбороты
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
//	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	Услуга
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
//	|	ПоставщикиИУслуги.Услуга КАК Услуга,
//	|	ПоставщикиИУслуги.Здание КАК Здание,
//	|	ПоставщикиИУслуги.ТипПлиты КАК ТипПлиты,
//	|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем,
//	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0) КАК ОбъемРазовых,
//	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0) КАК ОбъемИнд,
//	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0) КАК ОбъемОбщеДом,
//	|	СУММА(ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток,
//	|	СУММА(ЕСТЬNULL(Обороты.Начисления, 0)) КАК Начисления,
//	|	СУММА(ЕСТЬNULL(Обороты.Оплата, 0)) КАК Оплата,
//	|	СУММА(ЕСТЬNULL(Обороты.Разовые, 0)) КАК Разовые
//	|ПОМЕСТИТЬ ИтоговаяТаб
//	|ИЗ
//	|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
//	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Обороты.ЛицевойСчет
//	|			И ПоставщикиИУслуги.Услуга = Обороты.УслугаЖКХ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
//	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет
//	|			И ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
//	|		ПО ПоставщикиИУслуги.Услуга = Объемы.Услуга
//	|			И ПоставщикиИУслуги.ЛицевойСчет = Объемы.ЛицевойСчет
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПоставщикиИУслуги.Услуга,
//	|	ПоставщикиИУслуги.ЛицевойСчет,
//	|	ПоставщикиИУслуги.Здание,
//	|	ПоставщикиИУслуги.ТипПлиты,
//	|	ЕСТЬNULL(Объемы.Объем, 0),
//	|	ЕСТЬNULL(Объемы.ОбъемРазовых, 0),
//	|	ЕСТЬNULL(Объемы.ОбъемИнд, 0),
//	|	ЕСТЬNULL(Объемы.ОбъемОбщеДом, 0)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	Услуга,
//	|	Здание
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ПоставщикиИУслуги
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Обороты
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Остатки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Объемы
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
//	|	бит_СписокЗданий.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
//	|	ИтоговаяТаб.ТипПлиты КАК ТипПлиты,
//	|	СУММА(ИтоговаяТаб.Объем) КАК Объем,
//	|	СУММА(ИтоговаяТаб.ОбъемРазовых) КАК ОбъемРазовых,
//	|	СУММА(ИтоговаяТаб.ОбъемИнд) КАК ОбъемИнд,
//	|	СУММА(ИтоговаяТаб.ОбъемОбщеДом) КАК ОбъемОбщеДом,
//	|	СУММА(ИтоговаяТаб.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
//	|	СУММА(ИтоговаяТаб.Начисления) КАК Начисления,
//	|	СУММА(ИтоговаяТаб.Оплата) КАК Оплата,
//	|	СУММА(ИтоговаяТаб.Разовые) КАК Разовые
//	|ИЗ
//	|	ИтоговаяТаб КАК ИтоговаяТаб
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
//	|		ПО ИтоговаяТаб.Услуга = бит_УслугиЖКХ.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
//	|		ПО ИтоговаяТаб.Здание = бит_СписокЗданий.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
//	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
//	|	ИтоговаяТаб.ТипПлиты
//	|ИТОГИ
//	|	СУММА(Объем),
//	|	СУММА(ОбъемРазовых),
//	|	СУММА(ОбъемИнд),
//	|	СУММА(ОбъемОбщеДом),
//	|	СУММА(СуммаКонечныйОстаток),
//	|	СУММА(Начисления),
//	|	СУММА(Оплата),
//	|	СУММА(Разовые)
//	|ПО
//	|	ГрафаОтчетаГЦЖС,
//	|	ВидБлагоустройстваЗданий,
//	|	ТипПлиты
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ИтоговаяТаб";
//	
//	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Дата));
//	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
//	Запрос.УстановитьПараметр("Организация",   Организация);
//	
//	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	ОбластьДок = ДокументРезультат.Области;
//	
//	Пока ВыборкаГЦЖС.Следующий() Цикл
//		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
//			// Раздел1
//			ОбластьДок["П000001000103"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			ОбластьДок["П000001000203"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			// Раздел2 
//			ОбластьДок["П000002000904"].Значение = ОбластьДок["П000002000904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003104"].Значение = ОбластьДок["П000002003104"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
//			// Раздел3
//			ОбластьДок["П000003004703"].Значение = ОбластьДок["П000003004703"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
//			ОбластьДок["П000003004704"].Значение = ОбластьДок["П000003004704"].Значение +  ВыборкаГЦЖС.Оплата;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006303"].Значение = ВыборкаГЦЖС.ОбъемИнд;
//			КонецЕсли;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда	
//			// Раздел1
//			ОбластьДок["П000001000104"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			ОбластьДок["П000001000204"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			// Раздел2 
//			ОбластьДок["П000002000904"].Значение = ОбластьДок["П000002000904"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003104"].Значение = ОбластьДок["П000002003104"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Водоснабжение
//			// Раздел3
//			ОбластьДок["П000003004703"].Значение = ОбластьДок["П000003004703"].Значение +  ВыборкаГЦЖС.Начисления; //Водоснабжение
//			ОбластьДок["П000003004704"].Значение = ОбластьДок["П000003004704"].Значение +  ВыборкаГЦЖС.Оплата;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006403"].Значение = ВыборкаГЦЖС.ОбъемИнд;
//			КонецЕсли;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
//			// Раздел1
//			ОбластьДок["П000001000105"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			ОбластьДок["П000001000205"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			// Раздел2
//			ОбластьДок["П000002000905"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003105"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
//			// Раздел3
//			ОбластьДок["П000003004803"].Значение = ВыборкаГЦЖС.Начисления;
//			ОбластьДок["П000003004804"].Значение = ВыборкаГЦЖС.Оплата;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
//			// Раздел1
//			ОбластьДок["П000001000106"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			ОбластьДок["П000001000206"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			// Раздел2
//			ОбластьДок["П000002000906"].Значение = ОбластьДок["П000002000906"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003106"].Значение = ОбластьДок["П000002003106"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
//			// Раздел3
//			ОбластьДок["П000003005003"].Значение = ВыборкаГЦЖС.Начисления;
//			ОбластьДок["П000003005004"].Значение = ВыборкаГЦЖС.Оплата;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006203"].Значение = ОбластьДок["П000004006203"].Значение + ВыборкаГЦЖС.ОбъемИнд;  // БИТ_ЖКХ 24.11.2015 10:54:05 
//			КонецЕсли;
//		
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
//			// Раздел1
//			ОбластьДок["П000001000107"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			ОбластьДок["П000001000207"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			// Раздел2
//			ОбластьДок["П000002000906"].Значение = ОбластьДок["П000002000906"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003106"].Значение = ОбластьДок["П000002003106"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Теплоснабжение 
//			// Раздел3
//			ОбластьДок["П000003004903"].Значение = ВыборкаГЦЖС.Начисления;
//			ОбластьДок["П000003004904"].Значение = ВыборкаГЦЖС.Оплата;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006203"].Значение = ОбластьДок["П000004006203"].Значение + ВыборкаГЦЖС.ОбъемИнд;  // БИТ_ЖКХ 24.11.2015 10:54:07 
//			КонецЕсли;
//		
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
//			// Раздел1
//			ОбластьДок["П000001000108"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			ОбластьДок["П000001000208"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			// Раздел2
//			ОбластьДок["П000002000907"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003107"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
//			// Раздел3
//			ОбластьДок["П000003005103"].Значение = ВыборкаГЦЖС.Начисления;
//			ОбластьДок["П000003005104"].Значение = ВыборкаГЦЖС.Оплата;
//			//Суммируем данные по типам плит
//			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
//				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//				Пока ВыборкаТипПлиты.Следующий() Цикл
//					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
//						ОбластьДок["П000003005203"].Значение = ОбластьДок["П000003005203"].Значение + ВыборкаТипПлиты.Начисления;
//						ОбластьДок["П000003005204"].Значение = ОбластьДок["П000003005204"].Значение + ВыборкаТипПлиты.Оплата;
//					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
//						ОбластьДок["П000003005303"].Значение = ОбластьДок["П000003005303"].Значение + ВыборкаТипПлиты.Начисления;
//						ОбластьДок["П000003005304"].Значение = ОбластьДок["П000003005304"].Значение + ВыборкаТипПлиты.Оплата;
//					КонецЕсли;	
//				КонецЦикла;
//			КонецЦикла;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006103"].Значение = ВыборкаГЦЖС.ОбъемИнд;
//				ОбластьДок["П000004006104"].Значение = ВыборкаГЦЖС.ОбъемОбщеДом;
//			КонецЕсли;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
//			// Раздел1
//			ОбластьДок["П000001000109"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			ОбластьДок["П000001000209"].Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			// Раздел2
//			ОбластьДок["П000002000908"].Значение = ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003108"].Значение = ВыборкаГЦЖС.СуммаКонечныйОстаток;
//			// Раздел3
//			ОбластьДок["П000003005403"].Значение = ВыборкаГЦЖС.Начисления;
//			ОбластьДок["П000003005404"].Значение = ВыборкаГЦЖС.Оплата;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006503"].Значение = ВыборкаГЦЖС.ОбъемИнд;
//			КонецЕсли;
//		
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
//			//// Раздел1
//			//ДокументРезультат.Области.П000001000111.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			//ДокументРезультат.Области.П000001000211.Значение = ВыборкаГЦЖС.Объем + ?(СУчетомРазовых, ВыборкаГЦЖС.ОбъемРазовых, 0);
//			//Раздел2 
//			ОбластьДок["П000002000903"].Значение = ОбластьДок["П000002000903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003103"].Значение = ОбластьДок["П000002003103"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
//			//Раздел 3
//			ОбластьДок["П000003004403"].Значение = ВыборкаГЦЖС.Начисления; 
//			ОбластьДок["П000003004103"].Значение = ОбластьДок["П000003004103"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
//			ОбластьДок["П000003004404"].Значение = ВыборкаГЦЖС.Оплата;
//			ОбластьДок["П000003004104"].Значение = ОбластьДок["П000003004104"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
//			
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
//			// Раздел2 
//			ОбластьДок["П000002000903"].Значение = ОбластьДок["П000002000903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003103"].Значение = ОбластьДок["П000002003103"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
//			// Раздел 3
//			ОбластьДок["П000003004503"].Значение = ВыборкаГЦЖС.Начисления;
//			ОбластьДок["П000003004103"].Значение = ОбластьДок["П000003004103"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
//			ОбластьДок["П000003004504"].Значение = ВыборкаГЦЖС.Оплата;
//			ОбластьДок["П000003004104"].Значение = ОбластьДок["П000003004104"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда	
//			// Раздел2 
//			ОбластьДок["П000002000903"].Значение = ОбластьДок["П000002000903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003103"].Значение = ОбластьДок["П000002003103"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
//			//Раздел 3
//			ОбластьДок["П000003004103"].Значение = ОбластьДок["П000003004103"].Значение + ВыборкаГЦЖС.Начисления; //Начислено
//			ОбластьДок["П000003004104"].Значение = ОбластьДок["П000003004104"].Значение + ВыборкаГЦЖС.Оплата; //ФактическиОплачено

//			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
//				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
//					ОбластьДок["П000003004203"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления;
//					ОбластьДок["П000003004204"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
//				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
//					ОбластьДок["П000003004303"].Значение = ВыборкаВидБлагоустройстваЗданий.Начисления; //Строка 43
//					ОбластьДок["П000003004304"].Значение = ВыборкаВидБлагоустройстваЗданий.Оплата;
//				КонецЕсли;
//			КонецЦикла;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда	
//			// Раздел2 
//			ОбластьДок["П000002000903"].Значение = ОбластьДок["П000002000903"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003103"].Значение = ОбластьДок["П000002003103"].Значение + ВыборкаГЦЖС.СуммаКонечныйОстаток; //Жилищные
//			//Раздел 3
//			ОбластьДок["П000003004003"].Значение = ВыборкаГЦЖС.Начисления;
//			ОбластьДок["П000003004004"].Значение = ВыборкаГЦЖС.Оплата;
//			
//		Иначе
//			// Раздел2 
//			ОбластьДок["П000002000911"].Значение = ОбластьДок["П000002000911"].Значение + ВыборкаГЦЖС.Начисления + ?(СУчетомРазовых, ВыборкаГЦЖС.Разовые, 0);
//			// Дебиторская задолженность
//			ОбластьДок["П000002003111"].Значение = ОбластьДок["П000002003111"].Значение +  ВыборкаГЦЖС.СуммаКонечныйОстаток; //Прочие
//		КонецЕсли;
//		
//	КонецЦикла;
//	// тыс. руб
//	ОбластьДок["П000002000903"].Значение = ОбластьДок["П000002000903"].Значение/1000;
//	ОбластьДок["П000002000904"].Значение = ОбластьДок["П000002000904"].Значение/1000;
//	ОбластьДок["П000002000905"].Значение = ОбластьДок["П000002000905"].Значение/1000;
//	ОбластьДок["П000002000906"].Значение = ОбластьДок["П000002000906"].Значение/1000;
//	ОбластьДок["П000002000907"].Значение = ОбластьДок["П000002000907"].Значение/1000;
//	ОбластьДок["П000002000908"].Значение = ОбластьДок["П000002000908"].Значение/1000;
//	ОбластьДок["П000002000911"].Значение = ОбластьДок["П000002000911"].Значение/1000;
//	ОбластьДок["П000002003103"].Значение = ОбластьДок["П000002003103"].Значение/1000;
//	ОбластьДок["П000002003104"].Значение = ОбластьДок["П000002003104"].Значение/1000;
//	ОбластьДок["П000002003105"].Значение = ОбластьДок["П000002003105"].Значение/1000;
//	ОбластьДок["П000002003106"].Значение = ОбластьДок["П000002003106"].Значение/1000;
//	ОбластьДок["П000002003107"].Значение = ОбластьДок["П000002003107"].Значение/1000;
//	ОбластьДок["П000002003108"].Значение = ОбластьДок["П000002003108"].Значение/1000;
//	ОбластьДок["П000002003111"].Значение = ОбластьДок["П000002003111"].Значение/1000;
//	
//	ОбластьДок["П000003004003"].Значение = ОбластьДок["П000003004003"].Значение/1000;
//	ОбластьДок["П000003004103"].Значение = ОбластьДок["П000003004103"].Значение/1000;
//	ОбластьДок["П000003004203"].Значение = ОбластьДок["П000003004203"].Значение/1000;
//	ОбластьДок["П000003004303"].Значение = ОбластьДок["П000003004303"].Значение/1000;
//	ОбластьДок["П000003004403"].Значение = ОбластьДок["П000003004403"].Значение/1000;
//	ОбластьДок["П000003004503"].Значение = ОбластьДок["П000003004503"].Значение/1000;
//	ОбластьДок["П000003004703"].Значение = ОбластьДок["П000003004703"].Значение/1000;
//	ОбластьДок["П000003004803"].Значение = ОбластьДок["П000003004803"].Значение/1000;
//	ОбластьДок["П000003004903"].Значение = ОбластьДок["П000003004903"].Значение/1000;
//	ОбластьДок["П000003005003"].Значение = ОбластьДок["П000003005003"].Значение/1000;
//	ОбластьДок["П000003005103"].Значение = ОбластьДок["П000003005103"].Значение/1000;
//	ОбластьДок["П000003005203"].Значение = ОбластьДок["П000003005203"].Значение/1000;
//	ОбластьДок["П000003005303"].Значение = ОбластьДок["П000003005303"].Значение/1000;
//	ОбластьДок["П000003005403"].Значение = ОбластьДок["П000003005403"].Значение/1000;
//	
//	ОбластьДок["П000003004004"].Значение = ОбластьДок["П000003004004"].Значение/1000;
//	ОбластьДок["П000003004104"].Значение = ОбластьДок["П000003004104"].Значение/1000;
//	ОбластьДок["П000003004204"].Значение = ОбластьДок["П000003004204"].Значение/1000;
//	ОбластьДок["П000003004304"].Значение = ОбластьДок["П000003004304"].Значение/1000;
//	ОбластьДок["П000003004404"].Значение = ОбластьДок["П000003004404"].Значение/1000;
//	ОбластьДок["П000003004504"].Значение = ОбластьДок["П000003004504"].Значение/1000;
//	ОбластьДок["П000003004704"].Значение = ОбластьДок["П000003004704"].Значение/1000;
//	ОбластьДок["П000003004804"].Значение = ОбластьДок["П000003004804"].Значение/1000;
//	ОбластьДок["П000003004904"].Значение = ОбластьДок["П000003004904"].Значение/1000;
//	ОбластьДок["П000003005004"].Значение = ОбластьДок["П000003005004"].Значение/1000;
//	ОбластьДок["П000003005104"].Значение = ОбластьДок["П000003005104"].Значение/1000;
//	ОбластьДок["П000003005204"].Значение = ОбластьДок["П000003005204"].Значение/1000;
//	ОбластьДок["П000003005304"].Значение = ОбластьДок["П000003005304"].Значение/1000;
//	ОбластьДок["П000003005404"].Значение = ОбластьДок["П000003005404"].Значение/1000;
//	
//	// Раздел2
//	ОбластьДок["П000002000703"].Значение = ОбластьДок["П000002000903"].Значение;	
//	ОбластьДок["П000002000803"].Значение = ОбластьДок["П000002000903"].Значение;	
//	ОбластьДок["П000002000704"].Значение = ОбластьДок["П000002000904"].Значение;	
//	ОбластьДок["П000002000804"].Значение = ОбластьДок["П000002000904"].Значение;	
//	ОбластьДок["П000002000705"].Значение = ОбластьДок["П000002000905"].Значение;	
//	ОбластьДок["П000002000805"].Значение = ОбластьДок["П000002000905"].Значение;	
//	ОбластьДок["П000002000706"].Значение = ОбластьДок["П000002000906"].Значение;	
//	ОбластьДок["П000002000806"].Значение = ОбластьДок["П000002000906"].Значение;	
//	ОбластьДок["П000002000707"].Значение = ОбластьДок["П000002000907"].Значение;	
//	ОбластьДок["П000002000807"].Значение = ОбластьДок["П000002000907"].Значение;	
//	ОбластьДок["П000002000708"].Значение = ОбластьДок["П000002000908"].Значение;	
//	ОбластьДок["П000002000808"].Значение = ОбластьДок["П000002000908"].Значение;	
//	ОбластьДок["П000002000711"].Значение = ОбластьДок["П000002000911"].Значение;	
//	ОбластьДок["П000002000811"].Значение = ОбластьДок["П000002000911"].Значение;	
//	// Дебиторская задолженность
//	ОбластьДок["П000002002703"].Значение = ОбластьДок["П000002003103"].Значение; //Жилищные
//	ОбластьДок["П000002002704"].Значение = ОбластьДок["П000002003104"].Значение; //Водоснабжение
//	ОбластьДок["П000002002705"].Значение = ОбластьДок["П000002003105"].Значение;
//	ОбластьДок["П000002002706"].Значение = ОбластьДок["П000002003106"].Значение; //Теплоснабжение
//	ОбластьДок["П000002002707"].Значение = ОбластьДок["П000002003107"].Значение;
//	ОбластьДок["П000002002708"].Значение = ОбластьДок["П000002003108"].Значение;
//	ОбластьДок["П000002002711"].Значение = ОбластьДок["П000002003111"].Значение; //Прочие
//	
//	//Раздел 3
//	//Дублирование колонки 3 в 7
//	//Жилищные услуги
//	ОбластьДок["П000003004007"].Значение = ОбластьДок["П000003004003"].Значение;
//	ОбластьДок["П000003004107"].Значение = ОбластьДок["П000003004103"].Значение;
//	ОбластьДок["П000003004207"].Значение = ОбластьДок["П000003004203"].Значение;
//	ОбластьДок["П000003004307"].Значение = ОбластьДок["П000003004303"].Значение;
//	ОбластьДок["П000003004407"].Значение = ОбластьДок["П000003004403"].Значение;
//	ОбластьДок["П000003004507"].Значение = ОбластьДок["П000003004503"].Значение;
//	//Комунальные услуги
//	ОбластьДок["П000003004707"].Значение = ОбластьДок["П000003004703"].Значение;
//	ОбластьДок["П000003004807"].Значение = ОбластьДок["П000003004803"].Значение;
//	ОбластьДок["П000003004907"].Значение = ОбластьДок["П000003004903"].Значение;
//	ОбластьДок["П000003005007"].Значение = ОбластьДок["П000003005003"].Значение;
//	ОбластьДок["П000003005107"].Значение = ОбластьДок["П000003005103"].Значение;
//	ОбластьДок["П000003005207"].Значение = ОбластьДок["П000003005203"].Значение;
//	ОбластьДок["П000003005307"].Значение = ОбластьДок["П000003005303"].Значение;
//	ОбластьДок["П000003005407"].Значение = ОбластьДок["П000003005403"].Значение;
//	
//	// БИТ_ЖКХ 13.05.2016 17:47:26 Начало правки...
//	//Дублирование колонки 3 в 8
//	//Жилищные услуги
//	ОбластьДок["П000003004008"].Значение = ОбластьДок["П000003004003"].Значение;
//	ОбластьДок["П000003004108"].Значение = ОбластьДок["П000003004103"].Значение;
//	ОбластьДок["П000003004208"].Значение = ОбластьДок["П000003004203"].Значение;
//	ОбластьДок["П000003004308"].Значение = ОбластьДок["П000003004303"].Значение;
//	ОбластьДок["П000003004408"].Значение = ОбластьДок["П000003004403"].Значение;
//	ОбластьДок["П000003004508"].Значение = ОбластьДок["П000003004503"].Значение;
//	//Комунальные услуги
//	ОбластьДок["П000003004708"].Значение = ОбластьДок["П000003004703"].Значение;
//	ОбластьДок["П000003004808"].Значение = ОбластьДок["П000003004803"].Значение;
//	ОбластьДок["П000003004908"].Значение = ОбластьДок["П000003004903"].Значение;
//	ОбластьДок["П000003005008"].Значение = ОбластьДок["П000003005003"].Значение;
//	ОбластьДок["П000003005108"].Значение = ОбластьДок["П000003005103"].Значение;
//	ОбластьДок["П000003005208"].Значение = ОбластьДок["П000003005203"].Значение;
//	ОбластьДок["П000003005308"].Значение = ОбластьДок["П000003005303"].Значение;
//	ОбластьДок["П000003005408"].Значение = ОбластьДок["П000003005403"].Значение;
//	
//	//Социальная норма площади жилого помещения на 1 гражданина (60)
//	ОбластьДок["П000003006001"].Значение = СоциальнаяНормаПлощади;
//	// БИТ_ЖКХ 13.05.2016 17:47:26 Конец правки.
//	
//	// БИТ_ЖКХ 24.11.2015 9:51:31 Начало правки... 
//	//Площадь и Число проживающих
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
//	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
//	|	бит_ЛицевыеСчета.Здание КАК Здание
//	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
//	|ИЗ
//	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
//	|ГДЕ
//	|	бит_ЛицевыеСчета.Организация В ИЕРАРХИИ(&Организация)
//	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	Здание,
//	|	Квартира
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КоличествоПроживающих
//	|ПОМЕСТИТЬ СписокПроживающих
//	|ИЗ
//	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
//	|			&КонецПериода,
//	|			ЛицевойСчет В
//	|				(ВЫБРАТЬ
//	|					ВТ_ЛицевыеСчета.ЛицевойСчет
//	|				ИЗ
//	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_ПроживающиеПоЛССрезПоследних
//	|ГДЕ
//	|	(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент = ИСТИНА
//	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания <> ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)
//	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
//	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
//	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга КАК Услуга,
//	|	МАКСИМУМ(бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Норма + бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.СверхНорма) КАК ЖилищныйФонд
//	|ПОМЕСТИТЬ ВТ_ОбщаяПлощадь
//	|ИЗ
//	|	РегистрСведений.бит_СведенияОНормативахНачисленийЗакрытогоПериода.СрезПоследних(
//	|			&КонецПериода,
//	|			ЛицевойСчет В
//	|				(ВЫБРАТЬ
//	|					ВТ_ЛицевыеСчета.ЛицевойСчет
//	|				ИЗ
//	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет,
//	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	Услуга
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
//	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
//	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК КомунальнаяПлощадь
//	|ПОМЕСТИТЬ ВТ_ОбщаяКомунальнаяПлощадь
//	|ИЗ
//	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
//	|			&КонецПериода,
//	|			Квартира В
//	|				(ВЫБРАТЬ
//	|					ВТ_ЛицевыеСчета.Квартира
//	|				ИЗ
//	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияОКвартиреСрезПоследних
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Квартира
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
//	|ПОМЕСТИТЬ ВТ_бит_СведенияПоУслугамЛССрезПоследних
//	|ИЗ
//	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
//	|			&КонецПериода,
//	|			ЛицевойСчет В
//	|				(ВЫБРАТЬ
//	|					ВТ_ЛицевыеСчета.ЛицевойСчет
//	|				ИЗ
//	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
//	|ГДЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЛицевойСчет,
//	|	Услуга
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
//	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
//	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
//	|	СписокПроживающих.КоличествоПроживающих КАК КоличествоПроживающих,
//	|	ВТ_ЛицевыеСчета.Здание,
//	|	МАКСИМУМ(ВТ_ОбщаяПлощадь.ЖилищныйФонд) КАК ЖилищныйФонд,
//	|	МАКСИМУМ(ВТ_ОбщаяКомунальнаяПлощадь.КомунальнаяПлощадь) КАК КомунальнаяПлощадь
//	|ПОМЕСТИТЬ УслугиГЦЖС
//	|ИЗ
//	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних КАК ВТ_бит_СведенияПоУслугамЛССрезПоследних
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
//	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХ.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокПроживающих КАК СписокПроживающих
//	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = СписокПроживающих.ЛицевойСчет
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
//	|			ПО ВТ_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяКомунальнаяПлощадь КАК ВТ_ОбщаяКомунальнаяПлощадь
//	|			ПО ВТ_ЛицевыеСчета.Квартира = ВТ_ОбщаяКомунальнаяПлощадь.Квартира
//	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщаяПлощадь КАК ВТ_ОбщаяПлощадь
//	|		ПО ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ОбщаяПлощадь.ЛицевойСчет
//	|			И ВТ_бит_СведенияПоУслугамЛССрезПоследних.Услуга = ВТ_ОбщаяПлощадь.Услуга
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
//	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
//	|	бит_СписокЗданий.ВидБлагоустройстваЗданий,
//	|	ВТ_ОбщаяКомунальнаяПлощадь.ТипПлиты,
//	|	СписокПроживающих.КоличествоПроживающих,
//	|	ВТ_ЛицевыеСчета.Здание
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
//	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК ОбщаяПлощадьЖилогоЗдания,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования)
//	|				ТОГДА ВЫРАЗИТЬ(бит_ЗначениеСвойствОбъектовУчета.Значение КАК ЧИСЛО(15, 2))
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК ОбщаяПлощадьМестОбщегоПользования
//	|ПОМЕСТИТЬ ВТ_ОбщиеПлощади
//	|ИЗ
//	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
//	|		ПО ВТ_ЛицевыеСчета.Здание = бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
//	|ГДЕ
//	|	(бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
//	|			ИЛИ бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_ЛицевыеСчета.Здание
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ВТ_ЛицевыеСчета.Здание
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	бит_ШаблоныУслугСрезПоследних.Здание КАК Здание,
//	|	бит_ШаблоныУслугСрезПоследних.Услуга КАК Услуга
//	|ПОМЕСТИТЬ ВТ_ШаблоныУслуг
//	|ИЗ
//	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
//	|			,
//	|			Здание В
//	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|					УслугиГЦЖС.Здание
//	|				ИЗ
//	|					УслугиГЦЖС КАК УслугиГЦЖС)) КАК бит_ШаблоныУслугСрезПоследних
//	|ГДЕ
//	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Здание,
//	|	Услуга
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВТ_ШаблоныУслуг.Здание КАК Здание,
//	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
//	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
//	|	МАКСИМУМ(ВТ_ОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
//	|ПОМЕСТИТЬ ВТ_ПредварительноОбщиеПлощади
//	|ИЗ
//	|	ВТ_ШаблоныУслуг КАК ВТ_ШаблоныУслуг
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
//	|		ПО ВТ_ШаблоныУслуг.Услуга = бит_УслугиЖКХ.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощади КАК ВТ_ОбщиеПлощади
//	|		ПО ВТ_ШаблоныУслуг.Здание = ВТ_ОбщиеПлощади.Здание
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_ШаблоныУслуг.Здание,
//	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
//	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
//	|	СУММА(ВТ_ПредварительноОбщиеПлощади.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
//	|ПОМЕСТИТЬ ВТ_ОбщиеПлощадиИтог
//	|ИЗ
//	|	ВТ_ПредварительноОбщиеПлощади КАК ВТ_ПредварительноОбщиеПлощади
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ВТ_ПредварительноОбщиеПлощади.ГрафаОтчетаГЦЖС
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
//	|	УслугиГЦЖС.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий,
//	|	УслугиГЦЖС.ТипПлиты КАК ТипПлиты,
//	|	СУММА(УслугиГЦЖС.КоличествоПроживающих) КАК КоличествоПроживающих,
//	|	СУММА(УслугиГЦЖС.ЖилищныйФонд) КАК ЖилищныйФонд,
//	|	СУММА(УслугиГЦЖС.КомунальнаяПлощадь) КАК КомунальнаяПлощадь,
//	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьЖилогоЗдания) КАК ОбщаяПлощадьЖилогоЗдания,
//	|	МАКСИМУМ(ВТ_ОбщиеПлощадиИтог.ОбщаяПлощадьМестОбщегоПользования) КАК ОбщаяПлощадьМестОбщегоПользования
//	|ИЗ
//	|	УслугиГЦЖС КАК УслугиГЦЖС
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщиеПлощадиИтог КАК ВТ_ОбщиеПлощадиИтог
//	|		ПО УслугиГЦЖС.ГрафаОтчетаГЦЖС = ВТ_ОбщиеПлощадиИтог.ГрафаОтчетаГЦЖС
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	УслугиГЦЖС.ГрафаОтчетаГЦЖС,
//	|	УслугиГЦЖС.ВидБлагоустройстваЗданий,
//	|	УслугиГЦЖС.ТипПлиты
//	|ИТОГИ
//	|	СУММА(КоличествоПроживающих),
//	|	СУММА(ЖилищныйФонд),
//	|	СУММА(КомунальнаяПлощадь),
//	|	МАКСИМУМ(ОбщаяПлощадьЖилогоЗдания),
//	|	МАКСИМУМ(ОбщаяПлощадьМестОбщегоПользования)
//	|ПО
//	|	ГрафаОтчетаГЦЖС,
//	|	ВидБлагоустройстваЗданий,
//	|	ТипПлиты";
//	// БИТ_ЖКХ 24.11.2015 9:51:23 Конец правки. 
//	
//	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Дата));
//	Запрос.УстановитьПараметр("Организация",   Организация);
//	
//	ВыборкаГЦЖС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	Пока ВыборкаГЦЖС.Следующий() Цикл
//		Если ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение Тогда
//            //Раздел 3
//			ОбластьДок["П000003004710"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
//			ОбластьДок["П000003004711"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ХВСДляГВС Тогда
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006408"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			КонецЕсли;	
//		
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда	
//            //Раздел 3
//			ОбластьДок["П000003004810"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
//			ОбластьДок["П000003004811"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда	
//            //Раздел 3
//			ОбластьДок["П000003004910"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
//			ОбластьДок["П000003004911"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда	
//            //Раздел 3
//			ОбластьДок["П000003005010"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
//			ОбластьДок["П000003005011"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006207"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
//			КонецЕсли;	
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда	
//            //Раздел 3
//			ОбластьДок["П000003005110"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
//			ОбластьДок["П000003005111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			//Суммируем данные по типам плит
//			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
//				ВыборкаТипПлиты = ВыборкаВидБлагоустройстваЗданий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//				Пока ВыборкаТипПлиты.Следующий() Цикл
//					Если ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
//						ОбластьДок["П000003005210"].Значение = ОбластьДок["П000003005210"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
//						ОбластьДок["П000003005211"].Значение = ОбластьДок["П000003005211"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
//					ИначеЕсли ВыборкаТипПлиты.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
//						ОбластьДок["П000003005310"].Значение = ОбластьДок["П000003005310"].Значение + ВыборкаТипПлиты.КомунальнаяПлощадь;
//						ОбластьДок["П000003005311"].Значение = ОбластьДок["П000003005311"].Значение + ВыборкаТипПлиты.КоличествоПроживающих;
//					КонецЕсли;	
//				КонецЦикла;
//			КонецЦикла;
//			// Справочно (Раз в год)
//			Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//				ОбластьДок["П000004006106"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьМестОбщегоПользования;
//				ОбластьДок["П000004006107"].Значение = ВыборкаГЦЖС.ОбщаяПлощадьЖилогоЗдания;
//			КонецЕсли;	
//	
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда	
//            //Раздел 3
//			ОбластьДок["П000003005410"].Значение = ВыборкаГЦЖС.КомунальнаяПлощадь;
//			ОбластьДок["П000003005411"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;

//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ПлатаЗаНайм Тогда
//            //Раздел 3
//			ОбластьДок["П000003004011"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			ОбластьДок["П000003004010"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Техобслуживание Тогда
//            //Раздел 3
//			ОбластьДок["П000003004111"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			ОбластьДок["П000003004110"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
//			ВыборкаВидБлагоустройстваЗданий = ВыборкаГЦЖС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//			Пока ВыборкаВидБлагоустройстваЗданий.Следующий() Цикл
//				Если ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами  Тогда
//					ОбластьДок["П000003004211"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
//					ОбластьДок["П000003004210"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
//				ИначеЕсли ВыборкаВидБлагоустройстваЗданий.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.БезЛифтов Тогда
//					ОбластьДок["П000003004311"].Значение = ВыборкаВидБлагоустройстваЗданий.КоличествоПроживающих;
//					ОбластьДок["П000003004310"].Значение = ВыборкаВидБлагоустройстваЗданий.ЖилищныйФонд;
//				КонецЕсли;
//			КонецЦикла;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ВывозБытовыхОтходов Тогда	
//            //Раздел 3
//			ОбластьДок["П000003004411"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			ОбластьДок["П000003004410"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
//			
//		ИначеЕсли ВыборкаГЦЖС.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт Тогда	
//            //Раздел 3
//			ОбластьДок["П000003004511"].Значение = ВыборкаГЦЖС.КоличествоПроживающих;
//			ОбластьДок["П000003004510"].Значение = ВыборкаГЦЖС.ЖилищныйФонд;
//		КонецЕсли;
//	КонецЦикла; 
//	
//	
//	// Справочно (Раз в год)
//	Если КонецМесяца(Дата) = КонецГода(Дата) Тогда
//		ОбластьДок["П000004006205"].Значение = ОбластьДок["П000003005010"].Значение;
//		ОбластьДок["П000004006108"].Значение = ОбластьДок["П000003005111"].Значение;
//		ОбластьДок["П000004006308"].Значение = ОбластьДок["П000003004711"].Значение;
//		ОбластьДок["П000004006508"].Значение = ОбластьДок["П000003005411"].Значение;
//	КонецЕсли;
//	
//	
//	
//	//// БИТ_ЖКХ изменение кода. Начало. 22.07.2011{{
//	//// Макет = ПолучитьМакет("Форма22");.
//	//Макет = ПолучитьМакет("Форма22_Новый");
//	//// БИТ_ЖКХ изменение кода. Конец. 22.07.2011}}
//	//
//	//// Титульный лист.
//	//ОбластьТитульный = Макет.ПолучитьОбласть("Титульный");
//	//ОбластьТитульный.Параметры.ТекМесяц = Формат(ТекущаяДата(), "ДФ='ММММ'");
//	//ОбластьТитульный.Параметры.ТекГод = Формат(ТекущаяДата(), "ДФ='гг'");
//	//ОбластьТитульный.Параметры.НаименованиеОрганизации  = СведенияОбОрганизации["Наименование"];
//	//ОбластьТитульный.Параметры.ПочтовыйАдресОрганизации = СведенияОбОрганизации["Адрес"];
//	//ОбластьТитульный.Параметры.КодПоОКПО                = СведенияОбОрганизации["КодПоОКПО"];
//	//ДокументРезультат.Вывести(ОбластьТитульный);
//	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
//	//
//	//// Раздел 1.
//	//ОбластьРаздел1 = Макет.ПолучитьОбласть("Раздел1");
//	//ДокументРезультат.Вывести(ОбластьРаздел1);
//	//
//	//// Раздел 2.
//	//ОбластьРаздел2_1 = Макет.ПолучитьОбласть("Раздел2_1");
//	//ДокументРезультат.Вывести(ОбластьРаздел2_1);
//	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
//	//ОбластьРаздел2_2 = Макет.ПолучитьОбласть("Раздел2_2");
//	//ДокументРезультат.Вывести(ОбластьРаздел2_2);
//	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
//	//ОбластьРаздел2_3 = Макет.ПолучитьОбласть("Раздел2_3");
//	//ДокументРезультат.Вывести(ОбластьРаздел2_3);
//	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
//	//
//	//// Справка.
//	//ОбластьСправка = Макет.ПолучитьОбласть("Справка");
//	//ДокументРезультат.Вывести(ОбластьСправка);
//	//
//	//// Раздел 3.
//	//ОбластьРаздел3_1 = Макет.ПолучитьОбласть("Раздел3_1");
//	//ДокументРезультат.Вывести(ОбластьРаздел3_1);
//	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
//	//ОбластьРаздел3_2 = Макет.ПолучитьОбласть("Раздел3_2");
//	//ДокументРезультат.Вывести(ОбластьРаздел3_2);
//	//
//	//// БИТ_ЖКХ добавление кода. Начало. 22.07.2011{{
//	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
//	//ОбластьРаздел4 = Макет.ПолучитьОбласть("Раздел4");
//	//ДокументРезультат.Вывести(ОбластьРаздел4);
//	//// БИТ_ЖКХ добавление кода. Конец. 22.07.2011}}
//	// БИТ_ЖКХ 27.10.2015 12:59:48 Конец правки.  
//	
//	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//	
//Конецпроцедуры  // ЗаполнитьДокумент_Ф22_2015Кв1()
// БИТ_ЖКХ 05.05.2017 14:24:22 Конец правки. 

// БИТ_ЖКХ 20.04.2017 10:34:31 Конец правки.

// Заполняет указанный табличный документ по форме №26 по данным.
// В указанной структуре параметров.
Процедура ЗаполнитьДокумент_Ф26(ДокументРезультат, СведенияОбОрганизации)
	
	Макет = ПолучитьМакет("Форма26");
	
	// Титульный лист.
	ОбластьТитульный = Макет.ПолучитьОбласть("Титульный");
	ОбластьТитульный.Параметры.ТекМесяц = Формат(ТекущаяДата(), "ДФ='ММММ'");
	ОбластьТитульный.Параметры.ТекГод = Формат(ТекущаяДата(), "ДФ='гг'");
	ОбластьТитульный.Параметры.НаименованиеОрганизации  = СведенияОбОрганизации["Наименование"];
	ОбластьТитульный.Параметры.ПочтовыйАдресОрганизации = СведенияОбОрганизации["Адрес"];
	ОбластьТитульный.Параметры.КодПоОКПО                = СведенияОбОрганизации["КодПоОКПО"];
	ДокументРезультат.Вывести(ОбластьТитульный);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Раздел 1.
	ОбластьРаздел1_1 = Макет.ПолучитьОбласть("Раздел1_1");
	ДокументРезультат.Вывести(ОбластьРаздел1_1);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	ОбластьРаздел1_2 = Макет.ПолучитьОбласть("Раздел1_2");
	ДокументРезультат.Вывести(ОбластьРаздел1_2);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Справка.
	ОбластьСправочно= Макет.ПолучитьОбласть("Справочно");
	ДокументРезультат.Вывести(ОбластьСправочно);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
Конецпроцедуры  // ЗаполнитьДокумент_Ф26()

#КонецОбласти