
// Модуль предназначен для хранения обработчиков подписок БИТ.

#Область ПрефиксацияОбъектов

Процедура УстановитьПрефиксНомераСправочника(Источник, СтандартнаяОбработка, Префикс) Экспорт

	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		Выполнить("ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(Источник, СтандартнаяОбработка, Префикс)");
		   		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("ОбщегоНазначения.ПриУстановкеНовогоКодаДляСправочникаИлиПВХ(Источник, СтандартнаяОбработка, Префикс)");
	
	КонецЕсли; 	

КонецПроцедуры // УстановитьПрефиксНомераСправочника()

Процедура УстановитьПрефиксНомераДокумента(Источник, СтандартнаяОбработка, Префикс) Экспорт

	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		Если Источник.Метаданные().Реквизиты.Найти("Организация") = Неопределено Тогда
			Выполнить("ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(Источник, СтандартнаяОбработка, Префикс)");
		Иначе	
			// Есть реквизит "Организация".
			Выполнить("ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс)");
		КонецЕсли;
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
	 	Выполнить("ОбщегоНазначения.ПриУстановкеНовогоНомераДляДокументов(Источник, СтандартнаяОбработка, Префикс)");
		
	КонецЕсли;	

КонецПроцедуры // УстановитьПрефиксНомераДокумента()

#КонецОбласти