
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Ссылка = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	
	Для Каждого Эл Из Список.Отбор.Элементы Цикл
		
		Если Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизЛицо") Тогда
			
			Если Эл.Использование = Истина Тогда
				
				Ссылка = Эл.ПравоеЗначение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "УдостоверениеЛичности"), Ссылка);

КонецПроцедуры

#КонецОбласти