
#Область ПеременныеМодуля

&НаСервере
Перем мДатаТекст; // Хранит дату закрытия в текстовом предствалении.

&НаСервере
Перем мОтветственный; // Хранит ответственного(текущего пользователя).

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура ПоместитьЗначениеВОтборКомпановщика(Значение, Индекс)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[Индекс].ПравоеЗначение = Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииУправленияВнешнимВидомФорм

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УправлениеЭлементамиФормы()
	
	//Элементы.ВидСравненияЗдание.доступность  = ИспользоватьОтборЗдание;
	//Элементы.ВидСравненияУчасток.Доступность = ИспользоватьОтборУчасток;
	//Элементы.ВидСравненияРайон.Доступность   = ИспользоватьОтборРайон;
	//Элементы.ВидСравненияУлица.Доступность   = ИспользоватьОтборУлица;
	//
	//Элементы.Здание.Доступность  = ИспользоватьОтборЗдание;
	//Элементы.Участок.Доступность = ИспользоватьОтборУчасток;
	//Элементы.Район.Доступность   = ИспользоватьОтборРайон;
	//Элементы.Улица.Доступность   = ИспользоватьОтборУлица;
	//
	//Элементы.ВыполнитьНачисленияПоЛьготам.Доступность   = Объект.ВыполнитьНачисления;
	//Элементы.ВыполнитьНачисленияПоНормам.Доступность    = Объект.ВыполнитьНачисления;
	//Элементы.ВыполнитьНачисленияПоСчетчикам.Доступность = Объект.ВыполнитьНачисления;
	//
	//Элементы.ФормироватьСчетФактураВыданный.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	
	Элементы.Разовые.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	Элементы.РеализацииОтНачисления.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	
	Если Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету Тогда
		
		Элементы.ДокументРаспределенияРасходовНаОказаниеУслуг.Доступность = Истина;
		
	Иначе
		Элементы.ДокументРаспределенияРасходовНаОказаниеУслуг.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.ЗаполняемыеРеквизиты.Доступность = Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "АктОбОказанииПроизводственныхУслуг";
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	//
	//Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	//Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	//Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	//Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	//
	//Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	//Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	//Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	//Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	//
	//Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	//Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	//Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	//Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	//
	//Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	//Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	//Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	//Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	//
	//ВидСравненияРайон   = ВидСравненияКомпоновкиДанных.Равно;
	//ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно;
	//ВидСравненияЗдание  = ВидСравненияКомпоновкиДанных.Равно;
	//ВидСравненияУлица   = ВидСравненияКомпоновкиДанных.Равно;
	//
	Объект.Организация = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ОбработкаОбъект = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.бит_ЗакрытиеМесяцаЖКХ"));	
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ОбработкаОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
		Объект.Организация = ОбработкаОбъект.Организация;
		
	КонецЕсли;
	
	Объект.ДатаЗакрытия = КонецМесяца(бит_ОбщегоНазначения.ПолучитьРабочуюДату());
	
	ОбновитьПараметрыЖКХ();
	
	Объект.ПереоформитьПроживающих        = Ложь;
	Объект.ВыполнитьНачисления            = Ложь;
	Объект.ВводПоказанийПодкрутки         = Ложь;
	Объект.ВыполнитьНачисленияПоНормам    = Ложь;
	Объект.ВыполнитьНачисленияПоСчетчикам = Ложь;
	Объект.ВыполнитьНачисленияПоЛьготам   = Ложь;
	Объект.ВыполнитьОбщедомовыеНачисления = Ложь;
	Объект.ВыполнитьРаспределениеАванса	  = Ложь;
	Объект.ВыполнитьНачислениеПени		  = Ложь;
	
	// Установить видимость реквизитов и заголовков колонок.
	ПредставлениеПериодаРегистрации = Формат(ТекущаяДата(), "ДФ='ММММ гггг'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(СтрокаКонецПериода) Тогда
		СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.ДатаЗакрытия);
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
	Элементы.ДатаЗакрытия.Видимость = Ложь;
	
	Элементы.ДатаКонцаПериода.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ЗакрытьМесяц(Команда)
	
	Форма = ПолучитьФорму("Обработка.бит_ЗакрытиеМесяцаЖКХ.Форма.ФормаРаботыСДокументами",,ЭтаФорма, ЭтаФорма);
	
	Если Форма.Открыта() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед закрытием месяца закройте ""Форму работы с документами""!");
		
		Возврат;
		
	КонецЕсли; 

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выполняется закрытие месяца.");
	
	ЗакрытьМесяцНаСервере();

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Закрытие месяца выполнено.");
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаРаботыСдокументами(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация" , Объект.Организация);
	ПараметрыФормы.Вставить("ДатаЗакрытия", Объект.ДатаЗакрытия);
	
	Форма = ПолучитьФорму("Обработка.бит_ЗакрытиеМесяцаЖКХ.Форма.ФормаРаботыСДокументами", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
	Если Форма.Открыта() Тогда
		Форма.Активизировать();
	Иначе
		Форма.Открыть();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	Объект.ДатаЗакрытия = КонецМесяца(Объект.ДатаЗакрытия)+1;
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	Объект.ДатаЗакрытия = НачалоМесяца(Объект.ДатаЗакрытия-1);
	
	ПриИзмененииПериода();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Здание, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Участок, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Район, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Улица, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборРайонПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ИспользоватьОтборРайон;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборУчастокПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = ИспользоватьОтборУчасток;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборЗданиеПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование  = ИспользоватьОтборЗдание;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборУлицаПриИзменении(Элемент)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование  = ИспользоватьОтборУлица;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Если ИспользоватьОтборРайон И ЗначениеЗаполнено(Район) Тогда
		Отбор.Вставить("Район", Район);
	КонецЕсли;
	
	Если ИспользоватьОтборУчасток И ЗначениеЗаполнено(Участок) Тогда
		Отбор.Вставить("Участок", Участок);
	КонецЕсли;
	
	Если ИспользоватьОтборУлица И ЗначениеЗаполнено(Улица) Тогда
		Отбор.Вставить("Улица", Улица);
	КонецЕсли;
	
	МножественныйВыбор = (ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор, МножественныйВыбор", Отбор, МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияЗданиеПриИзменении(Элемент)
	
	Если ВидСравненияЗдание = Неопределено Тогда
		
		ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Здание) = Тип("СписокЗначений") Тогда
		
		Здание = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Здание, 3);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ВидСравнения   = ВидСравненияЗдание;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияРайонПриИзменении(Элемент)
	
	Если ВидСравненияРайон = Неопределено Тогда
		
		ВидСравненияРайон = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияРайон = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияРайон = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Район) = Тип("СписокЗначений") Тогда
		
		Район = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Район, 0);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ВидСравнения   = ВидСравненияРайон;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияУчастокПриИзменении(Элемент)
	
	Если ВидСравненияУчасток = Неопределено Тогда
		
		ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Участок) = Тип("СписокЗначений") Тогда
		
		Участок = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Участок, 1);
		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения   = ВидСравненияУчасток;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияУлицаПриИзменении(Элемент)
	
	Если ВидСравненияУлица = Неопределено Тогда
		
		ВидСравненияУлица = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияУлица = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияУлица = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Улица) = Тип("СписокЗначений") Тогда
		
		Улица = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Улица, 2);
		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].ВидСравнения   = ВидСравненияУлица;
	
КонецПроцедуры

&НаКлиенте
Процедура РайонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияРайон = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияРайон = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_АдминистративныеОкруга.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_ТехническиеУчастки.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияУлица = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияУлица = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СписокУлиц.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СтрокаКонецПериода) Тогда
		СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.ДатаЗакрытия);
	КонецЕсли; 
	
	ОбновитьПараметрыЖКХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.ДатаЗакрытия;
	
	бит_РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент,
	СтандартнаяОбработка, 
	Объект.ДатаЗакрытия, 
	ЭтаФорма);
	СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.ДатаЗакрытия);
	Объект.ДатаЗакрытия = КонецМесяца(Объект.ДатаЗакрытия);
	
	ОбновитьПараметрыЖКХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.ДатаЗакрытия;
	
	ТекущаяДата = ?(Направление > 0, Объект.ДатаЗакрытия, ДобавитьМесяц(Объект.ДатаЗакрытия, -1));
	бит_РаботаСДиалогами.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, ТекущаяДата, СтрокаКонецПериода);
	Объект.ДатаЗакрытия = КонецМесяца(ТекущаяДата);
	
	ОбновитьПараметрыЖКХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНачисленияПриИзменении(Элемент)
	
	Объект.ВыполнитьНачисленияПоНормам    = Объект.ВыполнитьНачисления;
	Объект.ВыполнитьНачисленияПоЛьготам   = Объект.ВыполнитьНачисления;
	Объект.ВыполнитьНачисленияПоСчетчикам = Объект.ВыполнитьНачисления;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчетуПриИзменении(Элемент)
	
	Объект.ФормироватьСчетФактураВыданный = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	
	Разовые = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	
	РеализацииОтНачисления = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
    // БИТ_ЖКХ 23.10.2017 11:36:14 Начало правки... 
    Объект.ФормироватьСчетНаОплату = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
	Элементы.ФормироватьСчетНаОплату.Доступность = Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету;
    // БИТ_ЖКХ 23.10.2017 11:36:16 Конец правки. 
    УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРаспределенияРасходовНаОказаниеУслугПриИзменении(Элемент)
	
	Элементы.ЗаполняемыеРеквизиты.Доступность = Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "АктОбОказанииПроизводственныхУслуг";
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьПараметрыЖКХ();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРекомендацияНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.ДатыЗапретаИзменения.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйПериодПриИзменении(Элемент)
	
	Если ПроизвольныйПериод Тогда
		
		Элементы.ДатаЗакрытия.Видимость = Ложь;
		
		Элементы.ДатаКонцаПериода.Видимость = Истина;
		
		
		ДатаКонцаПериода = Объект.ДатаЗакрытия;
		
	Иначе
		
		Элементы.ДатаЗакрытия.Видимость = Истина;
		
		Элементы.ДатаКонцаПериода.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	мКэшЗначений.ЗначениеДаты = ВыбранноеЗначение;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПриИзменении(Элемент)
	
	ПредставлениеПериодаРегистрации = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), 
	НачалоМесяца(Объект.ДатаЗакрытия), 
	КонецМесяца(Объект.ДатаЗакрытия));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Объект.ДатаЗакрытия), КонецМесяца(Объект.ДатаЗакрытия));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, Элементы.ПредставлениеПериодаРегистрации, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	
	КэшированныеЗначения.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	КэшированныеЗначения.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	КэшированныеЗначения.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	КэшированныеЗначения.Вставить("ОбщедомовыеРасходыВГрафеНачисления"                   , Ложь);
	КэшированныеЗначения.Вставить("СчетчикиПодкрутка"                                    , Ложь);
	КэшированныеЗначения.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	КэшированныеЗначения.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	КэшированныеЗначения.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	КэшированныеЗначения.Вставить("УчитыватьНачисленияПоГрупповымСчетчикам"              , Ложь);
	КэшированныеЗначения.Вставить("УчитыватьПерерасчет"                                  , Ложь);
	КэшированныеЗначения.Вставить("СчетАбонента"                                         , Неопределено);
	КэшированныеЗначения.Вставить("Контрагент"                                            , Неопределено);
	КэшированныеЗначения.Вставить("ФормироватьАктИРеализациюПоКонтрагенту"                , Ложь);
	КэшированныеЗначения.Вставить("ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц", Ложь);
	
	КэшированныеЗначения.Вставить("ДокументУчетаСобственныхУслуг", Неопределено);
	
	КэшированныеЗначения.Вставить("ПорядокРаспределенияРасходовНаОказаниеУслуг", Неопределено);
	
	КэшированныеЗначения.Вставить("ПоПлановымЦенамИВыручке", Перечисления.бит_ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенамИВыручке);
	
	КэшированныеЗначения.Вставить("ЗначениеДаты"                                         , Неопределено);
	
КонецПроцедуры

// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьМакет("ОсновныеНачисления");
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры

// Процедура выполняет заполнение табличной части "Товары".
//
&НаСервере
Процедура ЗакрытьМесяцНаСервере()
	
	мДатаТекст = Формат(Объект.ДатаЗакрытия, "ДФ='ММММ гггг'");
	
	мОтветственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	//++ Мельник Павел 20191012
	Если Объект.ВыполнитьОбщедомовыеНачисленияОмск Тогда
		НачислитьОДН();	
	КонецЕсли;
	//-- Мельник Павел 20191012
	
	Если Объект.ПереоформитьПроживающих Тогда
		
		ПереоформлениеПроживающих();
		
	КонецЕсли;
	
	Если Объект.ВводПоказанийПодкрутки И мКэшЗначений.СчетчикиПодкрутка Тогда
		
		ВводПоказанийПодкрутки();
		
	КонецЕсли; 
	
	ВыполнитьОсновныеНачисления();
	
	Если Объект.УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету Тогда
		
		Если РеализацииОтНачисления Тогда	
			
			СформироватьАктРеализацию();
		иначе
			// БИТ ЖКХ 19.06.2020
		    Если Объект.ВидОперацииУслуги = истина Тогда
			  СформироватьАктРеализацию();				
		    КонецЕсли;
		КонецЕсли; 
		
		// БИТ_ЖКХ 23.10.2017 11:19:03 Начало правки... 
        //Если Разовые Тогда	
        //	
        //	СформироватьАктРеализациюРазовые();
        //	
        //КонецЕсли; 
		// БИТ_ЖКХ 23.10.2017 11:19:09 Конец правки. 
	иначе	
	    // БИТ ЖКХ 19.06.2020
	    Если Объект.ВидОперацииУслуги = истина Тогда
		  СформироватьАктРеализацию();				
	    КонецЕсли;	
		
	КонецЕсли; 

	
	ВыполнитьРаспределениеАванса();
	
КонецПроцедуры

&НаСервере
Процедура ПереоформлениеПроживающих()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ФизЛицо");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтатусФизЛица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтепеньРодства");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтатусПроживания");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаРегистрации");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаСнятияСРегистрации");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаЗаписи");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ВладелецКвартиры");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ПричинаВыписки");
	СтруктураНастроек.ОбязательныеПоля.Добавить("КудаВыписан");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Контрагент");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДоляПлощади");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СтатусФизЛицаДляИзменения");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ПравоустанавливающиеДокументы");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПереоформлениеПроживающих";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаЛС = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ДокументРПЛ = Неопределено;
		
		Выборка = ВыборкаЛС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ДокументРПЛ = Неопределено Тогда
				
				ДокументРПЛ = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент();
				
				ДокументРПЛ.Дата          = КонецДня(Объект.ДатаЗакрытия) - 2;
				ДокументРПЛ.ЛицевойСчет   = ВыборкаЛС.ЛицевойСчет;
				ДокументРПЛ.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				ДокументРПЛ.Ответственный = мОтветственный;
				
			КонецЕсли;
			
			НоваяСтрока = ДокументРПЛ.СписокПроживающих.Добавить();
			
			НоваяСтрока.ФизЛицо                       = Выборка.ФизЛицо;
			НоваяСтрока.ДатаРегистрации               = Выборка.ДатаРегистрации;
			НоваяСтрока.ДатаСнятияСРегистрации        = Выборка.ДатаСнятияСРегистрации;
			НоваяСтрока.СтатусПроживания              = Выборка.СтатусПроживания;
			НоваяСтрока.СтепеньРодства                = Выборка.СтепеньРодства;
			НоваяСтрока.ПравоустанавливающиеДокументы = Выборка.ПравоустанавливающиеДокументы; 
			НоваяСтрока.ВладелецКвартиры              = Выборка.ВладелецКвартиры;
			НоваяСтрока.ДоляПлощади                   = Выборка.ДоляПлощади;
			
			Если ЗначениеЗаполнено(Выборка.ДатаЗаписи) Тогда
				
				НоваяСтрока.СтатусФизЛица = ?(НЕ ЗначениеЗаполнено(Выборка.СтатусФизЛицаДляИзменения),
				Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация,
				Выборка.СтатусФизЛицаДляИзменения);
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
				
				НоваяСтрока.СтатусФизЛица  = Справочники.бит_СтатусФизЛица.Выписан;
				НоваяСтрока.ПричинаВыписки = Справочники.бит_ПричиныВыписки.ОкончаниеВремениРегистрации;
				
			КонецЕсли;  
			
			Если НоваяСтрока.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
				
				НоваяСтрока.Контрагент = Выборка.Контрагент;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если НЕ ДокументРПЛ = Неопределено И ДокументРПЛ.СписокПроживающих.Количество() > 0 Тогда 
			
			Попытка
				
				ДокументРПЛ.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ВводПоказанийПодкрутки()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Счетчик");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Удалить");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ВводПоказанийПоПоказаниям";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаЗдание = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗдание.Следующий() Цикл
		
		ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
		
		ДокументВводПоказаний.Дата          = КонецДня(КонецМесяца(Объект.ДатаЗакрытия)) - 2;
		ДокументВводПоказаний.Организация   = Объект.Организация;
		ДокументВводПоказаний.ВидОперации   = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки;
		ДокументВводПоказаний.ТипСчетчика   = Перечисления.бит_ТипСчетчика.Индивидуальный;
		ДокументВводПоказаний.Улица         = ВыборкаЗдание.Здание.Улица;
		ДокументВводПоказаний.Дом           = ВыборкаЗдание.Здание;
		ДокументВводПоказаний.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
		ДокументВводПоказаний.Ответственный = мОтветственный;
		ДокументВводПоказаний.ЗаполнитьТаблицуПоказаний();
		
		Отбор = Новый Структура;
		
		Выборка = ВыборкаЗдание.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Отбор.Очистить();
			Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет); 
			Отбор.Вставить("Счетчик"    ,Выборка.Счетчик);
			
			МассивСтрок =  ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Отбор);
			
			Для каждого Строка Из МассивСтрок Цикл
				Если Выборка.Удалить Тогда
					
					ДокументВводПоказаний.ПоказанияПоСчетчикам.Удалить(Строка);
					
				КонецЕсли; 
			КонецЦикла; 
			
		КонецЦикла; 
		
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 0 Тогда
			
			Попытка
				
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОсновныеНачисления()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументНачисления");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументПоСч");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументПоЛьготам");
	// +ISedakova 30.10.2020 17:59:36
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументПоПени");
	// -ISedakova 30.10.2020 17:59:36
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ОсновныеНачисления";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	Запрос = Новый Запрос;
	ТекстЛС = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание";
	
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ДокументНачисления) И Объект.ВыполнитьНачисленияПоНормам Тогда
			
			ДокументНачисленийПоЛС = Выборка.ДокументНачисления.ПолучитьОбъект();
			
			Если ДокументНачисленийПоЛС.ПометкаУдаления Тогда
				
				ДокументНачисленийПоЛС.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли; 
			
			ДокументНачисленийПоЛС.ЛицевыеСчета.Очистить();
			ДокументНачисленийПоЛС.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		
		// +ISedakova 30.10.2020 17:59:36
		
		Если ЗначениеЗаполнено(Выборка.ДокументНачисления) И Объект.ВыполнитьНачислениеПени Тогда
			
			ДокументНачисленийПоПени = Выборка.ДокументНачисления.ПолучитьОбъект();
						
			Если Найти (ДокументНачисленийПоПени.Комментарий, "#Пени") <> 0 Тогда
				
				Если ДокументНачисленийПоПени.ПометкаУдаления Тогда
				
				ДокументНачисленийПоПени.УстановитьПометкуУдаления(Ложь);
				
				КонецЕсли;	
				
			ДокументНачисленийПоПени.ЛицевыеСчета.Очистить();
			ДокументНачисленийПоПени.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
			КонецЕсли; 
		ИначеЕсли Объект.ВыполнитьНачислениеПени Тогда
			
			ДокументНачисленийПоПени = Документы.бит_НачислениеПоЛицевымСчетам.СоздатьДокумент();
			ДокументНачисленийПоПени.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
			ДокументНачисленийПоПени.Организация = Объект.Организация;						
			ДокументНачисленийПоПени.Ответственный = мОтветственный;
			ДокументНачисленийПоПени.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст + " #Пени";
			
		КонецЕсли;

		// -ISedakova 30.10.2020 17:59:36
		
		Если ЗначениеЗаполнено(Выборка.ДокументПоСч) И Объект.ВыполнитьНачисленияПоСчетчикам Тогда
			
			ДокументНачисленийПоСЧ = Выборка.ДокументПоСч.ПолучитьОбъект();
			
			Если ДокументНачисленийПоСЧ.ПометкаУдаления Тогда
				
				ДокументНачисленийПоСЧ.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли;
			
			ДокументНачисленийПоСЧ.Начисления.Очистить();
			ДокументНачисленийПоСЧ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДокументПоЛьготам) И Объект.ВыполнитьНачисленияПоЛьготам Тогда
			
			ДокументНачисленийПоЛьготам = Выборка.ДокументПоЛьготам.ПолучитьОбъект();
			
			Если ДокументНачисленийПоЛьготам.ПометкаУдаления Тогда
				
				ДокументНачисленийПоЛьготам.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли;
			
			ДокументНачисленийПоЛьготам.ЛицевыеСчета.Очистить();
			ДокументНачисленийПоЛьготам.СписокЛьгот.Очистить();
			ДокументНачисленийПоЛьготам.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		// +ISedakova 20.10.2020 9:01:09
		
		Если Объект.ВыполнитьНачислениеПени Тогда
						
			Запрос.Текст = ТекстЛС;			
			Запрос.УстановитьПараметр("Здание", Выборка.Здание);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			СписокЗданий = Новый Массив;
			СписокЛС     = Новый Массив;
			
			СписокЗданий.Добавить(Выборка.Здание);
			
			СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
			
			ДокументНачисленийПоПени.Улица = Выборка.Здание.Улица; 
			ДокументНачисленийПоПени.Здание = Выборка.Здание;
			
			РассчитатьНачисленияПениПоЛицевымСчетам(СписокЛС, ДокументНачисленийПоПени);
			
		КонецЕсли;
		
		// -ISedakova 20.10.2020 9:01:09
		
	КонецЦикла;
	
	Выборка.Сбросить();
	
	ДокументыНаПроведение = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Запрос.Текст = ТекстЛС;
		
		Запрос.УстановитьПараметр("Здание", Выборка.Здание);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		СписокЗданий = Новый Массив;
		СписокЛС     = Новый Массив;
		
		СписокЗданий.Добавить(Выборка.Здание);
		
		СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТаблицаНачислений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		ТаблицаСчетчиков  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
		ТаблицаРаспред    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
		ТаблицаПрожив     = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецМесяца(Объект.ДатаЗакрытия), 
		Объект.Организация, 
		СписокЛС, 
		СписокЗданий, 
		, 
		, 
		ТаблицаНачислений, 
		ТаблицаСчетчиков, 
		ТаблицаРаспред, 
		,
		,
		,
		мКэшЗначений.РасчетСУчетомДолейВладения,
		мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта, 
		мКэшЗначений.НачислениеСУчетомДнейПроживания, 
		ТаблицаПрожив, 
		,
		мКэшЗначений.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
		мКэшЗначений.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
		
		
		// БИТ ЖКХ 08.04.2020
	    ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		ТаблицаПоДнямСобственности = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПоДнямСобственности();	

		// БИТ ЖКХ 17.04.2020
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата"       , КонецДня(Объект.ДатаЗакрытия));
	//	Запрос.УстановитьПараметр("Организация", Объект.ЛицевойСчет.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НастройкаПараметровЖКХСрезПоследних.НачислениеСоДняПраваСобственности КАК НачислениеСоДняПраваСобственности
		|ИЗ
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата,) КАК бит_НастройкаПараметровЖКХСрезПоследних";
		
		ВыборкаНастроекЖКХ = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаНастроекЖКХ.Следующий() Тогда
			НачислениеСоДняПраваСобственности = ВыборкаНастроекЖКХ.НачислениеСоДняПраваСобственности;
		Иначе	
			НачислениеСоДняПраваСобственности = Ложь;
		КонецЕсли;

		// БИТ ЖКХ 16.04.2020
  	    //бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисленияПоДнямСобственности(КонецМесяца(Объект.ДатаЗакрытия), Объект.Организация, СписокЛС, СписокЗданий, , , ТабЛицевыеСчета,,,,,,мКэшЗначений.РасчетСУчетомДолейВладения,,мКэшЗначений.НачислениеСУчетомДнейПроживания, ТаблицаПоДнямСобственности);
		если НачислениеСоДняПраваСобственности = Истина тогда 
         бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисленияПоДнямСобственности(КонецМесяца(Объект.ДатаЗакрытия), Объект.Организация, СписокЛС, СписокЗданий, , , ТаблицаНачислений,,,,,,мКэшЗначений.РасчетСУчетомДолейВладения,,мКэшЗначений.НачислениеСУчетомДнейПроживания, ТаблицаПоДнямСобственности);
		конецесли; 

		//Если Объект.ВыполнитьНачисления И Объект.ВыполнитьНачисленияПоНормам Тогда
		Если Объект.ВыполнитьОбщедомовыеНачисленияОмск Тогда
			Если  ЗначениеЗаполнено(Выборка.ДокументНачисления) Тогда
				
				ДокументНачисленийПоЛС = Выборка.ДокументНачисления.ПолучитьОбъект();

			Иначе
				
				ДокументНачисленийПоЛС = Документы.бит_НачислениеПоЛицевымСчетам.СоздатьДокумент();
				
				ДокументНачисленийПоЛС.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументНачисленийПоЛС.Организация = Объект.Организация;
				ДокументНачисленийПоЛС.Улица       = Выборка.Улица;
				ДокументНачисленийПоЛС.Здание      = Выборка.Здание;
				
				ДокументНачисленийПоЛС.Ответственный = мОтветственный;
				ДокументНачисленийПоЛС.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				
			КонецЕсли;
			
			// Начисление по лицевым счетам.
			Если ТаблицаНачислений.Количество() > 0 Тогда
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаНачислений);
				ДокументНачисленийПоЛС.ЗаполнениеСчетовКУ(ТаблицаНачислений);
				
				ДокументНачисленийПоЛС.ЛицевыеСчета.Очистить();
				ДокументНачисленийПоЛС.ЛицевыеСчета.Загрузить(ТаблицаНачислений);
				
				ДокументНачисленийПоЛС.НачисленияПоПроживающим.Очистить();
				ДокументНачисленийПоЛС.НачисленияПоПроживающим.Загрузить(ТаблицаПрожив);
				
				// БИТ ЖКХ 14.04.2020
				ДокументНачисленийПоЛС.НачисленияПоДнямПраваСобственности.Очистить();
				ДокументНачисленийПоЛС.НачисленияПоДнямПраваСобственности.Загрузить(ТаблицаПоДнямСобственности);
				
				ДокументНачисленийПоЛС.мРасчетСУчетомДолейВладения          = мКэшЗначений.РасчетСУчетомДолейВладения;
				ДокументНачисленийПоЛС.мУменьшениеНормыЛьготыВПределахФакта = мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта;
				
				Попытка
					
					Если ДокументНачисленийПоЛС.ЛицевыеСчета.Количество() > 0 Тогда
						
						ДокументНачисленийПоЛС.Записать(РежимЗаписиДокумента.Запись);
						ДокументыНаПроведение.Добавить(ДокументНачисленийПоЛС.Ссылка);
						
					КонецЕсли; 
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ВыполнитьНачисления И Объект.ВыполнитьНачисленияПоСчетчикам Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДокументПоСч) Тогда
				
				ДокументНачисленийПоСЧ = Выборка.ДокументПоСч.ПолучитьОбъект();

			Иначе
				ДокументНачисленийПоСЧ = Документы.бит_НачисленияПоСчетчикам.СоздатьДокумент();
				
				ДокументНачисленийПоСЧ.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументНачисленийПоСЧ.Организация = Объект.Организация;
				ДокументНачисленийПоСЧ.Улица       = Выборка.Улица;
				ДокументНачисленийПоСЧ.Здание      = Выборка.Здание;
				
				ДокументНачисленийПоСЧ.Ответственный = мОтветственный;
				ДокументНачисленийПоСЧ.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				
			КонецЕсли;
			
			// Начисление по счетчикам.
			Если ТаблицаСчетчиков.Количество() > 0 ИЛИ ТаблицаРаспред.Количество() > 0 Тогда
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаСчетчиков);
				ДокументНачисленийПоСЧ.ЗаполнениеСчетовКУ(ТаблицаСчетчиков);
				ДокументНачисленийПоСЧ.Начисления.Очистить();
				ДокументНачисленийПоСЧ.Начисления.Загрузить(ТаблицаСчетчиков);
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаРаспред);
				ДокументНачисленийПоСЧ.ЗаполнениеСчетовКУ(ТаблицаРаспред);
				ДокументНачисленийПоСЧ.Распределения.Очистить();
				ДокументНачисленийПоСЧ.Распределения.Загрузить(ТаблицаРаспред);
				
				ДокументНачисленийПоСЧ.мУчетДнейПроживания = мКэшЗначений.НачислениеСУчетомДнейПроживания;
				
				Попытка
					
					Если ДокументНачисленийПоСЧ.Начисления.Количество() > 0 ИЛИ ДокументНачисленийПоСЧ.Распределения.Количество() > 0 Тогда
						
						ДокументНачисленийПоСЧ.Записать(РежимЗаписиДокумента.Запись);
						ДокументыНаПроведение.Добавить(ДокументНачисленийПоСЧ.Ссылка);
						
					КонецЕсли; 
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПровестиДокументы(ДокументыНаПроведение);
	
	Если мКэшЗначений.ОбщедомовыеРасходыВГрафеНачисления
		И Объект.ВыполнитьОбщедомовыеНачисления Тогда
		
		ВыполнитьОбщедомовыеНачисления();
		
	КонецЕсли;
	
	// Расчет Льгот после выполнения всех начислений.
	ДокументыНаПроведение.Очистить();
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		Запрос.Текст = ТекстЛС;
		
		Запрос.УстановитьПараметр("Здание", Выборка.Здание);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		СписокЗданий = Новый Массив;
		СписокЛС     = Новый Массив;
		
		СписокЗданий.Добавить(Выборка.Здание);
		
		СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТаблицаЛьгот      = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецМесяца(Объект.ДатаЗакрытия), 
		Объект.Организация, 
		СписокЛС, 
		СписокЗданий, 
		, 
		, 
		, 
		, 
		, 
		ТаблицаЛьгот,
		,
		,
		мКэшЗначений.РасчетСУчетомДолейВладения,
		мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта, 
		мКэшЗначений.НачислениеСУчетомДнейПроживания, 
		, 
		,
		мКэшЗначений.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
		мКэшЗначений.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
		
		Если Объект.ВыполнитьНачисления И Объект.ВыполнитьНачисленияПоЛьготам Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДокументПоЛьготам) Тогда
				
				ДокументНачисленийПоЛьготам = Выборка.ДокументПоЛьготам.ПолучитьОбъект();
				
			Иначе
				
				ДокументНачисленийПоЛьготам = Документы.бит_НачислениеЛьготПоЛицевымСчетам.СоздатьДокумент();
				
				ДокументНачисленийПоЛьготам.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументНачисленийПоЛьготам.Организация = Объект.Организация;
				ДокументНачисленийПоЛьготам.Улица       = Выборка.Улица;
				ДокументНачисленийПоЛьготам.Здание      = Выборка.Здание;
				
				ДокументНачисленийПоЛьготам.Ответственный = мОтветственный;
				ДокументНачисленийПоЛьготам.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
				
			КонецЕсли;
			
			Если ТаблицаЛьгот.Количество() > 0 Тогда
				
				Для Каждого Строка Из ТаблицаЛьгот Цикл
					
					Строка.СуммаСумм = Окр((Строка.СуммаЛичной + Строка.НачисленоСемейной),2);
					
				КонецЦикла;
				
				ДокументНачисленийПоЛьготам.СписокЛьгот.Очистить();
				
				ДокументНачисленийПоЛьготам.СписокЛьгот.Загрузить(ТаблицаЛьгот);
				
				ТаблицаЛьгот.Свернуть("ЛицевойСчет,Услуга,Начислено");
				
				бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаЛьгот);
				ДокументНачисленийПоЛьготам.ЗаполнениеСчетовКУ(ТаблицаЛьгот);
				
				Для каждого СтрокаЛС из ТаблицаЛьгот Цикл
					
					Отбор = Новый Структура;
					
					Отбор.Очистить();
					Отбор.Вставить("ЛицевойСчет", СтрокаЛС.ЛицевойСчет);
					Отбор.Вставить("Услуга"     , СтрокаЛС.Услуга);
					
					МассивСтрокЛьгот = ДокументНачисленийПоЛьготам.СписокЛьгот.НайтиСтроки(Отбор);
					
					Если МассивСтрокЛьгот.Количество()>1 Тогда
						
						СуммаСумм = 0;
						
						Для Каждого Строка Из МассивСтрокЛьгот Цикл
							
							СуммаСумм = СуммаСумм + Строка.СуммаСумм;
							
							Строка.Начислено = Строка.СуммаСумм; 
							
						КонецЦикла;
						
						СтрокаЛС.Начислено =  СуммаСумм;
						
					КонецЕсли;
					
				КонецЦикла;	
				
				ДокументНачисленийПоЛьготам.ЛицевыеСчета.Очистить();
				ДокументНачисленийПоЛьготам.ЛицевыеСчета.Загрузить(ТаблицаЛьгот);
				
				ДокументНачисленийПоЛьготам.мЛьготаПерсонифицированная           = мКэшЗначений.ЛьготаПерсонифицированная;
				ДокументНачисленийПоЛьготам.мРасчетСУчетомДолейВладения          = мКэшЗначений.РасчетСУчетомДолейВладения;
				ДокументНачисленийПоЛьготам.мУменьшениеНормыЛьготыВПределахФакта = мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта;
				
				Попытка
					
					Если ДокументНачисленийПоЛьготам.ЛицевыеСчета.Количество() > 0 Тогда
						
						ДокументНачисленийПоЛьготам.Записать(РежимЗаписиДокумента.Запись);
						ДокументыНаПроведение.Добавить(ДокументНачисленийПоЛьготам.Ссылка);
						
					КонецЕсли; 
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПровестиДокументы(ДокументыНаПроведение);
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументы(ДокументыНаПроведение)
	
	Для каждого СсылкаНаДокумент Из ДокументыНаПроведение Цикл
		
		Попытка  
			
			Документ = СсылкаНаДокумент.ПолучитьОбъект(); 
			//Pemelnik 280223
			Если ТипЗнч(Документ) = Тип("ДокументОбъект.бит_НачислениеПоЛицевымСчетам") Тогда 
				ПроверитьНачисленияКопеек(Документ);	
			КонецЕсли;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьНачисленияКопеек(Документ) 
    УслугаХВ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000004");
    УслугаГВ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000003");
    УслугаВО = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000005");
    УслугаЭЭ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВ КАК СтоимостьКубаХВ,
		|	лб_НормативыОДНСрезПоследних.СтоимостьКВтч КАК СтоимостьКВтч,
		|	лб_НормативыОДНСрезПоследних.СтоимостьКубаВО КАК СтоимостьКубаВО,
		|	ВЫРАЗИТЬ(лб_НормативыОДНСрезПоследних.СтоимостьГКалл * лб_НормативыОДНСрезПоследних.НормативНаПодогрев + лб_НормативыОДНСрезПоследних.СтоимостьКубаХВнаГВ КАК ЧИСЛО(15, 2)) КАК СтоимостьГКалл
		|ПОМЕСТИТЬ ВТ_Нормативы
		|ИЗ
		|	РегистрСведений.лб_НормативыОДН.СрезПоследних(КонецПериода(&Период, Месяц), Адрес = &Здание) КАК лб_НормативыОДНСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ДанныеПоОбъемамЖКУСрезПоследних.Объем КАК Объем,
		|	бит_ДанныеПоОбъемамЖКУСрезПоследних.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВТ_Объемы
		|ИЗ
		|	РегистрСведений.бит_ДанныеПоОбъемамЖКУ.СрезПоследних(КонецПериода(&Период, Месяц), Здание = &Здание) КАК бит_ДанныеПоОбъемамЖКУСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Объемы.Услуга = &УслугаХВ
		|			ТОГДА ВТ_Объемы.Объем
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОбъемХВ,
		|	0 КАК ОбъемГВ,
		|	0 КАК ОбъемВО,
		|	0 КАК ОбъемЭЭ
		|ПОМЕСТИТЬ ВТ_ОбъемыРазные
		|ИЗ
		|	ВТ_Объемы КАК ВТ_Объемы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	0,
		|	ВЫБОР
		|		КОГДА ВТ_Объемы.Услуга = &УслугаГВ
		|			ТОГДА ВТ_Объемы.Объем
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0
		|ИЗ
		|	ВТ_Объемы КАК ВТ_Объемы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ВТ_Объемы.Услуга = &УслугаВО
		|			ТОГДА ВТ_Объемы.Объем
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	ВТ_Объемы КАК ВТ_Объемы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ВТ_Объемы.Услуга = &УслугаЭЭ
		|			ТОГДА ВТ_Объемы.Объем
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	ВТ_Объемы КАК ВТ_Объемы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ОбъемыРазные.ОбъемХВ) КАК ОбъемХВ,
		|	СУММА(ВТ_ОбъемыРазные.ОбъемГВ) КАК ОбъемГВ,
		|	СУММА(ВТ_ОбъемыРазные.ОбъемВО) КАК ОбъемВО,
		|	СУММА(ВТ_ОбъемыРазные.ОбъемЭЭ) КАК ОбъемЭЭ
		|ПОМЕСТИТЬ ВТ_ОбъемыИтог
		|ИЗ
		|	ВТ_ОбъемыРазные КАК ВТ_ОбъемыРазные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Нормативы.СтоимостьКубаХВ КАК СтоимостьХВ,
		|	ВТ_Нормативы.СтоимостьКВтч КАК СтоимостьЭЭ,
		|	ВТ_Нормативы.СтоимостьКубаВО КАК СтоимостьВО,
		|	ВТ_Нормативы.СтоимостьГКалл КАК СтоимостьГВ,
		|	ВТ_ОбъемыИтог.ОбъемХВ КАК ОбъемХВ,
		|	ВТ_ОбъемыИтог.ОбъемГВ КАК ОбъемГВ,
		|	ВТ_ОбъемыИтог.ОбъемВО КАК ОбъемВО,
		|	ВТ_ОбъемыИтог.ОбъемЭЭ КАК ОбъемЭЭ
		|ИЗ
		|	ВТ_Нормативы КАК ВТ_Нормативы,
		|	ВТ_ОбъемыИтог КАК ВТ_ОбъемыИтог";
	
	Запрос.УстановитьПараметр("Здание", Документ.Здание);
	Запрос.УстановитьПараметр("Период", Документ.Дата);
	Запрос.УстановитьПараметр("УслугаВО", УслугаВО);
	Запрос.УстановитьПараметр("УслугаГВ", УслугаГВ);
	Запрос.УстановитьПараметр("УслугаХВ", УслугаХВ);
	Запрос.УстановитьПараметр("УслугаЭЭ", УслугаЭЭ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Для Каждого Строка Из Документ.ЛицевыеСчета Цикл 
			Если Строка.Услуга = УслугаВО Тогда
				Тариф = Окр(Строка.Объем * Выборка.ОбъемВО, 4);
				Строка.Начислено = Окр(Тариф * Выборка.СтоимостьВО, 2);
			ИначеЕсли Строка.Услуга = УслугаХВ Тогда
				Тариф = Окр(Строка.Объем * Выборка.ОбъемХВ, 4);
				Строка.Начислено = Окр(Тариф * Выборка.СтоимостьХВ, 2);
			ИначеЕсли Строка.Услуга = УслугаГВ Тогда
				Тариф = Окр(Строка.Объем * Выборка.ОбъемГВ, 4);
				Строка.Начислено = Окр(Тариф * Выборка.СтоимостьГВ, 2);
			ИначеЕсли Строка.Услуга = УслугаЭЭ Тогда
				Тариф = Окр(Строка.Объем * Выборка.ОбъемЭЭ, 4);
				Строка.Начислено = Окр(Тариф * Выборка.СтоимостьЭЭ, 2);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Документ.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбщедомовыеНачисления()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Документ");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ОбщедомовыеНачисления";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ДокументОбщедомовыеРасходы = Неопределено;
	
	Отбор = Новый Структура;
	
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Документ.Пустая() Тогда
			
			ДокументОбщедомовыеРасходы = Выборка.Документ.ПолучитьОбъект();
			
			Если ДокументОбщедомовыеРасходы.ПометкаУдаления Тогда
				
				ДокументОбщедомовыеРасходы.УстановитьПометкуУдаления(Ложь);
				
			КонецЕсли; 
			
			ДокументОбщедомовыеРасходы.Начисления.Очистить();
			ДокументОбщедомовыеРасходы.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаОбщедомовыеНачисления = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуОбщедомовыхРасходов();
	
	бит_РасчетыПоКоммунальнымУслугам.РасчитатьНачисленияПоОбщедомовымРасходам(КонецМесяца(Объект.ДатаЗакрытия)
	,Объект.ДатаЗакрытия
	,Объект.ДатаЗакрытия
	,Объект.Организация
	,ТаблицаОбщедомовыеНачисления
	,мКэшЗначений.УчитыватьНачисленияПоГрупповымСчетчикам
	,мКэшЗначений.УчитыватьПерерасчет);
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаОбщедомовыеНачисления);
	
	СписокЛС = ТаблицаОбщедомовыеНачисления.ВыгрузитьКолонку("ЛицевойСчет");
	Колонки  = ТаблицаОбщедомовыеНачисления.Колонки;
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТаблицаОбщедомовыеНачисления, Колонки, СписокЛС, Объект.Организация, Объект.ДатаЗакрытия);
	
	ТаблицаОбщедомовыеНачисления.Сортировать("Приоритет ВОЗР, НаименованиеЛС ВОЗР");
	
	ДокументыНаПроведение = Новый Массив;
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Документ.Пустая() Тогда
			
			ДокументОбщедомовыеРасходы = Выборка.Документ.ПолучитьОбъект();
			
		Иначе
			
			ДокументОбщедомовыеРасходы = Документы.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.СоздатьДокумент();
			
			ДокументОбщедомовыеРасходы.Дата          = КонецМесяца(Объект.ДатаЗакрытия) - 1;
			ДокументОбщедомовыеРасходы.Улица         = Выборка.Улица;
			ДокументОбщедомовыеРасходы.Здание        = Выборка.Здание;
			ДокументОбщедомовыеРасходы.Организация   = Объект.Организация;
			ДокументОбщедомовыеРасходы.Ответственный = мОтветственный;
			ДокументОбщедомовыеРасходы.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
			
		КонецЕсли;
		
		Отбор.Очистить();
		Отбор.Вставить("Здание", Выборка.Здание);
		
		СтрокиПоЗданию = ТаблицаОбщедомовыеНачисления.НайтиСтроки(Отбор);
		
		Если НЕ ДокументОбщедомовыеРасходы = Неопределено Тогда
			
			ДокументОбщедомовыеРасходы.Начисления.Очистить();
			
			Если СтрокиПоЗданию.Количество() > 0 Тогда
				
				Для каждого СтрокаТаблицы Из СтрокиПоЗданию Цикл
					
					НоваяСтрока = ДокументОбщедомовыеРасходы.Начисления.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					
				КонецЦикла; 
				
				Попытка
					
					ДокументОбщедомовыеРасходы.Записать(РежимЗаписиДокумента.Запись);
					ДокументыНаПроведение.Добавить(ДокументОбщедомовыеРасходы.Ссылка);
					
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СсылкаНаДокумент Из ДокументыНаПроведение Цикл
		
		Попытка
			Документ = СсылкаНаДокумент.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАктРеализацию()
	
	тмпТаблицаУслуг = Новый ТаблицаЗначений;
	тмпТаблицаУслуг.Колонки.Добавить("Контрагент"              , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тмпТаблицаУслуг.Колонки.Добавить("Номенклатура"            , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тмпТаблицаУслуг.Колонки.Добавить("Количество"              , ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
    // БИТ_ЖКХ 23.10.2017 11:25:30 Начало правки... 
    //тмпТаблицаУслуг.Колонки.Добавить("Цена"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("Цена"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	тмпТаблицаУслуг.Колонки.Добавить("ЛС"                      , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	тмпТаблицаУслуг.Колонки.Добавить("НЖ"                      , Новый ОписаниеТипов("Булево") );
	тмпТаблицаУслуг.Колонки.Добавить("Здание"                  , Новый ОписаниеТипов("СправочникСсылка.бит_СписокЗданий"));
    // БИТ_ЖКХ 23.10.2017 11:25:32 Конец правки. 
    тмпТаблицаУслуг.Колонки.Добавить("Сумма"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СтавкаНДС"               , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаНДС"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,10));
	тмпТаблицаУслуг.Колонки.Добавить("НоменклатурнаяГруппа"    , Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетУчетаНДСПоРеализации", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ПлановаяСтоимость"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаПлановая"           , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СчетДоходов"             , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетРасходов"            , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ДоговорКонтрагента"      , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Документ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Услуга");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Контрагент");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетАбонента");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетКУ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Начислено");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДоговорКонтрагента");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
    
    // БИТ_ЖКХ 23.10.2017 11:26:54 Начало правки... 
	СтруктураНастроек.ОбязательныеПоля.Добавить("Тариф");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ОсновнаяСтавка");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛС");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ТипКвартиры");
	// БИТ_ЖКХ 23.10.2017 11:27:01 Конец правки. 
    
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	// БИТ_ЖКХ 23.10.2017 11:27:29 Начало правки... 
	//СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "УчетСобственныхУслуг";
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "УчетСобственныхУслугОбъединенный";
    тмпТаблицаУслугНЖ = тмпТаблицаУслуг.СкопироватьКолонки();
	// БИТ_ЖКХ 23.10.2017 11:27:43 Конец правки. 
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаДокумент = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		тмпТаблицаУслуг.Очистить();
		// БИТ_ЖКХ 23.10.2017 11:27:56 Начало правки... 
        тмпТаблицаУслугНЖ.Очистить();
		//Основание = ВыборкаДокумент.Здание;
		Основание = ВыборкаДокумент.Документ;
		// БИТ_ЖКХ 23.10.2017 11:28:00 Конец правки. 
		Выборка = ВыборкаДокумент.Выбрать();
		ЗданиеСсылка = ВыборкаДокумент.Здание; // БИТ_ЖКХ 23.10.2017 11:28:59 
		Пока Выборка.Следующий() Цикл
			
			Контрагент = Неопределено;
            // БИТ_ЖКХ 23.10.2017 11:29:10 Начало правки... 
            ДоговорКонтрагента = Неопределено;
			Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
				Контрагент = Выборка.Контрагент;
                ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
            // БИТ_ЖКХ 23.10.2017 11:29:14 Конец правки.
			ИначеЕсли Выборка.СчетАбонента.Код = "76.КУ" Тогда
				
				Контрагент = мКэшЗначений.Контрагент;
				
			Иначе
				
				СтрокаСубконта = Выборка.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
				
				Если НЕ СтрокаСубконта = Неопределено тогда
					
					НомерСтрокиСубконтоКонтрагент = СтрокаСубконта.НомерСтроки;
					
					Контрагент = Выборка["Субконто" + НомерСтрокиСубконтоКонтрагент];
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Номенклатура = Неопределено;
			
			НомерСтрокиСубконтоНоменклатура = -1;
			
			СтрокаСубконта = Выборка.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто");
			
			Если НЕ СтрокаСубконта = Неопределено Тогда
				
				НомерСтрокиСубконтоНоменклатура = СтрокаСубконта.НомерСтроки;
				
				Номенклатура = Выборка["СубконтоКУ"+НомерСтрокиСубконтоНоменклатура];
				
			КонецЕсли;
			
			НоменклатурнаяГруппа = Неопределено;
			СтавкаНДС            = Неопределено;
			
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				
				НомерСтрокиСубконтоНоменклатурныеГруппы = -1;
				
				СтрокаСубконта = Выборка.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто");
				
				Если НЕ СтрокаСубконта = Неопределено тогда
					
					НомерСтрокиСубконтоНоменклатурныеГруппы = СтрокаСубконта.НомерСтроки;
					
					НоменклатурнаяГруппа = Выборка["СубконтоКУ"+НомерСтрокиСубконтоНоменклатурныеГруппы];
					
				КонецЕсли;
				
				НомерСтрокиСубконтоСтавкиНДС = -1;
				
				СтрокаСубконта = Выборка.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто");
				
				Если НЕ СтрокаСубконта = Неопределено Тогда
					
					НомерСтрокиСубконтоСтавкиНДС = СтрокаСубконта.НомерСтроки;
					
					СтавкаНДС = Выборка["СубконтоКУ"+НомерСтрокиСубконтоСтавкиНДС];
					
				КонецЕсли;
				
			КонецЕсли; 
			
			СчетРасходов = Неопределено;
			
			Если Выборка.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД Тогда
				
				СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
				
			ИначеЕсли Выборка.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД Тогда
				
				СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажЕНВД;
				
			КонецЕсли; 
			// БИТ_ЖКХ 23.10.2017 11:30:16 Начало правки... 
     		Если Выборка.Тариф = 0 Тогда
				Цена = Выборка.ОсновнаяСтавка;
			Иначе
				Цена = Выборка.Тариф;
			КонецЕсли;
            
            Если Выборка.ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение Тогда
                НЖ = Истина;    
            Иначе
                НЖ = Ложь;              
            КонецЕсли;
			// БИТ_ЖКХ 23.10.2017 11:30:26 Конец правки. 
			
			Если НЕ Номенклатура = Неопределено И НЕ Выборка.начислено = 0 Тогда
                    НоваяСтрока = тмпТаблицаУслуг.Добавить();
    				НоваяСтрока.Контрагент               = Контрагент;
    				НоваяСтрока.Номенклатура             = Номенклатура;
    				НоваяСтрока.Количество               = 1;
                    // БИТ_ЖКХ 23.10.2017 11:31:06 Начало правки...                    
                    //НоваяСтрока.Цена                     = Выборка.Начислено;
    				НоваяСтрока.Цена                     = Цена;
                    // БИТ_ЖКХ 23.10.2017 11:31:09 Конец правки.                     
                    НоваяСтрока.Сумма                    = Выборка.Начислено;
    				НоваяСтрока.СтавкаНДС                = СтавкаНДС;
    				НоваяСтрока.СуммаНДС                 = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Выборка.Начислено,Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
    				НоваяСтрока.НоменклатурнаяГруппа     = НоменклатурнаяГруппа;
    				НоваяСтрока.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.Продажи_НДС;
    				НоваяСтрока.ПлановаяСтоимость        = Выборка.Начислено;
    				НоваяСтрока.СуммаПлановая            = Выборка.Начислено;
    				НоваяСтрока.СчетДоходов              = Выборка.СчетКУ;
    				НоваяСтрока.СчетРасходов             = СчетРасходов;
    				НоваяСтрока.ДоговорКонтрагента       = Выборка.ДоговорКонтрагента;
					// БИТ_ЖКХ 23.10.2017 11:31:38 Начало правки... 
					НоваяСтрока.ЛС                       = Выборка.ЛицевойСчет;
                    НоваяСтрока.НЖ                       = НЖ;
                    
                    Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
                    	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По лицевому счету: " + Выборка.ЛицевойСчет + " Контрагент не определен.");
                    КонецЕсли;
                    Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
                    	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По лицевому счету: " + Выборка.ЛицевойСчет + " есть услуги с пустой номенклатурой.");
                    КонецЕсли;
					// БИТ_ЖКХ 23.10.2017 11:31:40 Конец правки. 
			КонецЕсли;
		КонецЦикла; 
		
		ТаблицаУслуг = тмпТаблицаУслуг.Скопировать();
		
		Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагенту И НЕ мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
			// БИТ_ЖКХ 23.10.2017 11:32:43 Начало правки... 
			//ТаблицаУслуг.Свернуть("Номенклатура,
			//|СтавкаНДС, 
			//|НоменклатурнаяГруппа, 
			//|СчетУчетаНДСПоРеализации,
			//|СчетДоходов,
			//|СчетРасходов",
			//"Цена,
			//|Сумма,
			//|СуммаНДС,
			//|ПлановаяСтоимость,
			//|СуммаПлановая");
			ТаблицаУслуг.Свернуть("Номенклатура,
			|СтавкаНДС, 
			|НоменклатурнаяГруппа, 
			|СчетУчетаНДСПоРеализации,
			|СчетДоходов,
			|СчетРасходов,
            |Цена",
			"Сумма,
			|СуммаНДС,
			|ПлановаяСтоимость,
			|СуммаПлановая");
			// БИТ_ЖКХ 23.10.2017 11:32:47 Конец правки. 
			
			Если ТаблицаУслуг.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
			Контрагент         = мКэшЗначений.Контрагент;
			ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			МассивВидовДоговоров = Новый Массив;
			МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
			Если ЗначениеЗаполнено(ВыборкаДокумент.ДоговорКонтрагента) Тогда
				ДоговорКонтрагента = ВыборкаДокумент.ДоговорКонтрагента;
			Иначе	
				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
			КонецЕсли;
			
			// БИТ_ЖКХ 23.10.2017 11:33:14 Начало правки... 
			//СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг);
			СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг, ЗданиеСсылка, );
			// БИТ_ЖКХ 23.10.2017 11:33:15 Конец правки. 
			
		Иначе
			// БИТ_ЖКХ 23.10.2017 11:34:25 Начало правки... 
			//ТаблицаУслуг.Свернуть("Контрагент,
			//|ДоговорКонтрагента,
			//|Номенклатура,
			//|СтавкаНДС, 
			//|НоменклатурнаяГруппа, 
			//|СчетУчетаНДСПоРеализации,
			//|СчетДоходов,
			//|СчетРасходов",
			//"Цена,
			//|Сумма,
			//|СуммаНДС,
			//|ПлановаяСтоимость,
			//|СуммаПлановая");
			//
			//Запрос = Новый Запрос;
			//Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслуг);
			//
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ТаблицаУслуг.Контрагент,
			//|	ТаблицаУслуг.ДоговорКонтрагента,
			//|	ТаблицаУслуг.Номенклатура,
			//|	ТаблицаУслуг.СтавкаНДС,
			//|	ТаблицаУслуг.НоменклатурнаяГруппа,
			//|	ТаблицаУслуг.СчетУчетаНДСПоРеализации,
			//|	ТаблицаУслуг.СчетДоходов,
			//|	ТаблицаУслуг.СчетРасходов,
			//|	ТаблицаУслуг.Цена,
			//|	ТаблицаУслуг.Сумма,
			//|	ТаблицаУслуг.СуммаНДС,
			//|	ТаблицаУслуг.ПлановаяСтоимость,
			//|	ТаблицаУслуг.СуммаПлановая
			//|ПОМЕСТИТЬ ТабУслуг
			//|ИЗ
			//|	&ТаблицаУслуг КАК ТаблицаУслуг
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	ТабУслуг.Контрагент КАК Контрагент,
			//|	ТабУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
			//|	ТабУслуг.Номенклатура КАК Номенклатура,
			//|	ТабУслуг.СтавкаНДС,
			//|	ТабУслуг.НоменклатурнаяГруппа,
			//|	ТабУслуг.СчетУчетаНДСПоРеализации,
			//|	ТабУслуг.СчетДоходов,
			//|	ТабУслуг.СчетРасходов,
			//|	ТабУслуг.Цена,
			//|	ТабУслуг.Сумма,
			//|	ТабУслуг.СуммаНДС,
			//|	ТабУслуг.ПлановаяСтоимость,
			//|	ТабУслуг.СуммаПлановая
			//|ИЗ
			//|	ТабУслуг КАК ТабУслуг
			//|ГДЕ
			//|	НЕ ТабУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			//|	И НЕ ТабУслуг.Контрагент ЕСТЬ NULL
			//|ИТОГИ ПО
			//|	Контрагент,
			//|	ДоговорКонтрагента";
			//
			//ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//Пока ВыборкаКонтрагент.Следующий() Цикл // Обход контрагентов.
			//	
			//	Контрагент         = ВыборкаКонтрагент.Контрагент;
			//	ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			//	МассивВидовДоговоров = Новый Массив;
			//	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			//	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
			//	ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
			//	
			//	ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//	Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
			//		
			//		Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
			//			ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
			//		КонецЕсли;
			//		Выборка = ВыборкаДоговорКонтрагента.Выбрать();
			//		СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка);
			//		
			//	КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
			//	
			//КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
			
			Отбор = Новый Структура;
            Отбор.Вставить("НЖ", ЛОЖЬ);
            ТаблицаУслугЖ = ТаблицаУслуг.Скопировать(Отбор);    
            Отбор.Вставить("НЖ", Истина);
            ТаблицаУслугНЖ = ТаблицаУслуг.Скопировать(Отбор);    
            
            Если ТаблицаУслугЖ.Количество() > 0 Тогда
    			ТаблицаУслугЖ.Свернуть("Контрагент,
    			|ДоговорКонтрагента,
    			|Номенклатура,
    			|СтавкаНДС, 
    			|НоменклатурнаяГруппа, 
    			|СчетУчетаНДСПоРеализации,
    			|СчетДоходов,
    			|СчетРасходов,
                |Цена",
    			"Сумма,
    			|СуммаНДС,
    			|ПлановаяСтоимость,
    			|СуммаПлановая");
    			
    			Запрос = Новый Запрос;
    			Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслугЖ);
    			
    			Запрос.Текст = 
    			"ВЫБРАТЬ
    			|	ТаблицаУслуг.Контрагент,
    			|	ТаблицаУслуг.ДоговорКонтрагента,
    			|	ТаблицаУслуг.Номенклатура,
    			|	ТаблицаУслуг.СтавкаНДС,
    			|	ТаблицаУслуг.НоменклатурнаяГруппа,
    			|	ТаблицаУслуг.СчетУчетаНДСПоРеализации,
    			|	ТаблицаУслуг.СчетДоходов,
    			|	ТаблицаУслуг.СчетРасходов,
    			|	ТаблицаУслуг.Цена,
    			|	ТаблицаУслуг.Сумма,
    			|	ТаблицаУслуг.СуммаНДС,
    			|	ТаблицаУслуг.ПлановаяСтоимость,
    			|	ТаблицаУслуг.СуммаПлановая
    			|ПОМЕСТИТЬ ТабУслуг
    			|ИЗ
    			|	&ТаблицаУслуг КАК ТаблицаУслуг
    			|;
    			|
    			|////////////////////////////////////////////////////////////////////////////////
    			|ВЫБРАТЬ
    			|	ЕСТЬNULL(ТабУслуг.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
    			|	ТабУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
    			|	ТабУслуг.Номенклатура КАК Номенклатура,
    			|	ТабУслуг.СтавкаНДС,
    			|	ТабУслуг.НоменклатурнаяГруппа,
    			|	ТабУслуг.СчетУчетаНДСПоРеализации,
    			|	ТабУслуг.СчетДоходов,
    			|	ТабУслуг.СчетРасходов,
    			|	ТабУслуг.Цена,
    			|	ТабУслуг.Сумма,
    			|	ТабУслуг.СуммаНДС,
    			|	ТабУслуг.ПлановаяСтоимость,
    			|	ТабУслуг.СуммаПлановая
    			|ИЗ
    			|	ТабУслуг КАК ТабУслуг
				//|ГДЕ
				//|	НЕ ТабУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				//|	И НЕ ТабУслуг.Контрагент ЕСТЬ NULL
    			|ИТОГИ ПО
    			|	Контрагент,
    			|	ДоговорКонтрагента";
    			
    			ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    			Пока ВыборкаКонтрагент.Следующий() Цикл // Обход контрагентов.
    				
    				Контрагент         = ВыборкаКонтрагент.Контрагент;
    				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
    				МассивВидовДоговоров = Новый Массив;
    				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
    				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
    				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
    				
    				ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
                        

                        //УИД = СгенерироватьИдентификатор(ТаблицаУслуг,Контрагент,ВыборкаДоговорКонтрагента.ДоговорКонтрагента,ЛОЖЬ);
                        
                        Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
    						ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
    					КонецЕсли;
    					Выборка = ВыборкаДоговорКонтрагента.Выбрать();
    					СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка, ЗданиеСсылка, Неопределено);
    					
    				КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
    				
    			КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
            КонецЕсли;           
            
            //Для нежилых помещений
            //На каждого договора должен быть один ЛС - объязательно
            Если ТаблицаУслугНЖ.Количество() > 0 Тогда
    			ТаблицаУслугНЖ.Свернуть("Контрагент,
    			|ДоговорКонтрагента,
    			|Номенклатура,
    			|СтавкаНДС, 
    			|НоменклатурнаяГруппа, 
    			|СчетУчетаНДСПоРеализации,
    			|СчетДоходов,
    			|СчетРасходов,
                |ЛС,
                |Цена",
    			"Сумма,
    			|СуммаНДС,
    			|ПлановаяСтоимость,
    			|СуммаПлановая");
    			
    			Запрос = Новый Запрос;
    			Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслугНЖ);
    			
    			Запрос.Текст = 
    			"ВЫБРАТЬ
    			|	ТаблицаУслуг.Контрагент КАК Контрагент,
    			|	ТаблицаУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
    			|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
    			|	ТаблицаУслуг.СтавкаНДС КАК СтавкаНДС,
    			|	ТаблицаУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
    			|	ТаблицаУслуг.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
    			|	ТаблицаУслуг.СчетДоходов КАК СчетДоходов,
    			|	ТаблицаУслуг.СчетРасходов КАК СчетРасходов,
    			|	ТаблицаУслуг.ЛС КАК ЛС,
    			|	ТаблицаУслуг.Цена КАК Цена,
    			|	ТаблицаУслуг.Сумма КАК Сумма,
    			|	ТаблицаУслуг.СуммаНДС КАК СуммаНДС,
    			|	ТаблицаУслуг.ПлановаяСтоимость КАК ПлановаяСтоимость,
    			|	ТаблицаУслуг.СуммаПлановая КАК СуммаПлановая
    			|ПОМЕСТИТЬ ТабУслуг
    			|ИЗ
    			|	&ТаблицаУслуг КАК ТаблицаУслуг
    			|;
    			|
    			|////////////////////////////////////////////////////////////////////////////////
    			|ВЫБРАТЬ
    			|	ЕСТЬNULL(ТабУслуг.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
    			|	ТабУслуг.ЛС КАК ЛС,
    			|	ТабУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
    			|	ТабУслуг.Номенклатура КАК Номенклатура,
    			|	ТабУслуг.СтавкаНДС КАК СтавкаНДС,
    			|	ТабУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
    			|	ТабУслуг.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
    			|	ТабУслуг.СчетДоходов КАК СчетДоходов,
    			|	ТабУслуг.СчетРасходов КАК СчетРасходов,
    			|	ТабУслуг.Цена КАК Цена,
    			|	ТабУслуг.Сумма КАК Сумма,
    			|	ТабУслуг.СуммаНДС КАК СуммаНДС,
    			|	ТабУслуг.ПлановаяСтоимость КАК ПлановаяСтоимость,
    			|	ТабУслуг.СуммаПлановая КАК СуммаПлановая
    			|ИЗ
    			|	ТабУслуг КАК ТабУслуг
				//|ГДЕ
				//|	НЕ ТабУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
 				//|   И НЕ ТабУслуг.Контрагент ЕСТЬ NULL
   				|ИТОГИ ПО
    			|	Контрагент,
    			|	ДоговорКонтрагента,
    			|	ЛС";
    			
    			ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    			Пока ВыборкаКонтрагент.Следующий() Цикл // Обход контрагентов.
    				
    				Контрагент         = ВыборкаКонтрагент.Контрагент;
    				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
    				МассивВидовДоговоров = Новый Массив;
    				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
    				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
    				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
    				ЛС = "";
    				ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
                        
    					Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
    						ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
    					КонецЕсли;
    					ВыборкаЛС = ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
                        Пока ВыборкаЛС.Следующий() Цикл
                            Если ЗначениеЗаполнено(ВыборкаЛС.ЛС) Тогда
                              ЛС =  ВыборкаЛС.ЛС;
                            КонецЕсли; 
                            Выборка = ВыборкаЛС.Выбрать();
        					СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка, ЗданиеСсылка, ЛС, Истина);
                        КонецЦикла; 
    				КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
    				
    			КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
            КонецЕсли;
            // БИТ_ЖКХ 23.10.2017 11:35:03 Конец правки. 
            
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервере
Процедура СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, ДокументОснование, ДанныеТаблицы, ЗданиеСсылка, ЛС, НежилоеПомещение = Ложь)
	
	// БИТ_ЖКХ 23.10.2017 11:20:58 Начало правки...
	//СсылкаДокументРеализация = НайтиДокументНаРеализацию(Контрагент, ДоговорКонтрагента, ДокументОснование);
	СсылкаДокументРеализация = НайтиДокументНаРеализацию(Контрагент, ДоговорКонтрагента, ЗданиеСсылка, ЛС);
	// БИТ_ЖКХ 23.10.2017 11:21:03 Конец правки. 
	
	Если (НЕ ЗначениеЗаполнено(СсылкаДокументРеализация)) Тогда
		ДокументРеализация = Документы[Объект.ДокументРаспределенияРасходовНаОказаниеУслуг].СоздатьДокумент();
	Иначе
		ДокументРеализация = СсылкаДокументРеализация.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументРеализация.Проведен Тогда
		
		Если НЕ  бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.ОтменаПроведения,,"Ошибки") Тогда
			Возврат;
		КонецЕсли; 
		
	КонецЕсли; 
	// БИТ_ЖКХ 23.10.2017 11:21:49 Начало правки... 
	Если ДокументРеализация.ПометкаУдаления Тогда
		Сообщить("Пометка на удаления снята с документа: "+ДокументРеализация);
        ДокументРеализация.ПометкаУдаления = Ложь;
	КонецЕсли;
	// БИТ_ЖКХ 23.10.2017 11:21:52 Конец правки. 
	ДокументРеализация.Услуги.Очистить();
	
	Попытка
		ДокументРеализация.Товары.Очистить();
	Исключение
		
	КонецПопытки;
	
	ДокументРеализация.Дата                = КонецМесяца(Объект.ДатаЗакрытия) - 1;
	ДокументРеализация.Организация         = Объект.Организация;
	ДокументРеализация.Ответственный       = мОтветственный;
	ДокументРеализация.Контрагент          = Контрагент;
	ДокументРеализация.ДоговорКонтрагента  = ДоговорКонтрагента;
	ДокументРеализация.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	// БИТ_ЖКХ 23.10.2017 11:22:31 Начало правки... 
	//ДокументРеализация.Комментарий         = "На основании " + ДокументОснование;
	//ДокументРеализация.ВалютаДокумента     = Константы.ВалютаРегламентированногоУчета.Получить();          
    ДокументРеализация.Комментарий         = Строка(ЗданиеСсылка.Улица)+", д. "+Строка(ЗданиеСсылка.Наименование)+?(ПустаяСтрока(ЗданиеСсылка.Корпус),"",", кор. "+ЗданиеСсылка.Корпус) +?(ЗначениеЗаполнено(ЛС),"Л/сч "+ЛС,"")+" \ Документ создан автоматически при закрытии месяца \ дата создания " + ТекущаяДата();
	//16.05.2019
	если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг <> "АктОбОказанииПроизводственныхУслуг" тогда
	
     ДокументРеализация.бит_Здание          = ЗданиеСсылка;
     ДокументРеализация.бит_ЛицевойСчет     = ЛС;
	 
	конецесли; 
	// БИТ_ЖКХ 23.10.2017 11:22:33 Конец правки. 
	ДокументРеализация.ВалютаДокумента     = Константы.ВалютаРегламентированногоУчета.Получить();          
	ДокументРеализация.СуммаВключаетНДС    = Истина;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Контрагент, ДоговорКонтрагента);
	
	ДокументРеализация.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
	ДокументРеализация.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
	
	СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументРеализация.ВалютаДокумента, ДокументРеализация.Дата);
	
	ДокументРеализация.КурсВзаиморасчетов      = СтруктураКурсаДокумента.Курс;
	ДокументРеализация.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
	
	ДокументРеализация.бит_ДокументОснование = ДокументОснование;
	
	Если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "АктОбОказанииПроизводственныхУслуг" Тогда
		
		ДокументРеализация.СчетЗатрат           = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
		ДокументРеализация.ПодразделениеЗатрат  = Объект.ПодразделениеЗатрат;
		ДокументРеализация.НоменклатурнаяГруппа = Объект.НоменклатурнаяГруппа;
		
	Иначе
		ДокументРеализация.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		
		ДокументРеализация.Склад = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
	КонецЕсли;
	
		
	Если ТипЗнч(ДанныеТаблицы) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		
		Пока ДанныеТаблицы.Следующий() Цикл
			
			ЗаполнитьДанныеДокументаРеализации(ДанныеТаблицы, ДокументРеализация);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеТаблицы) = Тип("ТаблицаЗначений") Тогда 
		
		Для каждого СтрокаТаблицы Из ДанныеТаблицы Цикл
			
			ЗаполнитьДанныеДокументаРеализации(СтрокаТаблицы, ДокументРеализация);
			
		КонецЦикла;
		
	КонецЕсли;
    // БИТ_ЖКХ 23.10.2017 11:23:12 Начало правки... 	
	//Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.Проведение,,) И Объект.ФормироватьСчетФактураВыданный Тогда
	//	ФормироватьСчетФактуру(ДокументРеализация.Ссылка);
	//КонецЕсли;
	
	// БИТ ЖКХ 19.06.2020
	если Объект.ВидОперацииУслуги = истина тогда
		ДокументРеализация.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги;
		// БИТ ЖКХ 25.01.2021
		ДокументРеализация.бит_Здание = неопределено;
	конецесли;	

	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.Запись,,);
		Возврат;
	КонецЕсли;
	
	Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументРеализация,РежимЗаписиДокумента.Проведение,,) Тогда
		Если Объект.ФормироватьСчетФактураВыданный Тогда
			ФормироватьСчетФактуру(ДокументРеализация.Ссылка);
		КонецЕсли; 
		Если Объект.ФормироватьСчетНаОплату И НежилоеПомещение Тогда
			ФормироватьСчетНаОплату(ДокументРеализация.Ссылка);
		КонецЕсли
	КонецЕсли;
    // БИТ_ЖКХ 23.10.2017 11:23:29 Конец правки. 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДокументаРеализации(Источник, ДокументРеализация)
	
	ИмяТаблицы = "Услуги";
	
	Если НЕ Источник.Номенклатура.Услуга И Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "РеализацияТоваровУслуг" Тогда
		ИмяТаблицы = "Товары";
	КонецЕсли;
	
	НоваяСтрока = ДокументРеализация[ИмяТаблицы].Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Субконто   = Источник.НоменклатурнаяГруппа;
	
	// БИТ_ЖКХ 23.10.2017 11:20:04 Начало правки... 
	Если Источник.Цена = 0 ИЛИ Источник.Цена = Неопределено Тогда 
		НоваяСтрока.Количество      = 1;
        НоваяСтрока.Цена            = Источник.Сумма;
	Иначе 
		НоваяСтрока.Количество = Формат(Источник.Сумма / Источник.Цена,"ЧЦ=10; ЧДЦ=4");
	КонецЕсли;	
	// БИТ_ЖКХ 23.10.2017 11:20:11 Конец правки. 
	Если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "РеализацияТоваровУслуг" Тогда
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументРеализация.Организация,
		
		НоваяСтрока.Номенклатура,
		ДокументРеализация.Склад,
		ДокументРеализация.Дата,
		ДокументРеализация.ДеятельностьНаПатенте);
	Иначе
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументРеализация.Организация,
		НоваяСтрока.Номенклатура,
		,
		ДокументРеализация.Дата,
		ДокументРеализация.ДеятельностьНаПатенте);
	КонецЕсли; 
	
	
	Если ИмяТаблицы = "Товары" Тогда
		НоваяСтрока.СчетУчета  = СчетаУчета.СчетУчета;
	ИначеЕсли Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = "РеализацияТоваровУслуг" Тогда
		НоваяСтрока.Содержание = НоваяСтрока.Номенклатура.НаименованиеПолное;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСчетФактуру(ДокументСсылка)
	
	// Попытаемся найти счет-фактуру.
	
	СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокументСсылка, "СчетФактураВыданный");
	
	Если (ДокументСсылка.ПометкаУдаления) И Не ЗначениеЗаполнено(СчетФактура) Тогда
		ВызватьИсключение "Документ: "+ ДокументСсылка +"помечен на удаление";
		Возврат;
	КонецЕсли;
	
	ОбъектСчетаФактуры = Неопределено;
	
	// Если потерпели неудачу, то необходимо ввести новый документ. 
	Если (НЕ ЗначениеЗаполнено(СчетФактура)) Тогда
		// Вводим новый документ на основании нашего.
		ОбъектСчетаФактуры = Документы.СчетФактураВыданный.СоздатьДокумент();
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбъектСчетаФактуры.ДокументыОснования.Очистить();
	ОбъектСчетаФактуры.ВидСчетаФактуры = Неопределено;
	
	Попытка
		ОбъектРеализация = ДокументСсылка.ПолучитьОбъект();
		ОбъектРеализация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		Если ОбъектСчетаФактуры.Проведен Тогда
			
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ОбъектСчетаФактуры,РежимЗаписиДокумента.ОтменаПроведения,,);
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	ОбъектСчетаФактуры.Заполнить(ДокументСсылка);
	ОбъектСчетаФактуры.Ответственный = ДокументСсылка.Ответственный;
	ОбъектСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;

	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ОбъектСчетаФактуры,РежимЗаписиДокумента.Проведение,,);
	
КонецПроцедуры

// БИТ_ЖКХ 23.10.2017 11:36:50 Начало правки... 
&НаСервере
Процедура ФормироватьСчетНаОплату(ДокументСсылка)
	
	ДокСчет = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка,
	|	СчетНаОплатуПокупателю.ПометкаУдаления
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.бит_ДокРеализации = &ДокРеализации";
	
	Запрос.УстановитьПараметр("ДокРеализации", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокСчет = ВыборкаДетальныеЗаписи.Ссылка;
		ПомеченНаУд = ВыборкаДетальныеЗаписи.ПометкаУдаления;
	КонецЦикла;	
	
	Если ДокСчет <> Документы.СчетНаОплатуПокупателю.ПустаяСсылка() Тогда
		Если ПомеченНаУд Тогда
			Сообщить("Пометка на удаления снята с документа: "+ДокСчет);
		КонецЕсли;
		ДокументСчет = ДокСчет.ПолучитьОбъект();
        ДокументСчет.ПометкаУдаления = ЛОЖЬ;
	Иначе
		ДокументСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	КонецЕсли;
	
	//ДокументСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	//ДокументСсылка = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
	ДокументСчет.бит_ДокРеализации = ДокументСсылка;
	//17.05.2019
	если Строка(ТипЗнч(ДокументСсылка)) <> "Оказание производственных услуг" тогда
	 ДокументСчет.бит_ЛицевойСчет = ДокументСсылка.бит_ЛицевойСчет;
	конецесли; 
	ДокументСчет.бит_ПериодСчета = Формат(ДокументСсылка.Дата, "ДФ=""ММММ гггг 'г.'""");
    ДокументСчет.ОрганизацияПолучатель = ДокументСсылка.Организация;
	ДокументСчет.СтруктурнаяЕдиница = ДокументСсылка.Организация.ОсновнойБанковскийСчет;
	ДокументСчет.Дата = ДокументСсылка.Дата;
	ДокументСчет.Ответственный = ДокументСсылка.Ответственный;
	ДокументСчет.Комментарий = ДокументСсылка.Комментарий;
	ДокументСчет.Заполнить(ДокументСсылка);
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументСчет,РежимЗаписиДокумента.Запись,,);
	
	
КонецПроцедуры
// БИТ_ЖКХ 23.10.2017 11:36:55 Конец правки.

&НаСервере
Функция НайтиДокументНаРеализацию(Контрагент, ДоговорКонтрагента, Здание, ЛС)	
	
	ДокументРеализации = Неопределено;
	// БИТ_ЖКХ 23.10.2017 11:18:05 Начало правки... 
	ЗапросУсл="";
    Если ЗначениеЗаполнено(ЛС) Тогда
        ЗапросУсл =  "
        |	И ДокументРеализации.бит_ЛицевойСчет = &бит_ЛицевойСчет";
	КонецЕсли; 
	
	//16.05.2019
	ДопЗапрос = "";
	// 23.06.2020
	если Объект.ДокументРаспределенияРасходовНаОказаниеУслуг <> "АктОбОказанииПроизводственныхУслуг" тогда
		ДопЗапрос = " И ( ДокументРеализации.бит_Здание = &бит_Здание " + строка(" ИЛИ  ") + 
		                строка(" ДокументРеализации.бит_Здание = &пустоеЗдание) ") +   
		                     ЗапросУсл + " ";
	конецесли;	
	
	// БИТ_ЖКХ 23.10.2017 11:18:10 Конец правки. 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент"        , Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	// БИТ_ЖКХ 23.10.2017 11:17:43 Начало правки... 
	//Запрос.УстановитьПараметр("ДокументОснование" , ДокументОснование);
	Запрос.УстановитьПараметр("бит_Здание" , Здание);
	Запрос.УстановитьПараметр("пустоеЗдание" , справочники.бит_СписокЗданий.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидОперации" ,Перечисления.ВидыОперацийРеализацияТоваров.Услуги);

	Запрос.УстановитьПараметр("бит_ЛицевойСчет" , ЛС);
    Запрос.УстановитьПараметр("ДатаНач"        , НачалоМесяца(Объект.ДатаЗакрытия));
	Запрос.УстановитьПараметр("ДатаКон"        , КонецМесяца(Объект.ДатаЗакрытия));
	// БИТ_ЖКХ 23.10.2017 11:17:45 Конец правки. 
	
	Запрос.Текст = 
	// БИТ_ЖКХ 23.10.2017 11:17:11 Начало правки...
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	//|	ДокументРеализации.Ссылка
	//|ИЗ
	//|	Документ."+Объект.ДокументРаспределенияРасходовНаОказаниеУслуг+" КАК ДокументРеализации
	//|ГДЕ
	//|	ДокументРеализации.бит_ДокументОснование = &ДокументОснование
	//|	И ДокументРеализации.Контрагент = &Контрагент
	//|	И ДокументРеализации.ДоговорКонтрагента = &ДоговорКонтрагента";

	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДокументРеализации.Ссылка
	|ИЗ
	|	Документ."+Объект.ДокументРаспределенияРасходовНаОказаниеУслуг+" КАК ДокументРеализации
	|ГДЕ
	|	ДокументРеализации.Контрагент = &Контрагент "
	+ ДопЗапрос + "	
//	|	И ДокументРеализации.бит_Здание = &бит_Здание"+ЗапросУсл+"	
	|	И ДокументРеализации.ДоговорКонтрагента = &ДоговорКонтрагента
	| 	И ДокументРеализации.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	// БИТ_ЖКХ 23.10.2017 11:17:21 Конец правки. 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДокументРеализации = Выборка.Ссылка;
		
	КонецЕсли; 
	
	Возврат ДокументРеализации;
	
КонецФункции

&НаСервере
// Процедура обновляет параметры настроек ЖКХ из регистра актуальным значением.
//
Процедура ОбновитьПараметрыЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"         , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта", Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"    , Ложь);
	ПараметрыЖКХ.Вставить("ОбщедомовыеРасходыВГрафеНачисления" , Ложь);
	ПараметрыЖКХ.Вставить("СчетчикиПодкрутка"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"          , Ложь);   
	ПараметрыЖКХ.Вставить("УчитыватьПерерасчет"                , Ложь);
	ПараметрыЖКХ.Вставить("СчетАбонента"                       , Неопределено);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика" , Ложь);
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика" , Ложь);
	ПараметрыЖКХ.Вставить("ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц", Ложь);
	ПараметрыЖКХ.Вставить("Контрагент"                             , Неопределено);
	ПараметрыЖКХ.Вставить("ФормироватьАктИРеализациюПоКонтрагенту" , Ложь);
	ПараметрыЖКХ.Вставить("УчитыватьНачисленияПоГрупповымСчетчикам", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(Объект.ДатаЗакрытия), Объект.Организация, ПараметрыЖКХ);
	
	ЗаполнитьЗначенияСвойств(мКэшЗначений, ПараметрыЖКХ);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период"     , Объект.ДатаЗакрытия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитика.ПорядокРаспределенияРасходовНаОказаниеУслуг
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитика";
	
	мКэшЗначений.ПорядокРаспределенияРасходовНаОказаниеУслуг = Неопределено;

	Объект.ДокументРаспределенияРасходовНаОказаниеУслуг = Элементы.ДокументРаспределенияРасходовНаОказаниеУслуг.СписокВыбора[1].Значение;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПериода()
	
	// Обновляем представление периода на форме.
	ПредставлениеПериодаРегистрации = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"),
	Объект.ДатаЗакрытия, 
	КонецМесяца(Объект.ДатаЗакрытия));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаЗакрытия = РезультатВыбора.КонецПериода;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАктРеализациюРазовые()
	
	тмпТаблицаУслуг = Новый ТаблицаЗначений;
	тмпТаблицаУслуг.Колонки.Добавить("Контрагент"              , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тмпТаблицаУслуг.Колонки.Добавить("Номенклатура"            , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тмпТаблицаУслуг.Колонки.Добавить("Количество"              , ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	тмпТаблицаУслуг.Колонки.Добавить("Цена"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("Сумма"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СтавкаНДС"               , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаНДС"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("НоменклатурнаяГруппа"    , Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетУчетаНДСПоРеализации", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ПлановаяСтоимость"       , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СуммаПлановая"           , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	тмпТаблицаУслуг.Колонки.Добавить("СчетДоходов"             , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("СчетРасходов"            , Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	тмпТаблицаУслуг.Колонки.Добавить("ДоговорКонтрагента"      , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Документ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Услуга");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Контрагент");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетАбонента");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СчетКУ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ1");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ2");
	СтруктураНастроек.ОбязательныеПоля.Добавить("СубконтоКУ3");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Начислено");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДоговорКонтрагента");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "УчетСобственныхУслугРазовые";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	ВыборкаДокумент = СтруктураРезультата.РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Выборка = ВыборкаДокумент.Выбрать();
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		тмпТаблицаУслуг.Очистить();
		
		Основание = ВыборкаДокумент.Документ;
		
		ТаблицаУслугВЦикле(тмпТаблицаУслуг,ВыборкаДокумент);		
		Пока ВыборкаДокумент.Следующий() Цикл
			ТаблицаУслугВЦикле(тмпТаблицаУслуг,ВыборкаДокумент);
		КонецЦикла; 
		
		ТаблицаУслуг = тмпТаблицаУслуг.Скопировать();
		
		Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагенту И НЕ мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
			ТаблицаУслуг.Свернуть("Номенклатура,
			|СтавкаНДС, 
			|НоменклатурнаяГруппа, 
			|СчетУчетаНДСПоРеализации,
			|СчетДоходов,
			|СчетРасходов",
			"Цена,
			|Сумма,
			|СуммаНДС,
			|ПлановаяСтоимость,
			|СуммаПлановая");
			
			Если ТаблицаУслуг.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
			Контрагент         = мКэшЗначений.Контрагент;
			ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			МассивВидовДоговоров = Новый Массив;
			МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
			Если ЗначениеЗаполнено(ВыборкаДокумент.ДоговорКонтрагента) Тогда
				ДоговорКонтрагента = ВыборкаДокумент.ДоговорКонтрагента;
			Иначе	
				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
			КонецЕсли;
			
			// БИТ_ЖКХ 23.10.2017 11:35:36 Конец правки. 
			//СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг);
			СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, ТаблицаУслуг,,);
			// БИТ_ЖКХ 23.10.2017 11:35:37 Конец правки. 
			
		Иначе
			
			ТаблицаУслуг.Свернуть("Контрагент,
			|ДоговорКонтрагента,
			|Номенклатура,
			|СтавкаНДС, 
			|НоменклатурнаяГруппа, 
			|СчетУчетаНДСПоРеализации,
			|СчетДоходов,
			|СчетРасходов",
			"Цена,
			|Сумма,
			|СуммаНДС,
			|ПлановаяСтоимость,
			|СуммаПлановая");
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслуг);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаУслуг.Контрагент,
			|	ТаблицаУслуг.ДоговорКонтрагента,
			|	ТаблицаУслуг.Номенклатура,
			|	ТаблицаУслуг.СтавкаНДС,
			|	ТаблицаУслуг.НоменклатурнаяГруппа,
			|	ТаблицаУслуг.СчетУчетаНДСПоРеализации,
			|	ТаблицаУслуг.СчетДоходов,
			|	ТаблицаУслуг.СчетРасходов,
			|	ТаблицаУслуг.Цена,
			|	ТаблицаУслуг.Сумма,
			|	ТаблицаУслуг.СуммаНДС,
			|	ТаблицаУслуг.ПлановаяСтоимость,
			|	ТаблицаУслуг.СуммаПлановая
			|ПОМЕСТИТЬ ТабУслуг
			|ИЗ
			|	&ТаблицаУслуг КАК ТаблицаУслуг
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабУслуг.Контрагент КАК Контрагент,
			|	ТабУслуг.ДоговорКонтрагента,
			|	ТабУслуг.Номенклатура КАК Номенклатура,
			|	ТабУслуг.СтавкаНДС,
			|	ТабУслуг.НоменклатурнаяГруппа,
			|	ТабУслуг.СчетУчетаНДСПоРеализации,
			|	ТабУслуг.СчетДоходов,
			|	ТабУслуг.СчетРасходов,
			|	ТабУслуг.Цена,
			|	ТабУслуг.Сумма,
			|	ТабУслуг.СуммаНДС,
			|	ТабУслуг.ПлановаяСтоимость,
			|	ТабУслуг.СуммаПлановая
			|ИЗ
			|	ТабУслуг КАК ТабУслуг
			|ИТОГИ ПО
			|	Контрагент,
			|	ДоговорКонтрагента";
			
			ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				Контрагент         = ВыборкаКонтрагент.Контрагент;
				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				МассивВидовДоговоров = Новый Массив;
				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Объект.Организация,МассивВидовДоговоров);
				ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
				
				ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл // Обход договоров.
					
					Если ЗначениеЗаполнено(ВыборкаДоговорКонтрагента.ДоговорКонтрагента) Тогда
						ДоговорКонтрагента = ВыборкаДоговорКонтрагента.ДоговорКонтрагента;
					КонецЕсли;
					Выборка = ВыборкаДоговорКонтрагента.Выбрать();
					// БИТ_ЖКХ 23.10.2017 11:35:56 Начало правки... 
					//СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка);
					СоздатьДокументРеализации(Контрагент, ДоговорКонтрагента, Основание, Выборка,,);
					// БИТ_ЖКХ 23.10.2017 11:35:57 Конец правки. 
					
				КонецЦикла; // ВыборкаДоговорКонтрагента. Обход договоров.
				
			КонецЦикла; // ВыборкаКонтрагент. Обход контрагентов,.
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаУслугВЦикле(тмпТаблицаУслуг,ВыборкаДокумент)
	
	Контрагент = Неопределено;
	
	Если мКэшЗначений.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц Тогда
		Контрагент = ВыборкаДокумент.Контрагент;
	ИначеЕсли ВыборкаДокумент.СчетАбонента.Код = "76.КУ" Тогда
		
		Контрагент = мКэшЗначений.Контрагент;
		
	Иначе
		
		СтрокаСубконта = ВыборкаДокумент.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
		
		Если НЕ СтрокаСубконта = Неопределено тогда
			
			НомерСтрокиСубконтоКонтрагент = СтрокаСубконта.НомерСтроки;
			
			Контрагент = ВыборкаДокумент["Субконто" + НомерСтрокиСубконтоКонтрагент];
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Номенклатура = Неопределено;
	
	НомерСтрокиСубконтоНоменклатура = -1;
	
	СтрокаСубконта = ВыборкаДокумент.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто");
	
	Если НЕ СтрокаСубконта = Неопределено Тогда
		
		НомерСтрокиСубконтоНоменклатура = СтрокаСубконта.НомерСтроки;
		
		Номенклатура = ВыборкаДокумент["СубконтоКУ"+НомерСтрокиСубконтоНоменклатура];
		
	КонецЕсли;
	
	НоменклатурнаяГруппа = Неопределено;
	СтавкаНДС            = Неопределено;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		НомерСтрокиСубконтоНоменклатурныеГруппы = -1;
		
		СтрокаСубконта = ВыборкаДокумент.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто");
		
		Если НЕ СтрокаСубконта = Неопределено тогда
			
			НомерСтрокиСубконтоНоменклатурныеГруппы = СтрокаСубконта.НомерСтроки;
			
			НоменклатурнаяГруппа = ВыборкаДокумент["СубконтоКУ"+НомерСтрокиСубконтоНоменклатурныеГруппы];
			
		КонецЕсли;
		
		НомерСтрокиСубконтоСтавкиНДС = -1;
		
		СтрокаСубконта = ВыборкаДокумент.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто");
		
		Если НЕ СтрокаСубконта = Неопределено Тогда
			
			НомерСтрокиСубконтоСтавкиНДС = СтрокаСубконта.НомерСтроки;
			
			СтавкаНДС = ВыборкаДокумент["СубконтоКУ"+НомерСтрокиСубконтоСтавкиНДС];
			
		КонецЕсли;
		
	КонецЕсли; 
	
	СчетРасходов = Неопределено;
	
	Если ВыборкаДокумент.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД Тогда
		
		СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
		
	ИначеЕсли ВыборкаДокумент.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД Тогда
		
		СчетРасходов =  ПланыСчетов.Хозрасчетный.СебестоимостьПродажЕНВД;
		
	КонецЕсли; 
	
	Если НЕ Номенклатура = Неопределено И НЕ ВыборкаДокумент.начислено = 0 Тогда
		
		НоваяСтрока = тмпТаблицаУслуг.Добавить();
		
		НоваяСтрока.Контрагент               = Контрагент;
		НоваяСтрока.Номенклатура             = Номенклатура;
		НоваяСтрока.Количество               = 1;
		НоваяСтрока.Цена                     = ВыборкаДокумент.Начислено;
		НоваяСтрока.Сумма                    = ВыборкаДокумент.Начислено;
		НоваяСтрока.СтавкаНДС                = СтавкаНДС;
		
		НоваяСтрока.СуммаНДС                 = УчетНДСКлиентСервер.РассчитатьСуммуНДС(ВыборкаДокумент.Начислено,Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
		
		НоваяСтрока.НоменклатурнаяГруппа     = НоменклатурнаяГруппа;
		НоваяСтрока.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.Продажи_НДС;
		НоваяСтрока.ПлановаяСтоимость        = ВыборкаДокумент.Начислено;
		НоваяСтрока.СуммаПлановая            = ВыборкаДокумент.Начислено;
		НоваяСтрока.СчетДоходов              = ВыборкаДокумент.СчетКУ;
		НоваяСтрока.СчетРасходов             = СчетРасходов;
		НоваяСтрока.ДоговорКонтрагента       = ВыборкаДокумент.ДоговорКонтрагента;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРаспределениеАванса()
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументРаспределениеАванса");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(Объект.ДатаЗакрытия));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Объект.Организация);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "РаспределениеАванса";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
	
	ДокументыНаПроведение = Новый Массив;
	Если Объект.ВыполнитьРаспределениеАванса Тогда
		
		МассивПовторов = Новый Массив;
		
		// Сброс данных по текущим документам.
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ДокументРаспределениеАванса) 
				И МассивПовторов.Найти(Выборка.ДокументРаспределениеАванса) = Неопределено Тогда
				
				МассивПовторов.Добавить(Выборка.ДокументРаспределениеАванса);
				
				ДокументРаспределениеАванса = Выборка.ДокументРаспределениеАванса.ПолучитьОбъект();
				
				Если ДокументРаспределениеАванса.ПометкаУдаления Тогда
					ДокументРаспределениеАванса.УстановитьПометкуУдаления(Ложь);
				КонецЕсли; 
				
				ДокументРаспределениеАванса.СписокУслугПоПериоду.Очистить();
				ДокументРаспределениеАванса.СуммаДокумента = 0;
				ДокументРаспределениеАванса.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Выборка.Сбросить();
		МассивПовторов.Очистить();
		
		// Пререзаполнение и создание новых документов.
		Пока Выборка.Следующий() Цикл
			
			// Проверка повторного проведения (документ на всю улицу и документы на каждый дом).
			Если ЗначениеЗаполнено(Выборка.ДокументРаспределениеАванса) Тогда 
				Если МассивПовторов.Найти(Выборка.ДокументРаспределениеАванса) = Неопределено Тогда
					МассивПовторов.Добавить(Выборка.ДокументРаспределениеАванса);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДокументРаспределениеАванса) Тогда
				ДокументРаспределениеАванса = Выборка.ДокументРаспределениеАванса.ПолучитьОбъект();
			Иначе
				ДокументРаспределениеАванса				= Документы.бит_РаспределениеАванса.СоздатьДокумент();
				ДокументРаспределениеАванса.Дата        = КонецМесяца(Объект.ДатаЗакрытия) - 1;
				ДокументРаспределениеАванса.Организация = Объект.Организация;
				ДокументРаспределениеАванса.Улица       = Выборка.Улица;
				ДокументРаспределениеАванса.Здание      = Выборка.Здание;
				ДокументРаспределениеАванса.Ответственный = мОтветственный;
				ДокументРаспределениеАванса.Комментарий   = "Документ создан автоматически при закрытии месяца " + мДатаТекст;
			КонецЕсли;
			
			// БИТ ЖКХ 22.12.2020
			Если ЗначениеЗаполнено(ДокументРаспределениеАванса.Ответственный) = ложь Тогда 
				ДокументРаспределениеАванса.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			
			// Заполнение тч документа.
			ДокументРаспределениеАванса.ЗаполнитьСписокУслуг(Истина);
			
			Попытка
				
				Если ДокументРаспределениеАванса.СписокУслугПоПериоду.Количество() > 0 Тогда
					ДокументРаспределениеАванса.Записать(РежимЗаписиДокумента.Запись);
					ДокументыНаПроведение.Добавить(ДокументРаспределениеАванса.Ссылка);
				КонецЕсли; 
				
			Исключение
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
			КонецПопытки; 
			
		КонецЦикла; // Создание и перепроведение ДокументРаспределениеАванса.
		
	КонецЕсли; // Объект.ВыполнитьРаспределениеАванса.
	
	ПровестиДокументы(ДокументыНаПроведение);
	
КонецПроцедуры

&НаСервере
Процедура НачислитьОДН()
	ДатаМес          = НачалоМесяца(Объект.ДатаЗакрытия) - 20;
	ДатаМес2         = НачалоМесяца(ДатаМес) - 20;
	//НеНачислять      = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Не Начислять");
	//УслугаЭЛ         = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("ОДН Эл");
	//УслугаГВ         = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("ОДН ГВ");
	//УслугаХВ         = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("ОДН ХВ");
	//УслугаВО         = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("ОДН ВО");
	УслугаЭЛ         = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002");
	УслугаГВ         = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000003");
	УслугаХВ         = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000004");
	УслугаВО         = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000005");
	//Газоснабжение    = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("Газоснабжение");
	СРОДН            = Перечисления.лб_СпособРасчетаСОИ;
	РассчетПосле2023 = Объект.ДатаЗакрытия > Дата(2023, 02, 01);
	//РассчетПосле2023 = Истина;
	ТекстЗапроса     = "";
	Если Объект.Организация = справочники.Организации.НайтиПоКоду("00-000001") Тогда
		ПоставщикУслуг = Справочники.бит_ПоставщикиУслуг.НайтиПоКоду("00-000001"); 
	Иначе	
		ПоставщикУслуг = Справочники.бит_ПоставщикиУслуг.НайтиПоКоду("00-000016");
	КонецЕсли; 
	
	ДокОбъемы = НайтиОбъемы(Объект.ДатаЗакрытия);
	Если ДокОбъемы = Документы.бит_ОбъемыЖКУ.ПустаяСсылка() Тогда
		ДокОбъемы = Документы.бит_ОбъемыЖКУ.СоздатьДокумент();
		ДокОбъемы.Дата = НачалоМесяца(Объект.ДатаЗакрытия);
	Иначе
		ДокОбъемы.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Если НЕ ИспользоватьОтборЗдание Тогда
			ДокОбъемы.ОбъемыЖКУ.Очистить();
		КонецЕсли;
	КонецЕсли;
	ДокСТЭЛ = ДокСтавка(Объект.ДатаЗакрытия,Объект.Организация,УслугаЭЛ);
	Если ДокСТЭЛ <> Неопределено Тогда
		ДокСТЭЛ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Если НЕ ИспользоватьОтборЗдание Тогда
			ДокСТЭЛ.СтавкиНаУслуги.Очистить();
		КонецЕсли;
	Иначе 
		ДокСтЭл = Документы.бит_УстановкаСтавокПоУслугам.СоздатьДокумент();
		ДокСТЭЛ.Дата = КонецМесяца(Объект.ДатаЗакрытия);
		ДокСтЭл.Организация = Объект.Организация;
		ДокСтЭл.Услуга = УслугаЭЛ;
	КонецЕсли;
	
	ДокСТГВ = ДокСтавка(Объект.ДатаЗакрытия,Объект.Организация,УслугаГВ);
	Если ДокСТГВ <> Неопределено Тогда
		ДокСтГв.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Если НЕ ИспользоватьОтборЗдание Тогда
			ДокСтГв.СтавкиНаУслуги.Очистить();
		КонецЕсли;
	Иначе 
		ДокСТГВ = Документы.бит_УстановкаСтавокПоУслугам.СоздатьДокумент();
		ДокСТГВ.Дата = КонецМесяца(Объект.ДатаЗакрытия);
		ДокСТГВ.Организация = Объект.Организация;
		ДокСТГВ.Услуга = УслугаГВ;
	КонецЕсли;
	
	ДокСТХВ = ДокСтавка(Объект.ДатаЗакрытия,Объект.Организация,УслугаХВ);
	Если ДокСТХВ <> Неопределено Тогда
		ДокСТХВ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Если НЕ ИспользоватьОтборЗдание Тогда
			ДокСТХВ.СтавкиНаУслуги.Очистить();
		КонецЕсли;
	Иначе 
		ДокСТХВ = Документы.бит_УстановкаСтавокПоУслугам.СоздатьДокумент();
		ДокСТХВ.Дата = КонецМесяца(Объект.ДатаЗакрытия);
		ДокСТХВ.Организация = Объект.Организация;
		ДокСТХВ.Услуга = УслугаХВ;
	КонецЕсли;
	
	ДокСТВО = ДокСтавка(Объект.ДатаЗакрытия,Объект.Организация,УслугаВО);
	Если ДокСТВО <> Неопределено Тогда
		ДокСтВо.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Если НЕ ИспользоватьОтборЗдание Тогда
			ДокСтВо.СтавкиНаУслуги.Очистить();
		КонецЕсли;
	Иначе 
		ДокСТВО = Документы.бит_УстановкаСтавокПоУслугам.СоздатьДокумент();
		ДокСТВО.Дата = КонецМесяца(Объект.ДатаЗакрытия);
		ДокСТВО.Организация = Объект.Организация;
		ДокСТВО.Услуга = УслугаВО;
	КонецЕсли;
	
	Если ИспользоватьОтборЗдание Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|И	бит_СписокЗданий.Ссылка в (&Здание)";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СписокЗданий.Ссылка КАК Ссылка,
	|	бит_СписокЗданий.Организация КАК Орг,
	|	бит_СписокЗданий.Улица КАК Улица,
	|	бит_СписокЗданий.ВидБлагоустройстваЗданий КАК ВидБлагоустройстваЗданий
	|ПОМЕСТИТЬ Здание
	|ИЗ
	|	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|ГДЕ
	|	бит_СписокЗданий.Организация = &Организация  " + ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	лб_НормативыОДНСрезПоследних.Адрес КАК Адрес,
	|	лб_НормативыОДНСрезПоследних.НормативХВ КАК НормативХВ,
	|	лб_НормативыОДНСрезПоследних.НормативГВ КАК НормативГВ,
	|	лб_НормативыОДНСрезПоследних.НормативВО КАК НормативВО,
	|	лб_НормативыОДНСрезПоследних.НормативЭЭ КАК НормативЭЭ,
	|	лб_НормативыОДНСрезПоследних.НормативНаПодогрев КАК НормативНаПодогрев,
	|	лб_НормативыОДНСрезПоследних.МОП КАК МОП,
	|	лб_НормативыОДНСрезПоследних.Подвал КАК Подвал,
	|	лб_НормативыОДНСрезПоследних.Чердак КАК Чердак,
	|	лб_НормативыОДНСрезПоследних.Жилая КАК Жилая,
	|	лб_НормативыОДНСрезПоследних.Нежилая КАК Нежилая,
	|	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВ КАК СтоимостьКубаХВ,
	|	лб_НормативыОДНСрезПоследних.СтоимостьКВтч КАК СтоимостьКВтч,
	|	лб_НормативыОДНСрезПоследних.СтоимостьКубаВО КАК СтоимостьКубаВО,
	|	лб_НормативыОДНСрезПоследних.СтоимостьГКалл КАК СтоимостьГКалл,
	|	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВнаГВ КАК СтоимостьКубаХВнаГВ,
	|	лб_НормативыОДНСрезПоследних.НомерСтроки КАК НомерСтроки,
	|	лб_НормативыОДНСрезПоследних.РежимПотребления КАК РежимПотребления,
	|	лб_НормативыОДНСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ Норм
	|ИЗ
	|	РегистрСведений.лб_НормативыОДН.СрезПоследних(&ДатаКон, ) КАК лб_НормативыОДНСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	лб_ОДН_факт.Адрес КАК Адрес,
	|	лб_ОДН_факт.ОДН_ХВ_М КАК ОДН_ХВ_М,
	|	лб_ОДН_факт.ОДН_ХВ_Р КАК ОДН_ХВ_Р,
	//Добавили ВО факт 24.10.22 Мельник
	|	лб_ОДН_факт.ОДН_ВО_М КАК ОДН_ВО_М,
	|	лб_ОДН_факт.ОДН_ВО_Р КАК ОДН_ВО_Р,
	//
	|	лб_ОДН_факт.ОДН_ГВ_М КАК ОДН_ГВ_М,
	|	лб_ОДН_факт.ОДН_ГВ_Р КАК ОДН_ГВ_Р,
	|	лб_ОДН_факт.ОДН_ЭЭ_кВт КАК ОДН_ЭЭ_кВт,
	|	лб_ОДН_факт.ОДН_ЭЭ_Р КАК ОДН_ЭЭ_Р,
	|	лб_ОДН_факт.Период КАК Период,
	|	лб_ОДН_факт.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Факт
	|ИЗ
	|	РегистрНакопления.лб_ОДН_факт КАК лб_ОДН_факт
	|ГДЕ
	|	лб_ОДН_факт.Период МЕЖДУ &ДатаНач1 И &ДатаКон1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Здание.Ссылка КАК Ссылка,
	|	Здание.Орг КАК Орг,
	|	ЕСТЬNULL(Норм.НормативХВ, 0) КАК НХВ,
	|	ЕСТЬNULL(Норм.НормативГВ, 0) КАК НГВ,
	|	ЕСТЬNULL(Норм.НормативВО, 0) КАК НВО,
	|	ЕСТЬNULL(Норм.НормативЭЭ, 0) КАК НЭЭ,
	|	ЕСТЬNULL(Норм.НормативНаПодогрев, 0) КАК НПодогрев,
	|	ЕСТЬNULL(Норм.МОП, 0) КАК МОП,
	|	ЕСТЬNULL(Норм.Подвал, 0) КАК Подвал,
	|	ЕСТЬNULL(Норм.Чердак, 0) КАК Чердак,
	|	ЕСТЬNULL(Норм.Жилая, 0) КАК Жилая,
	|	ЕСТЬNULL(Норм.Нежилая, 0) КАК Нежилая,
	|	ЕСТЬNULL(Норм.СтоимостьКубаХВ, 0) КАК СтКХВ,
	|	ЕСТЬNULL(Норм.СтоимостьКВтч, 0) КАК СтКВт,
	|	ЕСТЬNULL(Норм.СтоимостьКубаВО, 0) КАК СтКВО,
	|	ЕСТЬNULL(Норм.СтоимостьГКалл, 0) КАК СтГКа,
	|	ЕСТЬNULL(Норм.СтоимостьКубаХВнаГВ, 0) КАК СтКХВГВ,
	|	ЕСТЬNULL(Факт.ОДН_ХВ_М, 0) КАК ФХВМ,
	|	ЕСТЬNULL(Факт.ОДН_ХВ_Р, 0) КАК ФХВР,
	//Добавили ВО факт 24.10.22 Мельник
	|	ЕСТЬNULL(Факт.ОДН_ВО_М, 0) КАК ФВОМ,
	|	ЕСТЬNULL(Факт.ОДН_ВО_Р, 0) КАК ФВОР,
	|	ЕСТЬNULL(Факт.ОДН_ГВ_М, 0) КАК ФГВМ,
	//
	|	ЕСТЬNULL(Факт.ОДН_ГВ_Р, 0) КАК ФГВР,
	|	ЕСТЬNULL(Факт.ОДН_ЭЭ_кВт, 0) КАК ФЭЭкВт,
	|	ЕСТЬNULL(Факт.ОДН_ЭЭ_Р, 0) КАК ФЭЭР,
	|	Факт.Период КАК ПериодФ,
	|	Здание.Улица КАК Улица,
	|	Норм.РежимПотребления КАК РежимПотребления,
	|	Норм.НомерСтроки КАК НСН,
	|	Факт.НомерСтроки КАК НСФ,
	|	Здание.ВидБлагоустройстваЗданий КАК ВБЗ,
	|	Норм.Период КАК ПериодН
	|ИЗ
	|	Здание КАК Здание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Норм КАК Норм
	|		ПО Здание.Ссылка = Норм.Адрес
	|		ЛЕВОЕ СОЕДИНЕНИЕ Факт КАК Факт
	|		ПО Здание.Ссылка = Факт.Адрес";
	Если ИспользоватьОтборЗдание Тогда
		Запрос.УстановитьПараметр("Здание",(Здание));
	КонецЕсли;                                           
	//Сообщить(Объект.ДатаЗакрытия);
	//Сообщить(ДатаМес2);
	Запрос.УстановитьПараметр("Организация",(Объект.Организация));
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Объект.ДатаЗакрытия));
	Запрос.УстановитьПараметр("ДатаНач1",НачалоМесяца(ДатаМес2));
	Запрос.УстановитьПараметр("ДатаКон1",КонецМесяца(ДатаМес2));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Объект.ДатаЗакрытия));
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//Для обход = 0 по РезультатЗапроса.Количество()-1 Цикл 
	//	РЗап = РезультатЗапроса[Обход];	
	РЗап = Запрос.Выполнить().Выбрать();
	Пока РЗап.Следующий() Цикл 
		//РЗап = РезультатЗапроса[Обход];	
		Если РЗАП.НСН = Null Тогда
			//Сообщить("Для дома "+РЗап.Ссылка+" нет данных для расчета");
			Продолжить;
		КонецЕсли;
		
		//Если РЗап.способ.пустая() Тогда
		//	Сообщить("В доме "+РЗап.Ссылка+" не выбран способ расчета, начисления не сформированы");
		//	Продолжить;
		//КонецЕсли;
		//СпосособРасчетаОДН = ПолучитьСпособРасчета(ТекущаяДата(),РЗап.Ссылка);
		СпосособРасчетаОДН = РЗап.РежимПотребления;
		Если РассчетПосле2023 Тогда
		//Если Истина Тогда  //Времянка    
		//ОбъемХВ = Окр(РЗап.НХВ*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),4);
		Если НЕ ЗначениеЗаполнено(СпосособРасчетаОДН) Тогда
			Продолжить;
			
		КонецЕсли;
		//Сообщить(Окр(РЗап.СтКХВ* ОбъемХВ,4));
			Если СпосособРасчетаОДН.СпособРасчетаСОИ_ХВ = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ХВ = СРОДН.ПоСреднему Тогда
				ОбъемХВ = Окр(РЗап.НХВ*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),4);
				ТарифХВ = Окр(РЗап.СтКХВ* ОбъемХВ,4);
				ЗаписатьОбъем(ДокОбъемы, ОбъемХВ, РЗап.Ссылка, УслугаХВ);
			ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ХВ = СРОДН.ПоФакту Тогда 
				ОбъемХВ = Окр(РЗап.ФХВМ/(РЗап.Жилая+РЗап.Нежилая),4);
				ТарифХВ = Окр(ОбъемХВ*РЗап.СтКХВ,4);
				ЗаписатьОбъем(ДокОбъемы, ОбъемХВ, РЗап.Ссылка, УслугаХВ);
			КонецЕсли;
			
			Если СпосособРасчетаОДН.СпособРасчетаСОИ_ГВ = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ГВ = СРОДН.ПоСреднему Тогда
				ОбъемГВ = Окр(РЗап.НГВ*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),4);
				ТарифГВ = Окр((РЗап.СтГка*РЗап.НПодогрев+РЗап.СТкХВГВ)*ОбъемГВ,4);
				ЗаписатьОбъем(ДокОбъемы, ОбъемГВ, РЗап.Ссылка, УслугаГВ);
			ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ГВ = СРОДН.ПоФакту Тогда 
				ОбъемГВ = Окр(РЗап.ФГВМ/(РЗап.Жилая+РЗап.Нежилая),4);
				ТарифГВ = ОбъемГВ*(РЗап.СтГка*РЗап.НПодогрев+РЗап.СТкХВГВ);
				ЗаписатьОбъем(ДокОбъемы, ОбъемГВ, РЗап.Ссылка, УслугаГВ);
			КонецЕсли;
			
			Если СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоСреднему Тогда
				ОбъемВО = Окр(РЗап.НВО*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),4);
				ТарифВО = Окр(РЗап.СтКВО*ОбъемВО,4);
				ЗаписатьОбъем(ДокОбъемы, ОбъемВО, РЗап.Ссылка, УслугаВО);
			ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоФакту Тогда
				ОбъемВО = Окр(РЗап.ФВОМ/(РЗап.Жилая+РЗап.Нежилая),4);
				ТарифВО = Окр(ОбъемВО*РЗап.СтКВО,4);
				ЗаписатьОбъем(ДокОбъемы, ОбъемВО, РЗап.Ссылка, УслугаВО);
			КонецЕсли;
			
			Если СпосособРасчетаОДН.СпособРасчетаСОИ_ЭЭ = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ЭЭ = СРОДН.ПоСреднему Тогда
				ОбъемЭЭ = Окр(РЗап.НЭЭ*(РЗап.МОП+РЗап.Подвал+РЗап.Чердак)/(РЗап.Жилая+РЗап.Нежилая),4);	
				ТарифЭЭ = Окр(ОбъемЭЭ*РЗап.СтКВт,4);	
				ЗаписатьОбъем(ДокОбъемы, ОбъемЭЭ, РЗап.Ссылка, УслугаЭЛ);
			ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ЭЭ = СРОДН.ПоФакту Тогда 
				ОбъемЭЭ = Окр(РЗап.ФЭЭкВт/(РЗап.Жилая+РЗап.Нежилая),4);
				ТарифЭЭ = Окр(ОбъемЭЭ*РЗап.СтКВт,4);
				ЗаписатьОбъем(ДокОбъемы, ОбъемЭЭ, РЗап.Ссылка, УслугаЭЛ);
			КонецЕсли;
			
		Иначе
			Попытка
				Если СпосособРасчетаОДН.СпособРасчетаСОИ_ЭЭ = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ЭЭ = СРОДН.ПоСреднему Тогда
					ТарифЭЭ = Формат(РЗап.НЭЭ*(РЗап.МОП+РЗап.Подвал+РЗап.Чердак)*РЗап.СтКВт/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");	
				ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ЭЭ = СРОДН.ПоФакту Тогда 
					ТарифЭЭ = Формат(РЗап.ФЭЭР/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				КонецЕсли;
				Если СпосособРасчетаОДН.СпособРасчетаСОИ_ГВ = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ГВ = СРОДН.ПоСреднему Тогда
					ТарифГВ = Формат((РЗап.СтГка*РЗап.НПодогрев+РЗап.СТкХВГВ)*РЗап.НГВ*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ГВ = СРОДН.ПоФакту Тогда 
					ТарифГВ = Формат(РЗап.ФГВР/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				КонецЕсли;
				Если СпосособРасчетаОДН.СпособРасчетаСОИ_ХВ = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ХВ = СРОДН.ПоСреднему Тогда
					ТарифХВ = Формат(РЗап.СтКХВ*РЗап.НХВ*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ХВ = СРОДН.ПоФакту Тогда 
					ТарифХВ = Формат(РЗап.ФХВР/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				КонецЕсли;
				//Добавляем расчет ВО по факту Мельник 24.10.22
				//Если СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоСреднему ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоФакту Тогда
				//	ТарифВО = Формат(РЗап.СтКВО*РЗап.НВО*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				//КонецЕсли;
				Если СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоНормативу ИЛИ СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоСреднему Тогда
					ТарифВО = Формат(РЗап.СтКВО*РЗап.НВО*(РЗап.МОП)/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				ИначеЕсли СпосособРасчетаОДН.СпособРасчетаСОИ_ВО = СРОДН.ПоФакту Тогда
					ТарифВО = Формат(РЗап.ФВОР/(РЗап.Жилая+РЗап.Нежилая),"ЧДЦ=2");
				КонецЕсли;
			Исключение 
				Сообщить("В доме "+РЗап.Ссылка+" не указан способ расчета");
				ТарифВО = 0;
				ТарифХВ = 0;
				ТарифГВ = 0;
				ТарифЭЭ = 0;
			Конецпопытки; 
		КонецЕсли;
		ПроверитьНаНоль(ТарифВО);
		ПроверитьНаНоль(ТарифХВ);
		ПроверитьНаНоль(ТарифГВ);
		ПроверитьНаНоль(ТарифЭЭ);	
		ЗаполнитьСтрокуДокумента(ДокСТЭЛ,ТарифЭэ,Рзап.ВБЗ,РЗАП.Ссылка,Рзап.Орг,ПоставщикУслуг);
		ЗаполнитьСтрокуДокумента(ДокСТХВ,ТарифХВ,Рзап.ВБЗ,РЗАП.Ссылка,Рзап.Орг,ПоставщикУслуг);
		ЗаполнитьСтрокуДокумента(ДокСТГВ,ТарифГВ,Рзап.ВБЗ,РЗАП.Ссылка,Рзап.Орг,ПоставщикУслуг);
		ЗаполнитьСтрокуДокумента(ДокСТВо,ТарифВО,Рзап.ВБЗ,РЗАП.Ссылка,Рзап.Орг,ПоставщикУслуг);

	КонецЦикла;
	Попытка
		ДокОбъемы.Записать(РежимЗаписиДокумента.Проведение);
	Исключение 
		мТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	Попытка
		ДокСТво.Записать(РежимЗаписиДокумента.Проведение);
	Исключение 
		мТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	попытка
		ДокСТэл.Записать(РежимЗаписиДокумента.Проведение);
	Исключение 
		мТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	попытка
		ДокСТгв.Записать(РежимЗаписиДокумента.Проведение);
	Исключение 
		мТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	попытка
		ДокСТхв.Записать(РежимЗаписиДокумента.Проведение);
	Исключение 
		мТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

// Процедура производит расчеты. 
// И заполняет табличную часть.
//
&НаСервере
Процедура РассчитатьНачисленияПениПоЛицевымСчетам(СписокЛС, ДокПени) //Экспорт 
	
	СсылкаОС = Неопределено;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачислятьПени"                , Ложь);
	СтруктураПараметров.Вставить("НачислятьПениСУчетомПереплаты", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Объект.ДатаЗакрытия, Объект.Организация, СтруктураПараметров);
	
	//ЛицевыеСчета.Очистить();
	
	Если НЕ СтруктураПараметров.НачислятьПени Тогда
		
		ШаблоСообщения = НСтр("ru='В настройках %1 от %2 начисление пени отключено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблоСообщения, Объект.Организация, Формат(Объект.ДатаЗакрытия, "ДФ=dd.MM.yyyy")));
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей КАК ПоследнийДеньПриемаПлатежей
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних КАК бит_НастройкаПараметровЖКХСрезПоследних
	|ГДЕ
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация = &Организация";
	
	СрокОплаты = Запрос.Выполнить().Выгрузить();
	СрокОплаты = СрокОплаты[0].ПоследнийДеньПриемаПлатежей;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей >= ДЕНЬ(&Дата)
	|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1 - бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|	КОНЕЦ КАК Момент,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|					ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|			КОНЕЦ >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ))
	|							ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ)
	|						ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|					КОНЕЦ, КОНЕЦПЕРИОДА(ВЫБОР
	|							КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ))
	|								ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|						КОНЕЦ, МЕСЯЦ), ДЕНЬ) + ДЕНЬ(&Дата)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВЫБОР
	|					КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|						ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|				КОНЕЦ, &Дата, ДЕНЬ)
	|	КОНЕЦ КАК КоличествоДней
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"        , Объект.ДатаЗакрытия);
	Запрос.УстановитьПараметр("Организация" , объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Момент			= Выборка.Момент;
		КоличествоДней	= Выборка.КоличествоДней;
	Иначе
		ТекстСообщения = НСтр("ru = 'Настройте параметры ЖКХ для организации.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//ДокПени = Документы.бит_РазовыеПоУслугамЖКХ.СоздатьДокумент();
	//ДокПени.Дата = КонецМесяца(Объект.ДатаЗакрытия);
	//ДокПени.Организация = Объект.Организация;
	
	//ДокПени.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТаблицаЛС
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет В (&СписокЛС)
	|				И НЕ ЛицевойСчет.ПометкаУдаления
	|				И НЕ ЛицевойСчет.Архивный) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	НЕ бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.НеВестиРасчетПени
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней + 1), ДЕНЬ) КАК Период,
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления.КоличествоМесяцев, 999) КАК КоличествоМесяцев,
	|	бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления КАК ПериодНачисленияПени,
	|	бит_ПениПоУслугамЖКХСрезПоследних.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА бит_ПениПоУслугамЖКХСрезПоследних.Начислять
	|			ТОГДА бит_ПениПоУслугамЖКХСрезПоследних.Процент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Процент
	|ПОМЕСТИТЬ ВсеПроценты
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней), Организация = &Организация) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бит_ПениПоУслугамЖКХ.Период, ДЕНЬ),
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХ.ПериодНачисления.КоличествоМесяцев, 999),
	|	бит_ПениПоУслугамЖКХ.ПериодНачисления,
	|	бит_ПениПоУслугамЖКХ.Услуга,
	|	ВЫБОР
	|		КОГДА бит_ПениПоУслугамЖКХ.Начислять
	|			ТОГДА бит_ПениПоУслугамЖКХ.Процент
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ КАК бит_ПениПоУслугамЖКХ
	|ГДЕ
	|	бит_ПениПоУслугамЖКХ.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней) И &Дата
	|	И бит_ПениПоУслугамЖКХ.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВсеПроценты.Период) КАК Период,
	|	ВсеПроценты.КоличествоМесяцев,
	|	ВсеПроценты.ПериодНачисленияПени,
	|	ВсеПроценты.Услуга КАК Услуга,
	|	ВсеПроценты.Процент КАК Процент
	|ПОМЕСТИТЬ ИтоговаяПроценты
	|ИЗ
	|	ВсеПроценты КАК ВсеПроценты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеПроценты.КоличествоМесяцев,
	|	ВсеПроценты.ПериодНачисленияПени,
	|	ВсеПроценты.Услуга,
	|	ВсеПроценты.Процент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Услуга,
	|	ВсеПроценты.КоличествоМесяцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеПроценты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяПроценты.КоличествоМесяцев,
	|	ИтоговаяПроценты.ПериодНачисленияПени,
	|	ИтоговаяПроценты.Услуга КАК Услуга,
	|	ИтоговаяПроценты.Период КАК Период,
	|	ИтоговаяПроценты.Процент КАК Процент,
	|	ЕСТЬNULL(МИНИМУМ(РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, ИтоговаяПроцентыРазность.Период, ДЕНЬ)), РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, &Дата, ДЕНЬ) + 1) КАК КоличествоДней
	|ПОМЕСТИТЬ ИтоговаТаблица
	|ИЗ
	|	ИтоговаяПроценты КАК ИтоговаяПроценты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяПроценты КАК ИтоговаяПроцентыРазность
	|		ПО ИтоговаяПроценты.Услуга = ИтоговаяПроцентыРазность.Услуга
	|			И ИтоговаяПроценты.КоличествоМесяцев = ИтоговаяПроцентыРазность.КоличествоМесяцев
	|			И ИтоговаяПроценты.Период < ИтоговаяПроцентыРазность.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяПроценты.Период,
	|	ИтоговаяПроценты.КоличествоМесяцев,
	|	ИтоговаяПроценты.ПериодНачисленияПени,
	|	ИтоговаяПроценты.Услуга,
	|	ИтоговаяПроценты.Процент
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(МИНИМУМ(РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, ИтоговаяПроцентыРазность.Период, ДЕНЬ)), РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, &Дата, ДЕНЬ) + 1) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет КАК ЛС,
	|	ИтоговаТаблица.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ИтоговаТаблица.ПериодНачисленияПени КАК ПериодНачисленияПени,
	|	ИтоговаТаблица.Услуга КАК Услуга,
	|	ЕСТЬNULL(ИтоговаТаблица.Процент, 0) КАК ПроцентПени,
	|	ИтоговаТаблица.КоличествоДней КАК КоличествоДней,
	|	ТаблицаЛС.Наименование КАК Наименование,
	|	ИтоговаТаблица.Услуга.Приоритет КАК Приоритет
	|ИЗ
	|	ТаблицаЛС КАК ТаблицаЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтоговаТаблица КАК ИтоговаТаблица
	|		ПО ТаблицаЛС.Услуга = ИтоговаТаблица.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоМесяцев УБЫВ,
	|	Наименование,
	|	Приоритет
	|ИТОГИ ПО
	|	ЛС,
	|	КоличествоМесяцев";
	
	Запрос.УстановитьПараметр("Дата"        	, Момент);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("КоличествоДней"	, КоличествоДней);
	Запрос.УстановитьПараметр("СписокЛС"    , СписокЛС);
	
	ТаблицаЛС1 = Запрос.Выполнить().Выгрузить();
	ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ТаблицаЛС1.Свернуть("ЛС");
	ТаблицаДолгаЛС = ПолучитьТаблицуДолга(СсылкаОС, Момент, ТаблицаЛС1);
	ТаблицаЛС = ДокПени.ЛицевыеСчета.ВыгрузитьКолонки();
	Если ТаблицаДолгаЛС = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если СсылкаОС <> Неопределено Тогда
		ТабОстатокСуммы = СсылкаОС.СписокУслуг.Выгрузить(,"ЛицевойСчет, Услуга, Сумма");
		ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
	КонецЕсли;
	
	Пени  = Справочники.бит_УслугиЖКХ.Пени;
	ПениПоКапРемонт  = Справочники.бит_УслугиЖКХ.ПениПоКапитальномуРемонту ;
	КалендарныхДней = День(КонецМесяца(Объект.ДатаЗакрытия));
	
	ИспЛС = Новый ТаблицаЗначений;
	ИспЛС.Колонки.Добавить("ЛС",,"ЛС");
	ИспЛС.Колонки.Добавить("Услуга",,"Услуга");
	ИспЛС.Колонки.Добавить("ПериодМес",,"ПериодМес");
		
	// Обход лицевых счетов.
	Пока ВыборкаЛС.Следующий() Цикл
		
		кэшЛицевойСчет = ВыборкаЛС.ЛС;
		
		// Переплат.
		Отбор = Новый Структура("ЛицевойСчет", ВыборкаЛС.ЛС);
		ТаблицаПереплат = ТаблицаДолгаЛС.Скопировать(Отбор);
		Если ТаблицаПереплат.Количество() = 0 Тогда
			Продолжить; //Нет данных о долге по ЛС.
		КонецЕсли; 
		ТаблицаПереплат.Свернуть("Услуга, Переплата");
		ПереплатаИтог = ТаблицаПереплат.Итог("Переплата");
		
		// Обход Количества месяцев задолженсти.
		ВыборкаКоличествоМесяцев = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКоличествоМесяцев.Следующий() Цикл
			
			Отбор = Новый Структура("ЛицевойСчет, КоличествоМесяцев", ВыборкаКоличествоМесяцев.ЛС, ВыборкаКоличествоМесяцев.КоличествоМесяцев);
			ТаблицаДолга = ТаблицаДолгаЛС.Скопировать(Отбор);
			
			Если ТаблицаДолга.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ДолгИтог = ТаблицаДолга.Итог("ДолгДляНачисления");
			Остаток = ДолгИтог - ПереплатаИтог;
			
			Если Остаток < 0 И СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
				ПереплатаИтог = ПереплатаИтог - ДолгИтог;
				Продолжить;
			ИначеЕсли Остаток > 0 И СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
				ПереплатаИтог = 0;
			КонецЕсли; 
			
			// Обход Услуг.
			кэшУслуга = Неопределено;
			
			ВыборкаУслуг = ВыборкаКоличествоМесяцев.Выбрать();
			Пока ВыборкаУслуг.Следующий() Цикл
				 Если ВыборкаУслуг.Услуга = Пени Или ВыборкаУслуг.Услуга = ПениПоКапРемонт Тогда
						 Продолжить;
				КонецЕсли;
				Отбор = Новый Структура;
				Отбор.Вставить("ЛицевойСчет", ВыборкаУслуг.ЛС);
				Отбор.Вставить("Услуга"     , ВыборкаУслуг.Услуга);
				
				СтрокаДолга = ТаблицаДолга.НайтиСтроки(Отбор);
				
				Таб1 = ТаблицаДолга.Скопировать();
				Таб1.Очистить();
				Для каждого Стр Из СтрокаДолга Цикл
					НовСтр = Таб1.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Стр);
				КонецЦикла;
				
				Таб2 = Таб1.Скопировать();
				Таб2.Свернуть("ПериодВзаиморасчетов");
				Таб3 = ТаблицаДолга.Скопировать();
				Таб3.Очистить();
				
				ЕстьОплата = Ложь;
				
				Для каждого СтрТаб2 Из Таб2 Цикл
					ЕстьОплата = Ложь;
					Отбор = Новый Структура("ПериодВзаиморасчетов", СтрТаб2.ПериодВзаиморасчетов);
					НайденныеСтроки = Таб1.НайтиСтроки(Отбор);
					Если Не НайденныеСтроки.Количество() = 0 Тогда
						
						Если НайденныеСтроки.Количество() > 1 Тогда
							
							ЗначениеМаксимальногоЭлемента = 0;
							ЗначениеМинимальногоЭлемента = 10000000;
							Попытка
								
								
								Для Индекс = 0 По НайденныеСтроки.Количество() - 1 Цикл
									
									Если НачалоДня(НайденныеСтроки[Индекс].Период1) = НачалоДня(НайденныеСтроки[Индекс].ПериодВзаиморасчетов) Тогда
										
										Если (НайденныеСтроки[Индекс].СуммаОстаток1 > ЗначениеМаксимальногоЭлемента) Тогда
											ЗначениеМаксимальногоЭлемента = НайденныеСтроки[Индекс].СуммаОстаток1;
											ИндексМаксимальногоЭлемента = Индекс;
										КонецЕсли;
										
									Иначе 
										
										Если (НайденныеСтроки[Индекс].СуммаОстаток1 < ЗначениеМинимальногоЭлемента)  Тогда
											ЗначениеМинимальногоЭлемента = НайденныеСтроки[Индекс].СуммаОстаток1;
											ИндексМинимальногоЭлемента = Индекс;
											ЕстьОплата = Истина;
										КонецЕсли;
										
									КонецЕсли; 
									
								КонецЦикла;
								
								НовСтр = Таб3.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтр, НайденныеСтроки[ИндексМаксимальногоЭлемента]);
								
								Если ЕстьОплата = Истина Тогда
									
									НовСтр = Таб3.Добавить();
									ЗаполнитьЗначенияСвойств(НовСтр, НайденныеСтроки[ИндексМинимальногоЭлемента]);
									
								КонецЕсли;   								
							Исключение
								продолжить;
							КонецПопытки;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла; 
				
				ОтборЛС = Новый Структура("ЛС, Услуга", ВыборкаУслуг.ЛС, ВыборкаУслуг.Услуга);
				
				Строка = ИспЛС.НайтиСтроки(ОтборЛС);
				Если Строка.Количество() <> 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Попытка
					
					Если Таб3.Количество() > 1 Тогда
						
						СтрокаДолга.Очистить();
						СтрокаДолга =  Таб3.Скопировать();
						
					КонецЕсли; 
					
					Долг = СтрокаДолга[0].ДолгДляНачисления;
					Если СтрокаДолга[0].Период = 0 Тогда
						КоличествоДнейИтог = КоличествоДней;	
					Иначе	
						КоличествоДнейИтог = (СтрокаДолга[0].Период);
					КонецЕсли; 
					
					//ПериодДолга = (Формат((НачалоМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), "ДЛФ=Д"));
					
					й = Дата(Год(НачалоМесяца(СтрокаДолга[0].Период1)), Месяц(НачалоМесяца(СтрокаДолга[0].Период1)), День(НачалоМесяца(СтрокаДолга[0].Период1))) ;
					МассивДолг = Новый Массив;	
					МассивДолгСумма = Новый Массив;	
					
					МассивДней = Новый Массив;
					Для Индекс = 0 По СтрокаДолга.Количество() - 1 цикл	
						Если СтрокаДолга[Индекс].ДолгДляНачисления < 0 Тогда
							СтрокаДолга[Индекс].ДолгДляНачисления = 0;
							СтрокаДолга[Индекс].Долг = 0;
							//ПустойПериод =  СтрокаДолга[Индекс].ПериодВзаиморасчетов;
							//СтрокаДолга.Удалить(Индекс);
						КонецЕсли; 
					КонецЦикла;
			
					
					Для Индекс = 1  По СтрокаДолга.Количество() - 1 Цикл
						
						Если Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1))
							<> Дата(Год(КонецМесяца(СтрокаДолга[Индекс].Период1)), Месяц(КонецМесяца(СтрокаДолга[Индекс].Период1)), День(КонецМесяца(СтрокаДолга[Индекс].Период1))) Тогда
							Если й <> Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1)) Тогда
								й = Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1));	
								МассивДолг.Вставить(0);
								МассивДолг[0] = (Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1))) ;  
								МассивДолг.Вставить(0);
								МассивДолг[0] = (Дата(Год(СтрокаДолга[Индекс-1].Период1), Месяц(СтрокаДолга[Индекс-1].Период1), День(СтрокаДолга[Индекс-1].Период1))) ;
								МассивДолгСумма.Добавить(СтрокаДолга[Индекс].СуммаОстаток1 );  
							КонецЕсли; 
							
						КонецЕсли;
						
					КонецЦикла;
				
					
					Список = Новый СписокЗначений; 
					Список.ЗагрузитьЗначения(МассивДолгСумма);
					Список.СортироватьПоЗначению(НаправлениеСортировки.Убыв); 
					МассивДолгСумма = Список.ВыгрузитьЗначения();
					
				Исключение
					Продолжить;
				КонецПопытки;
				
				Попытка
					
					//Долг = СтрокаДолга[0].ДолгДляНачисления;
					Если Долг <= 0 Тогда
						Продолжить;
					КонецЕсли; 
					
					Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
						СсылкаОСОплатаУслуги = 0;
						Если СсылкаОС <> Неопределено Тогда
							Для каждого Строка Из ТабОстатокСуммы Цикл
								Если Строка.ЛицевойСчет = ВыборкаУслуг.ЛС и Строка.Услуга = ВыборкаУслуг.Услуга	Тогда
									СсылкаОСОплатаУслуги = Строка.Сумма;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							Если СсылкаОСОплатаУслуги = 0 Тогда
								Продолжить;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				Исключение
					
					Продолжить;
					
				КонецПопытки;
				
				Сумма = 0;

				Если СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
					
					//Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
					Если Остаток = 0 Тогда
						Прервать;
					КонецЕсли; 
					тмпСумма = Мин(Долг, Остаток);
					//КонецЕсли;
					
					Если СсылкаОС <> Неопределено Тогда
						// Ограничение долга остаткими по оплате.
						Если тмпСумма > СсылкаОСОплатаУслуги Тогда
							тмпСумма           = СсылкаОСОплатаУслуги;
						КонецЕсли;
						
						// Списываем с суммы оплаты уже начисленный долг.
						Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
							НСтрОстатокСуммы			 = ТабОстатокСуммы.Добавить();
							НСтрОстатокСуммы.ЛицевойСчет = ВыборкаУслуг.ЛС;
							НСтрОстатокСуммы.Услуга		 = ВыборкаУслуг.Услуга;
							НСтрОстатокСуммы.Сумма		 = -тмпСумма;
							ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
						КонецЕсли;
					КонецЕсли;
					
						
					//Без мин.взноса
					Стр = ИспЛС.Добавить();
					Стр.ЛС =  ВыборкаУслуг.ЛС;
					Стр.Услуга =  ВыборкаУслуг.Услуга;
					Стр.ПериодМес = ВыборкаУслуг.ПериодНачисленияПени;
					

					
					КапРемонт = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт;
					НовыяСтрока					  = ТаблицаЛС.Добавить();
					НовыяСтрока.ЛицевойСчет		  = кэшЛицевойСчет;
					
					Если ВыборкаУслуг.Услуга.ГрафаОтчетаГЦЖС = КапРемонт Тогда
						 НовыяСтрока.Услуга = ПениПоКапРемонт;
					 Иначе 
						 НовыяСтрока.Услуга = Пени;
					КонецЕсли; 
										//Первая строка, общий долг за период
					
					//ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
					//ОбластьСтрока.Параметры.СуммаЗадолженности			  = тмпСумма;
					//ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
					//ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
					//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
					//НовыяСтрока.Сумма			  = Окр(тмпСумма * КалендарныхДней * (ВыборкаУслуг.ПроцентПени/100),2);	
						Сумма			  = Сумма +  Окр(тмпСумма * КалендарныхДней * (ВыборкаУслуг.ПроцентПени/100),2);
					
					//ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = КоличествоДнейИтог;
					//ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), "ДЛФ=Д"));
					//ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
					//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
					//ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
					//Таблица.Вывести(ОбластьСтрока);
					
					
					 Попытка
						
						Для Индекс = 0 По СтрокаДолга.Количество() - 1  Цикл
							
							//КоличествоДнейПросрочки = Окр(НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24)) / 86400);
							
							Если СтрокаДолга[индекс].период >= 90 Тогда
								//
								//ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
								//ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
								//ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
								//ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаНачала + ((СрокОплаты - 2)*(60 * 60 * 24)), "ДЛФ=Д"));
								Нач = НачалоМесяца(Объект.ДатаЗакрытия);//Период.ДатаНачала;
								Кон = НачалоМесяца(Объект.ДатаЗакрытия) + ((СрокОплаты - 2)*(60 * 60 * 24));
								//ОбластьСтрока.Параметры.Дней = (НачалоДня(Кон) - НачалоДня(нач)) / 86400+1;
								//НовыяСтрока.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * ( (НачалоДня(Кон) - НачалоДня(нач)) / 86400) * (0.0283),2);
								Сумма			  = Сумма +   Окр(СтрокаДолга[Индекс].СуммаОстаток1 * ( (НачалоДня(Кон) - НачалоДня(нач)) / 86400+1) * (0.0283/100),2);

								//й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
								//ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
								//ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
								//ОбластьСтрока.Параметры.Коэффициент		  = 0.0283;
								//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
								//ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
								ДолгБольше90 = Истина;
								//Таблица.Вывести(ОбластьСтрока);	
								
							КонецЕсли; 
							
							Если ДолгБольше90 = Истина Тогда
								
								//ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
								//ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
								//ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала + ((СрокОплаты - 1)*(60 * 60 * 24)), "ДЛФ=Д"));
								//ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
								Нач = НачалоМесяца(Объект.ДатаЗакрытия) + ((СрокОплаты - 1)*(60 * 60 * 24));
								Кон = КонецМесяца(Объект.ДатаЗакрытия); //Период.ДатаОкончания;
								//ОбластьСтрока.Параметры.Дней = (НачалоДня(Кон) - НачалоДня(нач)) / 86400+1;
								//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
								//НовыяСтрока.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * ((НачалоДня(Кон) - НачалоДня(нач)) / 86400) * (ВыборкаУслуг.ПроцентПени/100),2);
								
								Сумма			  = Сумма +  Окр(СтрокаДолга[Индекс].СуммаОстаток1 * ((НачалоДня(Кон) - НачалоДня(нач)) / 86400) * (ВыборкаУслуг.ПроцентПени/100),2);

								//й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
								//ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
								//ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
								//ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
								//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
								//ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
								//Таблица.Вывести(ОбластьСтрока);	
								ДолгБольше90 = Ложь;
								
							Иначе
								//Исправить процент пени
								Если СтрокаДолга[Индекс].период <= 91  Тогда
									Коэффициент = 0.0283;   
								Иначе 
									Коэффициент = ВыборкаУслуг.ПроцентПени;   
								КонецЕсли;
								
								
								Если (НЕ МассивДолг.Количество() = 0) И (НачалоДня(МассивДолг[0]) = НачалоДня(СтрокаДолга[Индекс].период1)) Тогда
									
									//ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
									//ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
									//ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
									//ОбластьСтрока.Параметры.РасчетПениКон = (Формат(МассивДолг[1] - 1,"ДЛФ=Д"));
									//й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
									//ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
									//КоличествоДнейПросрочки = (й / 86400);
									Дней = ((НачалоДня(МассивДолг[1]) - НачалоДня(НачалоМесяца(Объект.ДатаЗакрытия)))/(60 * 60 * 24) ); 
									//Если КоличествоДнейПросрочки < Дней Тогда
									//	Дней = КоличествоДнейПросрочки   	
									//Иначе 
									//	Дней = КалендарныхДней;	
									////КонецЕсли;
									//ОбластьСтрока.Параметры.Дней = Дней ;
									//НовыяСтрока.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
									Сумма			  = Сумма + Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
 
									
									//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
									//ОбластьСтрока.Параметры.Коэффициент		  = Коэффициент;
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
									//ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
									//Таблица.Вывести(ОбластьСтрока);	
									
								ИначеЕсли (НЕ МассивДолг.Количество() = 0) И Месяц(СтрокаДолга[Индекс].ПериодВзаиморасчетов) =  Месяц(МассивДолг[0])  Тогда 	
									
									//ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
									//ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
									//ОбластьСтрока.Параметры.РасчетПениНач = (Формат(МассивДолг[1],"ДЛФ=Д"));
									//ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания,"ДЛФ=Д"));
									//й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
									//ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400); 
									й = (НачалоДня((КонецМесяца(КонецМесяца(Объект.ДатаЗакрытия))))) - (НачалоДня(МассивДолг[1]));
									Дней = (й /(60 * 60 * 24)+1); 
									//Если КоличествоДнейПросрочки < Дней Тогда
									//	Дней = КоличествоДнейПросрочки   	
									//Иначе 
									//	Дней = КалендарныхДней;	
									//КонецЕсли;
									//ОбластьСтрока.Параметры.Дней = Дней ;
									//НовыяСтрока.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
									Сумма			  = Сумма +  Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
									
									//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
									//ОбластьСтрока.Параметры.Коэффициент		  = Коэффициент;
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
									//ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
									//Таблица.Вывести(ОбластьСтрока);	
									
									
								Иначе 
									
									//ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
									//ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
									//ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
									//ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
									й = НачалоДня((НачалоМесяца(НачалоМесяца(Объект.ДатаЗакрытия)))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
									//ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
									КоличествоДнейПросрочки = (й / 86400);
									Дней = ((НачалоДня((КонецМесяца(Объект.ДатаЗакрытия))) - НачалоДня(НачалоМесяца(Объект.ДатаЗакрытия)))/(60 * 60 * 24)  + 1 ); 
									
									Если КоличествоДнейПросрочки < Дней Тогда
										Дней = КоличествоДнейПросрочки   	
									Иначе 
										Дней = КалендарныхДней;	
									КонецЕсли; 
									
									//ОбластьСтрока.Параметры.Дней = Дней ;
									
									НовыяСтрока.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
															
									Сумма			  = Сумма + Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
									//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
									//ОбластьСтрока.Параметры.Коэффициент		  = Коэффициент;
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
									//ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
									//Таблица.Вывести(ОбластьСтрока);	
								КонецЕсли; 
								
							КонецЕсли; 
						КонецЦикла;
						
					Исключение
						Продолжить;
					КонецПопытки; 	
					
					НовыяСтрока.Сумма		 = Сумма;
					НовыяСтрока.Начислено	 = Сумма;
					
					//НовыяСтрока.Услуга			  = ВыборкаУслуг.Услуга;
					
					//НовыяСтрока.Долг			  = тмпСумма;
					//НовыяСтрока.КоличествоДней	  = ВыборкаУслуг.КоличествоДней;
					//НовыяСтрока.КоличествоМесяцев = ВыборкаУслуг.КоличествоМесяцев; //Для правльного подсчета долга и суммы при свертке (техническая колонка).
					//НовыяСтрока.Сумма			  = Окр(тмпСумма * ВыборкаУслуг.КоличествоДней * (ВыборкаУслуг.ПроцентПени/100),2);
					//НовыяСтрока.ПроцентПени		  = ВыборкаУслуг.ПроцентПени;
					//НовыяСтрока.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
					
					// Списываем с суммы переплаты уже начисленный долг.
					Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
						Остаток = Остаток - тмпСумма;
						кэшУслуга = ВыборкаУслуг.Услуга;
					КонецЕсли;
					
				Иначе
					
					Если СсылкаОС <> Неопределено Тогда
						// Ограничение долга остаткими по оплате.
						Если Долг > СсылкаОСОплатаУслуги Тогда
							Долг           = СсылкаОСОплатаУслуги;
						КонецЕсли;
						
						// Списываем с суммы оплаты уже начисленный долг.
						Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
							НСтрОстатокСуммы			 = ТабОстатокСуммы.Добавить();
							НСтрОстатокСуммы.ЛицевойСчет = ВыборкаУслуг.ЛС;
							НСтрОстатокСуммы.Услуга		 = ВыборкаУслуг.Услуга;
							НСтрОстатокСуммы.Сумма		 = -Долг;
							ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
							кэшУслуга = ВыборкаУслуг.Услуга;
						КонецЕсли;
					КонецЕсли;
					
					КапРемонт = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт;
					НовыяСтрока = ТаблицаЛС.Добавить();
					НовыяСтрока.ЛицевойСчет		  = кэшЛицевойСчет;
					 
					Если ВыборкаУслуг.Услуга.ГрафаОтчетаГЦЖС = КапРемонт Тогда
						 НовыяСтрока.Услуга = ПениПоКапРемонт;
					 Иначе 
						 НовыяСтрока.Услуга = Пени;
					КонецЕсли; 

					//НовыяСтрока.Услуга			  = ВыборкаУслуг.Услуга;
					//НовыяСтрока.Долг			  = Долг;
					//НовыяСтрока.КоличествоДней	  = ВыборкаУслуг.КоличествоДней;
					//НовыяСтрока.КоличествоМесяцев = ВыборкаУслуг.КоличествоМесяцев; // Для правльного подсчета долга и суммы при свертке (техническая колонка).
					НовыяСтрока.Сумма			  = Окр(Долг * ВыборкаУслуг.КоличествоДней * (ВыборкаУслуг.ПроцентПени/100),2);
					//НовыяСтрока.ПроцентПени		  = ВыборкаУслуг.ПроцентПени;
					//НовыяСтрока.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
					
				КонецЕсли;
				
			КонецЦикла; // ВыборкаУслуг.
		КонецЦикла; // ВыборкаКоличествоМесяцев.
	КонецЦикла; // ВыборкаЛС.
	
	//ТаблицаЛС.Свернуть("ЛицевойСчет, КоличествоЕдиниц, НачисленияЗаПериод, СпособРаспределения, Объем, Услуга, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Счетчик", "Сумма");
	ТаблицаЛС.Свернуть("ЛицевойСчет, Объем, Услуга, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ", "Сумма, Начислено");

	////ПениПоПериодам.Загрузить(ТаблицаЛС);
	//ТаблицаЛС.Свернуть("Долг, ЛицевойСчет, НомерСтроки, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Услуга, ПериодНачисленияПени", "Сумма, КоличествоДней");
	//ТаблицаЛС.Свернуть("КоличествоДней, ЛицевойСчет, НомерСтроки, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Услуга, Долг, ПериодНачисленияПени", "Сумма");
	//ТаблицаЛС.Свернуть("КоличествоДней, ЛицевойСчет, НомерСтроки, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Услуга", "Сумма, Долг");
	ЗаполнениеСчетовКУ(ТаблицаЛС);

	ДокПени.ЛицевыеСчета.Загрузить(ТаблицаЛС);

		
	ДокПени.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСчетовКУ(ТабЛицевыеСчета = Неопределено) Экспорт 
	
	Если ТабЛицевыеСчета = Неопределено тогда
		
		//СписокЛС = ДокПени.СписокУслуг.ВыгрузитьКолонку("ЛицевойСчет");

		//Колонки  = ДокПени.СписокУслуг.ВыгрузитьКолонки().Колонки;
		//
		//бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ДокПени.СписокУслуг, Колонки, СписокЛС, Объект.Организация , Объект.ДатаЗакрытия,,,Истина);
		
	Иначе
		
		СписокЛС = ТабЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТабЛицевыеСчета.Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТабЛицевыеСчета, Колонки, СписокЛС, Объект.Организация , Объект.ДатаЗакрытия,,,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДолга(СсылкаОС, Момент, ДокПени)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей КАК ПоследнийДеньПриемаПлатежей
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних КАК бит_НастройкаПараметровЖКХСрезПоследних
	|ГДЕ
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация = &Организация";
	
	СрокОплаты = Запрос.Выполнить().Выгрузить();
	СрокОплаты = -СрокОплаты[0].ПоследнийДеньПриемаПлатежей;
	
	Массив = Новый Массив;
	Для каждого Строка Из ДокПени  Цикл
		Массив.Добавить(Строка.ЛС);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Дата",		 Объект.ДатаЗакрытия);
	Запрос.Текст =
	
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления.КоличествоМесяцев, 0) КАК КоличествоМесяцев
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Начислять = ИСТИНА
	|				И Процент >= 0) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоМесяцев УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоИнтервалов = Выборка.Количество(); 
	Если КоличествоИнтервалов = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо настроить периоды начисления пени в регистре сведений Пени по услугам ЖКХ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , Момент);
	Запрос.УстановитьПараметр("ДатаНачала" , Момент);
	Запрос.УстановитьПараметр("ДатаКонца"  , ?(СсылкаОС<> Неопределено,Новый МоментВремени(Объект.ДатаЗакрытия, СсылкаОС),КонецДня(Объект.ДатаЗакрытия)));
	
	//Лицевойсчет2 = Справочники.бит_ЛицевыеСчета.найтипоНаименованию("76093009990");
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Массив);
	Запрос.УстановитьПараметр("Ссылка"     , СсылкаОС);
	//Запрос.УстановитьПараметр("ТекущаяДата", Дата("20200830"));
	Запрос.УстановитьПараметр("ТекущаяДата", (Объект.ДатаЗакрытия));
	Запрос.УстановитьПараметр("СрокОплаты", СрокОплаты);
	ТекстОстатки = "";
	ТекстОбороты = "";
	ПервыйЭлемент = Истина;
	ПредыдущийЭлемент = 0;
	ПоследнийМесяц = 1;
	
	Пока Выборка.Следующий() Цикл
		
		КоличествоИнтервалов = КоличествоИнтервалов - 1;
		
		//Остатки.
		Если НЕ ПервыйЭлемент Тогда
			ТекстОстатки = ТекстОстатки + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли; 
		
		ТекстОстатки = ТекстОстатки + "
		|ВЫБРАТЬ
		|	" + ?(ПервыйЭлемент, 999, ПредыдущийЭлемент) + " КАК КоличествоМесяцев,
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток) КАК СуммаОстаток";
		
		Если ПервыйЭлемент Тогда
			ТекстОстатки = ТекстОстатки + "
			|ПОМЕСТИТЬ ВТ_Остатки ";
		КонецЕсли; 
		
		ТекстОстатки = ТекстОстатки + "
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, &СрокОплаты), МЕСЯЦ, -" + Выборка.КоличествоМесяцев + "), ЛицевойСчет В (&ЛицевойСчет)) КАК НачисленияПоУслугамЖКХПоПериодуОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет,
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ";
		
		
		//Обороты.
		Если ПервыйЭлемент Тогда
			ТекстОбороты = ТекстОбороты + 
			";
			|
			|////////////////////////////////////////////////////////////////////////////////";
		Иначе
			ТекстОбороты = ТекстОбороты + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли; 
		
		ТекстОбороты = ТекстОбороты + "
		|ВЫБРАТЬ
		|	" + ?(ПервыйЭлемент, 999, ПредыдущийЭлемент) + " КАК КоличествоМесяцев,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|					И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор <> &Ссылка
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот * -1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Оплата,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|					И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор <> &Ссылка
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Разовые,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период КАК Период,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов";
		
		Если ПервыйЭлемент Тогда
			ТекстОбороты = ТекстОбороты + "
			|ПОМЕСТИТЬ ТаблицаОплаты ";
		КонецЕсли; 
		
		ТекстОбороты = ТекстОбороты + "
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -" + Выборка.КоличествоМесяцев + "), &ДатаКонца, Регистратор, ЛицевойСчет в (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
		|   бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов";
		
		
		ПервыйЭлемент = Ложь;
		ПредыдущийЭлемент = Выборка.КоличествоМесяцев;
		
	КонецЦикла; 
	
	// Итоговый текст запроса. Смещаем всю сумму переплат в самый поздний период,
	// где наибольшей процент пени, чтобы уменьшить долг.
	
	
	Запрос.Текст = ТекстОстатки + ТекстОбороты +
	";
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиМесяц
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаКонца, МЕСЯЦ, -3) И &ДатаКонца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РазовыеПриход
	|ПОМЕСТИТЬ ВТ_ТекОплаты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ТекОстаток
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(&ДатаНачала, ЛицевойСчет В (&ЛицевойСчет)) КАК НачисленияПоУслугамЖКХПоПериодуОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет,
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекОстаток.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ТекОстаток.УслугаЖКХ КАК УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0) < 0
	|			ТОГДА (ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0)) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Переплата
	|ПОМЕСТИТЬ ВР_ВсеПереплаты
	|ИЗ
	|	ВТ_ТекОстаток КАК ВТ_ТекОстаток
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТекОплаты КАК ВТ_ТекОплаты
	|		ПО ВТ_ТекОстаток.ЛицевойСчет = ВТ_ТекОплаты.ЛицевойСчет
	|			И ВТ_ТекОстаток.УслугаЖКХ = ВТ_ТекОплаты.УслугаЖКХ
	|ГДЕ
	|	НЕ ВТ_ТекОстаток.ЛицевойСчет ЕСТЬ NULL
	|	И НЕ ВТ_ТекОстаток.УслугаЖКХ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекОстаток.ЛицевойСчет,
	|	ВТ_ТекОстаток.УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0) < 0
	|			ТОГДА (ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0)) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВТ_Остатки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Остатки.УслугаЖКХ КАК Услуга,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0)
	|	КОНЕЦ КАК Долг,
	|	ВР_ВсеПереплаты.Переплата КАК Переплата,
	|	ТаблицаОплаты.Период КАК Период,
	|	ТаблицаОплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВТ_Остатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОплаты.Оплата КАК Оплата,
	|	ВТ_ОстаткиМесяц.СуммаОстаток КАК СуммаОстаток1
	|ПОМЕСТИТЬ ВР_Таб
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаОплаты КАК ТаблицаОплаты
	|			ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОстаткиМесяц КАК ВТ_ОстаткиМесяц
	|			ПО (ВТ_ОстаткиМесяц.УслугаЖКХ = ТаблицаОплаты.УслугаЖКХ)
	|				И (ВТ_ОстаткиМесяц.ЛицевойСчет = ТаблицаОплаты.ЛицевойСчет)
	|		ПО ВТ_Остатки.КоличествоМесяцев = ТаблицаОплаты.КоличествоМесяцев
	|			И ВТ_Остатки.ЛицевойСчет = ТаблицаОплаты.ЛицевойСчет
	|			И ВТ_Остатки.УслугаЖКХ = ТаблицаОплаты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_ВсеПереплаты КАК ВР_ВсеПереплаты
	|		ПО ВТ_Остатки.ЛицевойСчет = ВР_ВсеПереплаты.ЛицевойСчет
	|			И ВТ_Остатки.УслугаЖКХ = ВР_ВсеПереплаты.УслугаЖКХ
	|ГДЕ
	|	НЕ ВТ_Остатки.КоличествоМесяцев ЕСТЬ NULL
	|	И НЕ ВТ_Остатки.ЛицевойСчет ЕСТЬ NULL
	|	И НЕ ВТ_Остатки.УслугаЖКХ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.КоличествоМесяцев,
	|	ВТ_Остатки.ЛицевойСчет,
	|	ВТ_Остатки.УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0)
	|	КОНЕЦ,
	|	ВР_ВсеПереплаты.Переплата,
	|	ТаблицаОплаты.Период,
	|	ТаблицаОплаты.ПериодВзаиморасчетов,
	|	ВТ_Остатки.СуммаОстаток,
	|	ТаблицаОплаты.Оплата,
	|	ВТ_ОстаткиМесяц.СуммаОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВР_Таб.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВР_Таб.ЛицевойСчет КАК ЛицевойСчет,
	|	ВР_Таб.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВР_Таб1.Долг ЕСТЬ NULL
	|				ТОГДА ВР_Таб.Долг
	|			ИНАЧЕ ВР_Таб1.Долг - ВР_Таб.Оплата
	|		КОНЕЦ) КАК Долг,
	|	МИНИМУМ(ВР_Таб1.Долг) КАК Долг1,
	|	ВР_Таб.Переплата КАК Переплата,
	|	ВР_Таб.Период КАК Период,
	|	ВР_Таб.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВР_Таб.СуммаОстаток КАК СуммаОстаток,
	|	ВР_Таб.Оплата КАК Оплата,
	|	ВР_Таб.СуммаОстаток1 КАК СуммаОстаток1
	|ПОМЕСТИТЬ ВР_Таб12
	|ИЗ
	|	ВР_Таб КАК ВР_Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ВР_Таб1
	|		ПО ВР_Таб.ЛицевойСчет = ВР_Таб1.ЛицевойСчет
	|			И ВР_Таб.Услуга = ВР_Таб1.Услуга
	|			И ВР_Таб.КоличествоМесяцев = ВР_Таб1.КоличествоМесяцев
	|			И ВР_Таб.ПериодВзаиморасчетов > ВР_Таб1.ПериодВзаиморасчетов
	|ГДЕ
	|	НЕ ВР_Таб.Период = ВР_Таб.ПериодВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВР_Таб.ПериодВзаиморасчетов,
	|	ВР_Таб.КоличествоМесяцев,
	|	ВР_Таб.ЛицевойСчет,
	|	ВР_Таб.Услуга,
	|	ВР_Таб.Переплата,
	|	ВР_Таб.СуммаОстаток,
	|	ВР_Таб.Оплата,
	|	ВР_Таб.Период,
	|	ВР_Таб.СуммаОстаток1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДельтаТаблица.КоличествоМесяцев) КАК ДельтаТаблицаКоличествоМесяцев,
	|	ВР_Таб12.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВР_Таб12.ЛицевойСчет КАК ЛицевойСчет,
	|	ВР_Таб12.Услуга КАК Услуга,
	|	ВР_Таб12.Долг КАК Долг,
	|	ВР_Таб12.Период КАК Период,
	|	ВР_Таб12.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВР_Таб12.Переплата КАК Переплата,
	|	ВР_Таб12.СуммаОстаток1 КАК СуммаОстаток1
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ВР_Таб12 КАК ВР_Таб12
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ДельтаТаблица
	|		ПО ВР_Таб12.ЛицевойСчет = ДельтаТаблица.ЛицевойСчет
	|			И ВР_Таб12.Услуга = ДельтаТаблица.Услуга
	|			И ВР_Таб12.КоличествоМесяцев < ДельтаТаблица.КоличествоМесяцев
	|
	|СГРУППИРОВАТЬ ПО
	|	ВР_Таб12.КоличествоМесяцев,
	|	ВР_Таб12.ЛицевойСчет,
	|	ВР_Таб12.Услуга,
	|	ВР_Таб12.Долг,
	|	ВР_Таб12.Период,
	|	ВР_Таб12.ПериодВзаиморасчетов,
	|	ВР_Таб12.Переплата,
	|	ВР_Таб12.СуммаОстаток1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ИтоговаяТаблица.ЛицевойСчет КАК ЛицевойСчет,
	|	ИтоговаяТаблица.Услуга КАК Услуга,
	|	ИтоговаяТаблица.Долг КАК Долг,
	|	ИтоговаяТаблица.Долг - ЕСТЬNULL(ВР_Таб.Долг, 0) КАК ДолгДляНачисления,
	|	ИтоговаяТаблица.Период КАК Период,
	|	ИтоговаяТаблица.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ИтоговаяТаблица.Переплата КАК Переплата,
	|	ИтоговаяТаблица.СуммаОстаток1 КАК СуммаОстаток1
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ВР_Таб
	|		ПО ИтоговаяТаблица.ДельтаТаблицаКоличествоМесяцев = ВР_Таб.КоличествоМесяцев
	|			И ИтоговаяТаблица.ЛицевойСчет = ВР_Таб.ЛицевойСчет
	|			И (ВР_Таб.Услуга = ИтоговаяТаблица.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Итоговая.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВТ_Итоговая.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Итоговая.Услуга КАК Услуга,
	|	ВТ_Итоговая.Долг КАК Долг,
	|	ВТ_Итоговая.ДолгДляНачисления КАК ДолгДляНачисления,
	|	РАЗНОСТЬДАТ(ВТ_Итоговая.Период, &ТекущаяДата, ДЕНЬ) КАК Период,
	|	ВТ_Итоговая.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВТ_Итоговая.Переплата КАК Переплата,
	|	ВТ_Итоговая.СуммаОстаток1 КАК СуммаОстаток1,
	|	ВТ_Итоговая.Период КАК Период1
	|ИЗ
	|	ВТ_Итоговая КАК ВТ_Итоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Итоговая.КоличествоМесяцев,
	|	Период УБЫВ"; 
	
	
	Возврат Запрос.Выполнить().Выгрузить();

	
КонецФункции

&НаСервере
Функция ЗаписатьОбъем(Док, Объем, Здание, Услуга)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Здание", Здание);
	ПараметрыОтбора.Вставить("Услуга", Услуга);
	СтрокиТЧ = Док.ОбъемыЖКУ.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиТЧ.Количество() > 0 Тогда
		СтрокаТЧ = СтрокиТЧ[0];	
	Иначе 	
		СтрокаТЧ = Док.ОбъемыЖКУ.Добавить();
		СтрокаТЧ.Здание = Здание;
		СтрокаТЧ.Услуга = Услуга;
	КонецЕсли;
	СтрокаТЧ.ОбъемЖКУ = Объем;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуДокумента(Документ,Тариф,Вид,Здание,Организация,ПоставщикУслуг)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_РежимыПотребленияУслуг.Ссылка КАК Ссылка,
	|	бит_РежимыПотребленияУслуг.Код КАК Код
	|ИЗ
	|	Справочник.бит_РежимыПотребленияУслуг КАК бит_РежимыПотребленияУслуг
	|ГДЕ
	|	бит_РежимыПотребленияУслуг.Наименование = &Наименование
	|	И бит_РежимыПотребленияУслуг.ПометкаУдаления = Ложь";
	//Запрос.УстановитьПараметр("Наименование",Строка(Вид));
	Запрос.УстановитьПараметр("Наименование", Строка(Здание.Код));
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Режим = Результат.Ссылка;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК Тип,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК Статус
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	|ГДЕ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец = &Здание";
	Запрос.УстановитьПараметр("Здание", Здание);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Стр = 0 По РезультатЗапроса.Количество()-1 Цикл
		РЗап = РезультатЗапроса[Стр];
			СтрокаЕсть = Ложь;
		Если ИспользоватьОтборЗдание Тогда
			ЗапросСтав = Новый Запрос;
			ЗапросСтав.Текст = 
			"ВЫБРАТЬ 
			|	бит_УстановкаСтавокПоУслугамСтавкиНаУслуги.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Документ.бит_УстановкаСтавокПоУслугам.СтавкиНаУслуги КАК бит_УстановкаСтавокПоУслугамСтавкиНаУслуги
			|ГДЕ
			|	бит_УстановкаСтавокПоУслугамСтавкиНаУслуги.Ссылка = &Документ
			|	И бит_УстановкаСтавокПоУслугамСтавкиНаУслуги.ТипКвартиры = &Тип
			|	И бит_УстановкаСтавокПоУслугамСтавкиНаУслуги.СтатусКвартиры = &Статус
			|	И бит_УстановкаСтавокПоУслугамСтавкиНаУслуги.РежимПотребления = &Режим";
			ЗапросСтав.УстановитьПараметр("Документ", Документ.ссылка);
			ЗапросСтав.УстановитьПараметр("Тип", Рзап.Тип);
			ЗапросСтав.УстановитьПараметр("Режим", Режим);
			ЗапросСтав.УстановитьПараметр("Статус", Рзап.Статус);
			РезЗап = ЗапросСтав.Выполнить().Выбрать();  
			Пока РезЗап.Следующий() Цикл
				//РезЗап = РезультатЗапросаСтав[0];
				Если ВРег(СокрЛП(Строка(Режим))) = "НЕ НАЧИСЛЯТЬ" Тогда
					Тариф = 0;
				КонецЕсли;
				ДобавитьСтроку = Документ.СтавкиНаУслуги.Найти(РезЗап.НомерСтроки,"НомерСтроки"); 
				ДобавитьСтроку.ТипКвартиры             = Рзап.Тип; 
				ДобавитьСтроку.СтатусКвартиры  		   = Рзап.Статус;
				ДобавитьСтроку.РежимПотребления        = Режим;
				ДобавитьСтроку.Поставщик       		   = ПоставщикУслуг; 
				ДобавитьСтроку.ПлановаяСтавка          = Тариф;
				ДобавитьСтроку.ОсновнаяСтавка          = Тариф;
				ДобавитьСтроку.СверхнормативнаяСтавка  = Тариф;
				//ДобавитьСтроку.СпособРасчета 		   = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади;
				добавитьСтроку.Тариф                   = Тариф;
				добавитьСтроку.НормативПотребленияпоку = 1;
			//Иначе	
			//	ДобавитьСтроку = Документ.СтавкиНаУслуги.Добавить();
				СтрокаЕсть = Истина;	
			КонецЦикла;
		КонецЕсли;
		Если НЕ СтрокаЕсть Тогда	
			ДобавитьСтроку = Документ.СтавкиНаУслуги.Добавить();
		
		Если ВРег(СокрЛП(Строка(Режим))) = "НЕ НАЧИСЛЯТЬ" Тогда
			Тариф = 0;
		КонецЕсли;
		
		ДобавитьСтроку.ТипКвартиры             = Рзап.Тип; 
		ДобавитьСтроку.СтатусКвартиры  		   = Рзап.Статус;
		ДобавитьСтроку.РежимПотребления        = Режим;
		ДобавитьСтроку.Поставщик       		   = ПоставщикУслуг; 
		ДобавитьСтроку.ПлановаяСтавка          = Тариф;
		ДобавитьСтроку.ОсновнаяСтавка          = Тариф;
		ДобавитьСтроку.СверхнормативнаяСтавка  = Тариф;
		ДобавитьСтроку.СпособРасчета 		   = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади;
		добавитьСтроку.Тариф                   = Тариф;
		добавитьСтроку.НормативПотребленияпоку = 1;
			ДобавитьСтроку = Документ.СтавкиНаУслуги.Добавить();
		
		Если ВРег(СокрЛП(Строка(Режим))) = "НЕ НАЧИСЛЯТЬ" Тогда
			Тариф = 0;
		КонецЕсли;
		
		ДобавитьСтроку.ТипКвартиры             = Рзап.Тип; 
		ДобавитьСтроку.СтатусКвартиры  		   = Рзап.Статус;
		ДобавитьСтроку.РежимПотребления        = Режим;
		ДобавитьСтроку.Поставщик       		   = ПоставщикУслуг; 
		ДобавитьСтроку.ПлановаяСтавка          = Тариф;
		ДобавитьСтроку.ОсновнаяСтавка          = Тариф;
		ДобавитьСтроку.СверхнормативнаяСтавка  = Тариф;
		ДобавитьСтроку.СпособРасчета 		   = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади;
		добавитьСтроку.Тариф                   = Тариф;
		добавитьСтроку.НормативПотребленияпоку = 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НайтиОбъемы(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОбъемыЖКУ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бит_ОбъемыЖКУ КАК бит_ОбъемыЖКУ
		|ГДЕ
		|	бит_ОбъемыЖКУ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
    	Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		Возврат Документы.бит_ОбъемыЖКУ.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
	
&НаСервере
Функция ДокСтавка(Дата,Организация,Услуга)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_УстановкаСтавокПоУслугам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_УстановкаСтавокПоУслугам КАК бит_УстановкаСтавокПоУслугам
	|ГДЕ
	|	бит_УстановкаСтавокПоУслугам.ПометкаУдаления = ЛОЖЬ
	|	И бит_УстановкаСтавокПоУслугам.Дата МЕЖДУ &Дата1 И &Дата2
	|	И бит_УстановкаСтавокПоУслугам.Услуга = &Услуга
	|	И бит_УстановкаСтавокПоУслугам.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_УстановкаСтавокПоУслугам.Дата УБЫВ";
	Запрос.УстановитьПараметр("Услуга",Услуга);	
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса[0].Ссылка.ПолучитьОбъект();
	Иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции

&НаСервере
Функция НайтиДокументНПЛС(Дата,Здание,Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачислениеПоЛицевымСчетам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_НачислениеПоЛицевымСчетам КАК бит_НачислениеПоЛицевымСчетам
	|ГДЕ
	|	бит_НачислениеПоЛицевымСчетам.Здание = &Здание
	|	И бит_НачислениеПоЛицевымСчетам.ПометкаУдаления = ЛОЖЬ
	|	И бит_НачислениеПоЛицевымСчетам.Дата МЕЖДУ &Дата1 И &Дата2
	|	И бит_НачислениеПоЛицевымСчетам.Организация = &Организация";
	Запрос.УстановитьПараметр("Здание",Здание);	
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
	
КонецФункции

&НаСервере
Функция ПолучитьСпособРасчета(Дата, Здание); 
	//Мельник Исправление
	Запрос = Новый Запрос;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("Здание", Здание);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	лб_Тест_Дома.НастройкаПечати КАК НастройкаПечати
	|ИЗ
	|	РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
	|ГДЕ
	|	лб_Тест_Дома.Здание = &Здание";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		//СпособРасчета = Лб_Сервер.СвойствоЗдания(Дата,Здание,"лб_НастройиПечатиКвитанции");
		//Возврат СпособРасчета;	
		Возврат Выборка.НастройкаПечати;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПроверитьНаНоль(Тариф);
	Если Тариф = "" Тогда
		Тариф = 0;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти