перем мКэшЗданий;
перем мКэшКвартирЛС;
перем мКэшПроживающих;
перем мРазделенныеКвартиры;
перем МассивСтру;
перем мСтепениРодства;
перем мТаблицаИменРО;
перем мСтатусыФизЛиц;
перем мКэшУслуг;
перем мКэшРежимов;
перем мСчет76КУ;
перем мПоставщикиУслуг;
перем мТарифы;
перем мНеверныеСНИЛС;
перем мУжеОбработанныеОбъекты;

перем мДокиДомов;




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	Если ЗначениеЗаполнено(ИмяФайлаКл) тогда
		ИмяФайлаОкончаниеВыбора();
	КонецЕсли;	
КонецПроцедуры

#Область КэшированиеДанных

&НаСервере
Процедура ЗаполнитьКэшЗданий()
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("НаправлениеОбмена",Объект.НаправлениеОбмена);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подстрока(лб_ПредставлниеЗданий.Представление,1,1500) КАК Представление,
		|	лб_ПредставлниеЗданий.Здание КАК Здание
		|ИЗ
		|	РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
		|ГДЕ
		|	лб_ПредставлниеЗданий.НаправлениеОбмена = &НаправлениеОбмена";
	мКэшЗданий = Запрос.Выполнить().Выгрузить();
	мКэшЗданий.Индексы.Добавить("Представление");
		
КонецПроцедуры	

&НаСервере
Функция ЗданиеИзКэша(Представление)
	СтрокаТ = мКэшЗданий.Найти(СокрЛП(Представление),"Представление");
	Если СтрокаТ=Неопределено тогда
		Сообщить("Не найдено здание "+Представление);		
		возврат Справочники.бит_СписокЗданий.ПустаяСсылка();
	КонецЕсли;	           	
	возврат СтрокаТ.Здание;	
КонецФункции	

// Функция - Данные ЛС - Выводит кэшированные данные по ЛС
//
// Параметры:
//  ИмяЛС	 - Строка	 - Номер ЛС
// 
// Возвращаемое значение:
//  СтрокаТЧ - ИмяЛС
//
&НаСервере
Функция ДанныеЛС(знач ИмяЛС)
	ИмяЛС = лев(сокрЛП(ИмяЛС)+"000000000000",10);
	СтрокаТ = мКэшКвартирЛС.Найти(ИмяЛС,"ИмяЛС10");	
	Возврат СтрокаТ;
КонецФункции	

&НаСервере
Функция СсылкаЛС(ИмяЛС)
	ДанныеЛС = ДанныеЛС(сокрЛП(ИмяЛС));
	возврат ?(ДанныеЛС = Неопределено,Справочники.бит_ЛицевыеСчета.ПустаяСсылка(),ДанныеЛС.ЛС);
КонецФункции	

&НаСервере
Процедура ЗаполнитьКэшКвартирЛицевыхСчетов()
	Запрос = новый запрос;
	ЗАпрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛС,
		|	ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 1500) КАК ИмяЛС,
		|	бит_ЛицевыеСчета.Здание КАК Здание,
		|	бит_ЛицевыеСчета.Квартира КАК Квартира,
		|	бит_ЛицевыеСчета.Квартира.Подъезд КАК Подъезд,
		|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица,
		|	ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10) КАК ИмяЛС10,
		|	бит_ЛицевыеСчета.Здание.Код КАК ЗданиеКод
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета";
	мКэшКвартирЛС = Запрос.Выполнить().Выгрузить();
	мКэшКвартирЛС.Индексы.Добавить("ИмяЛС10");
КонецПроцедуры	

&НаСервере
Процедура ЗаменитьЕслиНовое(переменная,новоеЗначение,ЕстьИзменения=ложь)
	Если переменная<>новоеЗначение тогда
		переменная = новоеЗначение;
		ЕстьИзменения = истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшПроживающих()
	ТекстЗАпроса = "ВЫБРАТЬ
		|	бит_Проживающие.Ссылка КАК ФизЛицо,
		|	бит_Проживающие.СтраховойНомерПФР КАК СНИЛС,
		|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
		|	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
		|	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
		|	бит_Проживающие.ДатаРождения КАК ДатаРождения,
		|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаРегистрации,
		|	бит_Проживающие.Представление КАК Представление,
		|	ЛОЖЬ КАК ЗаписьПроверена,
		|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВыписки,
		|	бит_Проживающие.лб_СогласиеНаОбработкуПД КАК СогласиеПД
		|ИЗ
		|	Справочник.бит_Проживающие КАК бит_Проживающие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК бит_ФИОПроживающихСрезПоследних
		|		ПО (бит_ФИОПроживающихСрезПоследних.ФизЛицо = бит_Проживающие.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
		|		ПО (бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_Проживающие.Ссылка)
		|ГДЕ
		|	бит_Проживающие.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	ДатаРождения,
		|	бит_Проживающие.СтраховойНомерПФР УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";

	ТекстЗАпросаБезСНИЛС = "ВЫБРАТЬ
		|	бит_Проживающие.Ссылка КАК ФизЛицо,
		|	"""" КАК СНИЛС,
		|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
		|	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
		|	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
		|	бит_Проживающие.ДатаРождения КАК ДатаРождения,
		|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаРегистрации,
		|	бит_Проживающие.Представление КАК Представление,
		|	ЛОЖЬ КАК ЗаписьПроверена,
		|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВыписки,
		|	бит_Проживающие.лб_СогласиеНаОбработкуПД КАК СогласиеПД
		|ИЗ
		|	Справочник.бит_Проживающие КАК бит_Проживающие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК бит_ФИОПроживающихСрезПоследних
		|		ПО (бит_ФИОПроживающихСрезПоследних.ФизЛицо = бит_Проживающие.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
		|		ПО (бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_Проживающие.Ссылка)
		|ГДЕ
		|	бит_Проживающие.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	ДатаРождения,
		|	бит_Проживающие.СтраховойНомерПФР УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";

	
	Запрос = новый запрос;
	//Запрос.Текст = ТекстЗАпроса;
	Запрос.Текст = ТекстЗАпросаБезСНИЛС;
	мКэшПроживающих = Запрос.Выполнить().Выгрузить();
	
    //Удаляем информацию о СНИЛС из существующих записей кэша и элементов справочника
	Если мНеверныеСНИЛС = Неопределено тогда
		мНеверныеСНИЛС = новый массив; 
	КонецЕсли;	
	мКэшПроживающих.Индексы.Добавить("СНИЛС");
	мКэшПроживающих.Сортировать("СНИЛС убыв");
	Для инд =0 по мКэшПроживающих.Количество()-2 цикл
		Если НЕ ПустаяСтрока(мКэшПроживающих[инд+1].СНИЛС) и  
					мКэшПроживающих[инд].СНИЛС=мКэшПроживающих[инд+1].СНИЛС и
					(   (мКэшПроживающих[инд].Имя<>мКэшПроживающих[инд+1].имя) или
						(мКэшПроживающих[инд].Отчество<>мКэшПроживающих[инд+1].Отчество) или
						(мКэшПроживающих[инд].ДатаРождения<>мКэшПроживающих[инд+1].ДатаРождения)
					) и
			        мНеверныеСНИЛС.Найти(мКэшПроживающих[инд].СНИЛС)= Неопределено	тогда
			мНеверныеСНИЛС.Добавить(мКэшПроживающих[инд].СНИЛС);
		КонецЕсли;
	КонецЦикла;	
	
	Для каждого СНИЛС из мНеверныеСНИЛС цикл
		УдалитьНеверныйСНИЛС(СНИЛС);
	КонецЦикла;	
	
	
	//Удаляем дубли по СНИЛС - точнее, заменяем ссылки, чтобы во всех дублях были одинаковы  
	Для инд=0 ПО мКэшПроживающих.Количество()-2  цикл
		Если НЕ ПустаяСтрока(мКэшПроживающих[инд].СНИЛС) и  
					мКэшПроживающих[инд].СНИЛС=мКэшПроживающих[инд+1].СНИЛС и
					мКэшПроживающих[инд].ФизЛицо<>мКэшПроживающих[инд+1].ФизЛицо тогда
			мКэшПроживающих[инд+1].ФизЛицо=мКэшПроживающих[инд].ФизЛицо;
		КонецЕсли;
	КонецЦикла;	
	
	//Удаляем дубли по ФИО + ДР - точнее, заменяем ссылки, чтобы во всех дублях были одинаковы
	//при этом предпочтение отдаем строкам со СНИЛС, а затем - более свежим).
	мКэшПроживающих.Индексы.Добавить("Представление,ДатаРождения,СНИЛС,ДатаРегистрации");
	мКэшПроживающих.Сортировать("Представление,ДатаРождения,СНИЛС убыв,ДатаРегистрации убыв");
	Для инд=0 ПО мКэшПроживающих.Количество()-2  цикл                                                       
		Если НЕ ПустаяСтрока(мКэшПроживающих[инд].СНИЛС) и  
					мКэшПроживающих[инд].Представление=мКэшПроживающих[инд+1].Представление и //люди соответствуют
					мКэшПроживающих[инд].ДатаРождения=мКэшПроживающих[инд+1].ДатаРождения и   //по ФИО и ДР
					пустаяСтрока(мКэшПроживающих[инд+1].СНИЛС) и                              //кроме строк со СНИЛС
					мКэшПроживающих[инд].ФизЛицо<>мКэшПроживающих[инд+1].ФизЛицо тогда
			мКэшПроживающих[инд+1].ФизЛицо=мКэшПроживающих[инд].ФизЛицо;
		КонецЕсли;
	КонецЦикла;	
	
	
	//

	//
	////Удалиляем дубли по ФИО + ДатаРожд + СНИЛС
	//
	//ЧислоЗаписей = мКэшПроживающих.Количество();	
	//Для СчетВниз = 1 по ЧислоЗаписей-1 цикл
	//	ТекЗапись = мКэшПроживающих[ЧислоЗаписей-СчетВниз-1];
	//	ПредЗапись = мКэшПроживающих[ЧислоЗаписей - СчетВниз];
	//	
	//	ПризнакРавенства = ТекЗапись.Фамилия = ПредЗапись.Фамилия и
	//	                   ТекЗапись.Имя = ПредЗапись.Имя и
	//					   ТекЗапись.Отчество = ПредЗапись.Отчество;
	//	Если Не признакРавенства тогда
	//		Продолжить
	//	КонецЕсли;	
	//	
	//	//У двух строк соотвествуют ФИО и Даты рождения
	//	//Могут различаться СНИЛС		
	//	
	//	Если ТекЗапись.СНИЛС = ПредЗапись.СНИЛС тогда
	//		мКэшПроживающих.Удалить(ПредЗапись);	
	//		продолжить
	//	КонецЕсли;	
	//			
	//	Если Не ПустаяСтрока(ТекЗапись.СНИЛС)и ПустаяСтрока(ПредЗапись.СНИЛС) тогда
	//		Если ТекЗапись.Снилс = ПредЗапись.Снилс тогда
	//			мКэшПроживающих.Удалить(ПредЗапись);			
	//		КонецЕсли;	
	//		продолжить;
	//	ИначеЕсли ПустаяСтрока(ТекЗапись.СНИЛС)и НЕ ПустаяСтрока(ПредЗапись.СНИЛС) тогда	
	//		мКэшПроживающих.Сдвинуть(ПредЗапись,-1);
	//		мКэшПроживающих.Удалить(ТекЗапись);
	//		продолжить
	//	КонецЕсли;    		                         		
	//КонецЦикла;	
	//
	////Сейчас гарантировано, что нет дублей по ФИО и
	//// также нет записей по одному человеку со СНИЛС и без него
	//
	//// Оставим только по одной записи для человека с одним СНИЛС
	//
	//
	//
	//Т2 = мКэшПроживающих.Скопировать(,"СНИЛС");
	//Т2.Свернуть("СНИЛС");
	//
	//
	//ЧислоСтрок = мКэшПроживающих.Количество();	
	//Для каждого СтрокаТ2 из Т2 цикл
	//	Если ПустаяСтрока(СтрокаТ2.СНИЛС) тогда
	//		продолжить
	//	КонецЕсли;			
	//	
	//	Отбор = новый структура("СНИЛС",Строкат2.СНИЛС);         		
	//	СтрокиСНИЛС = мКэшПроживающих.НайтиСтроки(Отбор);
	//	Если СтрокиСнилс.Количество()<2 тогда
	//		продолжить
	//	КонецЕсли;
	//	
	//	ЧислоЗап = СтрокиСНИЛС.Количество();
	//	//Заменяем ссылки на только одну строку в кэше
	//	Для СчетВниз=1 по ЧислоЗап-1 цикл
	//		Зап1 = СтрокиСНИЛС[ЧислоЗап-СчетВниз];
	//		Зап2 = СтрокиСНИЛС[ЧислоЗап-СчетВниз-1];
	//		Если Зап1.ФизЛицо = Зап2.ФизЛицо тогда
	//			продолжить
	//		КонецЕсли;	
	//		Если Зап1.ДатаРегистрации>Зап2.ДатаРегистрации тогда
	//			Зап2.ФизЛицо = Зап1.ФизЛицо     //первая запись позже
	//		ИначеЕсли Зап1.ДатаРегистрации<Зап2.ДатаРегистрации тогда
	//			Зап1.ФизЛицо = Зап2.ФизЛицо	 // вторая запись позже 
	//			
	//			//записи с одинаковой датой регистрации,
	//		иначеЕсли Не ЗначениеЗаполнено(Зап1.ДатаВыписки) и ЗначениеЗаполнено(Зап2.ДатаВыписки) тогда
	//			Зап2.ФизЛицо = Зап1.ФизЛицо;      //прописан в Зап1
	//		ИначеЕсли ЗначениеЗаполнено(Зап1.ДатаВыписки) и НЕ ЗначениеЗаполнено(Зап2.ДатаВыписки) тогда
	//			Зап1.ФизЛицо = Зап2.ФизЛицо;	   //прописан в Зап2
	//		ИначеЕсли Зап2.ДатаВыписки>Зап1.ДатаВыписки тогда	
	//		    Зап1.ФизЛицо = Зап2.ФизЛицо;     //выписан позже из Зап2
	//		ИначеЕсли Зап2.ДатаВыписки<Зап1.ДатаВыписки тогда	
	//		    Зап2.ФизЛицо = Зап1.ФизЛицо;	   //выписан позже из Зап1
	//		ИначеЕсли Зап2.ДатаВыписки = Зап1.ДатаВыписки тогда
	//			Зап1.ФизЛицо = Зап2.ФизЛицо	//все одинаково, пусть будет ЗАП2
	//		КонецЕсли;	
	//	КонецЦикла;	
	//	
	//КонецЦикла;	
	//
	////Сейчас во всех строках с одним СНИЛС одинаковая ссылка на человека	
	//мКэшПроживающих.Индексы.Добавить("СНИЛС");	
	//мКэшПроживающих.Индексы.Добавить("Фамилия,Имя,Отчество,ДатаРождения");		
КонецПроцедуры	

&НаСервере 
Функция ПолучитьСтрокуПроживающегоИзКэша(Фам,Имя,Отч,ДР,СНИЛС)
	//сначала ищем по СНИЛС
	Если Не ПустаяСтрока(СНИЛС) тогда
		СтрокаКэша = мКэшПроживающих.Найти(СНИЛС,"СНИЛС");
	КонецЕсли;	
	
	//Затем по ФИО и ДР
	Если СтрокаКэша = Неопределено тогда 
		Если ЗначениеЗаполнено(ДР) тогда
			Отбор = новый структура("Фамилия,Имя,Отчество,ДатаРождения",Фам,Имя,Отч,ДР);
		иначе
			Отбор = новый структура("Фамилия,Имя,Отчество",Фам,Имя,Отч);
		КонецЕсли;	
		СтрокиКэша =  мКэшПроживающих.НайтиСтроки(Отбор);
	    СтрокаКэша = ?(СтрокиКэша.Количество()>0, СтрокиКэша[0],Неопределено);
	КонецЕсли;	
	
	Если СтрокаКэша<>Неопределено тогда
	    Возврат СтрокаКэша	
    КонецЕсли;
	
	
	///***
	//Если не нашли - ищем в базе 
	//Запрос = новый запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТаблФИО.ФизЛицо КАК ФизЛицо
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		бит_ФИОПроживающих.ФизЛицо КАК ФизЛицо
	//	|	ИЗ
	//	|		РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
	//	|	ГДЕ
	//	|		бит_ФИОПроживающих.Фамилия ПОДОБНО &Фамилия
	//	|		И бит_ФИОПроживающих.Имя ПОДОБНО &Имя
	//	|		И бит_ФИОПроживающих.Отчество ПОДОБНО &Отчество) КАК ТаблФИО
	//	|ГДЕ
	//	|	(ТаблФИО.ФизЛицо.ДатаРождения = &ДатаРождения
	//	|			ИЛИ &ДатаРождения = ДАТАВРЕМЯ(1, 1, 1))";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() тогда
	//КонецЕсли;	
	
	
	
КонецФункции	


&НаСервере 
Функция ПолучитьПроживающегоИзКэша(Фам,Имя,Отч,ДР,СНИЛС)
	СтрокаКэша = ПолучитьСтрокуПроживающегоИзКэша(Фам,Имя,Отч,ДР,СНИЛС);
	Возврат ?(СтрокаКэша = Неопределено, Справочники.бит_Проживающие.ПустаяСсылка(), СтрокаКэша.ФизЛицо);	
КонецФункции	

&НаСервере
Функция УслугаЖКХ(знач Наименование)
	Наименование = СокрЛП(Наименование);
	Если Наименование = "Общедомовые нужды на СОИ - ЭЭ" тогда
		Наименование = "ОДН Эл"		
	ИначеЕсли Наименование = "Общедомовые нужды на СОИ - ХВС"  тогда
		Наименование = ?(СтрНайти(ЭтаФорма.ИмяФайлаКл,"odngv"),"ОДН ГВ","ОДН ХВ")
	ИначеЕсли  Наименование = "Общедомовые нужды на СОИ - ГВС" тогда
		Наименование = 	"ОДН ГВ";
	ИначеЕсли  Наименование = "Общедомовые нужды на СОИ - ВО"  тогда
		Наименование = 	"ОДН ВО";
	ИначеЕсли Наименование = "Капитальный ремонт за период РФКР" тогда
		Наименование = "Капитальный ремонт (РФКР)";
	ИначеЕсли Наименование = "Хол.водоснабжение и водоотведение" тогда
		Наименование = "Хол.водоснабжение и водоотведен"; 
	ИначеЕсли Наименование = "Пени за капитальный ремонт" тогда;	
		Наименование = "Минимальный взнос на кап.ремонт" 
	ИначеЕсли Наименование = "Пени СРЖ и ОДН" тогда;			
		Наименование = "Содержание и ремонт" 		
	ИначеЕсли Наименование = "Газоснабжение пени" тогда;			
		Наименование = "Газоснабжение" 		
		
	КонецЕсли;	
	
	//Если ПустаяСтрока(Наименование) тогда
	//	возврат Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано;
	//ИначеЕсли СтрокаРО = "Ответственный" тогда
	//	возврат Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;		
	//КонецЕсли;	
	
	если мКэшУслуг = неопределено тогда
		мКэшУслуг = новый Соответствие;		
	КонецЕсли;	
	
	Услуга = мКэшУслуг[Наименование];
	Если Услуга <> неопределено тогда
		возврат Услуга
	КонецЕсли;
	
	
	Услуга = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию(Наименование,истина);
	Если Не ЗначениеЗаполнено(Услуга) и не 
		ПустаяСтрока(Наименование) тогда  
		
		Сообщить("НЕ НАЙДЕНА УСЛУГА: "+Наименование);
		
		СпрОбъект = Справочники.бит_УслугиЖКХ.СоздатьЭлемент();
		СпрОбъект.Наименование = Наименование;
		СпрОбъект.Записать();
		Услуга = СпрОбъект.Ссылка
	КонецЕсли;	
	мКэшУслуг.Вставить(Наименование,Услуга);
	возврат Услуга;   	
	
КонецФункции	

&НаСервере
Функция РежимПотребления(знач Наименование,Тариф=1)
	Наименование = СокрЛП(Наименование);
	НаименованиеПоУмолчанию = "Не начислять";
	Если Тариф = 0 тогда
		Наименование = НаименованиеПоУмолчанию   
	ИначеЕсли 	Нрег(Наименование) = "нет" тогда
		Наименование = НаименованиеПоУмолчанию
	ИначеЕсли нрег(Наименование) = "нет услуги" тогда
		Наименование = НаименованиеПоУмолчанию;	
	ИначеЕсли ПустаяСтрока(Наименование) тогда
		Наименование = НаименованиеПоУмолчанию;	
	КонецЕсли;	
	
	//Если ПустаяСтрока(Наименование) тогда
	//	возврат Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано;
	//ИначеЕсли СтрокаРО = "Ответственный" тогда
	//	возврат Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;		
	//КонецЕсли;	
	
	
	
	если мКэшРежимов = неопределено тогда
		мКэшРежимов = новый Соответствие;		
	КонецЕсли;	
	
	Режим = мКэшРежимов[Наименование];
	Если Режим <> неопределено тогда
		возврат Режим
	КонецЕсли;
	
	Режим = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию(Наименование,истина);
	Если Не ЗначениеЗаполнено(Режим) тогда
		СпрОбъект = Справочники.бит_РежимыПотребленияУслуг.СоздатьЭлемент();
		СпрОбъект.Наименование = Наименование;
		СпрОбъект.Записать();
		Режим = СпрОбъект.Ссылка
	КонецЕсли;	
	мКэшРежимов.Вставить(Наименование,Режим);
	возврат Режим;   
	
КонецФункции	

&НаСервере
Функция ПоставщикУслуги(знач Услуга)
	Если ложь тогда услуга = Справочники.бит_УслугиЖКХ.ПустаяСсылка() КонецЕсли;
	//Наименование = СокрЛП(Наименование);
	//Если ПустаяСтрока(Наименование) тогда
	//	возврат Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано;
	//ИначеЕсли СтрокаРО = "Ответственный" тогда
	//	возврат Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;		
	//КонецЕсли;	
	
	если мПоставщикиУслуг = неопределено тогда
		мПоставщикиУслуг = новый Соответствие;		
	КонецЕсли;	
	
	Поставщик = мПоставщикиУслуг[Услуга];
	Если Поставщик <> неопределено тогда
		возврат Поставщик
	КонецЕсли;
	
	Поставщик = Услуга.Поставщики[0].Поставщик;	
	мПоставщикиУслуг.Вставить(Услуга,Поставщик);
	возврат Поставщик;   
	
КонецФункции	


&НаСервере
Процедура ЗаполнитьОбработанныеОстатки(Услуга)
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("Дата",КонецГода(Объект.Дата)+1);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК СуммаОстаток,
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет.Представление КАК ИмяЛС
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&Дата, УслугаЖКХ = &Услуга) КАК бит_НачисленияПоУслугамЖКХОстатки";
	мУжеОбработанныеОбъекты = Запрос.Выполнить().Выгрузить();	
	мУжеОбработанныеОбъекты.Индексы.Добавить("ЛицевойСчет");
	мУжеОбработанныеОбъекты.Индексы.Добавить("ИмяЛС");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьОбработанныеУслуги(Услуга)
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("Дата",КонецГода(Объект.Дата)+1);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать КАК Использовать,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Представление КАК ИмяЛС
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ИСТИНА";
	мУжеОбработанныеОбъекты = Запрос.Выполнить().Выгрузить();
	мУжеОбработанныеОбъекты.Индексы.Добавить("ЛицевойСчет");
	мУжеОбработанныеОбъекты.Индексы.Добавить("ИмяЛС");
КонецПроцедуры	


#КонецОбласти


Процедура УдалитьстрокиОбработанныхОстатков()
	Если ложь тогда мУжеОбработанныеОбъекты = новый ТаблицаЗначений КонецЕсли;
	ЧислоСтрок = МассивСтру.Количество();
	Для СчетВниз = 1 по ЧислоСтрок цикл
		Инд = ЧислоСтрок-СчетВниз;
		Стру = МассивСтру[Инд];
		ЛС = неопределено;
		ИмяЛС=неопределено;
		Удалять = ложь;
		Если Стру.Свойство("ЛС",ЛС) и ЗначениеЗаполнено(ЛС) тогда
			Если мУжеОбработанныеОбъекты.Найти(ЛС,"ЛицевойСчет")<>неопределено тогда
				МассивСтру.Удалить(Инд);
			КонецЕсли;	
		иначеЕсли Стру.Свойство("LS",ИмяЛС) и не пустаяСтрока(ИмяЛС) тогда
			ИмяЛС = СокрЛП(ИмяЛС);
			Если мУжеОбработанныеОбъекты.Найти(ЛС,"ИмяЛС")<>неопределено тогда
				МассивСтру.Удалить(Инд);
			КонецЕсли;	                                      			
		КонецЕсли;	                                            	
	КонецЦикла;	                                                
КонецПроцедуры	


#Область ПервичнаяОбработкаФайла

&НаКлиенте
Процедура ИмяФайлаКлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Диалог = новый диалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "*.dbf|*.dbf";
	Оповещение = Новый ОписаниеОповещения("ИмяФайлаОкончаниеВыбора",ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте 
Процедура ИмяФайлаОкончаниеВыбора(МассивИмен=неопределено,Параметры=неопределено) экспорт;
	Если  ТипЗнч(МассивИмен)= тип("Строка") и НЕ ПустаяСтрока(МассивИмен) тогда
		//все норм, ниего делать не надо, используем текущий файл 		
	ИначеЕсли 	типзнч(МассивИмен)<>Тип("Массив")или (МассивИмен.Количество()=0) тогда
		возврат
	иначе	
		ЭтаФорма.ИмяФайлаКл = МассивИмен[0];	
	КонецЕсли;
	

КонецПроцедуры	

&НаКлиенте
Процедура ПередатьФайлНаСервер()
	Файл = Новый ДвоичныеДанные(ИмяФайлаКл);
 	Адрес = ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
 	ОбработатьНаСервере(Адрес);
	ПоказатьОповещениеПользователя("Передал файл " + ЭтаФорма.ИмяФайлаКл);
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьНаСервере(ФайлВХранилище)
 
 ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлВХранилище);
 
 тПуть = ПутьКВременномуФайлу();
 ДвоичныеДанные.Записать(тПуть); 
 
 
КонецПроцедуры 

&НаСервере
Функция ПутьКВременномуФайлу()
	возврат КаталогВременныхФайлов() + "temp1234.dbf"; //для примера...
КонецФункции	

&НаСервереБезКонтекста
Функция ПутьКВременномуФайлуБезКонтекста()
	возврат КаталогВременныхФайлов() + "temp1234.dbf"; //для примера...
КонецФункции	


&НаСервере
Функция ЗагрузитьДБФВМассивСтруктур(тПуть=Неопределено,УдалятьПроживающихДрЛС=ложь);
	Если Тпуть = Неопределено тогда
		тПуть = ПутьКВременномуФайлу();
	КонецЕсли;	
	

	файлДБФ = новый xBase();
	попытка 		
		ФайлДБФ.ОткрытьФайл(тПуть);		
		КоллекцияПолей = файлДБФ.поля;	
		
		МассивИменПолей = новый массив;
		Для каждого Поле из КоллекцияПолей цикл
			МассивИменПолей.Добавить(Поле.Имя); 	
		КонецЦикла;;	
		
		
	исключение
		сообщить("не удалось открыть файл на сервере");
		возврат новый массив; 				
	конецпопытки;	
	
	Рез=Новый массив;
	Пока не файлДБФ.ВКонце() цикл
		
		//+++ 1bit 18.06.2019 07:53 Шашев Ю. - 
		// по обновленной схеме учета - ГРУЗИМ В ТОМ ЧИСЛЕ ДР. Л/С
		
		
		//Если УдалятьПроживающихДрЛС=истина тогда
		//	РО = ФайлДБФ.RODOTN;
		//	Если (СтрНайти(РО,"л.с")>0) или (СтрНайти(РО,"л/с")>0) тогда
		//		файлДБФ.Следующая();
		//		Продолжить;
		//	КонецЕсли;	                                    		
		//КонецЕсли;	
		                                                    	
		
		//--- 1bit 18.06.2019 Шашев Ю.
		
		
		
		Рез.Добавить(новый структура);
		НовЭлем = Рез[Рез.ВГраница()];
		Для каждого Имя из МассивИменПолей цикл
			НовЭлем.Вставить(Имя,ФайлДБФ[Имя]);
		КонецЦикла;	
		файлДБФ.Следующая();
	КонецЦикла;	
	ФайлДБФ.ЗакрытьФайл();
	УдалитьФайлы(тПуть);
	
	Сообщить("Прочитано элементов из Файла: " + Рез.Количество()+ "   : "+ЭтаФорма.ИмяФайлаКл);
	возврат Рез;
КонецФункции

#КонецОбласти

#Область Здания

&НаКлиенте
Процедура ЗагрузитьДома(Команда)
	// Вставить содержимое обработчика.
	ПередатьФайлНаСервер();
	ЗагрузитьДомаНаСервере()
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьДомаНаСервере()

	МассивСтру = ЗагрузитьДБФВМассивСтруктур();
	
	Для каждого Стру из МассивСтру цикл
		ЗагрузитьДомИзСтруктуры(Стру);
	КонецЦикла;	
		
КонецПроцедуры	

&НаСервере 
Процедура  ЗагрузитьДомИзСтруктуры(Стру);
	Если ТипЗнч(Стру)<>Тип("Структура") тогда
		возврат
	КонецЕсли;	
    КодДома = СокрЛП(Стру.KOD);
	Если ПустаяСтрока(КодДома) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан код дома");
	КонецЕсли;	
	
	ДомСсылка = Справочники.бит_СписокЗданий.НайтиПоКоду(СокрЛП(Стру.kod));
	Если ЗначениеЗаполнено(ДомСсылка) тогда
		ДомОбъект = ДомСсылка.ПолучитьОбъект()
	иначе
		ДомОбъект = Справочники.бит_СписокЗданий.СоздатьЭлемент();
		ДомОбъект.Код = Стру.KOD;
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(ДомОбъект.Организация) тогда
		ДомОбъект.Организация = Объект.Организация
	КонецЕсли;	

	
	
	//Адрес
	ИмяУлицы = сокрЛП(Стру.YL);
		
	Адр = сокрЛП(Стру.ADR);	
	ПозРазделеителя = СтрНайти(Адр,",");
	ИмяУлицы2 = лев(Адр,ПозРазделеителя-1);
	Если ПустаяСтрока(ИмяУлицы) тогда
		ИмяУлицы = ИмяУлицы2
	КонецЕсли;	
	
	
	ИмяДома = сокрЛП(сред(Адр,ПозРазделеителя+1));
	ДомОбъект.Наименование = ИмяДома;
	
	//Улица
	ДомОбъект.Улица = Справочники.бит_СписокУлиц.НайтиПоНаименованию(ИмяУлицы,истина);
	Если Не ЗначениеЗаполнено(ДомОбъект.Улица) тогда
		УлицаОбъект = Справочники.бит_СписокУлиц.СоздатьЭлемент();
		УлицаОбъект.Наименование = ИмяУлицы;
		УлицаОбъект.СтароеНаименование = ИмяУлицы2;
		УлицаОбъект.Записать();
		ДомОбъект.Улица = УлицаОбъект.Ссылка;
	КонецЕсли;	
		
	
	

	//выделяем номер корпуса, номер дома и префикс     	
	ПозКорпус  = СтрНайти(ИмяДома,"КОРП.");
	Если позКорпус >0 тогда
		ИмяКорпуса=сокрЛП(сред(ИмяДома,ПозКорпус+5));
		//ИмяДома = лев(ИмяДома,ПозКорпус-1);    //имя корпуса остается в суффиксе.
	иначе
		ИмяКорпуса = "";
	КонецЕсли;	
	ДомОбъект.Корпус = ИмяКорпуса;
	
	
	ДлинаНомера=0;
	Для поз = 1 по СтрДлина(ИмяДома) цикл
		Симв = сред(ИмяДома,поз,1);
		Если СтрНайти("0123456789",Симв)=0 тогда
			прервать
		иначе		
			ДлинаНомера = поз;
		КонецЕсли;	
	КонецЦикла;	
		                   
	
	Если ДлинаНомера = 0 тогда
		ДомОбъект.НомерДома = 0;
	ИначеЕсли ДлинаНомера = СтрДлина(ИмяДома) тогда
		ДомОбъект.НомерДома = Число(ИмяДома);
		ДомОбъект.ПрефиксДома = ""; 
	Иначе //есть и номер, и суффикс
		ДомОбъект.НомерДома = Число(лев(ИмяДома,ДлинаНомера));
		ДомОбъект.ПрефиксДома = сокрЛП(сред(ИмяДома,ДлинаНомера+1));		
	КонецЕсли;	
	
	//район и участок
	ИмяРайона = Стру.YCH;
	КодУчастка = Стру.POD_YCH;
	
	ДомОбъект.Район = Справочники.бит_АдминистративныеОкруга.НайтиПоНаименованию(ИмяРайона);
	Если Не ЗначениеЗаполнено(ДомОбъект.Район) тогда
		ОбъектРайон = Справочники.бит_АдминистративныеОкруга.СоздатьЭлемент();
		ОбъектРайон.Наименование = ИмяРайона;
		ОбъектРайон.Записать();
		ДомОбъект.Район = ОбъектРайон.Ссылка;
	КонецЕсли;	
	
	ДомОбъект.Участок = Справочники.бит_ТехническиеУчастки.НайтиПоКоду(КодУчастка);
	Если не ЗначениеЗаполнено(ДомОбъект.Участок) тогда
		ОбъектУчасток = Справочники.бит_ТехническиеУчастки.СоздатьЭлемент();
		ОбъектУчасток.Код = КодУчастка;
		ОбъектУчасток.Наименование = КодУчастка;
		ОбъектУчасток.Владелец = ДомОбъект.Район;
		ОбъектУчасток.Записать();
		ДомОбъект.Участок = ОбъектУчасток.Ссылка;
	КонецЕсли;	
	
	//СтепеньБлагоустройства (Основная)
	ИмяСтепени = Стру.R_POTR;
	Если не ПустаяСтрока(ИмяСтепени) тогда
		Степень = Справочники.бит_ВидыБлагоустройстваЗданий.НайтиПоНаименованию(ИмяСтепени,истина);
		Если Не ЗначениеЗаполнено(Степень) тогда
			СтепеньОбъект = Справочники.бит_ВидыБлагоустройстваЗданий.СоздатьЭлемент();
			СтепеньОбъект.Наименование = ИмяСтепени;
			СтепеньОбъект.Записать();
			Степень = СтепеньОбъект.Ссылка;
		КонецЕсли;
		ДомОбъект.ВидБлагоустройстваЗданий = Степень;
	КонецЕсли;
	
	
	//Капремонт
	НомерСчетаКапремонта = сокрЛП(стру.kr_rs);
	Если Не ПустаяСтрока(НомерСчетаКапремонта) тогда   		
		СчетКапремонта = Справочники.БанковскиеСчета.НайтиПоНаименованию(НомерСчетаКапремонта);
		Если не ЗначениеЗаполнено(СчетКапремонта) тогда
			Сообщить("Не найдено соответствие счету капремонта для дома"+ДомОбъект.Ссылка);
		КонецЕсли;
	иначе 
		СчетКапремонта = Справочники.БанковскиеСчета.ПустаяСсылка()		
	КонецЕсли;	
	ДомОбъект.БанковскийСчетКапРемонт = СчетКапремонта;		


	ДомОбъект.ПрефиксЗдания = сокрЛП(Стру.PREF); //префикс для ЛС
	ДомОбъект.КадастровыйНомер = сокрЛП(стру.KAD_N);
	ДомОбъект.КодФИАС = сокрЛП(стру.FIAS);
	
	
	СостояниеДомаСтр  = сокрЛП(стру.SOST);
	Если СостояниеДомаСтр = "Исправный" тогда
		ДомОбъект.Состояние = Перечисления.бит_СостоянияЗданий.Исправный
	ИначеЕсли СостояниеДомаСтр = "Ветхий" тогда	
		ДомОбъект.Состояние = Перечисления.бит_СостоянияЗданий.Ветхий
	ИначеЕсли СостояниеДомаСтр = "Аварийный" тогда	
		ДомОбъект.Состояние = Перечисления.бит_СостоянияЗданий.Аварийный
	иначе
		ДомОбъект.Состояние = Перечисления.бит_СостоянияЗданий.ПустаяСсылка()
	КонецЕсли;
	
	ДомОбъект.КолВоЭтажейНаименьшее = стру.ET_MIN;
	ДомОбъект.ИмеетТСЖ = стру.TSJ;
	
	
								
	//Газоснабжение
	Газ = сокрЛП(стру.GAZ);
	Если ПустаяСтрока(Газ) тогда		
		ЕстьОмскГорГаз = ложь;
		ЕстьРегионГаз = ложь;
		ДомОбъект.ПоставщикГазоснабжения =  Справочники.бит_ПоставщикиУслуг.ПустаяСсылка()
	ИначеЕсли Газ = "Гор" тогда
		ЕстьОмскГорГаз = Истина;
		ЕстьРегионГаз = ложь;
		ДомОбъект.ПоставщикГазоснабжения = Объект.ОмскГорГаз;
	Иначе
		ЕстьОмскГорГаз = ложь;		
		ЕстьРегионГаз = истина;
		ДомОбъект.ПоставщикГазоснабжения = Объект.РегионГаз;
	КонецЕсли;	

	ПоставщикТеплоснабжения = СокрЛП(Стру.TIST);
	Если ПоставщикТеплоснабжения = "МП ТК" тогда
		ДомОбъект.ПоставщикТеплоснабжения = Объект.ТеплоМПТК;
	ИначеЕсли ПоставщикТеплоснабжения = "ОмскРТС" тогда
		ДомОбъект.ПоставщикТеплоснабжения = Объект.ТеплоОмскРТС		
	ИначеЕсли ПустаяСтрока(ПоставщикТеплоснабжения) или 
				нрег(СокрЛП(ПоставщикТеплоснабжения))= "нет" тогда		
		ДомОбъект.ПоставщикТеплоснабжения = Справочники.бит_ПоставщикиУслуг.ПустаяСсылка();		
	Иначе			
		ДомОбъект.ПоставщикТеплоснабжения = Справочники.бит_ПоставщикиУслуг.
									НайтиПоНаименованию(ПоставщикТеплоснабжения,истина);
		Если не ЗначениеЗаполнено(ДомОбъект.ПоставщикТеплоснабжения) тогда
			Сообщить("Для дома "+ДомОбъект.Ссылка + " не найден теплоисточник: " + ПоставщикТеплоснабжения);
		КонецЕсли;	
	КонецЕсли;			
	              
	
	ДомОбъект.ГодПостройки = стру.GOD_POST;
	ГодВвода = стру.GOD_VVOD;
	Если ГодВвода = 0 тогда
		ГодВвода =1
	КонецЕсли;;	
	ДомОбъект.ДатаВводаВЭксплуатацию = Дата(ГодВвода,1,1) ;
	
	ДомОбъект.СформироватьНаименование();
	//Сообщить("----Здание "+ДомОбъект.Код + "   Адрес: "+СокрЛП(Стру.ADR)+" Наименование:   "+ДомОбъект.Наименование);
	
	Попытка
	//	ДомОбъект.Наименование = "" + ДомОбъект.НомерДома + ДомОбъект.ПрефиксДома + 
	//											?(ПустаяСтрока(ДомОбъект.Корпус),""," КОРП."+ДомОбъект.Корпус);
		ДомОбъект.Записать();
	Исключение
	КонецПопытки;
	
	ЧислоПодъездов = стру.K_POD;
	ДобавитьПостоянныйРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.КоличествоПодъездов,
							ДомОбъект.Ссылка, ЧислоПодъездов);	
							
	ЧислоЭтажей  = стру.ET_MAX;
	ДобавитьПостоянныйРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.КоличествоЭтажей,
							ДомОбъект.Ссылка, ЧислоЭтажей);	
	
	
	
	ДобавитьПериодическиеРеквизитыЗдания(Стру,ДомОбъект.Ссылка);
	
	
	ЗаписьПредставления = РегистрыСведений.лб_ПредставлниеЗданий.СоздатьМенеджерЗаписи();
	ЗаписьПредставления.Здание = ДомОбъект.Ссылка;
	ЗаписьПредставления.Представление = сокрЛП(стру.ADR);
	ЗаписьПредставления.Улица =  ИмяУлицы2;
	ЗаписьПредставления.Дом = ДомОбъект.Наименование;
	ЗаписьПредставления.НаправлениеОбмена = Объект.НаправлениеОбмена;
	ЗаписьПредставления.Записать(истина);
	
КонецПроцедуры


Процедура ДобавитьПериодическиеРеквизитыЗдания(Стру,Здание)
	Если ложь тогда Стру = новый структура; Здание = Справочники.бит_СписокЗданий.Выбрать().Ссылка КонецЕсли; ;
	//Режим потребления по коду
	Если Стру.Свойство("TAR") тогда
		РежимПотребл = РежимПотребления(Здание.Код,Стру.TAR);	
	иначе
		РежимПотребл = РежимПотребления(Здание.Код,1);	
	КонецЕсли;	
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ОсновнойРежимПотребления,
							Здание, РежимПотребл);	
	
	//Степени благоустройства ХГВС и ЭЭ
	СтепеньХГВС = "ХГВС "+сокрЛП(Стру.ST_BL_XG) + "." ;
	СтепеньЭЭ   = "ЭЭ " + сокрЛП(Стру.ST_BL_EL) + ".";
	СтепеньБлагоустройстваХГВС = Справочники.бит_ВидыБлагоустройстваЗданий.НайтиПоНаименованию(СтепеньХГВС);
	Если Не ЗначениеЗаполнено(СтепеньБлагоустройстваХГВС) тогда
		ОбъектСтепеньБлагоустройстваХГВС = Справочники.бит_ВидыБлагоустройстваЗданий.СоздатьЭлемент();
		ОбъектСтепеньБлагоустройстваХГВС.Наименование = СтепеньХГВС;
		ОбъектСтепеньБлагоустройстваХГВС.Записать();
		СтепеньБлагоустройстваХГВС = ОбъектСтепеньБлагоустройстваХГВС.Ссылка;
	КонецЕсли;
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.СтепеньБлагоустройстваХГВС,
							Здание, СтепеньБлагоустройстваХГВС);	
	
	
	СтепеньБлагоустройстваЭЭ = Справочники.бит_ВидыБлагоустройстваЗданий.НайтиПоНаименованию(СтепеньЭЭ);
	Если Не ЗначениеЗаполнено(СтепеньБлагоустройстваЭЭ) тогда
		ОбъектСтепеньБлагоустройстваЭЭ = Справочники.бит_ВидыБлагоустройстваЗданий.СоздатьЭлемент();
		ОбъектСтепеньБлагоустройстваЭЭ.Наименование = СтепеньЭЭ;
		ОбъектСтепеньБлагоустройстваЭЭ.Записать();
		СтепеньБлагоустройстваЭЭ = ОбъектСтепеньБлагоустройстваЭЭ.Ссылка;
	КонецЕсли;
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.СтепеньБлагоустройстваЭЭ,
							Здание, СтепеньБлагоустройстваЭЭ);	
		
	//Настройки печати квитанции
	СпособХВ = СпособРасчетаСОИ(Стру.R_XV); 
	СпособГВ = СпособРасчетаСОИ(Стру.R_GV);
	СпособВО = СпособРасчетаСОИ(Стру.R_VO);
	СпособЭЭ = СпособРасчетаСОИ(Стру.R_EL);
	ПоНорме = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу;
	ПоФакту = Перечисления.лб_СпособРасчетаСОИ.ПоФакту;
	ПоСреднему = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему;
	
	Если СпособХВ = ПоНорме и СпособГВ = ПоНорме и СпособВО = ПоНорме и СпособЭЭ = ПоНорме тогда
		Настройка = Справочники.лб_НастройкиПечатиКвитанций.НайтиПоКоду("000000003");   //по норме
	ИначеЕсли СпособХВ = ПоФакту и СпособГВ = ПоФакту и СпособВО = ПоФакту и СпособЭЭ = ПоФакту тогда
		Настройка = Справочники.лб_НастройкиПечатиКвитанций.НайтиПоКоду("000000002");	//по факту
	ИначеЕсли СпособХВ = ПоСреднему и СпособГВ = ПоСреднему и СпособВО = ПоСреднему и СпособЭЭ = ПоСреднему тогда
		Настройка = Справочники.лб_НастройкиПечатиКвитанций.НайтиПоКоду("000000001"); //по среднему	
	ИначеЕсли Не ЗначениеЗаполнено(СпособХВ) и не ЗначениеЗаполнено(СпособГВ) 
				и не ЗначениеЗаполнено(СпособВО) и не ЗначениеЗаполнено(СпособЭЭ) тогда
		Настройка = Справочники.лб_НастройкиПечатиКвитанций.ПустаяСсылка();
	иначе
		Сообщить("Для Здания " + Здание +  " не подобрана настройка вывода квитанции. " +
				"ХВ="+СпособХВ + " ГВ="+СпособГВ + "ВО="+СпособВО + " ЭЭ="+СпособЭЭ);
		Настройка =  Справочники.лб_НастройкиПечатиКвитанций.ПустаяСсылка();
	КонецЕсли;	
	
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_НастройиПечатиКвитанции,
							Здание, Настройка);	

	//Площади здания
	ПлощадьОбщая = стру.PL_ALL;
	ПлощадьЖилыхНежилых = стру.pl_ob;
	ЖилаяПлощадь = стру.pl_kom;
	ПлощадьНежилых = ПлощадьЖилыхНежилых - ЖилаяПлощадь;
	
	ПлощадьПодвалов = стру.pl_pod;
	ПлощадьЧердаков = стру.pl_cherd;
	ПлощадьБалконов = стру.pl_balk;
	ПлощадьМОП = стру.pl_mop;
	ПлощадьЗемельногоУчастка = стру.pl_grunt;

	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания,
							Здание,ПлощадьОбщая);
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений,
							Здание,ЖилаяПлощадь);
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьНежилыхПомещений,
							Здание,ПлощадьНежилых);
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ОбщаяПлощадьЖилыхИНежилыхПомещений,
							Здание,ПлощадьЖилыхНежилых);
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ОбщаяПлощадьПодвалов,
							Здание,ПлощадьПодвалов);							
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ОбщаяПлощадьЧердаков,
							Здание,ПлощадьЧердаков);
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ОбщаяПлощадьБалконов,
							Здание,ПлощадьБалконов);						
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьМестОбщегоПользования,
							Здание,ПлощадьМОП);							
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьПридомовойТерритории,
							Здание,ПлощадьЗемельногоУчастка);						
							
						
	//Газоснабжение
	Газ = сокрЛП(стру.GAZ);
	Если ПустаяСтрока(Газ) тогда		
		ЕстьОмскГорГаз = ложь;
		ЕстьРегионГаз = ложь;
//		ДомОбъект.ПоставщикГазоснабжения =  Справочники.бит_ПоставщикиУслуг.ПустаяСсылка()
	ИначеЕсли Газ = "Гор" тогда
		ЕстьОмскГорГаз = Истина;
		ЕстьРегионГаз = ложь;
//		ДомОбъект.ПоставщикГазоснабжения = Объект.ОмскГорГаз;
	Иначе
		ЕстьОмскГорГаз = ложь;		
		ЕстьРегионГаз = истина;
//		ДомОбъект.ПоставщикГазоснабжения = Объект.ОмскРегионГаз;
	КонецЕсли;	
						
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ПоставщикГазаОмскГорГаз,
	   	 					Здание,ЕстьОмскГорГаз);	
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ПоставщикГазаРегионГаз,
	   	 					Здание,ЕстьРегионГаз);	
						
	ПочтовыйИндекс = сокрЛП(стру.POST_IND);						
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ПочтовыйИндекс,
	   	 					Здание,ПочтовыйИндекс);	
							
							
							
	ДоговорВид = СокрЛП(стру.DOG_VID);
	Если НЕ ПустаяСтрока (ДоговорВид) тогда 
		ВидДог = Справочники.бит_ВидыДоговоровУправления.НайтиПоНаименованию(ДоговорВид,Истина);
		Если не ЗначениеЗаполнено(ВидДог) тогда
			СпрОбъект = Справочники.бит_ВидыДоговоровУправления.СоздатьЭлемент();
			СпрОбъект.Наименование = ДоговорВид;
			СпрОбъект.Записать();
			ВидДог = СпрОбъект.Ссылка;
		КонецЕсли;	
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ДоговорУправленияВид,
	   	 					Здание,ВидДог);	
	КонецЕсли;	
	
	ДоговорНомер = СокрЛП(стру.DOG_N);
	ДоговрДата   = СокрЛП(стру.DOG_NACH);
	ДоговорСрокПролонгации = СокрЛП(стру.DOG_SROK);
	
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ДоговорУправленияНомер,
	   	 					Здание,ДоговорНомер);	
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ДоговорУправленияДатаНачУпр,
	   	 					Здание,ДоговрДата);	
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ДоговорУправленияСрокПролонгации,
	   	 					Здание,ДоговорСрокПролонгации);	
						
							
							
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ДоговорУправленияСрокПролонгации,
	   	 					Здание,ДоговорСрокПролонгации);	
							
							
	НачальноеСальдоТекРемонта = стру.NACH_S;
	ДобавитьРеквизитЗдания(ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_НачальныйОстатокСредствТекРемонта,
	   	 					Здание,НачальноеСальдоТекРемонта);	
	
	
							
							
							
КонецПроцедуры	


Функция СпособРасчетаСОИ(знач Стр)
	Стр = СокрЛП(Стр);
	Если ПустаяСтрока(Стр) или ТипЗнч(Стр)<>Тип("Строка") тогда
		СпособРасчета = Перечисления.лб_СпособРасчетаСОИ.ПустаяСсылка();
	ИначеЕсли Стр =  "По нормативу" тогда
		СпособРасчета = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу;
	ИначеЕсли Стр =  "По факту" тогда
		СпособРасчета = Перечисления.лб_СпособРасчетаСОИ.ПоФакту;	
	иначе
		СпособРасчета = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему;
	КонецЕсли;
	возврат СпособРасчета;
	
КонецФункции	


&НаСервере
Процедура ДобавитьРеквизитЗдания(Реквизит,Здание,Значение)
	Если не ЗначениеЗаполнено(Реквизит) или не ЗначениеЗаполнено(Здание) тогда
		возврат
	КонецЕсли;	
	Период =  '2018-10-01';
	Запись = РегистрыСведений.бит_ЗначенияСвойствОбъектовУчетаПериодические.СоздатьМенеджерЗаписи();
	Запись.ОбъектУчета = Здание;
	Запись.ВидСвойства = Реквизит;
	Запись.Значение = Значение;
	Запись.Период = Период;
	Запись.Записать(истина);	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьПостоянныйРеквизитЗдания(Реквизит,Здание,Значение)
	Если не ЗначениеЗаполнено(Реквизит) или не ЗначениеЗаполнено(Здание) тогда
		возврат
	КонецЕсли;	
	Запись = РегистрыСведений.бит_ЗначениеСвойствОбъектовУчета.СоздатьМенеджерЗаписи();
	Запись.ОбъектУчета = Здание;
	Запись.ВидСвойства = Реквизит;
	Запись.Значение = Значение;
	Запись.Записать(истина);		
		
КонецПроцедуры	




&НаКлиенте
Процедура ЗагрузитьУчастки(Команда)
	ЗагрузитьУчасткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУчасткиНаСервере()
	// Вставить содержимое обработчика.
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();
	
	Для каждого Стру из МассивСтру цикл
		ЗагрузитьУчастокИзСтруктуры(Стру);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУчастокИзСтруктуры(Стру)
КонецПроцедуры	

#КонецОбласти

#Область Подъезды_Квартиры_ЛицевыеСчета

&НаКлиенте
Процедура ЗагрузитьКвартиры(Команда)
	// Вставить содержимое обработчика.
	ПередатьФайлНаСервер();
	ЗагрузитьКвартирыНаСервере()

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКвартирыНаСервере()
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();
	ЗаполнитьКэшЗданий();
	ЗаполнитьКэшКвартирЛицевыхСчетов();	
	СоздатьТаблицуДляРазделенныхКвартир();
	
	ЧислоКвартир = МассивСтру.ВГраница();	
	Для Инд = ЭтаФорма.СтартЗапись по ЧислоКвартир  цикл
 		Стру = МассивСтру[Инд];
		ЗагрузитьКвартируИзСтруктуры(Стру);
	КонецЦикла;	    	
КонецПроцедуры	


&НаСервере
Процедура ЗагрузитьКвартируИзСтруктуры(Стру)
		  
	ИмяЛС = сокрЛП(Стру.LS);
	Если СтрДлина(ИмяЛС)=10 или СтрДлина(ИмяЛС)=11 тогда
		ИмяЛС = лев(ИмяЛС,10)+ лб_Сервер.КонтрольныйРазряд(ИмяЛС);
	иначе
		сообщить("Неверный формат ЛС: "+ИмяЛС)
	КонецЕсли;	
	ИмяКвартиры = сокрЛП(Стру.KVARTIRA);  
	
	Если СтрДлина(ИмяЛС)<>11 тогда
		возврат
	КонецЕсли;	
	
	ИмяДома = сокрЛП(Стру.DOM);
	Если лев(ИмяЛС,3)="714" тогда
		ИмяДома = ИмяДома+".";
	КонецЕсли;	

	
	ЧислоРазделенныхЛС = стру.K_LS;
	Если ЧислоРазделенныхЛС>1 тогда
		ИмяКвартиры = ИмяКвартиры+ДополнениеИмениРазделеннойКвартиры(ИмяДома+","+ИмяКвартиры);
	КонецЕсли;	
	
	
	
	Если Стру.Свойство("POD") тогда
		НомерПодъезда = Стру.POD;		
	иначе                        		
		НомерПодъезда =1;		
	КонецЕсли;	
	
	ИмяПодъезда    = сокрЛП(НомерПодъезда);
	
	Этаж = ?(Стру.Свойство("ET"),Стру.ET,0);
	КоличествоКомнат = ?(Стру.Свойство("K_KOM"),стру.K_KOM,0);
	КадастровыйНомер = ?(Стру.Свойство("KAD_N"),стру.KAD_N,"");
	
	КвартираУникГИСЖКХ = "";
	КодПоБТИ = "";
	
	
	Если Стру.Свойство("ELS") тогда
		ЕЛСГИСЖКХ 				= СокрЛП(Стру.ELS);
		ИдентификаторЖКУ 		= СокрЛП(Стру.KOD_JKY);
	иначе
		ЕЛСГИСЖКХ = "";
		ИдентификаторЖКУ ="";
	КонецЕсли;	
		
	//КапРемЕЛСГИСЖКХ	 		= "";
	//КапРемИдентификаторЖКУ	= "";
	//КапРемПрефикс			= "";
	
	
	
	ОбъектКвартира  = неопределено;
	ОбъектЛС        = неопределено;
	ОбъектПодъезд   = неопределено;

	;
	
	
	ДанныеЛС = ДанныеЛС(ИмяЛС);	
	
	Если ДанныеЛС = неопределено тогда	
		Если ЭтаФорма.ИмяФайлаКл = "C:\1bit_Exchange\Бородина 41\ls_jil.dbf" тогда
			Здание = Справочники.бит_СписокЗданий.НайтиПоКоду("БОР41",истина);
		ИначеЕсли ИмяДома = "УЛ.ЭНЕРГЕТИКОВ,66 А" тогда
			Здание = Справочники.бит_СписокЗданий.НайтиПоКоду("Э66А",истина);      			
		ИначеЕсли ИмяДома = "УЛ.БЛЮХЕРА,22 КОРП.1"	и СтрНайти(ЭтаФорма.ИмяФайлаКл,"\ЛБ\")>0  тогда
			Здание = Справочники.бит_СписокЗданий.НайтиПоКоду("БЛ221",истина);      			
		иначе	
			Здание = ЗданиеИзКэша(ИмяДома);
		КонецЕсли;	
		Если не ЗначениеЗаполнено(Здание) тогда
			Сообщить(" Не найдено здание " + ИмяДома);
			возврат;
		КонецЕсли;	
		
		Подъезд = Справочники.бит_Подъезды.НайтиПоНаименованию(ИмяПодъезда,истина,,Здание);
		Если Не ЗначениеЗаполнено(Подъезд) тогда
			ПодъездОбъект = Справочники.бит_Подъезды.СоздатьЭлемент();
			ПодъездОбъект.Владелец = Здание; 			
			ПодъездОбъект.КоличествоЭтажей = Этаж;			
			ПодъездОбъект.Наименование = ИмяПодъезда;
			ПодъездОбъект.Записать();
			Подъезд = ПодъездОбъект.Ссылка;
		ИначеЕсли ПустаяСтрока(""+Подъезд) тогда
			ПодъездОбъект = Подъезд.ПолучитьОбъект();
			ПодъездОбъект.Наименование = ИмяПодъезда;
			ПодъездОбъект.Записать();
		КонецЕсли;	
		
		
		ИмяКвартиры = СокрЛП(ИмяКвартиры);
		СтруктураНомера = СтруктураНомераКвартиры(ИмяКвартиры);
		НаимКвартиры = ""+СтруктураНомера.НомерКвартиры + СтруктураНомера.ПрефиксКвартиры;
		Квартира = Справочники.бит_Квартиры.НайтиПоНаименованию(НаимКвартиры,Истина,,Здание);
		Если Не ЗначениеЗаполнено(Квартира) тогда
			ОбъектКвартира = Справочники.бит_Квартиры.СоздатьЭлемент();
			ОбъектКвартира.Наименование = НаимКвартиры;
			ОбъектКвартира.Владелец = Здание;
			ОбъектКвартира.Подъезд = Подъезд;
			ОбъектКвартира.Этаж  = Этаж;						
			ЗаполнитьЗначенияСвойств(ОбъектКвартира,СтруктураНомера);
			ОбъектКвартира.Записать();
			Квартира = ОбъектКвартира.Ссылка;
		КонецЕсли;	
	
		
		ЛС = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(ИмяЛС);
		Если Не ЗначениеЗаполнено(ЛС) тогда
			ОбъектЛС = Справочники.бит_ЛицевыеСчета.СоздатьЭлемент();
			ОбъектЛС.Наименование = ИмяЛС;
			ОбъектЛС.Здание = Здание;
			ОбъектЛС.Квартира = Квартира;
			ОбъектЛС.Организация = ЛС.Организация;
			ОбъектЛС.УлицаЛицевогоСчета = Здание.Улица;
			ОбъектЛС.Записать();			
			ЛС = ОбъектЛС.Ссылка;
		КонецЕсли;	
		
		
		ДанныеЛС = мКэшКвартирЛС.Добавить();
		ДанныеЛС.ЛС = ЛС;
		ДанныеЛС.ИмяЛС = ИмяЛС;
		ДанныеЛС.Здание = Здание;
		ДанныеЛС.Квартира = Квартира;
		ДанныеЛС.Подъезд = Подъезд;	
		ДанныеЛС.Улица = ЛС.УлицаЛицевогоСчета;	
		
	КонецЕсли;
	
	
	Если ОбъектПодъезд = Неопределено тогда
		ОбъектПодъезд = ДанныеЛС.Подъезд.ПолучитьОбъект();		
	КонецЕсли;
	Если ложь тогда ОбъектПодъезд = Справочники.бит_Подъезды.СоздатьЭлемент() КонецЕсли;
	ЗаменитьЕслиНовое(ОбъектПодъезд.Наименование,ИмяПодъезда);
	Если ОбъектПодъезд.КоличествоЭтажей < Этаж тогда
		ОбъектПодъезд.КоличествоЭтажей = Этаж
	КонецЕсли;	
	
	Если ТипЗнч(ОбъектПодъезд) = тип("СправочникОбъект.бит_Квартиры") и ОбъектПодъезд.Модифицированность() тогда
		ОбъектПодъезд.Записать();
	КонецЕсли;	
	
	
	
	// проверка и коррекция данных квартиры
	ЭтоНоваяКвартира = ложь;
	Если ОбъектКвартира = неопределено тогда
		ОбъектКвартира = ДанныеЛС.Квартира.ПолучитьОбъект();
		ЭтоНоваяКвартира = истина;
	КонецЕсли;	
	
	Если ложь тогда ОбъектКвартира = Справочники.бит_Квартиры.СоздатьЭлемент() КонецЕсли;
	
	Если ЭтоНоваяКвартира или не Объект.ТолькоНовыеОбъекты  тогда
		ЗаменитьЕслиНовое(ОбъектКвартира.Наименование,ИмяКвартиры);
		СтруктураНомера = СтруктураНомераКвартиры(ИмяКвартиры);
		ЗаменитьЕслиНовое(ОбъектКвартира.НомерКвартиры,СтруктураНомера.НомерКвартиры);
		ЗаменитьЕслиНовое(ОбъектКвартира.ПрефиксКвартиры,СтруктураНомера.ПрефиксКвартиры);
		ЗаменитьЕслиНовое(ОбъектКвартира.КоличествоКомнат,КоличествоКомнат);
		ЗаменитьЕслиНовое(ОбъектКвартира.КадастровыйНомер,КадастровыйНомер);
		ЗаменитьЕслиНовое(ОбъектКвартира.Подъезд,ДанныеЛС.Подъезд);
		ЗаменитьЕслиНовое(ОбъектКвартира.Владелец,ДанныеЛС.Здание);
		ЗаменитьЕслиНовое(ОбъектКвартира.НомерПодъезда,НомерПодъезда); 
	КонецЕсли;
	Если ТипЗнч(ОбъектКвартира)=тип("СправочникОбъект.бит_Квартиры") и  ОбъектКвартира.Модифицированность()=Истина тогда
		ОбъектКвартира.Записать();
	КонецЕсли;
	
	//Проверка и коррекция данных ЛС
	Если ОбъектЛС= неопределено тогда
		ОбъектЛС = ДанныеЛС.ЛС.ПолучитьОбъект();
	КонецЕсли;	
	Если ложь тогда ОбъектЛС = Справочники.бит_ЛицевыеСчета.СоздатьЭлемент() КонецЕсли;
	
	
	ЗаменитьЕслиНовое(ОбъектЛС.ЕЛСГИСЖКХ,ЕЛСГИСЖКХ);
	ЗаменитьЕслиНовое(ОбъектЛС.Здание,ДанныеЛС.Здание);
	ЗаменитьЕслиНовое(ОбъектЛС.ИдентификаторЖКУ,ИдентификаторЖКУ);
	ЗаменитьЕслиНовое(ОбъектЛС.Квартира,ДанныеЛС.Квартира);
	ЗаменитьЕслиНовое(ОбъектЛС.Организация,Объект.Организация);
	ЗаменитьЕслиНовое(ОбъектЛС.ТипЛицевогоСчетаГИСЖКХ,Перечисления.бит_ТипЛицевогоСчетаГИСЖКХ.ЛСУО);
	ЗаменитьЕслиНовое(ОбъектЛС.УлицаЛицевогоСчета,ДанныеЛС.Улица);
	
	
	Если ТипЗнч(ОбъектЛС)=тип("СправочникОбъект.бит_ЛицевыеСчета") и  ОбъектЛС.Модифицированность()=Истина тогда
		ОбъектЛС.Записать();
	КонецЕсли;
	
	
	//дапись данных квартиры в регистры
	
	ЗагрузитьПериодическиеРеквизитыКвартирыЛС(Стру,ДанныеЛС.Квартира,ДанныеЛС.ЛС);	
	
	
	
	
	
		

	
	                                                                  
	
КонецПроцедуры	                                           


&НаСервере
Процедура ЗагрузитьПериодическиеРеквизитыКвартирыЛС(Стру, Квартира, ЛС)
	Если Не ЗначениеЗаполнено(Квартира) 
		 		или не ЗначениеЗаполнено(ЛС) 
		 		или (ТипЗнч(Стру)<>Тип("Структура") и (ТипЗнч(Стру)<>Тип("СтрокаТаблицыЗначений"))) 
	тогда				
		возврат  		
	КонецЕсли;	
	                                     
	
	
	КодТипаКвартиры				= Стру.TIP;
	КодСтатусаКвартиры          = Стру.STATYS;
	ОбщаяПлощадь				= Стру.PL_OB;					  
	ЖилаяПлощадь				= Стру.PL_JIL;					  
//	МОП								  
//	ОтапливаемаяПлощадь									  
//	СовокупнаяПлощадь									  
//	ТипКвартиры									  
//	СтатусКвартиры									  
//	ТипПлиты									  
//	ТипЗапирающегоУстройства									  
//	ЖилоеПомещениеСпециализированногоЖилищногоФонда									  
//	ПлощадьОДНСОИЭлектроснаб									  
//	ПлощадьОДНСОИВодоснаб									  
	ВысотаПотолков				= ?(Стру.Свойство("V_POT"),Стру.V_POT,0);					  
	лб_ПредставлениеКвартиры	= ?(Стру.Свойство("KVARTIRA"),сокрЛП(Стру.KVARTIRA),"");
	лб_ИгнорироватьНачисления	= ?(Стру.Свойство("NE_V_NACH"),(Стру.NE_V_NACH = 1),ложь);								  
	лб_ИгнорироватьСальдо		= ?(Стру.Свойство("NE_V_SUM"),(Стру.NE_V_SUM = 1),ложь);	
	лб_ПлощадьКапремонта		= ?(Стру.Свойство("PL_KAP"),Стру.PL_KAP,0);
	//лб_ВысотаПотолка			= Стру.V_POT;									  
	лб_ВысотаПотолка	        = ВысотаПотолков;
	ЗамечаниеЛС 				= ?(Стру.Свойство("PR"),сокрЛП(Стру.PR),"");	
	
	//КодТипаКвартиры 
	// 1 - Отдельная, 2 - Коммунальная, 3 - Нежилое помещение, 4 - Общежитие (покомнатное заселение)

	
	Если КодТипаКвартиры = 1 тогда
		ТипКвартиры = Справочники.бит_ТипыКвартиры.Отдельная
	ИначеЕсли КодТипаКвартиры = 2 тогда
		ТипКвартиры = Справочники.бит_ТипыКвартиры.Коммунальная
	ИначеЕсли КодТипаКвартиры = 3 тогда
		ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение
	ИначеЕсли КодТипаКвартиры = 4 тогда
		ТипКвартиры = Справочники.бит_ТипыКвартиры.ОбщежитиеПоквартирноеИлиПокомнатноеЗаселение
	иначе	
		ТипКвартиры	= Справочники.бит_ТипыКвартиры.ПустаяСсылка()
	КонецЕсли;	
	
	//КодСтатусаКвартиры 
	// 1 - Частная собственность, 2 - Муниципальная, 3 - Государственная

	Если КодСтатусаКвартиры =1 тогда
		СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Приватизированная
	ИначеЕсли КодСтатусаКвартиры =2 тогда
		СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Неприватизированная
	ИначеЕсли КодСтатусаКвартиры = 3 тогда
		СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Государственный
	КонецЕсли;
	
	
	Запись = РегистрыСведений.бит_СведенияОКвартире.СоздатьМенеджерЗаписи();
	Запись.Активность =истина;
	Запись.Период = Объект.Дата;
	
	Запись.Квартира = Квартира;
	Запись.лб_ПредставлениеКвартиры = лб_ПредставлениеКвартиры;
	Запись.ВысотаПотолков = ВысотаПотолков;
	Запись.ЖилаяПлощадь = ЖилаяПлощадь;
	Запись.ОбщаяПлощадь = ОбщаяПлощадь;
	Запись.лб_ПлощадьКапремонта = лб_ПлощадьКапремонта;
	Запись.ВысотаПотолков = лб_ВысотаПотолка;
	Запись.лб_ИгнорироватьСальдоСвоихУслуг = лб_ИгнорироватьНачисления;
	Запись.лб_НеВыводитьСтрокуДомофон = лб_ИгнорироватьСальдо;
	Запись.ТипКвартиры = ТипКвартиры;
	Запись.СтатусКвартиры = СтатусКвартиры;
	Запись.Записать(истина);
	
	
	
	 Если Не ПустаяСтрока(ЗамечаниеЛС) тогда
		 Запись = РегистрыСведений.бит_ЗамечанияПоЛС.СоздатьМенеджерЗаписи();
		 Запись.Активность = истина;
		 Запись.ЛицевойСчет = ЛС;
		 Запись.ДатаЗаписи = Объект.Дата;
		 Запись.Наименование ="-";
		 Запись.ТекстЗамечания = ЗамечаниеЛС;
		 Запись.Записать(истина);
	 КонецЕсли;
	
	           	
	
		
КонецПроцедуры	

&НаСервере
Функция  СтруктураНомераКвартиры(знач ИмяКвартиры)
	
	ИмяКвартиры = сокрЛП(ИмяКвартиры)+"  ";
	
	Ст = новый структура("НомерКвартиры,ПрефиксКвартиры","0","");
	
	Символ = лев(ИмяКвартиры,1);
	ЕстьПрефикс = СтрНайти("0123456789",Символ)=0;
	Пока ЕстьПрефикс и СтрДлина(ИмяКвартиры)>0 цикл
		Символ = лев(ИмяКвартиры,1);
		Если СтрНайти("0123456789",Символ)=0 тогда; 
			Ст.ПрефиксКвартиры = Ст.ПрефиксКвартиры +  Символ;
			ИмяКвартиры = сред(ИмяКвартиры,2)
		иначе
			ЕстьПрефикс = ложь;
		КонецЕсли;	
			
	КонецЦикла;
	
	Если ИмяКвартиры = "" тогда
		ИмяКвартиры = " ";
	КонецЕсли;	
	Символ = лев(ИмяКвартиры,1);
	НачЦифры = СтрНайти("0123456789",Символ)>0;	 
	Для Ном=1 по СтрДлина(ИмяКвартиры) цикл		
		
		Символ = сред(ИмяКвартиры,Ном,1);
		Если НачЦифры и СтрНайти("0123456789",Символ)>0 тогда
			Ст.НомерКвартиры = Ст.НомерКвартиры + Символ;
		иначе
			Ст.ПрефиксКвартиры = Ст.ПрефиксКвартиры  + Символ;
			НачЦифры = ложь;
		КонецЕсли;	
	КонецЦикла;	
	
	Ст.ПрефиксКвартиры = сокрЛП(Ст.ПрефиксКвартиры);
	
	Ст.НомерКвартиры = Число(Ст.НомерКвартиры);
	Если Ст.НомерКвартиры=0 и Ст.ПрефиксКвартиры<>"-" тогда
		Ст.НомерКвартиры = 1
	КонецЕсли;	
	
	возврат Ст;
	
КонецФункции

	
&НаКлиенте
Процедура УдалитьЛС(Команда)
	УдалитьЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьЛСНаСервере()
	// Вставить содержимое обработчика.
	НаборПримечания = РегистрыСведений.бит_ЗамечанияПоЛС.СоздатьНаборЗаписей();
	НаборПримечания.Записать(истина);
	
	ВыборкаЛС = Справочники.бит_ЛицевыеСчета.Выбрать();
	Пока ВыборкаЛС.Следующий() цикл
		ОбъектЛС = ВыборкаЛС.ПолучитьОбъект();
		ОбъектЛС.Удалить();
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура СоздатьТаблицуДляРазделенныхКвартир()
	мРазделенныеКвартиры = новый ТаблицаЗначений;
	мРазделенныеКвартиры.Колонки.Добавить("Адрес",Новый ОписаниеТипов("Строка"));
	мРазделенныеКвартиры.Колонки.Добавить("ТекНомер",новый ОписаниеТипов("Число"));
	мРазделенныеКвартиры.Индексы.Добавить("Адрес");
КонецПроцедуры	

&НаСервере
Функция ДополнениеИмениРазделеннойКвартиры(Адрес);
	СтрокаТ = мРазделенныеКвартиры.Найти(Адрес,"Адрес");
	Если СтрокаТ = Неопределено тогда
		СтрокаТ = мРазделенныеКвартиры.Добавить();
		СтрокаТ.Адрес = Адрес;
		СтрокаТ.ТекНомер = 0;		
	КонецЕсли;	
	
	СтрокаТ.ТекНомер = СтрокаТ.ТекНомер+1;
	возврат "="+СтрокаТ.ТекНомер;	
КонецФункции	


#КонецОбласти



&НаКлиенте
Процедура ЗагрузитьПроживающих(Команда)
	ПередатьФайлНаСервер();
	ЗагрузитьПроживающихНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПроживающихНаСервере()
	
	ЗаполнитьКэшПроживающих();
	
	// Вставить содержимое обработчика.
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();	
	
	Для каждого Стру из МассивСтру цикл
		создатьОбновитьПроживающего(Стру);
	КонецЦикла;	

	
	Если Тест100 тогда
		возврат 
	КонецЕсли;	
	ЗагрузитьЖильцовНаЛСНаСервере();	
КонецПроцедуры



&НаСервере                                         
Процедура создатьОбновитьПроживающего(Стру)
	Если ложь тогда мКэшПроживающих=новый ТаблицаЗначений КонецЕсли;
	
    Фамилия 		= СокрЛП(стру.FIO);
	Имя 	 		= СокрЛП(стру.NAME);
	Отчество   		= СокрЛП(стру.OTCH);
	ДатаРождения	= ДатаИзСтроки(стру.D_R);
	СНИЛС			= сокрЛП(стру.SNILS);
	ДатаРегистрации = ДатаИзСтроки(стру.D_PR);
	ДатаВыписки     = ДатаИзСтроки(стру.D_V);
	ФизЛицо 			= неопределено;
	Представление   = сокрЛП(Фамилия+" "+Имя + " " +Отчество);
	
	
	Если Объект.ТолькоПоИмеющимсяЛС=Истина тогда
		Если мКэшКвартирЛС = Неопределено тогда
			ЗаполнитьКэшКвартирЛицевыхСчетов();
		КонецЕсли;
		ИмяЛС = СокрЛП(Стру.LS);
		Если СтрДлина(ИмяЛС)<10 тогда
			возврат; //не соотв. стандарту ЛС
		иначе 
			ИмяЛС = лев(ИмяЛС,10)+лб_Сервер.КонтрольныйРазряд(ИмяЛС,10);
		КонецЕсли;	
		
		Если ДанныеЛС(ИмяЛС)= Неопределено тогда
			//Попытка найти ЛС без учета последнего разряда
			ИмяЛС2 = "" + Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(лев(ИмяЛС,10));			
			
			Сообщить("Не найден ЛС: " + ИмяЛС + "Зато найден:" + ИмяЛС2);
			возврат   //лс отсутствует в базе
			
		КонецЕсли;
		
	
	КонецЕсли;	
	
	
	
	//Удаленные ФИО 
	Если Фамилия = "???" тогда
		Фамилия = СокрЛП(Стру.LS);
		
		//Отбор = новый структура("Фамилия",Фамилия);
		//Мас = мКэшПроживающих.НайтиСтроки(Отбор);
		//Имя = Формат(Мас.Количество()+1,"ЧЦ=3; ЧВН=");
		
		//Представление = Фамилия+" "+Имя;
		Представление = Фамилия;
	КонецЕсли;	
		
	
	ЗаписиКэша = новый массив;
	
	
	
	Если НЕ ПустаяСтрока(СНИЛС) тогда
		Если мНеверныеСНИЛС.Найти(СНИЛС)<>Неопределено тогда
			СНИЛС = "";
		иначе	
			Строка = мКэшПроживающих.Найти(СНИЛС,"СНИЛС");
			Если Строка<>Неопределено и 
				 		(Строка.Имя<>Имя или 
				 		 Строка.Отчество <> Отчество или
						 Строка.ДатаРождения <> ДатаРождения
						 ) тогда //проверим соотведствие ДР 
						
				 мНеверныеСНИЛС.Добавить(СНИЛС);	
				 УдалитьНеверныйСНИЛС(СНИЛС);
				 СНИЛС = "";
			 иначе  //Снилс не найден
				 
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	//Убираем СНИЛСы
	СНИЛС = "";
	
	
	Если ПустаяСтрока(СНИЛС) тогда
		Отбор = новый Структура("Фамилия,Имя,Отчество,ДатаРождения",
		                         Фамилия,Имя,Отчество,ДатаРождения);		
	Иначе                                                           
		Отбор = новый Структура("СНИЛС",СНИЛС);			
	КонецЕсли;	
	ЗаписиКэша = мКэшПроживающих.НайтиСтроки(Отбор);
	Если ЗаписиКэша.Количество() = 0 тогда
		Физлицо = неопределено
	иначе
		ФизЛицо = ЗаписиКэша[0].Физлицо;
	КонецЕсли;	
	
	
	
	Если ЗаписиКэша.Количество()>0 тогда 
		СтрокаКэша = ЗаписиКэша[0];
	КонецЕсли;	
	
	//Меняем ссылку на наиболее познюю запись кэша
	Для Инд=1 по ЗаписиКэша.Количество()-1 цикл
		ТекД = ?(ЗначениеЗаполнено(СтрокаКэша.ДатаВыписки),'3000-01-01',СтрокаКэша.ДатаВыписки);
		НовД = ?(ЗначениеЗаполнено(ЗаписиКэша[Инд].ДатаВыписки),'3000-01-01',ЗаписиКэша[Инд].ДатаВыписки);		;
		
		Если СтрокаКэша.ДатаРегистрации>ЗаписиКэша[Инд].ДатаРегистрации тогда
			продолжить;			
		ИначеЕсли СтрокаКэша.ДатаРегистрации<ЗаписиКэша[Инд].ДатаРегистрации тогда	
			СтрокаКэша = ЗаписиКэша[Инд];
			продолжить;
		ИначеЕсли  НовД>текД тогда	//здесь даты прописки обе отсутствуют или равны
			СтрокаКэша = ЗаписиКэша[Инд];
			продолжить;			
		КонецЕсли;	
	КонецЦикла;	
	
	//Мы предполагаем, что в в строках может отличаться только Фамилия .
	//для одного ФизЛица Имя, Отчество и ДатаРождения неизменнны
	Если ЗначениеЗаполнено(СтрокаКэша) тогда
		ЭтоПолныйДубль =  (Фамилия = СтрокаКэша.Фамилия);  
		Если ЭтоПолныйДубль тогда
			ОбновитьКонтактуюИнформацию(СтрокаКэша.Физлицо,Стру);
			возврат
		КонецЕсли;	
		                  
	КонецЕсли;	
	
	
	
	Если НЕ ЗначениеЗаполнено(СтрокаКэша) тогда
		ОбъектФЛ = Справочники.бит_Проживающие.СоздатьЭлемент();	
		ОбъектФЛ.Наименование = Представление;
		ОбъектФЛ.СтраховойНомерПФР = СНИЛС;
		ОбъектФЛ.ДатаРождения = ДатаРождения; 		
		ОбъектФЛ.Записать();
		
		ФизЛицо = ОбъектФЛ.Ссылка;
		ЗаписьФИО = РегистрыСведений.бит_ФИОПроживающих.СоздатьМенеджерЗаписи();
		ЗаписьФИО.Период = ?(ЗначениеЗаполнено(ДатаРегистрации),ДатаРегистрации,'1900-01-01');		
		ЗаписьФИО.Активность = Истина;
		ЗаписьФИО.ФизЛицо= ОбъектФЛ.Ссылка;
		ЗаписьФИО.Фамилия = Фамилия;		
		ЗаписьФИО.Имя = Имя;
		ЗаписьФИО.Отчество = Отчество;
		ЗаписьФИО.Записать(истина);
		
		СтрокаКэша = мКэшПроживающих.Добавить();
		СтрокаКэша.ФизЛицо  = ФизЛицо;
		СтрокаКэша.Фамилия = Фамилия;
		СтрокаКэша.Имя     = Имя;
		СтрокаКэша.Отчество = Отчество;  
		СтрокаКэша.ДатаРождения = ДатаРождения;
		СтрокаКэша.ДатаРегистрации = ДатаРегистрации;
		СтрокаКэша.ДатаВыписки = ДатаВыписки;
		СтрокаКэша.Представление = ""+ФизЛицо;		
		возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаКэша) тогда
		
	КонецЕсли;	
	
    //Найдена строка кэша. Проверяем соответствие
	Если ЭтаФорма.Тест100 тогда
		возврат;
	КонецЕсли;	  	

		
	ФИОСовпадает = СтрокаКэша.Фамилия = Фамилия 
					и СтрокаКэша.Имя = Имя
					и СтрокаКэша.Отчество = Отчество;
	СНИЛССовпадает = СТрокаКэша.СНИЛС = СНИЛС;
	ДатаРСовпадает = СтрокаКэша.ДатаРождения = ДатаРождения;
	
		
КонецПроцедуры	

&НаСервере
Процедура ОбновитьКонтактуюИнформацию(ФЛ,Стру);
	Если ложь тогда ФЛ = Справочники.бит_Проживающие.Выбрать().Ссылка КонецЕсли;
	Если не ЗначениеЗаполнено(ФЛ) тогда
		возврат
	КонецЕсли;	
		
	КИзменению = новый Структура;
	АдресФЛ = СокрЛП(Стру.FAKT_ADR);
	Если НЕ ПустаяСтрока(АдресФЛ) и ПустаяСтрока(ФЛ.ИнформАдресПроживающего) тогда
		КИзменению.Вставить("ИнформАдресПроживающего",АдресФЛ);
	КонецЕсли;
	
	
	
	Если КИзменению.Количество()>0 тогда
		СпрОбъект = ФЛ.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(СпрОбъект,КИзменению);
		СпрОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНеверныйСНИЛС(СНИЛС)
	Отбор = новый структура("СНИЛС", СНИЛС);
	МассивУдл = мКэшПроживающих.НайтиСтроки(Отбор);
	Для каждого СтрокаКэша из МассивУдл цикл
		Если ЗначениеЗаполнено(СтрокаКэша.ФизЛицо) тогда
			СпрОбъект = СтрокаКэша.Физлицо.ПолучитьОбъект();
			Если ложь тогда СпрОбъект = Справочники.бит_Проживающие.СоздатьЭлемент() КонецЕсли;
			СпрОбъект.СтраховойНомерПФР = "";
			СпрОбъект.Записать();
		КонецЕсли;
		СтрокаКэша.СНИЛС = "";
	КонецЦикла;	 			
КонецПроцедуры	


&НаСервере
Функция ДатаИзСтроки(знач Стр)
	Стр = СокрЛП(Стр);
	Если СтрДлина(Стр) = 10 тогда
		ГодС = Сред(Стр,7,4);
	    МесяцС = Сред(Стр,4,2);
		ДеньС = лев(Стр,2);
		Если (ГодС>"2019") или 
				 (МесяцС="00") Или (МесяцС>"12") или
		    	 (ДеньС="00") Или (ДеньС>"31") 
		тогда
			ДатаСтр =  '00010101';
		иначе
			ДатаСтр = Дата(ГодС+МесяцС+ДеньС);
		КонецЕсли;
	иначеЕсли Стр = ".  ." или пустаяСтрока(Стр) тогда 
		ДатаСтр = '00010101';
	иначе	
		ДатаСтр = '00010101';
		Сообщить("Формат даты не разобран: " +  Стр);
	КонецЕсли;
	возврат Дата(ДатаСтр)
КонецФункции	

&НаКлиенте
Процедура УдалитьЖильцов(Команда)
	УдалитьЖильцовНаСервере();
КонецПроцедуры


&НаСервере
Процедура УдалитьЖильцовНаСервере()
	// Вставить содержимое обработчика.
	НаборФИО = РегистрыСведений.бит_ФИОПроживающих.СоздатьНаборЗаписей();
	НаборФИО.Записать(истина);
	
	Выборка = Справочники.бит_Проживающие.Выбрать();
	Пока Выборка.Следующий() цикл
		СпрОбъект = Выборка.ПолучитьОбъект();
		СпрОбъект.Удалить();
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьЖильцовНаЛС(Команда)
	ЗагрузитьЖильцовНаЛСНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьЖильцовНаЛСНаСервере()
	// Вставить содержимое обработчика.

	ЗаполнитьКэшКвартирЛицевыхСчетов();
	ЗаполнитьКэшПроживающих();
	ПодготовитьМассивСтруДляПроживающих();
	
	//Получим списокЛС
	СписокЛС = новый массив;
	ТекЛС = неопределено;	
	Для каждого Стру из МассивСтру цикл						
		Если ТекЛС<>Стру.ЛС тогда
			СписокЛС.Добавить(Стру.ЛС);
			ТекЛС = Стру.ЛС;
		КонецЕсли;			
	КонецЦикла;	
	
	УдалитьДокиРегистрацииЖильцов(СписокЛС);
	
	
	
	
	ТекЛС = Неопределено;
	МассивСтруЛицевогоСчета = новый массив;	
	ДокиРегистрации = Новый Массив;        	
	Для ТекИндекс = 0 по МассивСтру.ВГраница() цикл		
	     Стру = МассивСтру[ТекИндекс];	
		 Если стру.ЛС = ТекЛС тогда
			 МассивСтруЛицевогоСчета.Добавить(Стру);
		 Иначе
			 РегистрацияЖильцовЛС(ТекЛС,МассивСтруЛицевогоСчета);
			 МассивСтруЛицевогоСчета = новый массив(1);;
			 МассивСтруЛицевогоСчета[0] = Стру;
			 ТекЛС = Стру.ЛС;
		 КонецЕсли;	    
	КонецЦикла;
	 
	 
	РегистрацияЖильцовЛС(ТекЛС,МассивСтруЛицевогоСчета);
	
КонецПроцедуры

&НаСервере
Функция РодственныеОтношения(знач СтрокаРО)
	СтрокаРО = СокрЛП(СтрокаРО);
	Если ПустаяСтрока(СтрокаРО) тогда
		возврат Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано;
	ИначеЕсли СтрокаРО = "Ответственный" тогда
		возврат Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;		
	КонецЕсли;	
	
	если мТаблицаИменРО= неопределено тогда
		мТаблицаИменРО = новый ТаблицаЗначений;
		мТаблицаИменРО.Колонки.Добавить("ИмяИсх",Новый ОписаниеТипов("Строка"));
		мТаблицаИменРО.Колонки.Добавить("Имя",Новый ОписаниеТипов("Строка"));
		ОбрОбъект = РеквизитФормыВЗначение("Объект");
		Макет = ОбрОбъект.ПолучитьМакет("МакетРО");
		Высота = Макет.ВысотаТаблицы;
		Для номСтроки = 2 по Высота цикл
			НовСтрока = мТаблицаИменРО.Добавить();
			НовСтрока.ИмяИсх = Макет.Область(НомСтроки,1).Текст;
			НовСтрока.Имя	 = Макет.Область(НомСтроки,2).Текст;
		КонецЦикла;	                                    
		мТаблицаИменРО.Индексы.Добавить("ИмяИсх");
	КонецЕсли;	
	
	СтрокаИменРО = мТаблицаИменРО.Найти(СтрокаРО,"ИмяИсх");
	Если СтрокаИменРО <> Неопределено тогда
		СтрокаРО = СтрокаИменРО.Имя
	КонецЕсли;	
	
	
	
	если мСтепениРодства = неопределено тогда
		мСтепениРодства = новый Соответствие;		
	КонецЕсли;	
	
	СтепеньРО = мСтепениРодства[СтрокаРО];
	Если СтепеньРО <> неопределено тогда
		возврат СтепеньРО
	КонецЕсли;
	
	СтепеньРО = Справочники.бит_СтепениРодстваФизЛиц.НайтиПоНаименованию(СтрокаРО,истина);
	Если Не ЗначениеЗаполнено(СтепеньРО) тогда
		СтепеньРО = Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано;
		//СпрОбъект = Справочники.бит_СтепениРодстваФизЛиц.СоздатьЭлемент();
		//СпрОбъект.Наименование = СтрокаРО;
		//СпрОбъект.Записать();
		//СтепеньРО = СпрОбъект.Ссылка
	КонецЕсли;	
	мСтепениРодства.Вставить(СтрокаРО,СтепеньРО);
	возврат СтепеньРО;   
КонецФункции	
	


&НаСервере
Процедура УдалитьДокиРегистрацииЖильцов(СписокЛС)
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_РегистрацияПроживающихПоЛС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.бит_РегистрацияПроживающихПоЛС КАК бит_РегистрацияПроживающихПоЛС
	               |ГДЕ
	               |	бит_РегистрацияПроживающихПоЛС.ЛицевойСчет В(&СписокЛС)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Ложь тогда ДокОбъект = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент() КонецЕсли;
		ДокОбъект.УстановитьПометкуУдаления(истина);
		ДокОбъект.Удалить();		 
	КонецЦикла;
	
КонецПроцедуры	
	
&НаСервере
Процедура РегистрацияЖильцовЛС(ЛС,МассивСтруЛС)
	Если ложь тогда МассивСтруЛС = новый массив КонецЕсли;
	Если не ЗначениеЗаполнено(ЛС) тогда
		возврат
	КонецЕсли;
	Если МассивСтруЛС.Количество() = 0 тогда
		возврат
	КонецЕсли;
	          	
	//коррекция даты выписки - за один день до прописки на том же ЛС
	Для Индекс = 0 по МассивСтруЛС.ВГраница()-1 цикл
		Стру1 = МассивСтруЛС[Индекс];
		Стру2 = МассивСтруЛС[Индекс+1];
		Если  Стру1.ФЛ = Стру2.ФЛ и 
				ЗначениеЗаполнено(Стру2.ДПрописки) и 
				(Стру1.ДВыписки>=Стру2.ДПрописки) тогда
				
			Стру1.ДВыписки = Стру2.ДПрописки - 24*3600; 
		КонецЕсли;	
	КонецЦикла;	
	
	//коррекция Ответственого,
	ОтвСтру		 = Неопределено;
	ОтвДВыписки  = '0001-01-01';
	Для Индекс = 0 по МассивСтруЛС.ВГраница() цикл
		Стру = МассивСтруЛС[Индекс];        
		ЭтоСобственник = стру.PR_SOB =1;		
		Если Стру.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо и 
			 			Стру.ДВыписки>ОтвДВыписки  
						и НЕ ЭтоСобственник тогда
			 ОтвСтру = Стру;
			 ОтвДВыписки = Стру.ДВыписки;
		КонецЕсли;	
	КонецЦикла;	
	
	Если ОтвДВыписки < '2500-01-01' и ОтвСтру<> Неопределено тогда
		
		НовОтв = новый структура;
		Для каждого КЗ из ОтвСтру цикл			
			НовОтв.Вставить(КЗ.Ключ,ОтвСтру[КЗ.Ключ]);
		КонецЦикла;	
		НовОтв.ДВыписки = '3000-01-01';
		НовОтв.Вставить("НетОтветственногоНаЛС",истина);
		МассивСтруЛС.Добавить(НовОтв);
	КонецЕсли;	
		
	
	
	
	
	
	СоотвДоковФЛ = новый Соответствие;  //в обном доке не более одной записи об каждом из ФЛ
	ЧислоДоков = 0;
	Для каждого Стру из МассивСтруЛС цикл
		ФЛ = Стру.ФЛ;
		ДоковДляФЛ = СоотвДоковФЛ[ФЛ];
		Если ДоковДляФЛ=неопределено тогда
			ДоковДляФЛ =1;			
		иначе
			ДоковДляФЛ = ДоковДляФЛ + 1;//увеличиваем счетчик на 1
		КонецЕсли;	
		СоотвДоковФЛ[ФЛ] = ДоковДляФЛ;
		Стру.Вставить("НомерДока",ДоковДляФЛ);
		ЧислоДоков = Макс(ЧислоДоков, ДоковДляФЛ);
	КонецЦикла;	
	
	//Сейчас все строки пронумерованы по номеру документа	
	Для НомерДока = 1 по ЧислоДоков цикл
		ДокОбъект = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент();	
		ДокОбъект.Дата = Дата(2018,12,НомерДока);
		ДокОбъект.ЛицевойСчет = ЛС;
		ДокОбъект.СписокЛицевыхСчетов = Стру.ИмяЛС;
		Для каждого Стру из МассивСтруЛС цикл
			Если Стру.НомерДока<>НомерДока тогда
				продолжить
			КонецЕсли;	
								
			СтрокаЖ = ДокОбъект.СписокПроживающих.Добавить();
			//СтрокаЖ.ДатаЗаписи ='0001-01-01'; //Дата окончания статуса
			СтрокаЖ.Физлицо = Стру.ФЛ;
			СтрокаЖ.ДатаРегистрации = Стру.ДПрописки;
			СтрокаЖ.ДатаСнятияСРегистрации = ?(Стру.ДВыписки>'2500-01-01','0001-01-01',Стру.ДВыписки);
			Строкаж.ВладелецКвартиры = ?(Стру.PR_SOB=1,Перечисления.ДаНет.Да,Перечисления.ДаНет.Нет);
			СтрокаЖ.ДоляПлощади = ?(Стру.D2=0,0,Стру.D1/Стру.D2);
			СтрокаЖ.лб_ДоляПлощадиСтрокой = СокрЛП(Стру.SOBST);
			//Контрагент
			//КудаВыписан
			//КудаВыписанАдрес
			//ОткудаПрибыл
			//ОткудаПрибылАдрес
			//ПравоустанавливающиеДокументы
			//ПричинаВыписки
			//ПричинаПрописки
			СтатусПрож = Стру.STATYS;
			ЭтоСобственник = Стру.PR_SOB=1;
			НетОтветственногоЛС = Стру.Свойство("НетОтветственногоНаЛС");
			Если НетОтветственногоЛС =истина тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Ответственный не проживает");
			ИначеЕсли СтатусПрож = "постоянная" тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация;
			ИначеЕсли 	СтатусПрож = "временная" тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.Временно;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.ВременнаяРегистрация;
				
				//Человек не проживает. Варианты - Собственник не проживает, либо человек убран с ЛС
			иначеЕсли  ЭтоСобственник тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Владелец не проживает");
			иначе	
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.Выписан;				
			КонецЕсли;	
			///*** - добавить статусы для Саобственник не проживает - на него
			// Если собственник и выписан - меняем на Собственник не проживает
			// если не собственник и выписан - то меняем на Уделен с лицевого счета
			
			СтрокаЖ.СтепеньРодства = Стру.СтепеньРодства;
			
			
			
		КонецЦикла;	
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
	
	
	
КонецПроцедуры	




	


&НаСервере
Процедура ПодготовитьМассивСтруДляПроживающих()
	Если мКэшКвартирЛС = Неопределено тогда
		ЗаполнитьКэшКвартирЛицевыхСчетов();
	КонецЕсли;
	Если мКэшПроживающих = Неопределено тогда
		ЗаполнитьКэшПроживающих();
	КонецЕсли;	
	
	//Инд = 0;
	Инд = ЭтаФорма.СтартЗапись;
	МаксИнд = МассивСтру.Вграница();
	Для Инд = 0 по МаксИнд цикл
		Стру = МассивСтру[Инд];
		Если Стру = Неопределено тогда
			продолжить
		КонецЕсли;	
		ИмяЛС = сокрЛП(Стру.LS);
		Фам = сокрЛП(Стру.FIO);
		Имя = сокрЛП(Стру.NAME);
		Отч = сокрЛП(Стру.OTCH);
		ДР  = ДатаИзСтроки(Стру.D_R);
		ДПрописки = ДатаИзСтроки(Стру.D_PR);
		ДВыписки  = ДатаИзСтроки(Стру.D_V);		
		СНИЛС = сокрЛП(Стру.SNILS);		
		Родств = сокрЛП(стру.RODOTN);
		СогласиеСтрокой = сокрЛП(Стру.SOGL);
		
			
		Стру.Вставить("ИмяЛС",ИмяЛС);
		Стру.Вставить("Фам",Фам);
		Стру.Вставить("Имя",Имя);
        Стру.Вставить("Отч",Отч);
		Стру.Вставить("ДР",ДР);
		Стру.Вставить("СНИЛС",СНИЛС);
		
		СтрокаКэшаЛС = ДанныеЛС(ИмяЛС);
		Если СтрокаКэшаЛС<>Неопределено тогда		
			Стру.Вставить("ЛС",СтрокаКэшаЛС.ЛС);
			Стру.Вставить("ЗданиеКод",СтрокаКэшаЛС.ЗданиеКод);
			Стру.Вставить("Здание",СтрокаКэшаЛС.Здание);
		иначе
			Стру.Вставить("ЛС",Неопределено);
			Стру.Вставить("ЗданиеКод",Неопределено);
			Стру.Вставить("Здание",Неопределено);

		КонецЕсли;
		
		СтрокаКэшаПрожив = ПолучитьСтрокуПроживающегоИзКэша(Фам,Имя,Отч,ДР,СНИЛС);		
		Если СтрокаКэшаПрожив<> Неопределено тогда
			Стру.Вставить("ФЛ",СтрокаКэшаПрожив.Физлицо);
			Стру.Вставить("СогласиеПД",СтрокаКэшаПрожив.СогласиеПД);
		иначе
			//Ищем запросом и добавляем в строку
			создатьОбновитьПроживающего(Стру);	
			
			СтрокаКэшаПрожив = ПолучитьСтрокуПроживающегоИзКэша(Фам,Имя,Отч,ДР,СНИЛС);
			Стру.Вставить("ФЛ",СтрокаКэшаПрожив.Физлицо);
			Стру.Вставить("СогласиеПД",СтрокаКэшаПрожив.СогласиеПД);			
			//Стру.Вставить("ФЛ",Справочники.бит_Проживающие.ПустаяСсылка());
			//Стру.Вставить("СогласиеПД",Перечисления.лб_ВидСогласияНаОбработкуПД.ПустаяСсылка());
		КонецЕсли;	

		
		
			
		
		Стру.Вставить("ДПрописки",ДПрописки);
		Стру.Вставить("ДВыписки",?(ЗначениеЗаполнено(ДВыписки),ДВыписки,'3000-01-01'));
		Стру.Вставить("СтепеньРодства",РодственныеОтношения(Родств));
		Стру.Вставить("лб_СтрокаРодствДляФЛС",Родств);              
		
		
		
				
		Если СогласиеСтрокой = "п" тогда 
			Стру.Вставить("НовСогласиеПД",Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьПаспортныйСтол)
		ИначеЕсли СогласиеСтрокой = "з" тогда 
			Стру.Вставить("НовСогласиеПД",Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьАбонентскийОтдел)
		ИначеЕсли СогласиеСтрокой = "о" или СогласиеСтрокой = "o" тогда
			Стру.Вставить("НовСогласиеПД",Перечисления.лб_ВидСогласияНаОбработкуПД.Отказ)
		иначе	
	        Стру.Вставить("НовСогласиеПД",Перечисления.лб_ВидСогласияНаОбработкуПД.ПустаяСсылка())
		КонецЕсли;
				
		
		
	КонецЦикла;	
	
	//удаляем данные по ЛС, которых нет в базе
	ЧислоУдл =0;
	ЧислоСтру = МассивСтру.Количество();
	ИндОшибки = ЧислоСтру;
	Для СчетВниз=1 по ЧислоСтру цикл
		Инд = ЧислоСтру - СчетВниз;
		Стру = МассивСтру[инд];
		Если Стру = Неопределено тогда 
			продолжить
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Стру.ЛС) или не ЗначениеЗаполнено(Стру.ФЛ) тогда
			//МассивСтру.Удалить(Инд); 
			МассивСтру[Инд] = неопределено;
			ЧислоУдл = ЧислоУдл+1;
			ИндОшибки = Инд;
		КонецЕсли;
	КонецЦикла;	
	Если ИндОшибки = ЧислоСтру тогда
		Сообщить("Все ЛС и ФЛ сопоставлены");
	иначе	
		Сообщить("Исключено из загрузки " + ЧислоУдл + " записей, наим.строка "+Инд);
	КонецЕсли;	
	
	
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура СортировкаПузырькомПроживающих(МассивСтру,АлгоритмСравнения= "ФизЛицо")	
	ЧислоЭлем = МассивСтру.Количество();
	//Если ЧислоЭлем=0 или
	//		НЕ МассивСтру[0].Свойство("ЛС") или
	//		НЕ МассивСтру[0].Свойство("ФЛ") тогда
	//		
	//	Сообщить("Не подготовлен МассивСтру");	
	//	возврат;	
	//КонецЕсли;	
		                   
		
	ВозможныПеремещения = истина;
	Пока ВозможныПеремещения цикл
		ВозможныПеремещения = ложь;
		Для НомерЭлем =1 по ЧислоЭлем-1 цикл
			Элем1 = МассивСтру[НомерЭлем-1];
			Элем2 = МассивСтру[НомерЭлем];
						
			НуженСдвиг = НуженСдвигПоЗданию_ЛС_Физлицу_ДатеРег(Элем1,Элем2);	
			
			Если НуженСдвиг тогда
				Эл1 =Элем1;
				Эл2 = Элем2;
				МассивСтру[НомерЭлем-1] = Эл2;
				МассивСтру[НомерЭлем] = Эл1;
				ВозможныПеремещения = истина;
			КонецЕсли;				         	
		КонецЦикла; 		
	КонецЦикла;	
	
КонецПроцедуры	



Функция НуженСдвигПоЗданию_ЛС_Физлицу_ДатеРег(Элем1, Элем2)
	НуженСдвиг = Неопределено;
	Если Элем1=неопределено и Элем2=Неопределено  тогда
		НуженСдвиг = ложь
	ИначеЕсли Элем1 = Неопределено и Элем2<>Неопределено тогда
		НуженСдвиг = истина
	ИначеЕсли Элем1 <> Неопределено = Элем2<>Неопределено тогда
		НуженСдвиг = ложь
	КонецЕсли;	
	
	Если (Элем1 = Неопределено) или (Элем2 = Неопределено) тогда
		возврат НуженСдвиг
	КонецЕсли;
	
	
	          
	////По коду здания,  	
	//Если Элем1.ЗданиеКод>Элем2.ЗданиеКод тогда
	//	НуженСдвиг = истина;
	//ИначеЕсли Элем1.ЗданиеКод<Элем2.ЗданиеКод тогда
	//	НуженСдвиг = ложь;
	Если ложь тогда
		//отключаем по зданию
	
	//Здание совпадает, по ЛС	
	ИначеЕсли Элем1.ИмяЛС>Элем2.ИмяЛС тогда
		НуженСдвиг = истина;
	ИначеЕсли Элем1.ИмяЛС<Элем2.ИмяЛС тогда
		НуженСдвиг = ложь;
		
		//ИмяЛС совпадает, сравниваем УИДы Физлиц				
	ИначеЕсли ""+Элем1.ФЛ.УникальныйИдентификатор()	
		> ""+Элем2.ФЛ.УникальныйИдентификатор() тогда
		НуженСдвиг = истина
	ИначеЕсли ""+Элем1.ФЛ.УникальныйИдентификатор()	
		< ""+Элем2.ФЛ.УникальныйИдентификатор() тогда
		НуженСдвиг = ложь	
		
		//ИмяЛС и ФизЛицоСовпадает, сравниваем даты прописки
	Иначе 
		НуженСдвиг = Элем1.ДПрописки>Элем2.ДПрописки; 				
	КонецЕсли;
	
	возврат нуженСдвиг
КонецФункции
	
&НаСервере
Процедура СортировкаПузырькомПроживающих2(МассивСтру,АлгоритмСравнения= "ФизЛицо")	
	ЧислоЭлем = МассивСтру.Количество();
	//Если ЧислоЭлем=0 или
	//		НЕ МассивСтру[0].Свойство("ЛС") или
	//		НЕ МассивСтру[0].Свойство("ФЛ") тогда
	//		
	//	Сообщить("Не подготовлен МассивСтру");	
	//	возврат;	
	//КонецЕсли;	
		                   
		
	ВозможныПеремещения = истина;
	Пока ВозможныПеремещения цикл
		ВозможныПеремещения = ложь;
		Для НомерЭлем =1 по ЧислоЭлем-1 цикл Элем1 = МассивСтру[НомерЭлем-1]; Элем2 = МассивСтру[НомерЭлем];  НуженСдвиг = Неопределено; 	Если Элем1=неопределено и Элем2=Неопределено  тогда  	НуженСдвиг = ложь ИначеЕсли (Элем1 = Неопределено) и (Элем2<>Неопределено) тогда 	НуженСдвиг = истина  ИначеЕсли (Элем1 <> Неопределено) и (Элем2=Неопределено) тогда	НуженСдвиг = ложь ИначеЕсли Элем1.ИмяЛС>Элем2.ИмяЛС тогда НуженСдвиг = истина; ИначеЕсли Элем1.ИмяЛС<Элем2.ИмяЛС тогда	НуженСдвиг = ложь; ИначеЕсли ""+Элем1.ФЛ.УникальныйИдентификатор()	 > ""+Элем2.ФЛ.УникальныйИдентификатор() тогда 	НуженСдвиг = истина ИначеЕсли ""+Элем1.ФЛ.УникальныйИдентификатор()	< ""+Элем2.ФЛ.УникальныйИдентификатор() тогда НуженСдвиг = ложь Иначе НуженСдвиг = Элем1.ДПрописки>Элем2.ДПрописки; КонецЕсли; 	Если НуженСдвиг тогда  Эл1 =Элем1; 	Эл2 = Элем2; 	МассивСтру[НомерЭлем-1] = Эл2;	МассивСтру[НомерЭлем] = Эл1;  ВозможныПеремещения = истина; КонецЕсли;	КонецЦикла; 
	КонецЦикла;	
	
КонецПроцедуры	


&НаСервере
Процедура СортировкаТаблицей(МассивСтру)
	Табл = новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Здание");
	Табл.Колонки.Добавить("ФЛ");
	Табл.Колонки.Добавить("ЛС");
	Табл.Колонки.Добавить("Дпрописки");
	Табл.Колонки.Добавить("Стру");
	Для Каждого Стру из МассивСтру цикл  Если Стру<>Неопределено тогда НовСтр = Табл.Добавить(); ЗаполнитьЗначенияСвойств(НовСтр,Стру);НовСтр.Стру = Стру КонецЕсли; КонецЦикла;
	Табл.Индексы.Добавить("Здание,ЛС,ФЛ,Дпрописки");
	Табл.Сортировать("Здание,ЛС,ФЛ,Дпрописки");
	МассивСтру = Табл.ВыгрузитьКолонку("Стру");
КонецПроцедуры	

&НаСервере
Процедура ПолучитьПроживающихНаЛС()
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьОстаткиЛС(Команда)
	ПередатьФайлНаСервер();
	ЗагрузитьОстаткиЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОстаткиЛСНаСервере()
	// Вставить содержимое обработчика.
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();	

	ЗаполнитьКэшКвартирЛицевыхСчетов();
	
	
	
	Если Объект.ТолькоНовыеОбъекты = истина и МассивСтру.Количество()>0 тогда
		Услуга = УслугаЖКХ(МассивСтру[0].YSL);
		ЗаполнитьОбработанныеОстатки(Услуга);
		УдалитьстрокиОбработанныхОстатков();
	КонецЕсли;	
	
	
	ДобавитьПодучасткиВМассивСтру();
	
	ОбработаноЭлементов = 0;
	ЧислоСтрокВДокумненте = 0;  //если =0, то группирируем в документы по подучасткам  Стру.Подучасток, идущим подряд
	Подучасток = ""; 
	Пока ОбработаноЭлементов<МассивСтру.Количество()  цикл				
		ДокОбъект = Документы.бит_ВводНачальныхОстатковПоКУ.СоздатьДокумент();
		ДокОбъект.Дата = КонецДня(Объект.Дата);
		ДокОбъект.Организация = Объект.Организация;
		ДокОбъект.ВидОперации = Перечисления.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводДифференциальногоНачальногоСальдо;
		ЗаполнитьСтрокиДокументаОстаткиКУ(ДокОбъект,ОбработаноЭлементов,ЧислоСтрокВДокумненте,Подучасток);
		Если ДокОбъект.СписокЛС.Количество() >0 тогда
			ПозСлэша = СтрНайти(ЭтаФорма.ИмяФайлаКл,"\",НаправлениеПоиска.СКонца,,2);
			ИмяФ = ?(ПозСлэша=0,ЭтаФорма.ИмяФайлаКл,Сред(ЭтаФорма.ИмяФайлаКл,ПозСлэша+1));
			Если ПустаяСтрока(Подучасток) или (Подучасток = Неопределено) тогда
				ДокОбъект.Комментарий = "Из файла " + ИмяФ;
			иначе
				ДокОбъект.Комментарий = "Подуч "+Подучасток + " из файла " + ИмяФ; 
			КонецЕсли;	
				
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);				
		иначе	
			Сообщить("В файле "+ ЭтаФорма.ИмяФайлаКл + " нет ненулевых строк");
		КонецЕсли;	
	Конеццикла;	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодучасткиВМассивСтру();
	Для каждого Стру из МассивСтру цикл
		Подучасток = "";
		Стру.Свойство("POD_YCH",подучасток);
		Стру.Вставить("Подучасток",Подучасток);
	КонецЦикла;		
КонецПроцедуры	

&НаСервере
Процедура  ЗаполнитьСтрокиДокументаОстаткиКУ(ДокОбъект,НачИндекс, ЧислоСтрокВДокументе,ТекПодучасток);
	Если ложь тогда ДокОбъект = Документы.бит_ВводНачальныхОстатковПоКУ.СоздатьДокумент(); КонецЕсли;
	Если ТипЗнч(МассивСтру)<>Тип("Массив") тогда 
		возврат
	КонецЕсли;	
	Счет76КУ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.КУ");
	Счет000  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("000");
	
	
	//Определим загружаемые элементы МассивСтру
	ВГраница = МассивСтру.ВГраница();
	Если ЧислоСтрокВДокументе =0 и НачИндекс<=ВГраница тогда
		ТекПодучасток = МассивСтру[НачИндекс].Подучасток;				
		Для МаксИндекс = НачИндекс+1 по ВГраница цикл
			Если МассивСтру[МаксИндекс].Подучасток<>ТекПодучасток тогда
				прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если (МаксИндекс>ВГраница) или  (МассивСтру[МаксИндекс].Подучасток<>ТекПодучасток) тогда
			МаксИндекс = МаксИндекс-1;
		КонецЕсли;	              		
	иначе		
		МаксИндекс = мин(НачИндекс + ЧислоСтрокВДокументе-1,МассивСтру.ВГраница());			
	КонецЕсли;
	
	Для Инд = НачИндекс по МаксИндекс цикл	  		
		Стру = МассивСтру[Инд]; 
		ЛС = СсылкаЛС(Стру.LS);		
		Услуга = УслугаЖКХ(Стру.YSL);
		Сумма = стру.SALDO;
		Если Сумма = 0 тогда
			продолжить
		КонецЕсли;;	
		Если Не ЗначениеЗаполнено(ЛС) тогда
			Сообщить("Не найден ЛС:" + сокрЛП(Стру.LS));
			Продолжить;
		КонецЕсли;
		
		НовСтрока = ДокОбъект.СписокЛС.Добавить();
		НовСтрока.ЛицевойСчет = ЛС;
		НовСтрока.Услуга = Услуга;
		НовСтрока.СальдоНаЛС = Сумма;
		НовСтрока.СчетКУ = Счет000;
		НовСтрока.СчетАбонента = Счет76КУ;
		НовСтрока.Субконто1 = ЛС;
		НовСтрока.Субконто2 = Услуга;
		НовСтрока.Сумма = Сумма;  		
	КонецЦикла;;	
	
	НачИндекс = МаксИндекс+1;
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьУслугиЛС(Команда)
	ПередатьФайлНаСервер();
	ЗагрузитьУслугиЛСНаСервере(,ЭтаФорма.ТолькоТарифы);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУслугиЛСНаСервере(ВариантУслуги = "", ТолькоТарифы = ложь)
	// Вставить содержимое обработчика.
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();		                                            	
	
	Если ВариантУслуги = "КР" тогда
		ЧислоСтрок = МассивСтру.Количество();
		Для СчетВниз=1 по ЧислоСтрок цикл
			Инд = ЧислоСтрок- СчетВниз;
			Стру = МассивСтру[инд];
			Если лев(Стру.POST,4)= "РФКР" тогда
				Стру.Вставить("ПропуститьЭтотЭлемент",истина);
			иначе
				Стру.YSLYGA= "Минимальный взнос на кап.ремонт";
			КонецЕсли;	
		КонецЦикла;	
	ИначеЕсли ВариантУслуги = "РФКР" тогда
				
		ЧислоСтрок = МассивСтру.Количество();
		Для СчетВниз=1 по ЧислоСтрок цикл
			Инд = ЧислоСтрок- СчетВниз;
			Стру = МассивСтру[инд];
			Если лев(Стру.POST,4)= "РФКР" тогда
				Стру.YSLYGA= "Капитальный ремонт (РФКР)";
			иначе
				Стру.Вставить("ПропуститьЭтотЭлемент",истина);
			КонецЕсли;	
		КонецЦикла;	  
		
	КонецЕсли;	
	
	
	
	ДополнитьМассивСтруктурДляУслугНаЛС();          
	
	
	
	
	
	
	Если ВариантУслуги = "РФКР" тогда
		Услуга = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("Капитальный ремонт (РФКР)");
	ИначеЕсли МассивСтру.Количество()>0 и МассивСтру[0].Свойство("Услуга") тогда
		Услуга = МассивСтру[0].Услуга;
	иначе
		Сообщить("В файле" + ЭтаФорма.ИмяФайлаКл+" нет информации по услуге");
		возврат 
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(Услуга) тогда
		ИмяУслуги = сокрЛП(МассивСтру[0].YSLYGA);
		Сообщить("Не могу найти услугу: "+ИмяУслуги );
		возврат;
	КонецЕсли;	
	
	Если Объект.ТолькоНовыеОбъекты = истина тогда
		ЗаполнитьОбработанныеУслуги(Услуга);
		УдалитьстрокиОбработанныхОстатков();
	КонецЕсли;	
	
	
	
	Если ВариантУслуги= "" тогда
		Попытка
			ПодключитьУслугуКДомам();	
		исключение
		КонецПопытки;	
	КонецЕсли;	
	
	ДокСтавки = получитьДокСтавок(Услуга);	
	Если ложь тогда ДокСтавки = Документы.бит_УстановкаСтавокПоУслугам.СоздатьДокумент() КонецЕсли;
	ТаблСтавок = ДокСтавки.СтавкиНаУслуги.Выгрузить();
	
	
	ДобавитьПодучасткиВМассивСтру();
			
	ОбработаноЭлементов = 0;
	ЧислоСтрокВДокумненте = 0;  //если =0, то группирируем в документы по подучасткам  Стру.Подучасток, идущим подряд
	Подучасток = ""; 
	
	
	
	ЗапросТекУслуги = новый запрос;
	ЗапросТекУслуги.УстановитьПараметр("Услуга",Услуга);
	ЗапросТекУслуги.УстановитьПараметр("Дата",Объект.Дата);
	ЗапросТекУслуги.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
		|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ИСТИНА";
	ТаблТекУслуг = ЗапросТекУслуги.Выполнить().Выгрузить();
	ТаблТекУслуг.Индексы.Добавить("ЛицевойСчет");
	
	
	
	Пока ОбработаноЭлементов<МассивСтру.Количество()  цикл				
		ДокОбъект = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент();
		ДокОбъект.Дата = Объект.Дата;
		ДокОбъект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета;
		ДокОбъект.Услуга = Услуга;
		
		
		
		ЗаполнитьСтрокиДокументаУстановкаУслугЛС(ДокОбъект,ОбработаноЭлементов,ЧислоСтрокВДокумненте,Подучасток,ТаблСтавок,ТаблТекУслуг);
		Если ДокОбъект.ЛицевыеСчета.Количество() >0 тогда			
			ПозСлэша = СтрНайти(ЭтаФорма.ИмяФайлаКл,"\",НаправлениеПоиска.СКонца,,2);
			ИмяФ = ?(ПозСлэша=0,ЭтаФорма.ИмяФайлаКл,Сред(ЭтаФорма.ИмяФайлаКл,ПозСлэша+1));
			Если НЕ ЗначениеЗаполнено(Подучасток) или ПустаяСтрока(Подучасток) тогда
				ДокОбъект.Комментарий = "Подуч "+Подучасток + " из файла " + ИмяФ;
			иначе
				ДокОбъект.Комментарий = "Из файла " + ЭтаФорма.ИмяФ;
			КонецЕсли;	
			Если Не ТолькоТарифы тогда	
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);				
			КонецЕсли;	
		иначе	
			Сообщить("В файле "+ ЭтаФорма.ИмяФайлаКл + " нет ненулевых строк");
		КонецЕсли;	
	Конеццикла;	
	
	Если ТаблСтавок.Количество()>0 тогда
		ДокСтавки.СтавкиНаУслуги.Загрузить(ТаблСтавок);
		ДокСтавки.Записать(РежимЗаписиДокумента.Запись);
		Попытка
		ДокСтавки.Записать(РежимЗаписиДокумента.Проведение)
	исключение
			Сообщить("ОШИБКА ПРИ ПРОВЕДЕНИИ "+ ДокСтавки)
		конецпопытки
		
	КонецЕсли;	
	
	
КонецПроцедуры

&НаСервере
Функция получитьДокСтавок(Услуга)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_УстановкаСтавокПоУслугам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.бит_УстановкаСтавокПоУслугам КАК бит_УстановкаСтавокПоУслугам
	               |ГДЕ
	               |	бит_УстановкаСтавокПоУслугам.Услуга = &Услуга
	               |	И бит_УстановкаСтавокПоУслугам.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	               |	И бит_УстановкаСтавокПоУслугам.Организация = &Организация";
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("Дата1",Объект.Дата);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() тогда
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
	иначе
		ДокОбъект = Документы.бит_УстановкаСтавокПоУслугам.СоздатьДокумент();
		ДокОбъект.Дата = Объект.Дата;
		ДокОбъект.Услуга = Услуга;
		ДокОбъект.Организация = Объект.Организация;	
	КонецЕсли;	
	
	возврат ДокОбъект;
		
КонецФункции	

&НаСервере
Процедура ЗаполнитьСтрокиДокументаУстановкаУслугЛС(ДокОбъект,НачИндекс,ЧислоСтрокВДокументе=0,Подучасток,ТаблСтавок,ТаблТекУслуг = Неопределено);
	Если ложь тогда ДокОбъект = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент()КонецЕсли; 
	Если  ложь тогда ТаблСтавок = Документы.бит_УстановкаСтавокПоУслугам.СоздатьДокумент().СтавкиНаУслуги КонецЕсли;
	Если ТипЗнч(МассивСтру)<>Тип("Массив") тогда 
		возврат
	КонецЕсли;	
	
	Поставщик = ДокОбъект.Услуга.Поставщики[0].Поставщик;
	СпособРасчетаПоУмолчанию = ДокОбъект.Услуга.СпособыРасчета[0].СпособРасчета;
	
	
	
	//Определим загружаемые элементы МассивСтру
	ВГраница = МассивСтру.ВГраница();
	Если ЧислоСтрокВДокументе =0 и НачИндекс<=ВГраница тогда
		ТекПодучасток = МассивСтру[НачИндекс].Подучасток;				
		Для МаксИндекс = НачИндекс+1 по ВГраница цикл
			Если МассивСтру[МаксИндекс].Подучасток<>ТекПодучасток тогда
				прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если (МаксИндекс>ВГраница) или  (МассивСтру[МаксИндекс].Подучасток<>ТекПодучасток) тогда
			МаксИндекс = МаксИндекс-1;
		КонецЕсли;	              		
	иначе		
		МаксИндекс = мин(НачИндекс + ЧислоСтрокВДокументе-1,МассивСтру.ВГраница());			
	КонецЕсли;
	
	
	ЗначПропустить = ложь;
	Для Инд = НачИндекс по МаксИндекс цикл	  		
		Стру = МассивСтру[Инд]; 
		//ЛС = СсылкаЛС(Стру.LS);	
				
		Если Стру.Свойство("ПропуститьЭтотЭлемент",ЗначПропустить) и (ЗначПропустить=истина)  тогда
			продолжить
		КонецЕсли;	
		
		
		ЛС = Стру.ЛС;
		Услуга = Стру.Услуга;		
		ИмяРежима = сокрЛП(Стру.R_POTR);
		РежимПотребления  = РежимПотребления(ИмяРежима,Стру.TAR);
		ЧислоЕдПотребления = Стру.ED_POTR;
		КодСпособаРасчета = Стру.SPOSOB_R;
		
		Если КодСпособаРасчета = 1 или КодСпособаРасчета = 5 тогда
			СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади;
		ИначеЕсли КодСпособаРасчета = 2 или КодСпособаРасчета = 6 тогда
			СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади;
		ИначеЕсли КодСпособаРасчета = 3 тогда
			СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления
		ИначеЕсли КодСпособаРасчета = 4 тогда
			СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
		иначе
			СпособРасчета = СпособРасчетаПоУмолчанию
		КонецЕсли;	
		
		
		Если Не ЗначениеЗаполнено(ЛС) тогда
			Сообщить("Не найден ЛС:" + сокрЛП(Стру.LS));
			Продолжить;
		КонецЕсли;
		
		СтрокаТекУслуги = ТаблТекУслуг.Найти(ЛС);
		Если СтрокаТекУслуги<> Неопределено тогда
			УслугаУжеНазначена = СтрокаТекУслуги.Поставщик = Поставщик и 
				 СтрокаТекУслуги.РежимПотребления = РежимПотребления и 
				 СтрокаТекУслуги.СпособРасчета = СпособРасчета;
				 
			//Соовтетствуют три параметра. 
			//Контроль числа единиц зависит от способа расчета
			Если УслугаУжеНазначена и 
					 (СтрокаТекУслуги.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления или
					  СтрокаТекУслуги.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет) тогда
				УслугаУжеНазначена = СтрокаТекУслуги.КоличествоЕдиницПотребления = ЧислоЕдПотребления; 	  
			КонецЕсли;		  
			
			Если УслугаУжеНазначена тогда
				продолжить;
			КонецЕсли;				
		КонецЕсли;
		
		НовСтрока = ДокОбъект.ЛицевыеСчета.Добавить();
		НовСтрока.Услуга = ДокОбъект.Услуга;		
		НовСтрока.ЛицевойСчет = ЛС;
		НовСтрока.Поставщик = Поставщик;
		НовСтрока.РежимПотребления = РежимПотребления;
		НовСтрока.КоличествоЕдиницПотребления = ЧислоЕдПотребления;
		НовСтрока.СпособРасчета = СпособРасчета;   
		
		Стру.Вставить("Поставщик",Поставщик);
		Стру.Вставить("РежимПотребления",РежимПотребления);
		Стру.Вставить("СпособРасчета",СпособРасчета);
		Стру.Вставить("ПлановаяСтавка",Стру.TAR);
		
	КонецЦикла;;	
	СписокЛС = ДокОбъект.ЛицевыеСчета.Выгрузить(,"ЛицевойСчет").ВыгрузитьКолонку("ЛицевойСчет");
    ДополнитьТаблицуСтавок(ТаблСтавок,Услуга,СписокЛС,НачИндекс,МаксИндекс);
	
	
	НачИндекс = МаксИндекс+1;

КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуСтавок(ТаблСтавок,Услуга,СписокЛС,НачИндекс,МаксИндекс)
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
		|	бит_ЛицевыеСчета.Квартира КАК Квартира
		|ПОМЕСТИТЬ ЛС
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка В(&СписокЛС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛС.Ссылка КАК ЛицевойСчет,
		|	ЛС.Квартира КАК Квартира,
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры
		|ИЗ
		|	ЛС КАК ЛС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
		|				,
		|				Квартира В
		|					(ВЫБРАТЬ
		|						ЛС.Квартира КАК Квартира
		|					ИЗ
		|						ЛС КАК ЛС)) КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО ЛС.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира";
	таблКэш = Запрос.Выполнить().Выгрузить();
	таблКэш.Индексы.Добавить("ЛицевойСчет");
	
	ЗначПропустить = Неопределено;
	СтрокаСтавки = неопределено;
	Для Инд = НачИндекс по МаксИндекс цикл
		Стру = МассивСтру[Инд];     		
		
		Если Стру.Свойство("ПропуститьЭтотЭлемент",ЗначПропустить) и (ЗначПропустить=истина)  тогда
			продолжить
		КонецЕсли;	
		
		Если Стру.РежимПотребления = Справочники.бит_РежимыПотребленияУслуг.НеНачислять тогда
			Стру.ПлановаяСтавка = 0;
	    КонецЕсли;
		
		
		СтрокаКвартиры= ТаблКэш.Найти(Стру.ЛС,"ЛицевойСчет");

		Если СтрокаКвартиры = Неопределено или Стру.ПлановаяСтавка = 0 тогда
			продолжить
		КонецЕсли;
		
		//проверим на дубли с последней строкой 
		Если СтрокаСтавки<>неопределено  и 
				 СтрокаСтавки.Поставщик = Стру.Поставщик и
				 СтрокаСтавки.РежимПотребления = Стру.РежимПотребления и 
				 СтрокаСтавки.ПлановаяСтавка = Стру.ПлановаяСтавка и 
				 СтрокаСтавки.ТипКвартиры = СтрокаКвартиры.ТипКвартиры и 
				 СтрокаСтавки.СтатусКвартиры = СтрокаКвартиры.СтатусКвартиры 
				 тогда
		    продолжить
		КонецЕсли;	
		
		СтрокаСтавки = ТаблСтавок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСтавки,Стру);
		ЗаполнитьЗначенияСвойств(СтрокаСтавки,СтрокаКвартиры);            
		СтрокаСтавки.Тариф = СтрокаСтавки.ПлановаяСтавка; 
		СтрокаСтавки.ОсновнаяСтавка = СтрокаСтавки.ПлановаяСтавка;
		СтрокаСтавки.СверхНормативнаяСтавка = СтрокаСтавки.ПлановаяСтавка;  				
	КонецЦикла;	
	
	ТаблСтавок.Сортировать("Поставщик,РежимПотребления,СпособРасчета,ТипКвартиры,СтатусКвартиры,ПлановаяСтавка УБЫВ");
	ЧислоСтрокСтавок = ТаблСтавок.Количество();
	Для СчетВниз = 1 По ЧислоСтрокСтавок-1 цикл
		ТекСтрока = ТаблСтавок[ЧислоСтрокСтавок-СчетВниз];
		ПредСтрока = ТаблСтавок[ЧислоСтрокСтавок-СчетВниз-1];
		ИзмеренияРавны = ТекСтрока.Поставщик = ПредСтрока.Поставщик и
				 ТекСтрока.РежимПотребления = ПредСтрока.РежимПотребления и 
				 ТекСтрока.ТипКвартиры = ПредСтрока.ТипКвартиры и 
				 ТекСтрока.СтатусКвартиры = ПредСтрока.СтатусКвартиры;
		Если ИзмеренияРавны тогда
			Если  ТекСтрока.ПлановаяСтавка <> ПредСтрока.ПлановаяСтавка тогда
				Текст = "РАЗНЫЕ ЗНАЧЕНИЯ СТАВОК по услуге "+ Услуга+ Символы.ПС +
						"        Режим потр.: " + ТекСтрока.РежимПотребления + "     СпособРасчета: " + ТекСтрока.СпособРасчета + Символы.ПС + 
				        "        ТипКвартиры: " + ТекСтрока.ТипКвартиры + "      СтатусКвартиры: " + ТекСтрока.СтатусКвартиры + Символы.ПС + 
						"		 Ставки  (оставлена большая) " + ТекСтрока.ПлановаяСтавка + " и "+ ПредСтрока.ПлановаяСтавка;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);    				
			КонецЕсли;
			ТаблСтавок.Удалить(ТекСтрока);   
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьРежимыПотребления()
КонецПроцедуры	



&НаСервере
Процедура ДополнитьМассивСтруктурДляУслугНаЛС();
	ЗаполнитьКэшКвартирЛицевыхСчетов();

	СписокУслуг = новый Соответствие;
	Для каждого Стру из МассивСтру цикл
		ЛС = СсылкаЛС(Стру.LS);
		Услуга = УслугаЖКХ(Стру.YSLYGA);
		ИмяРежима = ?(Стру.TAR=0,"не начислять",сокрЛП(Стру.R_POTR));
		Режим = РежимПотребления(ИмяРежима,Стру.TAR);
		Поставщик = ПоставщикУслуги(Услуга);
		
		//дополняем Стру 
		Стру.Вставить("ЛС",ЛС);
		Стру.Вставить("Услуга",Услуга);
		Стру.Вставить("Режим",Режим);
		Стру.Вставить("Поставщик",Поставщик);
		Стру.Вставить("ПлановаяСтавка",Стру.TAR);
		//и формируем список режимов потребления
		Если СписокУслуг[Услуга]=неопределено тогда
			СписокУслуг.Вставить(Услуга,Новый массив);
		КонецЕсли;	
		
		МассивРежимов = СписокУслуг[Услуга];
		Если ложь тогда МассивРежимов = новый массив КонецЕсли;
		Если МассивРежимов.Найти(ИмяРежима) = Неопределено тогда
			МассивРежимов.Добавить(ИмяРежима);
		КонецЕсли;	 	
	КонецЦикла;	
	
	
	//Дополняем режимы услуги из массивов 
	Для каждого КЗ из СписокУслуг цикл
		Услуга = КЗ.Ключ;
		Если ложь тогда Услуга = Справочники.бит_УслугиЖКХ.ПустаяСсылка() КонецЕсли;		
		МассивРежимов = КЗ.Значение;
		
		
		Для Инд =0 по МассивРежимов.ВГраница() цикл			
			ИмяРежима = МассивРежимов[Инд];
			Если не ПустаяСтрока(ИмяРежима) тогда
				МассивРежимов[Инд] = РежимПотребления(ИмяРежима,1); //имя режима, если тариф =0 , уже земенено на "не начислять"
			иначе
				МассивРежимов[Инд] = неопределено;
			КонецЕсли;	
				
		КонецЦикла;	
		
		
		СпрОбъект = Услуга.ПолучитьОбъект();
		РежимыУслуги = Услуга.РежимыПотребленияУслуг.ВыгрузитьКолонку("РежимПотребленияУслуг");
		ЧислоРежимов = РежимыУслуги.Количество();
		Для каждого Режим из МассивРежимов цикл
			Если РежимыУслуги.Найти(Режим) = Неопределено и ЗначениеЗаполнено(Режим) тогда
				РежимыУслуги.Добавить(Режим);
				НовСтрока = СпрОбъект.РежимыПотребленияУслуг.Добавить();
				НовСтрока.РежимПотребленияУслуг = Режим;
			КонецЕсли;	
		КонецЦикла;	
		
		Если СпрОбъект.РежимыПотребленияУслуг.Количество() >ЧислоРежимов тогда
			СпрОбъект.Записать();
		КонецЕсли;			
	КонецЦикла; 	
	
КонецПроцедуры	


&НаСервере
Процедура ПодключитьУслугуКДомам()
	ЗапросДокиУслуг = новый запрос;
	ЗапросДокиУслуг.УстановитьПараметр("Организация",Объект.Организация);	
	ЗапросДокиУслуг.Текст = "ВЫБРАТЬ
	               |	бит_ПодключениеУслугКЗданиям.Ссылка КАК Документ,
	               |	бит_ПодключениеУслугКЗданиям.Услуга КАК Услуга
	               |ИЗ
	               |	Документ.бит_ПодключениеУслугКЗданиям КАК бит_ПодключениеУслугКЗданиям
	               |ГДЕ
	               |	бит_ПодключениеУслугКЗданиям.Организация = &Организация
	               |	И бит_ПодключениеУслугКЗданиям.Проведен";
	ДокиУслуг = ЗапросДокиУслуг.Выполнить().Выгрузить();
	ДокиУслуг.Индексы.Добавить("Услуга");
	
		
	
	Запрос = новый запрос;	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);	
	Запрос.Текст = 
	  	 "ВЫБРАТЬ
	  	 |	бит_ПодключениеУслугКЗданиямАдреса.Ссылка.Услуга КАК Услуга,
	  	 |	бит_ПодключениеУслугКЗданиямАдреса.Здание КАК Здание,
	  	 |	бит_ПодключениеУслугКЗданиямАдреса.Ссылка КАК Документ
	  	 |ПОМЕСТИТЬ ЕстьУслуги
	  	 |ИЗ
	  	 |	Документ.бит_ПодключениеУслугКЗданиям.Адреса КАК бит_ПодключениеУслугКЗданиямАдреса
	  	 |ГДЕ
	  	 |	бит_ПодключениеУслугКЗданиямАдреса.Ссылка.Проведен = ИСТИНА
	  	 |	И бит_ПодключениеУслугКЗданиямАдреса.Ссылка.Организация = &Организация
	  	 |
	  	 |ИНДЕКСИРОВАТЬ ПО
	  	 |	Услуга,
	  	 |	Здание
	  	 |;
	  	 |
	  	 |////////////////////////////////////////////////////////////////////////////////
	  	 |ВЫБРАТЬ
	  	 |	бит_СписокЗданий.Ссылка КАК Здание,
	  	 |	бит_УслугиЖКХ.Ссылка КАК Услуга,
	  	 |	бит_СписокЗданий.Улица КАК Улица
	  	 |ПОМЕСТИТЬ ВсеЗданияУслуги
	  	 |ИЗ
	  	 |	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ,
	  	 |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	  	 |
	  	 |ИНДЕКСИРОВАТЬ ПО
	  	 |	Услуга,
	  	 |	Здание
	  	 |;
	  	 |
	  	 |////////////////////////////////////////////////////////////////////////////////
	  	 |ВЫБРАТЬ
	  	 |	ВсеЗданияУслуги.Здание КАК Здание,
	  	 |	ВсеЗданияУслуги.Услуга КАК Услуга,
	  	 |	ВсеЗданияУслуги.Улица КАК Улица
	  	 |ИЗ
	  	 |	ВсеЗданияУслуги КАК ВсеЗданияУслуги
	  	 |		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьУслуги КАК ЕстьУслуги
	  	 |		ПО ВсеЗданияУслуги.Услуга = ЕстьУслуги.Услуга
	  	 |			И ВсеЗданияУслуги.Здание = ЕстьУслуги.Здание
	  	 |ГДЕ
	  	 |	ЕстьУслуги.Документ ЕСТЬ NULL
	  	 |ИТОГИ ПО
	  	 |	Услуга";
		 
	ВыборкаУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	 
	Пока ВыборкаУ.Следующий() цикл
		СтрокаДок = ДокиУслуг.Найти(ВыборкаУ.Услуга,"Услуга");
		Если СтрокаДок <> неопределено тогда
			ДокОбъект = СтрокаДок.Документ.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		иначе
			ДокОбъект = Документы.бит_ПодключениеУслугКЗданиям.СоздатьДокумент();
			ДокОбъект.Дата = Объект.Дата;
			ДокОбъект.ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ПодключениеУслуги;
			ДокОбъект.Услуга = ВыборкаУ.Услуга;
			ДокОбъект.Организация = Объект.Организация;
			
		КонецЕсли;	
		Выборка = ВыборкаУ.Выбрать();
		Пока Выборка.Следующий() цикл
			НовСтрока = ДокОбъект.Адреса.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,Выборка);
		КонецЦикла;	
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;	
		 
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьУслугиНаДомах(Команда)
	ОбновитьУслугиНаДомахНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьУслугиНаДомахНаСервере()
	// Вставить содержимое обработчика.
	ПодключитьУслугуКДомам();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВводОстатков(Команда)
	УдалитьВводОстатковНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьВводОстатковНаСервере()
	// Вставить содержимое обработчика.
	Выборка = Документы.бит_ВводНачальныхОстатковПоКУ.Выбрать();
	Пока ВЫборка.Следующий() цикл
		ДокОбъект = Выборка.ПолучитьОбъект();
		ДокОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсеУслуги(Команда)
	// Вставить содержимое обработчика.
//	Попытка
		СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"ys*.dbf");
		Для Каждого ИнфоФ из СписокФайлов цикл
			Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
			ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
			
			Если СтрНайти(ЭтаФорма.ИмяФайлаКл,"_pen")<>0 тогда
				продолжить
			КонецЕсли;	
			
			Сообщить("Начата обработка ... "+ИнфоФ.Имя);
			Мас = новый массив(1);          //передаем файл на сервер
			Мас[0] = ЭтаФорма.ИмяФайлаКл;			
			ИмяФайлаОкончаниеВыбора(Мас); 
			
			ПередатьФайлНаСервер();
			ЗагрузитьУслугиЛСНаСервере();	//и обрабатываем файд
			Сообщить("Обработан файл ... "+ИнфоФ.Имя);
		КонецЦикла;	  
		
		ПоказатьОповещениеПользователя("Инфа об услугах загружена");
		
		СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"ns_*.dbf");
		Для Каждого ИнфоФ из СписокФайлов цикл		
			Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
			ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
			
			Если СтрНайти(ЭтаФорма.ИмяФайлаКл,"_peny")<>0 
						или СтрНайти(ЭтаФорма.ИмяФайлаКл,"kap_p")<>0 тогда
				продолжить
			КонецЕсли;	
			
			Сообщить("Начата обработка ... "+ИнфоФ.Имя);
			
			Мас = новый массив(1);          //передаем файл на сервер
			Мас[0] = ЭтаФорма.ИмяФайлаКл;
			ИмяФайлаОкончаниеВыбора(Мас); 
			
			ПередатьФайлНаСервер();
			ЗагрузитьОстаткиЛСНаСервере(); //и обрабатываем файл
			Сообщить("Обработан файл ... "+ИнфоФ.Имя);
		КонецЦикла;	  
		
//	Исключение
//		Сообщить("При загрузке данных услуг была ошибка. Папка : "+ ЭтаФорма.ИмяПапкиКл);
//	КонецПопытки;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПапкиКлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ОписаниеПродолжения = новый ОписаниеОповещения("ИмяПапкиЗавершениеВыбора",ЭтаФорма);
	
	
	Диалог.Показать(ОписаниеПродолжения);	
	
КонецПроцедуры

&НаКлиенте 
Процедура ИмяПапкиЗавершениеВыбора(МассивИмен,ДополнительныеПараметры) экспорт
	Если МассивИмен = Неопределено тогда
		возврат
	КонецЕсли;	
	Если МассивИмен.Количество()>0 тогда
		ЭтаФорма.ИмяПапкиКл = МассивИмен[0];
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьОплатыКУ(Команда)
	УдалитьОплатыКУНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьОплатыКУНаСервере()
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений.лб_ДопСведенияОбОплате.СоздатьНаборЗаписей();
	Если Набор.Отбор.Найти("Документ") = Неопределено тогда
		Набор.Отбор.Добавить("Документ");
		Набор.Отбор.Документ.ВидСравнения = ВидСравнения.Равно;
		Набор.Отбор.Документ.Использование = Истина;
	КонецЕсли;	
	

	
	Выборка = Документы.бит_ОплатаКУ.Выбрать();
	Пока ВЫборка.Следующий() цикл
		Набор.Отбор.Документ.Значение = Выборка.Ссылка;
		Набор.Записать(истина);
		
		ДокОбъект = Выборка.ПолучитьОбъект();
		ДокОбъект.СписокЛС.Очистить();
		ДокОбъект.СписокУслуг.Очистить();
		ДокОбъект.СписокУслугПоПериоду.Очистить();
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ДокОбъект.Удалить();
		
		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗависимыеЛС(Команда)	
	ЗаполнитьЗависимыеЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗависимыеЛСНаСервере()
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ШаблонБЛГ","714%");
	Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		    |ПОМЕСТИТЬ Благополучие
		    |ИЗ
		    |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		    |ГДЕ
		    |	бит_ЛицевыеСчета.Наименование ПОДОБНО &ШаблонБЛГ
		    |;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ
		    |	ИСТИНА КАК Активность,
		    |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		    |	Благополучие.Ссылка КАК ЛицевойСчетЗависимый,
		    |	бит_ЛицевыеСчета.Здание.Код КАК лвбКодЗдания,
		    |	Благополучие.Ссылка.Здание.Код КАК блгКодЗдания
		    |ИЗ
		    |	Благополучие КАК Благополучие
		    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		    |		ПО (ПОДСТРОКА(Благополучие.Ссылка.Наименование, 5, 6) = ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 5, 6))
		    |ГДЕ
		    |	бит_ЛицевыеСчета.Ссылка <> Благополучие.Ссылка";
	Табл = Запрос.Выполнить().Выгрузить();
	
	ЧислоСтрок = Табл.Количество();
	Для СчетВниз=1 по ЧислоСтрок цикл
		СтрокаТЧ = Табл[ЧислоСтрок-СчетВниз];
		Если НЕ СтрНачинаетсяС(СтрокаТЧ.блгКодЗдания, СтрокаТЧ.лвбКодЗдания) тогда
			Табл.Удалить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;	
	
	НаборЗаписей = РегистрыСведений.бит_ЗависимыеЛС.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Табл);
	НаборЗаписей.Записать(Истина);
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсеПроживающих(Команда)
		СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"projiv*.dbf");
		Для Каждого ИнфоФ из СписокФайлов цикл
			Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
			ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
			
			Если СтрНайти(ЭтаФорма.ИмяФайлаКл,"_pen")<>0 тогда
				продолжить
			КонецЕсли;	
			
			Сообщить("Начата обработка ... "+ИнфоФ.Имя);
			Мас = новый массив(1);          //передаем файл на сервер
			Мас[0] = ЭтаФорма.ИмяФайлаКл;			
			ИмяФайлаОкончаниеВыбора(Мас); 
			
			ПередатьФайлНаСервер();
			ЗагрузитьПроживающихНаСервере();	//и обрабатываем файд
			Сообщить("Обработан файл ... "+ИнфоФ.Имя);
		КонецЦикла;	  

КонецПроцедуры


Процедура ЗаполнитьДокиДомов();
	Запрос = новый запрос;  
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_СписокЗданий.Ссылка КАК Ссылка,
	               |	бит_СписокЗданий.Код КАК Код,
	               |	""История проживающих по дому "" + бит_СписокЗданий.Код + "" на 01.01.2019г"" КАК СодержаниеДока,
	               |	бит_СписокЗданий.Организация КАК Организация
	               |ПОМЕСТИТЬ Дома
	               |ИЗ
	               |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОперацияБух.Ссылка КАК Ссылка,
	               |	ОперацияБух.Содержание КАК Содержание,
	               |	ОперацияБух.Организация КАК Организация
	               |ПОМЕСТИТЬ Доки
	               |ИЗ
	               |	Документ.ОперацияБух КАК ОперацияБух
	               |ГДЕ
	               |	ОперацияБух.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Дома.Ссылка КАК Дом,
	               |	Доки.Ссылка КАК ДокСсылка,
	               |	Дома.Организация КАК Организация,
	               |	Дома.СодержаниеДока КАК СодержаниеДока
	               |ИЗ
	               |	Дома КАК Дома
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Доки КАК Доки
	               |		ПО Дома.СодержаниеДока = Доки.Содержание
	               |			И Дома.Организация = Доки.Организация";
	
	мДокиДомов = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаДома из мДокиДомов цикл
		Если не ЗначениеЗаполнено(СтрокаДома.ДокСсылка) тогда
			ДокОбъект = Документы.ОперацияБух.СоздатьДокумент();
			ДокОбъект.Дата = ДобавитьМесяц(Объект.Дата,-6);
			ДокОбъект.Организация = СтрокаДома.Организация;
			ДокОбъект.Содержание = СтрокаДома.СодержаниеДока;
			ДокОбъект.Комментарий = СтрокаДома.СодержаниеДока;
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			СтрокаДома.ДокСсылка = ДокОбъект.Ссылка;
		КонецЕсли;	
	КонецЦикла;	
	мДокиДомов.Колонки.Добавить("Набор");
    мДокиДомов.Индексы.Добавить("Дом");
	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьЖильцовБыстро(Команда)
	// Вставить содержимое обработчика.
	ПередатьФайлНаСервер();
	ЗаполнитьЖильцовБыстроНаСервере();
КонецПроцедуры


&НаСервере
Процедура УдалитьДанныеДругихЛС()
	//Вместо удаления строк - заменяем их на неопределено
	ЧислоСтрок = МассивСтру.Количество();
	Для  Инд=0 по ЧислоСтрок-1 цикл
		Стру = МассивСтру[Инд];
		Если Стру = Неопределено тогда 
			продолжить
		КонецЕсли;
			
		РО = Стру.RODOTN;
		удл1 = "л/с";
		удл2 = "л.с";
		Если (СтрНайти(РО,удл1)>0) или (СтрНайти(РО,удл2)>0) тогда 
			МассивСтру[инд] = неопределено;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры	
&НаСервере
Процедура ЗаполнитьЖильцовБыстроНаСервере();
	ДТ = ТекущаяДата();
	Отчет = "";
	МассивСтру = ЗагрузитьДБФВМассивСтруктур(,истина);
    Отчет = "Число записей = "+МассивСтру.Количество() + Символы.ПС + 
			"  Этап1 - Загрузка: " + (ТекущаяДата()-ДТ) +  " сек." ;
	ДТ = ТекущаяДата(); 
	       

	Если не ЗначениеЗаполнено(мДокиДомов) тогда
		ЗаполнитьДокиДомов();
	КонецЕсли;	   	
	Если Не ЗначениеЗаполнено(мКэшПроживающих) тогда
		ЗаполнитьКэшПроживающих();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(мКэшКвартирЛС) тогда
		ЗаполнитьКэшКвартирЛицевыхСчетов();
	КонецЕсли;
	
	Отчет = Отчет + Символы.ПС + 
			"  Этап2 - Кэширование данных базы: " + (ТекущаяДата()-ДТ) +  " сек." ;
	ДТ = ТекущаяДата(); 
	
	УдалитьДанныеДругихЛС();
	
	
	Отчет = Отчет + Символы.ПС + 
			"  Этап3 - Удаление лишних данных: " + (ТекущаяДата()-ДТ) +  " сек." ;
	ДТ = ТекущаяДата(); 
	
	
	ПодготовитьМассивСтруДляПроживающих();	
	
	Отчет = Отчет + Символы.ПС + 
			"  Этап4 - Подготовка массива: " + (ТекущаяДата()-ДТ) +  " сек." ;
	ДТ = ТекущаяДата(); 
	
	
	
	//СортировкаПузырькомПроживающих2(МассивСтру);
	СортировкаТаблицей(МассивСтру);
	
	Отчет = Отчет + Символы.ПС + 
			"  Этап5 - Сортировка массива: " + (ТекущаяДата()-ДТ) +  " сек." ;
	ДТ = ТекущаяДата(); 

	
	ТекЗданиеКод = неопределено;
	ТекЛС = неопределено;
	ОтработанЛС = ложь;
	ТекФЛ = Неопределено;
	ТекДок = неопределено;
    Набор = неопределено;
	
	ПостояннаяРегистрация  = Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация;
	ВременнаяРегистрация   = Справочники.бит_СтатусФизЛица.ВременнаяРегистрация;
	ОтветственныйНеПроживает = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Ответственный не проживает");
	
	СтрОтветственного = неопределено;
	ЧислоЗаписей = МассивСтру.Количество();
	Для Инд=0 по ЧислоЗаписей-1 цикл
		//Проверим согласиеПД
		Стру = МассивСтру[Инд];
		Если Стру=Неопределено тогда 
			продолжить
		КонецЕсли;	
		ПроверитьОбновитьСогласиеПД(Стру);
		Если ТекЗданиеКод<>Стру.ЗданиеКод тогда   		
						
			СтрокаТекДок = мДокиДомов.Найти(Стру.Здание);
			
			Если СтрокаТекДок<>Неопределено тогда 
				ТекДок = СтрокаТекДок.ДокСсылка;
				ТекЗданиеКод = Стру.ЗданиеКод;
			иначе                                                                               
				Сообщить("Не найден дом с кодом "+Стру.ЗданиеКод);
				Сообщить(Отчет);
				возврат;
			КонецЕсли;					
			Если СтрокаТекДок.Набор = Неопределено тогда
				Набор = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Значение = ТекДок;
				Набор.Отбор.Регистратор.Использование = истина;
				Набор.Очистить();
				Набор.Записать(истина); //для нового дома - очищаем старые записи
				СтрокаТекДок.Набор = набор;
			КонецЕсли;	
		КонецЕсли;	
		
		//Смена ЛС
	
		
		
		Если ТекЛС <>Стру.ЛС тогда
			//произошла смена ЛС, возможно, нужно изменить 
			//строки с ответственным, чтобы был ответственный на ЛС
			Если СтрОтветственного<>Неопределено и 
				 ЗначениеЗаполнено(СтрОтветственного.ДатаСнятияСРегистрации) 
			тогда			    
				 Если СтрОтветственного.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает тогда
					 СтрОтветственного.ДатаСнятияСРегистрации = '0001-01-01';
				 иначе
				 	 СтрОтв2 = Набор.Добавить();
					 ЗаполнитьЗначенияСвойств(СтрОтв2,СтрОтветственного,,"Регистратор");
					 СтрОтв2.ДатаРегистрации = СтрОтв2.ДатаСнятияСРегистрации;
					 СтрОтв2.ДатаСнятияСРегистрации = '0001-01-01';
					 СтрОтв2.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
					 СтрОтв2.СтатусФизЛица = ОтветственныйНеПроживает; 
					 СтрОтв2.Период = Объект.Дата + Набор.Индекс(СтрОтв2);
				 КонецЕсли; 
				 
			КонецЕсли;
			
			//настраиваемся на новый ЛС
			Ответственный = неопределено;	
			СтрОтветственного = неопределено;  		
			ТекЛС = Стру.ЛС;
		КонецЕсли;	 		
		
		Если Не ЗначениеЗаполнено(Стру.ЛС) или Не ЗначениеЗаполнено(Стру.ФЛ) тогда
			продолжить
		КонецЕсли;	
		
		//Добавляем строку ЛС
		СтрокаЖ = Набор.Добавить();				
			//СтрокаЖ.ДатаЗаписи ='0001-01-01'; //Дата окончания статуса
			СтрокаЖ.Период = Объект.Дата + Набор.Индекс(СтрокаЖ);
			СтрокаЖ.Физлицо = Стру.ФЛ;
			СтрокаЖ.ЛицевойСчет = Стру.ЛС;
			СтрокаЖ.ДатаРегистрации = Стру.ДПрописки;
			СтрокаЖ.ДатаСнятияСРегистрации = ?(Стру.ДВыписки>'2500-01-01','0001-01-01',Стру.ДВыписки);
			Строкаж.ВладелецКвартиры = ?(Стру.PR_SOB=1,Перечисления.ДаНет.Да,Перечисления.ДаНет.Нет);
			СтрокаЖ.ДоляПлощади = ?(Стру.D2=0,0,Стру.D1/Стру.D2);
			СтрокаЖ.лб_ДоляПлощадиСтрокой = СокрЛП(Стру.SOBST);
			СтрокаЖ.СтепеньРодства = Стру.СтепеньРодства;
			Если СтрокаЖ.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда
				СтрокаЖ.лб_СтрокаРодствДляФЛС = сокрЛП(Стру.RODOTN);
			КонецЕсли;	
			//Контрагент
			//КудаВыписан
			//КудаВыписанАдрес
			//ОткудаПрибыл
			//ОткудаПрибылАдрес
			//ПравоустанавливающиеДокументы
			//ПричинаВыписки
			//ПричинаПрописки
			СтатусПрож = Стру.STATYS;
			ЭтоСобственник = Стру.PR_SOB=1;
			Если СтатусПрож = "постоянная" тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация;
			ИначеЕсли 	СтатусПрож = "временная" тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.Временно;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.ВременнаяРегистрация;
				
				//Человек не проживает. Варианты - Собственник не проживает, либо человек убран с ЛС
			иначеЕсли  СтрокаЖ.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
				СтрокаЖ.СтатусФизЛица = ОтветственныйНеПроживает;		

			ИначеЕсли ЭтоСобственник тогда
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Владелец не проживает");
			иначе	
				СтрокаЖ.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
				СтрокаЖ.СтатусФизЛица = Справочники.бит_СтатусФизЛица.Выписан;				
			КонецЕсли;	
			///*** - добавить статусы для Саобственник не проживает - на него
			// Если собственник и выписан - меняем на Собственник не проживает
			// если не собственник и выписан - то меняем на Уделен с лицевого счета
			
			
			
		
		
		
	КонецЦикла;	
	
	
	Отчет = Отчет + Символы.ПС + 
			"  Этап6 - Заполнение данных для регистра: " + (ТекущаяДата()-ДТ) +  " сек." ;
	ДТ = ТекущаяДата(); 
	
	
	Для каждого СтрокаТекДок из мДокиДомов цикл
		Если СтрокаТекДок.Набор <> неопределено и 
			 	СтрокаТекДок.Набор.Количество()>0 
		тогда 
			СтрокаТекДок.Набор.Записать(истина);
		КонецЕсли;
	КонецЦикла;	
	
	Отчет = Отчет + Символы.ПС + 
			"  Этап7 - Запись в регистр: " + (ТекущаяДата()-ДТ) +  " сек." ;
	ДТ = ТекущаяДата(); 
	
	
	Сообщить(Отчет+Символы.ПС+Символы.ПС);
КонецПроцедуры	


&НаСервере 
Процедура ПроверитьОбновитьСогласиеПД(Стру)
	Если Стру = неопределено 
			или НЕ ЗначениеЗаполнено(Стру.НовСогласиеПД) 
			или (Стру.НовСогласиеПД = Стру.СогласиеПД)
			или (Стру.СогласиеПД = Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьАбонентскийОтдел) 
			или (Стру.СогласиеПД = Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьПаспортныйСтол)
	тогда
	 	возврат
	КонецЕсли;
	
	СпрОбъект = Стру.ФЛ.ПолучитьОбъект();
	Если ложь тогда СпрОбъект = Справочники.бит_Проживающие.СоздатьЭлемент() КонецЕсли;
	СпрОбъект.лб_СогласиеНаОбработкуПД = Стру.НовСогласиеПД;
	СпрОбъект.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура ТестДокиДомов(Команда)
	ТестДокиДомовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестДокиДомовНаСервере()
	// Вставить содержимое обработчика.
	ЗаполнитьДокиДомов();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЖильцовБыстроВсех(Команда)
	// Вставить содержимое обработчика.
			СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"projiv*.dbf");
		Для Каждого ИнфоФ из СписокФайлов цикл
			Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
			ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
			
			Если СтрНайти(ЭтаФорма.ИмяФайлаКл,"_pen")<>0 тогда
				продолжить
			КонецЕсли;	
			
			Сообщить("Начата обработка ... "+ИнфоФ.Имя);
			Мас = новый массив(1);          //передаем файл на сервер
			Мас[0] = ЭтаФорма.ИмяФайлаКл;			
			ИмяФайлаОкончаниеВыбора(Мас); 
			
			ПередатьФайлНаСервер();
			ЗаполнитьЖильцовБыстроНаСервере(); //и обрабатываем файд
			Сообщить("Обработан файл ... "+ИнфоФ.Имя);
		КонецЦикла;	  

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтветственныхОбнуленныхЛС(Команда)
	ПередатьФайлНаСервер();
	ЗаполнитьОтветственныхОбнуленныхЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственныхОбнуленныхЛСНаСервере()
	// Вставить содержимое обработчика.
	МассивСтру2 = ЗагрузитьДБФВМассивСтруктур();
	Табл = новый таблицаЗначений;               
	Табл.Колонки.Добавить("ИмяЛС",новый ОписаниеТипов("Строка"));
	Табл.Колонки.Добавить("ИмяЛС10",новый ОписаниеТипов("Строка"));

	//Для каждого Стру из МассивСтру2 цикл
	//	Если сокрЛП(Стру.OTV)="0" тогда
	//		НС = Табл.Добавить();
	//		НС.ИмяЛС = сокрЛП(Стру.LS);
	//	КонецЕсли;	
	//КонецЦикла;	
	
	//для ускорения форматируем цикл в одну строку
	Для каждого Стру из МассивСтру2 цикл Если сокрЛП(Стру.OTV)="0" тогда НС = Табл.Добавить();НС.ИмяЛС = сокрЛП(Стру.LS); НС.ИмяЛС10 = лев(НС.ИмяЛС +"         ",10);КонецЕсли;КонецЦикла;	

		
	
	//Запросом отбираем ЛС, на которых никогда не было проживающих
	ЗАпрос = новый запрос;
	Запрос.УстановитьПараметр("Дата1",'2018-12-31');	
	Запрос.УстановитьПараметр("Т",Табл);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Выразить(Т.ИмяЛС как строка(100)) КАК ИмяЛС,
		|	Выразить(Т.ИмяЛС10 как строка(10)) КАК ИмяЛС10
		|ПОМЕСТИТЬ СписокИменЛС
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СписокЛС
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10) В
		|			(ВЫБРАТЬ
		|				СписокИменЛС.ИмяЛС10 КАК ИмяЛС10
		|			ИЗ
		|				СписокИменЛС КАК СписокИменЛС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЛС.Ссылка КАК ЛС,
		|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо, ИСТИНА) КАК Поле1
		|ПОМЕСТИТЬ ПустыеЛС
		|ИЗ
		|	СписокЛС КАК СписокЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|				&Дата1,
		|				ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						СписокЛС.Ссылка КАК Ссылка
		|					ИЗ
		|						СписокЛС КАК СписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ПО СписокЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
		|ГДЕ
		|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо, ИСТИНА) = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИменаОтв.ЛС КАК ЛС,
		|	МИНИМУМ(ИменаОтв.Наименование) КАК Наименование
		|ПОМЕСТИТЬ ЕстьОтв
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПустыеЛС.ЛС КАК ЛС,
		|		бит_Проживающие.Наименование КАК Наименование
		|	ИЗ
		|		ПустыеЛС КАК ПустыеЛС
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие КАК бит_Проживающие
		|			ПО (ПОДСТРОКА(ПустыеЛС.ЛС.Наименование, 1, 10) = ПОДСТРОКА(бит_Проживающие.Наименование, 1, 10))) КАК ИменаОтв
		|
		|СГРУППИРОВАТЬ ПО
		|	ИменаОтв.ЛС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕстьОтв.ЛС КАК ЛС,
		|	ЕстьОтв.Наименование КАК Наименование,
		|	бит_Проживающие.Ссылка КАК ФизЛицо,
		|	ЕстьОтв.ЛС.Наименование КАК ИмяЛС
		|ИЗ
		|	ЕстьОтв КАК ЕстьОтв
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие КАК бит_Проживающие
		|		ПО ЕстьОтв.Наименование = бит_Проживающие.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_Проживающие.Код
		|ИТОГИ
		|	МАКСИМУМ(ИмяЛС)
		|ПО
		|	ЛС";
	ВыборкаЛС = ЗАпрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаЛС.Количество()=0 тогда
		возврат
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Регистратор) тогда
		ДокОбъект = Документы.ОперацияБух.СоздатьДокумент();
		ДокОбъект.Дата = '2018-01-01';
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Регистратор = ДокОбъект.Ссылка;
	КонецЕсли;
	Набор = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Значение = Регистратор;
	
	ОтветственныйНеПроживает = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Ответственный не проживает");
	
	Пока ВыборкаЛС.Следующий() цикл
		ЛС = ВыборкаЛС.ЛС;
		Выборка = ВыборкаЛС.Выбрать();
		Если Выборка.Следующий() тогда
			ФЛ = Выборка.ФизЛицо;
		иначе
			ОбъектФЛ = Справочники.бит_Проживающие.СоздатьЭлемент();
			ОбъектФЛ.Наименование = ВыборкаЛС.ИмяЛС;
			ОбъектФЛ.Записать();
			ФЛ = ОбъектФЛ.Ссылка;
		КонецЕсли;
		Запись = Набор.Добавить();
		Запись.Период = '2018-01-01';
		Запись.ЛицевойСчет = ЛС;
		Запись.ФизЛицо = ФЛ;
		Запись.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
		Запись.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
		Запись.СтатусФизЛица = ОтветственныйНеПроживает;
		Запись.лб_СтрокаРодствДляФЛС = "Данные удалены согласно ФЗ-152"; 		
	КонецЦикла;	
	Набор.Записать(истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравоустанДоки(Команда)
	ПередатьФайлНаСервер();  
	ЗагрузитьПравоустанДокиНаСервере(); 	
	ПоказатьПредупреждение(,"Справочник правоустанавливающих документов заполнен. Можно ставить на ЛС"); 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПравоустанДокиНаСервере()
	// Вставить содержимое обработчика.
	МассивСтру3 = ЗагрузитьДБФВМассивСтруктур();
	Сч=0; 
	НачатьТранзакцию();
	Для каждого Стру из МассивСтру3 цикл
		Сч=Сч+1;
		Если Сч % 100 =0 тогда
			ЗафиксироватьТранзакцию();
			НачатьТранзакцию();
		КонецЕсли;	
		СпрОбъект = Справочники.бит_ПравоустанавливающиеДокументы.СоздатьЭлемент();
		СпрОбъект.Наименование = Стру.ls;
		СпрОбъект.лб_НомерЛС10 = Стру.ls;
		СпрОбъект.лб_ИспользоватьАрхивДляФЛС = истина;
		СпрОбъект.лб_Архив = СокрЛП(Стру.DOK1+Стру.DOK2+Стру.DOK3);
		СпрОбъект.Записать();
	КонецЦикла;	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВРегистреДокиПрава(Команда)
	ЗаполнитьВРегистреДокиПраваНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВРегистреДокиПраваНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПравоустанавливающиеДокументы.лб_НомерЛС10 КАК лб_НомерЛС10,
		|	бит_ПравоустанавливающиеДокументы.Ссылка КАК ПравоустанавливающиеДокументы,
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО (бит_ПравоустанавливающиеДокументы.лб_НомерЛС10 = ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10))";
	Табл = Запрос.Выполнить().Выгрузить();
	Табл.Индексы.Добавить("ЛицевойСчет");
	
	ЗапросР = новый запрос;
	ЗапросР.УстановитьПараметр("Регистратор",ЭтаФорма.Регистратор);
	ЗапросР.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_ПроживающиеПоЛС.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
		|ГДЕ
		|	бит_ПроживающиеПоЛС.Регистратор ССЫЛКА Документ.ОперацияБух
		|	И бит_ПроживающиеПоЛС.ПравоустанавливающиеДокументы = ЗНАЧЕНИЕ(Справочник.бит_ПравоустанавливающиеДокументы.ПустаяСсылка)
		|	И бит_ПроживающиеПоЛС.Регистратор = &Регистратор";
	
	Если не ЗначениеЗаполнено(Регистратор) тогда
		ЗапросР.Текст = СтрЗаменить(ЗапросР.Текст,"И бит_ПроживающиеПоЛС.Регистратор = &Регистратор","");
	КонецЕсли;
	
	ВыборкаР = ЗапросР.Выполнить().Выбрать();
	Пока ВыборкаР.Следующий() цикл  		
		Набор = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Значение = ВыборкаР.Регистратор;
		Набор.Прочитать();
		
		ТекЛС = неопределено;
		ТекД = Табл[0];   		
		
		Для Каждого Зап из Набор цикл 	Если ТекЛС = Зап.ЛицевойСчет тогда СтокаД = ТекД иначе ТекЛС = Зап.ЛицевойСчет; СтрокаД = Табл.Найти(ТекЛС,"ЛицевойСчет") КонецЕсли; Если ТекД <>Неопределено тогда Зап.ПравоустанавливающиеДокументы = ТекД.ПравоустанавливающиеДокументы КонецЕсли; КонецЦикла;
		
		Если Набор.Модифицированность() тогда
			Набор.Записать(Истина)
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыхОтветственных(Команда)
	ЗаполнитьПустыхОтветственныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыхОтветственныхНаСервере()
	// Вставить содержимое обработчика.
	ЗАпрос = новый запрос;
	Запрос.УстановитьПараметр("ОтветственноеЛицо",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(бит_ПроживающиеПоЛС.ФизЛицо, ИСТИНА) КАК ФЛ
	               |ИЗ
	               |	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ПО бит_ПроживающиеПоЛС.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	               |			И (бит_ПроживающиеПоЛС.СтепеньРодства = &ОтветственноеЛицо)
	               |ГДЕ
	               |	ЕСТЬNULL(бит_ПроживающиеПоЛС.ФизЛицо, ИСТИНА) = ИСТИНА";
	Табл = Запрос.Выполнить().Выгрузить();
	
	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ТестЗагрузить(Команда)
	
		СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"*.dbf");
		Для Каждого ИнфоФ из СписокФайлов цикл
			Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
			ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
			
			Сообщить("Начата обработка ... "+ИнфоФ.Имя);
			
			Мас = новый массив(1);          //передаем файл на сервер
			Мас[0] = ЭтаФорма.ИмяФайлаКл;
			ИмяФайлаОкончаниеВыбора(Мас); 
			
			ПередатьФайлНаСервер();
			ТестЗагрузитьНаСервере(Объект.Дата);
			
			Сообщить("Обработан файл ... "+ИнфоФ.Имя);					
		КонецЦикла;	                                  
		
КонецПроцедуры
	

&НаСервере
Процедура ТестЗагрузитьНаСервере(Месяц='0001-01-01')
	// Вставить содержимое обработчика.
	
	ИмяРегистра ="";
	Если СтрНайти(ИмяФайлаКл,"doma")>0 тогда
		ИмяРегистра = "лб_Тест_Дома";
	ИначеЕсли СтрНайти(ИмяФайлаКл,"ls.dbf")>0 или
		      СтрНайти(ИмяФайлаКл,"ls14.dbf") тогда		
		ИмяРегистра = "лб_Тест_ЛС"
	ИначеЕсли СтрНайти(ИмяФайлаКл,"projiv")>0 тогда		
		ИмяРегистра = "лб_Тест_Жильцы" 
	ИначеЕсли СтрНайти(ИмяФайлаКл,"ns_peny")>0 или 
		      СтрНайти(ИмяФайлаКл,"ns_kap_p")>0 тогда		
		ИмяРегистра = "лб_Тест_СальдоПени"
	ИначеЕсли СтрНайти(ИмяФайлаКл,"ns_") >0  тогда		
		ИмяРегистра = "лб_Тест_Сальдо"
	ИначеЕсли СтрНайти(ИмяФайлаКл,"ys_") >0  тогда		
		ИмяРегистра = "лб_Тест_Услуги"                  		
	иначе
		Сообщить("Не могу определить тип файла по имени " + ИмяФайлаКл);
		возврат;
    КонецЕсли;
	
	
	МассивСтру =  ЗагрузитьДБФВМассивСтруктур();
	
	НачатьТранзакцию();
	//Для каждого Стру из МассивСтру цикл
	//	Запись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();		
	//	ЗаполнитьЗначенияСвойств(Запись,Стру);
	//	Запись.Источник = ИмяФайлаКл;
	//	Запись.Записать(истина);	
	//КонецЦикла;
	
	//то же самое, но в одну строку для ускорения
	Счетчик = 0;
	РазмерПартииЗаписей = 500;
	Для каждого Стру из МассивСтру цикл 
		Стру.Вставить("Месяц",Месяц);
		Запись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(Запись,Стру);	//Заполняем измерения
		Перезапись = истина;
		
		//Заполнение совйств проживающих
		//Если Стру.Свойство("RODOTN") тогда			
		//	Запись.Прочитать();                // Читаем данные базы
		//	ДатаПропискиСтру = ДатаИзСтроки(Стру.D_PR);
		//	ДатаПропискиЗап =  ДатаИзСтроки(Запись.D_PR);
		//	
		//	СобственникСтру = ((0+Стру.PR_SOB) = 1);
		//	СобственникЗап  = ((0+Запись.PR_SOB) = 1);
		//	
		//	//Это более новая запись
		//	Если ДатаПропискиСтру>=ДатаПропискиЗап тогда
		//		//данные в стру - новые 
		//		Если СобственникЗап и НЕ СобственникСтру тогда 
		//			//из более старой записи сохраняем данные о собстеннике
		//			ЗаполнитьЗначенияСвойств(Стру,Запись,"PR_SOB,D1,D2,SOBST");
		//		КонецЕсли;	
		//		
		//		//и полготавливаем данные для записи ИЗ Стру				
		//		ЗаполнитьЗначенияСвойств(Запись,Стру);					
		//		
		//	иначе  //в Стру более старая запись
		//		Если СобственникСтру и НЕ СобственникЗап тогда
		//			//данные в базе более новые, чем в стру, но в Стру есть собственник			
		//			//из стру сохраняем данные о собстеннике					
		//			ЗаполнитьЗначенияСвойств(Запись,Стру,"PR_SOB,D1,D2,SOBST");
		//			//и сохраняем в базу
		//			Перезапись = истина; 				
		//		иначе
		//			 //Запись в Стру более старая и та нет записи о собственнике (или она есть в стру и в Запись)
		//			 //отмена перезаписи
		//			Перезапись = ложь
		//		КонецЕсли;	
		//	КонецЕсли;	
		//	
		//КонецЕсли; //Это жильцы		
		
		
		Если перезапись = истина тогда
			Запись.Источник = ИмяФайлаКл; 
			Запись.Записать(истина); 		
		КонецЕсли;	
		Счетчик = Счетчик+1;
		Если Счетчик%РазмерПартииЗаписей=0 тогда 
			ЗафиксироватьТранзакцию();
			НачатьТранзакцию() 
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_СопоставитьЛС(Команда)
	Тест_СопоставитьЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура Тест_СопоставитьЛСНаСервере()
	д1 = ТекущаяДата();
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор.Прочитать();		
	Табл = Набор.Выгрузить();
	
	Табл.Колонки.Удалить("ЛС");
	Табл.Колонки.Удалить("ИмяЛС10");
	
	Запрос = новый Запрос;	
	Запрос.УстановитьПараметр("Табл",Табл);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табл.* 
		|ПОМЕСТИТЬ Т
		|ИЗ
		|	&Табл КАК Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Т.*,
		|	ПОДСТРОКА(Т.LS, 1, 10) КАК ИмяЛС10,
		|	ЕСТЬNULL(бит_ЛицевыеСчета.Ссылка, ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)) КАК ЛС
		|ИЗ
		|	Т КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО (ПОДСТРОКА(Т.LS, 1, 10) = ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10))";
	Т2 = Запрос.Выполнить().Выгрузить();
	
	Если Т2.Количество() = Табл.Количество() тогда	
		Набор.Загрузить(Т2);
		Набор.Записать(истина);
		д2 = ТекущаяДата();
		Сообщить("ЛС - Сопоставлены. Затрачено "+(д2-д1)+ " сек.");		
	иначе
		Сообщить("ЛС - есть дубли в справочнике");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Тест_ПодобратьОрганизацию(Команда)
	Тест_ПодобратьОрганизациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура Тест_ПодобратьОрганизациюНаСервере()
	// Вставить содержимое обработчика.
	ОргБЛГ = Справочники.Организации.НайтиПоНаименованию("Благополучие ООО");
	ОргЛВБ = Справочники.Организации.НайтиПоНаименованию("УК ЛЕВОБЕРЕЖЬЕ ЗАО");
	д1 = ТекущаяДата();
	ПодобратьОрганизации("лб_Тест_Дома",ОргЛВБ,ОргБЛГ,"Благопол");
	ПодобратьОрганизации("лб_Тест_ЛС",ОргЛВБ,ОргБЛГ,"Благопол");
	ПодобратьОрганизации("лб_Тест_Жильцы",ОргЛВБ,ОргБЛГ,"Благопол");	
	д2 = ТекущаяДата();
	Сообщить("Заполнены организации домов и ЛС - шаг1. Заняло времени,сек: "+(д2-д1) );
КонецПроцедуры


&НаСервере
Процедура ПодобратьОрганизации(ИмяРегистра,ОргЛВБ,ОргБЛГ,ПодстрокаБЛГ)
	Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	Набор.Прочитать();
	Табл = Набор.Выгрузить();
	Для каждого Строка из Табл Цикл 
		Строка.Организация = ?(СтрНайти(Строка.Источник,ПодстрокаБЛГ)>0,ОргБЛГ,оргЛВБ) 
	КонецЦикла;
	Набор.Загрузить(Табл);
	Набор.Записать(истина);
КонецПроцедуры

&НаКлиенте
Процедура тест_ПодобратьДома(Команда)
	д1 = ТекущаяДата();
	тест_ПодобратьДомаНаСервере();
	д2 = ТекущаяДата();
	Сообщить("Подобраны дома в регистр домов, заняло "+(д2-д1)+" сек.");
КонецПроцедуры

&НаСервере
Процедура тест_ПодобратьДомаНаСервере()
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений.лб_Тест_Дома.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для каждого Строка из Набор цикл
		Строка.Здание = Справочники.бит_СписокЗданий.НайтиПоКоду(Строка.KOD);
	КонецЦикла;
	Набор.Записать(истина);
КонецПроцедуры

&НаКлиенте
Процедура ТестОчиститьТаблицыДомаЛС(Команда)
	ТестОчиститьТаблицыДомаЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестОчиститьТаблицыДомаЛСНаСервере()
	// Вставить содержимое обработчика.
//	Набор = РегистрыСведений.лб_Тест_Дома.СоздатьНаборЗаписей();
//	Набор.Очистить();
//	Набор.Записать(истина);
	
	Набор = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор.Очистить();
	Набор.Записать(истина);

КонецПроцедуры

&НаКлиенте
Процедура Тест_ПодобратьДомаЛС(Команда)
	Тест_ПодобратьДомаЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура Тест_ПодобратьДомаЛСНаСервере()
	// Вставить содержимое обработчика.
	Набор1 = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор1.Прочитать();
	Табл1 = Набор1.Выгрузить();
	Табл1.Колонки.Удалить("Здание");
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Табл",Табл1);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табл.*
		|ПОМЕСТИТЬ Табл1
		|ИЗ
		|	&Табл КАК Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	лб_Тест_Дома.Здание КАК Здание,
		|	Табл1.*
		|ИЗ
		|	Табл1 КАК Табл1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
		|		ПО Табл1.DOM = лб_Тест_Дома.ADR";
	Табл2 = Запрос.Выполнить().Выгрузить();
	Набор1.Загрузить(Табл2);
	Набор1.Записать(истина);
		
КонецПроцедуры

&НаКлиенте
Процедура Тест_НайтиНомераСуффиксыКвартир(Команда)
	Тест_НайтиНомераСуффиксыКвартирНаСервере();
КонецПроцедуры



&НаСервере
Процедура Тест_НайтиНомераСуффиксыКвартирНаСервере()
	// Вставить содержимое обработчика.
	д1 = ТекущаяДата();
	
	СоздатьТаблицуДляРазделенныхКвартир();
	
	Набор1 = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор1.Прочитать();
	Табл1 = Набор1.Выгрузить();
	Табл1.Индексы.Добавить("Здание,KVARTIRA");
	Табл1.Сортировать("Здание,KVARTIRA");
	Для каждого СтрокаТ из Табл1 цикл
		Если ЗначениеЗаполнено(СтрокаТ.Квартира) или ЗначениеЗаполнено(СтрокаТ.КвНомер) тогда 
			продолжить 
		КонецЕсли;
		ИмяДома = СокрЛП(СТрокаТ.DOM);
		ИмяКвартиры = СокрЛП(СтрокаТ.KVARTIRA);
		
		ЧислоРазделенныхЛС = СтрокаТ.K_LS;
		Если ЧислоРазделенныхЛС>1 тогда
			ИмяКвартиры = ИмяКвартиры+ДополнениеИмениРазделеннойКвартиры(ИмяДома+","+ИмяКвартиры);
		КонецЕсли;	 		
		
		СтруктураНомера   = СтруктураНомераКвартиры(ИмяКвартиры);
		СтрокаТ.КвНомер   = СтруктураНомера.НомерКвартиры;
		СтрокаТ.КвСуффикс = СтруктураНомера.ПрефиксКвартиры;		
		
	КонецЦикла;	
	Набор1.Загрузить(Табл1);
	Набор1.Записать(Истина);
	
	д2 = ТекущаяДата();
	
	Сообщить("Анализ номеров квартир - "+(д2-д1)+ " сек.");		
	
	
КонецПроцедуры




&НаКлиенте
Процедура ТестПодобратьКвартиры(Команда)
	ТестПодобратьКвартирыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестПодобратьКвартирыНаСервере()
	// Вставить содержимое обработчика.
	НачатьТранзакцию();
	Набор1 = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор1.Прочитать();
	Табл1 = Набор1.Выгрузить();
	Набор1.Очистить();
	Набор1.Записать();
	Табл1.Колонки.Удалить("Квартира");
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Табл",Табл1);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табл.Здание КАК Здание,
		|	Табл.КвНомер КАК КвНомер,
		|	Табл.КвСуффикс КАК КвСуффикс, *
		|ПОМЕСТИТЬ Табл1
		|ИЗ
		|	&Табл КАК Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(бит_Квартиры.Ссылка, ЗНАЧЕНИЕ(Справочник.бит_Квартиры.Пустаяссылка)) КАК Квартира,
		|	Табл1.*
		|ИЗ
		|	Табл1 КАК Табл1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
		|		ПО (бит_Квартиры.Владелец = Табл1.Здание)
		|			И (бит_Квартиры.НомерКвартиры = Табл1.КвНомер)
		|			И (бит_Квартиры.ПрефиксКвартиры = Табл1.КвСуффикс)";
	Табл2 = Запрос.Выполнить().Выгрузить();
	Набор1.Загрузить(Табл2);
	Набор1.Записать(истина);
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСоздатьКвартиры(Команда)
	ТестСоздатьКвартирыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестСоздатьКвартирыНаСервере()
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Табл = Набор.Выгрузить();
	Отбор = новый структура("Квартира",Справочники.бит_Квартиры.ПустаяСсылка());	
	МассивСтрок = Табл.НайтиСтроки(Отбор);
	Для каждого СтрокаТ из МассивСтрок цикл  		
		ЗагрузитьКвартируИзСтруктуры2(СтрокаТ);  		
	КонецЦикла;	
	Набор.Загрузить(Табл);
	Набор.Записать(Истина);	
КонецПроцедуры



&НаСервере
Процедура ЗагрузитьКвартируИзСтруктуры2(Стру)
		  
	Здание = Стру.Здание;
	ЛС = Стру.ЛС;
	Если не ЗначениеЗаполнено(ЛС) тогда
		Сообщить("Не найден ЛС :" + Стру.LS);
		возврат
	КонецЕсли;
	
	
	
	НомерПодъезда = Стру.POD;
	ИмяПодъезда    = сокрЛП(НомерПодъезда);
	Этаж         = Стру.ET;	
	КоличествоКомнат = стру.K_KOM;
	КадастровыйНомер = стру.KAD_N;
	КвартираУникГИСЖКХ = "";
	КодПоБТИ = "";
		
	ЕЛСГИСЖКХ 				= СокрЛП(Стру.ELS);
	ИдентификаторЖКУ 		= СокрЛП(Стру.KOD_JKY);
	//КапРемЕЛСГИСЖКХ	 		= "";
	//КапРемИдентификаторЖКУ	= "";
	//КапРемПрефикс			= "";
	
	
	
	ОбъектКвартира  = неопределено;
	ОбъектЛС        = неопределено;
	ОбъектПодъезд   = неопределено;

	
		

	Подъезд = Справочники.бит_Подъезды.НайтиПоНаименованию(ИмяПодъезда,истина,,Здание);
		
	Если Не ЗначениеЗаполнено(Подъезд) тогда
			ПодъездОбъект = Справочники.бит_Подъезды.СоздатьЭлемент();
			ПодъездОбъект.Владелец = Здание; 			
			ПодъездОбъект.КоличествоЭтажей = Этаж;			
			ПодъездОбъект.Наименование = ИмяПодъезда;
			ПодъездОбъект.Записать();
			Подъезд = ПодъездОбъект.Ссылка;
	ИначеЕсли ПустаяСтрока(""+Подъезд) тогда
			ПодъездОбъект = Подъезд.ПолучитьОбъект();
			ПодъездОбъект.Наименование = ИмяПодъезда;
			ПодъездОбъект.Записать();			
	КонецЕсли;	
		
		
	//ИмяКвартиры = СокрЛП(ИмяКвартиры);
	//СтруктураНомера = СтруктураНомераКвартиры(ИмяКвартиры);
	//НаимКвартиры = ""+СтруктураНомера.НомерКвартиры + СтруктураНомера.ПрефиксКвартиры;
	НаимКвартиры = ""+Стру.КвНомер + Стру.КвСуффикс;	
	ИмяКвартиры  = НаимКвартиры;
	Квартира = Справочники.бит_Квартиры.НайтиПоНаименованию(НаимКвартиры,Истина,,Здание);
	
	Если Не ЗначениеЗаполнено(Квартира) тогда
		ОбъектКвартира = Справочники.бит_Квартиры.СоздатьЭлемент();
		ОбъектКвартира.Наименование = НаимКвартиры;
		ОбъектКвартира.Владелец = Стру.Здание;
		ОбъектКвартира.Подъезд = Подъезд;
		ОбъектКвартира.Этаж  = Этаж;
		ОбъектКвартира.НомерКвартиры = Стру.КвНомер;
		ОбъектКвартира.ПрефиксКвартиры = Стру.КвСуффикс;			
		Попытка
			ОбъектКвартира.Записать();
			Квартира = ОбъектКвартира.Ссылка;						
		Исключение
			Квартира = Справочники.бит_Квартиры.НайтиПоНаименованию(НаимКвартиры,Истина,,Здание);
			Стру.Квартира = Квартира;        						
		конецПопытки	
	Иначе
		Стру.Квартира = Квартира;
	КонецЕсли;	
	
		
		//ЛС = Стру.ЛС
		//
		//ЛС = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(ИмяЛС);
		//Если Не ЗначениеЗаполнено(ЛС) тогда
		//	ОбъектЛС = Справочники.бит_ЛицевыеСчета.СоздатьЭлемент();
		//	ОбъектЛС.Наименование = ИмяЛС;
		//	ОбъектЛС.Здание = Здание;
		//	ОбъектЛС.Квартира = Квартира;
		//	ОбъектЛС.Организация = ЛС.Организация;
		//	ОбъектЛС.УлицаЛицевогоСчета = Здание.Улица;
		//	ОбъектЛС.Записать();			
		//	ЛС = ОбъектЛС.Ссылка;
		//КонецЕсли;	
		
		
	//ДанныеЛС = мКэшКвартирЛС.Добавить();
	//ДанныеЛС.ЛС = ЛС;
	//ДанныеЛС.ИмяЛС = ИмяЛС;
	//ДанныеЛС.Здание = Здание;
	//ДанныеЛС.Квартира = Квартира;
	//ДанныеЛС.Подъезд = Подъезд;	
	//ДанныеЛС.Улица = ЛС.УлицаЛицевогоСчета;	
	
	
	
	
	
	Если ложь тогда ОбъектПодъезд = Справочники.бит_Подъезды.СоздатьЭлемент() КонецЕсли;
	Если  ТипЗнч(ПодъездОбъект)= Тип("СправочникОбъект.бит_Подъезды") тогда
		ОбъектПодъезд = ПодъездОбъект
	иначе
		ОбъектПодъезд = Подъезд.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаменитьЕслиНовое(ОбъектПодъезд.Наименование,ИмяПодъезда);
	Если ОбъектПодъезд.КоличествоЭтажей < Этаж тогда
		ОбъектПодъезд.КоличествоЭтажей = Этаж
	КонецЕсли;	
	
	Если ТипЗнч(ОбъектПодъезд) = тип("СправочникОбъект.бит_Квартиры") и ОбъектПодъезд.Модифицированность() тогда
		ОбъектПодъезд.Записать();
	КонецЕсли;	
	
	
	
	// проверка и коррекция данных квартиры
	ЭтоНоваяКвартира = ложь;
	Если ОбъектКвартира = неопределено тогда
		ОбъектКвартира = Квартира.ПолучитьОбъект();
		ЭтоНоваяКвартира = истина;
	КонецЕсли;	
	
	Если ложь тогда ОбъектКвартира = Справочники.бит_Квартиры.СоздатьЭлемент() КонецЕсли;
	
	ЕстьИзменения = ложь;
	Если ЭтоНоваяКвартира или не Объект.ТолькоНовыеОбъекты  тогда
		ЗаменитьЕслиНовое(ОбъектКвартира.Наименование,ИмяКвартиры,ЕстьИзменения);		
		ЗаменитьЕслиНовое(ОбъектКвартира.НомерКвартиры,Стру.КвНомер,ЕстьИзменения);
		ЗаменитьЕслиНовое(ОбъектКвартира.ПрефиксКвартиры,Стру.КвСуффикс,ЕстьИзменения);
		ЗаменитьЕслиНовое(ОбъектКвартира.КоличествоКомнат,КоличествоКомнат,ЕстьИзменения);
		ЗаменитьЕслиНовое(ОбъектКвартира.КадастровыйНомер,КадастровыйНомер,ЕстьИзменения);
		ЗаменитьЕслиНовое(ОбъектКвартира.Подъезд,Подъезд,ЕстьИзменения);
		ЗаменитьЕслиНовое(ОбъектКвартира.Владелец,Стру.Здание,ЕстьИзменения);
		ЗаменитьЕслиНовое(ОбъектКвартира.НомерПодъезда,НомерПодъезда,ЕстьИзменения); 
	КонецЕсли;
	Если ТипЗнч(ОбъектКвартира)=тип("СправочникОбъект.бит_Квартиры") и  ЕстьИзменения тогда
		ОбъектКвартира.Записать();
	КонецЕсли;
	
	
	//Проверка и коррекция данных ЛС
	//Если ОбъектЛС= неопределено тогда
	//	ОбъектЛС = ЛС.ПолучитьОбъект();
	//КонецЕсли;	
	//Если ложь тогда ОбъектЛС = Справочники.бит_ЛицевыеСчета.СоздатьЭлемент() КонецЕсли;
	//
	//ЕстьИзменения = ложь;
	//ЗаменитьЕслиНовое(ОбъектЛС.ЕЛСГИСЖКХ,ЕЛСГИСЖКХ,ЕстьИзменения);
	//ЗаменитьЕслиНовое(ОбъектЛС.Здание,Здание,ЕстьИзменения);
	//ЗаменитьЕслиНовое(ОбъектЛС.ИдентификаторЖКУ,ИдентификаторЖКУ,ЕстьИзменения);
	//ЗаменитьЕслиНовое(ОбъектЛС.Квартира,Стру.Квартира,ЕстьИзменения);
	//ЗаменитьЕслиНовое(ОбъектЛС.Организация,Здание.Организация);
	//ЗаменитьЕслиНовое(ОбъектЛС.ТипЛицевогоСчетаГИСЖКХ,Перечисления.бит_ТипЛицевогоСчетаГИСЖКХ.ЛСУО,ЕстьИзменения);
	//ЗаменитьЕслиНовое(ОбъектЛС.УлицаЛицевогоСчета,Здание.Улица);
	//
	//
	//Если ТипЗнч(ОбъектЛС)=тип("СправочникОбъект.бит_ЛицевыеСчета") и  ЕстьИзменения тогда
	//	ОбъектЛС.Записать();
	//КонецЕсли;
	
	
	//дапись данных квартиры в регистры
	
	ЗагрузитьПериодическиеРеквизитыКвартирыЛС(Стру,Квартира,ЛС);	
	
КонецПроцедуры	                                           

&НаКлиенте
Процедура ТестОбновитьКвартирыЛицСчетов(Команда)
	ТестОбновитьКвартирыЛицСчетовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестОбновитьКвартирыЛицСчетовНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый запрос;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	лб_Тест_ЛС.ЛС КАК ЛС,
		 |	лб_Тест_ЛС.ЛС.Квартира КАК ЛСКвартира,
		 |	лб_Тест_ЛС.ЛС.Здание КАК ЛСЗдание,
		 |	лб_Тест_ЛС.Квартира КАК Квартира,
		 |	лб_Тест_ЛС.Здание КАК Здание,
		 |	лб_Тест_ЛС.LS КАК LS,
		 |	лб_Тест_ЛС.Здание.Организация КАК Организация,
		 |	лб_Тест_ЛС.Здание.Улица КАК УлицаЛицевогоСчета
		 |ИЗ
		 |	РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС
		 |ГДЕ
		 |	лб_Тест_ЛС.Квартира <> лб_Тест_ЛС.ЛС.Квартира";
	Выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() цикл
		Запись = РегистрыСведений.лб_Тест_ЛС.СоздатьМенеджерЗаписи();
		Запись.LS = Выборка.LS;
		Запись.Прочитать();
		Если не ЗначениеЗаполнено(Запись.ЛС) или не ЗначениеЗаполнено(Запись.Квартира) тогда
			продолжить
		КонецЕсли;	
		Если Запись.Квартира = Выборка.ЛСКвартира тогда		
			продолжить
		КонецЕсли;
		
		СпрОбъект = Запись.ЛС.ПолучитьОбъект();
		СпрОбъект.ОбменДанными.Загрузка = истина;
		ЗаполнитьЗначенияСвойств(СпрОбъект,Выборка,"Квартира,Здание,УлицаЛицевогоСчета,Организация");
		СпрОбъект.Записать();
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестОбновитьОрганизации(Команда)
	ТестОбновитьОрганизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестОбновитьОрганизацииНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_Тест_Дома.Здание КАК Элем,
		|	лб_Тест_Дома.Организация КАК Организация,
		|	лб_Тест_Дома.Источник КАК Источник
		|ИЗ
		|	РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
		|ГДЕ
		|	лб_Тест_Дома.Здание.Организация <> лб_Тест_Дома.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	лб_Тест_ЛС.ЛС,
		|	лб_Тест_ЛС.Организация,
		|	лб_Тест_ЛС.Источник
		|ИЗ
		|	РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС
		|ГДЕ
		|	лб_Тест_ЛС.ЛС.Организация <> лб_Тест_ЛС.Организация";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		СпрОбъект = Выборка.Элем.ПолучитьОбъект();
		СпрОбъект.Организация = Выборка.Организация;
		СпрОбъект.Записать();
	КонецЦикла;	
	
		
	
	
КонецПроцедуры



&НаКлиенте
Процедура ТестОбновитьПлощадиЛС(Команда)
	ТестОбновитьПлощадиЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестОбновитьПлощадиЛСНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_Тест_ЛС.LS КАК LS,
	               |	лб_Тест_ЛС.ИмяЛС10 КАК ИмяЛС10,
	               |	лб_Тест_ЛС.ЛС КАК ЛС,
	               |	лб_Тест_ЛС.Квартира КАК Квартира,
	               |	лб_Тест_ЛС.КвНомер КАК КвНомер,
	               |	лб_Тест_ЛС.КвСуффикс КАК КвСуффикс,
	               |	лб_Тест_ЛС.Здание КАК Здание,
	               |	лб_Тест_ЛС.ФИО КАК ФИО,
	               |	лб_Тест_ЛС.Ответственный КАК Ответственный,
	               |	лб_Тест_ЛС.СтатусКвартиры КАК СтатусКвартиры,
	               |	лб_Тест_ЛС.ТипКвартиры КАК ТипКвартиры,
	               |	лб_Тест_ЛС.Организация КАК Организация,
	               |	лб_Тест_ЛС.Источник КАК Источник,
	               |	лб_Тест_ЛС.DOM КАК DOM,
	               |	лб_Тест_ЛС.KVARTIRA КАК KVARTIRA,
	               |	лб_Тест_ЛС.KV КАК KV,
	               |	лб_Тест_ЛС.N_KV КАК N_KV,
	               |	лб_Тест_ЛС.SYF_KV КАК SYF_KV,
	               |	лб_Тест_ЛС.OTV КАК OTV,
	               |	лб_Тест_ЛС.STATYS КАК STATYS,
	               |	лб_Тест_ЛС.TIP КАК TIP,
	               |	лб_Тест_ЛС.NE_V_NACH КАК NE_V_NACH,
	               |	лб_Тест_ЛС.NE_V_SUM КАК NE_V_SUM,
	               |	лб_Тест_ЛС.POD КАК POD,
	               |	лб_Тест_ЛС.ET КАК ET,
	               |	лб_Тест_ЛС.ELS КАК ELS,
	               |	лб_Тест_ЛС.KOD_JKY КАК KOD_JKY,
	               |	лб_Тест_ЛС.KAD_N КАК KAD_N,
	               |	лб_Тест_ЛС.PL_OB КАК PL_OB,
	               |	лб_Тест_ЛС.PL_JIL КАК PL_JIL,
	               |	лб_Тест_ЛС.PL_KAP КАК PL_KAP,
	               |	лб_Тест_ЛС.K_KOM КАК K_KOM,
	               |	лб_Тест_ЛС.PR КАК PR,
	               |	лб_Тест_ЛС.V_POT КАК V_POT,
	               |	лб_Тест_ЛС.TEL КАК TEL,
	               |	лб_Тест_ЛС.TAR КАК TAR,
	               |	лб_Тест_ЛС.TIP_KV КАК TIP_KV,
	               |	лб_Тест_ЛС.K_LS КАК K_LS,
	               |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	               |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	               |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры1,
	               |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры1,
	               |	бит_СведенияОКвартиреСрезПоследних.ВысотаПотолков КАК ВысотаПотолков,
	               |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
	               |	бит_СведенияОКвартиреСрезПоследних.лб_ИгнорироватьСальдоСвоихУслуг КАК лб_ИгнорироватьСальдоСвоихУслуг,
	               |	бит_СведенияОКвартиреСрезПоследних.лб_НеВыводитьСтрокуДомофон КАК лб_НеВыводитьСтрокуДомофон,
	               |	бит_СведенияОКвартиреСрезПоследних.лб_ПлощадьКапремонта КАК лб_ПлощадьКапремонта,
	               |	ВЫБОР
	               |		КОГДА лб_Тест_ЛС.PL_OB = бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
	               |				И лб_Тест_ЛС.PL_JIL = бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь
	               |				И бит_СведенияОКвартиреСрезПоследних.ТипКвартиры = лб_Тест_ЛС.ТипКвартиры
	               |				И бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры = лб_Тест_ЛС.СтатусКвартиры
	               |				И бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = лб_Тест_ЛС.KVARTIRA
	               |				И лб_Тест_ЛС.PL_KAP = бит_СведенияОКвартиреСрезПоследних.лб_ПлощадьКапремонта
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПлощадиРавны
	               |ПОМЕСТИТЬ Табл
	               |ИЗ
	               |	РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(ДАТАВРЕМЯ(2019, 1, 1), ) КАК бит_СведенияОКвартиреСрезПоследних
	               |		ПО лб_Тест_ЛС.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Табл.Квартира КАК Квартира,
	               |	Табл.СтатусКвартиры КАК СтатусКвартиры,
	               |	Табл.ТипКвартиры КАК ТипКвартиры,
	               |	Табл.Источник КАК Источник,
	               |	ПОДСТРОКА(Табл.KVARTIRA, 1, 1024) КАК лб_ПредставлениеКвартиры,
	               |	ВЫБОР
	               |		КОГДА Табл.NE_V_NACH = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК лб_НеВыводитьСтрокуДомофон,
	               |	ВЫБОР
	               |		КОГДА Табл.NE_V_SUM = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК лб_ИгнорироватьСальдоСвоихУслуг,
	               |	Табл.V_POT КАК ВысотаПотолков,
	               |	Табл.TEL КАК лб_Телефон,
	               |	Табл.TAR КАК TAR,
	               |	Табл.TIP_KV КАК TIP_KV,
	               |	Табл.K_LS КАК K_LS,
	               |	Табл.PL_OB КАК ОбщаяПлощадь,
	               |	Табл.PL_JIL КАК ЖилаяПлощадь,
	               |	Табл.PL_KAP КАК лб_ПлощадьКапремонта,
	               |	Табл.ПлощадиРавны КАК ПлощадиРавны
	               |ИЗ
	               |	Табл КАК Табл
	               |ГДЕ
	               |	Табл.ПлощадиРавны = ЛОЖЬ И (PL_OB + PL_JIL + PL_KAP >0)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Запись = РегистрыСведений.бит_СведенияОКвартире.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Если Запись.ОбщаяПлощадь + Запись.ЖилаяПлощадь + Запись.лб_ПлощадьКапремонта = 0 тогда
			продолжить
		КонецЕсли;	
		
		Запись.Период = Дата(2018,12,1);
		Запись.лб_ПредставлениеКвартиры = СокрЛП(Запись.лб_ПредставлениеКвартиры);
		Запись.Записать(истина);
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура ТестЗаполнитьСтатусыТипыКвартир(Команда)
	ТестЗаполнитьСтатусыТипыКвартирНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестЗаполнитьСтатусыТипыКвартирНаСервере()
	// Вставить содержимое обработчика.
	
	ТипыКвартир = новый Массив(5);
	ТипыКвартир[1] = Справочники.бит_ТипыКвартиры.Отдельная;
	ТипыКвартир[2] = Справочники.бит_ТипыКвартиры.Коммунальная;
	ТипыКвартир[3] = Справочники.бит_ТипыКвартиры.НежилоеПомещение;
	ТипыКвартир[4] = Справочники.бит_ТипыКвартиры.ОбщежитиеПоквартирноеИлиПокомнатноеЗаселение;
		
	//Если КодТипаКвартиры = 1 тогда
	//	ТипКвартиры = Справочники.бит_ТипыКвартиры.Отдельная
	//ИначеЕсли КодТипаКвартиры = 2 тогда
	//	ТипКвартиры = Справочники.бит_ТипыКвартиры.Коммунальная
	//ИначеЕсли КодТипаКвартиры = 3 тогда
	//	ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение
	//ИначеЕсли КодТипаКвартиры = 4 тогда
	//	ТипКвартиры = Справочники.бит_ТипыКвартиры.ОбщежитиеПоквартирноеИлиПокомнатноеЗаселение
	//иначе	
	//	ТипКвартиры	= Справочники.бит_ТипыКвартиры.ПустаяСсылка()
	//КонецЕсли;	
	
	
	СтатусыКвартир = новый массив(4);
	СтатусыКвартир[1] = Справочники.бит_СтатусыКвартиры.Приватизированная;
	СтатусыКвартир[2] = Справочники.бит_СтатусыКвартиры.Неприватизированная;
	СтатусыКвартир[3] = Справочники.бит_СтатусыКвартиры.Государственный;
	
	
	
	//КодСтатусаКвартиры 
	// 1 - Частная собственность, 2 - Муниципальная, 3 - Государственная

	//Если КодСтатусаКвартиры =1 тогда
	//	СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Приватизированная
	//ИначеЕсли КодСтатусаКвартиры =2 тогда
	//	СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Неприватизированная
	//ИначеЕсли КодСтатусаКвартиры = 3 тогда
	//	СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Государственный
	//КонецЕсли;
	

	Набор = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для Каждого Запись из Набор цикл Запись.СтатусКвартиры = СтатусыКвартир[Запись.STATYS]; Запись.ТипКвартиры= ТипыКвартир[Запись.TIP] КонецЦикла;
	Набор.Записать(истина);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсеПени(Команда)
	// Вставить содержимое обработчика.
		СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"ns_peny*.dbf");
		СписокФайлов2  = НайтиФайлы(ИмяПапкиКл,"ns_kap_p*.dbf");
		Для каждого ИнфоФайла из СписокФайлов2 цикл
			СписокФайлов.Добавить(ИнфоФайла);
		КонецЦикла;	
			
		Для Каждого ИнфоФ из СписокФайлов цикл		
			Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
			ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
			
			
			Сообщить("Начата обработка ... "+ИнфоФ.Имя);
			
			Мас = новый массив(1);          //передаем файл на сервер
			Мас[0] = ЭтаФорма.ИмяФайлаКл;
			ИмяФайлаОкончаниеВыбора(Мас); 
			
			ПередатьФайлНаСервер();
			ЗагрузитьОстаткиПениНаСервере(); //и обрабатываем файл
			Сообщить("Обработан файл ... "+ИнфоФ.Имя);
		КонецЦикла;	  

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьОстаткиПениНаСервере()
	// Вставить содержимое обработчика.
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();	

	ЗаполнитьКэшКвартирЛицевыхСчетов();
	
	
	ДобавитьПодучасткиВМассивСтру();
	
	ОбработаноЭлементов = 0;
	ЧислоСтрокВДокумненте = 0;  //если =0, то группирируем в документы по подучасткам  Стру.Подучасток, идущим подряд
	Подучасток = ""; 
	Пока ОбработаноЭлементов<МассивСтру.Количество()  цикл				
		ДокОбъект = Документы.бит_ВводНачальныхОстатковПениПоКУ.СоздатьДокумент();
		ДокОбъект.Дата = КонецДня(Объект.Дата);
		ДокОбъект.Организация = Объект.Организация;		
		ЗаполнитьСтрокиДокументаОстаткиПениКУ(ДокОбъект,ОбработаноЭлементов,ЧислоСтрокВДокумненте,Подучасток);
		Если ДокОбъект.СписокЛС.Количество() >0 тогда
			ПозСлэша = СтрНайти(ЭтаФорма.ИмяФайлаКл,"\",НаправлениеПоиска.СКонца,,2);
			ИмяФ = ?(ПозСлэша=0,ЭтаФорма.ИмяФайлаКл,Сред(ЭтаФорма.ИмяФайлаКл,ПозСлэша+1));
			Если ПустаяСтрока(Подучасток) или (Подучасток = Неопределено) тогда
				ДокОбъект.Комментарий = "Из файла " + ИмяФ;
			иначе
				ДокОбъект.Комментарий = "Подуч "+Подучасток + " из файла " + ИмяФ; 
			КонецЕсли;	
			ДокОбъект.СуммаДокумента = ДокОбъект.СписокЛС.Итог("Сумма");	
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);				
		иначе	
			Сообщить("В файле "+ ЭтаФорма.ИмяФайлаКл + " нет ненулевых строк");
		КонецЕсли;	
	Конеццикла;	
	
	
	
КонецПроцедуры



&НаСервере
Процедура  ЗаполнитьСтрокиДокументаОстаткиПениКУ(ДокОбъект,НачИндекс, ЧислоСтрокВДокументе,ТекПодучасток);
	Если ложь тогда ДокОбъект = Документы.бит_ВводНачальныхОстатковПениПоКУ.СоздатьДокумент(); КонецЕсли;
	Если ТипЗнч(МассивСтру)<>Тип("Массив") тогда 
		возврат
	КонецЕсли;	
	Счет76КУ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.КУ");
	Счет000  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("000");
	
	
	//Определим загружаемые элементы МассивСтру
	ВГраница = МассивСтру.ВГраница();
	Если ЧислоСтрокВДокументе =0 и НачИндекс<=ВГраница тогда
		ТекПодучасток = МассивСтру[НачИндекс].Подучасток;				
		Для МаксИндекс = НачИндекс+1 по ВГраница цикл
			Если МассивСтру[МаксИндекс].Подучасток<>ТекПодучасток тогда
				прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если (МаксИндекс>ВГраница) или  (МассивСтру[МаксИндекс].Подучасток<>ТекПодучасток) тогда
			МаксИндекс = МаксИндекс-1;
		КонецЕсли;	              		
	иначе		
		МаксИндекс = мин(НачИндекс + ЧислоСтрокВДокументе-1,МассивСтру.ВГраница());			
	КонецЕсли;
	
	Для Инд = НачИндекс по МаксИндекс цикл	  		
		Стру = МассивСтру[Инд]; 
		ЛС = СсылкаЛС(Стру.LS);		
		Услуга = УслугаЖКХ(Стру.YSL);
		Сумма = стру.SALDO;
		Если Сумма = 0 тогда
			продолжить
		КонецЕсли;;	
		Если Не ЗначениеЗаполнено(ЛС) тогда
			Сообщить("Не найден ЛС:" + сокрЛП(Стру.LS));
			Продолжить;
		КонецЕсли;
		
		НовСтрока = ДокОбъект.СписокЛС.Добавить();
		НовСтрока.ЛицевойСчет = ЛС;
		НовСтрока.Услуга = Услуга;
		НовСтрока.СальдоНаЛС = Сумма;
		НовСтрока.СчетКУ = Счет000;
		НовСтрока.СчетАбонента = Счет76КУ;
		НовСтрока.Субконто1 = ЛС;
		НовСтрока.Субконто2 = Услуга;
		НовСтрока.Сумма = Сумма;  
		НовСтрока.СуммаДолга = Сумма;	
	КонецЦикла;;	
	
	НачИндекс = МаксИндекс+1;
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьУслугуКР(Команда)
	ПередатьФайлНаСервер();
	ЗагрузитьУслугиЛСНаСервере("КР"); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьУслугуРФКР(Команда)
	ПередатьФайлНаСервер();
	ЗагрузитьУслугиЛСНаСервере("РФКР");
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеУслугиПоСпискуЛС(Команда)
	ПередатьФайлНаСервер();
	ОтключитьВсеУслугиПоСпискуЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтключитьВсеУслугиПоСпискуЛСНаСервере()
	// Вставить содержимое обработчика.
	
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();
	ТаблЛС = новый ТаблицаЗначений;
	ТаблЛС.Колонки.Добавить("ИмяЛС10",новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки(10,ДопустимаяДлина.Переменная)));
	МассивИменЛС = новый массив(МассивСтру.Количество());
	ЧислоСтру = МассивСтру.Количество();
	Для инд = 0 по ЧислоСтру -1 цикл
		НовСтрока = ТаблЛС.Добавить();
		НовСтрока.ИмяЛС10 = МассивСтру[инд].LS;		
	КонецЦикла;	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ТаблИ",ТаблЛС);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблИ.ИмяЛС10 КАК ИмяЛС10
		|ПОМЕСТИТЬ ТаблИменЛС
		|ИЗ
		|	&ТаблИ КАК ТаблИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛС
		|ИЗ
		|	ТаблИменЛС КАК ТаблИменЛС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО (ПОДСТРОКА(ТаблИменЛС.ИмяЛС10, 1, 10) = ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10))";
	
	МассивЛС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЛС");
	
	РежимНеНачислять = Справочники.бит_РежимыПотребленияУслуг.НеНачислять;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("СписокЛС", МассивЛС);
	Запрос.УстановитьПараметр("НеНачислять",Справочники.бит_РежимыПотребленияУслуг.НеНачислять);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
		|	&НеНачислять КАК РежимПотребления
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(ДАТАВРЕМЯ(2019, 1, 1), ЛицевойСчет В (&СписокЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления <> &НеНачислять
		|ИТОГИ ПО
		|	Услуга";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока выборка.Следующий() цикл
		
		
		Док = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент();
		Док.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета;
		Док.Дата = Дата(2018,12,27);
		
		
		Док.Комментарий = "Отключение услуг ЛС из файла "+ ЭтаФорма.ИмяФайлаКл;
		Док.Услуга = Выборка.Услуга;
		
		ВыборкаЛС = Выборка.Выбрать();
		Пока ВыборкаЛС.Следующий() цикл
			НовСтрока = Док.ЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,ВыборкаЛС);
		КонецЦикла;	
		
		Док.Записать(РежимЗаписиДокумента.Запись);
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;	
		
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестЖильцыПодобратьЛС(Команда)
	ТестЖильцыПодобратьЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестЖильцыПодобратьЛСНаСервере()
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для каждого Строка из Набор цикл Строка.ИмяЛС10 = лев(Строка.LS,10)	КонецЦикла;	
	Набор.Записать(истина);

    Запрос = новый запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   лб_Тест_Жильцы.Месяц,
		|	лб_Тест_Жильцы.LS КАК LS,
		|	лб_Тест_Жильцы.FIO КАК FIO,
		|	лб_Тест_Жильцы.NAME КАК NAME,
		|	лб_Тест_Жильцы.OTCH КАК OTCH,
		|	лб_Тест_Жильцы.D_R КАК D_R,
		|	лб_Тест_Жильцы.Игнорировать КАК Игнорировать,
		|	лб_Тест_Жильцы.КлючЖильца КАК КлючЖильца,
		|	лб_Тест_Жильцы.Жилец КАК Жилец,
		|	лб_Тест_Жильцы.ИмяЛС10 КАК ИмяЛС10,
		|	лб_Тест_Жильцы.СтатусФизлица КАК СтатусФизлица,
		|	лб_Тест_Жильцы.Источник КАК Источник,
		|	лб_Тест_Жильцы.Организация КАК Организация,
		|	лб_Тест_Жильцы.SNILS КАК SNILS,
		|	лб_Тест_Жильцы.PR_SOB КАК PR_SOB,
		|	лб_Тест_Жильцы.D1 КАК D1,
		|	лб_Тест_Жильцы.D2 КАК D2,
		|	лб_Тест_Жильцы.D_PR КАК D_PR,
		|	лб_Тест_Жильцы.D_V КАК D_V,
		|	лб_Тест_Жильцы.FAKT_PR КАК FAKT_PR,
		|	лб_Тест_Жильцы.REG_VR КАК REG_VR,
		|	лб_Тест_Жильцы.REG_POST КАК REG_POST,
		|	лб_Тест_Жильцы.FAKT_ADR КАК FAKT_ADR,
		|	лб_Тест_Жильцы.SOGL КАК SOGL,
		|	лб_Тест_Жильцы.DK КАК DK,
		|	лб_Тест_Жильцы.RODOTN КАК RODOTN,
		|	лб_Тест_Жильцы.PR КАК PR,
		|	лб_Тест_Жильцы.STATYS КАК STATYS,
		|	лб_Тест_Жильцы.RO КАК RO,
		|	лб_Тест_Жильцы.SOBST КАК SOBST,
		|	лб_Тест_Жильцы.SOGL1 КАК SOGL1,
		|	лб_Тест_Жильцы.KV_K КАК KV_K,
		|	лб_Тест_Жильцы.DOM КАК DOM,
		|	лб_Тест_Жильцы.KVART КАК KVART,
		|	лб_Тест_Жильцы.TAR КАК TAR,
		|	лб_Тест_ЛС.ЛС КАК ЛС
		|ИЗ
		|	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС
		|		ПО лб_Тест_ЛС.ИмяЛС10 = лб_Тест_Жильцы.ИмяЛС10";
	
	
	АльтернативныйТекстЗапроса = 
		"ВЫБРАТЬ
		|	лб_Тест_Жильцы.Месяц КАК Месяц,
		|	лб_Тест_Жильцы.LS КАК LS,
		|	лб_Тест_Жильцы.FIO КАК FIO,
		|	лб_Тест_Жильцы.NAME КАК NAME,
		|	лб_Тест_Жильцы.OTCH КАК OTCH,
		|	лб_Тест_Жильцы.D_R КАК D_R,
		|	лб_Тест_Жильцы.Игнорировать КАК Игнорировать,
		|	лб_Тест_Жильцы.КлючЖильца КАК КлючЖильца,
		|	лб_Тест_Жильцы.Жилец КАК Жилец,
		|	лб_Тест_Жильцы.ИмяЛС10 КАК ИмяЛС10,
		|	лб_Тест_Жильцы.СтатусФизлица КАК СтатусФизлица,
		|	лб_Тест_Жильцы.Источник КАК Источник,
		|	лб_Тест_Жильцы.Организация КАК Организация,
		|	лб_Тест_Жильцы.SNILS КАК SNILS,
		|	лб_Тест_Жильцы.PR_SOB КАК PR_SOB,
		|	лб_Тест_Жильцы.D1 КАК D1,
		|	лб_Тест_Жильцы.D2 КАК D2,
		|	лб_Тест_Жильцы.D_PR КАК D_PR,
		|	лб_Тест_Жильцы.D_V КАК D_V,
		|	лб_Тест_Жильцы.FAKT_PR КАК FAKT_PR,
		|	лб_Тест_Жильцы.REG_VR КАК REG_VR,
		|	лб_Тест_Жильцы.REG_POST КАК REG_POST,
		|	лб_Тест_Жильцы.FAKT_ADR КАК FAKT_ADR,
		|	лб_Тест_Жильцы.SOGL КАК SOGL,
		|	лб_Тест_Жильцы.DK КАК DK,
		|	лб_Тест_Жильцы.RODOTN КАК RODOTN,
		|	лб_Тест_Жильцы.PR КАК PR,
		|	лб_Тест_Жильцы.STATYS КАК STATYS,
		|	лб_Тест_Жильцы.RO КАК RO,
		|	лб_Тест_Жильцы.SOBST КАК SOBST,
		|	лб_Тест_Жильцы.SOGL1 КАК SOGL1,
		|	лб_Тест_Жильцы.KV_K КАК KV_K,
		|	лб_Тест_Жильцы.DOM КАК DOM,
		|	лб_Тест_Жильцы.KVART КАК KVART,
		|	лб_Тест_Жильцы.TAR КАК TAR,
		|	СправочникЛС.Ссылка КАК ЛС
		|ИЗ
		|	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК СправочникЛС
		|		ПО (ПОДСТРОКА(СправочникЛС.Наименование, 1, 10) = ПОДСТРОКА(лб_Тест_Жильцы.ИмяЛС10, 1, 10))";
	Запрос.Текст = АльтернативныйТекстЗапроса;
	
	
	Табл = Запрос.Выполнить().Выгрузить();
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	Набор.Загрузить(Табл);
	Набор.Записать(истина);


КонецПроцедуры

&НаКлиенте
Процедура ТестЖильцыПодобратьЖильцов(Команда)
	ТестЖильцыПодобратьЖильцовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестЖильцыПодобратьЖильцовНаСервере()
	// Вставить содержимое обработчика.
	//ПодберемДатуРождения
	Д1 = ТекущаяДата();
	ЗаполнитьДатыРождения();	
	Д2 = ТекущаяДата();
	Сообщить("Заполнение дат - "+ (Д2-Д1)+" сек.");
	
	Д1 = ТекущаяДата();
	ПодобратьЖильцовПоФИО();
	Д2 = ТекущаяДата();
	Сообщить("Подбор жильцов - "+ (Д2-Д1)+" сек.");
	
КонецПроцедуры

Процедура ЗаполнитьДатыРождения()
	
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для каждого Запись из Набор Цикл
		Если ЗначениеЗаполнено(Запись.ДатаРождения) тогда 
			продолжить 
		КонецЕсли;
		Если Запись.D_R = "  .  .    " тогда 
			ДатаРождения = '0001-01-01'
		Иначе
			Год = сред(Запись.D_R,7,4);
			День = лев(Запись.D_R,2);
			Если Прав(день,1)>"0" и лев(день,1)=" " тогда
				День = "0"+прав(день,1);
			КонецЕсли;	
			Месяц = сред(Запись.D_R,4,2);
			Если Год<"1900" или Год > "2030" или 
				 День<"01" или День>"31" или
				 Месяц<"01" или Месяц>"12" 
			тогда
			     ДатаРождения = '0001-01-01'
			иначе
				 ДатаРождения = Дата(""+Год+Месяц+День)
			КонецЕсли;			
		КонецЕсли;	
		Если ДатаРождения<>Запись.ДатаРождения тогда
			Запись.ДатаРождения =ДатаРождения
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Набор.Модифицированность() тогда
		Набор.Записать(истина);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПодобратьЖильцовПоФИО();
	 Запрос = новый запрос;
	 Запрос.Текст = 
	 	"ВЫБРАТЬ
	 	|	бит_Проживающие.Ссылка КАК Ссылка,
	 	|	бит_Проживающие.ДатаРождения КАК ДатаРождения,
	 	|	бит_Проживающие.Наименование КАК Наименование
	 	|ИЗ
	 	|	Справочник.бит_Проживающие КАК бит_Проживающие
	 	|
	 	|УПОРЯДОЧИТЬ ПО
	 	|	Наименование,
	 	|	ДатаРождения УБЫВ";
	 Табл = Запрос.Выполнить().Выгрузить();
	 Табл.Индексы.Добавить("Наименование");
	 Табл.Индексы.Добавить("ДатаРождения");
	 
	 Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	 Набор.Прочитать();
	 МаксИндекс = Набор.Количество()-1;
	 Для Инд = 0 по МаксИндекс цикл
		 Запись = набор[инд];
		 ФИО = СокрЛП(Запись.FIO)+ " "+ СокрЛП(Запись.NAME)+ " "+ СокрЛП(Запись.OTCH);
		 ФИО = СокрЛП(ФИО);
		 ПервыйСимв = врег(Лев(ФИО,1));
		 Буквы = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"+"ABCDEFGHIJKLNMPQRSTUVWXYZ";
		 ЦифрыИВопрос = "0123456789?";
	     ЭтоРеальныйЧеловек = СтрНайти(Буквы,ПервыйСимв)>0; 		
		 ЭтоОбезличенный    = СтрНайти(ЦифрыИВопрос,ПервыйСимв)>0;
		 Если НЕ ЭтоРеальныйЧеловек и не ЭтоОбезличенный тогда
			 Сообщить("Найдено транное ФИО : "+ФИО);
		 КонецЕсли;	 
		 
		 Если ЭтоОбезличенный тогда 			 
			 продолжить
		 КонецЕсли;	 
		 
		 Проживающий = Справочники.бит_Проживающие.ПустаяСсылка();
		 Отбор = новый структура("Наименование",ФИО);
		 СтрокиФИО = Табл.НайтиСтроки(Отбор);
		 Для каждого СтрокаФИО из СтрокиФИО цикл
			 Если Запись.ДатаРождения = '0001-01-01' 
				  или СтрокаФИО.ДатаРождения = Запись.ДатаРождения 
				  или СтрокаФИО.ДатаРождения = '0001-01-01' 
			 тогда	
			      Проживающий = СтрокаФИО.Ссылка;
			 КонецЕсли;
		 КонецЦикла;	 
		 
		 Если Запись.Жилец<>Проживающий тогда
		 	Запись.Жилец = Проживающий;
		 КонецЕсли;	
	 КонецЦикла;	 
	 
	 Если Набор.Модифицированность() тогда
		 Набор.Записать(истина);
	 КонецЕсли;	 
	 
	
 КонецПроцедуры

&НаКлиенте
 Процедура ТестЖильцыУбратьДругиеЛС(Команда)
	 ТестЖильцыУбратьДругиеЛСНаСервере();
 КонецПроцедуры

&НаСервере
 Процедура ТестЖильцыУбратьДругиеЛСНаСервере()
	 // Вставить содержимое обработчика.
	 Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	 Набор.Прочитать();
	
	 Для каждого Запись из Набор цикл 
		 ЭтоДругойЛС = неопределено;
		 СтепеньРО = Запись.RODOTN;
		 Если СтрНайти(нрег(СтепеньРО),"др") = 0 тогда
			 ЭтоДругойЛС = ложь
		 ИначеЕсли СтрНайти(нрег(СтепеньРО),"сч") = 0 
			 		и СтрНайти(нрег(СтепеньРО),"л/с")=0 
					и СтрНайти(нрег(СтепеньРО),"л.с") = 0 
		 тогда	 
			 ЭтоДругойЛС = ложь
		 иначе
			 ЭтоДругойЛС = истина;
		 КонецЕсли;	 
		 
		 Если Запись.Игнорировать<>ЭтоДругойЛС тогда
			 Запись.Игнорировать = ЭтоДругойЛС
 		 КонецЕсли;	 	 
	 КонецЦикла;
	 
	 Если Набор.Модифицированность() тогда
		 Набор.Записать(истина)
	 КонецЕсли;	 
		 
 КонецПроцедуры

&НаСервере
 Процедура Тест_ПодобратьОтветственныхЛСНаСервере()
	 // Вставить содержимое обработчика.
	 Набор = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	 Набор.Прочитать();
	 
	 Запрос = новый запрос;
	 Запрос.Текст = 
	 	 "ВЫБРАТЬ
	 	 |	лб_Тест_Жильцы.ЛС КАК ЛС,
	 	 |	лб_Тест_Жильцы.Жилец КАК Жилец,
	 	 |	лб_Тест_Жильцы.Жилец.Наименование КАК ФИО,
	 	 |	лб_Тест_Жильцы.ДатаРождения КАК ДатаРождения
	 	 |ИЗ
	 	 |	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы";
	 Табл = Запрос.Выполнить().Выгрузить();
	 Табл.Индексы.Добавить("ЛС,ФИО");
	 Табл.Индексы.Добавить("ФИО");
	 
	 	 
	 
	 
	 ЧислоСтрок = Набор.Количество();
	 Для Инд=0 по ЧислоСтрок-1 цикл	
		  
		 Запись = Набор[Инд];
		 СтрокаОтв = СокрЛП(Запись.OTV);
		 
		 Если ЗначениеЗаполнено(Запись.Ответственный) тогда
			 продолжить
		 КонецЕсли;	 
		 
		 Если СтрНайти("0123456789?",лев(СтрокаОтв,1))=0 тогда
			 Отбор = новый структура("ЛС,ФИО",Запись.ЛС,СтрокаОтв);		
			 Строки = Табл.НайтиСтроки(Отбор);
			 Если Строки.Количество()>0 тогда
				 Ответственный = Строки[0].Жилец;
			 КонецЕсли;
		 КонецЕсли;
		 
		 Если Не ЗначениеЗаполнено(Ответственный) тогда
			 Ответственный = Справочники.бит_Проживающие.НайтиПоНаименованию(СтрокаОтв,"ФИО");
		 КонецЕсли;	 
			 
		 
		 Если Запись.Ответственный <>Ответственный тогда
			 Запись.Ответственный = Ответственный;
		 КонецЕсли;
		 
		 
	 КонецЦикла;	 
	 
	 Если НАбор.Модифицированность() тогда
		 Набор.Записать(истина);
	 КонецЕсли;	 
	 
	 
 КонецПроцедуры

&НаКлиенте
Процедура Тест_ПодобратьОтветственныхЛС(Команда)
	Д1 = ТекущаяДата();
	Тест_ПодобратьОтветственныхЛСНаСервере();
	Д2 = ТекущаяДата();
	Сообщить("Подбор ответственных " + (Д2-Д1)+" сек");   		
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_ВыверкаОтветственных(Команда)
	Тест_ВыверкаОтветственныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура Тест_ВыверкаОтветственныхНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	Запрос.УстановитьПараметр("Ответственный",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	Запрос.УстановитьПараметр("НетЖильца",Справочники.бит_Проживающие.ПустаяСсылка());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
		|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
		|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства
		|ПОМЕСТИТЬ ТекДанные
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекДанные.ЛицевойСчет КАК ЛицевойСчет,
		|	ТекДанные.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ТекОтветственные
		|ИЗ
		|	ТекДанные КАК ТекДанные
		|ГДЕ
		|	ТекДанные.ДатаРегистрации <= &Дата
		|	И (ТекДанные.ДатаСнятияСРегистрации >= &Дата
		|			ИЛИ ТекДанные.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И ТекДанные.СтепеньРодства = &Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	лб_Тест_ЛС.ЛС КАК ЛС,
		|	лб_Тест_ЛС.Ответственный КАК ТестОтветственный,
		|	ЕСТЬNULL(ТекОтветственные.ФизЛицо, &НетЖильца) КАК ТекОтветственный
		|ПОМЕСТИТЬ РасширДанные
		|ИЗ
		|	РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТекОтветственные КАК ТекОтветственные
		|		ПО лб_Тест_ЛС.ЛС = ТекОтветственные.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасширДанные.ЛС КАК ЛС,
		|	РасширДанные.ТекОтветственный КАК ТекОтветственный,
		|	РасширДанные.ТестОтветственный КАК ТестОтветственный
		|ИЗ
		|	РасширДанные КАК РасширДанные
		|ГДЕ
		|	РасширДанные.ТестОтветственный <> РасширДанные.ТекОтветственный";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	НетОтветственного =0;
	НеверныйОтветственный = 0; 
	Для Каждого СтрокаТ из Табл цикл
		Если ЗначениеЗаполнено(СтрокаТ.ТекОтветственный) тогда
			НеверныйОтветственный = НеверныйОтветственный + 1
		иначе 
			НетОтветственного =	НетОтветственного +1;		
		КонецЕсли;	
	КонецЦикла;		
	
	
	Сообщить("Неверных Ответственных : " + Табл.Количество() +
	       " новых/неверных "+ НетОтветственного + " / "+ НеверныйОтветственный	);

	Табл.Свернуть("ЛС");
	Сообщить("Различных ЛС: " + Табл.Количество());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестЗагрузитьДанныеМесяца(Команда)
		СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"*.dbf");
		
		ТестЗагрузитьДанныеМесяцаОчиститьРегистр();
		
		
		Для Каждого ИнфоФ из СписокФайлов цикл
			Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
			
			//исключаем лишние файлы
			Если лев(ИнфоФ.Имя,2)<>"ys" или 
				 лев(ИнфоФ.Имя,7)="ys_peny"  
			тогда
				 продолжить
			КонецЕсли;	 
			 
			 
			 
			ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
			
			Сообщить("Начата обработка ... "+ИнфоФ.Имя);
			
			Мас = новый массив(1);          //передаем файл на сервер
			Мас[0] = ЭтаФорма.ИмяФайлаКл;
			ИмяФайлаОкончаниеВыбора(Мас); 
			
			ПередатьФайлНаСервер();
			ТестЗагрузитьНаСервере(НачалоМесяца(Объект.Дата));
			
			Сообщить("Обработан файл ... "+ИнфоФ.Имя);					
		КонецЦикла;	                                  
	
КонецПроцедуры

&НаСервере
Процедура ТестЗагрузитьДанныеМесяцаОчиститьРегистр()
	
	Перем НАбор;
	
	НАбор = РегистрыСведений.лб_Тест_Услуги.СоздатьНаборЗаписей();
	//Набор.Отбор.Добавить("Месяц");
	Набор.Отбор.Месяц.Использование = истина;
	Набор.Отбор.Месяц.Значение = Объект.Дата;
	Набор.Отбор.Месяц.ВидСравнения = ВидСравнения.Равно;
	Набор.Прочитать();
	Набор.Очистить();  	
	НАбор.Записать(истина);

КонецПроцедуры

&НаКлиенте
Процедура Тест2_СопоставитьЛС(Команда)
	Тест2_СопоставитьЛСНаСервере("лб_Тест_Услуги");
КонецПроцедуры

&НаСервере
Процедура Тест2_СопоставитьЛСНаСервере(ИмяРегистра="лб_Тест_Сальдо")
		д1 = ТекущаяДата();
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	Набор.Прочитать();		
	Табл = Набор.Выгрузить();
	
	Табл.Колонки.Удалить("ЛС");
	
	
	ЕстьКолонкаИмяЛС10 = Табл.Колонки.Найти("ИмяЛС10")<>неопределено;
	
	Если ЕстьКолонкаИмяЛС10 тогда
		
		Табл.Колонки.Удалить("ИмяЛС10");
	КонецЕсли;	
	
	Запрос = новый Запрос;	
	Запрос.УстановитьПараметр("Табл",Табл);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табл.* 
		|ПОМЕСТИТЬ Т
		|ИЗ
		|	&Табл КАК Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Т.*,
		|	ПОДСТРОКА(Т.LS, 1, 10) КАК ИмяЛС10,
		|	ЕСТЬNULL(бит_ЛицевыеСчета.Ссылка, ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)) КАК ЛС
		|ИЗ
		|	Т КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО (ПОДСТРОКА(Т.LS, 1, 10) = ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10))";
	Т2 = Запрос.Выполнить().Выгрузить();
	
	Если Т2.Количество() = Табл.Количество() тогда	
		Набор.Загрузить(Т2);
		Набор.Записать(истина);
		д2 = ТекущаяДата();
		Сообщить("ЛС - Сопоставлены. Затрачено "+(д2-д1)+ " сек.");		
	иначе
		Сообщить("ЛС - есть дубли в справочнике");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Тест2_ПодобратьУслуги(Команда)
	д1 = ТекущаяДата();
	
	Тест2_ПодобратьУслугиНаСервере();
	
	д2 = ТекущаяДата();
	Сообщить("Услуги - Сопоставлены. Затрачено "+(д2-д1)+ " сек.");		
	
КонецПроцедуры

&НаСервере
Процедура Тест2_ПодобратьУслугиНаСервере()
	// Вставить содержимое обработчика.
	//Набор = РегистрыСведений.лб_Тест_Сальдо.СоздатьНаборЗаписей();
	//Набор.Прочитать();
	//Для каждого Запись из Набор цикл Запись.Услуга = УслугаЖКХ(Запись.YSL) КонецЦикла;
	//Набор.Записать(истина);
	
	Набор = РегистрыСведений.лб_Тест_Услуги.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для каждого Запись из Набор цикл Запись.Услуга = УслугаЖКХ(Запись.YSLYGA); Если не ЗначениеЗаполнено(Запись.YSLYGA) тогда Запись.YSLYGA= "---" КонецЕсли  КонецЦикла;
	ЧислоЗап = Набор.Количество();
	
	
	Набор.Записать(истина);

	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУслугиНеНачислятьНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ ИмеющиесяУслугуЛС
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(, Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛС,
		|	бит_ЛицевыеСчета.Здание.Участок КАК Подучасток,
		|	бит_ЛицевыеСчета.Организация КАК Организация
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИмеющиесяУслугуЛС КАК ИмеющиесяУслугуЛС
		|		ПО бит_ЛицевыеСчета.Ссылка = ИмеющиесяУслугуЛС.ЛицевойСчет
		|ГДЕ
		|	ИмеющиесяУслугуЛС.ЛицевойСчет ЕСТЬ NULL
		|ИТОГИ ПО
		|	Организация,
		|	Подучасток";
	
	ВыборкаУслуга = Справочники.бит_УслугиЖКХ.Выбрать();
	Пока ВыборкаУслуга.Следующий() цикл
		Услуга = ВыборкаУслуга.Ссылка;
		Если Услуга.ПометкаУдаления или Услуга.Поставщики.Количество()=0 тогда
			продолжить
		КонецЕсли;	
		Запрос.УстановитьПараметр("Услуга",Услуга);
		РезультатЗапроса = Запрос.Выполнить();	
		Если РезультатЗапроса.Пустой() тогда
			продолжить
		КонецЕсли;
		
		Поставщик = Услуга.Поставщики[0];
		СпособРасчета = Услуга.ОсновнойСпособРасчета;
		РежимПотребления = Справочники.бит_РежимыПотребленияУслуг.НеНачислять;

		ВыборкаОрганизация =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизация.Следующий() цикл
			ВыборкаПодучасток = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПодучасток.Следующий() цикл
				Док = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент();
				Док.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета;
				Док.Услуга = ВыборкаПодучасток.Услуга;
				Док.Дата = '2018-12-30';
				Док.Комментарий = "Установка БЕЗ НАЧИСЛЕНИЙ для ЛС подучасток" + ВыборкаПодучасток.Подучасток;
				Табл = Док.ЛицевыеСчета.Выгрузить(); 
				
				ВыборкаЛС = ВыборкаПодучасток.Выбрать();
				Пока ВыборкаЛС.Следующий() цикл НовСтрока = Табл.Добавить(); НовСтрока.ЛицевойСчет = ВыборкаЛС.ЛС; КонецЦикла;
				
				Табл.ЗаполнитьЗначения(Поставщик,"Поставщик");
				Табл.ЗаполнитьЗначения(РежимПотребления,"РежимПотребления");
				Табл.ЗаполнитьЗначения(СпособРасчета,"СпособРасчета");
				Док.ЛицевыеСчета.Загрузить(Табл);
				//Док.Записать(РежимЗаписиДокумента.Запись);
				Док.Записать(РежимЗаписиДокумента.Проведение);   		
							
			КонецЦикла;	//документ
		КонецЦикла;	//организация	
		
	КонецЦикла;
	
	
	
	
	
	
	ВыборкаУслуга = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаУслуга.Следующий() цикл
		Услуга =  ВыборкаУслуга.Услуга;
		Если ложь тогда Услуга = Справочники.бит_УслугиЖКХ.Выбрать().Ссылка КонецЕсли;
	КонецЦикла;	//услуга
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьУслугиНеНачислять(Команда)
	ОбновитьУслугиНеНачислятьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПени(Команда)
	// Вставить содержимое обработчика.
	ПередатьФайлНаСервер();
	ЗагрузитьОстаткиПениНаСервере(); //и обрабатываем файл
	Сообщить("Обработан файл ... "+Символы.ПС+ЭтаФорма.ИмяФайлаКл);

КонецПроцедуры

&НаКлиенте
Процедура Тест2_ЗагрузитьДанныеЖильцов(Команда)
	Д1 = ТекущаяДата();
	ПередатьФайлНаСервер();
	ДополнитьЛицевыеДаннымиЖильцов();
	Д2 = ТекущаяДата();
	Сообщить("Загрузка данных о жильцах ЛС : заняло "+(Д2-Д1) +" сек.");
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьЛицевыеДаннымиЖильцов()
	// Вставить содержимое обработчика.
	МассивСтру =  ЗагрузитьДБФВМассивСтруктур();
	
	Набор = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Табл = Набор.Выгрузить();
	Табл.Индексы.Добавить("ИмяЛС10");
	
	// Цикз делаем одной строкой
	//Для Каждого Стру из МассивСтру цикл
	//	СтрокаТ = Табл.Найти(лев(Стру.LS,10),"ИмяЛС10"); 
	//	Если СтрокаТ<>Неопределено тогда
	//		ЗаполнитьЗначенияСвойств(СтрокаТ,Стру,"K_JIL,K_SOB,OTVETST");
	//	КонецЕсли;			
	//КонецЦикла;	
	
	Для Каждого Стру из МассивСтру цикл	СтрокаТ = Табл.Найти(лев(Стру.LS,10),"ИмяЛС10"); Если СтрокаТ<>Неопределено тогда ЗаполнитьЗначенияСвойств(СтрокаТ,Стру,"K_JIL,K_SOB,OTVETST"); СтрокаТ.ИсточникЖ = ЭтаФорма.ИмяФайлаКл	КонецЕсли; КонецЦикла;	

	Набор.Загрузить(Табл);
	
	Набор.Записать(истина);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Тест2_ПоправитьЧислоСобств(Команда)
	Тест2_ПоправитьЧислоСобствНаСервере();
КонецПроцедуры

&НаСервере
Процедура Тест2_ПоправитьЧислоСобствНаСервере()
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для каждого Запись из Набор Цикл Если ТипЗнч(Запись.K_SOB) = тип("Строка") тогда Запись.K_SOB = ?(ПустаяСтрока(Запись.K_SOB),0,Число(Запись.K_SOB))	КонецЕсли; КонецЦикла;	
	Набор.Записать(истина);
	Сообщить("Поправлена колонка собственников")
КонецПроцедуры


&НаСервере
Процедура Тест2_ОчиститьЖильцовНаСервере()
	// Вставить содержимое обработчика.
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	Набор.Очистить();
	Набор.Записать(истина);
КонецПроцедуры


&НаКлиенте
Процедура Тест2_ОчиститьЖильцов(Команда)
	Тест2_ОчиститьЖильцовНаСервере();
КонецПроцедуры



&НаСервере
Процедура КоррекцияЖильцовНаСервере()
	Д1 = ТекущаяДата();
	
	Счетчик = 1000; //количество обрабатываемых домов
	Сч=0;
	
	НаборП=Неопределено; //НаборП - набор проводок
	ТаблП= неопределено; //ТаблП = НаборП.Выгрузить();
	
	НаборИсх = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	НаборИсх.Прочитать();
	ТаблИсх = НаборИсх.Выгрузить();
	ТаблИсх.Индексы.Добавить("ЛС");
	НаборИсх = неопределено;
	
	//Список статусов ФЛ
	ПроживаетПостоянно   	 = Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация;
	ПроживаетВременно    	 = Справочники.бит_СтатусФизЛица.ВременнаяРегистрация;	
	СобственникНеПроживает 	 = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Владелец не проживает");
	ОтветственныйНеПроживает = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Ответственный не проживает");
	УдаленСЛС 				 = Справочники.бит_СтатусФизЛица.Выписан;
	
	
	////Запрос эталон ЛС 
	//ЗапросЛС = новый запрос;
	//ЗапросЛС.Текст = 
	//	"ВЫБРАТЬ
	//	|	лб_Тест_ЛС.ЛС КАК ЛС,
	//	|	лб_Тест_ЛС.Ответственный КАК Ответственный,
	//	|	лб_Тест_ЛС.OTV КАК OTV,
	//	|	лб_Тест_ЛС.OTVETST КАК OTVETST,
	//	|	лб_Тест_ЛС.K_JIL КАК K_JIL,
	//	|	лб_Тест_ЛС.K_SOB КАК K_SOB,
	//	|	лб_Тест_ЛС.TAR КАК TAR
	//	|ИЗ
	//	|	РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС";
	//ТаблЛС = ЗапросЛС.Выполнить().Выгрузить();
	//ТаблЛС.Индексы.Добавить("ЛС");
	//
	
	
	
	
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Дата",КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("НеПроживает",Перечисления.бит_СтатусПроживания.НеПроживает);
	Запрос.УстановитьПараметр("Ответственный",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	ЗАпрос.Текст =  ТекстЗапросаСравнитьЖильцов();
	ВыборкаЗдания = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Д2 = ТекущаяДата();
	Сообщить("Подговтока таблиц = "+ (д2-д1)+ " сек.");
	
	
	Пока ВыборкаЗдания.Следующий()и Сч<Счетчик  Цикл
		Если НаборП<>Неопределено тогда
			НаборП.Загрузить(ТаблП);
			НаборП.Записать(истина);
		КонецЕсли;	
		Выборка = ВыборкаЗдания.Выбрать();
		Сообщить("    Обработка здания: "+ ВыборкаЗдания.Здание.Код + " -  ( "+Выборка.Количество()+ " л/с)" );
		ДокРегистратор = неопределено;
		Пока Выборка.Следующий() цикл		
			Если ДокРегистратор = неопределено тогда
				Запрос = новый запрос;
				Запрос.УстановитьПараметр("ЛС",Выборка.ЛС);
				Запрос.Текст = 
					 "ВЫБРАТЬ ПЕРВЫЕ 1
					 |	бит_ПроживающиеПоЛС.Регистратор КАК Регистратор
					 |ИЗ
					 |	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
					 |ГДЕ
					 |	бит_ПроживающиеПоЛС.ЛицевойСчет = &ЛС
					 |  и Регистратор Ссылка Документ.ОперацияБух
					 |
					 |УПОРЯДОЧИТЬ ПО
					 |	бит_ПроживающиеПоЛС.Регистратор.Дата УБЫВ";
				ВыборкаДок = Запрос.Выполнить().Выбрать();
				Если ВыборкаДок.Следующий() тогда
					ДокРегистратор = ВыборкаДок.Регистратор;
				иначе
					ДокОбъект = Документы.ОперацияБух.СоздатьДокумент();
					ДокОбъект.Дата = '2018-07-01';
					ДокОбъект.Организация = Выборка.ЛС.Организация;
					ДокОбъект.Содержание = "Данные по проживающим, дом "+Выборка.Здание.Код;
					ДокОбъект.Комментарий = ДокОбъект.Содержание;
					ДокОбъект.Записать();
					ДокРегистратор = ДокОбъект.Ссылка;					
				КонецЕсли;	
				НаборП = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
				НаборП.Отбор.Регистратор.Значение = ДокРегистратор;
				НаборП.Прочитать();
				ТаблП = НаборП.Выгрузить();
			КонецЕсли;	
			
						
			//обработка данных ЛС
			
			//СтрокаЛС = ТаблЛС.Найти(Выборка.ЛС,"ЛС");
			
			//Убираем старые записи
			Отбор = новый структура("ЛицевойСчет",Выборка.ЛС);
			СтрокиЛС = ТаблП.НайтиСтроки(Отбор);
			
			//Сообщить("ЛС " + Выборка.ЛС + " НАйдено записей - "+ СтрокиЛС.Количество());
			//Удаляем исходные строки
			Для каждого Строка из СтрокиЛС цикл
				Инд = ТаблП.Индекс(Строка);
				ТаблП.Удалить(Инд);			
			КонецЦикла;	        
			
			
						
			ОтборИсх = новый Структура("ЛС,Игнорировать",Выборка.ЛС,ложь);
			СтрокиИсх = ТаблИсх.НайтиСтроки(ОтборИсх);
			ТаблИсхЛС = ТаблИсх.Скопировать(СтрокиИсх);
			Если ложь тогда ТаблИсхЛС = новый ТаблицаЗначений КонецЕсли;
			ТаблИсхЛС.Сортировать("Жилец,ДатаПрописки");
			
			
			
			
			ЧислоСтрок = ТаблИсхЛС.Количество();
			Если Выборка.TAR = 0 тогда
				//Выбираем только ответственного и ставим ему "Ответственный не проживает"
				//без указания прописки и выписки
				
				 НовЗапись = ТаблП.Добавить();
				 НовЗапись.ЛицевойСчет   = Выборка.ЛС;
				 НовЗапись.ФизЛицо       = Выборка.ОтветственныйЭ;
				 НовЗапись.Период 		 = НаборП.Отбор.Регистратор.Значение.Дата;
				 НовЗапись.Активность = Истина;
				 НовЗапись.ВладелецКвартиры 	= Перечисления.ДаНет.Нет;
				 НовЗапись.СтатусФизЛица		= ОтветственныйНеПроживает;					
				 НовЗапись.СтепеньРодства       = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
				 НовЗапись.СтатусПроживания     = Перечисления.бит_СтатусПроживания.НеПроживает;
				 НовЗапись.ДатаРегистрации      = '0001-01-01';
				 НовЗапись.ДатаСнятияСРегистрации = '0001-01-01';
				 //НовЗапись.ДатаЗаписи             =  //дата окнчания действия 
				 НовЗапись.ДоляПлощади            = 0;
				 НовЗапись.лб_ДоляПлощадиСтрокой  = 0;
				 НовЗапись.лб_СтрокаРодствДляФЛС  = "л/с закрыт"							   
				
			 иначе
				//Найдем строку ответственного с самой большой датой
				СтрокаТекОтветственного = неопределено;
				ДатаПропискиОтветственного = '0001-01-01';			
				Для Индекс=0 по ТаблИсхЛС.Количество()-1 цикл
					ТекСтрока = ТаблИсхЛС[Индекс];
					Если ложь тогда ТекСтрока = РегистрыСведений.лб_Тест_Жильцы.СоздатьМенеджерЗаписи();  КонецЕсли;					
					Если ТекСтрока.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо и 
						 ТекСтрока.ДатаПрописки >=ДатаПропискиОтветственного 
					тогда
						 СтрокаТекОтветственного = ТекСтрока;
						 ДатаПропискиОтветственного = ТекСтрока.ДатаПрописки;
					КонецЕсли;	 
				КонецЦикла;	
				Если СтрокаТекОтветственного = неопределено тогда
					//вообще нет ответственного - добавляем ответственного сразу в регистр
					 НовЗапись = ТаблП.Добавить();
					 НовЗапись.ЛицевойСчет   = Выборка.ЛС;
					 НовЗапись.ФизЛицо       = Выборка.ОтветственныйЭ;
					 НовЗапись.Период 		 = НаборП.Отбор.Регистратор.Значение.Дата - 24*3600; //на день раньше
					 НовЗапись.Активность = Истина;
					 НовЗапись.ВладелецКвартиры 	= Перечисления.ДаНет.Нет;
					 НовЗапись.СтатусФизЛица		= ОтветственныйНеПроживает;					
					 НовЗапись.СтепеньРодства       = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
					 НовЗапись.СтатусПроживания     = Перечисления.бит_СтатусПроживания.НеПроживает;
					 НовЗапись.ДатаРегистрации      = '0001-01-01';
					 НовЗапись.ДатаСнятияСРегистрации = '0001-01-01';
					 //НовЗапись.ДатаЗаписи             =  //дата окнчания действия 
					 НовЗапись.ДоляПлощади            = 0;
					 НовЗапись.лб_ДоляПлощадиСтрокой  = 0;
					 НовЗапись.лб_СтрокаРодствДляФЛС  = "авто";
				ИначеЕсли  СтрокаТекОтветственного.ДатаВыписки<>'0001-01-01' тогда
					 //Был ответственный, но ушел с л/с
					 ИндексОтв = ТаблИсхЛС.Индекс(СтрокаТекОтветственного);
					 Если ИндексОтв <ТаблИсхЛС.Количество()-1 тогда
						НовСтрока =  ТаблИсхЛС.Вставить(ИндексОтв+1);
					 иначе
						НовСтрока =  ТаблИсхЛС.Добавить();
					 КонецЕсли;	 					 
					 ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаТекОтветственного);
					 СтрокаТекОтветственного.ДатаВыписки = '0001-01-01';					 
					 НовСтрока.ДатаПрописки = НовСтрока.ДатаВыписки;
					 НовСтрока.СтатусФизЛица = ?(НовСтрока.PR_SOB=1,СобственникНеПроживает,ОтветственныйНеПроживает);
					 НовСтрока.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
					 НовСтрока.ДатаВыписки = '0001-01-01';					 
				КонецЕсли;	
				
				 
				Индекс=0;
				ЧислоСтрок = ТаблИсхЛС.Количество();
				Пока  Индекс <= ЧислоСтрок-1 цикл
					СтрокаИсх = ТаблИсхЛС[Индекс];	
					СледСтрока = ?(Индекс= ЧислоСтрок-1,Неопределено,ТаблИсхЛС[Индекс+1]);
 					Если ложь тогда СтрокаИсх = РегистрыСведений.лб_Тест_Жильцы.СоздатьМенеджерЗаписи(); СледСтрока = СтрокаИсх; КонецЕсли;					
					
					ЭтоКрайняяСтрока = СледСтрока=Неопределено или (СледСтрока.Жилец<>СтрокаИсх.Жилец);
					//Данные о собственноси дублируем до крайней записи
					Если НЕ ЭтоКрайняяСтрока и (СтрокаИсх.PR_SOB=1 ) и (СледСтрока.PR_SOB=0) тогда
						ЗаполнитьЗначенияСвойств(СледСтрока,СтрокаИсх,"PR_SOB,D1,D2,SOBST");						
					КонецЕсли;;					
					
					//Если есть дата выписки у собственника или у ответственного (не собственника),
					//в крайней строке, тогда делим строку на две, без даты выписки в каждой
					Если ЭтоКрайняяСтрока и ЗначениеЗаполнено(СтрокаИсх.ДатаВыписки) и 						
						 	(СтрокаИсх.PR_SOB=1)
					тогда	
						Если Индекс = ЧислоСтрок-1 тогда
							СледСтрока = ТаблИсхЛС.Добавить();
						иначе
							СледСтрока = ТаблИсхЛС.Вставить(Индекс+1);
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(СледСтрока,СтрокаИсх);
						СледСтрока.ДатаПрописки = СтрокаИсх.ДатаВыписки;
						СледСтрока.ДатаВыписки  = '0001-01-01';
						СледСтрока.СтатусФизЛица = СобственникНеПроживает; 													 
						СтрокаИсх.ДатаВыписки = '0001-01-01';
						ЧислоСтрок = ЧислоСтрок+1;                						
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СтрокаИсх.СтатусФизлица) тогда
						Если ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и не ЗначениеЗаполнено(СтрокаИсх.ДатаВыписки) тогда
							//прописан и не выписан
							СтрокаИсх.СтатусФизлица = ПроживаетПостоянно;
						ИначеЕсли ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и (СтрокаИсх.ДатаВыписки>='2025-01-01') тогда	
							//прописан и выписан после 2025 года
							СтрокаИсх.СтатусФизлица = ПроживаетПостоянно;
							
						ИначеЕсли ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и 
									(СтрокаИсх.ДатаВыписки<'2025-01-01') и 
									(СтрокаИсх.ДатаВыписки>'2019-01-31') тогда	
							//прописан и выписан в будущем, но до  2025 года							
							СтрокаИсх.СтатусФизлица = ПроживаетВременно;
						ИначеЕсли ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и 									
									(СтрокаИсх.ДатаВыписки<='2019-01-31') тогда	
							//прописан и выписан в прошлом		
							СтрокаИсх.СтатусФизлица = ?(СтрокаИсх.REG_VR=1,
														ПроживаетВременно,
														ПроживаетПостоянно);		
						ИначеЕсли  СтрокаИсх.PR_SOB=1 и НЕ ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) тогда							
							//Собственник не был прописан
							СтрокаИсх.СтатусФизлица = СобственникНеПроживает;
						ИначеЕсли СтрокаИсх.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо и НЕ ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) тогда														
							//Отвественный (не собственник) не был прописан
							СтрокаИсх.СтатусФизлица	= ОтветственныйНеПроживает;						 
						КонецЕсли;	
							
					КонецЕсли;
				
					Если СтрокаИсх.СтатусФизлица = ПроживаетПостоянно тогда
						СтрокаИсх.СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно
					ИначеЕсли СтрокаИсх.СтатусФизлица = ПроживаетВременно тогда
						СтрокаИсх.СтатусПроживания = Перечисления.бит_СтатусПроживания.Временно	
					иначе	
					    СтрокаИсх.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает
					КонецЕсли;	
					
					 //Заполняем строку в РС.бит_ПроживающиеНаЛС;					
					 НовЗапись = ТаблП.Добавить();
					 НовЗапись.ЛицевойСчет   = СтрокаИсх.ЛС;
					 НовЗапись.ФизЛицо       = СтрокаИсх.Жилец;
					 НовЗапись.Период 		 = НаборП.Отбор.Регистратор.Значение.Дата + Индекс*3600*24;
					 НовЗапись.Активность = Истина;
					 НовЗапись.ВладелецКвартиры =?(СтрокаИсх.PR_SOB = 1,
					 								Перечисления.ДаНет.Да,
													Перечисления.ДаНет.Нет);
					 НовЗапись.СтатусФизЛица		= СтрокаИсх.СтатусФизлица;					
					 НовЗапись.СтепеньРодства       = СтрокаИсх.СтепеньРодства;
					 НовЗапись.СтатусПроживания     = СтрокаИсх.СтатусПроживания;
					 НовЗапись.ДатаРегистрации      = СтрокаИсх.ДатаПрописки;
					 НовЗапись.ДатаСнятияСРегистрации = СтрокаИсх.ДатаВыписки;
					 //НовЗапись.ДатаЗаписи             =  //дата окончания действия 
					 НовЗапись.ДоляПлощади            = ?(СтрокаИсх.D2=0,0,СтрокаИсх.D1/СтрокаИсх.D2);
					 НовЗапись.лб_ДоляПлощадиСтрокой  = сокрЛП(СтрокаИсх.SOBST);
					 НовЗапись.лб_СтрокаРодствДляФЛС  = СтрокаИсх.ОписаниеРодства;	
					 
					 
					 Индекс = Индекс+1;
					 
				КонецЦикла;
				
			КонецЕсли;	                          		
			
		КонецЦикла;	 //Лицевой счет
				
		
		
		Сч = Сч+1;
	КонецЦикла;	  //Здание
	
	Если НаборП<>Неопределено тогда
		НаборП.Загрузить(ТаблП);
		НаборП.Записать(истина);
	КонецЕсли;	

	
	
		
	
	
	
//	ДополнитьДаннымиПоСобственникам();	
КонецПроцедуры

Функция ТекстЗапросаСравнитьЖильцов(НуженОтборПоЛС=ложь)
	ТекстЗапроса= 
	    "ВЫБРАТЬ
	    |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	    |	СУММА(ВЫБОР
	    |			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = &НеПроживает
	    |				ТОГДА 0
	    |			ИНАЧЕ 1
	    |		КОНЕЦ) КАК Прожив,
	    |	СУММА(ВЫБОР
	    |			КОГДА бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.Данет.Да)
	    |				ТОГДА 1
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК Собств
	    |ПОМЕСТИТЬ ОстаткиБИТ
	    |ИЗ
	    |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), &ОтборЛицевыеСчета) КАК бит_ПроживающиеПоЛССрезПоследних
	    |ГДЕ
	    |	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации < ДАТАВРЕМЯ(2019, 2, 1)
	    |	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации >= ДАТАВРЕМЯ(2019, 2, 1)
	    |			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	    |
	    |ИНДЕКСИРОВАТЬ ПО
	    |	ЛицевойСчет
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	    |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ПОМЕСТИТЬ ОтветственныеБИТ
	    |ИЗ
	    |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, &ОтборЛицевыеСчета) КАК бит_ПроживающиеПоЛССрезПоследних
	    |ГДЕ
	    |	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &Ответственный
	    |	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	    |			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации >= &Дата)
	    |
	    |ИНДЕКСИРОВАТЬ ПО
	    |	ЛицевойСчет
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	лб_Тест_ЛС.ЛС КАК ЛС,
	    |	лб_Тест_ЛС.K_JIL КАК K_JIL,
	    |	лб_Тест_ЛС.K_SOB КАК K_SOB,
	    |	лб_Тест_ЛС.Ответственный КАК Ответственный,
	    |	лб_Тест_ЛС.TAR КАК TAR
	    |ПОМЕСТИТЬ Эталон
	    |ИЗ
	    |	РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС
	    |ГДЕ
	    |	&ОтборЛС
	    |
	    |ИНДЕКСИРОВАТЬ ПО
	    |	ЛС
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	Эталон.ЛС.Здание КАК Здание,
	    |	Эталон.ЛС КАК ЛС,
	    |	Эталон.K_JIL КАК ЖильцыЭ,
	    |	ЕСТЬNULL(ОстаткиБИТ.Прожив, 0) КАК ЖильцыФ,
	    |	Эталон.K_SOB КАК СобствЭ,
	    |	ЕСТЬNULL(ОстаткиБИТ.Собств, 0) КАК СобствФ,
	    |	Эталон.Ответственный КАК ОтветственныйЭ,
	    |	ЕСТЬNULL(ОтветственныеБИТ.ФизЛицо, ЗНАЧЕНИЕ(Справочник.бит_Проживающие.Пустаяссылка)) КАК ОтветственныйФ,
	    |	Эталон.TAR КАК TAR
	    |ПОМЕСТИТЬ СравнениеВсех
	    |ИЗ
	    |	Эталон КАК Эталон
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБИТ КАК ОстаткиБИТ
	    |		ПО (ОстаткиБИТ.ЛицевойСчет = Эталон.ЛС)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ОтветственныеБИТ КАК ОтветственныеБИТ
	    |		ПО Эталон.ЛС = ОтветственныеБИТ.ЛицевойСчет
	    |ГДЕ
	    |	(Эталон.K_JIL <> ЕСТЬNULL(ОстаткиБИТ.Прожив, 0)
	    |			ИЛИ Эталон.K_SOB <> ЕСТЬNULL(ОстаткиБИТ.Собств, 0)
	    |			ИЛИ ЕСТЬNULL(ОтветственныеБИТ.ФизЛицо, ЗНАЧЕНИЕ(Справочник.бит_Проживающие.Пустаяссылка)) <> Эталон.Ответственный)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	СравнениеВсех.ЛС КАК ЛС,
	    |	СравнениеВсех.ЖильцыЭ КАК ЖильцыЭ,
	    |	СравнениеВсех.ЖильцыФ КАК ЖильцыФ,
	    |	СравнениеВсех.СобствЭ КАК СобствЭ,
	    |	СравнениеВсех.СобствФ КАК СобствФ,
	    |	СравнениеВсех.ОтветственныйЭ КАК ОтветственныйЭ,
	    |	СравнениеВсех.ОтветственныйФ КАК ОтветственныйФ,
	    |	СравнениеВсех.TAR КАК TAR,
	    |	СравнениеВсех.Здание КАК Здание
	    |ИЗ
	    |	СравнениеВсех КАК СравнениеВсех
	    |ИТОГИ ПО
	    |	Здание";
	Если НуженОтборПоЛС тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОтборЛицевыеСчета","ЛицевойСчет в (&СписокЛС)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОтборЛС","ЛС в (&СписокЛС)");
	иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОтборЛицевыеСчета","истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОтборЛС","истина");  
	КонецЕсли;
	
	Возврат ТекстЗапроса
КонецФункции	



&НаСервере
Процедура ДополнитьДаннымиПоСобственникам()
	Запрос = новый запрос;
	Запрос.УстановитьПараметр()
КонецПроцедуры	


&НаКлиенте
Процедура КоррекцияЖильцов(Команда)
	Д1= ТекущаяДата();
	КоррекцияЖильцовНаСервере();
	Д2 = ТекущаяДата();
	Сообщить("Коррекция жильцов заняла " + (Д2-Д1)+ " сек.");
КонецПроцедуры


&НаКлиенте
Процедура тест2_ДополнитьЗагруженныеДанныеЖильцов(Команда)
	Д1 = ТекущаяДата();	
	тест2_ДополнитьЗагруженныеДанныеЖильцовНаСервере();
	Д2 = ТекущаяДата();
	Сообщить("Подготовка доп.данных = " + (Д2-Д1)+ " сек.");
КонецПроцедуры


&НаСервере
Процедура тест2_ДополнитьЗагруженныеДанныеЖильцовНаСервере()
	// Вставить содержимое обработчика.
	ТестЖильцыПодобратьЛСНаСервере();
	ТестЖильцыПодобратьЖильцовНаСервере();
	//ТестЖильцыУбратьДругиеЛСНаСервере();
	
	НаборЛС = РегистрыСведений.лб_Тест_ЛС.СоздатьНаборЗаписей();
	НаборЛС.Прочитать();
	ТаблЛС = НаборЛС.Выгрузить(,"ЛС,Ответственный");
	ТаблЛС.Индексы.Добавить("ЛС");
	
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	Набор.Отбор.Месяц.Значение = НачалоМесяца(Объект.Дата);
	Набор.Отбор.Месяц.Видсравнения = ВидСравнения.Равно;
	Набор.Отбор.Месяц.ИСпользование = истина;
	Набор.Прочитать();
	Для каждого Запись из Набор цикл
		Запись.ДатаПрописки = ДатаИзСтроки(Запись.D_PR);
		Запись.ДатаВыписки = ДатаИзСтроки(Запись.D_V);
		Запись.СтепеньРодства  = РодственныеОтношения(Запись.RODOTN);				
		Запись.ОписаниеРодства = сокрЛП(Запись.RO);
		СтрокаЛС = ТаблЛС.Найти(Запись.ЛС);
		Если СтрокаЛС<>Неопределено и Запись.Жилец=СтрокаЛС.Ответственный тогда
			Запись.ЭтоОтветственный = истина;			
		КонецЕсли;		
	КонецЦикла;	
	Набор.Записать(истина);
	
	

КонецПроцедуры


&НаКлиенте
Процедура тест2_ПодобратьНеНайденныхЖильцов(Команда)
	тест2_ПодобратьНеНайденныхЖильцовНаСервере();
КонецПроцедуры


&НаСервере
Процедура тест2_ПодобратьНеНайденныхЖильцовНаСервере()
	// Вставить содержимое обработчика.
	//Запрос = новый запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	бит_Проживающие.Ссылка КАК Ссылка,
	//	|	бит_Проживающие.Наименование КАК Наименование,		 
	//	|	бит_Проживающие.ДатаРождения КАК ДатаРождения,
	//	|	"""" КАК Ключ, """" КАК ФИО
	//	|ИЗ
	//	|	Справочник.бит_Проживающие КАК бит_Проживающие";
	//Табл= Запрос.Выполнить().Выгрузить();
	//Для каждого СтрокаТ из Табл Цикл СтрокаТ.ФИО = СокрЛП(ВРег(СтрокаТ.Наименование)); СтрокаТ.Ключ = СтрокаТ.ФИО + " " + Формат(СтрокаТ.ДатаРождения,"ДФ=dd.MM.yyyy") КонецЦикла;
	//Табл.Индексы.Добавить("ФИО");
	//Табл.Индексы.Добавить("Ключ");
	
   ЗаполнитьКэшПроживающих();
	
   Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();   
   Набор.Прочитать();
   Для Каждого Запись из набор цикл
	   Если Запись.Игнорировать или ЗначениеЗаполнено(Запись.Жилец) тогда
		   продолжить
	   КонецЕсли;
	   Стру = Запись;
	   Фамилия 		= СокрЛП(стру.FIO);
	   Имя 	 		= СокрЛП(стру.NAME);
	   Отчество   		= СокрЛП(стру.OTCH);
	   ФИО   = сокрЛП(Фамилия+" "+Имя + " " +Отчество);
	   
	   Запись.Жилец = Справочники.бит_Проживающие.НайтиПоНаименованию(ФИО);
	   Если не ЗначениеЗаполнено(Запись.Жилец) тогда
		   Тест2_создатьОбновитьПроживающего(Запись);
	   КонецЕсли;	   
   КонецЦикла;;	 
   Набор.Записать(истина);
   	
КонецПроцедуры


&НаСервере                                         
Процедура Тест2_создатьОбновитьПроживающего(Стру)
	Если ложь тогда мКэшПроживающих=новый ТаблицаЗначений КонецЕсли;
	
    Фамилия 		= СокрЛП(стру.FIO);
	Имя 	 		= СокрЛП(стру.NAME);
	Отчество   		= СокрЛП(стру.OTCH);
	ДатаРождения	= ДатаИзСтроки(стру.D_R);
	СНИЛС			= сокрЛП(стру.SNILS);
	ДатаРегистрации = ДатаИзСтроки(стру.D_PR);
	ДатаВыписки     = ДатаИзСтроки(стру.D_V);
	ФизЛицо 			= неопределено;
	Представление   = сокрЛП(Фамилия+" "+Имя + " " +Отчество);
	
	
	//Удаленные ФИО 
	Если Фамилия = "???" тогда
		Фамилия = СокрЛП(Стру.LS);
		
		//Отбор = новый структура("Фамилия",Фамилия);
		//Мас = мКэшПроживающих.НайтиСтроки(Отбор);
		//Имя = Формат(Мас.Количество()+1,"ЧЦ=3; ЧВН=");
		
		//Представление = Фамилия+" "+Имя;
		Представление = Фамилия;
	КонецЕсли;	
		
	
	ЗаписиКэша = новый массив;
	
	
	
	
	
	Отбор = новый Структура("Фамилия,Имя,Отчество,ДатаРождения",
		                         Фамилия,Имя,Отчество,ДатаРождения);		
	ЗаписиКэша = мКэшПроживающих.НайтиСтроки(Отбор);
	Если ЗаписиКэша.Количество() = 0 тогда
		Физлицо = неопределено
	иначе
		ФизЛицо = ЗаписиКэша[0].Физлицо;
	КонецЕсли;	
	
	
	Если ЗаписиКэша.Количество()>0 тогда 
		СтрокаКэша = ЗаписиКэша[0];
	КонецЕсли;	
	
	//Меняем ссылку на наиболее познюю запись кэша
	Для Инд=1 по ЗаписиКэша.Количество()-1 цикл
		ТекД = ?(ЗначениеЗаполнено(СтрокаКэша.ДатаВыписки),'3000-01-01',СтрокаКэша.ДатаВыписки);
		НовД = ?(ЗначениеЗаполнено(ЗаписиКэша[Инд].ДатаВыписки),'3000-01-01',ЗаписиКэша[Инд].ДатаВыписки);		;
		
		Если СтрокаКэша.ДатаРегистрации>ЗаписиКэша[Инд].ДатаРегистрации тогда
			продолжить;			
		ИначеЕсли СтрокаКэша.ДатаРегистрации<ЗаписиКэша[Инд].ДатаРегистрации тогда	
			СтрокаКэша = ЗаписиКэша[Инд];
			продолжить;
		ИначеЕсли  НовД>текД тогда	//здесь даты прописки обе отсутствуют или равны
			СтрокаКэша = ЗаписиКэша[Инд];
			продолжить;			
		КонецЕсли;	
	КонецЦикла;	
	
	//Мы предполагаем, что в в строках может отличаться только Фамилия .
	//для одного ФизЛица Имя, Отчество и ДатаРождения неизменнны
	Если ЗначениеЗаполнено(СтрокаКэша) тогда
		ЭтоПолныйДубль =  (Фамилия = СтрокаКэша.Фамилия);  
		Если ЭтоПолныйДубль тогда
			ОбновитьКонтактуюИнформацию(СтрокаКэша.Физлицо,Стру);
			возврат
		КонецЕсли;	
		                  
	КонецЕсли;	
	
	
	
	Если НЕ ЗначениеЗаполнено(СтрокаКэша) тогда
		ОбъектФЛ = Справочники.бит_Проживающие.СоздатьЭлемент();	
		ОбъектФЛ.Наименование = Представление;
		ОбъектФЛ.СтраховойНомерПФР = СНИЛС;
		ОбъектФЛ.ДатаРождения = ДатаРождения; 		
		ОбъектФЛ.Записать();
		
		ФизЛицо = ОбъектФЛ.Ссылка;
		ЗаписьФИО = РегистрыСведений.бит_ФИОПроживающих.СоздатьМенеджерЗаписи();
		ЗаписьФИО.Период = ?(ЗначениеЗаполнено(ДатаРегистрации),ДатаРегистрации,'1900-01-01');		
		ЗаписьФИО.Активность = Истина;
		ЗаписьФИО.ФизЛицо= ОбъектФЛ.Ссылка;
		ЗаписьФИО.Фамилия = Фамилия;		
		ЗаписьФИО.Имя = Имя;
		ЗаписьФИО.Отчество = Отчество;
		ЗаписьФИО.Записать(истина);
		
		СтрокаКэша = мКэшПроживающих.Добавить();
		СтрокаКэша.ФизЛицо  = ФизЛицо;
		СтрокаКэша.Фамилия = Фамилия;
		СтрокаКэша.Имя     = Имя;
		СтрокаКэша.Отчество = Отчество;  
		СтрокаКэша.ДатаРождения = ДатаРождения;
		СтрокаКэша.ДатаРегистрации = ДатаРегистрации;
		СтрокаКэша.ДатаВыписки = ДатаВыписки;
		СтрокаКэша.Представление = ""+ФизЛицо;			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаКэша) тогда
		
	КонецЕсли;	
	
    //Найдена строка кэша. Проверяем соответствие
	
	ФИОСовпадает = СтрокаКэша.Фамилия = Фамилия 
					и СтрокаКэша.Имя = Имя
					и СтрокаКэша.Отчество = Отчество;
//	СНИЛССовпадает = СТрокаКэша.СНИЛС = СНИЛС;
	ДатаРСовпадает = СтрокаКэша.ДатаРождения = ДатаРождения;
	
	Стру.Жилец = СтрокаКэша.ФизЛицо;
		
КонецПроцедуры	

&НаКлиенте
Процедура КоррекцияГоргаз(Команда)
	
	Д1 = ТекущаяДата();
	ПередатьФайлНаСервер();
	КоррекцияГоргазНаСервере();
	Д2 = ТекущаяДата();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поправлены количества ГГ по нормативам. Заняло " + (Д2-Д1)+ " сек.");
	
КонецПроцедуры

&НаСервере
Процедура КоррекцияГоргазНаСервере()
	// Вставить содержимое обработчика.
	
	//Загрузим исх.данные
	МассивСтру = ЗагрузитьДБФВМассивСтруктур();
	
	
	ТипСтрока10 = новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки(10));
	ТипСтрока11 = новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки(11));
	Табл = Новый ТаблицаЗначений;	
	Табл.Колонки.Добавить("LS",ТипСтрока11);
	//Табл.Колонки.Добавить("ИмяЛС10",ТипСтрока10);
	Табл.Колонки.Добавить("K_JIL",новый ОписаниеТипов("Число"));
	Табл.Колонки.Добавить("K_SOB",новый ОписаниеТипов("Число"));
	Для каждого Стру из МассивСтру цикл НовСтрока= Табл.Добавить(); ЗаполнитьЗначенияСвойств(НовСтрока,Стру) КонецЦикла;
		
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ДокГоргаза",ЭтаФорма.ДокГоргаза);
	Запрос.УстановитьПараметр("РежимПоСчетчикам",Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Горгаз (по счетчикам)"));
	Запрос.УстановитьПараметр("РежимНеНачислять",Справочники.бит_РежимыПотребленияУслуг.НеНачислять);
	Запрос.УстановитьПараметр("Табл",Табл);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Табл.K_JIL КАК ЧИСЛО(10, 0)) КАК Жильцов,
		|	ВЫРАЗИТЬ(Табл.K_SOB КАК ЧИСЛО(10, 0)) КАК Собств,
		|	ВЫРАЗИТЬ(Табл.LS КАК СТРОКА(10)) КАК ИмяЛС10
		|ПОМЕСТИТЬ ТаблНов
		|ИЗ
		|	&Табл КАК Табл
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИмяЛС10
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	лб_ДанныеГорГазаТЧ.Ссылка КАК Ссылка,
		|	лб_ДанныеГорГазаТЧ.НомерСтроки КАК НомерСтроки,
		|	лб_ДанныеГорГазаТЧ.Здание КАК Здание,
		|	лб_ДанныеГорГазаТЧ.ЛицевойСчет КАК ЛицевойСчет,
		|	лб_ДанныеГорГазаТЧ.Тариф КАК Тариф,
		|	лб_ДанныеГорГазаТЧ.Норматив КАК Норматив,
		|	лб_ДанныеГорГазаТЧ.Сальдо КАК Сальдо,
		|	лб_ДанныеГорГазаТЧ.СальдоПени КАК СальдоПени,
		|	лб_ДанныеГорГазаТЧ.Пени КАК Пени,
		|	лб_ДанныеГорГазаТЧ.НаличиеСчетчика КАК НаличиеСчетчика,
		|	лб_ДанныеГорГазаТЧ.НомерСчетчика КАК НомерСчетчика,
		|	лб_ДанныеГорГазаТЧ.ДатаПоверки КАК ДатаПоверки,
		|	лб_ДанныеГорГазаТЧ.ТекПоказание КАК ТекПоказание,
		|	лб_ДанныеГорГазаТЧ.Режим КАК Режим,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблНов.ИмяЛС10, """") = """"
		|			ТОГДА лб_ДанныеГорГазаТЧ.КоличествоЕдиницПотребления
		|		КОГДА лб_ДанныеГорГазаТЧ.Режим В (&РежимПоСчетчикам, &РежимНеНачислять)
		|			ТОГДА 0
		|		КОГДА ТаблНов.Жильцов > 0
		|			ТОГДА ТаблНов.Жильцов
		|		ИНАЧЕ ТаблНов.Собств
		|	КОНЕЦ КАК КоличествоЕдиницПотребления
		|ИЗ
		|	Документ.лб_ДанныеГорГаза.ТЧ КАК лб_ДанныеГорГазаТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблНов КАК ТаблНов
		|		ПО (ПОДСТРОКА(лб_ДанныеГорГазаТЧ.ЛицевойСчет.Наименование, 1, 10) = ПОДСТРОКА(ТаблНов.ИмяЛС10, 1, 10))
		|ГДЕ
		|	лб_ДанныеГорГазаТЧ.Ссылка = &ДокГоргаза";
	ТаблГГ = Запрос.Выполнить().Выгрузить();
	
	
	Попытка
		ДокОбъект = ЭтаФорма.ДокГоргаза.ПолучитьОбъект();
		ДокОбъект.ТЧ.Загрузить(ТаблГГ);
		ДокОбъект.Записать();
	исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Жильцы_ЗаполнитьДанныеФЛС(Команда)
	// Вставить содержимое обработчика.
	Сообщить("Заполнение данных ФЛС - в разработке");
	ЗаполнитьДанныеДляФЛСНаСервереБезКонтекста();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеДляФЛСНаСервереБезКонтекста(ЛС=неопределено);
	ЗапросРегистраторов = новый запрос;
	ЗапросРегистраторов.Текст = 
		 "ВЫБРАТЬ
		 |	бит_ПроживающиеПоЛС.Регистратор КАК Регистратор
		 |ИЗ
		 |	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
		 |ГДЕ
		 |	бит_ПроживающиеПоЛС.Активность = ИСТИНА
		 |	И бит_ПроживающиеПоЛС.ЛицевойСчет = &ЛС
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	бит_ПроживающиеПоЛС.Регистратор";
	
	Если Не ЗначениеЗаполнено(ЛС) тогда
		ЗапросРегистраторов.Текст = СтрЗаменить(ЗапросРегистраторов.Текст,"И бит_ПроживающиеПоЛС.ЛицевойСчет = &ЛС","");
	КонецЕсли;
	
	СписокРегистраторов = ЗапросРегистраторов.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	Для Каждого ДокСсылка из СписокРегистраторов цикл
		ДополнитьДвиженияПроживающихДаннымиДляФЛС(ДокСсылка);		
	КонецЦикла;		
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ДополнитьДвиженияПроживающихДаннымиДляФЛС(ДокСсылка);		
	СобственникНеПроживает = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Собственник не проживает");
	ОтветственныйНеПроживает = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Ответственный не проживает");
	Набор = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Значение = ДокСсылка;
	Набор.Прочитать();
	Табл = Набор.Выгрузить();
	Для каждого СтрокаТ из Табл цикл
		Если Не СтрокаТ.Активность тогда
			продолжить
		КонецЕсли;
		Если НЕ (СтрокаТ.СтатусФизЛица = СобственникНеПроживает)  
				и не (СтрокаТ.СтатусФизЛица = ОтветственныйНеПроживает) 
		тогда
			СтрокаТ.лб_ИгнорироватьПериодВКопииФЛС = ложь;
			СтрокаТ.лб_ДатаРегистрацииДляФЛС = СтрокаТ.ДатаРегистрации;
			СтрокаТ.лб_ДатаВыпискиДляФЛС = СтрокаТ.ДатаСнятияСРегистрации;			
		иначе
			СтрокаТ.лб_ИгнорироватьПериодВКопииФЛС = истина;
		КонецЕсли;	
	КонецЦикла;
	
	Набор.Загрузить(Табл);
	Набор.Записать(истина);
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ж_ЗаполнитьИгнорируемыеЛС(Команда)
	ж_ЗаполнитьИгнорируемыеЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ж_ЗаполнитьИгнорируемыеЛСНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Нежилое",Перечисления.бит_ТипыКвартиры.НежилоеПомещение);
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	бит_СведенияОКвартире.Квартира КАК Квартира
		 |ПОМЕСТИТЬ НежилыеКвартиры_все
		 |ИЗ
		 |	РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
		 |ГДЕ
		 |	бит_СведенияОКвартире.ТипКвартиры = &Нежилое
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира
		 |ПОМЕСТИТЬ НежилыеКвартиры
		 |ИЗ
		 |	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
		 |			,
		 |			Квартира В
		 |				(ВЫБРАТЬ
		 |					НежилыеКвартиры_все.Квартира КАК Квартира
		 |				ИЗ
		 |					НежилыеКвартиры_все КАК НежилыеКвартиры_все)) КАК бит_СведенияОКвартиреСрезПоследних
		 |ГДЕ
		 |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры = &Нежилое
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	Квартира
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		 |ПОМЕСТИТЬ НежилыеЛС
		 |ИЗ
		 |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НежилыеКвартиры КАК НежилыеКвартиры
		 |		ПО бит_ЛицевыеСчета.Квартира = НежилыеКвартиры.Квартира
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	ЛицевойСчет  ";
	
	//Дополним информацию в регистре данными о нежилых
	 Запрос.Текст = Запрос.Текст+ "
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	лб_Тест_Жильцы.*,
		 |	ВЫБОР
		 |		КОГДА ЕСТЬNULL(НежилыеЛС.ЛицевойСчет, ЛОЖЬ) = ЛОЖЬ
		 |			ТОГДА ЛОЖЬ
		 |		ИНАЧЕ ИСТИНА
		 |	КОНЕЦ КАК ЭтоНежилойЛС
		 |ИЗ
		 |	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
		 |		ЛЕВОЕ СОЕДИНЕНИЕ НежилыеЛС КАК НежилыеЛС
		 |		ПО лб_Тест_Жильцы.ЛС = НежилыеЛС.ЛицевойСчет";
	 
	 Табл = Запрос.Выполнить().Выгрузить();
	 Для каждого СтрокаТ из Табл цикл  СтрокаТ.Игнорировать = (СтрокаТ.Игнорировать или СтрокаТ.ЭтоНежилойЛС) КонецЦикла;
	 Табл.Колонки.Удалить("ЭтоНежилойЛС");
	 
	 Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	 Набор.Загрузить(Табл);
	 Набор.Записать(истина);
	
	
 КонецПроцедуры
 
 
 
&НаКлиенте
Процедура ж_ДополнитьЗданияВОтборЛС(Команда)
	ж_ДополнитьЗданияВОтборЛСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ж_ДополнитьЗданияВОтборЛСНаСервере()
	// Вставить содержимое обработчика.
	ЧислоСтрок = Объект.ПерезагружаемыеЛС.Количество();
	Табл = ЭтаФорма.Объект.ПерезагружаемыеЛС.Выгрузить();
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Т",Табл);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Т.ЛС КАК Справочник.бит_ЛицевыеСчета) КАК ЛС,
		|	ВЫРАЗИТЬ(Т.Здание КАК Справочник.бит_СписокЗданий) КАК Здание
		|ПОМЕСТИТЬ Табл
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВлЗапрос.ЛС КАК ЛС,
		|	ВлЗапрос.Здание КАК Здание
		|ИЗ
		|	(ВЫБРАТЬ
		|		Табл.ЛС КАК ЛС,
		|		Табл.ЛС.Здание КАК Здание
		|	ИЗ
		|		Табл КАК Табл
		|	ГДЕ
		|		Табл.ЛС <> ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.Пустаяссылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		бит_ЛицевыеСчета.Ссылка,
		|		Табл.Здание
		|	ИЗ
		|		Табл КАК Табл
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|			ПО Табл.Здание = бит_ЛицевыеСчета.Здание
		|				И (Табл.ЛС = ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.Пустаяссылка))) КАК ВлЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВлЗапрос.ЛС,
		|	ВлЗапрос.Здание";
	Табл = Запрос.Выполнить().Выгрузить();
	ЭтаФорма.Объект.ПерезагружаемыеЛС.Загрузить(Табл);
		
КонецПроцедуры

//&НаКлиенте
//Процедура ж_УдалитьДанныеИзБазы(Команда)
//	ж_УдалитьДанныеИзБазыНаСервере();
//КонецПроцедуры

&НаКлиенте
Процедура ж_ЗаменитьДанныеВБазеИзРегистра(Команда)
	ж_ДополнитьЗданияВОтборЛС (Команда);
	
	Если Объект.ПерезагружаемыеЛС.Количество()>0 тогда
		ж_ЗаменитьДанныеВБазеИзРегистраНаСервере() 	
	иначе
		ОбработкаОтвета = Новый ОписаниеОповещения("ж_ЗаменитьДанныеВБазеИзРегистраЗавершение",ЭтаФорма);
	
		ПоказатьВопрос(ОбработкаОтвета,
				"Не задан список ЛС. Будут перезагружены проживаюие по ВСЕМ жилым л/с в базе. Проолжать?",
				РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Отмена);
	
	КонецЕсли;

	      
	
КонецПроцедуры

&НаКлиенте
Процедура ж_ЗаменитьДанныеВБазеИзРегистраЗавершение(РезультатВопроса,ДопПараметры) экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		ж_ЗаменитьДанныеВБазеИзРегистраНаСервере() 
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ж_ЗаменитьДанныеВБазеИзРегистраНаСервере()
	ОбработатьВсеЛС = Объект.ПерезагружаемыеЛС.Количество()=0;
	Если ОбработатьВсеЛС тогда
		Запрос = новый запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_СписокЗданий.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.бит_СписокЗданий КАК бит_СписокЗданий";
		ЗданияДляОбработки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 		
	иначе
		Табл = Объект.ПерезагружаемыеЛС.Выгрузить(,"Здание");
		Табл.Свернуть("Здание");
		ЗданияДляОбработки = Табл.ВыгрузитьКолонку("Здание"); 	
	КонецЕсли;

	ж_УдалитьДанныеИзБазыНаСервере(ЗданияДляОбработки,ОбработатьВсеЛС);
	ж_ЗагрузитьДанныеВБазуНаСервере(ЗданияДляОбработки,ОбработатьВсеЛС);
	ЧислоЛС = Объект.ПерезагружаемыеЛС.Количество();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обновлены данные о проживающих по " + ?(ЧислоЛС=0," всем ",ЧислоЛС)+"л/с");
	
КонецПроцедуры	

&НаСервере
Процедура ж_УдалитьДанныеИзБазыНаСервере(ЗданияДляОбработки, обработатьВсеЛС)
	// Вставить содержимое обработчика.
	
	Для каждого Здание из ЗданияДляОбработки цикл
		СписокЛС = СписокЛсПоЗданию(Здание,ОбработатьВсеЛС);
		СписокДок = СписокРегистраторов(СписокЛС);
		НачатьТранзакцию();
		Для Каждого ТекРегистратор из СписокДок цикл
			Если ТипЗнч(ТекРегистратор)<> Тип("ДокументСсылка.ОперацияБух") тогда
				ДокОбъект = ТекРегистратор.ПолучитьОбъект();
				Если ложь тогда ДокОбъект = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент() КонецЕсли;
				ДокОбъект.УстановитьПометкуУдаления(истина);
				ДокОбъект.Удалить();
				
			иначе
				Набор = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Значение = ТекРегистратор;
				Набор.Прочитать();
				ЧислоЗаписей = Набор.Количество();
				Для СчетВниз = 1 по ЧислоЗаписей цикл Запись = Набор[ЧислоЗаписей-СчетВниз]; Если СписокЛС.Найти(Запись.ЛицевойСчет)<>Неопределено тогда Набор.Удалить(ЧислоЗаписей-СчетВниз);КонецЕсли; КонецЦикла;
				////Исходный текст цикла
				//Для СчетВниз = 1 по ЧислоЗаписей цикл
				//	Запись = Набор[ЧислоЗаписей-СчетВниз]; 
				//	Если СписокЛС.Найти(Запись.ЛицевойСчет)<>Неопределено тогда 
				//		Набор.Удалить(ЧислоЗаписей-СчетВниз);
				//	КонецЕсли;
				//КонецЦикла;
				Набор.Записать(истина);
				
				Если  Набор.Количество() = 0 тогда
					ДокОбъект = ТекРегистратор.ПолучитьОбъект();
					ДокОбъект.Удалить()
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
		ЗафиксироватьТранзакцию();
	КонецЦикла;;
	
	
КонецПроцедуры

&НаСервере
Функция  СписокЛсПоЗданию(Здание,ОбработатьВсеЛС);
	Если ОбработатьВсеЛС тогда
		Запрос = новый запрос;
		Запрос.УстановитьПараметр("Здание",Здание);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
			|ГДЕ
			|	бит_ЛицевыеСчета.Здание = &Здание";
		ИсходныйСписокЛС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	иначе	
		Отбор = новый структура("Здание",Здание);
		СтрокиПоЗданию = Объект.ПерезагружаемыеЛС.НайтиСтроки(Отбор);
		ИсходныйСписокЛС = Объект.ПерезагружаемыеЛС.Выгрузить(СтрокиПоЗданию,"ЛС").ВыгрузитьКолонку("ЛС");
	КонецЕсли;
	
	
	//не перезаполняем счета, где хотя бы одна запись - игнор
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ИсходныйСписокЛС",ИсходныйСписокЛС);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ИсхСписок
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка В(&ИсходныйСписокЛС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсхСписок.Ссылка КАК ЛС,
		|	МАКСИМУМ(ЕСТЬNULL(лб_Тест_Жильцы.Игнорировать, ЛОЖЬ)) КАК Игнор
		|ПОМЕСТИТЬ СписокЛС
		|ИЗ
		|	ИсхСписок КАК ИсхСписок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
		|		ПО лб_Тест_Жильцы.ЛС = ИсхСписок.Ссылка
		|			И (лб_Тест_Жильцы.Игнорировать = ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсхСписок.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЛС.ЛС КАК ЛС
		|ИЗ
		|	СписокЛС КАК СписокЛС
		|ГДЕ
		|	СписокЛС.Игнор = ЛОЖЬ";
	СписокЛС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЛС");;
	
	Возврат СписокЛС
	
КонецФункции

&НаСервере
Функция СписокРегистраторов(СписокЛС)
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_РегистрацияПроживающихПоЛС.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Регистраторы
		|ИЗ
		|	Документ.бит_РегистрацияПроживающихПоЛС КАК бит_РегистрацияПроживающихПоЛС
		|ГДЕ
		|	бит_РегистрацияПроживающихПоЛС.ЛицевойСчет В(&СписокЛС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Ссылка
		|ИЗ
		|	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
		|ГДЕ
		|	бит_СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет В(&СписокЛС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.Ссылка
		|ИЗ
		|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК бит_СвидетельствоОРегистрацииПоМестуПроживания
		|ГДЕ
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет В(&СписокЛС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_ПроживающиеПоЛС.Регистратор
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
		|ГДЕ
		|	бит_ПроживающиеПоЛС.Регистратор ССЫЛКА Документ.ОперацияБух
		|	И бит_ПроживающиеПоЛС.ЛицевойСчет В(&СписокЛС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Регистраторы.Ссылка КАК Ссылка
		|ИЗ
		|	Регистраторы КАК Регистраторы
		|
		|СГРУППИРОВАТЬ ПО
		|	Регистраторы.Ссылка";
	СписокДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	возврат СписокДокументов;
	
КонецФункции	


&насервере
Процедура ж_ЗагрузитьДанныеВБазуНаСервере(ЗданияДляОбработки,ОбработатьВсеЛС);
	Для каждого Здание из ЗданияДляОбработки цикл
		СписокЛС = СписокЛсПоЗданию(Здание,ОбработатьВсеЛС);
		ж_ЗагрузитьЖильцовДомаИзВременногоРегистра(СписокЛС);
	КонецЦикла;	
КонецПроцедуры


&НаСервере
Процедура ж_ЗагрузитьЖильцовДомаИзВременногоРегистра(СписокЛС)
	
	Д1 = ТекущаяДата();
	
	Счетчик = 1000; //количество обрабатываемых домов
	Сч=0;
	
	НаборП=Неопределено; //НаборП - набор проводок
	ТаблП= неопределено; //ТаблП = НаборП.Выгрузить();
	
	//НаборИсх = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	//НаборИсх.Прочитать();
	//ТаблИсх = НаборИсх.Выгрузить();
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_Тест_Жильцы.* 
		|ИЗ
		|	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
		|ГДЕ
		|	лб_Тест_Жильцы.ЛС В(&СписокЛС) и (лб_Тест_Жильцы.Игнорировать = ложь)";
	ТаблИсх = Запрос.Выполнить().Выгрузить();	
	ТаблИсх.Индексы.Добавить("ЛС");
	НаборИсх = неопределено;
	
	//Список статусов ФЛ
	ПроживаетПостоянно   	 = Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация;
	ПроживаетВременно    	 = Справочники.бит_СтатусФизЛица.ВременнаяРегистрация;	
	СобственникНеПроживает 	 = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Владелец не проживает");
	ОтветственныйНеПроживает = Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Ответственный не проживает");
	УдаленСЛС 				 = Справочники.бит_СтатусФизЛица.Выписан;
	
	
	////Запрос эталон ЛС 
	//ЗапросЛС = новый запрос;
	//ЗапросЛС.Текст = 
	//	"ВЫБРАТЬ
	//	|	лб_Тест_ЛС.ЛС КАК ЛС,
	//	|	лб_Тест_ЛС.Ответственный КАК Ответственный,
	//	|	лб_Тест_ЛС.OTV КАК OTV,
	//	|	лб_Тест_ЛС.OTVETST КАК OTVETST,
	//	|	лб_Тест_ЛС.K_JIL КАК K_JIL,
	//	|	лб_Тест_ЛС.K_SOB КАК K_SOB,
	//	|	лб_Тест_ЛС.TAR КАК TAR
	//	|ИЗ
	//	|	РегистрСведений.лб_Тест_ЛС КАК лб_Тест_ЛС";
	//ТаблЛС = ЗапросЛС.Выполнить().Выгрузить();
	//ТаблЛС.Индексы.Добавить("ЛС");
	//
	
	
	
	
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Дата",КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("НеПроживает",Перечисления.бит_СтатусПроживания.НеПроживает);
	Запрос.УстановитьПараметр("Ответственный",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
	ЗАпрос.Текст =  ТекстЗапросаСравнитьЖильцов(СписокЛС.Количество()>0);
	ВыборкаЗдания = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Д2 = ТекущаяДата();
	Сообщить("Подговтока таблиц = "+ (д2-д1)+ " сек.");
	
	
	Пока ВыборкаЗдания.Следующий()и Сч<Счетчик  Цикл
		Если НаборП<>Неопределено тогда
			НаборП.Загрузить(ТаблП);
			НаборП.Записать(истина);
		КонецЕсли;	
		Выборка = ВыборкаЗдания.Выбрать();
		Сообщить("    Обработка здания: "+ ВыборкаЗдания.Здание.Код + " -  ( "+Выборка.Количество()+ " л/с)" );
		ДокРегистратор = неопределено;
		Пока Выборка.Следующий() цикл		
			Если ДокРегистратор = неопределено тогда
				Запрос = новый запрос;
				Запрос.УстановитьПараметр("ЛС",Выборка.ЛС);
				Запрос.Текст = 
					 "ВЫБРАТЬ ПЕРВЫЕ 1
					 |	бит_ПроживающиеПоЛС.Регистратор КАК Регистратор
					 |ИЗ
					 |	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
					 |ГДЕ
					 |	бит_ПроживающиеПоЛС.ЛицевойСчет = &ЛС
					 |  и Регистратор Ссылка Документ.ОперацияБух
					 |
					 |УПОРЯДОЧИТЬ ПО
					 |	бит_ПроживающиеПоЛС.Регистратор.Дата УБЫВ";
				ВыборкаДок = Запрос.Выполнить().Выбрать();
				Если ВыборкаДок.Следующий() тогда
					ДокРегистратор = ВыборкаДок.Регистратор;
				иначе
					ДокОбъект = Документы.ОперацияБух.СоздатьДокумент();
					ДокОбъект.Дата = '2018-07-01';
					ДокОбъект.Организация = Выборка.ЛС.Организация;
					ДокОбъект.Содержание = "Данные по проживающим, дом "+Выборка.Здание.Код;
					ДокОбъект.Комментарий = ДокОбъект.Содержание;
					ДокОбъект.Записать();
					ДокРегистратор = ДокОбъект.Ссылка;					
				КонецЕсли;	
				НаборП = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
				НаборП.Отбор.Регистратор.Значение = ДокРегистратор;
				НаборП.Прочитать();
				ТаблП = НаборП.Выгрузить();
			КонецЕсли;	
			
						
			//обработка данных ЛС
			
			//СтрокаЛС = ТаблЛС.Найти(Выборка.ЛС,"ЛС");
			
			//Убираем старые записи
			Отбор = новый структура("ЛицевойСчет",Выборка.ЛС);
			СтрокиЛС = ТаблП.НайтиСтроки(Отбор);
			
			//Сообщить("ЛС " + Выборка.ЛС + " НАйдено записей - "+ СтрокиЛС.Количество());
			//Удаляем исходные строки
			Для каждого Строка из СтрокиЛС цикл
				Инд = ТаблП.Индекс(Строка);
				ТаблП.Удалить(Инд);			
			КонецЦикла;	        
			
			
						
			ОтборИсх = новый Структура("ЛС,Игнорировать",Выборка.ЛС,ложь);
			СтрокиИсх = ТаблИсх.НайтиСтроки(ОтборИсх);
			ТаблИсхЛС = ТаблИсх.Скопировать(СтрокиИсх);
			Если ложь тогда ТаблИсхЛС = новый ТаблицаЗначений КонецЕсли;
			ТаблИсхЛС.Сортировать("Жилец,ДатаПрописки");
			
			
			
			
			ЧислоСтрок = ТаблИсхЛС.Количество();
			Если Выборка.TAR = 0 тогда
				//Выбираем только ответственного и ставим ему "Ответственный не проживает"
				//без указания прописки и выписки
				
				 НовЗапись = ТаблП.Добавить();
				 НовЗапись.ЛицевойСчет   = Выборка.ЛС;
				 НовЗапись.ФизЛицо       = Выборка.ОтветственныйЭ;
				 НовЗапись.Период 		 = НаборП.Отбор.Регистратор.Значение.Дата;
				 НовЗапись.Активность = Истина;
				 НовЗапись.ВладелецКвартиры 	= Перечисления.ДаНет.Нет;
				 НовЗапись.СтатусФизЛица		= ОтветственныйНеПроживает;					
				 НовЗапись.СтепеньРодства       = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
				 НовЗапись.СтатусПроживания     = Перечисления.бит_СтатусПроживания.НеПроживает;
				 НовЗапись.ДатаРегистрации      = '0001-01-01';
				 НовЗапись.ДатаСнятияСРегистрации = '0001-01-01';
				 //НовЗапись.ДатаЗаписи             =  //дата окнчания действия 
				 НовЗапись.ДоляПлощади            = 0;
				 НовЗапись.лб_ДоляПлощадиСтрокой  = 0;
				 НовЗапись.лб_СтрокаРодствДляФЛС  = "л/с закрыт"							   
				
			 иначе
				//Найдем строку ответственного с самой большой датой
				СтрокаТекОтветственного = неопределено;
				ДатаПропискиОтветственного = '0001-01-01';			
				Для Индекс=0 по ТаблИсхЛС.Количество()-1 цикл
					ТекСтрока = ТаблИсхЛС[Индекс];
					Если ложь тогда ТекСтрока = РегистрыСведений.лб_Тест_Жильцы.СоздатьМенеджерЗаписи();  КонецЕсли;					
					Если ТекСтрока.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо и 
						 ТекСтрока.ДатаПрописки >=ДатаПропискиОтветственного 
					тогда
						 СтрокаТекОтветственного = ТекСтрока;
						 ДатаПропискиОтветственного = ТекСтрока.ДатаПрописки;
					КонецЕсли;	 
				КонецЦикла;	
				Если СтрокаТекОтветственного = неопределено тогда
					//вообще нет ответственного - добавляем ответственного сразу в регистр
					 НовЗапись = ТаблП.Добавить();
					 НовЗапись.ЛицевойСчет   = Выборка.ЛС;
					 НовЗапись.ФизЛицо       = Выборка.ОтветственныйЭ;
					 НовЗапись.Период 		 = НаборП.Отбор.Регистратор.Значение.Дата - 24*3600; //на день раньше
					 НовЗапись.Активность = Истина;
					 НовЗапись.ВладелецКвартиры 	= Перечисления.ДаНет.Нет;
					 НовЗапись.СтатусФизЛица		= ОтветственныйНеПроживает;					
					 НовЗапись.СтепеньРодства       = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
					 НовЗапись.СтатусПроживания     = Перечисления.бит_СтатусПроживания.НеПроживает;
					 НовЗапись.ДатаРегистрации      = '0001-01-01';
					 НовЗапись.ДатаСнятияСРегистрации = '0001-01-01';
					 //НовЗапись.ДатаЗаписи             =  //дата окнчания действия 
					 НовЗапись.ДоляПлощади            = 0;
					 НовЗапись.лб_ДоляПлощадиСтрокой  = 0;
					 НовЗапись.лб_СтрокаРодствДляФЛС  = "авто";
				ИначеЕсли  СтрокаТекОтветственного.ДатаВыписки<>'0001-01-01' тогда
					 //Был ответственный, но ушел с л/с
					 ИндексОтв = ТаблИсхЛС.Индекс(СтрокаТекОтветственного);
					 Если ИндексОтв <ТаблИсхЛС.Количество()-1 тогда
						НовСтрока =  ТаблИсхЛС.Вставить(ИндексОтв+1);
					 иначе
						НовСтрока =  ТаблИсхЛС.Добавить();
					 КонецЕсли;	 					 
					 ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаТекОтветственного);
					 СтрокаТекОтветственного.ДатаВыписки = '0001-01-01';					 
					 НовСтрока.ДатаПрописки = СтрокаТекОтветственного.ДатаВыписки+24*3600;;
					 НовСтрока.СтатусФизЛица = ?(НовСтрока.PR_SOB=1,СобственникНеПроживает,ОтветственныйНеПроживает);
					 НовСтрока.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
					 НовСтрока.НужноДобавитьДопСтроку = истина;
					 НовСтрока.ДатаВыписки = '0001-01-01';	
					 
				КонецЕсли;	
				
				 
				Индекс=0;
				ЧислоСтрок = ТаблИсхЛС.Количество();
				Пока  Индекс <= ЧислоСтрок-1 цикл
					СтрокаИсх = ТаблИсхЛС[Индекс];	
					СледСтрока = ?(Индекс= ЧислоСтрок-1,Неопределено,ТаблИсхЛС[Индекс+1]);
 					Если ложь тогда СтрокаИсх = РегистрыСведений.лб_Тест_Жильцы.СоздатьМенеджерЗаписи(); СледСтрока = СтрокаИсх; КонецЕсли;					
					
					ЭтоКрайняяСтрока = СледСтрока=Неопределено или (СледСтрока.Жилец<>СтрокаИсх.Жилец);
					//Данные о собственноси дублируем до крайней записи
					Если НЕ ЭтоКрайняяСтрока и (СтрокаИсх.PR_SOB=1 ) и (СледСтрока.PR_SOB=0) тогда
						ЗаполнитьЗначенияСвойств(СледСтрока,СтрокаИсх,"PR_SOB,D1,D2,SOBST");						
					КонецЕсли;;					
					
					//Если есть дата выписки у собственника или у ответственного (не собственника),
					//в крайней строке, тогда делим строку на две, без даты выписки в каждой
					Если ЭтоКрайняяСтрока и ЗначениеЗаполнено(СтрокаИсх.ДатаВыписки) и 						
						 	(СтрокаИсх.PR_SOB=1)
					тогда	
						Если Индекс = ЧислоСтрок-1 тогда
							СледСтрока = ТаблИсхЛС.Добавить();
						иначе
							СледСтрока = ТаблИсхЛС.Вставить(Индекс+1);
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(СледСтрока,СтрокаИсх);
						СледСтрока.ДатаПрописки = СтрокаИсх.ДатаВыписки+24*3600;
						СледСтрока.ДатаВыписки  = '0001-01-01';
						СледСтрока.СтатусФизЛица = СобственникНеПроживает; 													 
						//СтрокаИсх.ДатаВыписки = '0001-01-01';
						СледСтрока.НужноДобавитьДопСтроку = истина; 
						ЧислоСтрок = ЧислоСтрок+1;                  						
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СтрокаИсх.СтатусФизлица) тогда
						Если ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и не ЗначениеЗаполнено(СтрокаИсх.ДатаВыписки) тогда
							//прописан и не выписан
							СтрокаИсх.СтатусФизлица = ПроживаетПостоянно;
						ИначеЕсли ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и (СтрокаИсх.ДатаВыписки>='2025-01-01') тогда	
							//прописан и выписан после 2025 года
							СтрокаИсх.СтатусФизлица = ПроживаетПостоянно;
							
						ИначеЕсли ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и 
									(СтрокаИсх.ДатаВыписки<'2025-01-01') и 
									(СтрокаИсх.ДатаВыписки>'2019-01-31') тогда	
							//прописан и выписан в будущем, но до  2025 года							
							СтрокаИсх.СтатусФизлица = ПроживаетВременно;
						ИначеЕсли ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) и 									
									(СтрокаИсх.ДатаВыписки<='2019-01-31') тогда	
							//прописан и выписан в прошлом		
							СтрокаИсх.СтатусФизлица = ?(СтрокаИсх.REG_VR=1,
														ПроживаетВременно,
														ПроживаетПостоянно);		
						ИначеЕсли  СтрокаИсх.PR_SOB=1 и НЕ ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) тогда							
							//Собственник не был прописан
							СтрокаИсх.СтатусФизлица = СобственникНеПроживает;
						ИначеЕсли СтрокаИсх.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо и НЕ ЗначениеЗаполнено(СтрокаИсх.ДатаПрописки) тогда														
							//Отвественный (не собственник) не был прописан
							СтрокаИсх.СтатусФизлица	= ОтветственныйНеПроживает;						 
						КонецЕсли;	
							
					КонецЕсли;
				
					Если СтрокаИсх.СтатусФизлица = ПроживаетПостоянно тогда
						СтрокаИсх.СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно
					ИначеЕсли СтрокаИсх.СтатусФизлица = ПроживаетВременно тогда
						СтрокаИсх.СтатусПроживания = Перечисления.бит_СтатусПроживания.Временно	
					иначе	
					    СтрокаИсх.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает
					КонецЕсли;	
					
					 //Заполняем строку в РС.бит_ПроживающиеНаЛС;					
					 НовЗапись = ТаблП.Добавить();
					 НовЗапись.ЛицевойСчет   = СтрокаИсх.ЛС;
					 НовЗапись.ФизЛицо       = СтрокаИсх.Жилец;
					 НовЗапись.Период 		 = НаборП.Отбор.Регистратор.Значение.Дата + Индекс*3600*24;
					 НовЗапись.Активность = Истина;
					 НовЗапись.ВладелецКвартиры =?(СтрокаИсх.PR_SOB = 1,
					 								Перечисления.ДаНет.Да,
													Перечисления.ДаНет.Нет);
					 НовЗапись.СтатусФизЛица		= СтрокаИсх.СтатусФизлица;					
					 НовЗапись.СтепеньРодства       = СтрокаИсх.СтепеньРодства;
					 НовЗапись.СтатусПроживания     = СтрокаИсх.СтатусПроживания;
					 НовЗапись.ДатаРегистрации      = СтрокаИсх.ДатаПрописки;
					 НовЗапись.ДатаСнятияСРегистрации = СтрокаИсх.ДатаВыписки;
					 //НовЗапись.ДатаЗаписи             =  //дата окончания действия 
					 НовЗапись.ДоляПлощади            = ?(СтрокаИсх.D2=0,0,СтрокаИсх.D1/СтрокаИсх.D2);
					 НовЗапись.лб_ДоляПлощадиСтрокой  = сокрЛП(СтрокаИсх.SOBST);
					 НовЗапись.лб_СтрокаРодствДляФЛС  = СтрокаИсх.ОписаниеРодства;	
					 
					 Если СтрокаИсх.НужноДобавитьДопСтроку =истина тогда
						 НовЗапись.лб_ИгнорироватьПериодВКопииФЛС = истина;
					 иначе	 
						 НовЗапись.лб_ИгнорироватьПериодВКопииФЛС = ложь;
						 НовЗапись.лб_ДатаРегистрацииДляФЛС = СтрокаИсх.ДатаПрописки;
						 НовЗапись.лб_ДатаВыпискиДляФЛС = СтрокаИсх.ДатаВыписки;
					 КонецЕсли;

						 
					 
					 Индекс = Индекс+1;
					 
				КонецЦикла;
				
			КонецЕсли;	                          		
			
		КонецЦикла;	 //Лицевой счет
				
		
		
		Сч = Сч+1;
	КонецЦикла;	  //Здание
	
	Если НаборП<>Неопределено тогда
		НаборП.Загрузить(ТаблП);
		НаборП.Записать(истина);
	КонецЕсли;	     
	
//	ДополнитьДаннымиПоСобственникам();	
КонецПроцедуры

&НаКлиенте
Процедура ж_ДобавитьДанныеВБазу(Команда)
	ж_ДобавитьДанныеВБазуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ж_ДобавитьДанныеВБазуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура жж_ЗагрузитьСписокЛС(Команда)
	// Вставить содержимое обработчика.
	
	Объект.ПерезагружаемыеЛС.Очистить();
	
	СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"izm*.dbf");
	Для Каждого ИнфоФ из СписокФайлов цикл
		Если ложь тогда ИнфоФ = новый Файл КонецЕсли;;		
		ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
		
		Сообщить("Начата обработка ... "+ИнфоФ.Имя);
		
		Мас = новый массив(1);          //передаем файл на сервер
		Мас[0] = ЭтаФорма.ИмяФайлаКл;
		ИмяФайлаОкончаниеВыбора(Мас); 
		
		ПередатьФайлНаСервер();
		
		ЗагрузитьСписокИменЛС10();
						
		Сообщить("Обработан файл ... "+ИнфоФ.Имя);					
	КонецЦикла;	                                  

	
	СопоставитьПерезагружаемыеЛС();
	
	
	
	
	
КонецПроцедуры

&НаСервере 
Процедура ЗагрузитьСписокИменЛС10();
	
	ТаблЛС = Объект.ПерезагружаемыеЛС.Выгрузить(); 	
	
	ИмяФайлаСерв = ПутьКВременномуФайлу();
	
	хВ = новый xBase;
	хв.ОткрытьФайл(ИмяФайлаСерв);
	
	хВ.Первая();
	Пока НЕ хВ.ВКонце() цикл
		НовСтрока = ТаблЛС.Добавить();
		НовСтрока.ИмяЛС10 = лев(хВ.LS,10);  		
		хВ.Следующая();			
	КонецЦикла;	
	хВ.ЗакрытьФайл();
	Объект.ПерезагружаемыеЛС.Загрузить(ТаблЛС);	
	
КонецПроцедуры	

&НаСервере
Процедура СопоставитьПерезагружаемыеЛС();
	Табл = Объект.ПерезагружаемыеЛС.Выгрузить();
	Табл.Свернуть("ЛС,Здание,ИмяЛС10","");
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Табл",Табл);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Табл.ИмяЛС10 КАК СТРОКА(10)) КАК ИмяЛС10
		|ПОМЕСТИТЬ ИменаЛС
		|ИЗ
		|	&Табл КАК Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛС,
		|	ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10) КАК ИмяЛС10,
		|	бит_ЛицевыеСчета.Здание КАК Здание
		|ПОМЕСТИТЬ СписокЛС
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИменаЛС.ИмяЛС10 КАК ИмяЛС10,
		|	СписокЛС.Здание КАК Здание,
		|	СписокЛС.ЛС КАК ЛС,
		|	ВЫБОР
		|		КОГДА СписокЛС.ЛС ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибка
		|ПОМЕСТИТЬ ВсеТабл
		|ИЗ
		|	ИменаЛС КАК ИменаЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписокЛС КАК СписокЛС
		|		ПО ИменаЛС.ИмяЛС10 = СписокЛС.ИмяЛС10
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеТабл.ИмяЛС10 КАК ИмяЛС10,
		|	ВсеТабл.Здание КАК Здание,
		|	ВсеТабл.ЛС КАК ЛС
		|ИЗ
		|	ВсеТабл КАК ВсеТабл
		|ГДЕ
		|	ВсеТабл.ЕстьОшибка = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеТабл.ИмяЛС10 КАК ИмяЛС10
		|ИЗ
		|	ВсеТабл КАК ВсеТабл
		|ГДЕ
		|	ВсеТабл.ЕстьОшибка = ИСТИНА";
	
	Массив = ЗАпрос.ВыполнитьПакет();
	Табл = Массив[3].Выгрузить();
	Объект.ПерезагружаемыеЛС.Загрузить(Табл);
	
	
	ВыборкаОшибок = Массив[4].Выбрать();
	Если ложь тогда ВыборкаОшибок = Запрос.Выполнить().Выбрать() КонецЕсли;
	Если ВыборкаОшибок.Количество()>0 тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файлах IZM есть имена ЛС, отсутствующие в базе БИТ ЖКХ: ");
		Пока ВыборкаОшибок.Следующий() цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВыборкаОшибок.ИмяЛС10);
		КонецЦикла;			
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("---- Список перезагружаемых ЛС обновлён----");               	
	
	
КонецПроцедуры

&НаКлиенте
Процедура жж_ЗагрузитьДанныеИзФайлов(Команда)
	// Вставить содержимое обработчика.
	
	ОчиститьВременныйРС();		
	ИмяФайлаСерв = ПутьКВременномуФайлуБезКонтекста();   	
	
		
	СписокФайлов = НАйтиФайлы(ИмяПапкиКл,"projiv*.dbf");
	Для Каждого ИнфоФ из СписокФайлов цикл
		Если ложь тогда 
			ИнфоФ = новый Файл 
		КонецЕсли;;	
		
		ЭтаФорма.ИмяФайлаКл = ИнфоФ.ПолноеИмя;
		
		Сообщить("Начата обработка ... "+ИнфоФ.Имя);
		
		Мас = новый массив(1);          //передаем файл на сервер
		Мас[0] = ЭтаФорма.ИмяФайлаКл;
		ИмяФайлаОкончаниеВыбора(Мас); 
		
		ПередатьФайлНаСервер();
		
		ЗагрузитьИсходныеДанныеЖильцов(ИмяФайлаСерв,ЭтаФорма.ИмяФайлаКл);
						
		Сообщить("Обработан файл ... "+ИнфоФ.Имя);					
	КонецЦикла;	                                  

	МассивСоответствияРО = ПолучитьМассивСтруктурСоответствия();
	ПроверитьИСопоставитьДанныеЖильцов(МассивСоответствияРО);
	

КонецПроцедуры



&НаСервереБезКонтекста
Процедура ОчиститьВременныйРС()
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	Набор.Записать(истина);
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ЗагрузитьИсходныеДанныеЖильцов(ПолноеИмяФайла,Источник)
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();	
	
	хВ = новый xBase;
	хВ.ОткрытьФайл(ПолноеИмяФайла);
	
	СписокПолей = "";
	ИсключаемыеПоля = "POD_YCH,K_LS,PL,";
	
	Для Каждого Поле из хВ.поля цикл
		Если СтрНайти(ИсключаемыеПоля,Поле.Имя+",")=0 тогда
			СписокПолей = СписокПолей+","+Поле.Имя;
		КонецЕсли;	
	КонецЦикла;	
	СписокПолей = сред(СписокПолей,2);
	
	хВ.Первая();
	Пока истина цикл
		Если не ПустаяСтрока(хВ.LS) тогда
			Запись = Набор.Добавить();		
			ЗаполнитьЗначенияСвойств(Запись,хВ);
			Запись.Источник = прав(Источник,150);
		КонецЕсли;	
		Если не хВ.Следующая() тогда
			прервать
		КонецЕсли;				
	КонецЦикла;	
	хВ.ЗакрытьФайл();
	
	//контроль дублей с удалением 
	Табл = Набор.Выгрузить();
	Табл.Колонки.Добавить("Ключ",новый описаниеТипов("Строка"));
	
	УжеВывел = Истина;
	Для каждого СтрокаТ из Табл цикл
		Если СтрНайти(СтрокаТ.FIO,"?") > 0 И УжеВывел Тогда
			Сообщить("Файл " + Источник + " содержит строки где вместо ФИО есть знаки вопроса");
			УжеВывел = Ложь;
		КонецЕсли;
		СтрокаТ.Ключ = СтрокаТ.LS + СтрокаТ.FIO+СтрокаТ.NAME + СтрокаТ.OTCH + СтрокаТ.D_R+строкаТ.D_PR 
	КонецЦикла;	
	
	//Табл.Индексы.Добавить("Ключ");
	Табл.Сортировать("Ключ");
	ЧислоСтрок = Табл.Количество();
	
	Для СчетВниз=1 по ЧислоСтрок-1 цикл 
		Инд = ЧислоСтрок-СчетВниз; 
		Если Табл[инд].Ключ = Табл[инд-1].Ключ тогда 
			Табл.Удалить(инд) 
		КонецЕсли; 
	КонецЦикла; 
	
	Если Табл.Количество()<>Набор.Количество() тогда
		Табл.Колонки.Удалить("Ключ");
		Набор.Загрузить(Табл);
	КонецЕсли;	
	
	Набор.Записать(ложь);

	Попытка
//		Набор.Записать(ложь);
	исключение
		//пробуем записать записями
		НачатьТранзакцию();
		
		////+++Цикл одной строкой
		//Для Инд=1 по Набор.Количество() цикл
		//	Если Инд%1000=0 тогда
		//		ЗафиксироватьТранзакцию();
		//		НачатьТранзакцию();
		//	КонецЕсли;
		//	Запись = РегистрыСведений.лб_Тест_Жильцы.СоздатьМенеджерЗаписи();
		//	ЗаполнитьЗначенияСвойств(Запись,Набор[инд]);
		//	Запись.Записать(истина);
		//КонецЦикла;	
		
		//Для Инд=1 по Набор.Количество()-1 цикл Если Инд%1000=0 тогда ЗафиксироватьТранзакцию();НачатьТранзакцию();	КонецЕсли;Запись = РегистрыСведений.лб_Тест_Жильцы.СоздатьМенеджерЗаписи();ЗаполнитьЗначенияСвойств(Запись,Набор[инд]);	Запись.Записать(истина); КонецЦикла;	
		////---Цикл одной строкой
		
		ЗафиксироватьТранзакцию();	
	КонецПопытки;	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ПолучитьДаты(Набор,ПолеИсточник,ПолеПриемник)
	Для каждого Запись из Набор цикл
		Если лев(Запись[ПолеИсточник],2)="  " тогда
			Запись[ПолеПриемник]= '0001-01-01'
		иначе
			Год = сред(Запись[ПолеИсточник],7,4);
			Если Год <"1900" или Год>"2500" тогда
				Запись[ПолеПриемник]= '0001-01-01';
				продолжить;
			КонецЕсли;	
			Мес = сред(Запись[ПолеИсточник],4,2);
			Ден = лев(Запись[ПолеИсточник],2);
			Попытка
				Запись[ПолеПриемник]= дата(""+Год+Мес+Ден);
			исключение	
				Запись[ПолеПриемник]= '0001-01-01'
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ПодобратьДанныеЗапросом(табл,таблРО)
	Д1 = ТекущаяДата();
	СтрокаПостоянно = "постоянная";
	СтрокаВременно  = "временная";
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Табл",Табл);
	Запрос.УстановитьПараметр("ТаблРО",ТаблРО);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	ТипыПомещенийНежилые = новый массив; //ТипыПомещенийНежилые     = Нежилое + АрендаОИ
	ТипыПомещенийНежилые.Добавить(Справочники.бит_ТипыКвартиры.НежилоеПомещение);
	ТипыПомещенийНежилые.Добавить(Справочники.бит_ТипыКвартиры.НайтиПоНаименованию("Аренда ОИ"));	
	Запрос.УстановитьПараметр("ТипыПомещенийНежилые",ТипыПомещенийНежилые);
	
	Запрос.УстановитьПараметр("СтепеньРодстваНеУказано",Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано);
	Запрос.УстановитьПараметр("ОтветственноеЛицо",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	Запрос.УстановитьПараметр("ПрежнийЖилец",Справочники.бит_СтепениРодстваФизЛиц.НайтиПоКоду("121"));
	
	Запрос.УстановитьПараметр("СтрокаПостоянно",СтрокаПостоянно);
	Запрос.УстановитьПараметр("Постоянно",Перечисления.бит_СтатусПроживания.Постоянно);
	Запрос.УстановитьПараметр("СтрокаВременно",СтрокаВременно);
	Запрос.УстановитьПараметр("Временно",Перечисления.бит_СтатусПроживания.Временно);
    Запрос.УстановитьПараметр("НеПроживает",Перечисления.бит_СтатусПроживания.НеПроживает);
	
	Запрос.УстановитьПараметр("ПостоянноФЛ",Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация);
	Запрос.УстановитьПараметр("ВременноФЛ",Справочники.бит_СтатусФизЛица.ВременнаяРегистрация);
	Запрос.УстановитьПараметр("ВыписанФЛ",Справочники.бит_СтатусФизЛица.Выписан);	
	Запрос.УстановитьПараметр("ОтветственныйНеПроживает",Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Ответственный не проживает"));
	Запрос.УстановитьПараметр("СобственникНеПроживает",Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Собственник не проживает"));
	Запрос.УстановитьПараметр("НеПроживаетФЛ",Справочники.бит_СтатусФизЛица.НайтиПоНаименованию("Не проживает"));
	Запрос.УстановитьПараметр("ПустойСтатусФЛ",Справочники.бит_СтатусФизЛица.ПустаяСсылка());

	
		

	
	
	Запрос.Текст =	
	   "ВЫБРАТЬ
	   |	Табл.LS КАК LS,
	   |	Табл.FIO КАК FIO,
	   |	Табл.NAME КАК NAME,
	   |	Табл.OTCH КАК OTCH,
	   |	Табл.D_R КАК D_R,
	   |	Табл.Месяц КАК Месяц,
	   |	Табл.D_PR КАК D_PR,
	   |	Табл.D_V КАК D_V,
	   |	Табл.Игнорировать КАК Игнорировать,
	   |	Табл.КлючЖильца КАК КлючЖильца,
	   |	Табл.Жилец КАК Жилец,
	   |	Табл.ИмяЛС10 КАК ИмяЛС10,
	   |	Табл.ЛС КАК ЛС,
	   |	Табл.СтатусФизлица КАК СтатусФизлица,
	   |	Табл.СтатусФизлица2 КАК СтатусФизлица2,
	   |	Табл.ДатаРождения КАК ДатаРождения,
	   |	Табл.Источник КАК Источник,
	   |	Табл.Организация КАК Организация,
	   |	Табл.СтатусФизлица КАК СтепеньРодства,
	   |	Табл.ОписаниеРодства КАК ОписаниеРодства,
	   |	Табл.ДатаПрописки КАК ДатаПрописки,
	   |	Табл.ДатаВыписки КАК ДатаВыписки,
	   |	Табл.ДатаЗаписи КАК ДатаЗаписи,
	   |	Табл.СтатусПроживания КАК СтатусПроживания,
	   |	Табл.ЭтоСобственник КАК ЭтоСобственник,
	   |	Табл.ЭтоОтветственный КАК ЭтоОтветственный,
	   |	Табл.НужноДобавитьДопСтроку КАК НужноДобавитьДопСтроку,
	   |	Табл.SNILS КАК SNILS,
	   |	Табл.PR_SOB КАК PR_SOB,
	   |	Табл.D1 КАК D1,
	   |	Табл.D2 КАК D2,
	   |	Табл.FAKT_PR КАК FAKT_PR,
	   |	Табл.REG_VR КАК REG_VR,
	   |	Табл.REG_POST КАК REG_POST,
	   |	Табл.FAKT_ADR КАК FAKT_ADR,
	   |	Табл.SOGL КАК SOGL,
	   |	Табл.DK КАК DK,
	   |	Табл.RODOTN КАК RODOTN,
	   |	Табл.PR КАК PR,
	   |	Табл.STATYS КАК STATYS,
	   |	Табл.RO КАК RO,
	   |	Табл.SOBST КАК SOBST,
	   |	Табл.SOGL1 КАК SOGL1,
	   |	Табл.KV_K КАК KV_K,
	   |	Табл.DOM КАК DOM,
	   |	Табл.KVART КАК KVART,
	   |	Табл.TAR КАК TAR
	   |ПОМЕСТИТЬ Т
	   |ИЗ
	   |	РегистрСведений.лб_Тест_Жильцы КАК Табл
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	   |ПОМЕСТИТЬ НежилыеЛС
	   |ИЗ
	   |	(ВЫБРАТЬ
	   |		бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира
	   |	ИЗ
	   |		РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	   |				&ТекДата,
	   |				Квартира В
	   |					(ВЫБРАТЬ
	   |						бит_СведенияОКвартире.Квартира КАК Квартира
	   |					ИЗ
	   |						РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
	   |					ГДЕ
	   |						бит_СведенияОКвартире.ТипКвартиры В (&ТипыПомещенийНежилые))) КАК бит_СведенияОКвартиреСрезПоследних
	   |	ГДЕ
	   |		бит_СведенияОКвартиреСрезПоследних.ТипКвартиры В(&ТипыПомещенийНежилые)) КАК ВложенныйЗапрос
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	   |		ПО ВложенныйЗапрос.Квартира = бит_ЛицевыеСчета.Квартира
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	МАКСИМУМ(бит_Проживающие.Код) КАК Код,
	   |	бит_Проживающие.Наименование КАК Наименование,
	   |	бит_Проживающие.ДатаРождения КАК ДатаРождения
	   |ПОМЕСТИТЬ ЖильцыКоды
	   |ИЗ
	   |	Справочник.бит_Проживающие КАК бит_Проживающие
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	бит_Проживающие.Наименование,
	   |	бит_Проживающие.ДатаРождения
	   |
	   |ИНДЕКСИРОВАТЬ ПО
	   |	Код
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	бит_Проживающие.Ссылка КАК Ссылка,
	   |	бит_Проживающие.Наименование КАК Наименование,
	   |	бит_Проживающие.ДатаРождения КАК ДатаРождения
	   |ПОМЕСТИТЬ Жильцы
	   |ИЗ
	   |	Справочник.бит_Проживающие КАК бит_Проживающие
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЖильцыКоды КАК ЖильцыКоды
	   |		ПО бит_Проживающие.Код = ЖильцыКоды.Код
	   |			И бит_Проживающие.Наименование = ЖильцыКоды.Наименование
	   |			И бит_Проживающие.ДатаРождения = ЖильцыКоды.ДатаРождения
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	бит_ЛицевыеСчета.Ссылка КАК ЛС,
	   |	ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10) КАК ИмяЛС10,
	   |	ВЫБОР
	   |		КОГДА НежилыеЛС.Ссылка ЕСТЬ NULL
	   |			ТОГДА ЛОЖЬ
	   |		ИНАЧЕ ИСТИНА
	   |	КОНЕЦ КАК ЭтоНежилое
	   |ПОМЕСТИТЬ ЛицСчета
	   |ИЗ
	   |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	   |		ЛЕВОЕ СОЕДИНЕНИЕ НежилыеЛС КАК НежилыеЛС
	   |		ПО (НежилыеЛС.Ссылка = бит_ЛицевыеСчета.Ссылка)
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ВЫРАЗИТЬ(ТаблРО.ИсхРО КАК СТРОКА(50)) КАК ИсхРО,
	   |	ВЫРАЗИТЬ(ТаблРО.НовРО КАК СТРОКА(50)) КАК НовРО
	   |ПОМЕСТИТЬ РО
	   |ИЗ
	   |	&ТаблРО КАК ТаблРО
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ЕСТЬNULL(РО.НовРО, Т.RO) КАК НовРО,
	   |	Т.RO КАК RO,
	   |	ВЫБОР
	   |		КОГДА РО.ИсхРО ЕСТЬ NULL
	   |			ТОГДА ИСТИНА
	   |		ИНАЧЕ ЛОЖЬ
	   |	КОНЕЦ КАК БезСоответствия
	   |ПОМЕСТИТЬ РО2
	   |ИЗ
	   |	Т КАК Т
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РО КАК РО
	   |		ПО (ПОДСТРОКА(Т.RO, 1, 50) = ПОДСТРОКА(РО.ИсхРО, 1, 50))
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	ЕСТЬNULL(РО.НовРО, Т.RO),
	   |	Т.RO,
	   |	ВЫБОР
	   |		КОГДА РО.ИсхРО ЕСТЬ NULL
	   |			ТОГДА ИСТИНА
	   |		ИНАЧЕ ЛОЖЬ
	   |	КОНЕЦ
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	РО2.НовРО КАК НовРО,
	   |	РО2.RO КАК RO,
	   |	ВЫБОР
	   |		КОГДА ПОДСТРОКА(РО2.RO, 1, 2) = ""ПР""
	   |			ТОГДА &ПрежнийЖилец
	   |		ИНАЧЕ ВЫБОР
	   |				КОГДА РО2.БезСоответствия = ИСТИНА
	   |					ТОГДА ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.ПустаяСсылка)
	   |				ИНАЧЕ ЕСТЬNULL(бит_СтепениРодстваФизЛиц.Ссылка, ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.ПустаяСсылка))
	   |			КОНЕЦ
	   |	КОНЕЦ КАК СтепеньРодства
	   |ПОМЕСТИТЬ СтепениРодства
	   |ИЗ
	   |	РО2 КАК РО2
	   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СтепениРодстваФизЛиц КАК бит_СтепениРодстваФизЛиц
	   |		ПО (ПОДСТРОКА(РО2.НовРО, 1, 50) = ПОДСТРОКА(бит_СтепениРодстваФизЛиц.Наименование, 1, 50))
	   |
	   |ИНДЕКСИРОВАТЬ ПО
	   |	RO
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Т.LS КАК LS,
	   |	Т.FIO КАК FIO,
	   |	Т.NAME КАК NAME,
	   |	Т.OTCH КАК OTCH,
	   |	Т.D_R КАК D_R,
	   |	Т.D_PR КАК D_PR,
	   |	Т.Месяц КАК Месяц,
	   |	Т.D_V КАК D_V,
	   |	ВЫБОР
	   |		КОГДА Т.Игнорировать = ИСТИНА
	   |				ИЛИ ЕСТЬNULL(ЛицСчета.ЭтоНежилое, ЛОЖЬ)
	   |			ТОГДА ИСТИНА
	   |		ИНАЧЕ ЛОЖЬ
	   |	КОНЕЦ КАК Игнорировать,
	   |	Т.КлючЖильца КАК КлючЖильца,
	   |	ЕСТЬNULL(Жильцы.Ссылка, ЗНАЧЕНИЕ(Справочник.бит_Проживающие.ПустаяСсылка)) КАК Жилец,
	   |	ПОДСТРОКА(Т.LS, 1, 10) КАК ИмяЛС10,
	   |	ЛицСчета.ЛС КАК ЛС,
	   |	ВЫБОР
	   |		КОГДА Т.ДатаВыписки > ДАТАВРЕМЯ(1, 1, 1)
	   |				И Т.ДатаВыписки < &ТекДата
	   |			ТОГДА &ВыписанФЛ
	   |		КОГДА Т.STATYS = &СтрокаПостоянно
	   |			ТОГДА &ПостоянноФЛ
	   |		КОГДА Т.STATYS = &СтрокаВременно
	   |			ТОГДА &ВременноФЛ
	   |		КОГДА Т.PR_SOB = 1
	   |			ТОГДА &СобственникНеПроживает
	   |		КОГДА Т.KV_K = 1
	   |			ТОГДА &ОтветственныйНеПроживает
	   |		ИНАЧЕ &НеПроживает
	   |	КОНЕЦ КАК СтатусФизлица,
	   |	ВЫБОР
	   |		КОГДА Т.ДатаВыписки = ДАТАВРЕМЯ(1, 1, 1)
	   |				ИЛИ Т.ДатаВыписки >= &ТекДата
	   |			ТОГДА &ПустойСтатусФЛ
	   |		КОГДА Т.PR_SOB = 1
	   |			ТОГДА &СобственникНеПроживает
	   |		КОГДА Т.KV_K = 1
	   |			ТОГДА &ОтветственныйНеПроживает
	   |		ИНАЧЕ &ПустойСтатусФЛ
	   |	КОНЕЦ КАК СтатусФизлица2,
	   |	Т.ДатаРождения КАК ДатаРождения,
	   |	Т.Источник КАК Источник,
	   |	ЕСТЬNULL(ЛицСчета.ЛС.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	   |	ВЫБОР
	   |		КОГДА Т.KV_K = 1
	   |			ТОГДА &ОтветственноеЛицо
	   |		ИНАЧЕ СтепениРодства.СтепеньРодства
	   |	КОНЕЦ КАК СтепеньРодства,
	   |	Т.RODOTN КАК ОписаниеРодства,
	   |	Т.ДатаПрописки КАК ДатаПрописки,
	   |	Т.ДатаВыписки КАК ДатаВыписки,
	   |	ВЫБОР
	   |		КОГДА Т.STATYS ПОДОБНО &СтрокаПостоянно
	   |			ТОГДА &Постоянно
	   |		КОГДА Т.STATYS ПОДОБНО &СтрокаВременно
	   |			ТОГДА &Временно
	   |		ИНАЧЕ &НеПроживает
	   |	КОНЕЦ КАК СтатусПроживания,
	   |	ВЫБОР
	   |		КОГДА Т.PR_SOB = 1
	   |			ТОГДА ИСТИНА
	   |		ИНАЧЕ ЛОЖЬ
	   |	КОНЕЦ КАК ЭтоСобственник,
	   |	ВЫБОР
	   |		КОГДА Т.KV_K = 1
	   |			ТОГДА ИСТИНА
	   |		ИНАЧЕ ЛОЖЬ
	   |	КОНЕЦ КАК ЭтоОтветственный,
	   |	ВЫБОР
	   |		КОГДА Т.ДатаВыписки < &ТекДата
	   |				И Т.ДатаВыписки > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	   |				И (Т.PR_SOB = 1
	   |					ИЛИ Т.KV_K = 1)
	   |			ТОГДА ИСТИНА
	   |		ИНАЧЕ ЛОЖЬ
	   |	КОНЕЦ КАК НужноДобавитьДопСтроку,
	   |	Т.SNILS КАК SNILS,
	   |	Т.PR_SOB КАК PR_SOB,
	   |	Т.D1 КАК D1,
	   |	Т.D2 КАК D2,
	   |	Т.FAKT_PR КАК FAKT_PR,
	   |	Т.REG_VR КАК REG_VR,
	   |	Т.REG_POST КАК REG_POST,
	   |	Т.FAKT_ADR КАК FAKT_ADR,
	   |	Т.SOGL КАК SOGL,
	   |	Т.DK КАК DK,
	   |	Т.RODOTN КАК RODOTN,
	   |	Т.PR КАК PR,
	   |	Т.STATYS КАК STATYS,
	   |	Т.RO КАК RO,
	   |	Т.SOBST КАК SOBST,
	   |	Т.SOGL1 КАК SOGL1,
	   |	Т.KV_K КАК KV_K,
	   |	Т.DOM КАК DOM,
	   |	Т.KVART КАК KVART,
	   |	Т.TAR КАК TAR
	   |ИЗ
	   |	Т КАК Т
	   |		ЛЕВОЕ СОЕДИНЕНИЕ Жильцы КАК Жильцы
	   |		ПО Т.КлючЖильца = Жильцы.Наименование
	   |			И Т.ДатаРождения = Жильцы.ДатаРождения
	   |		ЛЕВОЕ СОЕДИНЕНИЕ ЛицСчета КАК ЛицСчета
	   |		ПО (ПОДСТРОКА(Т.LS, 1, 10) = ПОДСТРОКА(ЛицСчета.ИмяЛС10, 1, 10))
	   |		ЛЕВОЕ СОЕДИНЕНИЕ СтепениРодства КАК СтепениРодства
	   |		ПО (ПОДСТРОКА(Т.RO, 1, 50) = ПОДСТРОКА(СтепениРодства.RO, 1, 50))";
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.лб_Тест_Жильцы КАК Табл","&Табл КАК Табл");
	
	Табл = Запрос.Выполнить().Выгрузить();
	ЗамерВремени(Д1,"Выполнение и выгрузка запроса");
	
	ТестПакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ЗамерВремени(Д1,"Выполение запроса для отладки"); 
	
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьМассивСтруктурСоответствия()
	ТабДок = ЭтаФорма.ТабДокСоответствияРО;
	Массив = новый массив;
	Для НомСтр=2 по Табдок.ВысотаТаблицы цикл
		ИсхРО = СокрЛП(Табдок.Область(НомСтр,1).Текст);
		НовРО = СокрЛП(Табдок.Область(НомСтр,2).Текст);
		Если НЕ ПустаяСтрока(ИсхРО) тогда
			Стру = новый структура("ИсхРО,НовРО",ИсхРО,НовРО);
			Массив.Добавить(Стру);
		КонецЕсли;	
	КонецЦикла;	
	возврат Массив;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбрезатьСтроки(Табл)
	ИменаКолонок = "LS,FIO,NAME,OTCH,SNILS,FAKT_ADR,DK,RODOTN,PR,STATYS,RO,SOBST";
	МассивИменКолонок = СтрРазделить(ИменаКолонок,",");
	
	////Цикл одной строкой+++
	////Исходный цикл
	//Для каждого СтрокаТ из Табл цикл 
	//	Для каждого ИмяКолонки из МассивИменКолонок цикл
	//		СтрокаТ[ИмяКолонки] = СокрЛП(СтрокаТ[ИмяКолонки]) 
	//	КонецЦикла;;	
	//КонецЦикла;
	////
	Для каждого СтрокаТ из Табл цикл Для каждого ИмяКолонки из МассивИменКолонок цикл СтрокаТ[ИмяКолонки] = СокрЛП(СтрокаТ[ИмяКолонки]) КонецЦикла;	КонецЦикла;
	
	////Цикл одной строкой---
КонецПроцедуры	
&НаСервереБезКонтекста
Процедура ЗамерВремени(Д1,знач Текст)
	Д2 = ТекущаяДата();
	Сообщить(Текст + ": " + (Д2-Д1)+" сек.");
	Д1=Д2;
КонецПроцедуры	


&НаСервереБезКонтекста
Процедура ПроверитьИСопоставитьДанныеЖильцов(МассивСоответствийРО);
	Д1= ТекущаяДата();
	Набор = РегистрыСведений.лб_Тест_Жильцы.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Табл = Набор.Выгрузить();
	

	ЗамерВремени(Д1,"Подгрузка врем РС в Табл");
	
	
	ТипСтрока50 = новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки(50));
	ТаблРО = новый ТаблицаЗначений;
	ТаблРО.Колонки.Добавить("ИсхРО",ТипСтрока50);
	ТаблРО.Колонки.Добавить("НовРО",ТипСтрока50);
	Для каждого Стру из МассивСоответствийРО цикл	НовСтрока = ТаблРО.Добавить();  ЗаполнитьЗначенияСвойств(НовСтрока,Стру); КонецЦикла;
	ЗамерВремени(Д1,"Загрузка табл соотвествий РО в ТаблРО");
	
	
	
	//Определим даты
	ПолучитьДаты(Табл,"D_R","ДатаРождения");
	ПолучитьДаты(Табл,"D_PR","ДатаПрописки");
	ПолучитьДаты(Табл,"D_V","ДатаВыписки");
	ЗамерВремени(Д1,"Коррекция дат");
	
	ОбрезатьСтроки(Табл);
	ЗамерВремени(Д1,"Обрезка строк");
			
	//обрежем строки и найдем ФИО, цикл в одной строке
	//
	//Для каждого Запись Из Табл цикл 		
	//	Запись.КлючЖильца = сокрЛП(Запись.FIO)+ " "+сокрЛП(Запись.NAME)+ " "+сокрЛП(Запись.OTCH);
	//  Запись.ЭтоСобственник = Запись.PR_SOB=1; ЭтоОтветственный = Запись.KV_K =1 
	//КонецЦикла;	
	Для каждого Запись Из Табл цикл Запись.КлючЖильца = сокрЛП(Запись.FIO)+ " "+сокрЛП(Запись.NAME)+ " "+сокрЛП(Запись.OTCH);Запись.ЭтоСобственник = Запись.PR_SOB=1; ЭтоОтветственный = Запись.KV_K =1  КонецЦикла;	
	
	ЗамерВремени(Д1,"Расчет ФИО");
	//Подобрать ЛС и жильцов
	
	
	
	
	ПодобратьДанныеЗапросом(Табл,ТаблРО);
	ЗамерВремени (Д1,"Подбор основных значений из базы");
	
	жж_СоздатьОтсутствующихЖильцов(Табл);
	
	//Табл = Набор.Выгрузить();
	Табл.Колонки.Добавить("Ключ",новый описаниеТипов("Строка"));
	Для каждого СтрокаТ из Табл цикл 
		СтрокаТ.Ключ = СтрокаТ.LS + СтрокаТ.FIO+СтрокаТ.NAME + СтрокаТ.OTCH + СтрокаТ.D_R+строкаТ.D_PR; 
		Если ЗначениеЗаполнено(СтрокаТ.Жилец) Тогда
			СпрОбъект = СтрокаТ.Жилец.ПолучитьОбъект();
			СпрОбъект.СтраховойНомерПФР = СтрокаТ.SNILS;
			//СпрОбъект.Комментарий = СтрокаТ.PR;
			//СпрОбъект.ФактАдресПроживающего = СтрокаЖ.FAKT_ADR;
			Если СтрокаТ.SOGL=" " тогда
				; //ничего не делаем
			ИначеЕсли СтрНайти("0OoОо",СтрокаТ.SOGL)>0  тогда   //о - отказ, все похожие символы
				СпрОбъект.лб_СогласиеНаОбработкуПД = Перечисления.лб_ВидСогласияНаОбработкуПД.Отказ			
			ИначеЕсли СтрНайти("Пп",СтрокаТ.SOGL)>0  тогда      //п - паспортный, все похожие символы
				СпрОбъект.лб_СогласиеНаОбработкуПД = Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьПаспортныйСтол;
			ИначеЕсли СтрНайти("3зЗЭэАаaA",СтрокаТ.SOGL)>0  тогда   //з - заявление, а - абонентский, все похожие символы
				СпрОбъект.лб_СогласиеНаОбработкуПД = Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьАбонентскийОтдел;			
			КонецЕсли;	
			СпрОбъект.Записать();
		КонецЕсли;
	КонецЦикла;	
	Табл.Индексы.Добавить("Ключ");
	Табл.Сортировать("Ключ");
	ЧислоСтрок = Табл.Количество();
	Для СчетВниз=1 по ЧислоСтрок-1 цикл Инд = ЧислоСтрок-СчетВниз; Если Табл[инд].Ключ = Табл[инд-1].Ключ тогда Табл.Удалить(инд) КонецЕсли; КонецЦикла; 
	Если Табл.Количество()<>Набор.Количество() тогда
		Табл.Колонки.Удалить("Ключ");
		//Набор.Загрузить(Табл);
	КонецЕсли;		
	
	Набор.Загрузить(Табл);	
	Набор.Записать(истина);
	ЗамерВремени (Д1,"Запись результата в врем регистр");
	//создадим новых жильцов
	
	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура жж_СоздатьОтсутствующихЖильцов(Табл);
	Если ложь тогда Табл = новый таблицаЗначений КонецЕсли;
	ОтборБезЖильцов = новый структура("Игнорировать,Жилец",ложь, Справочники.бит_Проживающие.ПустаяСсылка());	
	СтрокиБезЖильцов = Табл.НайтиСтроки(ОтборБезЖильцов);
	
	Если СтрокиБезЖильцов.Количество()=0 тогда
		возврат
	КонецЕсли;
	
	    	
	
	ТаблБезЖильцов = Табл.Скопировать(СтрокиБезЖильцов,"FIO,NAME,OTCH,КлючЖильца,Жилец,ДатаРождения,SNILS,SOGL,PR,FAKT_ADR");
	ТаблБезЖильцов.Индексы.Добавить("КлючЖильца,ДатаРождения");	
		
	//Удаляем строки-дубли
	СписокПолей = "SNILS,SOGL,PR,FAKT_ADR";
	МассивПолей = СтрРазделить(СписокПолей,",");
		
	ТаблБезЖильцов.Сортировать("КлючЖильца,ДатаРождения УБЫВ");
	ЧислоСтрок = ТаблБезЖильцов.Количество();
	Для СчетВниз = 1 по ЧислоСтрок-1 цикл
		ТекСтрока = ТаблБезЖильцов[ЧислоСтрок - СчетВниз];
		ПредСтрока = ТаблБезЖильцов[ЧислоСтрок - СчетВниз-1];
		Если (ТекСтрока.КлючЖильца = ПредСтрока.КлючЖильца)  и (ТекСтрока.ДатаРождения = ПредСтрока.ДатаРождения) тогда
			Для каждого ИмяПоля из МассивПолей цикл
				Если ПустаяСтрока(ПредСтрока[ИмяПоля]) и не ПустаяСтрока(ТекСтрока[ИмяПоля]) тогда 
					ПредСтрока[ИмяПоля]= ТекСтрока[ИмяПоля];
				КонецЕсли;	
			КонецЦикла;	
			ТаблБезЖильцов.Удалить(ЧислоСтрок - СчетВниз);			
		КонецЕсли;	                                      		
	КонецЦикла;	
	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создание жильцов ( "+ СтрокиБезЖильцов.Количество() + " элем.)"); 

	
	//создаем проживающих
	Для каждого СтрокаЖ из ТаблБезЖильцов цикл
		СпрОбъект = Справочники.бит_Проживающие.СоздатьЭлемент();
		СпрОбъект.Наименование = СтрокаЖ.КлючЖильца;
		СпрОбъект.ДатаРождения = СтрокаЖ.ДатаРождения;
		СпрОбъект.СтраховойНомерПФР = СтрокаЖ.SNILS;
		СпрОбъект.Комментарий = СтрокаЖ.PR;
		СпрОбъект.ФактАдресПроживающего = СтрокаЖ.FAKT_ADR;
		Если СтрокаЖ.SOGL=" " тогда
			; //ничего не делаем
		ИначеЕсли СтрНайти("0OoОо",СтрокаЖ.SOGL)>0  тогда   //о - отказ, все похожие символы
			СпрОбъект.лб_СогласиеНаОбработкуПД = Перечисления.лб_ВидСогласияНаОбработкуПД.Отказ			
		ИначеЕсли СтрНайти("Пп",СтрокаЖ.SOGL)>0  тогда      //п - паспортный, все похожие символы
			СпрОбъект.лб_СогласиеНаОбработкуПД = Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьПаспортныйСтол;
		ИначеЕсли СтрНайти("3зЗЭэАаaA",СтрокаЖ.SOGL)>0  тогда   //з - заявление, а - абонентский, все похожие символы
			СпрОбъект.лб_СогласиеНаОбработкуПД = Перечисления.лб_ВидСогласияНаОбработкуПД.ЕстьАбонентскийОтдел;			
		КонецЕсли;	
		СпрОбъект.Записать();
		
		
		Запись = РегистрыСведений.бит_ФИОПроживающих.СоздатьМенеджерЗаписи();
		Запись.ФизЛицо = СпрОбъект.Ссылка;
		Запись.Период = макс('1900-01-01', СтрокаЖ.ДатаРождения);
		Запись.Фамилия = СтрокаЖ.FIO;
		Запись.имя = СтрокаЖ.NAME;
		Запись.Отчество = СтрокаЖ.OTCH;
		Запись.Записать(истина);   
		
		СтрокаЖ.Жилец = СпрОбъект.Ссылка;
	КонецЦикла;	
	
	//Заполняем проживающих в таблице
	Отбор = Новый структура("КлючЖильца,ДатаРождения");
	Для каждого СтрокаТ из СтрокиБезЖильцов цикл
		ЗаполнитьЗначенияСвойств(Отбор,СтрокаТ);
		НайденныеСтроки = ТаблБезЖильцов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0  тогда
			СтрокаТ.Жилец = НайденныеСтроки[0].Жилец;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	



&НаКлиенте
Процедура жж_ОбработкаЗагруженныхДанныхРегистра(Команда)
	// Вставить содержимое обработчика.
	
	МассивСоответствияРО = ПолучитьМассивСтруктурСоответствия();
	ПроверитьИСопоставитьДанныеЖильцов(МассивСоответствияРО);

КонецПроцедуры


&НаКлиенте
Процедура жж_ОбновитьДанныеВБазеИзРегистра(Команда)
	// Вставить содержимое обработчика.
	ж_ДополнитьЗданияВОтборЛСНаСервере();
	
	ЧислоЛС = Объект.ПерезагружаемыеЛС.Количество();
	Если ЧислоЛС>0 тогда
		СписокЛС = Новый массив(ЧислоЛС);		
		Для инд=0 по ЧислоЛС-1 цикл СписокЛС[инд] = Объект.ПерезагружаемыеЛС[инд].ЛС; КонецЦикла;
	иначе
		СписокЛС = новый массив
	КонецЕсли;	
		
	
	жж_УдалитьЗаписиРегистраПроживающиеНаЛС(СписокЛС);
	
	Если Объект.Дата<'2000-01-01' тогда
		Объект.Дата = '2018-07-01';
	КонецЕсли;	
	
	жж_ДобавитьЗаписиРегистраПроживающиеНаЛС(Объект.Дата,СписокЛС);
	
	лб_ОбновитьКолонкуОтветственныхНаСервере();
	
	сообщить("----Обновлены записи о проживающих в базе данных")
КонецПроцедуры

&НаСервереБезКонтекста
Процедура жж_УдалитьЗаписиРегистраПроживающиеНаЛС(СписокЛС);
	//Ищем где есть записи по жилым, нежилым и игнорируемым
	ПолнаяОчистка = (СписокЛС.Количество()=0);
	
	ТипыНежилых = новый массив;
	ТипыНежилых.Добавить(Справочники.бит_ТипыКвартиры.НежилоеПомещение);
	ТипыНежилых.Добавить(Справочники.бит_ТипыКвартиры.НайтиПоНаименованию("Аренда ОИ"));
	
    ЗапросНежилые = Новый запрос;
	ЗапросНежилые.УстановитьПараметр("Дата",ТекущаяДата());
	ЗапросНежилые.УстановитьПараметр("ТипыНежилых",ТипыНежилых);
	ЗапросНежилые.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияОКвартире.Квартира КАК Квартира
		|ПОМЕСТИТЬ НежилыеКвартиры
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
		|ГДЕ
		|	бит_СведенияОКвартире.ТипКвартиры В(&ТипыНежилых)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НежилыеКвартиры КАК НежилыеКвартиры
		|		ПО бит_ЛицевыеСчета.Квартира = НежилыеКвартиры.Квартира";
		
	НежилыеЛС = ЗапросНежилые.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
	
	Если ПолнаяОчистка = Истина тогда
		//быстро очищаем все доки "Операция бух", без учета ЛС, если полна очистка
		//и все документы "РегистрацияПроживающихПоЛС" для всех ЛС, кроме нежилых
		
		Запрос = новый запрос;
		Запрос.УстановитьПараметр("НежилыеЛС",НежилыеЛС);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ПроживающиеПоЛС.Регистратор КАК Регистратор   
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
			|ГДЕ
			|	бит_ПроживающиеПоЛС.Регистратор ССЫЛКА Документ.ОперацияБух
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_ПроживающиеПоЛС.Регистратор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	бит_ПроживающиеПоЛС.Регистратор
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
			|ГДЕ
			|	бит_ПроживающиеПоЛС.Регистратор ССЫЛКА Документ.бит_РегистрацияПроживающихПоЛС
			|	И НЕ бит_ПроживающиеПоЛС.ЛицевойСчет В (&НежилыеЛС)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
			Если ложь тогда ДокОбъект = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент() КонецЕсли;			
			
			ДокОбъект.Движения.бит_ПроживающиеПоЛС.Очистить();
			ДокОбъект.Движения.бит_ПроживающиеПоЛС.Записать(истина);
			
			Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.бит_РегистрацияПроживающихПоЛС") тогда
				ДокОбъект.УстановитьПометкуУдаления(истина);
				ДокОбъект.Удалить();
			КонецЕсли;	
		КонецЦикла;	            			
	КонецЕсли;		
		
	
	//убираем записи по ЛС из списка, кроме нежилых и игнорируемых в регистре
	
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
	Запрос.УстановитьПараметр("НежилыеЛС",НежилыеЛС);
	Запрос.УстановитьПараметр("ПустойЛС",Справочники.бит_ЛицевыеСчета.ПустаяСсылка());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_Тест_Жильцы.ЛС КАК ЛС
		|ПОМЕСТИТЬ ИгнорируемыеЛС
		|ИЗ
		|	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
		|ГДЕ
		|	лб_Тест_Жильцы.Игнорировать
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка В(&НежилыеЛС)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЛС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ПроживающиеПоЛС.Регистратор КАК Регистратор,
		|	бит_ПроживающиеПоЛС.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ РегистраторыПоЛС
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
		|ГДЕ
		|	бит_ПроживающиеПоЛС.ЛицевойСчет В(&СписокЛС)
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПроживающиеПоЛС.Регистратор,
		|	бит_ПроживающиеПоЛС.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистраторыПоЛС.Регистратор КАК Регистратор,
		|	РегистраторыПоЛС.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	РегистраторыПоЛС КАК РегистраторыПоЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИгнорируемыеЛС КАК ИгнорируемыеЛС
		|		ПО (РегистраторыПоЛС.ЛицевойСчет = ИгнорируемыеЛС.ЛС)
		|ГДЕ
		|	ЕСТЬNULL(ИгнорируемыеЛС.ЛС, &ПустойЛС) = &ПустойЛС
		|ИТОГИ ПО
		|	Регистратор";
	
	ВыборкаДоки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоки.Следующий() цикл
		Если ТипЗнч(ВыборкаДоки.Регистратор) = тип("ДокументСсылка.бит_РегистрацияПроживающихПоЛС") тогда
			ДокОбъект = ВыборкаДоки.Регистратор.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(истина);
			ДокОбъект.Удалить();	
		иначе
			Набор = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Значение = ВыборкаДоки.Регистратор;
			Набор.Прочитать();
			Табл = Набор.Выгрузить();
			
			ВыборкаЛС = ВыборкаДоки.Выбрать();						
			Пока ВыборкаЛС.Следующий() цикл
				Отбор = новый структура("ЛицевойСчет",ВыборкаЛС.ЛицевойСчет);
				СтрокиУдл = Табл.НайтиСтроки(Отбор);
				Для каждого СтрокаУ из СтрокиУдл цикл 
					Табл.Удалить(СтрокаУ);
				КонецЦикла;	
			КонецЦикла;	
			Набор.Загрузить(Табл);			
			Набор.Записать(истина);
		КонецЕсли;	
	КонецЦикла;		
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура жж_ДобавитьЗаписиРегистраПроживающиеНаЛС(Дата,СписокЛС);
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ОтборПоСпискуЛС",истина);
	Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
	Запрос.УстановитьПараметр("Дата",Дата);
	ЗАпрос.УстановитьПараметр("временно",Перечисления.бит_СтатусПроживания.Временно);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_Тест_Жильцы.ЛС КАК ЛС,
		|	лб_Тест_Жильцы.ЛС.Здание КАК ЛСЗдание,
		|	лб_Тест_Жильцы.СтатусФизлица КАК СтатусФизлица,
		|	лб_Тест_Жильцы.СтатусФизлица2 КАК СтатусФизлица2,
		|	лб_Тест_Жильцы.Организация КАК Организация,
		|	лб_Тест_Жильцы.СтепеньРодства КАК СтепеньРодства,
		|	лб_Тест_Жильцы.Жилец КАК Жилец,
		|	лб_Тест_Жильцы.ДатаПрописки КАК ДатаПрописки,
		|	лб_Тест_Жильцы.ДатаВыписки КАК ДатаВыписки,
		|	лб_Тест_Жильцы.ЭтоСобственник КАК ЭтоСобственник,
		|	лб_Тест_Жильцы.ЭтоОтветственный КАК ЭтоОтветственный,
		|	лб_Тест_Жильцы.RO КАК RO,
		|	лб_Тест_Жильцы.НужноДобавитьДопСтроку КАК НужноДобавитьДопСтроку,
		|	лб_Тест_Жильцы.СтатусПроживания КАК СтатусПроживания,
		|	лб_Тест_Жильцы.SOBST КАК SOBST,
		|	лб_Тест_Жильцы.D1 КАК D1,
		|	лб_Тест_Жильцы.D2 КАК D2,
		|	лб_Тест_Жильцы.RODOTN КАК RODOTN
		|ПОМЕСТИТЬ Т
		|ИЗ
		|	РегистрСведений.лб_Тест_Жильцы КАК лб_Тест_Жильцы
		|ГДЕ
		|	лб_Тест_Жильцы.Игнорировать = ЛОЖЬ
		|	И лб_Тест_Жильцы.ЛС В(&СписокЛС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПОДСТРОКА(бит_ПравоустанавливающиеДокументы.Наименование, 1, 10) КАК ИмяЛС10,
		|	МАКСИМУМ(бит_ПравоустанавливающиеДокументы.Код) КАК Код
		|ПОМЕСТИТЬ ИменаДоков
		|ИЗ
		|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
		|ГДЕ
		|	бит_ПравоустанавливающиеДокументы.Наименование ПОДОБНО ""___________""
		|
		|СГРУППИРОВАТЬ ПО
		|	ПОДСТРОКА(бит_ПравоустанавливающиеДокументы.Наименование, 1, 10)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	бит_ПравоустанавливающиеДокументы.Ссылка КАК Документы
		|ПОМЕСТИТЬ ДокиПоЛС
		|ИЗ
		|	ИменаДоков КАК ИменаДоков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО (ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 10) = ПОДСТРОКА(ИменаДоков.ИмяЛС10, 1, 10))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
		|		ПО ИменаДоков.Код = бит_ПравоустанавливающиеДокументы.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЛСЗдание КАК Здание,
		|	&Дата КАК Период,
		|	Т.ЛС КАК ЛицевойСчет,
		|	Т.Жилец КАК ФизЛицо,
		|	Т.СтатусФизлица КАК СтатусФизЛица,
		|	Т.СтепеньРодства КАК СтепеньРодства,
		|	Т.СтатусПроживания КАК СтатусПроживания,
		|	Т.ДатаПрописки КАК ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА Т.СтатусПроживания = &Временно
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ Т.ДатаВыписки
		|	КОНЕЦ КАК ДатаСнятияСРегистрации,
		|	ВЫБОР
		|		КОГДА Т.СтатусПроживания = &Временно
		|			ТОГДА Т.ДатаВыписки
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаЗаписи,
		|	ВЫБОР
		|		КОГДА Т.ЭтоСобственник
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДаНет.Нет)
		|	КОНЕЦ КАК ВладелецКвартиры,
		|	ВЫБОР
		|		КОГДА Т.ЭтоСобственник
		|				И Т.D2 > 0
		|			ТОГДА Т.D1 / Т.D2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДоляПлощади,
		|	Т.СтатусФизлица2 КАК СтатусФизЛицаДляИзменения,
		|	Т.SOBST КАК лб_ДоляПлощадиСтрокой,
		|	Т.RODOTN КАК лб_СтрокаРодствДляФЛС,
		|	ЛОЖЬ КАК лб_ИгнорироватьПериодВКопииФЛС,
		|	Т.ДатаПрописки КАК лб_ДатаРегистрацииДляФЛС,
		|	Т.ДатаВыписки КАК лб_ДатаВыпискиДляФЛС,
		|	Т.НужноДобавитьДопСтроку КАК НужноДобавитьДопСтроку,
		|	ЕСТЬNULL(ДокиПоЛС.Документы, ЗНАЧЕНИЕ(Справочник.бит_ПравоустанавливающиеДокументы.ПустаяСсылка)) КАК ПравоустанавливающиеДокументы
		|ИЗ
		|	Т КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДокиПоЛС КАК ДокиПоЛС
		|		ПО Т.ЛС = ДокиПоЛС.ЛицевойСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	ДатаРегистрации
		|ИТОГИ ПО
		|	Здание";
		
	Если СписокЛС.Количество()=0 тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"лб_Тест_Жильцы.ЛС В(&СписокЛС)","истина");
	КонецЕсли;	
	
	
	ВыборкаДоки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДоки.Следующий() цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаДоки.Здание) тогда
			продолжить
		КонецЕсли;	
		Регистратор = НайтиСоздатьДокОперацияБух(ВыборкаДоки.Здание,Дата);
		Набор = РегистрыСведений.бит_ПроживающиеПоЛС.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Значение = Регистратор;
		Набор.Прочитать();
		
	    ТекФЛ = неопределено;
		ЧислоЗаписейФЛ = 0;
		Выборка = ВыборкаДоки.Выбрать();		
		Пока Выборка.Следующий() цикл
			Если Выборка.ФизЛицо = ТекФЛ тогда
				ЧислоЗаписейФЛ = ЧислоЗаписейФЛ+1;
			иначе 
				ЧислоЗаписейФЛ = 0;
				ТекФЛ = Выборка.ФизЛицо;
			КонецЕсли;	
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,Выборка);		
			Запись.Период = Выборка.Период + ЧислоЗаписейФЛ;
			Если Выборка.НужноДобавитьДопСтроку тогда
				ЧислоЗаписейФЛ = ЧислоЗаписейФЛ+1;
				ДопЗапись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(ДопЗапись,Выборка);				
				ДопЗапись.Период = Выборка.Период +ЧислоЗаписейФЛ;
				ДопЗапись.СтатусФизЛица = Запись.СтатусФизЛицаДляИзменения;
				ДопЗапись.СтатусФизЛицаДляИзменения = Справочники.бит_СтатусФизЛица.ПустаяСсылка();
				ДопЗапись.ДатаРегистрации = Запись.ДатаСнятияСРегистрации + 24*3600;
				ДопЗапись.ДатаСнятияСРегистрации = '0001-01-01';
				ДопЗапись.лб_ИгнорироватьПериодВКопииФЛС=Истина;
			КонецЕсли;	
		КонецЦикла;	
		
		НачПериод = Дата;
		Табл = Набор.Выгрузить();
		Табл.Сортировать("ЛицевойСчет,ФизЛицо,ДатаРегистрации");
		ЧислоСтрок = Табл.Количество();
		Для Инд=0 по ЧислоСтрок-1 цикл Табл[инд].Период = НачПериод+Инд; КонецЦикла;	
		Набор.Загрузить(Табл);
		
		Набор.Записать(истина);		
	КонецЦикла;	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция НайтиСоздатьДокОперацияБух(Здание,Дата)
	Если НЕ ЗначениеЗаполнено(Здание) тогда
		возврат неопределено
	КонецЕсли;	
	
	Комментарий = "Данные по проживающим, дом "+Здание.Код;
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Комментарий",Комментарий);
	Запрос.УстановитьПараметр("Здание",Здание); 
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацияБух.Ссылка КАК Ссылка,
		|	ОперацияБух.ПометкаУдаления
		|		ИЛИ НАЧАЛОПЕРИОДА(ОперацияБух.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|		ИЛИ ОперацияБух.Организация <> ВЫРАЗИТЬ(&Здание КАК Справочник.бит_СписокЗданий).Организация КАК НужноМенятьДок
		|ИЗ
		|	Документ.ОперацияБух КАК ОперацияБух
		|ГДЕ
		|	ОперацияБух.Комментарий ПОДОБНО &Комментарий";
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() тогда
		Если НЕ Выборка.НужноМенятьДок тогда
			возврат выборка.Ссылка;			
		иначе
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ДокОбъект.ПометкаУдаления тогда
				ДокОбъект.УстановитьПометкуУдаления(ложь);
			КонецЕсли;
		КонецЕсли;					
	иначе
		ДокОбъект = Документы.ОперацияБух.СоздатьДокумент();		
	КонецЕсли;	
		
	ДокОбъект.Организация = Здание.Организация;
	ДокОбъект.Дата = НачалоДня(Дата);
	ДокОбъект.Комментарий = Комментарий;
	ДокОбъект.Содержание = Комментарий;
	ДокОбъект.Записать();
	
	возврат ДокОбъект.Ссылка;
	             
КонецФункции	

&НаСервере
Процедура лб_ОбновитьКолонкуОтветственныхНаСервере()
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Ответственный",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ИмеющиесяЛС
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &Ответственный
		|	И бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	ЕСТЬNULL(ИмеющиесяЛС.ФизЛицо, ЗНАЧЕНИЕ(Справочник.бит_Проживающие.ПустаяСсылка)) КАК Ответственный
		|ИЗ
		|	ИмеющиесяЛС КАК ИмеющиесяЛС
		|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО ИмеющиесяЛС.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	Ответственный";
	
	Табл = Запрос.Выполнить().Выгрузить();
	ТекЛС = неопределено;;
	ЧислоЛС = Табл.Количество();
	
	
	////Исходный цикл
	//Для СчетВниз=1 по ЧислоЛС цикл
	//	ТекИнд = ЧислоЛС-СчетВниз;
	//	Если ТекЛС=Табл[ТекИнд].ЛицевойСчет тогда
	//		табл.Удалить(ТекИнд)
	//	иначе
	//		ТекЛС = Табл[ТекИнд].ЛицевойСчет
	//	КонецЕсли;
	//КонецЕсли;	
	
	// Цикл одной строкой
	Для СчетВниз=1 по ЧислоЛС цикл ТекИнд = ЧислоЛС-СчетВниз; Если ТекЛС=Табл[ТекИнд].ЛицевойСчет тогда	табл.Удалить(ТекИнд)иначе ТекЛС = Табл[ТекИнд].ЛицевойСчет КонецЕсли; КонецЦикла;	

	Набор = РегистрыСведений.лб_ОтветственныеЗаЛицевыеСчета.СоздатьНаборЗаписей();
	Набор.Загрузить(Табл);
	Набор.Записать(истина);
КонецПроцедуры	
