
#Область ПроцедурыОбработчикиСобытий

&НаКлиенте
Процедура Ок(Команда)
	
	Если Получено < СуммаОплаты Тогда
		
		// БИТ_ЖКХ 05.03.2015{{
		// Сообщить("Получено меньше суммы оплаты. Измените сумму оплаты.", СтатусСообщения.ОченьВажное);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Получено меньше суммы оплаты. Измените сумму оплаты.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 05.03.2015}}
		
		Закрыть(Неопределено);
		
	Иначе
		
		Структура = Новый Структура;
		
		Структура.Вставить("Итого", ?(ЗначениеЗаполнено(Получено), Получено, СуммаОплаты));
		Структура.Вставить("Сдача", Сдача);
		
		Закрыть(Структура);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОткрытьИзКнопкиОплатаБезСдачи") Тогда
		
		СуммаОплаты = Параметры.ОткрытьИзКнопкиОплатаБезСдачи.СуммаОплаты;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученоПриИзменении(Элемент)
	
	Сдача = ?(Получено > СуммаОплаты, Получено - СуммаОплаты, 0);
	
КонецПроцедуры

#КонецОбласти