
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФизЛицоПриОткрытии             = РегистрСведенийМенеджерЗаписи.ФизЛицо;
	ПериодПриОткрытии              = РегистрСведенийМенеджерЗаписи.Период;
	ГруппаИнвалидностиПриОткрытии  = РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности;
	ДатаВыдачиПриОткрытии 		   = РегистрСведенийМенеджерЗаписи.ДатаВыдачи;
	ИнвалидностьПриОткрытии  	   = РегистрСведенийМенеджерЗаписи.Инвалидность;
	НомерСправкиПриОткрытии		   = РегистрСведенийМенеджерЗаписи.НомерСправки;
	СерияСправкиПриОткрытии        = РегистрСведенийМенеджерЗаписи.СерияСправки;
	СрокДействияСправкиПриОткрытии = РегистрСведенийМенеджерЗаписи.СрокДействияСправки;
	
	Заголовок = Заголовок + " " + РегистрСведенийМенеджерЗаписи.ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период.
	Если РегистрСведенийМенеджерЗаписи.ФизЛицо.Пустая() Тогда
		
	    РегистрСведенийМенеджерЗаписи.ФизЛицо = ФизЛицоПриОткрытии;
		РегистрСведенийМенеджерЗаписи.Период  = ПериодПриОткрытии;
		// Выставим по умолчанию.
		РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности = "III";
		РегистрСведенийМенеджерЗаписи.Инвалидность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если поменяли дату, то тогда новая  запись.
	Если ПериодПриОткрытии <> РегистрСведенийМенеджерЗаписи.Период Тогда
		
		// Если что-то поменяли тогда запишем. 
		Если ГруппаИнвалидностиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности ИЛИ
			ДатаВыдачиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДатаВыдачи ИЛИ
			ИнвалидностьПриОткрытии <> РегистрСведенийМенеджерЗаписи.Инвалидность ИЛИ
			НомерСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.НомерСправки ИЛИ
			СерияСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.СерияСправки ИЛИ
			СрокДействияСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.СрокДействияСправки Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_СведенияОбИнвалидностиПроживающих.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Период              = ПериодПриОткрытии;
			МенеджерЗаписи.ФизЛицо             = РегистрСведенийМенеджерЗаписи.ФизЛицо;			
			МенеджерЗаписи.ГруппаИнвалидности  = ГруппаИнвалидностиПриОткрытии;
			МенеджерЗаписи.ДатаВыдачи	       = ДатаВыдачиПриОткрытии;
			МенеджерЗаписи.Инвалидность 	   = ИнвалидностьПриОткрытии;
			МенеджерЗаписи.НомерСправки        = НомерСправкиПриОткрытии;
			МенеджерЗаписи.СерияСправки	       = СерияСправкиПриОткрытии;
			МенеджерЗаписи.СрокДействияСправки = СрокДействияСправкиПриОткрытии;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Инвалидность"), РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
	ОткрытьФорму("РегистрСведений.бит_СведенияОбИнвалидностиПроживающих.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма);

КонецПроцедуры

#КонецОбласти