
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОбъекта = Параметры.ТипОбъекта;
	ОбрабатыватьТабличныеЧасти = Параметры.ОбрабатыватьТабличныеЧасти;
	МассивВыбранных = Параметры.СписокВыбранных.ВыгрузитьЗначения();
	СписокВыбранных.ЗагрузитьЗначения(МассивВыбранных);
	
	ОбновитьДеревоОбъектов();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоТаблицПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТаблиц.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка = 2 Тогда
		ТекущиеДанные.Пометка = 0;
	КонецЕсли; 
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Если НЕ Родитель = Неопределено Тогда
		
		ПометкаРодителя = ТекущиеДанные.Пометка;
		
		Строки = Родитель.ПолучитьЭлементы();
		
		Для каждого Строка Из Строки Цикл
			Если Строка.Пометка <> ПометкаРодителя Тогда
				ПометкаРодителя = 2;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		Родитель.Пометка = ПометкаРодителя;
		
	Иначе
		
		Строки = ТекущиеДанные.ПолучитьЭлементы();
		
		Для каждого Строка Из Строки Цикл
			Строка.Пометка = ТекущиеДанные.Пометка;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Корень = ДеревоТаблиц.ПолучитьЭлементы();
	
	Для каждого Строка Из Корень Цикл
		
		Строка.Пометка = 0;
		
		ВторойУровень = Строка.ПолучитьЭлементы();
		
		Для каждого СтрокаТаблицы Из ВторойУровень Цикл
			СтрокаТаблицы.Пометка = 0;
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Корень = ДеревоТаблиц.ПолучитьЭлементы();
	
	Для каждого Строка Из Корень Цикл
		
		Строка.Пометка = 1;
		
		ВторойУровень = Строка.ПолучитьЭлементы();
		
		Для каждого СтрокаТаблицы Из ВторойУровень Цикл
			СтрокаТаблицы.Пометка = 1;
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ИмяТипаОбъекта = ?(ТипОбъекта = 1,"Документ","Справочник");
	СписокВыбранных.Очистить();
	
	Корень = ДеревоТаблиц.ПолучитьЭлементы();
	
	Для каждого Строка Из Корень Цикл
		
		Если Не ОбрабатыватьТабличныеЧасти Тогда
			
			Если Строка.Пометка Тогда
				СписокВыбранных.Добавить(Строка.ИмяТаблицы,Строка.ПредставлениеТаблицы)
			КонецЕсли; 
			
		Иначе
			
			ВторойУровень = Строка.ПолучитьЭлементы();
			
			Для каждого СтрокаТаблицы Из ВторойУровень Цикл
				
				Если СтрокаТаблицы.Пометка Тогда
					СписокВыбранных.Добавить(СтрокаТаблицы.ИмяТаблицы,Строка.ПредставлениеТаблицы+" [ ТЧ : "+СтрокаТаблицы.ПредставлениеТаблицы+" ] ")
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ОповеститьОВыборе(СписокВыбранных);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// Процедура обновляет дерево объектов. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьДеревоОбъектов()
	
	Корень = ДеревоТаблиц.ПолучитьЭлементы();
	Корень.Очистить();
	
	МетаданныеОбъектов = Метаданные[?(ТипОбъекта = 1,"Документы","Справочники")];
	ИмяТипаОбъекта     = ?(ТипОбъекта = 1,"Документ","Справочник");
	
	Если ОбрабатыватьТабличныеЧасти Тогда
		Заголовок = "Отбор по табличным частям " +  ?(ТипОбъекта = 1,"документов","справочников");
	Иначе
		Заголовок = "Отбор по " +  ?(ТипОбъекта = 1,"документам","справочникам");
	КонецЕсли;
	
	Для каждого Метаданное Из МетаданныеОбъектов Цикл
		
		Если ОбрабатыватьТабличныеЧасти И Метаданное.ТабличныеЧасти.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Найти(Метаданное.Имя, "бит_") = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Строка                      = Корень.Добавить();
		ИмяМетаданного              = Метаданное.Имя;
		Строка.ИмяТаблицы           = ИмяМетаданного;
		Строка.ПредставлениеТаблицы = Метаданное.Представление();
		
		Если Не ОбрабатыватьТабличныеЧасти Тогда
			
			Если Не СписокВыбранных.НайтиПоЗначению(ИмяМетаданного) = Неопределено Тогда
				Строка.Пометка = Истина;
			КонецЕсли; 
			
		Иначе
			
			ПометкаРодителя = Неопределено;
			ВтройУровень = Строка.ПолучитьЭлементы();
			
			Для каждого ТабличнаяЧасть Из Метаданное.ТабличныеЧасти Цикл
				
				СтрокаТЧ                      = ВтройУровень.Добавить();
				ИмяТаблицы                    = ТабличнаяЧасть.Имя;
				СтрокаТЧ.ИмяТаблицы           = ИмяМетаданного+"."+ИмяТаблицы;
				СтрокаТЧ.ПредставлениеТаблицы = ТабличнаяЧасть.Представление();
				
				Если Не СписокВыбранных.НайтиПоЗначению(ИмяМетаданного+"."+ИмяТаблицы) = Неопределено Тогда
					
					СтрокаТЧ.Пометка = Истина;
					
				КонецЕсли; 
				
				Если ПометкаРодителя = Неопределено Тогда
					ПометкаРодителя = СтрокаТЧ.Пометка;
				ИначеЕсли Не ПометкаРодителя = 2 И ПометкаРодителя <> СтрокаТЧ.Пометка Тогда
					ПометкаРодителя = 2;
				КонецЕсли; 
				
			КонецЦикла; 
			Строка.Пометка = ПометкаРодителя;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры // () 

#КонецОбласти