
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура УстановитьПометкуНаУдалениеДокумента()
	
	ТекущаяСтрока = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		// БИТ_ЖКХ 17.04.2014
		ПометкаУдаления = ПометкаУдаленияНаСервере(ТекущаяСтрока.Документ);
		
		Если НЕ ПометкаУдаления Тогда
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьПометкуНаУдалениеДокументаЗавершение1", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока)), "Пометить элемент на удаление?", РежимДиалогаВопрос.ДаНет); 
			
		Иначе
			
			ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьПометкуНаУдалениеДокументаЗавершение", ЭтотОбъект, Новый Структура("Ответ, ТекущаяСтрока", Ответ, ТекущаяСтрока)), "Снять с элемента пометку на удаление?", РежимДиалогаВопрос.ДаНет); 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуНаУдалениеДокументаЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		ЗаписатьНаСервере(ТекущаяСтрока.Документ,Истина);
		
		ТекущаяСтрока.Картинка = БиблиотекаКартинок.ДокументПомеченНаУдалениеКоннекторВерх;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуНаУдалениеДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = ДополнительныеПараметры.Ответ;
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		ЗаписатьНаСервере(ТекущаяСтрока.Документ,Ложь);
		
		ТекущаяСтрока.Картинка = БиблиотекаКартинок.ДокументЗаписанКоннекторВерх;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПометкаУдаленияНаСервере(Документ)
	
	Возврат Документ.ПометкаУдаления;
	
КонецФункции	

&НаСервере
Процедура ЗаписатьНаСервере(Документ,ПометкаУдаления)
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	ДокументОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	ДокументОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Организация  = Параметры.Организация;
	ДатаЗакрытия = Параметры.ДатаЗакрытия;
	
	ТаблицаДокументовРеализации.Параметры.УстановитьЗначениеПараметра("ДатаНачала" , НачалоМесяца(ДатаЗакрытия));
	ТаблицаДокументовРеализации.Параметры.УстановитьЗначениеПараметра("ДатаКонец"  , КонецМесяца(ДатаЗакрытия));
	ТаблицаДокументовРеализации.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
	ОбновитьДерево();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОбновитьДеревоФормы(Команда)
	
	ОбновитьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДвижения(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура("ДокументСсылка", ТекущаяСтрока.Документ);
		
		ОткрытьФорму("Обработка.бит_КорректировкаДвижений.Форма", 
		ПараметрыФормы, 
		ЭтаФорма, 
		ТекущаяСтрока.Документ);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		ПровестиНаСервере(ТекущаяСтрока.Документ);
		
		ТекущаяСтрока.Картинка = БиблиотекаКартинок.ДокументПроведенКоннекторВерх;
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 17.04.2014
&НаСервере
Процедура ПровестиНаСервере(Документ)
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
// БИТ_ЖКХ 17.04.2014

&НаКлиенте
Процедура Разпровести(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		// БИТ_ЖКХ 17.04.2014
		РазпровестиНаСервере(ТекущаяСтрока.Документ);
		
		Если Не ПометкаУдаленияНаСервере(ТекущаяСтрока.Документ) Тогда
			ТекущаяСтрока.Картинка = БиблиотекаКартинок.ДокументЗаписанКоннекторВерх;
		КонецЕсли;
		// БИТ_ЖКХ 17.04.2014
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 17.04.2014
&НаСервере
Процедура РазпровестиНаСервере(Документ)
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	
	Если Не ДокументОбъект.ПометкаУдаления Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 17.04.2014

&НаКлиенте
Процедура УстановитьПометкуНаУдаление(Команда)
	
	УстановитьПометкуНаУдалениеДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиТабличногоПоляДеревоДокументов

&НаКлиенте
Процедура ДеревоДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	УстановитьПометкуНаУдалениеДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ОбновитьДерево()
	
	Корень = ДеревоДокументов.ПолучитьЭлементы();
	
	Корень.Очистить();
	
	СтрокаКорня = Корень.Добавить();
	СтрокаКорня.Документ  = "Документы начисления пени по лицевым счетам";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала" , НачалоМесяца(ДатаЗакрытия));
	Запрос.УстановитьПараметр("ДатаКонец"  , КонецМесяца(ДатаЗакрытия));
	
	// БИТ_ЖКХ 04.07.2014
	Запрос.УстановитьПараметр("Основание"  , ПредопределенноеЗначение("Документ.бит_ОплатаКУ.ПустаяСсылка"));
	// БИТ_ЖКХ 04.07.2014
	
	Текст = 
	"ВЫБРАТЬ
	|	Документы.Ссылка,
	|	Документы.Проведен,
	|	Документы.ПометкаУдаления,
	|	Документы.Улица,
	|	Документы.ДокОснование,
	|	Документы.СписокЛицевыхСчетов
	|ИЗ
	|	Документ.бит_НачислениеПениПоЛицевымСчетам КАК Документы
	|ГДЕ
	|	Документы.Организация = &Организация
	|	И Документы.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
	|	И Документы.ДокОснование = &Основание";
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		СтрокаЗамены = "";
		
		Если СтрокаТаблицы.Документ  = "Документы начисления пени по лицевым счетам" Тогда
			
			СтрокаЗамены = "бит_НачислениеПениПоЛицевымСчетам";
			
		КонецЕсли;
		
		Если СтрокаЗамены = "" Тогда
			Возврат;
		КонецЕсли; 
		
		ТекстЗапроса = СтрЗаменить(Текст, "бит_НачислениеПениПоЛицевымСчетам", СтрокаЗамены);
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВторойУровень = СтрокаТаблицы.ПолучитьЭлементы();
			
			НоваяСтрока = ВторойУровень.Добавить();
			НоваяСтрока.Документ = Выборка.Ссылка;
			
			НоваяСтрока.Улица = "ул. " + Выборка.Улица;
			
			НоваяСтрока.ДокументОснование = Выборка.ДокОснование;
			НоваяСтрока.СписокЛицевыхСчетов = Выборка.СписокЛицевыхСчетов;
			
			Если Выборка.ПометкаУдаления Тогда
				
				НоваяСтрока.Картинка = БиблиотекаКартинок.ДокументПомеченНаУдалениеКоннекторВерх;
				
			ИначеЕсли Выборка.Проведен Тогда
				
				НоваяСтрока.Картинка = БиблиотекаКартинок.ДокументПроведенКоннекторВерх;
				
			Иначе
				
				НоваяСтрока.Картинка = БиблиотекаКартинок.ДокументЗаписанКоннекторВерх;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Элементы.ТаблицаДокументовРеализации.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			МетаданныеДокумента = ТекущаяСтрока.Документ.Метаданные();
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ТекущаяСтрока.Документ);
			
			Форма = ПолучитьФорму("Документ."+МетаданныеДокумента.Имя+".Форма.ФормаДокумента", ПараметрыФормы);
			
			Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
				
				Форма.Открыть();
				
			Иначе
				
				Форма = ТекущаяСтрока.Документ.ПолучитьФорму();
				Форма.Открыть();
				
			КонецЕсли; 
			
		#КонецЕсли 
		
		// БИТ_ЖКХ 17.04.2014
		МетаданныеДокументаИмя = МетаданныеДокументаНаСервере(ТекущаяСтрока.Документ);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущаяСтрока.Документ);
		Попытка
			ОткрытьФорму("Документ."+МетаданныеДокументаИмя+".Форма.ФормаДокументаУправляемая", ПараметрыФормы);
		Исключение
			ОткрытьФорму("Документ."+МетаданныеДокументаИмя+".Форма.ФормаДокумента", ПараметрыФормы);
			
		КонецПопытки;
		// БИТ_ЖКХ 17.04.2014
		
	КонецЕсли; 
	
КонецПроцедуры

// БИТ_ЖКХ 17.04.2014
&НаСервере
Функция МетаданныеДокументаНаСервере(Документ)
	
	МетаданныеДокумента = Документ.Метаданные();
	
	Возврат МетаданныеДокумента.Имя;
	
КонецФункции 
// БИТ_ЖКХ 17.04.2014

&НаКлиенте
Процедура ДеревоДокументовПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ТаблицаДокументовРеализации,
	"ДокументОснование",
	ТекущаяСтрока.Документ,
	Истина,
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовРеализацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ТаблицаДокументовРеализации.ТекущиеДанные;
	
	Если Поле = Элементы.ТаблицаДокументовРеализацииДокументРеализации Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Форма = ТекущаяСтрока.ДокументРеализации.ПолучитьФорму();
			Форма.Открыть();
			
		#КонецЕсли
	ИначеЕсли Поле = Элементы.ТаблицаДокументовРеализацииСчетФактура Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			Форма = ТекущаяСтрока.СчетФактура.ПолучитьФорму();
			Форма.Открыть();
			
		#КонецЕсли
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти