
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура открывает форму выбора основной группы пользователя.
//
// Параметры:
//  Пользователь   - СправочникСсылка.Пользователи.
//  ТекущиеДанные  - ТекущиеДанные.
//  Элемент        - Элемент.
//
&НаКлиенте
Процедура ВыбратьОсновнуюГруппуПользователя(Пользователь, ТекущиеДанные, Элемент)
	
	ПараметрыФормы = Новый Структура("Пользователь, ТекущаяГруппа", Пользователь, Запись.ЗначениеНастройки);
	
	ОткрытьФорму("Обработка.бит_РедактированиеНастроекПользователей.Форма.ФормаСпискаДоступныхГруппУправляемая", ПараметрыФормы, Элемент,,,, Новый ОписаниеОповещения("ВыбратьОсновнуюГруппуПользователяЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОсновнуюГруппуПользователяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Запись.ЗначениеНастройки = Результат;
	
КонецПроцедуры // ВыбратьОсновнуюГруппуПользователя()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_НастройкиПользователей;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним список типов для быстрого выбора составных типов.
	МассивТипов  = Метаданные.РегистрыСведений.бит_НастройкиПользователей.Измерения.Пользователь.Тип.Типы();
	СписокТиповПользователь = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	
	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("ВидОбъектаРегистрБухгалтерии" ,Перечисления.бит_ВидыОбъектов.РегистрБухгалтерии);
	фКэшЗначений.Вставить("СписокТиповПользователь"      ,СписокТиповПользователь);
	фКэшЗначений.Вставить("Настройка_ОсновнаяГруппа"	 , ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнаяГруппаПользователя);
	фКэшЗначений.Вставить("СписокУправленческихРегистров",СформироватьСписокУправленческихРегистровБухгалтерии());
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	ИзменениеНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
	,Элемент
	,Запись
	,"Пользователь"
	,фКэшЗначений.СписокТиповПользователь
	,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Запись.Настройка = фКэшЗначений.Настройка_ОсновнаяГруппа Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбратьОсновнуюГруппуПользователя(Запись.Пользователь, Запись, Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция СформироватьСписокУправленческихРегистровБухгалтерии()
	
	СписокОбъектовСистемы = Новый СписокЗначений;
	
	Возврат СписокОбъектовСистемы;
	
КонецФункции // СформироватьСписокУправленческихРегистровБухгалтерии()

&НаСервере
Процедура ИзменениеНастройки()
	
	Запись.ЗначениеНастройки = Запись.Настройка.ТипЗначения.ПривестиЗначение(Запись.ЗначениеНастройки);
	
КонецПроцедуры // ИзменениеНастройки()

#КонецОбласти