
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		РезультатЗапроса = ПолучитьИзВременногоХранилища(Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.РезультатЗапроса);
		
		ТаблицаПени.Загрузить(РезультатЗапроса);
		
		ИтогПоПине = РезультатЗапроса.Итог("Сумма");
		
		Элементы.НадписьИтог.Заголовок = Строка("Итог по пени: " + ИтогПоПине);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти