
#Область ПроцедурыИФункцииОтборов

// Формирует текстовое представление отбора построителя отчета.
//
// Параметры:
// ПостроительОтчетаОтбор - Отбор.
//
// ВозвращаемоеЗначение:
// ПредставлениеОтборы - Строка.
//
Функция СформироватьТекстНастроек(ПостроительОтчетаОтбор)   Экспорт
	
	// Отборы.
	ПредставлениеОтборы = "";
	
	Для каждого Отбор из ПостроительОтчетаОтбор Цикл
		
		Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		
			флВыполнять = ?(Отбор.Использование И Отбор.ПутьКДанным <> "Периодичность",Истина,Ложь);
			
		Иначе	
		
			флВыполнять = ?(Отбор.Использование И Отбор.Имя <> "Периодичность",Истина,Ложь);
			
		КонецЕсли; 
		
		Если флВыполнять Тогда
			
			ПредставлениеОтборы = ПредставлениеОтборы +?(ПустаяСтрока(ПредставлениеОтборы),""," ")+ Отбор.Представление + " ";
			
			Если Отбор.ВидСравнения = ВидСравнения.Интервал Тогда
				
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' > '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеС;
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' И < '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеПо;
				
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы Тогда
				
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' >= '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеС;
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' И <= '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеПо;
				
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяНачало Тогда
				
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' >= '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеС;
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' И < '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеПо;
				
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяОкончание Тогда
				
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' > '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеС;
				ПредставлениеОтборы = ПредставлениеОтборы + НСтр("ru=' И <= '");
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ЗначениеПо;
				
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ВСписке ИЛИ Отбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии ИЛИ Отбор.ВидСравнения = ВидСравнения.НеВСписке ИЛИ Отбор.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
				
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ВидСравнения + " (" + Отбор.Значение + ")";
				
			Иначе
				
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ВидСравнения + " " + Отбор.Значение;
				
			КонецЕсли;
			
			ПредставлениеОтборы = ПредставлениеОтборы + ";";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПредставлениеОтборы;		
	
КонецФункции

// Функция получает область ячеек табличного документа по имени.
//
// Параметры:
// ТабличныйДокумент - ТабличныйДокумент.
// ИмяОбласти        - Строка.
//
Функция ПолучитьОбластьЯчеек(ТабличныйДокумент,ИмяОбласти,ВыводитьСообщения = Ложь)  Экспорт
	
	Попытка
		
		Обл = ТабличныйДокумент.Область(ИмяОбласти);
		Если НЕ ТипЗнч(Обл) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			
			Обл = Неопределено;
			
		КонецЕсли; 
		
	Исключение
		
		Обл = Неопределено;
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось найти область макета по имени: %1!'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяОбласти);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		
	КонецПопытки;
	
	Возврат Обл;
	
КонецФункции // ПолучитьОбластьЯчеек()

// Процедура - обработчик события "ПриИзменении" поля ввода "ВидСравнения". 
// Табличного поля "ОтборВОтчете".
//
// Параметры:
//  ТекущийСтрока          - СтрокаТабличнойЧасти.
//  ПредыдущийВидСравнения - ВидСравнения. 
//
Процедура ОтборВОтчетеВидСравненияПриИзменении(ТекущаяСтрока, ПредыдущийВидСравнения)  Экспорт

    флПредСписокДоступен = СписокДоступен(ПредыдущийВидСравнения);
	флТекСписокДоступен  = СписокДоступен(ТекущаяСтрока.ВидСравнения);
	
	Если НЕ флПредСписокДоступен И флТекСписокДоступен Тогда
		
		// Переключились на вид сравнения со списком - создадим список.
		ТекЗначение = ТекущаяСтрока.Значение;
		
		Список = Новый СписокЗначений();
		Если ЗначениеЗаполнено(ТекЗначение) Тогда
			
			Список.Добавить(ТекЗначение);
			
		КонецЕсли; 
		ТекущаяСтрока.Значение = Список;
		
	КонецЕсли; 
	
	Если флПредСписокДоступен И НЕ флТекСписокДоступен Тогда
		
		// Переключились на вид сравнения без списка - уничтожим список.
		Если ТипЗнч(ТекущаяСтрока.Значение) = Тип("СписокЗначений") Тогда
			
			Список = ТекущаяСтрока.Значение;
			Если Список.Количество()>0 Тогда
				ТекущаяСтрока.Значение = Список[0].Значение;
			Иначе	
				ТекущаяСтрока.Значение = Неопределено;
			КонецЕсли; 
			
		КонецЕсли; 	
		
	КонецЕсли; 	

КонецПроцедуры // ОтборВОтчетеВидСравненияПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля ввода "Значение" табличного поля "ОтборВОтчете".
//
// Параметры:
//  ТекущийСтрока          - СтрокаТабличнойЧасти.
//
Процедура ОтборВОтчетеЗначениеПриИзменении(ТекущаяСтрока) Экспорт
	
	Если  ТипЗнч(ТекущаяСтрока.Значение) = Тип("СписокЗначений") И НЕ СписокДоступен(ТекущаяСтрока.ВидСравнения)  Тогда
		
		ТекущаяСтрока.Значение = Неопределено;	
		ТекстСообщения = "Для вида сравнения """+ТекущаяСтрока.ВидСравнения+""" список недоступен!";
		бит_ОбщегоНазначения.бит_Сообщить(ТекстСообщения,СтатусСообщения.Важное);
		Возврат;
		
	КонецЕсли; 
	
	Если  НЕ ТипЗнч(ТекущаяСтрока.Значение) = Тип("СписокЗначений") И СписокДоступен(ТекущаяСтрока.ВидСравнения)  Тогда
		
		ТекущаяСтрока.Значение = Новый СписокЗначений();	
		Возврат;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Значение) Тогда
		ТекущаяСтрока.Использование = Истина;
	КонецЕсли; 
	
	
КонецПроцедуры // ОтборВОтчетеЗначениеПриИзменении()

// Функция формируем список выбора для отбора в отчете.
//
// Параметры:
//   ТипРезультата - Строка ("СписокЗначений" или "Массив").
//
// Возвращаемое значение:
//   СписокВыбора   – СписокЗначений.
//
Функция СформироватьСписокВыбораДляОтборовВОтчете(ТипРезультата = "СписокЗначений") Экспорт

	Если ТипРезультата = "СписокЗначений" Тогда
		СписокВыбора = Новый СписокЗначений;	
	Иначе	
	    СписокВыбора = Новый Массив;
	КонецЕсли;
	
	СписокВыбора.Добавить(ВидСравнения.Равно);
	СписокВыбора.Добавить(ВидСравнения.НеРавно);
	СписокВыбора.Добавить(ВидСравнения.ВИерархии);
	СписокВыбора.Добавить(ВидСравнения.НеВИерархии);
	СписокВыбора.Добавить(ВидСравнения.ВСписке);
	СписокВыбора.Добавить(ВидСравнения.НеВСписке);
	
    Возврат СписокВыбора;
	
КонецФункции // СформироватьСписокВыбораДляОтборовВОтчете()

// Функция определяет доступен ли данному виду сравнения список.
//
// Параметры:
//  ТекВидСравнения  - ВидСравнения.
//
// Возвращаемое значение:
//   СписокДоступен   - Булево.
//
Функция СписокДоступен(ТекВидСравнения) Экспорт
	
	флСписокДоступен = Ложь;
	
	Если ТекВидСравнения = ВидСравнения.ВСписке ИЛИ ТекВидСравнения = ВидСравнения.НеВСписке Тогда
		
		флСписокДоступен = Истина;	
		
	КонецЕсли; 
	
	Возврат флСписокДоступен;
	
КонецФункции // СписокДоступен()

#КонецОбласти

#Область РаботаСПолемТаблицаПараметров

// Процедура заполняет таблицу параметров значениями из источников.
//
// Параметры:
//  ТаблицаПараметры  - ТаблицаЗначений.
//
Процедура ЗаполнитьТаблицуПараметров(СпособКомпоновки, ТаблицаПараметры) Экспорт

		
	Для каждого СтрокаТчИсточники Из СпособКомпоновки.ИсточникиДанных Цикл
		
		ИсточникДанных = СтрокаТчИсточники.ИсточникДанных;
		ИсточникОбъект = ИсточникДанных.ПолучитьОбъект();
		
		Если ИсточникОбъект <> Неопределено Тогда
			
			НастройкиИсточника = ИсточникОбъект.ПолучитьНастройкиИсточника();
			Если НастройкиИсточника = Неопределено Тогда
				Продолжить;				
			КонецЕсли;
			СтруктураЗначПарам = НастройкиИсточника.ПараметрыПостроителя;
			
			Для каждого СтрокаТаблицы Из ТаблицаПараметры Цикл
				
				Если Не СтруктураЗначПарам.Свойство(СтрокаТаблицы.ИмяПараметра) 
					ИЛИ ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеПараметра) Тогда
					Продолжить;
				КонецЕсли; 					
				
				// Запись значения в таблицу.
				СтрокаТаблицы.ЗначениеПараметра = СтруктураЗначПарам[СтрокаТаблицы.ИмяПараметра];		
				
			КонецЦикла; // По таблице параметров.
			
		КонецЕсли;		
	
	КонецЦикла; // По источникам данных.
	 
КонецПроцедуры // ЗаполнитьТаблицуПараметров()

#КонецОбласти

#Область РаботаСПолемТаблицаОтбор

// Функция-конструктор таблицы, используемой для хранения отборов.
//
// Возвращаемое значение:
//  ТабОтбор – ТаблицаЗначений.
//
Функция ИнициализироватьТаблицуОтбор() Экспорт

	ТабОтбор = Новый ТаблицаЗначений;
	ТабОтбор.Колонки.Добавить("Использование", Новый ОписаниеТипов("Булево"));
	ТабОтбор.Колонки.Добавить("ПутьКДанным", Новый ОписаниеТипов("Строка"));
	ТабОтбор.Колонки.Добавить("ВидСравнения");
	ТабОтбор.Колонки.Добавить("Значение");
	ТабОтбор.Колонки.Добавить("ЗначениеС");
	ТабОтбор.Колонки.Добавить("ЗначениеПО");
	ТабОтбор.Колонки.Добавить("ТипЗначения");
	ТабОтбор.Колонки.Добавить("ЭтоПериодичность", Новый ОписаниеТипов("Булево"));

	Возврат ТабОтбор;
	
КонецФункции // ИнициализироватьТаблицуОтбор()

// Функция возвращает список доступных видов сравнения в зависимости от типа значения. 
//
// Параметры:
//  ИсточникТипов – ОписаниеТипов ИЛИ ДанныеФормыЭлементКоллекции.
//
Функция СписокВыбораВидаСравнения(ИсточникТипов) Экспорт
	
	флЕстьПримитивные = Ложь;
	флЕстьСтрока      = Ложь;
	флЕстьСсылочные   = Ложь;

	флЕстьИерархия    = Ложь;
	
	// Определение типов, возможных в данной строке.
	МассивПримитивные = Новый Массив;
	МассивПримитивные.Добавить(Тип("Строка"));
	МассивПримитивные.Добавить(Тип("Число"));
	МассивПримитивные.Добавить(Тип("Дата"));
	МассивПримитивные.Добавить(Тип("Булево"));
	МассивПримитивные.Добавить(Тип("ХранилищеЗначения"));
	
	ОписаниеПримитивные = Новый ОписаниеТипов(МассивПримитивные);
	
	Если ТипЗнч(ИсточникТипов) = Тип("ОписаниеТипов") Тогда
		МассивТипов = ИсточникТипов.Типы();
		флТолькоБулево = ?(ИсточникТипов = Новый ОписаниеТипов("Булево"), Истина, Ложь);
	ИначеЕсли НЕ ИсточникТипов = Неопределено Тогда
		МассивТипов = ИсточникТипов.ТипЗначения.Типы();
	    флТолькоБулево = ?(ИсточникТипов.ТипЗначения = Новый ОписаниеТипов("Булево"), Истина, Ложь);		
	Иначе
		МассивТипов = Новый Массив;
	КонецЕсли;
	
	Для каждого ТекТип Из МассивТипов Цикл
		
		Если ТекТип = Тип("Строка") Тогда 			
			флЕстьСтрока = Истина; 			
		КонецЕсли; 
		
		Если ОписаниеПримитивные.СодержитТип(ТекТип) Тогда			
			флЕстьПримитивные = Истина;  			
		Иначе	                         			
			флЕстьСсылочные   = Истина;
			Попытка 		
				ОбъектМета = Метаданные.НайтиПоТипу(ТекТип);
				Если Метаданные.ПланыСчетов.Содержит(ОбъектМета) ИЛИ ОбъектМета.Иерархический Тогда
				 	флЕстьИерархия = Истина;
				КонецЕсли;
			Исключение 			
			КонецПопытки;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Формирование списка доступных видов сравнения.
	СписокВидов = Новый СписокЗначений;
	СписокВидов.Добавить(ВидСравнения.Равно);
	СписокВидов.Добавить(ВидСравнения.НеРавно);
	
	Если НЕ флТолькоБулево Тогда
		
		СписокВидов.Добавить(ВидСравнения.ВСписке);
		СписокВидов.Добавить(ВидСравнения.НеВСписке);
		
	КонецЕсли; 
	
	Если флЕстьИерархия Тогда
		СписокВидов.Добавить(ВидСравнения.ВИерархии);
		СписокВидов.Добавить(ВидСравнения.НеВИерархии);
		СписокВидов.Добавить(ВидСравнения.ВСпискеПоИерархии);
		СписокВидов.Добавить(ВидСравнения.НеВСпискеПоИерархии);
		
	КонецЕсли; 	
	
	Если флЕстьПримитивные И НЕ флТолькоБулево Тогда
		
		СписокВидов.Добавить(ВидСравнения.Больше);
		СписокВидов.Добавить(ВидСравнения.БольшеИлиРавно);
		СписокВидов.Добавить(ВидСравнения.Интервал);
		СписокВидов.Добавить(ВидСравнения.ИнтервалВключаяГраницы);
		СписокВидов.Добавить(ВидСравнения.ИнтервалВключаяНачало);
		СписокВидов.Добавить(ВидСравнения.ИнтервалВключаяОкончание);
		СписокВидов.Добавить(ВидСравнения.Меньше);
		СписокВидов.Добавить(ВидСравнения.МеньшеИлиРавно);
		
	КонецЕсли; 
	
	Если флЕстьСтрока Тогда
		
		СписокВидов.Добавить(ВидСравнения.Содержит);
		СписокВидов.Добавить(ВидСравнения.НеСодержит);
		
	КонецЕсли; 
	
	Возврат СписокВидов;
	
КонецФункции // СписокВыбораВидаСравнения()

// Процедура обрабатывает изменение вида сравнения в таблице отбор.
//
// Параметры:
//  ИдСтроки         – Строка.
//  ПредВидСравнения - ВидСравнения.
//
Процедура ИзменениеВидаСравнения(ТекущаяСтрока,ПредВидСравнения) Экспорт
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ТекВидСравнения    = ТекущаяСтрока.ВидСравнения;
		флТекВидДляСписка  = бит_ОбщегоНазначения.ЭтоВидСравненияДляСписка(ТекущаяСтрока.ВидСравнения);
		флПредВидДляСписка = бит_ОбщегоНазначения.ЭтоВидСравненияДляСписка(ПредВидСравнения);
		
		Если флТекВидДляСписка Тогда
			
			Если НЕ флПредВидДляСписка Тогда
				
				Список = Новый СписокЗначений;				
				
				// Создадим список.
				ТекЗначение = ТекущаяСтрока.Значение; 			  			
				Если ЗначениеЗаполнено(ТекЗначение) Тогда 				
					Список.Добавить(ТекЗначение);  				
				КонецЕсли; 
				ТекущаяСтрока.Значение = Список;
				
				// Ограничим типы значений для списка.
				Список.ТипЗначения = ТекущаяСтрока.ТипЗначения;
				
			КонецЕсли; 
			
		Иначе	
			
			Если флПредВидДляСписка Тогда
				
				// Уничтожим список.
				Если ТипЗнч(ТекущаяСтрока.Значение) = Тип("СписокЗначений") Тогда
					
					Список = ТекущаяСтрока.Значение;
					Если Список.Количество() > 0 Тогда
						
						ТекущаяСтрока.Значение = Список[0].Значение;
						
					Иначе
						
						Если ТекущаяСтрока.Свойство("ЗначениеПараметра") И ТекущаяСтрока.Свойство("ДоступныеТипы") Тогда
							ТекущаяСтрока.Значение = ТекущаяСтрока.ДоступныеТипы.ПривестиЗначение(ТекущаяСтрока.ЗначениеПараметра);
						ИначеЕсли ТекущаяСтрока.Свойство("Значение") И ТекущаяСтрока.Свойство("ТипЗначения") Тогда
							ТекущаяСтрока.Значение = ТекущаяСтрока.ТипЗначения.ПривестиЗначение(ТекущаяСтрока.Значение);
						Иначе
							ТекущаяСтрока.Значение = Неопределено;
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 			
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ИзменениеВидаСравнения()

#КонецОбласти

#Область ПроцедурыИФункцииПолученияДанных

// Процедура выполняет проверку текста запроса на наличие синтаксических ошибок.
//
// Параметры:
//  ТекстЗапроса  –Строка.
//  Отказ         -Булево.
//  Заголовок     -Строка.
//  РежимСообщений-Строка  - "Все","Ошибки","Нет".
//
//
Процедура ПроверитьКорректностьТекстаЗапроса(ТекстЗапроса,Отказ,Заголовок="",РежимСообщений="Все")  Экспорт
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	Попытка
		ПостроительЗапроса.Текст = ТекстЗапроса;
		Отказ = Ложь;
	Исключение
		Отказ = Истина;
		Если ВыводитьОшибки Тогда
		
			ТекстСообщения = "Текст запроса не корректен. "+ОписаниеОшибки();
			бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Важное);
		
		КонецЕсли; 
	КонецПопытки;
	
КонецПроцедуры // ПроверитьКорректностьТекстаЗапроса()

// Процедура устанавливаем в построитель отбор, установленный в отчете в поле Отбор.
//
// Параметры:
//  ПостроительЗапроса  – Построитель.
//  ОтборВОтчете        - ТаблицаЗначений.
//
Процедура УстановитьОтборОтчета(ПостроительЗапроса,ОтборВОтчете)  Экспорт

		// Заполним отборы, установленные в форме отчета.
	Если ОтборВОтчете <> Неопределено Тогда
		
		Для каждого СтрокаОтбор Из ОтборВОтчете Цикл
			
			Если СтрокаОтбор.Использование Тогда
				ИмяПоля       = СтрокаОтбор.Имя;
				ПолеНастройки = ПостроительЗапроса.ДоступныеПоля.Найти(ИмяПоля);
				Если ПолеНастройки <> Неопределено И ПолеНастройки.Отбор Тогда
					НовыйЭлОтбора = ПостроительЗапроса.Отбор.Добавить(ИмяПоля);
					НовыйЭлОтбора.ВидСравнения  = СтрокаОтбор.ВидСравнения;
					НовыйЭлОтбора.Значение      = СтрокаОтбор.Значение;
					НовыйЭлОтбора.Использование = Истина;
				КонецЕсли; 
			КонецЕсли; // Использование 
			
		КонецЦикла; // По строкам отборов отчета
		
	КонецЕсли; // Отбор установлен

КонецПроцедуры // УстановитьОтборОтчета()

// Функция упаковывает настройки измерений строк построителя отчета/запроса в структуру.
//
// Параметры:
//  Построитель  - ПостроительОтчета,ПостроительЗапроса.
//
// Возвращаемое значение:
//   ИзмеренияСтроки   - Массив.
//
Функция УпаковатьИзмеренияСтроки(Построитель) Экспорт

	ТипыИзмерений = Новый Соответствие;
	ТипыИзмерений.Вставить(ТипИзмеренияПостроителяЗапроса.Иерархия      ,"Иерархия");
	ТипыИзмерений.Вставить(ТипИзмеренияПостроителяЗапроса.ТолькоИерархия,"ТолькоИерархия");
	ТипыИзмерений.Вставить(ТипИзмеренияПостроителяЗапроса.Элементы      ,"Элементы");
	ТипыИзмерений.Вставить(ТипИзмеренияПостроителяОтчета.Иерархия       ,"Иерархия");
	ТипыИзмерений.Вставить(ТипИзмеренияПостроителяОтчета.ТолькоИерархия ,"ТолькоИерархия");
	ТипыИзмерений.Вставить(ТипИзмеренияПостроителяОтчета.Элементы       ,"Элементы");
	
	ИзмеренияСтроки = Новый Массив;
	
	Для каждого ТекИзмерение Из Построитель.ИзмеренияСтроки Цикл
		
		ТипИзмерения = ТипыИзмерений[ТекИзмерение.ТипИзмерения];
		ТипИзмерения = ?(ТипИзмерения = Неопределено,"Элементы",ТипИзмерения);
		НастройкаИзмерения = Новый Структура("ПутьКДанным,Имя,ТипИзмерения",ТекИзмерение.ПутьКДанным,ТекИзмерение.Имя,ТипИзмерения);
		
		ИзмеренияСтроки.Добавить(НастройкаИзмерения);
				
	КонецЦикла; 

	Возврат ИзмеренияСтроки;
	
КонецФункции // УпаковатьИзмеренияСтроки()

// Процедура восстанавливает настройки измерения строк построителя отчета/запроса.
//
// Параметры:
//  ИзмеренияСтроки  - Массив.
//  Построитель      - ПостроительОтчета,ПостроительЗапроса.
//  Очищать          - Булево.
//  Соединение       - ComObject.
//
Процедура РаспаковатьИзмеренияСтроки(ИзмеренияСтроки,Построитель,Очищать = Ложь, Соединение = Неопределено) Экспорт
	
	Если Очищать Тогда
		
		Построитель.ИзмеренияСтроки.Очистить();
		
	КонецЕсли; 
	
	Для каждого ТекНастройка Из ИзмеренияСтроки Цикл
		
		Если ТипЗнч(Построитель) = Тип("ПостроительЗапроса") 
			 ИЛИ НЕ Соединение = Неопределено Тогда
			 
			 Если Соединение = Неопределено Тогда
				 ТипИзмерения = ТипИзмеренияПостроителяЗапроса[ТекНастройка.ТипИзмерения];
			 Иначе	
				 ТипИзмерения = Соединение.ТипИзмеренияПостроителяЗапроса[ТекНастройка.ТипИзмерения];
			 КонецЕсли;  
			
			Если Построитель.Измерения.Найти(ТекНастройка.Имя) = Неопределено Тогда
				
				Попытка
					
					Построитель.Измерения.Добавить(ТекНастройка.ПутьКДанным,ТекНастройка.Имя,ТипИзмерения);
					
				Исключение
					
				КонецПопытки;
				
			КонецЕсли; 
			
		Иначе	
			
			ТипИзмерения = ТипИзмеренияПостроителяОтчета[ТекНастройка.ТипИзмерения];
			
			Если Построитель.ИзмеренияСтроки.Найти(ТекНастройка.Имя) = Неопределено Тогда
				
				Попытка
					
					Построитель.ИзмеренияСтроки.Добавить(ТекНастройка.ПутьКДанным,ТекНастройка.Имя,ТипИзмерения);
					
				Исключение
					
				КонецПопытки;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // РаспаковатьИзмеренияСтроки()

// Процедура восстанавливает настройки измерения строк построителя отчета/запроса.
//
// Параметры:
//  ИзмеренияСтроки  - Массив.
//  Построитель      - ПостроительОтчета,ПостроительЗапроса.
//  Очищать          - Булево.
//  Соединение       - ComObject.
//
Процедура УстановитьИзмеренияСтроки(ИзмеренияСтроки,Построитель,Очищать = Ложь, Соединение = Неопределено) Экспорт
	
	Если Очищать Тогда
		
		Построитель.ИзмеренияСтроки.Очистить();
		
	КонецЕсли; 
	
	Для каждого ТекНастройка Из ИзмеренияСтроки Цикл
		
		Если ТипЗнч(Построитель) = Тип("ПостроительЗапроса") 
			 ИЛИ НЕ Соединение = Неопределено Тогда
			 
			 Если Соединение = Неопределено Тогда
				 ТипИзмерения = ТипИзмеренияПостроителяЗапроса.Элементы;
			 Иначе	
				 ТипИзмерения = Соединение.ТипИзмеренияПостроителяЗапроса.Элементы;
			 КонецЕсли;  
				
				Попытка
					Построитель.Измерения.Добавить(ТекНастройка.ПутьКДанным,,ТипИзмерения);
				Исключение
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ТекстСообщения = НСтр("ru = 'Не удалось добавить измерение построителя ""%1%""!
												|%2'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ТекНастройка.ПутьКДанным, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецПопытки;
			
		Иначе	
			
			ТипИзмерения = ТипИзмеренияПостроителяОтчета.Элементы;
				
				Попытка
					Построитель.ИзмеренияСтроки.Добавить(ТекНастройка.ПутьКДанным,,ТипИзмерения);
				Исключение
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ТекстСообщения = НСтр("ru = 'Не удалось добавить измерение построителя ""%1%""!
												|%2'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ТекНастройка.ПутьКДанным, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // РаспаковатьИзмеренияСтроки()

// Функция упаковывает порядок построителя в массив структур, для сохранения в ХранилищеЗначения.
//
// Параметры:
//  Построитель – ПостроительОтчета, ПостроительЗапроса.
//
// Возвращаемое значение:
//  Порядок – Массив.
//
Функция УпаковатьПорядокПостроителя(Построитель) Экспорт

	Порядок = Новый Массив;
	
	Для каждого ЭлементПорядка Из Построитель.Порядок Цикл
	
		СтрПорядок = Новый Структура("Имя,Направление,Представление,ПутьКДанным"
		                              ,ЭлементПорядка.Имя
									  ,ЭлементПорядка.Направление
									  ,ЭлементПорядка.Представление
									  ,ЭлементПорядка.ПутьКДанным);
									  
		Порядок.Добавить(СтрПорядок);							  
	
	КонецЦикла; 
	

	Возврат Порядок;
	
КонецФункции // УпаковатьПорядокПостроителя()

// Процедура устанавливает обязательные параметры построителя запроса. 
//
// Параметры:
//  ПостроительЗапроса - ПостроительЗапроса,ComObject.
//  ГраницаНач – Дата,Граница,ComObject.
//  ГраницаКон – Дата,Граница,ComObject.
//  КонецГраница - Булево.
//
Процедура УстановитьОбязательныеПараметры(ПостроительЗапроса,ГраницаНач,ГраницаКон,флКонецГраница) Экспорт

	ПостроительЗапроса.Параметры.Вставить("НачалоПериода",ГраницаНач);
	ПостроительЗапроса.Параметры.Вставить("КонецПериода" ,ГраницаКон);
	ПостроительЗапроса.Параметры.Вставить("МоментВремени",ГраницаКон);
	
	Если флКонецГраница Тогда
		ПостроительЗапроса.Параметры.Вставить("КонецПериодаДата",ГраницаКон.Значение);
	Иначе	
		ПостроительЗапроса.Параметры.Вставить("КонецПериодаДата",ГраницаКон);
	КонецЕсли; 

КонецПроцедуры // УстановитьОбязательныеПараметры()

// Функция конструктор структуры параметров для функции получения данных по источнику.
//
// Параметры:
//  ГраницаНач - Дата, Граница - начало периода извлечения данных.
//  ГраницаКон - Дата, Граница - конец периода извленчения данных.
//  Параметры  - Структура - параметры построителя запроса.
//  Настройка  - Настройка построителя отчета.
//  Поля       - Массив    - выбранные поля построителя.
//  Измерения  - Массив    - измерения, по которым будет производиться расшифровка.
//  ОтборВОтчете               - ТаблицаЗначений - Отборы установленные непосредственно в отчете.
//  ВозвращатьРезультатЗапроса - Булево - Используется при в обработке расшифровки.
//  НастройкаПодключения       - СправочникСсылка.бит_мпд_НастройкиВнешнийПодключений.
//  НастройкаПулаПодключений   - СправочникСсылка.бит_мпд_НастройкиПуловПодключенй. 
//                               Позволяет переопределить настройки подключения для вид ИБ.
//  ПулПодключений - Соответствие - Содержит активные подключения, ключ - НастройкаПодключения, значение - ComObject.
//
// Возвращаемое значение:
//  Результат – СтрПар.
//
Функция КонструкторПараметры_ПолучитьДанныеПоИсточнику(Параметры    = Неопределено
														,Настройка    = Неопределено
														,Поля         = Неопределено
														,Измерения    = Неопределено
														,ОтборВОтчете = Неопределено
														,ВозвращатьРезультатЗапроса = Ложь
														,НастройкаПодключения       = Неопределено
														,ПулПодключений             = Неопределено 
														,НастройкаПулаПодключений   = Неопределено) Экспорт

	СтрПар = Новый Структура;
	СтрПар.Вставить("Параметры"                 ,Параметры);
	СтрПар.Вставить("Настройка"                 ,Настройка);
	СтрПар.Вставить("Поля"                      ,Поля);
	СтрПар.Вставить("Измерения"                 ,Измерения);
	СтрПар.Вставить("ОтборВОтчете"              ,ОтборВОтчете);
	СтрПар.Вставить("ВозвращатьРезультатЗапроса",ВозвращатьРезультатЗапроса);
	СтрПар.Вставить("НастройкаПодключения"      ,НастройкаПодключения);
	СтрПар.Вставить("НастройкаПулаПодключений"  ,НастройкаПулаПодключений);	
	СтрПар.Вставить("ПулПодключений"            ,ПулПодключений);

	Возврат СтрПар;
	
КонецФункции // КонструкторПараметры_ПолучитьДанныеПоИсточнику()

// Функция конструктор структуры параметров для функции получения данных по источнику.
//
// Параметры:
//  МассивЭлементов - Массив - Массив элементов данных.
//  Параметры       - Структура - Параметры построителя запроса.
//  ПоказыватьИндикатор - Булево.
//
// Возвращаемое значение:
//  СтрПар – Структура.
//
Функция КонструкторПараметры_ПолучитьДанныеПоСпособуКомпоновки(МассивЭлементов = Неопределено
                                                               ,Параметры       = Неопределено															   
									                           ,ОтборВОтчете    = Неопределено
									                           ,ПоказыватьИндикатор = Истина
									                           ,НастройкаПулаПодключений = Неопределено) Экспорт

	СтрПар = Новый Структура;
	СтрПар.Вставить("МассивЭлементов"         ,МассивЭлементов);
	СтрПар.Вставить("Параметры"               ,Параметры);
	СтрПар.Вставить("ОтборВОтчете"            ,ОтборВОтчете);
	СтрПар.Вставить("ПоказыватьИндикатор"     ,ПоказыватьИндикатор);
	СтрПар.Вставить("НастройкаПулаПодключений",НастройкаПулаПодключений);

	Возврат СтрПар;
	
КонецФункции // КонструкторПараметры_ПолучитьДанныеСпособКомпоновки()

// Процедура применяет соответствия к ТаблицеРезультат, полученной источником данных.
//
// Параметры:
//  ТаблицаРезультат – ТаблицаЗначений.
//  Источник    - СправочникСсылка.бит_ИсточникиДанных.
//
Процедура ПрименитьСоответствия(ТаблицаРезультат,Источник) Экспорт

	// Подготовим параметры для работы с фиксированными соответствиями.
	СтрСоотв = Новый Структура("СоотвСтатьиРегл,СоотвПодразделения,СоотвНомГруппы");
	
КонецПроцедуры // ПрименитьСоответствия()

// Функция формирует массив подключений, необходимых для получения данных. 
// Учитывается возможность переопределения подключений в настройке пулов.
//
Функция ОпределитьНеобходимыеПодключения(НастройкаПулаПодключений, ИсточникДанных, НастройкаПодключения) Экспорт

	НастройкиПодключений = Новый Массив;							  
	
	Если ЗначениеЗаполнено(НастройкаПулаПодключений) Тогда
		
		// Подключения для видов ИБ переопределяются в настройке пулов подключений.
		СтрОтбор = Новый Структура("ВидИнформационнойБазы",ИсточникДанных.ВидИнформационнойБазы);
		
		МассивСтрок = НастройкаПулаПодключений.НастройкиПодключений.НайтиСтроки(СтрОтбор);
		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			
			НастройкиПодключений.Добавить(СтрокаТаблицы.НастройкаПодключения);
			
		КонецЦикла; 
		
	КонецЕсли; 							  
	
	Если НастройкиПодключений.Количество() = 0 Тогда
		
		// Подключение передано как параметр или берется из источника.
		Если ЗначениеЗаполнено(НастройкаПодключения) Тогда
			НастройкиПодключений.Добавить(НастройкаПодключения); 
		Иначе	
			НастройкиПодключений.Добавить(ИсточникДанных.НастройкаПодключения); 
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат НастройкиПодключений;
	
КонецФункции // ОпределитьНеобходимыеПодключения()

// Процедура добавляет выбранные поля построителя.
//
// Параметры:
//  Построитель – построитель запроса.
//
Процедура ЗаполнитьВыбранныеПоля(Построитель, ИсточникДанных, Очищать = Истина)  Экспорт
	
	Если Очищать Тогда
		
		Построитель.ВыбранныеПоля.Очистить();	
		
	КонецЕсли; 
	
	Для каждого Поле Из ИсточникДанных.Поля Цикл
		
		ИмяПоля = ?(НЕ ПустаяСтрока(Поле.Синоним),Поле.Синоним,Поле.Имя);
		ИмяПоля = СтрЗаменить(ИмяПоля,".","");
		
		Если Поле.Использование  Тогда
			
			Попытка
				ВыбранноеПоле = Построитель.ВыбранныеПоля.Добавить(Поле.Имя,ИмяПоля);
				ВыбранноеПоле.Представление = ИмяПоля;
			Исключение
				ТекстСообщения = ОписаниеОшибки();
				бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьВыбранныеПоля()

// Процедура заменяет имена колонок на синонимы источника данных.
//
// Параметры:
//  ТаблицаДанных – ТаблицаЗначений.
//  ИсточникДанных- СправочникСсылка.бит_ИсточникиДанных.
//
Процедура ПодставитьСинонимыИсточника(ТаблицаДанных,ИсточникДанных) Экспорт

	Для каждого Поле Из ИсточникДанных.Поля Цикл
		
		Если НЕ Поле.Использование Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если ПустаяСтрока(Поле.Синоним) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		КолонкаТаблицы = ТаблицаДанных.Колонки.Найти(Поле.Имя);
		КолонкаТаблицыСиноним = ТаблицаДанных.Колонки.Найти(Поле.Синоним);
		Если КолонкаТаблицы <> Неопределено И КолонкаТаблицыСиноним = Неопределено Тогда
			
			КолонкаТаблицы.Имя = Поле.Синоним;
			
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры // ПодставитьСинонимыИсточника()

// Процедура устанавливает настройки пересчетов по курсам для элементов данных с учетом иерархии.
//
// Параметры:
//  СтрокаВерх – СтрокаДереваЗначений.
//  НастройкиПересчета - Соответствие.
//  НастройкаПоУмолчанию - Структура.
//
Процедура ОпределитьНастройкиПересчетаИерархически(СтрокаВерх, НастройкиПересчета, НастройкаПоУмолчанию)

	 Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		 
		ТекНастройка = НастройкиПересчета[СтрокаДерева.ЭлементДанных];
		Если ТекНастройка = Неопределено Тогда
			
			// Настройка для данного элемента данных не определена.
			// Применяем настройки по умолчанию.
			ТекНастройка = Новый Структура;
		    ТекНастройкаПоУмолчанию = Новый Структура; 
			
			Для каждого КиЗ Из НастройкаПоУмолчанию Цикл
			
				ТекНастройка.Вставить(КиЗ.Ключ, КиЗ.Значение);
				ТекНастройкаПоУмолчанию.Вставить(КиЗ.Ключ, КиЗ.Значение);
			
			КонецЦикла; 
			
			НастройкиПересчета.Вставить(СтрокаДерева.ЭлементДанных, ТекНастройка);
			
		Иначе	
			
			// Проверяем для всех ли ресурсов заданы настройки,. 
			// Для ресурсов у которых нет настроек применяем настройки по-умолчанию.
			
			Для каждого КиЗ Из НастройкаПоУмолчанию Цикл
			
				Если НЕ ТекНастройка.Свойство(КиЗ.Ключ) Тогда
				
					ТекНастройка.Вставить(КиЗ.Ключ, КиЗ.Значение);
				
				КонецЕсли; 
			
			КонецЦикла; 
			
			// Для вложенных элементов данных настройкой по умолчанию становится текущая настройка.
			ТекНастройкаПоУмолчанию = Новый Структура;
			Для каждого КиЗ Из ТекНастройка Цикл
			
				ТекНастройкаПоУмолчанию.Вставить(КиЗ.Ключ, КиЗ.Значение);
			
			КонецЦикла; 
			
		КонецЕсли; 
		
		// Устанавливаем настройки для вложенных элементов данных.
	 	ОпределитьНастройкиПересчетаИерархически(СтрокаДерева, НастройкиПересчета, ТекНастройкаПоУмолчанию);
	 
	 КонецЦикла; 

КонецПроцедуры // ОпределитьНастройкиПересчетаИерархически()

// Получает список полей определенного вида для способа компоновки источника данных.
//
// Параметры:
//  ВидКолонки        – Строка– "Поле","Ресурс".
//  ТипРезультата    - Строка - "Структура","Массив","СписокЗначений".
//
// Возвращаемое значение:
//   МассивПолей   – Массив,СписокЗначений,Структура.
//
Функция ПолучитьСписокПолейДляСпособаКомпоновки(СпособКомпоновки, ВидКолонки, ТипРезультата = "Массив") Экспорт
	
	// Определим тип возвращаемого результата.
	РезультатМассив    = ?(ВРег(ТипРезультата)="МАССИВ",Истина,Ложь);
	РезультатСписок    = ?(ВРег(ТипРезультата)="СПИСОКЗНАЧЕНИЙ",Истина,Ложь);
	РезультатСтруктура = НЕ РезультатМассив И НЕ РезультатСписок;
	
	Если РезультатСтруктура Тогда
		МассивПолей = Новый Структура;
	КонецЕсли; 
	Если РезультатМассив Тогда
		МассивПолей = Новый Массив;
	КонецЕсли; 
	Если РезультатСписок Тогда
		МассивПолей = Новый СписокЗначений;
	КонецЕсли;  
	
	Для каждого СтрокаТаблицы Из СпособКомпоновки.КолонкиТаблицы Цикл
		
		Если ВидКолонки = "Все" Тогда
			Если РезультатСтруктура Тогда
				МассивПолей.Вставить(СтрокаТаблицы.ИмяКолонки);
			Иначе	
				МассивПолей.Добавить(СтрокаТаблицы.ИмяКолонки);
			КонецЕсли; 
		Иначе	
			Если СтрокаТаблицы.ВидКолонки = ВидКолонки Тогда
				
				Если РезультатСтруктура Тогда
					МассивПолей.Вставить(СтрокаТаблицы.ИмяКолонки);
				Иначе	
					МассивПолей.Добавить(СтрокаТаблицы.ИмяКолонки);
				КонецЕсли; 
				
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат МассивПолей;
КонецФункции 

// Процедура формирует список источников, используемых в данном способе компоновки.
//
//
// Параметры:
//
// Возвращаемое значение:
//  РезСписок   - СписокЗначений.
//
Функция СформироватьСписокИсточники(СпособКомпоновки) Экспорт
	
	РезСписок = Новый СписокЗначений;
	
	Для каждого СтрокаТаблицы Из СпособКомпоновки.ИсточникиДанных Цикл
		
		РезСписок.Добавить(СтрокаТаблицы.ИсточникДанных);
		
	КонецЦикла; 
	
	
	Возврат РезСписок;
КонецФункции // СформироватьСписокИсточники()

// Функция сворачивает результат по измерениям. 
// Если имена измерений не переданы, то сворачивает только по группе элемента данных и иерархическому коду.
//
// Параметры:
//  ВходящаяТаблица  - ТаблицаЗначений.
//  МассивРесурсов   - Массив.
//  МассивИзмерений  - Массив.
//
// Возвращаемое значение:
//   ТаблицаРезультат   - ТаблицаЗначений.
//
Функция СвернутьРезультат(ВходящаяТаблица,МассивРесурсов,МассивИзмерений=Неопределено) Экспорт

	ТаблицаРезультат = ВходящаяТаблица.Скопировать();
	
	КолонкиТаблицы   = ТаблицаРезультат.Колонки;
	
	ИменаРесурсов = "";
	Для каждого Ресурс Из МассивРесурсов Цикл
	
		ИменаРесурсов = ИменаРесурсов+?(ПустаяСтрока(ИменаРесурсов),"",",")+Ресурс;
	
	КонецЦикла; 
	
	ИменаИзмерений = "ГруппаЭлементДанных,ЭлементДанных,Кодификатор";
	Если МассивИзмерений <> Неопределено Тогда
		
		Для каждого Измерение Из МассивИзмерений Цикл
			
			ИменаИзмерений = ИменаИзмерений+?(ПустаяСтрока(ИменаИзмерений),"",",")+Измерение;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Попытка
		ТаблицаРезультат.Свернуть(ИменаИзмерений,ИменаРесурсов);	
	Исключение
		ТекстСообщения = НСтр("ru = 'Невозможно сформировать отчет. Измените настройку.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки; 	
	
	Возврат ТаблицаРезультат;
	
КонецФункции // СвернутьРезультатПоГруппам()

// Функция восстанавливает координаты области по имени области.
//
// Параметры:
//  ИмяОбласти  – Строка.
//
// Возвращаемое значение:
//   СтрКоординат   – Структура.
//
Функция ВосстановитьКоординатыОбластиПоИмени(ИмяОбласти) Экспорт

	СтрКоординат = КонструкторСтруктурыКоординат();	
	ТекСтр = ИмяОбласти;
	ТекСтр = СтрЗаменить(ТекСтр,":","");
	ТекСтр = СтрЗаменить(ТекСтр," ","");
	
	СтрКоординат.Верх  = ВосстановитьКоординату(ТекСтр,"R","C");
	СтрКоординат.Лево  = ВосстановитьКоординату(ТекСтр,"C","R");
	СтрКоординат.Низ   = ВосстановитьКоординату(ТекСтр,"R","C");
	СтрКоординат.Право = ВосстановитьКоординату(ТекСтр,"C","R");
	
	Возврат СтрКоординат;

КонецФункции // ВосстановитьКоординатыОбластиПоИмени()

// Функция формирует имя области по координатам.
//
// Параметры:
//  СтрКоординат    – Структура.
//
// Возвращаемое значение:
//   СтрКоординат   – Структура.
//
Функция СформироватьИмяОбластиПоКоординатам(СтрКоординат) Экспорт

	ИмяОбласти = "";
	
	Если СтрКоординат.Верх <> 0 Тогда
	
		ИмяОбласти = ИмяОбласти+"R"+СтрКоординат.Верх;
	
	КонецЕсли; 
	
	Если СтрКоординат.Лево <> 0 Тогда
	
	  ИмяОбласти = ИмяОбласти+"C"+СтрКоординат.Лево;
	
	КонецЕсли; 
	
	Если СтрКоординат.Низ <> 0 Тогда
		
		Если НЕ ПустаяСтрока(ИмяОбласти) Тогда
		
			ИмяОбласти = ИмяОбласти+":";
		
		КонецЕсли; 
		ИмяОбласти = ИмяОбласти+"R"+СтрКоординат.Низ;
	
	КонецЕсли; 
	
	Если СтрКоординат.Право <> 0 Тогда
	
		ИмяОбласти = ИмяОбласти+"C"+СтрКоординат.Право;
	
	КонецЕсли; 
	
	Возврат ИмяОбласти;

КонецФункции // СформироватьИмяОбластиПоКоординатам()

// Процедура восстанавливает координату.
//
// Параметры:
//  ИмяОбласти     – Строка.
//  ИмяКоординаты1 - Строка.
//  ИмяКоординаты2 - Строка.
//
Функция ВосстановитьКоординату(ИмяОбласти,ИмяКоординаты1,ИмяКоординаты2)
	
	Позиция1   = Найти(ИмяОбласти,ИмяКоординаты1);
	Позиция2   = Найти(ИмяОбласти,ИмяКоординаты2);
	Координата = 0;
	Если Позиция1>0 Тогда
		
		СтрКоордината = Сред(ИмяОбласти,Позиция1+1,Позиция2-Позиция1-1);
		Координата    = СтрокуВЧисло(СтрКоордината);		
		
		Если Позиция2 = 0 Тогда
			ИмяОбласти = "";
		Иначе	
			ИмяОбласти  = Сред(ИмяОбласти,Позиция2);
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Координата;
	
КонецФункции //ВосстановитьКоординату()

// Функция восстанавливает число по строковому представлению.
//
// Параметры:
//  СтрПредставление  – Строка.
//
// Возвращаемое значение:
//   РезЧисло   – Число.
//
Функция СтрокуВЧисло(СтрПредставление)

	Попытка
	
		РезЧисло = Число(СтрПредставление);
	
	Исключение
	    РезЧисло = 0;
	КонецПопытки;
	
	Возврат РезЧисло;

КонецФункции // СтрокуВЧисло()

// Функция инициализирует структуру для описания координат области.
//
// Параметры:
//  Лево  – Число.
//  Верх  - Число.
//  Право - Число.
//  Низ   - Число.
//
// Возвращаемое значение:
//   СтрКоординат   – Структура.
//
Функция КонструкторСтруктурыКоординат(Лево=0,Верх=0,Право=0,Низ=0) Экспорт

	СтрКоординат = Новый Структура("Лево,Верх,Право,Низ",Лево,Верх,Право,Низ);
	
	Возврат СтрКоординат;

КонецФункции // КонструкторСтруктурыКоординат()

// Функция формирует имя области табличного документа.
//
// Параметры:
//  Префикс      – Строка.
//  НомерОбласти - Число.
//  Постфикс     - Строка.
//
// Возвращаемое значение:
//   ИмяОбласти   – Строка.
//
Функция СформироватьИмяОбласти(Префикс,НомерОбласти,Длина,Постфикс="")  Экспорт
	
	Длина      = ?(Длина=0,9,Длина);
	СтрФормат  = "ЧЦ="+Длина+"; ЧВН=; ЧГ=";
	ИмяОбласти = Префикс+Формат(НомерОбласти,СтрФормат)+Постфикс;
	
	Возврат ИмяОбласти;
	
КонецФункции // СформироватьИмяОбласти()

// Функция определяет сформировано ли имя области в типовом стиле R<>C<>.
//
// Параметры:
//  ИмяОбласти  – Строка.
//
// Возвращаемое значение:
//   флИмяОбластиТиповое   – Булево.
//
Функция ИмяОбластиТиповое(ИмяОбласти) Экспорт

	флИмяОбластиТиповое = Ложь;
	
	Если Найти(ВРЕГ(ИмяОбласти),"R")>0 ИЛИ Найти(ВРЕГ(ИмяОбласти),"C")>0 Тогда
	
		флИмяОбластиТиповое = Истина;
	
	КонецЕсли; 
	
	Возврат флИмяОбластиТиповое;

КонецФункции // ИмяОбластиТиповое()

// Функция инициализирует структуру настроек расшифровки произвольного отчета.
//
// Возвращаемое значение:
//  СтруктураНастроек – Структура.
//
Функция КонструкторНастройкиРасшифровкиПроизвольногоОтчета()  Экспорт

	СтруктураНастроек = Новый Структура("Заголовок
	                                       |,ИмяОбласти
	                                       |,ЭлементДанных
										   |,НастройкаПодключения
										   |,НастройкаПулаПодключений
										   |,ВидИнформационнойБазы
										   |,ИсточникДанных
										   |,ИмяРесурса
										   |,ВидЯчейки
										   |,ВидЭлементаДанных
										   |,Формула
										   |,ФорматЧисел");
	
	

	Возврат СтруктураНастроек;
	
КонецФункции // КонструкторНастройкиРасшифровкиПроизвольногоОтчета()


// Функция формирует настройку расшифровки произвольного отчета.
//
// Параметры:
//  СтрокаТаблицы  - СтрокаТабличнойЧасти.
//
// Возвращаемое значение:
//   СтруктураНастроек   - Структура.
//
Функция СформироватьНастройкуРасшифровкиПроизвольногоОтчета(СтрокаТаблицы, НастройкаПулаПодключений) Экспорт
	
	СтруктураНастроек = КонструкторНастройкиРасшифровкиПроизвольногоОтчета();	
										   
    СтруктураНастроек.Заголовок                = "";										   
	СтруктураНастроек.ИмяОбласти               = СтрокаТаблицы.Код;
	СтруктураНастроек.ЭлементДанных            = СтрокаТаблицы.ЭлементДанных;
	СтруктураНастроек.НастройкаПодключения     = СтрокаТаблицы.ЭлементДанных.НастройкаПодключения;
	СтруктураНастроек.НастройкаПулаПодключений = НастройкаПулаПодключений;
	СтруктураНастроек.ВидИнформационнойБазы= СтрокаТаблицы.ЭлементДанных.ВидИнформационнойБазы;
	СтруктураНастроек.ИсточникДанных       = СтрокаТаблицы.ЭлементДанных.ИсточникДанных;
	СтруктураНастроек.ИмяРесурса           = СтрокаТаблицы.ИмяРесурса;
	СтруктураНастроек.ВидЯчейки            = СтрокаТаблицы.ВидЯчейки;
	СтруктураНастроек.ВидЭлементаДанных    = СтрокаТаблицы.ЭлементДанных.ВидГруппы;
	СтруктураНастроек.Формула              = СтрокаТаблицы.Формула;
	СтруктураНастроек.ФорматЧисел          = СтрокаТаблицы.ФорматЧисел;

	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьНастройкуРасшифровкиПроизвольногоОтчета()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура выполняет копирование отбора компоновки данных.
//
// Параметры:
//  КоллекцияИсточник – КоллекцияЭлементовОтбораКомпоновкиДанных.
//  КоллекцияПриемник - КоллекцияЭлементовОтбораКомпоновкиДанных.
//
Процедура КопироватьКоллекциюЭлементовОтбора(КоллекцияИсточник, КоллекцияПриемник) Экспорт

	Для каждого ЭлОтбор Из КоллекцияИсточник Цикл
		
		Если ТипЗнч(ЭлОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ЭлОтборНовый = КоллекцияПриемник.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлОтборНовый, ЭлОтбор);
			
		ИначеЕсли ТипЗнч(ЭлОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда	
			
			ГрОтборНовый = КоллекцияПриемник.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ГрОтборНовый, ЭлОтбор);
			КопироватьКоллекциюЭлементовОтбора(ЭлОтбор.Элементы, ГрОтборНовый.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // КопироватьКоллекциюЭлементовОтбора()

// Функция-конструктор структуры, моделирующей элемент отбора.
//
// Возвращаемое значение:
//  ЭО – Структура.
//
Функция ЭлементОтбора() Экспорт
	
	ЭО = Новый Структура("ИмяКласса
	                      |, ПутьКДанным
						  |, Использование
						  |, ВидСравнения
						  |, Значение
						  |, ЗначениеС
						  |, ЗначениеПо
						  |, ТипЗначения
						  |, Представление"
						  , "ЭлементОтбора");
	
	Возврат ЭО;
	
КонецФункции // ЭлементОтбора()

// Функция создает схему компоновки данных по тексту запроса.
//
// Параметры:
// ТекстЗапроса - Строка.
// ИмяНабораДанных - Строка.
//
// Возвращаемое значение:
//  СКД – СхемаКомпоновкиДанных.
//
Функция СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса, ИмяНабораДанных = "НаборДанныхОсновной") Экспорт
	
	СКД = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя 				  = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя 						 = ИмяНабораДанных; 
	НаборДанных.ИсточникДанных 				 = "ИсточникДанных";
	НаборДанных.Запрос 						 = ТекстЗапроса;
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.Текст = ТекстЗапроса;
	Построитель.ЗаполнитьНастройки();
	
	Для каждого ПолеПостроителя Из Построитель.ДоступныеПоля Цикл
		
		Если ПолеПостроителя.Отбор Тогда
			
			ВыбранноеПоле = СКД.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеПостроителя.Имя);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ГруппировкаКомпоновки = СКД.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранноеПоле         = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("АвтовыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	
	Возврат СКД
	
КонецФункции // СоздатьСхемуКомпоновкиПоЗапросу()

// Процедура выполняет конвертацию отбора построителя в отбор компоновщика. 
//
// Параметры:
//  СтрНастроек – Структура.
//  Компоновщик - КомпоновщикНастроекКомпоновкиДанных.
//  ТекстЗапроса - Строка - Текст запроса для инициализации построителя.
//
Процедура КонвертацияОтборПостроителяОтборКомпоновщика(СтрНастроек, Компоновщик, ТекстЗапроса = "") Экспорт

	ОтборПостроителя = Неопределено;
	
	Если СтрНастроек.Свойство("Отбор") Тогда
		
		ОтборПостроителя = СтрНастроек.Отбор;
		
	ИначеЕсли СтрНастроек.Свойство("НастройкиПостроителя") И НЕ ПустаяСтрока(ТекстЗапроса) Тогда	
		
		Построитель = Новый ПостроительОтчета;
		
		Попытка
			Построитель.Текст = ТекстЗапроса;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = 'Не удалось установить текст запроса!
										|%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Построитель.УстановитьНастройки(СтрНастроек.НастройкиПостроителя);
		
		ОтборПостроителя = Построитель.Отбор;
		
	КонецЕсли; 
	
	Если НЕ ОтборПостроителя = Неопределено Тогда
		
		Для каждого эо Из ОтборПостроителя Цикл
			
			СтрВид = КонвертацияВидаСравнения(эо.ВидСравнения);
			
			Если СтрВид.Группа = "НЕТ" Тогда
				
				// Виды сравнения построителя для которых есть соотвествующие виды сравнения компоновки.
				эоКомп = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				эоКомп.Использование  = эо.Использование;				   
				эоКомп.ВидСравнения   = СтрВид.ВидыСравнения[0];
				эоКомп.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(эо.ПутьКДанным);
				эоКомп.ПравоеЗначение = эо.Значение;
				
			Иначе	
				
				// Интервальные виды сравнения для которых в компоновке нет Соответствующих видов сравнения.
				// Для конвертации используем группы элементов отбора компоновки.
				грКомп = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				грКомп.Использование = эо.Использование;
				
				Если СтрВид.Группа = "И" Тогда
					
					грКомп.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
				ИначеЕсли СтрВид.Группа = "ИЛИ" Тогда
					
					грКомп.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
					
				ИначеЕсли СтрВид.Группа = "НЕ" Тогда	  
					
					грКомп.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
					
				Иначе	  
					
					грКомп.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
				КонецЕсли; 
				
				// Значение с.
				эоКомп = грКомп.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				эоКомп.Использование = эо.Использование;
				эоКомп.ВидСравнения  = СтрВид.ВидыСравнения[0];
				эоКомп.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(эо.ПутьКДанным);
				эоКомп.ПравоеЗначение= эо.ЗначениеС;
				
				// Значение по.
				эоКомп = грКомп.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				эоКомп.Использование = эо.Использование;
				эоКомп.ВидСравнения  = СтрВид.ВидыСравнения[1];
				эоКомп.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(эо.ПутьКДанным);
				эоКомп.ПравоеЗначение= эо.ЗначениеПО;
				
				
			КонецЕсли; 
			
		КонецЦикла; // СтрНастроек.Отбор. 
		
	КонецЕсли;  // Есть отбор построителя.
	
КонецПроцедуры // КонвертацияОтборПостроителяОтборКомпоновщика()

// Функция выполняет конвертацию вида сравнения построителя в вид сравнения компоновки данных. 
//
// Параметры:
//  ВидСравненияПостроителя – ВидСравнения.
//
// Возвращаемое значение;
//  СтрВид - Структура.
//
Функция КонвертацияВидаСравнения(ВидСравненияПостроителя) Экспорт

	СтрВид = Новый Структура("Группа, ВидыСравнения", "НЕТ", Новый Массив);
	
	Если ВидСравненияПостроителя = ВидСравнения.Больше Тогда
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Больше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.БольшеИлиРавно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ВИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ВСписке Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ВСпискеПоИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Интервал Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Больше);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Меньше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ИнтервалВключаяГраницы Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ИнтервалВключаяНачало Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Меньше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ИнтервалВключаяОкончание Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Больше);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);				
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Меньше Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Меньше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.МеньшеИлиРавно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеВИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеВСписке Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеВСпискеПоИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеРавно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеСодержит Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеСодержит);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Равно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Равно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Содержит Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Содержит);		
		
	Иначе
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Равно);
		
	КонецЕсли; 

	Возврат СтрВид;
	
КонецФункции // КонвертацияВидаСравнения()

// Функция выполняет адаптацию текста запроса.
// Используемого с построителем запроса для работы с компоновкой данных.
//
// Параметры:
//  вхТекстЗапроса - Строка.
//
// Возвращаемое значение:
//  ТекстЗапроса – Строка.
//
Функция АдаптироватьТекстПостроителяДляКомпоновки(вхТекстЗапроса) Экспорт

	ТекстЗапроса = СтрЗаменить(вхТекстЗапроса, "АВТОУПОРЯДОЧИВАНИЕ", "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса  , "СпрЭлементы.Ссылка.* КАК Ссылка", "Ссылка.*");

	Возврат ТекстЗапроса;
	
КонецФункции // АдаптироватьТекстПостроителяДляКомпоновки()

#КонецОбласти