Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	МассивНачислений = ПолучитьМассивНачислений();
	МассивУчастков = ПолучитьМассивУчастков();
	МассивАдресов = ПолучитьМассивАдресов();
	МассивТиповКвартир = ПолучитьМассивТиповКвартир();
	МассивВидыОплаты = ПолучитьМассивВидовОплат();
	
	Если МассивАдресов.Количество() Тогда
		НаборыДанных = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных;
		НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(НаборыДанных.НаборДанных1.Запрос, "1 = 1", "ЛицевойСчет.Здание В (&Адреса)");
	КонецЕсли; 
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыОплаты", МассивВидыОплаты);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Начисления", МассивНачислений);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипыКвартир", МассивТиповКвартир);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Участки", МассивУчастков);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонецПериода));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", КонецДня(КонецПериода));
	
	Если МассивАдресов.Количество() Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Адреса", МассивАдресов);
	КонецЕсли;

    КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
		
	//ИдентификаторПользНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")));
	//ПараметрПользовНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользНастройки);
	//
	//ЗначениеПериода = Формат(КонецПериода, "ДФ=MM.yyyy");
	//
	//Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	//Параметр = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	//Параметр.Значение = "СВЕДЕНИЯ ПО ОПЛАТАМ за: "+ ЗначениеПериода;
	//Параметр.Использование = Истина;
	//КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
КонецПроцедуры

Функция ПолучитьМассивНачислений()
	
	МассивНачислений = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Начисления.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивНачислений = Начисления.Выгрузить(,"Начисление").ВыгрузитьКолонку("Начисление");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивНачислений.Добавить(НайденнаяСтрока.Начисление);	
		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат МассивНачислений;
	
КонецФункции

Функция ПолучитьМассивУчастков()
	
	МассивУчастков = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Участки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивУчастков = Участки.Выгрузить(,"Участок").ВыгрузитьКолонку("Участок");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивУчастков.Добавить(НайденнаяСтрока.Участок);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивУчастков;
	
КонецФункции

Функция ПолучитьМассивАдресов()
	
	МассивАдресов = Новый Массив;
	
	МассивАдресов = Адреса.Выгрузить(,"Адрес").ВыгрузитьКолонку("Адрес");
	
	Возврат МассивАдресов;
	
КонецФункции

Функция ПолучитьМассивВидовОплат()
	
	МассивВидов = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = ВидыОплат.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивВидов = ВидыОплат.Выгрузить(,"ВидОплаты").ВыгрузитьКолонку("ВидОплаты");
	Иначе	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивВидов.Добавить(НайденнаяСтрока.ВидОплаты);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивВидов;
	
КонецФункции

Функция ПолучитьМассивТиповКвартир()
	
	МассивТиповКвартир = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = ТипыКвартир.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивТиповКвартир = ТипыКвартир.Выгрузить(,"ТипКвартиры").ВыгрузитьКолонку("ТипКвартиры");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивТиповКвартир.Добавить(НайденнаяСтрока.ТипКвартиры);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивТиповКвартир;
	
КонецФункции

