
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура обновляет заголовок формы по выбранному владельцу справочника.
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	Заголовок = "Список подразделений организации " + Организация;
	
КонецПроцедуры // ОбновитьЗаголовок()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 26.06.2014
	ОткрытиеИзОбработкиВыгрузкаКазань = Ложь;
	// БИТ_ЖКХ 26.06.2014
	
	// Проставляем организацию пользователя по умолчанию.
	Если Организация.Пустая() Тогда
		
		Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
		
	КонецЕсли;
	
	Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Организация;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Эл = Дерево.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Организация;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Эл = Дерево.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ЭтоГруппа");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Истина;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Если Параметры.Свойство("ОткрытьИзДокументаУстановкаСоставаРаботы") Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ОткрытьИзДокументаУстановкаСоставаРаботы.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Эл = Дерево.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ОткрытьИзДокументаУстановкаСоставаРаботы.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
	// БИТ_ЖКХ 26.06.2014
	Если Параметры.Свойство("ОткрытьИзОбработкиВыгрузкаКазань") Тогда
		
		Организация = Параметры.ОткрытьИзОбработкиВыгрузкаКазань.Ссылка;
		
		Список.Отбор.Элементы[0].ПравоеЗначение = Организация;	
		Дерево.Отбор.Элементы[0].ПравоеЗначение = Организация;	
		
		ОткрытиеИзОбработкиВыгрузкаКазань = Истина;
	КонецЕсли;
	// БИТ_ЖКХ 26.06.2014
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии()
	
	ОбновитьЗаголовок();
	
	// БИТ_ЖКХ 26.06.2014
	Если ОткрытиеИзОбработкиВыгрузкаКазань Тогда
		
		Элементы.Организация.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	// БИТ_ЖКХ 26.06.2014
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	МассивПодразделений = Новый Массив;
	
	Для каждого СтрМас из Элементы.Список.ВыделенныеСтроки Цикл
		
		// БИТ_ЖКХ_24012014_начало_изменений
		Если Не ПолучитьЭтоГруппаНаСервере(СтрМас) Тогда
			
			МассивПодразделений.Добавить(СтрМас);
			
		КонецЕсли;
		// БИТ_ЖКХ_24012014_окончание_изменений
		
	КонецЦикла;
	
	// БИТ_ЖКХ_24012014_начало_изменений
	Если МассивПодразделений.Количество() > 0 Тогда
		
		АдресПодразделенийВХранилище = ПоместитьВоВременноеХранилище(МассивПодразделений, УникальныйИдентификатор);
		
		Структура = Новый Структура("АдресПодразделенийВХранилище", АдресПодразделенийВХранилище);
		
		ОповеститьОВыборе(СтрМас);
		
	КонецЕсли;
	// БИТ_ЖКХ_24012014_окончание_изменений
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

//  Процедура - обработчик события "ПриИзменении" поля ввода "Организация".
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Список.Отбор.Элементы[0].ПравоеЗначение = Организация;	
	Дерево.Отбор.Элементы[0].ПравоеЗначение = Организация;	
	
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПолучитьЭтоГруппаНаСервере(Знач Ссылка)
	
	Возврат Ссылка.ЭтоГруппа;
	
КонецФункции

#КонецОбласти