
#Область СлужебныеПроцедурыИФункции

// Интерфейс для вызова из клиентских модулей печати форм по макетам офисных документов.
//
// Подробнее - см. описание УправлениеПечатью.ПолучитьМакетыИДанныеОбъектов().
//
Функция ПолучитьМакетыИДанныеОбъектов(знач ИмяМенеджераПечати, знач СведенияОМакете, знач СоставДокументов) Экспорт
	
	Возврат бит_УправлениеПечатьюСервер.ПолучитьМакетыИДанныеОбъектов(ИмяМенеджераПечати, СведенияОМакете, СоставДокументов);
	
КонецФункции

// Возвращает описание команды по имени элемента формы.
// 
// См. УправлениеПечатью.ОписаниеКомандыПечати.
//
Функция ОписаниеКомандыПечати(ИмяКоманды, ИмяФормы) Экспорт
	
	Возврат бит_УправлениеПечатьюСервер.ОписаниеКомандыПечати(ИмяКоманды, ИмяФормы);
	
КонецФункции

// Сформировать печатные формы для непосредственного вывода на принтер.
//
// Подробнее - см. описание УправлениеПечатью.СформироватьПечатныеФормыДляБыстройПечати().
//
Процедура СформироватьПечатныеФормыДляБыстройПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов,
	ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, ПараметрыВывода, Отказ) Экспорт
	
	бит_УправлениеПечатьюСервер.СформироватьПечатныеФормыДляБыстройПечати(
		ИмяМенеджераПечати,
		ИменаМакетов,
		МассивОбъектов,
		ПараметрыПечати,
		ТабличныеДокументы,
		ОбъектыПечати,
		ПараметрыВывода,
		Отказ);
	
КонецПроцедуры

// Сформировать печатные формы для непосредственного вывода на принтер в обычном приложении.
//
// Подробнее - см. описание УправлениеПечатью.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение().
//
Процедура СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов,
	ПараметрыПечати, Адрес, ОбъектыПечати, ПараметрыВывода, Отказ) Экспорт
	
	бит_УправлениеПечатьюСервер.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(
		ИмяМенеджераПечати,
		ИменаМакетов,
		МассивОбъектов,
		ПараметрыПечати,
		Адрес,
		ОбъектыПечати,
		ПараметрыВывода,
		Отказ);
	
КонецПроцедуры

#КонецОбласти