
#Область РаботаСоСложнымиСтроками

Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель) Экспорт
	
	РезМассив = Новый Массив;
	
	Стр 				   = ИсходнаяСтрока;
	КоличествоРазделителей = СтрЧислоВхождений(Стр, Разделитель);
	
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Для Значение = 1 По КоличествоРазделителей + 1 Цикл
		
		ПозицияРазделителя = Найти(Стр,Разделитель);
		
		Если ПозицияРазделителя > 0 Тогда
			
			ТекущееИмя = Лев(Стр, ПозицияРазделителя - 1);
			Стр = Сред(Стр, ПозицияРазделителя + ДлинаРазделителя);
			
		Иначе
			
			ТекущееИмя = СокрЛП(Стр);
			
		КонецЕсли; 
		
		РезМассив.Добавить(ТекущееИмя);
		
	КонецЦикла;
	
	Возврат РезМассив;
	
КонецФункции // РазобратьСтрокуСРазделителями()

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",строка 1,,,строка 2", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" строка1   строка 2", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		
		Стр = СокрЛП(Стр);
		
		Пока 1 = 1 Цикл
			
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
			
		КонецЦикла;
		
	Иначе
		
		ДлинаРазделителя = СтрДлина(Разделитель);
		
		Пока 1 = 1 Цикл
			
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // РазложитьСтрокуВМассивПодстрок()

#КонецОбласти

