
#Область ФункцииОбработкиЛетИПериодов

// Считает количество полных лет между двумя датами.
Функция КолвоПолныхЛет(НачальнаяДата = '00010101000000' , КонечнаяДата = '00010101000000') Экспорт
	
	ЧислоЛет = Год(КонечнаяДата) - Год(НачальнаяДата);
	
	Если Месяц(КонечнаяДата) < Месяц(НачальнаяДата) Тогда
		ЧислоЛет = ЧислоЛет-1;
	ИначеЕсли Месяц(КонечнаяДата) = Месяц(НачальнаяДата) И День(КонечнаяДата) < День(НачальнаяДата) Тогда
		ЧислоЛет = ЧислоЛет-1;
	КонецЕсли;
	Возврат ЧислоЛет;
	
КонецФункции // КолвоПолныхЛет()

// Пишет прописью период между двумя датами считая количество полных лет и месяцев.
Функция ПериодПрописью(НачДата = '00010101000000' , КонДата = '00010101000000') Экспорт
	
	Результат = ""; 
	
	Если  НачДата > КонДата Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начальная дата больше конечной. Проверьте даты!");
		Возврат Результат;
	КонецЕсли; 

	// Подсчет количества полных лет.
	ЧислоЛет = Год(КонДата) - Год(НачДата);
	Если Месяц(КонДата) < Месяц(НачДата) Тогда
		ЧислоЛет = ЧислоЛет-1;
	ИначеЕсли Месяц(КонДата) = Месяц(НачДата) И День(КонДата) < День(НачДата) Тогда
		ЧислоЛет = ЧислоЛет-1;
	ИначеЕсли НачалоГода(НачДата) = НачалоДня(НачДата)и КонецГода(КонДата) = КонецДня(КонДата) Тогда
		ЧислоЛет = ЧислоЛет+1;
	КонецЕсли;
	
	// Кол-во лет прописью.
	ЛетПрописью = "";
	ОстатокОтДеления = Неопределено;
	Если ЧислоЛет > 20 Тогда
		 ОстатокОтДеления = ЧислоЛет%10
	КонецЕсли;	
	
	Если ОстатокОтДеления <> Неопределено Тогда
	
		Если ОстатокОтДеления = 1 Тогда
			ЛетПрописью =  Строка(ЧислоЛет) + " год ";
		ИначеЕсли ОстатокОтДеления > 1 и ОстатокОтДеления < 5 Тогда
			ЛетПрописью =  Строка(ЧислоЛет) + " года ";
		ИначеЕсли ОстатокОтДеления > 4 ИЛИ ОстатокОтДеления = 0 Тогда
			ЛетПрописью =  Строка(ЧислоЛет) + " лет ";
		КонецЕсли;
	
	Иначе
	
		Если ЧислоЛет = 1 Тогда
			ЛетПрописью =  Строка(ЧислоЛет) + " год ";
		ИначеЕсли ЧислоЛет > 1 и ЧислоЛет < 5 Тогда
			ЛетПрописью =  Строка(ЧислоЛет) + " года ";
		ИначеЕсли ЧислоЛет > 4 и ЧислоЛет < 21 Тогда
			ЛетПрописью =  Строка(ЧислоЛет) + " лет ";
		КонецЕсли;
		
	КонецЕсли; 
	
	
	// Подсчет количества месяцев.
	КолвоМесяцев = Месяц(КонДата)-Месяц(НачДата)+(Год(КонДата) - Год(НачДата))*12; 
	
	Если КонецДня(КонДата) = КонецМесяца(КонДата)Тогда
		КолвоМесяцев = КолвоМесяцев + 1;
	КонецЕсли;
	
	// Количество месяцев без учета количества полных лет.
	КолвоМесяцевБезЛет = КолвоМесяцев - ЧислоЛет*12;
	
	МесяцевПрописью = "";
	Если КолвоМесяцевБезЛет = 1 Тогда
		МесяцевПрописью =  Строка(КолвоМесяцевБезЛет) + " месяц";
	ИначеЕсли КолвоМесяцевБезЛет > 1 и КолвоМесяцевБезЛет < 5 Тогда
		МесяцевПрописью =  Строка(КолвоМесяцевБезЛет) + " месяца";
	ИначеЕсли  ЧислоЛет = 0 и КолвоМесяцевБезЛет = 6  Тогда
		МесяцевПрописью =  " полгода";
	ИначеЕсли  ЧислоЛет > 0 и КолвоМесяцевБезЛет = 6  Тогда
		МесяцевПрописью =  " 6 месяцев";
	ИначеЕсли КолвоМесяцевБезЛет > 4 и КолвоМесяцевБезЛет <> 6 и КолвоМесяцевБезЛет < 12 Тогда
		МесяцевПрописью =  Строка(КолвоМесяцевБезЛет) + " месяцев";
	КонецЕсли;
	
	Результат = ЛетПрописью + МесяцевПрописью;
	
	Если Результат = "" и НачДата <> '00010101000000' и  КонДата <> '00010101000000'  Тогда
		Результат = "с " + Формат(НачДата,"ДЛФ=ДД") + " по "+ Формат(КонДата,"ДЛФ=ДД");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ПериодПрописью()

// Проверяет правильность заполнения Ф.И.О.
//
Функция ФИОНаписаноВерно(Знач СтрокаПараметр, ПроверятьТолькоРусскиеБуквы = Ложь) Экспорт
	
	СтрокаПараметр = СокрЛП(СтрокаПараметр);
	
	СписокДопустимыхЗначений = Новый Соответствие;
	СписокДопустимыхЗначений.Вставить(КодСимвола(" "), " ");
	СписокДопустимыхЗначений.Вставить(КодСимвола("-"), "-");
	СписокДопустимыхЗначений.Вставить(КодСимвола("ё"), "ё");
	СписокДопустимыхЗначений.Вставить(КодСимвола("Ё"), "Ё");
	
	КодA = КодСимвола("A");
	КодZ = КодСимвола("z");
	КодА = КодСимвола("А");
	КодЯ = КодСимвола("я");
	Если  ПроверятьТолькоРусскиеБуквы Тогда
		Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
			Код = КодСимвола(СтрокаПараметр, Сч);
			Если ((Код >= КодА) И (Код <= КодЯ)) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
				Продолжить;
			Иначе
				Возврат 0;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
			Код = КодСимвола(СтрокаПараметр, Сч);
			Если (((Код >= КодA) И (Код <= КодZ)) ИЛИ ((Код >= КодА) И (Код <= КодЯ))) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
				Продолжить;
			Иначе
				Возврат 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	Возврат 1;
	
КонецФункции // ФИОНаписаноВерно()

// Функция раскладывает строку с данными о месте рождения на элементы структуры.
Функция РазложитьМестоРождения(Знач СтрокаМестоРождения, ВерхнийРегистр = Истина) Экспорт
	
	Особое = 0;НаселенныйПункт	= "";Село	= "";Район	= "";Область	= "";Страна	= "";
	
	МассивМестоРождения	=	бит_ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(?(ВерхнийРегистр, Врег(СтрокаМестоРождения), СтрокаМестоРождения));
	
	ЭлементовВМассиве = МассивМестоРождения.Количество();   
	Если ЭлементовВМассиве	>	0	тогда
		Если СокрЛП(МассивМестоРождения[0]) = "1" тогда
			Особое	=	1;
		КонецЕсли;	 
	КонецЕсли;
	Если ЭлементовВМассиве	>	1	тогда
		НаселенныйПункт = СокрЛП(МассивМестоРождения[1]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	2	тогда
		Район   = СокрЛП(МассивМестоРождения[2]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	3	тогда
		Область = СокрЛП(МассивМестоРождения[3]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	4	тогда
		Страна  = СокрЛП(МассивМестоРождения[4]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	5	тогда
		Село    = СокрЛП(МассивМестоРождения[5]);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Особое",Особое);
	СтруктураВозврата.Вставить("НаселенныйПункт", НаселенныйПункт);
	СтруктураВозврата.Вставить("Село"           , Село);
	СтруктураВозврата.Вставить("Район"          , Район);
	СтруктураВозврата.Вставить("Область"        , Область);
	СтруктураВозврата.Вставить("Страна"         , Страна);
	
	Возврат СтруктураВозврата;
	
КонецФункции	 

// Возвращает строковое представление места рождения.
// СтрокаМестоРождения - строка места рождения.
// Сокращенное - булево, используется при выводе укороченных комментариев к адресу.
Функция ПредставлениеМестаРождения(Знач СтрокаМестоРождения, Сокращенное = Ложь) Экспорт
	
	СтруктураМестоРождения = РазложитьМестоРождения(СтрокаМестоРождения, Ложь);
	
	Если СтруктураМестоРождения.Особое = 1 Тогда
		
		Представление	=	"особое" +
		?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.НаселенныйПункт),"","  " + СокрЛП(СтруктураМестоРождения.НаселенныйПункт))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Село)          ,"","  " + СокрЛП(СтруктураМестоРождения.Село))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Район)         ,"","  " + СокрЛП(СтруктураМестоРождения.Район))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Область)       ,"","  " + СокрЛП(СтруктураМестоРождения.Область))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Страна)        ,"","  " + СокрЛП(СтруктураМестоРождения.Страна));
		
	Иначе
		Если Сокращенное Тогда
			Представление = "" 
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.НаселенныйПункт),"",", " + СокрЛП(СтруктураМестоРождения.НаселенныйПункт))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Село)           ,"",", " + СокрЛП(СтруктураМестоРождения.Село))
			//+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Село)           ,"",", " + " с. " + СокрЛП(СтруктураМестоРождения.Село))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Район)          ,"",", " + СокрЛП(СтруктураМестоРождения.Район))
			//+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Область)        ,"",", " + СокрЛП(СтруктураМестоРождения.Область))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Область)        ,"",", " + СокрЛП(СтруктураМестоРождения.Область))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Страна)         ,"",", " + СокрЛП(СтруктураМестоРождения.Страна));
		Иначе
			
			Представление = ""
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.НаселенныйПункт), "","Населенный пункт: " + СокрЛП(СтруктураМестоРождения.НаселенныйПункт))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Село)           , "",", село (дер.): "    + СокрЛП(СтруктураМестоРождения.Село))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Район)          , "",", район:  "         + СокрЛП(СтруктураМестоРождения.Район))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Область)        , "",", область: "        + СокрЛП(СтруктураМестоРождения.Область))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Страна)         , "",", страна: "         + СокрЛП(СтруктураМестоРождения.Страна));
			
		КонецЕсли;
		Если Лев(Представление, 1) = ","  Тогда
			Представление = Сред(Представление, 2)
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти