
#Область ПроедурыИФункцииПоУправлениюПриложениемExcel

// Функция создает COMОбъект - "Excel.Application".
//
// Параметры:
//  Отказ 		- Булево, по умолчанию Ложь.
//  ЭтоЗагрузка - Булево, признак инициализации Excel для чтения, по умолчанию Ложь.
//
// Возвращаемое значение:
//   Excel - ComObject("Excel.Application"), в случае неудачи Неопределено.
//
Функция СоздатьПриложениеExcel(Отказ = Ложь, ЭтоЗагрузка = Ложь) Экспорт
	
	Попытка
		
		// Загрузка Microsoft Excel.
		Excel = Новый COMОбъект("Excel.Application");
		
		Если ЭтоЗагрузка Тогда
			Excel.DisplayAlerts = False;
		КонецЕсли;
	
	Исключение
		Отказ = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Ошибка загрузки Microsoft Excel.
									|%1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Excel;
	
КонецФункции // СоздатьПриложениеExcel()

// Функция закрывает приложение Excel.
//
// Параметры:
//  Excel 		- ComObject("Excel.Application").
//  ЭтоЗагрузка - Булево, признат что Excel был открыт для чтения, по умолчанию Ложь.
//
// Возвращаемое значение:
//  ExcelЗакрыт - Булево.
//
Функция ЗакрытьПриложениеExcel(Excel, ЭтоЗагрузка = Ложь) Экспорт
	
	ExcelЗакрыт = Истина;
	
	Попытка 
		
		Если ЭтоЗагрузка Тогда
			Excel.DisplayAlerts = True;		
		КонецЕсли;
		
        Excel.Quit();
		
	Исключение                 
		ExcelЗакрыт = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Не удалось закрыть приложение Excel!
									|%1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
    КонецПопытки;
	
	Возврат ExcelЗакрыт;
	
КонецФункции // ЗакрытьПриложениеExcel()

Процедура УстановитьФормат(Формат, ПолеФормата) Экспорт

	

КонецПроцедуры

// Процедура устанавливает значение поля формата и заполнения значения.
//
// Параметры:
//  Формат 		- Произволний тип содержит тип формата.
//  ПолеФормата - Произволний тип содержит Поле формата (прим: NumberFormat в Excel).
//
// Возвращаемое значение:
//  ПолеФормата - Произволний тип содержит Поле формата (прим: NumberFormat в Excel).
//
Процедура УстановитьЗначениеЯчейкиExcel(Файл, Тип = Неопределено, Значение = Неопределено, НомерКолонки, НомерСтроки) Экспорт
	
	Ячейка = Файл.Cells(НомерСтроки, НомерКолонки);
	Ячейка.NumberFormat = ?(Тип      <> Неопределено, Тип     , Ячейка.NumberFormat);
	Ячейка.Value        = ?(Значение <> Неопределено, Значение, Ячейка.Value);
	
КонецПроцедуры

// Процедура Устанавливает значение поля формата колонки
//
Процедура УстановитьФорматКолонкиExcel(Файл, Тип, НомерКолонки, УстановитьШиринуКолонки = Ложь, ШиринаКолонки = Неопределено) Экспорт
	
	Колонка = Файл.Columns(НомерКолонки);
	
	Колонка.NumberFormat = Тип;
	
	Если УстановитьШиринуКолонки Тогда
		УстановитьШиринуКолонкиExcel(Файл, НомерКолонки, ШиринаКолонки, Колонка);
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьШиринуКолонкиExcel(Файл, НомерКолонки,  ШиринаКолонки = Неопределено, Колонка = Неопределено) Экспорт
	
	Колонка = ?(Колонка = Неопределено,Файл.Columns(НомерКолонки), Колонка);
	
	Если ШиринаКолонки = Неопределено Тогда
		
		Колонка.AutoFit();
		
	Иначе
		Колонка.ColumnWidth = ШиринаКолонки;
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти