
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура ОчиститьОтбор(Знач ИмяЭлемента = "")
	
	ЭлементыФормы = Новый Массив;
	ЭлементыФормы.Добавить("СписокЛС");
	ЭлементыФормы.Добавить("СписокРайонов");
	ЭлементыФормы.Добавить("СписокУчастков");
	ЭлементыФормы.Добавить("СписокЗданий");
	ЭлементыФормы.Добавить("СписокУлиц");
	
	Если НЕ ПустаяСтрока(ИмяЭлемента) Тогда
		
		ЭлементыФормы.Очистить();
		ЭлементыФормы.Добавить(ИмяЭлемента);
		
	КонецЕсли; 
	
	Для каждого Элемент Из ЭлементыФормы Цикл
		
		ЭтаФорма[Элемент].Очистить();
		
		Если Элемент = "СписокЗданий" Тогда
			Объект.ТипКвартиры = Неопределено;
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура отображает текущие отборы.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура ОтобразитьТекущиеОтборы()
	
	УстановленныеОтборы = "";
	
	Если Объект.СписокРайонов.Количество() > 0 Тогда
		УстановленныеОтборы = УстановленныеОтборы + "Районы";
	КонецЕсли;
	
	Если Объект.СписокУчастков.Количество() > 0 Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Участки";
	КонецЕсли;
	
	Если Объект.СписокУлиц.Количество() > 0 Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Улицы";
	КонецЕсли;
	
	Если Объект.СписокЗданий.Количество() > 0 Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Здания";
	КонецЕсли;
	
	Если Объект.СписокЛС.Количество() > 0 Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Лицевые счета";
	КонецЕсли;
	
	Если НЕ Объект.ТипКвартиры.Пустая() Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Тип квартиры";
	КонецЕсли;
	
	Если УстановленныеОтборы = "" Тогда
		УстановленныеОтборы = "Отбор не установлен.";
	Иначе
		УстановленныеОтборы = УстановленныеОтборы + ".";
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьТаблицаРеквизитовQRКода()
	
	Объект.ТаблицаРеквизитовQRКода.Очистить();
	
	Для Каждого Элт Из мКэшРеквизитовQRКода Цикл
		Нстр = Объект.ТаблицаРеквизитовQRКода.Добавить();
		Нстр.Реквизит	   = Элт.Ключ;
		Нстр.Представление = Элт.Значение;
		Нстр.Выводить	   = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БИТ ЖКХ 23.01.2019
	ПредопределенныйМакет = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32_Новый.ПолучитьОбъект();
	ПредопределенныйМакет.ПутьКМакету = "ЕдиныйПлатежныйДокумент761_32_Новый";
	ПредопределенныйМакет.Записать();
	
	// БИТ ЖКХ 14.04.2021
	ПредопределенныйМакет = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32_НовыйСПени.ПолучитьОбъект();
	ПредопределенныйМакет.ПутьКМакету = "ЕдиныйПлатежныйДокумент761_32_НовыйСПени";
	ПредопределенныйМакет.Записать();
	
	ЗаполнитьКэшРеквизитовQRКода();
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ПроверитьВерсиюОбработки();
	
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.MXL , "mxl");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.HTML, "html");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.XLS , "xls");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.PDF , "pdf");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.ODS , "ods");
	
	Объект.Период                   = КонецМесяца(ТекущаяДата());
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоМесяца(ТекущаяДата()));
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаКонец" , КонецМесяца(ТекущаяДата()));
	ТипФайла                        = ТипФайлаТабличногоДокумента.XLS;
	// БИТ_ЖКХ 20.11.2017 16:09:08 Начало правки...
	Объект.РасскрытьСоставГрупп		= Истина;	
	// БИТ_ЖКХ 20.11.2017 16:09:08 Конец правки.
	Объект.УчетнаяЗапись            = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
	Объект.ОтправительПредставление = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьПредставлениеДляУчетнойЗаписи(Объект.УчетнаяЗапись);
	Объект.МакетКв                  = Справочники.бит_ВариантыСчетовИзвещений.СчетИзвещение;
	
	Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	
	Если НЕ Параметры.ЛицевойСчет.Пустая() Тогда
		
		Организация = Параметры.ЛицевойСчет.Организация;
		
		НоваяСтрока = Объект.СписокЛС.Добавить();
		НоваяСтрока.ЛицевойСчет        = Параметры.ЛицевойСчет;
		НоваяСтрока.ГруппироватьУслуги = Параметры.ЛицевойСчет.ОтображатьПоГруппам;
		
		Если Не Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") Тогда
			
			Объект.Организация = Организация;
			
			ОбновитьНастройкиЖКХ();
			
			НоваяСтрока.ПечатьЗависимыхЛС = мКэшЗначений.ВыводитьЗависимыеЛС;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Объект.Организация = Организация;
	ОрганизацияПриИзмененииНаСервере();
	
	Объект.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	
	Объект.РазмерПакетаПечати    = 500;
	Объект.РазмерПакетаПросмотра = 50;
	
	МакетЦвета = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет("МакетЛегенда");
	Цвета = МакетЦвета.ПолучитьТекст();
	
	ПолучитьДоступныеУчетныеЗаписиДляОтправки();
	
	Объект.СписокГЦЖС.ТипЗначения = Новый ОписаниеТипов("ПеречислениеСсылка.бит_ГрафыОтчетаПоГЦЖС");
	
	ПредставлениеПериодаРегистрации = Формат(Объект.Период, "ДФ='ММММ гггг'");
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если ЗначениеЗаполнено(мКэшЗначений.КодУслугиВСистемеГород) Тогда
			Объект.сг_КодУслугиВСистемеГород = мКэшЗначений.КодУслугиВСистемеГород;
			Объект.ИспользоватьСокращенноеНаименование = мКэшЗначений.ИспользоватьСокращенноеНаименование;
			Объект.ФорматДаты		 = мКэшЗначений.ФорматДаты;
			Объект.НазначениеПлатежа = мКэшЗначений.НазначениеПлатежа; 
		Иначе
			//23.07.2019
			ЗначениеКодУслугиВСистемеГород = Новый Структура("КодУслугиВСистемеГород,ИспользоватьСокращенноеНаименование,ФорматДаты,НазначениеПлатежа, ИспользоватьSumCПени", "", Ложь, "", ""); 
			бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Объект.Период, Объект.Организация, ЗначениеКодУслугиВСистемеГород);
			Объект.сг_КодУслугиВСистемеГород = ЗначениеКодУслугиВСистемеГород.КодУслугиВСистемеГород;
			Объект.ИспользоватьСокращенноеНаименование = ЗначениеКодУслугиВСистемеГород.ИспользоватьСокращенноеНаименование;
			Объект.ФорматДаты = ЗначениеКодУслугиВСистемеГород.ФорматДаты;
			Объект.НазначениеПлатежа = ЗначениеКодУслугиВСистемеГород.НазначениеПлатежа; 
			//23.07.2019
			Объект.ИспользоватьSumCПени = ЗначениеКодУслугиВСистемеГород.ИспользоватьSumCПени;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ Параметры.ЛицевойСчет.Пустая() Тогда
		
		тмпСохраненыеДанные = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
		
		МакетКв		  = Настройки.Получить("Объект.МакетКв");
		Организация	  = Настройки.Получить("Объект.Организация");
		РасчетныйСчет = Настройки.Получить("Объект.РС");
		Если НЕ МакетКв = Неопределено Тогда
			Объект.МакетКв = МакетКв;
			Если НЕ ПолучитьЗначениеРеквизитаОбъекта(МакетКв, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
				И НЕ МакетКв = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент") 
				И НЕ Организация = Неопределено 
				И Организация <>  Объект.Организация Тогда
				
				ОрганизацияПриИзмененииНаСервере();
			Иначе
				Объект.РС = РасчетныйСчет;
			КонецЕсли;		
		КонецЕсли;
		
		Период = Настройки.Получить("Объект.Период");
		Если НЕ Период = Неопределено Тогда
			Объект.Период = Период;
		КонецЕсли;
		
		ПредставлениеПериодаРегистрации = Формат(Объект.Период, "ДФ='ММММ гггг'");
		
		ШаблонИзвещений = Настройки.Получить("Объект.ШаблонИзвещений");
		Если НЕ ШаблонИзвещений = Неопределено Тогда
			Объект.ШаблонИзвещений = ШаблонИзвещений;
		КонецЕсли;
		
		ПолучательПлатежа = Настройки.Получить("Объект.ПолучательПлатежа");
		Если НЕ ПолучательПлатежа = Неопределено Тогда
			Объект.ПолучательПлатежа = ПолучательПлатежа;
		КонецЕсли;
		
		ИспользоватьQR = Настройки.Получить("Объект.ИспользоватьQR");
		Если НЕ ИспользоватьQR = Неопределено Тогда
			Объект.ИспользоватьQR = ИспользоватьQR;
		КонецЕсли;
		
		НатройкаРеквизитовQRКода = Настройки.Получить("ТаблицаРеквизитовQRКода");
		Если НЕ НатройкаРеквизитовQRКода = Неопределено Тогда
			Объект.ТаблицаРеквизитовQRКода.Загрузить(НатройкаРеквизитовQRКода); 
		КонецЕсли; 
		
		БезПрефиксаНежилогоПомещения = Настройки.Получить("Объект.БезПрефиксаНежилогоПомещения");
		Если НЕ БезПрефиксаНежилогоПомещения = Неопределено Тогда
			Объект.БезПрефиксаНежилогоПомещения = БезПрефиксаНежилогоПомещения;
		КонецЕсли;
		
		Настройки.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УчетнаяЗапись = Настройки.Получить("Объект.УчетнаяЗапись");
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Объект.УчетнаяЗапись = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
	КонецЕсли;
	
	Объект.ОтправительПредставление = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьПредставлениеДляУчетнойЗаписи(Объект.УчетнаяЗапись);
	
	Период = Настройки.Получить("Объект.Период");
	Если ЗначениеЗаполнено(Период) Тогда
		Объект.Период = Период;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.Получить("ТипФайла")) Тогда
		ТипФайла = Настройки.Получить("ТипФайла");
	КонецЕсли; 
	   
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоМесяца(Объект.Период));
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаКонец" , КонецМесяца(Объект.Период));
	
	ЭлементыФормы = Новый Массив;
	ЭлементыФормы.Добавить("СписокЛС");
	ЭлементыФормы.Добавить("СписокРайонов");
	ЭлементыФормы.Добавить("СписокУчастков");
	ЭлементыФормы.Добавить("СписокЗданий");
	ЭлементыФормы.Добавить("СписокУлиц");
	ЭлементыФормы.Добавить("ТаблицаРеквизитовQRКода");
	
	Для каждого Элемент Из ЭлементыФормы Цикл
		
		НатройкаОтбора = Настройки.Получить(Элемент);
		
		Если Элемент = "ТаблицаРеквизитовQRКода" И ЗначениеЗаполнено(НатройкаОтбора) Тогда
			Если НатройкаОтбора.Найти("КПППолучателя", "Реквизит") = Неопределено Тогда
				СтрКПППолучателя = НатройкаОтбора.Добавить();
				СтрКПППолучателя.Выводить		= Ложь;
				СтрКПППолучателя.Представление	= "KPP";
				СтрКПППолучателя.Реквизит		= "КПППолучателя";
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ НатройкаОтбора = Неопределено Тогда
			Объект[Элемент].Загрузить(НатройкаОтбора); 
		КонецЕсли; 
		
	КонецЦикла;
	
	Элементы.сг_КодУслугиВСистемеГород.Видимость = Объект.ИспользоватьQR;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.СтрокаПериод = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.Период);
	
	Если ОчищатьОтборы Тогда
		
		ОчиститьОтбор();
		
	КонецЕсли;
	
	ОтобразитьТекущиеОтборы();
	
	Если Объект.ТаблицаРеквизитовQRКода.Количество() = 0 Тогда
		ЗаполнитьТаблицаРеквизитовQRКода()
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ТекущийПакет = 1;
	
	ОчиститьНаСервере(Результат);
	
	Результат.АвтоМасштаб = Истина;
	Результат.ПолеСверху  = 0;
	Результат.ПолеСнизу   = 0;
	
	ИзменитьСостояниеТабличногоПоля("ФОРМИРОВАНИЕОТЧЕТА");
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницыОсновные;
	
	ТабличныйДокумент = СформироватьКвитанции();
	
	Если НЕ ТабличныйДокумент = Неопределено Тогда
		Результат.ОриентацияСтраницы = ТабличныйДокумент.ОриентацияСтраницы;
		
		ВывестиНаСервере(ТабличныйДокумент);

	КонецЕсли;
	
	ИзменитьСостояниеТабличногоПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсеСейчас(Команда)
	
	ТекДанные = Элементы.ТаблицаПисем.ТекущиеДанные;
	
	СтатусПисьма = ПредопределенноеЗначение("Перечисление.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено");
	ОчиститьСообщения();
	ОтправитьПисьма(СтатусПисьма);
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсе(Команда)
	
	СтатусПисьма = ПредопределенноеЗначение("Перечисление.бит_СтатусыИсходящегоЭлектронногоПисьма.Исходящее");
	ОтправитьПисьма(СтатусПисьма);
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПисем(Команда)
	
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоМесяца(Объект.Период));
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаКонец" , КонецМесяца(Объект.Период));
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИзменитьПолучателей(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаПисем.ТекущиеДанные;
	
	Если ТекущиеДанные.СтатусПисьма = ПредопределенноеЗначение("Перечисление.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено") Тогда	
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период"     , Объект.Период);
	ПараметрыФормы.Вставить("ЛицевойСчет", ТекущиеДанные.ЛицевойСчет);
	
	Адреса = Неопределено;
	
	ОткрытьФорму("Обработка.бит_ПечатьСчетИзвещений.Форма.АдреснаяКнигаПроживающих", ПараметрыФормы,,,,, Новый ОписаниеОповещения("УстановитьИзменитьПолучателейЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИзменитьПолучателейЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	Адреса = Результат1;
	
	Если (ТипЗнч(Адреса) <> Тип("Массив")) И (ТипЗнч(Адреса) <> Тип("Соответствие")) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним адресатов.
	ЗаполнитьПодобранныхПолучателей(Элементы.ТаблицаПисем.ТекущаяСтрока, Адреса);
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПисьма(Команда)
	
	СоздатьЭлектронныеПисьма(Истина);
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПисьмаПоПакетуПросмотра(Команда)
	
	СоздатьЭлектронныеПисьма();
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОчиститьОтборы(Команда)
	
	ЭлементыФормы = Новый Массив;
	ЭлементыФормы.Добавить("СписокЛС");
	ЭлементыФормы.Добавить("СписокРайонов");
	ЭлементыФормы.Добавить("СписокУчастков");
	ЭлементыФормы.Добавить("СписокЗданий");
	ЭлементыФормы.Добавить("СписокУлиц");
	
	Для каждого Элемент Из ЭлементыФормы Цикл
		
		Объект[Элемент].Очистить();
		
		Если Элемент = "СписокЗданий" Тогда
			Объект.ТипКвартиры = Неопределено;
		КонецЕсли; 
		
	КонецЦикла;
	
	ОтобразитьТекущиеОтборы();
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРайоны(Команда)
	
	Объект.СписокРайонов.Очистить();
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУчастки(Команда)
	
	Объект.СписокУчастков.Очистить();
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУлицы(Команда)
	
	Объект.СписокУлиц.Очистить();
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗдания(Команда)
	
	Объект.СписокЗданий.Очистить();
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛс(Команда)
	
	Объект.СписокЛс.Очистить();
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПечатиАдресаПоУмолчанию(Команда)
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("НеПечататьУлица"                    , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьДом"                      , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьКорпус"                   , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьКвартира"                 , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьРайон"                    , Истина);
	ПараметрыЖКХ.Вставить("ПрефиксУлица"                       , "ул.");
	ПараметрыЖКХ.Вставить("ПрефиксДом"                         , "д.");
	ПараметрыЖКХ.Вставить("ПрефиксКорпус"                      , "корп.");
	ПараметрыЖКХ.Вставить("ПрефиксКвартира"                    , "кв.");
	ПараметрыЖКХ.Вставить("ПрефиксРайон"                       , "");
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Объект.Период, Объект.Организация, ПараметрыЖКХ);
	
	Объект.НеПечататьУлицу                     = ПараметрыЖКХ.НеПечататьУлица;
	Объект.НеПечататьДом                       = ПараметрыЖКХ.НеПечататьДом;
	Объект.НеПечататьКорпус                    = ПараметрыЖКХ.НеПечататьКорпус;
	Объект.НеПечататьКвартиру                  = ПараметрыЖКХ.НеПечататьКвартира;
	Объект.НеПечататьРайон                     = ПараметрыЖКХ.НеПечататьРайон;
	Объект.ПрефиксУлица                        = ПараметрыЖКХ.ПрефиксУлица;
	Объект.ПрефиксДом                          = ПараметрыЖКХ.ПрефиксДом;
	Объект.ПрефиксКорпус                       = ПараметрыЖКХ.ПрефиксКорпус;
	Объект.ПрефиксКвартира                     = ПараметрыЖКХ.ПрефиксКвартира;
	Объект.ПрефиксРайон                        = ПараметрыЖКХ.ПрефиксРайон;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГруппироватьУслуги(Команда)
	
	Для каждого СтрокаТаблицы Из Объект.СписокЛС Цикл
		СтрокаТаблицы.ГруппироватьУслуги = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПечатьЗависимых(Команда)
	
	Для каждого СтрокаТаблицы Из Объект.СписокЛС Цикл
		СтрокаТаблицы.ПечатьЗависимыхЛС = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьГруппироватьУслуги(Команда)
	
	Для каждого СтрокаТаблицы Из Объект.СписокЛС  Цикл
		СтрокаТаблицы.ГруппироватьУслуги = Ложь;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПечатьЗависимых(Команда)
	
	Для каждого СтрокаТаблицы Из Объект.СписокЛС  Цикл
		СтрокаТаблицы.ПечатьЗависимыхЛС = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	
	Если НЕ Объект.ТекущийПакет = Объект.КоличествоПакетов Тогда
		
		ИзменитьСостояниеТабличногоПоля("ФОРМИРОВАНИЕОТЧЕТА");
		Объект.ТекущийПакет = Объект.ТекущийПакет + 1;
		
		ТабличныйДокумент = СформироватьКвитанции();
		
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			
			ВывестиПакетНаСервере(ТабличныйДокумент);
			
		КонецЕсли;
		
		ИзменитьСостояниеТабличногоПоля();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если НЕ Объект.ТекущийПакет <= 1 Тогда
		
		ИзменитьСостояниеТабличногоПоля("ФОРМИРОВАНИЕОТЧЕТА");
		Объект.ТекущийПакет = Объект.ТекущийПакет - 1;
		
		ТабличныйДокумент = СформироватьКвитанции();
		
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			
			ВывестиПакетНаСервере(ТабличныйДокумент);
			
		КонецЕсли;
		
		ИзменитьСостояниеТабличногоПоля();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыОткрытияФормыПодбора(); 
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, Элементы.СписокЛС, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьВсеПакеты(Команда)
	
	ПолучитьКоличествоПакетовПечати();
	
	Для Значение=1 По Объект.КоличествоПакетовПечати Цикл
		
		Объект.ТекущийПакетПечати = Значение;
		
		ТабличныйДокумент = СформироватьКвитанции(Истина);
		
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			ТабличныйДокумент.Напечатать();
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьМакет(Команда)
	
	ПараметрыФормы =  Новый Структура;
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Объект.МакетКв);
	ПараметрыФормы.Вставить("ТаблицаНастроек", ТаблицаНастроек);
	
	ОткрытьФорму("Обработка.бит_ПечатьСчетИзвещений.Форма.НастойкиМакетовУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуМакета(Команда)
	
	Настройка = ПолучитьНастройкуМакета();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ"          , Настройка);
	ПараметрыФормы.Вставить("МакетКвитанции", Объект.МакетКв);
	ОткрытьФорму("Справочник.бит_НастройкиПечатиМакетовСчетИзвещений.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиСрочногоДонесения(Команда)
	
	Объект.НаименованиеСрочногоДонесения = "о показаниях водосчетчиков холодного (ХВС) и горячего (ГВС)";
	Объект.СписокГЦЖС.Очистить();
	Объект.СписокГЦЖС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ХолодноеВодоснабжение"));
	Объект.СписокГЦЖС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение"));
	Объект.СписокГЦЖС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.Водопровод"));
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	Объект.Период = КонецМесяца(ДобавитьМесяц(Объект.Период,1));
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	Объект.Период = КонецМесяца(ДобавитьМесяц(Объект.Период,-1));
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатежныеДокументыГИСЖКХ(Команда)
	
	Если ЗначениеЗаполнено(АдресХранилщаДанныхГИСЖКХ) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПлатежныеДокументыГИСЖКХЗавершение", ЭтотОбъект)
		, "Будут созданы платежные документы ГИС ЖКХ за " + НРег(ПредставлениеПериодаРегистрации) + " года. Продолжить?"
		, РежимДиалогаВопрос.ДаНет); 
	
	Иначе
		ТекстСообщения = НСтр("ru = 'Отсутствуют данные для передачи в ГИС ЖКХ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатежныеДокументыГИСЖКХЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		ЗаполнитьПлатежныеДокументыГИСЖКХСервер(АдресХранилщаДанныхГИСЖКХ, Объект.Период, Объект.ШаблонИзвещений);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПлатежныеДокументыГИСЖКХСервер(АдресХранилщаДанных, Период, ШаблонИзвещений)
	
	ПредставлениеПериодаРегистрации = Формат(Период, "ДФ='ММММ гггг'");
	СтруктураПД = ПолучитьИзВременногоХранилища(АдресХранилщаДанных);
	ТаблицаПлатежиГИСЖКХ12			= СтруктураПД.ТаблицаПлатежиГИСЖКХ12;
	ТаблицаПлатежиГИСЖКХ36			= СтруктураПД.ТаблицаПлатежиГИСЖКХ36;
	ТаблицаПлатежиГИСЖКХДПД			= СтруктураПД.ТаблицаПлатежиГИСЖКХДПД;
	ТаблицаПлатежиГИСЖКХНеустойки	= СтруктураПД.ТаблицаПлатежиГИСЖКХНеустойки;
	
	Если ТаблицаПлатежиГИСЖКХ12.Количество() = 0
		И ТаблицаПлатежиГИСЖКХ36.Количество() = 0
		И ТаблицаПлатежиГИСЖКХДПД.Количество() = 0 
		И ТаблицаПлатежиГИСЖКХНеустойки.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Отсутствуют данные для формирования документов,
									|полученные согласно макету квитанции платежного документа РК924 (ГИС ЖКХ)!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТаблицаПлатежныхДокументов = ТаблицаПлатежиГИСЖКХ12.Скопировать(,"ЛицевойСчет, РасчетныйПериод, ТабличнйДокумент");
	ТаблицаПлатежныхДокументов.Свернуть("ЛицевойСчет, РасчетныйПериод, ТабличнйДокумент");
	
	ПараметрыПровеки = Новый Структура();
	ПараметрыПровеки.Вставить("Период"				 , Период);
	ПараметрыПровеки.Вставить("ЛицевыеСчета"		 , ТаблицаПлатежныхДокументов.ВыгрузитьКолонку("ЛицевойСчет"));
	ПараметрыПровеки.Вставить("ШаблонИзвещений"		 , ШаблонИзвещений);
	ПараметрыПровеки.Вставить("ПредставлениеПериода" , ПредставлениеПериодаРегистрации);
	
	Если Справочники.бит_ПлатежныеДокументыГИСЖКХ.ЕстьВыгрузка(ПараметрыПровеки) Тогда
		Возврат;	
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Создание пачки документов.
	ГруппаВыгрузки = Справочники.бит_ПлатежныеДокументыГИСЖКХ.ПолучитьГруппуДокументов(Период);
	
	Если НЕ ЗначениеЗаполнено(ГруппаВыгрузки.Ссылка) Тогда
		ГруппаВыгрузки.Наименование	= ПредставлениеПериодаРегистрации;
		ГруппаВыгрузки.РасчетныйПериод	= Период;
		Попытка
			ГруппаВыгрузки.Записать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = '%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки; 
	КонецЕсли;
	
	ТЗОбновления = Справочники.бит_ПлатежныеДокументыГИСЖКХ.ПолучитьДокументы(ПараметрыПровеки);
	
	// Создание "Платежных документов".
	Для Каждого Стр Из ТаблицаПлатежныхДокументов Цикл
		
		Кэштаб = Неопределено;
		ПлатДокГИСЖКХ = ТЗОбновления.Найти(Стр.ЛицевойСчет, "ЛицевойСчет");
		Если ПлатДокГИСЖКХ = Неопределено Тогда
			ПлатежныйДокумент = Справочники.бит_ПлатежныеДокументыГИСЖКХ.СоздатьЭлемент();
		Иначе	
			ПлатежныйДокумент = ПлатДокГИСЖКХ.Ссылка.ПолучитьОбъект();	
		КонецЕсли;
		
		ПлатежныйДокумент.Наименование	  = "Платежный документ ГИС ЖКХ по ЛС " + Строка(Стр.ЛицевойСчет) + " (" + ПредставлениеПериодаРегистрации + ")";
		ПлатежныйДокумент.Родитель		  = ГруппаВыгрузки.Ссылка;
		ПлатежныйДокумент.ЛицевойСчет	  = Стр.ЛицевойСчет;
		ПлатежныйДокумент.ШаблонИзвещений = ШаблонИзвещений;
		ПлатежныйДокумент.РасчетныйПериод = Стр.РасчетныйПериод;
		ПлатежныйДокумент.Ответственный	  = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		// Технические тч.
		ПлатежныйДокумент.ТаблицаПлатежиГИСЖКХ12.Загрузить(ТаблицаПлатежиГИСЖКХ12.Скопировать(Новый Структура("ЛицевойСчет", Стр.ЛицевойСчет)));
		ПлатежныйДокумент.ТаблицаПлатежиГИСЖКХ36.Загрузить(ТаблицаПлатежиГИСЖКХ36.Скопировать(Новый Структура("ЛицевойСчет", Стр.ЛицевойСчет)));
		ПлатежныйДокумент.ТаблицаПлатежиГИСЖКХДПД.Загрузить(ТаблицаПлатежиГИСЖКХДПД.Скопировать(Новый Структура("ЛицевойСчет", Стр.ЛицевойСчет)));
		ПлатежныйДокумент.ТаблицаПлатежиГИСЖКХНеустойки.Загрузить(ТаблицаПлатежиГИСЖКХНеустойки.Скопировать(Новый Структура("ЛицевойСчет", Стр.ЛицевойСчет)));
		
		// Уникальный номер документа, для ГИС ЖКХ.
		УникальнаяНомерПД = Формат(Стр.РасчетныйПериод, "ДФ='ММгггг'") + бит_ОбщегоНазначения.ДополнитьСтроку(Строка(Стр.ЛицевойСчет),12)
							+ Строка(ПолучитьЗначениеРеквизитаОбъекта(ШаблонИзвещений, "Код"));
		ПлатежныйДокумент.НомерПД = УникальнаяНомерПД;
		
		Попытка
			ПлатежныйДокумент.Записать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = '%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
		
		ПараметрыЗаписиПД = Новый Структура();
		ПараметрыЗаписиПД.Вставить("Период", Период);
		ПараметрыЗаписиПД.Вставить("Файл", Стр.ТабличнйДокумент);
		ФайлПД =  ПлатежныйДокумент.ПрисоденитьФайл(ПараметрыЗаписиПД);
		Если НЕ ЗначениеЗаполнено(ФайлПД) Тогда
			ОтменитьТранзакцию();	
		КонецЕсли;

	КонецЦикла;
	
	// БИТ ЖКх 17.02.2020
	Если ЗначениеЗаполнено(ФайлПД) Тогда
	 ЗафиксироватьТранзакцию();
	конецесли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтрокаПериодПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.СтрокаПериод) Тогда
		Объект.СтрокаПериод = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.Период);
	КонецЕсли;
	
	ОбновитьНастройкиЖКХ();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.Период;
	
	бит_РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, Объект.Период, ЭтаФорма);
	Объект.СтрокаПериод  = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Объект.Период);
	Объект.Период = КонецМесяца(Объект.Период);
	
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоМесяца(Объект.Период));
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаКонец" , КонецМесяца(Объект.Период));
	
	Элементы.ТаблицаПисем.Обновить();
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПериодОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = Объект.Период;
	
	ТекущаяДата = ?(Направление > 0, Объект.Период, ДобавитьМесяц(Объект.Период, -1));
	бит_РаботаСДиалогами.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, ТекущаяДата, Объект.СтрокаПериод);
	Объект.Период = КонецМесяца(ТекущаяДата);
	
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоМесяца(Объект.Период));
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаКонец" , КонецМесяца(Объект.Период));
	
	Элементы.ТаблицаПисем.Обновить();
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.УчетнаяЗапись <> ВыбранноеЗначение Тогда
		
		Объект.УчетнаяЗапись = ВыбранноеЗначение;
		ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
		Если ЭлементСписка <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			Объект.ОтправительПредставление = ЭлементСписка.Представление;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПисемВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.бит_ЭлектронноеПисьмоИсходящее.Форма.ФормаЭлемента", Новый Структура("Ключ", ВыбраннаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПисемПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПисемПередУдалением(Элемент, Отказ)
	Отказ = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТаблицаЛСНаСервере(ВыбранноеЗначение.АдресЛСВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПакетПриИзменении(Элемент)
	
	ИзменитьСостояниеТабличногоПоля("ФОРМИРОВАНИЕОТЧЕТА");
	
	ТабличныйДокумент = СформироватьКвитанции();
	
	Если НЕ ТабличныйДокумент = Неопределено Тогда
		ВывестиПакетНаСервере(ТабличныйДокумент);
		
	КонецЕсли;
	
	ИзменитьСостояниеТабличногоПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПакетОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Число(Текст) = 0 Тогда
		
		ТекущийПакет = 1;
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
	Если Число(Текст) > Объект.КоличествоПакетов Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРайоновПриИзменении(Элемент)
	
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУчастковПриИзменении(Элемент)
	
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУлицПриИзменении(Элемент)
	
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийПриИзменении(Элемент)
	
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриИзменении(Элемент)
	
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКвартирыПриИзменении(Элемент)
	
	ОтобразитьТекущиеОтборы();
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерПакетаПросмотраПриИзменении(Элемент)
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура МакетКвОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = Ложь;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",Объект.МакетКв);
	
	ОткрытьФорму("Справочник.бит_ВариантыСчетовИзвещений.Форма.ФормаЭлемента",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);	
	
КонецПроцедуры

// Процедура устанавливает отборы для электронных писем.
&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ТекущаяСтраница.Заголовок = "Электронные письма" Тогда
		
	ТаблицаПисем.Отбор.Элементы.Очистить();
	
		Если Объект.СписокРайонов.Количество() > 0 Тогда
			
			Значение = Новый СписокЗначений;
			
			Для Каждого Строка Из Объект.СписокРайонов Цикл 
				
				Значение.Добавить(Строка.Район);
				
			КонецЦикла;
			
			Эл = ТаблицаПисем.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Район");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
			Эл.ПравоеЗначение   = Значение;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли; 
		
		Если Объект.СписокУчастков.Количество() > 0 Тогда
			
			Значение = Новый СписокЗначений;
			
			Для Каждого Строка Из Объект.СписокУчастков Цикл 
				
				Значение.Добавить(Строка.Участок);
				
			КонецЦикла;
			
			Эл = ТаблицаПисем.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Участок");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
			Эл.ПравоеЗначение   = Значение;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли;
		
		Если Объект.СписокУлиц.Количество() > 0 Тогда
			
			Значение = Новый СписокЗначений;
			
			Для Каждого Строка Из Объект.СписокУлиц Цикл 
				
				Значение.Добавить(Строка.Улица);
				
			КонецЦикла;
			
			Эл = ТаблицаПисем.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Улица");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
			Эл.ПравоеЗначение   = Значение;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли; 
		
		Если Объект.СписокЗданий.Количество() > 0 Тогда
			
			Значение = Новый СписокЗначений;
			
			Для Каждого Строка Из Объект.СписокЗданий Цикл 
				
				Значение.Добавить(Строка.Здание);
				
			КонецЦикла;
			
			Эл = ТаблицаПисем.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Здание");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
			Эл.ПравоеЗначение   = Значение;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли;
		
		Если Объект.СписокЛС.Количество() > 0 Тогда
			
			Значение = Новый СписокЗначений;
			
			Для Каждого Строка Из Объект.СписокЛС Цикл 
				
				Значение.Добавить(Строка.ЛицевойСчет);
				
			КонецЦикла;
			
			Для каждого Строка из Объект.СписокЛС Цикл
				
				Если Строка.ПечатьЗависимыхЛС = Истина Тогда
					
					ДобавитьЗависимыеВОсновнойСписокНаСервере(Значение);
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;	
			
			Эл = ТаблицаПисем.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ЛицевойСчет");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
			Эл.ПравоеЗначение   = Значение;
			Эл.Использование    = Истина;
			Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МакетКвПриИзменении(Элемент)
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИзвещенийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ШаблонИзвещений) Тогда
		Объект.ПолучательПлатежа = ПолучитьЗначениеРеквизитаОбъекта(Объект.ШаблонИзвещений, "ПолучательПлатежа");
		
		Если ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
			ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент") 
			ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
			ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
			ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
			ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
			ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
			ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
			ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
			ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32") Тогда
			Объект.РС = ПолучательПлатежаПриИзмененииНаСервере(Объект.ПолучательПлатежа);
		КонецЕсли;
		
	КонецЕсли;
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура РСПриИзменении(Элемент)
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьУслугиПриИзменении(Элемент)
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПлатежаПриИзменении(Элемент)
	
	Если  ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32") Тогда
		Объект.РС = ПолучательПлатежаПриИзмененииНаСервере(Объект.ПолучательПлатежа);
	КонецЕсли;
	
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучательПлатежаПриИзмененииНаСервере(ПолучательПлатежа);
	
	РсчСч = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);
	Если ТипЗнч(ПолучательПлатежа) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.ОсновнойБанковскийСчет
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &ПолучательПлатежа";
	Иначе	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.ОсновнойБанковскийСчет
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &ПолучательПлатежа";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РсчСч = Выборка.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	Если РсчСч.Пустая() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &ПолучательПлатежа";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			РсчСч = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РсчСч;
	
КонецФункции

&НаКлиенте
Процедура СписокЛСПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Объект.СписокЛС.Количество() > 1 Тогда
		
		Отбор = Новый Структура;
		
		Для каждого Строка из Объект.СписокЛС Цикл
			
			Отбор.Вставить("ЛицевойСчет", Строка.ЛицевойСчет);
			
			СтрокиПоиска = Объект.СписокЛС.НайтиСтроки(Отбор);
			
			Если СтрокиПоиска.Количество() > 1 Тогда

				ТекстСообщения = НСтр("ru = 'Такой лицевой счет уже есть в списке!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Отказ = Истина;
				СтрокаДляУдаления = СтрокиПоиска[1].НомерСтроки - 1;
				Объект.СписокЛС.удалить(СтрокаДляУдаления);
				Возврат;
				
			КонецЕсли; 
			
		КонецЦикла;	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеПериодаРегистрации) Тогда
		ПредставлениеПериодаРегистрации = Формат(Объект.Период, "ДФ='ММММ гггг'");
	КонецЕсли;
	
	ПредставлениеПериодаРегистрации = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), 
	НачалоМесяца(Объект.Период), 
	КонецМесяца(Объект.Период));
	
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоМесяца(Объект.Период));
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаКонец" , КонецМесяца(Объект.Период));
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Объект.Период), КонецМесяца(Объект.Период));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, Элементы.ПредставлениеПериодаРегистрации, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьQRПриИзменении(Элемент)
	
	Элементы.сг_КодУслугиВСистемеГород.Видимость = Объект.ИспользоватьQR;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// Процедура получает доступные учетные записи запросом из справочника.
//
// Параметры:
//  Нет.
//
Процедура ПолучитьДоступныеУчетныеЗаписиДляОтправки()
	
	СписокВыбора = Элементы.ОтправительПредставление.СписокВыбора;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК УчетнаяЗапись,
	|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.УчетнаяЗапись, бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьПредставлениеАдресата(Выборка.ИмяПользователя,
		Выборка.АдресЭлектроннойПочты,
		""));
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если НЕ  (ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")) Тогда
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли; 
	ИзменитьСостояниеТабличногоПоля("НЕАКТУАЛЬНОСТЬОТЧЕТА");
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПакетНаСервере(ТабличныйДокумент)
	
	Результат.Очистить();
	Результат.Вывести(ТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.ОсновнойБанковскийСчет
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.РС = Выборка.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	Если Объект.РС.Пустая() Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Организация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект.РС = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_ВариантыСчетовИзвещений"     ,бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВариантыСчетовИзвещений));
	
	КэшированныеЗначения.Вставить("Перечисления", КэшПеречисления);
	
	// Настройки ЖКХ.
	мКэшЗначений.Вставить("ВыводитьЗамечанияЖКХ");
	мКэшЗначений.Вставить("ЛьготаПерсонифицированная");
	мКэшЗначений.Вставить("ВыводитьЛьготыНаСчетИзвещение");
	мКэшЗначений.Вставить("НачислятьПени");
	мКэшЗначений.Вставить("НеПечататьУлица");
	мКэшЗначений.Вставить("НеПечататьДом");
	мКэшЗначений.Вставить("НеПечататьКорпус");
	мКэшЗначений.Вставить("НеПечататьКвартира");
	мКэшЗначений.Вставить("НеПечататьРайон");
	мКэшЗначений.Вставить("ПрефиксУлица");
	мКэшЗначений.Вставить("ПрефиксДом");
	мКэшЗначений.Вставить("ПрефиксКорпус");
	мКэшЗначений.Вставить("ПрефиксКвартира");
	мКэшЗначений.Вставить("ПрефиксРайон");
	мКэшЗначений.Вставить("ВыводитьЗависимыеЛС");
	мКэшЗначений.Вставить("НомерПолучателяПоБанку");
	мКэшЗначений.Вставить("ИспользоватьНомерПолучателяВШК");
	мКэшЗначений.Вставить("ДатаНачалаВеденияПоКУ");
	мКэшЗначений.Вставить("ПолучательДопИнформация");
	мКэшЗначений.Вставить("КодУслугиВСистемеГород");
	мКэшЗначений.Вставить("ИспользоватьСокращенноеНаименование");
	мКэшЗначений.Вставить("ИспользоватьSumCПени");
	мКэшЗначений.Вставить("ФорматДаты");
	мКэшЗначений.Вставить("НазначениеПлатежа"); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшРеквизитовQRКода()
	
	мКэшРеквизитовQRКода = Новый Структура();
	
	мКэшРеквизитовQRКода.Вставить("ТекстПолучателя",             "Name");
	мКэшРеквизитовQRКода.Вставить("НомерСчетаПолучателя",        "PersonalAcc");
	мКэшРеквизитовQRКода.Вставить("НаименованиеБанкаПолучателя", "BankName");
	мКэшРеквизитовQRКода.Вставить("БИКБанкаПолучателя",          "BIC");
	мКэшРеквизитовQRКода.Вставить("СчетБанкаПолучателя",         "CorrespAcc");
	
	мКэшРеквизитовQRКода.Вставить("СуммаЧислом",         "Sum");
	мКэшРеквизитовQRКода.Вставить("НазначениеПлатежа",   "Purpose");
	мКэшРеквизитовQRКода.Вставить("ИННПолучателя",       "PayeeINN");
	мКэшРеквизитовQRКода.Вставить("ИННПлательщика",      "PayerINN");
	//мКэшРеквизитовQRКода.Вставить("СтатусСоставителя",   "DrawerStatus");
	мКэшРеквизитовQRКода.Вставить("КПППолучателя",       "KPP");
	//мКэшРеквизитовQRКода.Вставить("КодБК",               "CBC");
	//мКэшРеквизитовQRКода.Вставить("КодОКТМО",            "OKTMO");
	//мКэшРеквизитовQRКода.Вставить("ПоказательОснования", "PaytReason");
	//мКэшРеквизитовQRКода.Вставить("ПоказательПериода",   "TaxPeriod");
	//мКэшРеквизитовQRКода.Вставить("ПоказательНомера",    "DocNo");
	//мКэшРеквизитовQRКода.Вставить("ПоказательДаты",      "DocDate");
	//мКэшРеквизитовQRКода.Вставить("ПоказательТипа",      "TaxPaytKind");
	
	мКэшРеквизитовQRКода.Вставить("ФамилияПлательщика",               "lastName");
	мКэшРеквизитовQRКода.Вставить("ИмяПлательщика",                   "firstName");
	мКэшРеквизитовQRКода.Вставить("ОтчествоПлательщика",              "middleName");
	мКэшРеквизитовQRКода.Вставить("АдресПлательщика",                 "payerAddress");
	//мКэшРеквизитовQRКода.Вставить("ЛицевойСчетБюджетногоПолучателя",  "personalAccount");
	//мКэшРеквизитовQRКода.Вставить("ИндексПлатежногоДокумента",        "docIdx");
	//мКэшРеквизитовQRКода.Вставить("СНИЛС",                            "pensAcc");
	//мКэшРеквизитовQRКода.Вставить("НомерДоговора",                    "contract");
	мКэшРеквизитовQRКода.Вставить("НомерЛицевогоСчетаПлательщика",    "persAcc");
	//мКэшРеквизитовQRКода.Вставить("НомерКвартиры",                    "flat");
	//мКэшРеквизитовQRКода.Вставить("НомерТелефона",                    "phone");
	//мКэшРеквизитовQRКода.Вставить("ВидПлательщика",                   "payerIdType");
	//мКэшРеквизитовQRКода.Вставить("НомерПлательщика",                 "payerIdNum");
	//мКэшРеквизитовQRКода.Вставить("ФИОРебенка",                       "childFio");
	//мКэшРеквизитовQRКода.Вставить("ДатаРождения",                     "birthDate");
	//мКэшРеквизитовQRКода.Вставить("СрокПлатежа",                      "paymTerm");
	мКэшРеквизитовQRКода.Вставить("ПериодОплаты",                     "paymPeriod");
	мКэшРеквизитовQRКода.Вставить("ВидПлатежа",                       "category");
	//мКэшРеквизитовQRКода.Вставить("КодУслуги",                        "serviceName");
	//мКэшРеквизитовQRКода.Вставить("НомерПрибораУчета",                "counterId");
	//мКэшРеквизитовQRКода.Вставить("ПоказаниеПрибораУчета",            "counterVal");
	//мКэшРеквизитовQRКода.Вставить("НомерИзвещения",                   "quittId");
	//мКэшРеквизитовQRКода.Вставить("ДатаИзвещения",                    "quittDate");
	//мКэшРеквизитовQRКода.Вставить("НомерУчреждения",                  "instNum");
	//мКэшРеквизитовQRКода.Вставить("НомерГруппы",                      "classNum");
	//мКэшРеквизитовQRКода.Вставить("ФИОПреподавателя",                 "specFio");
	мКэшРеквизитовQRКода.Вставить("СуммаСтраховки",                   "addAmount");
	//мКэшРеквизитовQRКода.Вставить("НомерПостановления",               "ruleId");
	//мКэшРеквизитовQRКода.Вставить("НомерИсполнительногоПроизводства", "execId");
	//мКэшРеквизитовQRКода.Вставить("КодВидаПлатежа",                   "regType");
	//мКэшРеквизитовQRКода.Вставить("ИдентификаторНачисления",          "uin");
	//мКэшРеквизитовQRКода.Вставить("ТехническийКод",                   "TechCode");
	
КонецПроцедуры

&НаСервере
Функция СформироватьКвитанции(Печать = Ложь)
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ПечатьСчетИзвещений"));
	
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати(,Печать);
	
	Объект.КоличествоПакетов       = ОбработкаОбъект.КоличествоПакетов;
	Объект.КоличествоПакетовПечати = ОбработкаОбъект.КоличествоПакетовПечати;
	
	Если ТаблицаДанных = Неопределено ИЛИ ТаблицаДанных.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресХранилщаДанныхГИСЖКХ)
		И ЭтоАдресВременногоХранилища(АдресХранилщаДанныхГИСЖКХ) Тогда
		УдалитьИзВременногоХранилища(АдресХранилщаДанныхГИСЖКХ);
	КонецЕсли;

	ТабличныйДокумент = ОбработкаОбъект.ПечатьКвитанций(ТаблицаДанных,,, АдресХранилщаДанныхГИСЖКХ);
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

&НаСервере
Процедура ВывестиНаПечатьКвитанцию(ОбработкаОбъект,
	ТабличнйДокумент,
	МассивИсключений,

	Знач Источник,
	Знач ВладелецФайла,
	СписокФайлов = Неопределено,
	Знач ПечатьКвитанцийНаКаждойСтанице = Ложь,
	Знач ТаблицаЗависимых = Неопределено,
	Знач ТаблицаДанных = Неопределено)
	
	Если НЕ МассивИсключений.Найти(Источник.ЛицевойСчет) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Квитанция = ОбработкаОбъект.ПолучитьКвитанциюПоЛС(Источник);
	
	ТабличнйДокумент.Вывести(Квитанция);
	
	// Вывод разделителя для квитанций.
	ВывестиРазделитель = Истина;
	
	Если  Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.Квитанция  
		ИЛИ Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.Квитанция2
		ИЛИ Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.КвитанцияСПБ
		ИЛИ Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.Квитанция3
		ИЛИ Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.Квитанция4
		ИЛИ Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.Квитанция5
		ИЛИ Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.Квитанция6 Тогда
		
		Если НЕ ПечатьКвитанцийНаКаждойСтанице Тогда
			ВывестиРазделитель = НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличнйДокумент, Квитанция);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ВывестиРазделитель Тогда
		ТабличнйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли; 
	
	Если НЕ СписокФайлов = Неопределено Тогда
		
		РазрешениеФайла = НРег(Строка(ТипФайла));
		Если Объект.ЗапаковатьZIP Тогда
			РазрешениеФайла = НРег("ZIP");
		КонецЕсли; 
		
		НоваяСтрока = СписокФайлов.Добавить();
		НоваяСтрока.ЛицевойСчет                    = ВладелецФайла;
		
		НоваяСтрока.ИмяФайла                       = "Счет извещение (" + ПредставлениеПериодаРегистрации+")";
		
		НоваяСтрока.РазрешениеФайла                = РазрешениеФайла;
		НоваяСтрока.АдресФайлаВоВременномХранилище = ДобавитьПрикрепленныйФайл(Квитанция);
		
	КонецЕсли; 
	
	Если Источник.Значение.СтруктураДанных.ПечатьЗависимыхЛС И Не ТаблицаЗависимых = Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", Источник.ЛицевойСчет);
		
		СтрокиПосика = ТаблицаЗависимых.НайтиСтроки(Отбор);
		
		Для каждого СтрокаЗависимых Из СтрокиПосика Цикл
			
			СтрокаСДанными = ТаблицаДанных.Найти(СтрокаЗависимых.ЛицевойСчетЗависимый, "ЛицевойСчет");
			
			Если НЕ СтрокаСДанными = Неопределено Тогда
				
				ВывестиНаПечатьКвитанцию(ОбработкаОбъект,
				ТабличнйДокумент,
				МассивИсключений,

				СтрокаСДанными,
				ВладелецФайла,
				СписокФайлов,
				ПечатьКвитанцийНаКаждойСтанице);
				
				МассивИсключений.Добавить(СтрокаСДанными.ЛицевойСчет);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПрикрепленныйФайл(ТабДок)
	
	ПутьВоВременномХранилище = "";
	
	ЗаписьZipФайла = Неопределено;
	ИмяАрхива      = Неопределено;
	Если Объект.ЗапаковатьZIP Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	
	ИмяФайла = "Счет извещение ([Период]).[Расширение]";
	
	ИмяФайла = СтрЗаменить(ИмяФайла, "[Период]"    , ПредставлениеПериодаРегистрации);
	
	ИмяФайла = СтрЗаменить(ИмяФайла, "[Расширение]", НРег(Строка(ТипФайла)));
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
	
	ИмяВременногоФайла = ИмяВременнойПапки + "\" + ИмяФайла;
	ТабДок.Записать(ИмяВременногоФайла, ТипФайла);
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
		ВставитьКартинкиВHTML(ИмяВременногоФайла);
	КонецЕсли;
	
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Добавить(ИмяВременногоФайла);
		ЗаписьZipФайла.Записать();
		ФайлАрхива = Новый Файл(ИмяАрхива);
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	Иначе
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ПутьВоВременномХранилище;
	
КонецФункции

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок   = ФайлHTML.ИмяБезРасширения + "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// Ожидается, что в папке будут только картинки.
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ИмяПапкиКартинок + "\" + ФайлКартинки.Имя, КартинкаТекстом);
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ВыводитьЗамечанияЖКХ"               , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"          , Ложь);
	ПараметрыЖКХ.Вставить("ВыводитьЛьготыНаСчетИзвещение"      , Ложь);
	ПараметрыЖКХ.Вставить("НачислятьПени"                      , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьУлица"                    , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьДом"                      , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьКорпус"                   , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьКвартира"                 , Ложь);
	ПараметрыЖКХ.Вставить("НеПечататьРайон"                    , Истина);
	ПараметрыЖКХ.Вставить("ПрефиксУлица"                       , "ул.");
	ПараметрыЖКХ.Вставить("ПрефиксДом"                         , "д.");
	ПараметрыЖКХ.Вставить("ПрефиксКорпус"                      , "корп.");
	ПараметрыЖКХ.Вставить("ПрефиксКвартира"                    , "кв.");
	ПараметрыЖКХ.Вставить("ПрефиксРайон"                       , "");
	ПараметрыЖКХ.Вставить("ВыводитьЗависимыеЛС"                , Ложь);
	ПараметрыЖКХ.Вставить("НомерПолучателяПоБанку"             , 0);
	ПараметрыЖКХ.Вставить("ИспользоватьНомерПолучателяВШК"     , Ложь);
	ПараметрыЖКХ.Вставить("ДатаНачалаВеденияПоКУ"              , НачалоГода(Объект.Период));
	ПараметрыЖКХ.Вставить("КодУслугиВСистемеГород"             , "");
	ПараметрыЖКХ.Вставить("ИспользоватьСокращенноеНаименование", Ложь);
	ПараметрыЖКХ.Вставить("ФорматДаты"						   , "");
	ПараметрыЖКХ.Вставить("НазначениеПлатежа"				   , ""); 
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Объект.Период, Объект.Организация, ПараметрыЖКХ);
	
	мКэшЗначений.ВыводитьЗамечанияЖКХ             = ПараметрыЖКХ.ВыводитьЗамечанияЖКХ;
	мКэшЗначений.ЛьготаПерсонифицированная        = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	мКэшЗначений.ВыводитьЛьготыНаСчетИзвещение    = ПараметрыЖКХ.ВыводитьЛьготыНаСчетИзвещение;
	мКэшЗначений.НачислятьПени                    = ПараметрыЖКХ.НачислятьПени;
	мКэшЗначений.НеПечататьУлица                  = ПараметрыЖКХ.НеПечататьУлица;
	мКэшЗначений.НеПечататьДом                    = ПараметрыЖКХ.НеПечататьДом;
	мКэшЗначений.НеПечататьКорпус                 = ПараметрыЖКХ.НеПечататьКорпус;
	мКэшЗначений.НеПечататьКвартира               = ПараметрыЖКХ.НеПечататьКвартира;
	мКэшЗначений.НеПечататьРайон                  = ПараметрыЖКХ.НеПечататьРайон;
	мКэшЗначений.ПрефиксУлица                     = ПараметрыЖКХ.ПрефиксУлица;
	мКэшЗначений.ПрефиксДом                       = ПараметрыЖКХ.ПрефиксДом;
	мКэшЗначений.ПрефиксКорпус                    = ПараметрыЖКХ.ПрефиксКорпус;
	мКэшЗначений.ПрефиксКвартира                  = ПараметрыЖКХ.ПрефиксКвартира;
	мКэшЗначений.ПрефиксРайон                     = ПараметрыЖКХ.ПрефиксРайон;
	мКэшЗначений.ВыводитьЗависимыеЛС              = ПараметрыЖКХ.ВыводитьЗависимыеЛС;
	мКэшЗначений.НомерПолучателяПоБанку           = ПараметрыЖКХ.НомерПолучателяПоБанку;
	мКэшЗначений.ИспользоватьНомерПолучателяВШК   = ПараметрыЖКХ.ИспользоватьНомерПолучателяВШК;
	мКэшЗначений.ДатаНачалаВеденияПоКУ            = ПараметрыЖКХ.ДатаНачалаВеденияПоКУ;
	мКэшЗначений.КодУслугиВСистемеГород            = ПараметрыЖКХ.КодУслугиВСистемеГород;
	мКэшЗначений.ИспользоватьСокращенноеНаименование = ПараметрыЖКХ.ИспользоватьСокращенноеНаименование;
	мКэшЗначений.ФорматДаты							 = ПараметрыЖКХ.ФорматДаты;
	мКэшЗначений.НазначениеПлатежа					 = ПараметрыЖКХ.НазначениеПлатежа; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьЗависимыеВОсновнойСписок(СписокЛицевыйСчетов, ТаблицаЛС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЛС", ТаблицаЛС);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.ПечатьЗависимыхЛС
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	&ТаблицаЛС КАК ТаблицаЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗависимыеЛС.ЛицевойСчетЗависимый,
	|	ОсновнаяТаблица.ЛицевойСчет
	|ИЗ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	|		ПО ОсновнаяТаблица.ЛицевойСчет = бит_ЗависимыеЛС.ЛицевойСчет
	|ГДЕ
	|	ОсновнаяТаблица.ПечатьЗависимыхЛС
	|	И НЕ бит_ЗависимыеЛС.ЛицевойСчетЗависимый ЕСТЬ NULL ";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокЛицевыйСчетов.Добавить(Выборка.ЛицевойСчетЗависимый);
		
	КонецЦикла; 
	
КонецФункции

&НаСервере
Процедура СоздатьЭлектронныеПисьма(ТолькоПоОтбору = Ложь)
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка,
	|	бит_ПроживающиеКонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ КИ
	|ИЗ
	|	Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
	|ГДЕ
	|	бит_ПроживающиеКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И бит_ПроживающиеКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПроживающего)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ПолучательПисьма,
	|	КИ.Представление КАК АдресПочты
	|ПОМЕСТИТЬ ОтветсвенныеЛицаКИ
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ КИ КАК КИ
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = КИ.Ссылка
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	ОтветсвенныеЛицаКИ.ПолучательПисьма,
	|	ОтветсвенныеЛицаКИ.АдресПочты
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветсвенныеЛицаКИ КАК ОтветсвенныеЛицаКИ
	|		ПО бит_ЛицевыеСчета.Ссылка = ОтветсвенныеЛицаКИ.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтветсвенныеЛицаКИ";
	
	ПостроительЗапроса.Параметры.Вставить("Дата", КонецМесяца(Объект.Период));
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	// Отбор по ЛС.
	Если Объект.СписокЛС.Количество() > 0 Тогда
		
		тмпСписокЛС = Объект.СписокЛС.Выгрузить();
		
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(тмпСписокЛС.ВыгрузитьКолонку("ЛицевойСчет"));
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборЛС.Значение      = Значение;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	// Параметры для печати квитанций  Начало.
	ТабличнйДокумент  = Новый ТабличныйДокумент;
	
	ТабличнйДокумент.АвтоМасштаб = Истина;
	
	Если Объект.МакетКв = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент Тогда
		ТабличнйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Иначе
		ТабличнйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	КонецЕсли;
	
	МассивИсключений  = Новый Массив;
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ПечатьСчетИзвещений"));
	
	ОбработкаОбъект.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	
	ОбработкаОбъект.УстановитьНастройкиТабличногоДокумена(ТабличнйДокумент);
	
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати(ТолькоПоОтбору);
	
	ШаблонСообщения = ПолучитьСтукрутуШаблонаСообщения(ШаблонТекстаПисьма);
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВладелецЛС", Выборка.ЛицевойСчет);
		
		ПоискЛС = ТаблицаДанных.НайтиСтроки(Отбор);
		
		Если ПоискЛС.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВремяИзменения  = ТекущаяДатаСеанса();
		Автор           = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		Письмо = Справочники.бит_ЭлектронноеПисьмоИсходящее.СоздатьЭлемент();
		Письмо.Автор                    = Автор;
		Письмо.Ответственный            = Автор;
		Письмо.СтатусПисьма             = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Черновик;
		
		
		Письмо.ДатаСоздания             = ВремяИзменения;
		Письмо.Тема                     = ТемаПисьма;
		Письмо.ЕстьВложения             = Истина;
		Письмо.ОтправкаКвитанций        = Истина;
		Письмо.Предмет                  = Выборка.ЛицевойСчет;
		Письмо.ШаблонИзвещений          = Объект.ШаблонИзвещений;
		Письмо.ПериодКвитанции          = Объект.Период;
		
		
		Письмо.Комментарий = "Созданно автоматически из обработки ""Печать счет извещений"", за период: " + ПредставлениеПериодаРегистрации;
		
		
		Если НЕ Объект.УчетнаяЗапись.Пустая() Тогда
			
			Письмо.УчетнаяЗапись = Объект.УчетнаяЗапись;
			
			РеквизитыОтправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.УчетнаяЗапись,"Ссылка, ИмяПользователя, АдресЭлектроннойПочты");
			Письмо.ОтправительПредставление = бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьПредставлениеАдресата(
			РеквизитыОтправителя.ИмяПользователя, РеквизитыОтправителя.АдресЭлектроннойПочты, "");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПолучательПисьма) И Не ПустаяСтрока(Выборка.АдресПочты) Тогда
			Письмо.СписокПолучателейПисьма = Выборка.АдресПочты;
			НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
			НоваяСтрока.Адрес   = Выборка.АдресПочты;
			НоваяСтрока.Контакт = Выборка.ПолучательПисьма;
		КонецЕсли;
		
		Если Объект.ОставлятьПисьмаНаСервере Тогда
			
			НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
			НоваяСтрока.Адрес = Объект.УчетнаяЗапись.АдресЭлектроннойПочты;
			
		КонецЕсли; 
		
		// Перенос вторичных адресов в поле копия
		// 20.02.2019				
		если ЗначениеЗаполнено(НоваяСтрока) и СтрЧислоВхождений(НоваяСтрока.Адрес, ";") > 0 тогда
			
			АдресаПолучателейПисьма = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НоваяСтрока.Адрес, ";");
			
			Письмо.ПолучателиПисьма.Очистить();
			
			НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
			НоваяСтрока.Адрес = АдресаПолучателейПисьма[0];
			Письмо.СписокПолучателейПисьма = НоваяСтрока.Адрес; 
			Письмо.СписокПолучателейКопий = "";
			
			АдресаПолучателейПисьма.Удалить(0);
			
			для каждого стр из АдресаПолучателейПисьма цикл				
								
				НоваяСтрока = Письмо.ПолучателиКопий.Добавить();
			    НоваяСтрока.Адрес = СокрЛП(стр);
				
				Письмо.СписокПолучателейКопий = Письмо.СписокПолучателейКопий + СокрЛП(стр) + ";" ;

			конеццикла;	
			
		конецесли;
		//-----------------
		
		Попытка
			
			Письмо.Записать();
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = '%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ОтменитьТранзакцию();
			Возврат;
			
		КонецПопытки;
		
		Для каждого СтрокаТаблицы Из ПоискЛС Цикл
			
			ТабличнйДокумент.Очистить();
			ОбработкаОбъект.ВывестиНаПечатьКвитанцию(ТабличнйДокумент, СтрокаТаблицы);
			
			РазрешениеФайла = НРег(Строка(ТипФайла));
			Если Объект.ЗапаковатьZIP Тогда
				РазрешениеФайла = НРег("ZIP");
			КонецЕсли; 
			
			ИмяФайла = "Счет извещение (" + ПредставлениеПериодаРегистрации +"_"+ СтрокаТаблицы.ЛицевойСчет + ")";
			
			АдресФайлаВоВременномХранилище = ДобавитьПрикрепленныйФайл(ТабличнйДокумент);
			
			бит_ПрисоединенныеФайлыСервер.ДобавитьФайл(Письмо.Ссылка,
														ИмяФайла,
														РазрешениеФайла,
														ВремяИзменения,
														ВремяИзменения,
														АдресФайлаВоВременномХранилище);
			
		КонецЦикла;
		
		ДобавитьТекстШаблонаСообщения(Письмо.Ссылка, ШаблонСообщения);
		
	КонецЦикла; 
	
	ЗафиксироватьТранзакцию();
	
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоМесяца(Объект.Период));
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("ДатаКонец" , КонецМесяца(Объект.Период));
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьма(НовыйСтатусПисьма)
	
	// Запрос переделан на построитель чтобы действовали отборы.
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	бит_ЭлектронноеПисьмоИсходящее.Ссылка КАК ЭлектронноеПисьмо,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет КАК ЛицевойСчет,
	|	бит_ЭлектронноеПисьмоИсходящее.СтатусПисьма,
	|	бит_ЭлектронноеПисьмоИсходящее.СписокПолучателейПисьма,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание КАК Здание,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание.Улица КАК Улица,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание.Участок КАК Участок,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание.Район КАК Район
	|ИЗ
	|	Справочник.бит_ЭлектронноеПисьмоИсходящее КАК бит_ЭлектронноеПисьмоИсходящее
	|ГДЕ
	|	бит_ЭлектронноеПисьмоИсходящее.ОтправкаКвитанций
	|	И бит_ЭлектронноеПисьмоИсходящее.Предмет ССЫЛКА Справочник.бит_ЛицевыеСчета
	|	И бит_ЭлектронноеПисьмоИсходящее.ПериодКвитанции МЕЖДУ &ДатаНачало И &ДатаКонец
	|	И НЕ бит_ЭлектронноеПисьмоИсходящее.ПометкаУдаления";
	
	ПостроительЗапроса.Параметры.Вставить("ДатаНачало", НачалоМесяца(Объект.Период));
	ПостроительЗапроса.Параметры.Вставить("ДатаКонец" , КонецМесяца(Объект.Период));
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	// Отбор по районам.
	Если Объект.СписокРайонов.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		
		Для Каждого Строка Из Объект.СписокРайонов Цикл 
			
			Значение.Добавить(Строка.Район);
			
		КонецЦикла;
		
		ОтборРайоны = ПостроительЗапроса.Отбор.Добавить("Район");
		ОтборРайоны.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборРайоны.Значение      = Значение;
		ОтборРайоны.Использование = Истина;
		
	КонецЕсли; 
	
	// Отбор по участкам.
	Если Объект.СписокУчастков.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		
		Для Каждого Строка Из Объект.СписокУчастков Цикл 
			
			Значение.Добавить(Строка.Участок);
			
		КонецЦикла;
		
		ОтборУчасток = ПостроительЗапроса.Отбор.Добавить("Участок");
		ОтборУчасток.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборУчасток.Значение      = Значение;
		ОтборУчасток.Использование = Истина;
		
	КонецЕсли;
	
	// Отбор по улицам.
	Если Объект.СписокУлиц.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		
		Для Каждого Строка Из Объект.СписокУлиц Цикл 
			
			Значение.Добавить(Строка.Улица);
			
		КонецЦикла;
		
		ОтборУлиц = ПостроительЗапроса.Отбор.Добавить("Улица");
		ОтборУлиц.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборУлиц.Значение      = Значение;
		ОтборУлиц.Использование = Истина;
		
	КонецЕсли; 
	
	// Отбор по зданиям.
	Если Объект.СписокЗданий.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		
		Для Каждого Строка Из Объект.СписокЗданий Цикл 
			
			Значение.Добавить(Строка.Здание);
			
		КонецЦикла;
		
		ОтборЗданий = ПостроительЗапроса.Отбор.Добавить("Здание");
		ОтборЗданий.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборЗданий.Значение      = Значение;
		ОтборЗданий.Использование = Истина;
		
	КонецЕсли;
	
	// Отбор по лицевым счетам.
	Если Объект.СписокЛС.Количество() > 0 Тогда
		
		Значение = Новый СписокЗначений;
		
		Для Каждого Строка Из Объект.СписокЛС Цикл 
			
			Значение.Добавить(Строка.ЛицевойСчет);
			
		КонецЦикла;
		
		Для каждого Строка из Объект.СписокЛС Цикл
			
			Если Строка.ПечатьЗависимыхЛС = Истина Тогда
				
				ДобавитьЗависимыеВОсновнойСписокНаСервере(Значение);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;	
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = ВидСравнения.ВСписке;
		ОтборЛС.Значение      = Значение;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СтатусПисьма = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено 
			ИЛИ Выборка.СтатусПисьма = НовыйСтатусПисьма Тогда
			Продолжить;
		КонецЕсли; 
		
		ПисьмоОбъект = Выборка.ЭлектронноеПисьмо.ПолучитьОбъект();
		
		Если НовыйСтатусПисьма = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Исходящее Тогда
			
			ПисьмоОбъект.СтатусПисьма           = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
			
		ИначеЕсли НовыйСтатусПисьма = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено Тогда
			
			Если ЗначениеЗаполнено(Выборка.СписокПолучателейПисьма) Тогда
				Профиль =  РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(Объект.УчетнаяЗапись);
			Иначе
				Продолжить;
			КонецЕсли;
			
			Попытка
				Соединение = Новый ИнтернетПочта;
				Соединение.Подключиться(Профиль);
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстСообщения = НСтр("ru = 'Во время подключения к учетной записи %1 произошла ошибка!
											|%2'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Объект.УчетнаяЗапись), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			Попытка
				
				Если НЕ ЗначениеЗаполнено(ПисьмоОбъект.УчетнаяЗапись) Тогда
					ПисьмоОбъект.УчетнаяЗапись = Объект.УчетнаяЗапись; 
				КонецЕсли;
				
				ИдентификаторПисьма = бит_УправлениеЭлектроннойПочтойСервер.ВыполнитьОтправкуПисьма(ПисьмоОбъект, Соединение);
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстСообщения = НСтр("ru = 'Во время отправки электронного письма %1 произошла ошибка!
											|%2'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Выборка.ЭлектронноеПисьмо), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			ПисьмоОбъект.ИдентификаторСообщения = ИдентификаторПисьма;
			ПисьмоОбъект.СтатусПисьма           = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено;
			ПисьмоОбъект.Размер                 = бит_УправлениеЭлектроннойПочтойСервер.ОценитьРазмерИсходящегоЭлектронногоПисьма(ПисьмоОбъект.Ссылка);
			ПисьмоОбъект.ДатаОтправления        = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
		ПисьмоОбъект.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодобранныхПолучателей(Письмо, Адреса)
	
	ПисьмоОбъект = Письмо.ПолучитьОбъект();
	
	СоответствиеТабличныхЧастей = Новый Соответствие;
	СоответствиеТабличныхЧастей.Вставить("Кому" , ПисьмоОбъект.ПолучателиПисьма);
	СоответствиеТабличныхЧастей.Вставить("Копии", ПисьмоОбъект.ПолучателиКопий);
	СоответствиеТабличныхЧастей.Вставить("Ответ", ПисьмоОбъект.ПолучателиОтвета);
	
	Для Каждого ТабличнаяЧасть Из СоответствиеТабличныхЧастей Цикл
		ТабличнаяЧасть.Значение.Очистить();
	КонецЦикла;
	
	Для Каждого Элемент Из Адреса Цикл
		
		ТабличнаяЧасть = СоответствиеТабличныхЧастей.Получить(Элемент.Группа);
		Если ТабличнаяЧасть = Неопределено Тогда
			ТабличнаяЧасть = ПисьмоОбъект.ПолучателиПисьма;
		КонецЕсли;
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		НоваяСтрока.Адрес = Элемент.Адрес;
		НоваяСтрока.Представление = Элемент.Представление;
		НоваяСтрока.Контакт = Элемент.Контакт;
		
	КонецЦикла;
	
	ПисьмоОбъект.СписокПолучателейПисьма =
	бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(ПисьмоОбъект.ПолучателиПисьма, Ложь);
	ПисьмоОбъект.СписокПолучателейКопий =
	бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(ПисьмоОбъект.ПолучателиКопий, Ложь);
	
	ПисьмоОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОткрытияФормыПодбора()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , Объект.Период);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	Если СписокУлиц.Количество() > 0 Тогда
		
		тмпСпсиокУлиц = СписокУлиц.Выгрузить();
		
		ЗначениеУлиц =  Новый СписокЗначений;
		ЗначениеУлиц.ЗагрузитьЗначения(тмпСпсиокУлиц.ВыгрузитьКолонку("Улица"));
		
		ПараметрыФормы.Вставить("СписокУлиц", ЗначениеУлиц);
		
	КонецЕсли; 
	
	Если СписокЗданий.Количество() > 0 Тогда
		
		тмпСпсиокЗданий = СписокЗданий.Выгрузить();
		
		ЗначениеЗданий =  Новый СписокЗначений;
		ЗначениеЗданий.ЗагрузитьЗначения(тмпСпсиокЗданий.ВыгрузитьКолонку("Здание"));
		
		ПараметрыФормы.Вставить("СписокЗданий", ЗначениеЗданий);
		
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Процедура ТаблицаЛСНаСервере(АдресЛСВХранилище)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка получения данных из временного хранилища. Выполните подбор заново.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаТаблицы.ЛицевойСчет);
		
		СтрокиПосика = Объект.СписокЛС.НайтиСтроки(Отбор);
		
		Если СтрокиПосика.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.СписокЛС.Добавить();
			НоваяСтрока.ЛицевойСчет = СтрокаТаблицы.ЛицевойСчет;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
// Процедура полцчает настройки макета.
//
// Параметры:
//  Нет.
//
Функция ПолучитьНастройкуМакета()
	
	Настройка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МакетКвитанции", Объект.МакетКв);
	Запрос.УстановитьПараметр("Пользователь"  , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.МакетКвитанции,
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Ссылка КАК Настройка
	|ПОМЕСТИТЬ ПредопределенныеНастройки
	|ИЗ
	|	Справочник.бит_НастройкиПечатиМакетовСчетИзвещений КАК бит_НастройкиПечатиМакетовСчетИзвещений
	|ГДЕ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.МакетКвитанции КАК МакетКвитанции,
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.НастройкаМакета
	|ПОМЕСТИТЬ НастройкиПользователя
	|ИЗ
	|	РегистрСведений.бит_ТекущиеНастройкиМакетовСчетИзвещений КАК бит_ТекущиеНастройкиМакетовСчетИзвещений
	|ГДЕ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ВариантыСчетовИзвещений.Ссылка КАК МакетКвитанции,
	|	ВЫБОР
	|		КОГДА НастройкиПользователя.НастройкаМакета ЕСТЬ NULL 
	|			ТОГДА ПредопределенныеНастройки.Настройка
	|		ИНАЧЕ НастройкиПользователя.НастройкаМакета
	|	КОНЕЦ КАК НастройкаМакета,
	|	бит_ВариантыСчетовИзвещений.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ВариантыСчетовИзвещений КАК бит_ВариантыСчетовИзвещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредопределенныеНастройки КАК ПредопределенныеНастройки
	|		ПО (ПредопределенныеНастройки.МакетКвитанции = бит_ВариантыСчетовИзвещений.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиПользователя КАК НастройкиПользователя
	|		ПО бит_ВариантыСчетовИзвещений.Ссылка = НастройкиПользователя.МакетКвитанции
	|ГДЕ
	|	бит_ВариантыСчетовИзвещений.Ссылка = &МакетКвитанции
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПредопределенныеНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиПользователя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Настройка = Выборка.НастройкаМакета;
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции 

&НаСервере
// Процедура проверки версии обработки.
//
// Параметры:
//  Нет.
//
Процедура ПроверитьВерсиюОбработки()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ТекОбъект.ПолучитьМакет("ВерсияОбработки");
	
	ТекущаяВерсия = СокрЛП(Макет.ПолучитьТекст());
	ВерсияИБ      = Обработки.бит_ПечатьСчетИзвещений.ВерсияОбработки();
	
	Если НЕ ТекущаяВерсия = ВерсияИБ Тогда
		ТекстСообщения = НСтр("ru = 'Доступно обновление обработки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Заголовок = Заголовок + " v." +ТекущаяВерсия;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиОтбора();
	
	Если ЗначениеЗаполнено(АдресХранилщаДанныхГИСЖКХ)
		И ЭтоАдресВременногоХранилища(АдресХранилщаДанныхГИСЖКХ) Тогда
		УдалитьИзВременногоХранилища(АдресХранилщаДанныхГИСЖКХ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура сохранения настроек отбора.
//
// Параметры:
//  Нет.
//
Процедура СохранитьНастройкиОтбора()
	
	КлючОбъекта = "Обработка.бит_ПечатьСчетИзвещений.Форма.ФормаУправляемая/ТекущиеДанные";
	
	Настройка = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта);
	
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЭлементыФормы = Новый Массив;
	ЭлементыФормы.Добавить("СписокЛС");
	ЭлементыФормы.Добавить("СписокРайонов");
	ЭлементыФормы.Добавить("СписокУчастков");
	ЭлементыФормы.Добавить("СписокЗданий");
	ЭлементыФормы.Добавить("СписокУлиц");
	
	Если НЕ Объект.ОчищатьОтборы Тогда
		
		Для каждого Элемент Из ЭлементыФормы Цикл
			Настройка.Вставить(Элемент, Объект[Элемент].Выгрузить());
		КонецЦикла;
		
	Иначе 
		
		Для каждого Элемент Из ЭлементыФормы Цикл
			Настройка.Удалить(Элемент);
		КонецЦикла;
		
	КонецЕсли;
	
	Настройка.Вставить("ТаблицаРеквизитовQRКода", Объект.ТаблицаРеквизитовQRКода.Выгрузить());
	Настройка.Вставить("Объект.БезПрефиксаНежилогоПомещения", Объект.БезПрефиксаНежилогоПомещения);
	
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта,,Настройка);
	
КонецПроцедуры 

&НаСервере
// Процедура получает количество пакетов на печать.
//
// Параметры:
//  Нет.
//
Процедура ПолучитьКоличествоПакетовПечати()
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ПечатьСчетИзвещений"));
	ОбработкаОбъект.ПолучитьЛСПоОтбору();
	Объект.КоличествоПакетовПечати = ОбработкаОбъект.КоличествоПакетовПечати;
	
КонецПроцедуры 

&НаКлиенте
// Процедура изменяет актуальность табличного поля.
//
Процедура ИзменитьСостояниеТабличногоПоля(Состояние = "НеИспользовать")
	
	ОтображениеСостояния = Элементы.ФормаРезультат.ОтображениеСостояния;
	
	Если ВРег(Состояние) = "НЕИСПОЛЬЗОВАТЬ" Тогда
		
		ОтображениеСостояния.Видимость                      = Ложь;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		ОтображениеСостояния.Текст                          = "";
		
		Элементы.Назад.Доступность        = Истина;
		Элементы.Веперд.Доступность       = Истина; 
		Элементы.ТекущийПакет.Доступность = Истина;
		Элементы.ФормаРезультат.Доступность    = Истина;
		
	ИначеЕсли ВРег(Состояние) = "НЕАКТУАЛЬНОСТЬОТЧЕТА" Тогда
		
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Текст                          = НСтр("ru = 'Счет-извещение не сформировано. Нажмите ""Сформировать""..'");
		
		Элементы.Назад.Доступность        = Ложь;
		Элементы.Веперд.Доступность       = Ложь; 
		Элементы.ТекущийПакет.Доступность = Ложь;
		Элементы.ФормаРезультат.Доступность    = Ложь;
		
	ИначеЕсли ВРег(Состояние) = "ФОРМИРОВАНИЕОТЧЕТА" Тогда
		
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Текст                          = НСтр("ru = 'Счет-извещение формируется...'");
		
		Элементы.Назад.Доступность        = Ложь;
		Элементы.Веперд.Доступность       = Ложь; 
		Элементы.ТекущийПакет.Доступность = Ложь;
		Элементы.ФормаРезультат.Доступность    = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Процедура получает структуру шаблона сообщения.
//
Функция ПолучитьСтукрутуШаблонаСообщения(ШаблонТекстаПисьма)
	
	СтруктураШаблонаСообщения = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ШаблонТекстаПисьма);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныСообщений.Текст,
	|	бит_ШаблоныСообщений.ТекстHTML,
	|	бит_ШаблоныСообщений.ТипТекста,
	|	бит_ШаблоныСообщений.Кодировка,
	|	бит_ШаблоныСообщений.ТаблицаСоответствийИменВложенийИдентификаторам.(
	|		ИмяФайла,
	|		ИдентификаторФайлаДляHTML,
	|		Картинка
	|	) КАК ТаблицаСоответствийИменВложений
	|ИЗ
	|	Справочник.бит_ШаблоныСообщений КАК бит_ШаблоныСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ШаблоныСообщений.ТаблицаСоответствийИменВложенийИдентификаторам КАК бит_ШаблоныСообщенийТаблицаСоответствийИменВложенийИдентификаторам
	|		ПО бит_ШаблоныСообщений.Ссылка = бит_ШаблоныСообщенийТаблицаСоответствийИменВложенийИдентификаторам.Ссылка
	|ГДЕ
	|	бит_ШаблоныСообщений.Ссылка = &Ссылка
	|	И НЕ бит_ШаблоныСообщений.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураШаблонаСообщения = Новый Структура("Текст,ТекстHTML,ТипТекста,Кодировка, ТаблицаВложений");
		ЗаполнитьЗначенияСвойств(СтруктураШаблонаСообщения,Выборка);
		
		ТаблицаВложений = Новый Массив;
		
		ВыборкаВложений = Выборка.ТаблицаСоответствийИменВложений.Выбрать();
		
		Пока ВыборкаВложений.Следующий() Цикл
			
			СтруктураСтроки = Новый Структура("ИмяФайла,ИдентификаторФайлаДляHTML,Картинка");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаВложений);
			ТаблицаВложений.Добавить(СтруктураСтроки);
			
		КонецЦикла;
		
		СтруктураШаблонаСообщения.ТаблицаВложений = ТаблицаВложений;
		
	КонецЕсли; 
	
	Возврат СтруктураШаблонаСообщения;
	
Конецфункции 

&НаСервере
// Процедура добавляет текст шаблона сообщения.
//
Процедура ДобавитьТекстШаблонаСообщения(Письмо, Знач ШаблонСообщения)
	
	Если ШаблонСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ШаблонСообщения.ТипТекста = Перечисления.бит_ТипыТекстовЭлектронныхПисем.HTML И ШаблонСообщения.ТекстHTML = "" Тогда
		Возврат;
		
	КонецЕсли;
	
	ОбъектПисьмо = Письмо.ПолучитьОбъект();
	
	ОбъектПисьмо.Текст     = ШаблонСообщения.Текст;
	ОбъектПисьмо.ТекстHTML = ШаблонСообщения.ТекстHTML;
	ОбъектПисьмо.ТипТекста = ШаблонСообщения.ТипТекста;
	ОбъектПисьмо.Кодировка = ШаблонСообщения.Кодировка;
	
	ОбъектПисьмо.Записать();
	
	Если ШаблонСообщения.ТипТекста = Перечисления.бит_ТипыТекстовЭлектронныхПисем.HTML Тогда
		
		Для каждого Вложение Из ШаблонСообщения.ТаблицаВложений Цикл
			
			ДвоичныеДанныеКартинки = Вложение.Картинка.Получить();
			АдресКартинкиВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
			ПрисоединенныйФайл = бит_УправлениеЭлектроннойПочтойСервер.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
			Письмо,
			АдресКартинкиВоВременномХранилище,
			"_" + СтрЗаменить(Вложение.ИдентификаторФайлаДляHTML, "-", "_"),
			ДвоичныеДанныеКартинки.Размер());
			
			Если ПрисоединенныйФайл <> Неопределено Тогда
				ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
				ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = Вложение.ИдентификаторФайлаДляHTML;
				ПрисоединенныйФайлОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ПриИзмененииПериода()
	
	// Обновляем представление периода на форме.
	ПредставлениеПериодаРегистрации = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"),
	НачалоМесяца(Объект.Период), 
	КонецМесяца(Объект.Период));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Период = КонецМесяца(РезультатВыбора.КонецПериода);
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗависимыеВОсновнойСписокНаСервере(Значение)

	тмпСписокЛС = Объект.СписокЛС.Выгрузить();

	ДобавитьЗависимыеВОсновнойСписок(Значение, тмпСписокЛС);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере(Результат)
	
	Результат.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНаСервере(ТабличныйДокумент)
	
	Результат.Вывести(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура РСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПолучательПлатежа) Тогда
			ТекстСообщения = НСтр("ru = 'Укажите получателя платежа!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ПолучательПлатежа");
			Возврат;
		КонецЕсли;
		ОтборВладелец = (Новый Структура("Владелец", Объект.ПолучательПлатежа));
	Иначе
		ОтборВладелец = (Новый Структура("Владелец", Объект.Организация));
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("РСОкончаниеВыбора", ЭтотОбъект);	
	ФормаВыбор = ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора"
								,Новый Структура("Отбор", ОтборВладелец), ЭтаФорма,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура РСОкончаниеВыбора(РезультатВыбораРС, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбораРС) Тогда
		Объект.РС = РезультатВыбораРС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаОбъекта(Объект, Реквизит)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, Реквизит);	
	
КонецФункции

&НаКлиенте
Процедура МакетКвОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	Если (ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32"))
		И НЕ (ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32"))Тогда
		
		Объект.РС = ПолучательПлатежаПриИзмененииНаСервере(Объект.ПолучательПлатежа);
		
	ИначеЕсли НЕ (ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")) 
		И (ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК43")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ")
		ИЛИ ПолучитьЗначениеРеквизитаОбъекта(Объект.МакетКВ, "ОсновнойВариант") = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")
		ИЛИ Объект.МакетКВ = ПредопределенноеЗначение("Справочник.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32")) Тогда
		
		ОрганизацияПриИзмененииНаСервере();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеНастройкиQR(Команда)
	
	ЗаполнитьТаблицаРеквизитовQRКода();
	
КонецПроцедуры

#КонецОбласти