
#Область ПрограммныйИнтерфейс


// Разбивает входящую строку "Строка1" на две по ограничению длины "МаксДлинаСтроки1".
// Максимальную длину для областей табличных документов рекомендуется выбрать по
// формулу количество помещающихся букв обычной ширины, умноженное на коэффициент 0,92.
//
// Параметры:                                          
//  МаксДлинаСтроки1 - Максимальная ожидаемая длина первой строки;
//  Строка1          - Строка, требующая разбивки;
//  Строка2          - Вторая строка (заполняется в процедуре после разбивки).
//  

Процедура РазбитьСтроку(МаксДлинаСтроки1, Строка1, Строка2 = "") Экспорт
	
	ДлинаСтроки1 = СтрДлина(Строка1);
	Если ДлинаСтроки1 < МаксДлинаСтроки1 Тогда
		
		Строка2 = "";
		
	Иначе
		// Разбиваем строку на две подстроки, таким образом чтобы первая строка была не более МаксДлинаСтроки1
		// Для этого ищем очередной пробел и проверяем длину строк в предположении, что перенос будет выполнен по найденной позиции.
		ИсходнаяСтрока	= Строка1;
		Строка2			= Строка1;
		ПозицияПоиска	= СтрНайти(Строка2," ")+1;
		
		// Если найден очередной пробел и длина первой строки после операции будет менее 92 символов, то выполняем еще одну итерацию.
		Пока ПозицияПоиска > 1 И ДлинаСтроки1 - СтрДлина(Строка2) + ПозицияПоиска < МаксДлинаСтроки1 Цикл
			
			Строка2			= Сред(Строка2, ПозицияПоиска);
			ПозицияПоиска	= СтрНайти(Строка2," ")+1;
			
		КонецЦикла; 
		
		Строка1 = Лев(ИсходнаяСтрока, ДлинаСтроки1 - СтрДлина(Строка2));
		
	КонецЕсли;	
	
КонецПроцедуры

// Разбирает полное имя объекта.
Функция РазобратьПолноеИмяОбъекта(ИмяОбъектаПолное) Экспорт 

	РезСтр = Новый Структура("ИмяКоллекции,ИмяКласса,ИмяОбъекта","","","");
	
	ПозицияТочки = Найти(ИмяОбъектаПолное,".");
	
	Если ПозицияТочки >0 Тогда
			
		
	  РезСтр.ИмяКласса        = Лев(ИмяОбъектаПолное,ПозицияТочки-1);
	  РезСтр.ИмяОбъекта       = Сред(ИмяОбъектаПолное,ПозицияТочки+1);
	  
	  КлассыКоллекции = СоответствиеИменКлассовКоллекций();
	  ИмяКоллекции = КлассыКоллекции[РезСтр.ИмяКласса];
	  
	  Если ТипЗнч(ИмяКоллекции) = Тип("Строка") Тогда
	  
	  	  РезСтр.ИмяКоллекции = ИмяКоллекции;
	  
	  КонецЕсли; 
	  
	КонецЕсли; 

	Возврат РезСтр;
	
КонецФункции // РазобратьПолноеИмяОбъекта()

// Устанавливает соответствие имен классов объекта.
Функция СоответствиеИменКлассовКоллекций(Режим="КлассКоллекция") Экспорт 

	Пары = Новый Массив;

	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "Справочник", "Справочники");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "Документ", "Документы");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "ЖурналДокументов", "ЖурналыДокументов");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "Перечисление", "Перечисления");
	Пары.Добавить(Пара);

	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "Отчет", "Отчеты");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "Обработка", "Обработки");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "ПланВидовХарактеристик", "ПланыВидовХарактеристик");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "ПланСчетов", "ПланыСчетов");
	Пары.Добавить(Пара);	
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "ПланВидовРасчета", "ПланыВидовРасчета");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "РегистрСведений", "РегистрыСведений");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "РегистрНакопления", "РегистрыНакопления");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "РегистрБухгалтерии", "РегистрыБухгалтерии");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "РегистрРасчета", "РегистрыРасчета");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "БизнесПроцесс", "БизнесПроцессы");
	Пары.Добавить(Пара);
	
	Пара = Новый Структура("ИмяКласса, ИмяКоллекции", "Задача", "Задачи");
	Пары.Добавить(Пара);
	
	Имена = Новый Соответствие;
	
	Для каждого пара Из Пары Цикл
		
		Если ВРег(Режим) = ВРег("КоллекцияКласс") Тогда
			
			Имена.Вставить(пара.ИмяКоллекции,пара.ИмяКласса);
			
		Иначе	
			
			Имена.Вставить(пара.ИмяКласса,пара.ИмяКоллекции);
			
		КонецЕсли; 	
		
	КонецЦикла; 

	Возврат Имена;
	
КонецФункции // СоответствиеИменКлассовКоллекций()

// Процедура заполняет представления элементов всех коллекций построителя отчета на.
//  Основании соответствия имен и представлений переданных в параметре.
//
// Параметры:
//  СтруктураСоответствияИмен - Структура, ключ - имя поля, значение - представление поля.
//  ПостроительОтчета         - ПостроительОтчета.
//
//  Возвращаемое значение:
//   НЕТ.
//
Процедура ЗаполнитьПредставленияПолей(СтруктураСоответствияИмен, ПостроительОтчета) Экспорт

	СтруктураКоллекцийПостроителяОтчета = Новый Структура("ДоступныеПоля, ВыбранныеПоля, ИзмеренияКолонки, ИзмеренияСтроки, Отбор, Порядок");
	
	Для каждого ЭлементСтруктуры Из СтруктураКоллекцийПостроителяОтчета Цикл
		Для Значение = 0 По ПостроительОтчета[ЭлементСтруктуры.Ключ].Количество() - 1 Цикл
			Если ПустаяСтрока(ПостроительОтчета[ЭлементСтруктуры.Ключ][Значение].Имя) Тогда
				Продолжить;
			КонецЕсли;
			Если СтруктураСоответствияИмен.Свойство(ПостроительОтчета[ЭлементСтруктуры.Ключ][Значение].Имя) Тогда
				ПостроительОтчета[ЭлементСтруктуры.Ключ][Значение].Представление = СтруктураСоответствияИмен[ПостроительОтчета[ЭлементСтруктуры.Ключ][Значение].Имя];
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьПредставленияПолей()
	
// Копирует элементы из одной коллекции в другую.
// 
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ПроверятьДоступность = Ложь, ОчищатьПриемник = Истина) Экспорт
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ПроверятьДоступность Тогда
			
			Если ТипЗнч(ПриемникЗначения) = Тип("ОтборКомпоновкиДанных") Тогда
				
				ДоступноеПоле = ПриемникЗначения.ДоступныеПоляОтбора.НайтиПоле(ЭлементИсточник.ЛевоеЗначение);
				
				Если ДоступноеПоле = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало.
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции.
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции.
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СкопироватьЭлементы()

// БИТ_ЖКХ
//
Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено) Экспорт
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// БИТ_ЖКХ 28.08.2012
//
Процедура ВывестиСообщение(ТекстСообщения, Знач ТекущийОбъект = Неопределено, ТекущееПоле = "",Отказ = Ложь) Экспорт

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле  = ТекущееПоле;
	Если НЕ ТекущийОбъект = Неопределено Тогда
		Сообщение.УстановитьДанные(ТекущийОбъект);
	КонецЕсли;
	Сообщение.Сообщить();
	Отказ = Истина;

КонецПроцедуры

// Создает копию значения типа Массив.
//
// Параметры:
//  МассивИсточник – Массив - массив, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Массив - копия исходного массива.
//
Функция СкопироватьМассив(МассивИсточник) Экспорт
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(СкопироватьРекурсивно(Элемент));
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

// Создает копию экземпляра указанного объекта.
//
// Параметры:
//  Источник - Произвольный - объект, который необходимо скопировать.
//
// Возвращаемое значение:
//  Произвольный - копия объекта, переданного в параметре Источник.
//
// Примечание:
//  Функцию нельзя использовать для объектных типов (СправочникОбъект, ДокументОбъект и т.п.).
Функция СкопироватьРекурсивно(Источник) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("Структура") Тогда
		Приемник = СкопироватьСтруктуру(Источник);
	ИначеЕсли ТипИсточника = Тип("Соответствие") Тогда
		Приемник = СкопироватьСоответствие(Источник);
	ИначеЕсли ТипИсточника = Тип("Массив") Тогда
		Приемник = СкопироватьМассив(Источник);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = СкопироватьСписокЗначений(Источник);
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ИначеЕсли ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Приемник = Источник.Скопировать();
	#КонецЕсли
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

// Создает копию значения типа Структура.
//
// Параметры:
//  СтруктураИсточник – Структура – копируемая структура.
// 
// Возвращаемое значение:
//  Структура - копия исходной структуры.
//
Функция СкопироватьСтруктуру(СтруктураИсточник) Экспорт
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Создает копию значения типа Соответствие.
//
// Параметры:
//  СоответствиеИсточник – Соответствие - соответствие, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Соответствие - копия исходного соответствия.
//
Функция СкопироватьСоответствие(СоответствиеИсточник) Экспорт
	
	СоответствиеРезультат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СоответствиеРезультат;

КонецФункции

// Создает копию значения типа СписокЗначений.
//
// Параметры:
//  СписокИсточник – СписокЗначений - список значений, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  СписокЗначений - копия исходного списка значений.
//
Функция СкопироватьСписокЗначений(СписокИсточник) Экспорт
	
	СписокРезультат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(
			СкопироватьРекурсивно(ЭлементСписка.Значение), 
			ЭлементСписка.Представление, 
			ЭлементСписка.Пометка, 
			ЭлементСписка.Картинка);
	КонецЦикла;
	
	Возврат СписокРезультат;
	
КонецФункции

// БИТ_ЖКХ 06.02.2014
// Формирует текст сообщения, подставляя значения параметров в шаблоны сообщений.
//
// Параметры:
//  ВидПоля       - Строка - может принимать значения:.
//                  Поле, Колонка, Список.
//  ВидСообщения  - Строка - может принимать значения:.
//                  Заполнение, Корректность.
//  Параметр1     - Строка - имя поля.
//  Параметр2     - Строка - номер строки.
//  Параметр3     - Строка - имя списка.
//  Параметр4     - Строка - текст сообщения о некорректности заполнения.
//
// Возвращаемое значение:
//   Строка - текст сообщения.
//
Функция ПолучитьТекстСообщения(ВидПоля = "Поле", ВидСообщения = "Заполнение",
	Параметр1 = "", Параметр2 = "",	Параметр3 = "", Параметр4 = "") Экспорт
	
	ТекстСообщения = "";
	
	Если ВРег(ВидПоля) = "ПОЛЕ" Тогда
		Если ВРег(ВидСообщения) = "ЗАПОЛНЕНИЕ" Тогда
			Шаблон = НСтр("ru = 'Поле ""%1"" не заполнено'");
		ИначеЕсли ВРег(ВидСообщения) = "КОРРЕКТНОСТЬ" Тогда
			Шаблон = НСтр("ru = 'Поле ""%1"" заполнено некорректно.
			|
			|%4'");
		КонецЕсли;
	ИначеЕсли ВРег(ВидПоля) = "КОЛОНКА" Тогда
		Если ВРег(ВидСообщения) = "ЗАПОЛНЕНИЕ" Тогда
			Шаблон = НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""%3""'");
		ИначеЕсли ВРег(ВидСообщения) = "КОРРЕКТНОСТЬ" Тогда
			Шаблон = НСтр("ru = 'Некорректно заполнена колонка ""%1"" в строке %2 списка ""%3"".
			|
			|%4'");
		КонецЕсли;
	ИначеЕсли ВРег(ВидПоля) = "СПИСОК" Тогда
		Если ВРег(ВидСообщения) = "ЗАПОЛНЕНИЕ" Тогда
			Шаблон = НСтр("ru = 'Не введено ни одной строки в список ""%3""'");
		ИначеЕсли ВРег(ВидСообщения) = "КОРРЕКТНОСТЬ" Тогда
			Шаблон = НСтр("ru = 'Некорректно заполнен список ""%3"".
			|
			|%4'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4);
	
КонецФункции
// БИТ_ЖКХ 06.02.2014

// Подставляет параметры строки.
Функция ПодставитьПараметрыСтроки(Знач СтрокаИсходная,
                                   Знач П1,
                                   Знач П2 = Неопределено,
                                   Знач П3 = Неопределено,
                                   Знач П4 = Неопределено,
                                   Знач П5 = Неопределено) Экспорт 
	
	СтрокаРезультат = СтрокаИсходная;
	
	СтрокаРезультат    = СтрЗаменить(СтрокаРезультат, "%1%", П1);
	
	Если П2 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%2%", П2);
	КонецЕсли;
	
	Если П3 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%3%", П3);
	КонецЕсли;
	
	Если П4 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%4%", П4);
	КонецЕсли;
	
	Если П5 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%5%", П5);
	КонецЕсли;
	
	Возврат СтрокаРезультат;
	
КонецФункции

// Функция создает описание типов по строковому представлению.
//
// Параметры:
//  СтрТипы - Строка.
//  Разделитель - Строка.
//  ТипПоУмолчанию - ОписаниеТипов.
//
// Возвращаемое значение:
//  Описание – ОписаниеТипов.
//
Функция ПолучитьОписаниеИзСтроки(СтрТипы, Разделитель = "/", ТипПоУмолчанию = Неопределено ) Экспорт
	
	МассивСтрок = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(СтрТипы, Разделитель);
	
	МассивТипов = ПолучитьТипыИзСтроки(МассивСтрок, Разделитель);
	
	// Определение квалификаторов при необходимости.
	КвалификаторыЧисла  = Неопределено;
	КвалификаторыСтроки = Неопределено;
	КвалификаторыДаты   = Неопределено;
	
	Для каждого СтрТип Из МассивСтрок Цикл
		
		Если Найти(СтрТип,"Строка(") > 0 Тогда
			
		   // Определение квалификаторов строки.	
		   
			ПозНач = Найти(СтрТип,"(");
			ПозКон = Найти(СтрТип,")");
			
			СтрДлина = Сред(СтрТип,ПозНач+1,ПозКон-ПозНач-1);
			
			Попытка
			
				Длина = Число(СтрДлина);
			
			Исключение
				
				Длина = 0;
				
			КонецПопытки;
			
			Если Длина > 0  Тогда
			
				КвалификаторыСтроки = Новый КвалификаторыСтроки(Длина);
			
			КонецЕсли; 
		
		ИначеЕсли Найти(СтрТип, "Дата(") > 0 Тогда
			
		    // Определение квалификаторов даты.			
			
			ПозНач = Найти(СтрТип,"(");
			ПозКон = Найти(СтрТип,")");
			
			СоставДаты = Сред(СтрТип,ПозНач+1,ПозКон-ПозНач-1);
			
			Если СоставДаты = "Дата" Тогда
				
				КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
				
			ИначеЕсли СоставДаты = "Время" Тогда
				
				КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Время);
				
			Иначе	
				
				КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
				
			КонецЕсли; 
		
		ИначеЕсли Найти(СтрТип, "Число(") > 0 Тогда
			
		    // Определение квалификаторов числа.
		
			ПозНач = Найти(СтрТип,"(");
			ПозКон = Найти(СтрТип,")");
			
			СтрПараметры = Сред(СтрТип,ПозНач+1,ПозКон-ПозНач-1);

			ПозНач = Найти(СтрПараметры,",");
			
			СтрДлина = Лев(СтрПараметры, ПозНач-1);
			СтрТочность = Сред(СтрПараметры, ПозНач+1);
			
			Попытка
			
				Длина = Число(СтрДлина);
			
			Исключение
				
				Длина = 0;
				
			КонецПопытки;
			
			Попытка
			
				Точность = Число(СтрТочность);
			
			Исключение
				
				Точность = 0;
				
			КонецПопытки;
			
			Если Длина > 0 Тогда
			
				КвалификаторыЧисла = Новый КвалификаторыЧисла(Длина, Точность);
			
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; // МассивСтрок
	
	Описание = Новый ОписаниеТипов(МассивТипов, КвалификаторыЧисла, КвалификаторыСтроки, КвалификаторыДаты);
	
	Если НЕ ЗначениеЗаполнено(Описание) И ЗначениеЗаполнено(ТипПоУмолчанию) Тогда
	
		Описание = ТипПоУмолчанию;
	
	КонецЕсли; 
	
	Возврат Описание;
	
КонецФункции // ПолучитьОписаниеИзСтроки()

// Процедура разбирает строку с разделителями и упаковывает значения в массив.
//
// Параметры:
//  ИсходнаяСтрока  – Строка.
//  Разделитель     - Строка.
//
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока,Разделитель) Экспорт
	
	РезМассив = Новый Массив;
	
	Стр = ИсходнаяСтрока;
	КоличествоРазделителей = СтрЧислоВхождений(Стр,Разделитель);
	Для Значение = 1 По КоличествоРазделителей+1 Цикл
		
		ПозицияРазделителя = Найти(Стр,Разделитель);
		Если ПозицияРазделителя >0 Тогда
			ТекущееИмя = Лев(Стр,ПозицияРазделителя-1);
			Стр = Сред(Стр,ПозицияРазделителя+1);
		Иначе
			ТекущееИмя = СокрЛП(Стр);
		КонецЕсли; 
		РезМассив.Добавить(ТекущееИмя);
		
	КонецЦикла;
	
	Возврат РезМассив;
	
КонецФункции // РазобратьСтрокуСРазделителями()

// Функция формирует массив типов по строковому представлению.
//
// Параметры:
//   СтрТипы - Строка,Массив.
//   Разделитель - Строка.
//
// Возвращаемое значение:
//  МассивТипов – Массив(Тип).
//
Функция ПолучитьТипыИзСтроки(СтрТипы, Разделитель = "/") Экспорт

	Если ТипЗнч(СтрТипы) = Тип("Массив") Тогда
		
		МассивСтрок = СтрТипы;
		
	Иначе
		
		МассивСтрок = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(СтрТипы, Разделитель);
		
	КонецЕсли; 
	
	МассивТипов = Новый Массив;
	
	Для каждого ТекСтр Из МассивСтрок Цикл
		
		ИмяТипаСтр = ТекСтр;
		
		Если Найти(ИмяТипаСтр,"Строка(")>0 Тогда
		
			ИмяТипаСтр = "Строка";
		
		КонецЕсли; 
		
		Если Найти(ИмяТипаСтр, "Число(")>0 Тогда
		
			ИмяТипаСтр = "Число";
		
		КонецЕсли; 
		
		Если Найти(ИмяТипаСтр, "Дата(")>0 Тогда
		
			ИмяТипаСтр = "Дата";
		
		КонецЕсли; 
		
		Попытка			
			
			ТекТип = Тип(ИмяТипаСтр);
			МассивТипов.Добавить(ТекТип);
		
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось создать тип ""%1%""!'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекСтр);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
	
	КонецЦикла; 

	Возврат МассивТипов;
	
КонецФункции // ПолучитьТипыИзСтроки()

// Функция формирует список возможных в системе периодичностей.
//
//
// Возвращаемое значение:
//   РезКоллекция - Соответствие,СписокЗначений.
//
Функция ПолучитьПериодичности(ТипКоллекции = "СписокЗначений") Экспорт

	Периодичность = Новый Соответствие;
	Периодичность.Вставить(0,"Период");
	Периодичность.Вставить(1,"Запись");
	Периодичность.Вставить(2,"Регистратор");
	Периодичность.Вставить(3,"Секунда");
	Периодичность.Вставить(4,"Минута");
	Периодичность.Вставить(5,"Час");
	Периодичность.Вставить(6,"День");
	Периодичность.Вставить(7,"Неделя");
	Периодичность.Вставить(8,"Декада");
	Периодичность.Вставить(9,"Месяц");
	Периодичность.Вставить(10,"Квартал");
	Периодичность.Вставить(11,"Полугодие");
	Периодичность.Вставить(12,"Год");
	Периодичность.Вставить(13,"Авто");
	
	Если ВРег(ТипКоллекции) = ВРег("СписокЗначений") Тогда
		
		РезКоллекция = Новый СписокЗначений;
		
		Для каждого КиЗ Из Периодичность Цикл
		
			РезКоллекция.Добавить(КиЗ.Ключ, КиЗ.Значение);
		
		КонецЦикла; 
		
	Иначе	
		
		РезКоллекция = Периодичность;
		
	КонецЕсли; 
	
	Возврат РезКоллекция;
	

КонецФункции // ПолучитьПериодичности()

// Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//
// Возвращаемое значение:
//  ОбщийМодуль.
//
Функция ОбщийМодуль(Имя) Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Модуль = бит_ОбщегоНазначенияСервер.СерверныйОбщийМодуль(Имя);
	#Иначе
		Модуль = бит_ОбщегоНазначенияКлиент.КлиентскийОбщийМодуль(Имя);
	#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

Процедура КомпоновкаДанныхМодульОчиститьНастройкиКомпоновкиДанных(Настройки, ОчищатьПоля = Истина, ОчищатьОтбор = Истина)
	
	Если Настройки = Неопределено или ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Параметр Из Настройки.ПараметрыДанных.Элементы Цикл
		Параметр.Значение = Неопределено;
		Параметр.Использование = ложь;
	КонецЦикла;
	
	Для каждого Параметр Из Настройки.ПараметрыВывода.Элементы Цикл
		Параметр.Использование = ложь;
	КонецЦикла;
	
	Если ОчищатьПоля Тогда
		Настройки.ПользовательскиеПоля.Элементы.Очистить();
	КонецЕсли;
	
	Если ОчищатьОтбор Тогда
		Настройки.Отбор.Элементы.Очистить();
	КонецЕсли;
	
	Настройки.Порядок.Элементы.Очистить();
	Настройки.Выбор.Элементы.Очистить();
	Настройки.Структура.Очистить();
	
КонецПроцедуры

// Копирует настройки компоновки данных
Процедура КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник, НастройкиИсточник, СкопироватьНастройкиОтбора = Истина)
	
	Если НастройкиИсточник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиПриемник) = Тип("НастройкиКомпоновкиДанных") Тогда
		Для каждого Параметр Из НастройкиИсточник.ПараметрыДанных.Элементы Цикл
			ЗначениеПараметра = НастройкиПриемник.ПараметрыДанных.НайтиЗначениеПараметра(Параметр.Параметр);
			Если ЗначениеПараметра <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЗначениеПараметра, Параметр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиПриемник, НастройкиИсточник);
		КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник.Настройки, НастройкиИсточник.Настройки);
		Возврат;
	КонецЕсли;
	
	// Копирование настроек
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		КомпоновкаДанныхМодульЗаполнитьЭлементы(НастройкиПриемник.ПараметрыДанных, НастройкиИсточник.ПараметрыДанных);
		КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.ПользовательскиеПоля, НастройкиИсточник.ПользовательскиеПоля);
		Если СкопироватьНастройкиОтбора Тогда
			КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.Отбор,         НастройкиИсточник.Отбор);
		КонецЕсли;
		КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.Порядок,       НастройкиИсточник.Порядок);
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		
		КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.ПоляГруппировки, НастройкиИсточник.ПоляГруппировки);
		КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.Отбор,           НастройкиИсточник.Отбор);
		КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.Порядок,         НастройкиИсточник.Порядок);
		ЗаполнитьЗначенияСвойств(НастройкиПриемник, НастройкиИсточник);
		
	КонецЕсли;
	
	КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.Выбор,              НастройкиИсточник.Выбор);
	КомпоновкаДанныхМодульСкопироватьЭлементы(НастройкиПриемник.УсловноеОформление, НастройкиИсточник.УсловноеОформление);
	КомпоновкаДанныхМодульЗаполнитьЭлементы(НастройкиПриемник.ПараметрыВывода,      НастройкиИсточник.ПараметрыВывода);
	
	// Копирование структуры
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Структура Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Структура.Добавить(ТипЗнч(ЭлементСтруктурыИсточник));
			КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Структура Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Структура.Добавить();
			КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ТаблицаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Строки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Строки.Добавить();
			КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Колонки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Колонки.Добавить();
			КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Серии Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Серии.Добавить();
			КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Точки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Точки.Добавить();
			КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Копирует элементы из одной коллекции в другую
Процедура КомпоновкаДанныхМодульСкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ПроверятьДоступность = Ложь, ОчищатьПриемник = Истина)
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			КомпоновкаДанныхМодульСкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			КомпоновкаДанныхМодульСкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			КомпоновкаДанныхМодульЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			КомпоновкаДанныхМодульСкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			КомпоновкаДанныхМодульСкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			КомпоновкаДанныхМодульСкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			КомпоновкаДанныхМодульСкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КомпоновкаДанныхМодульЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено)
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				КомпоновкаДанныхМодульЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьСхемуСКД(СхемаКомпоновкиДанных) Экспорт
	
	Попытка
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Исключение
		Возврат СхемаКомпоновкиДанных;
	КонецПопытки;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить();
	
	НастройкиСхемы        = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновкаДанныхМодульОчиститьНастройкиКомпоновкиДанных(НастройкиСхемы);
	
	//Переносим параметры
	Для каждого Параметр Из НастройкиКомпоновщика.ПараметрыДанных.Элементы Цикл
		ЗначениеПараметра = НастройкиСхемы.ПараметрыДанных.НайтиЗначениеПараметра(Параметр.Параметр);
		Если ЗначениеПараметра <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЗначениеПараметра, Параметр);
		Иначе
			ЗаполнитьЗначенияСвойств(НастройкиСхемы.ПараметрыДанных.Элементы.Добавить(), Параметр);
		КонецЕсли;
	КонецЦикла;
	//Переносим параметры
	
	КомпоновкаДанныхМодульСкопироватьНастройкиКомпоновкиДанных(НастройкиСхемы, НастройкиКомпоновщика);

	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

#КонецОбласти
