
#Область СлужебныеПроцедурыИФункции

// Процедура формирует и выводит отчет.
//
// Параметры:
//       ТабДок  - ЭлементФормы.
//
Процедура ЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГражданВывести(ТабДок) Экспорт
	
	// БИТ_ЖКХ 30.10.2014
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан = Новый ПостроительОтчета;	
	
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество + "" "" КАК Физлицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество + "" "",
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Дата,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо.ДатаРождения,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДатаРегистрации,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДатаСнятияСРегистрации,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|		ПО бит_СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо";
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.ЗаполнитьНастройки();
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.ТекстЗаголовка = "Журнал учета выдачи свидетельств регистрации по месту пребывания регистрации граждан";
	
	мПостроительОтчета =  ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан;
	
	ТабДок.Очистить();
	
	мПостроительОтчета.Выполнить();
	мПостроительОтчета.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	мПостроительОтчета.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	мПостроительОтчета.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	Выборка = мПостроительОтчета.Результат.Выбрать();
	Макет = ЭтотОбъект.ПолучитьМакет("Форма4");
	ЗаголовокОбласть = Макет.ПолучитьОбласть("Заголовок");
	ДеталиОбласть = Макет.ПолучитьОбласть("Детали");
	ТабДок.Вывести(ЗаголовокОбласть);
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл 
		// БИТ_ЖКХ изменения кода . Начало: 12.04.2011
		Если ЗначениеЗаполнено(Выборка.Физлицо) Тогда
			
			ДеталиОбласть.Параметры.НомерСтроки = НомерСтроки;
			ДеталиОбласть.Параметры.ФизЛицо = "" + Выборка.Физлицо + ", "+ Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy");
			ДеталиОбласть.Параметры.ДатаПоступления  = Формат(Выборка.Дата,"ДФ=dd.MM.yyyy");
			ДеталиОбласть.Параметры.ДатаРегистрации  = Формат(Выборка.ДатаРегистрации,"ДФ=dd.MM.yyyy")+" -    "+Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy");
			ДеталиОбласть.Параметры.ДокументУдостЛич = Строка(Выборка.ДокументСерия)+", "+Строка(Выборка.ДокументНомер)+", "+Строка(Выборка.ДокументКемВыдан)+", "+ Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy");
			ДеталиОбласть.Параметры.АдресМеста       = Строка(Выборка.ЛицевойСчет.Здание.ПочтовыйАдрес)+", кв."+Строка(Выборка.ЛицевойСчет.Квартира);
			
			НомерСтроки = НомерСтроки + 1;
			ТабДок.Вывести(ДеталиОбласть);
		КонецЕсли; 
		// БИТ_ЖКХ изменения кода . Конец  12.04.2011
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти