
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоваяЗапись = Ложь;
	
	НаборЗаписей.Очистить();
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Период,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СерияСправки,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.НомерСправки,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.ДатаВыдачи,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.ГруппаИнвалидности,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СрокДействияСправки
		|ИЗ
		|	РегистрСведений.бит_СведенияОбИнвалидностиПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК СведенияОбИнвалидностиФизлицСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.Ключ.ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаПроживающие") Тогда
		
		НаборЗаписей.Очистить();
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Период,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СерияСправки,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.НомерСправки,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.ДатаВыдачи,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.ГруппаИнвалидности,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СрокДействияСправки
		|ИЗ
		|	РегистрСведений.бит_СведенияОбИнвалидностиПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК СведенияОбИнвалидностиФизлицСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ЗаписьИзНабора = НаборЗаписей.Добавить();
			
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("ФизЛицо") Тогда
				
				ЗаписьИзНабора.ФизЛицо = Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо;
				
			КонецЕсли;
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("Период") Тогда
				
				ЗаписьИзНабора.Период = Параметры.ЗаполнитьИзСправочникаПроживающие.Период;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяЗапись = Истина;
		
	КонецЕсли;
	
	ЗаписьИзНабора 			= НаборЗаписей[0];
	
	ФизЛицо             = ЗаписьИзНабора.ФизЛицо;
	Период 				= ?(НЕ ЗначениеЗаполнено(ЗаписьИзНабора.Период), '19000101', ЗаписьИзНабора.Период);
	ГруппаИнвалидности  = ЗаписьИзНабора.ГруппаИнвалидности;
	ДатаВыдачи 		   	= ЗаписьИзНабора.ДатаВыдачи;
	Инвалидность  	   	= ЗаписьИзНабора.Инвалидность;
	НомерСправки		= ЗаписьИзНабора.НомерСправки;
	СерияСправки        = ЗаписьИзНабора.СерияСправки;
	СрокДействияСправки = ЗаписьИзНабора.СрокДействияСправки;
	
	ФизЛицоПриОткрытии             = ФизЛицо;
	ПериодПриОткрытии              = Период;
	ГруппаИнвалидностиПриОткрытии  = ГруппаИнвалидности;
	ДатаВыдачиПриОткрытии 		   = ДатаВыдачи;
	ИнвалидностьПриОткрытии  	   = Инвалидность;
	НомерСправкиПриОткрытии		   = НомерСправки;
	СерияСправкиПриОткрытии        = СерияСправки;
	СрокДействияСправкиПриОткрытии = СрокДействияСправки;
	
	Заголовок = Заголовок + " " + ФизЛицо.Наименование;
	
	Если ФизЛицо = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка") Тогда
		
		Элементы.История.Видимость = Ложь;
		
	КонецЕсли;
	
	Если НоваяЗапись Тогда
		
		// Выставим по умолчанию.
		ГруппаИнвалидности = "III";
		Инвалидность       = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьИзменения();
		
	Закрыть();
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "Инвалидность"), ФизЛицо);

КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", ФизЛицо);
	
	ОткрытьФорму("РегистрСведений.бит_СведенияОбИнвалидностиПроживающих.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзменения()
	
	Набор = РегистрыСведений.бит_СведенияОбИнвалидностиПроживающих.СоздатьНаборЗаписей();
	Набор.Отбор.ФизЛицо.Установить(ФизЛицо);
	Набор.Прочитать();
	
	// Если что-то поменяли тогда запишем. 
	Если ГруппаИнвалидностиПриОткрытии 	<> ГруппаИнвалидности ИЛИ 
		 ДатаВыдачиПриОткрытии 			<> ДатаВыдачи ИЛИ 
		 ИнвалидностьПриОткрытии 		<> Инвалидность ИЛИ 
		 НомерСправкиПриОткрытии 		<> НомерСправки ИЛИ 
		 СерияСправкиПриОткрытии 		<> СерияСправки ИЛИ 
		 СрокДействияСправкиПриОткрытии <> СрокДействияСправки ИЛИ 
		 ПериодПриОткрытии 				<> Период Тогда
		 
    Если Набор.Количество() = 0 Тогда
        НовыйНабор = Набор.Добавить();
        НовыйНабор.Период = ТекущаяДата();
	ИначеЕсли Набор.Количество() > 0 и Период <> ПериодПриОткрытии Тогда
        НовыйНабор = Набор.Добавить();
		
        НовыйНабор.Период = Период;
	Иначе 
		
		Для каждого Строка из Набор Цикл
			
			Если Строка.Период = Период Тогда
				
				НовыйНабор = Строка;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
		НовыйНабор.Период   		   = Период;
		НовыйНабор.ГруппаИнвалидности  = ГруппаИнвалидности;
		НовыйНабор.ДатаВыдачи   	   = ДатаВыдачи;
		НовыйНабор.Инвалидность		   = Инвалидность;
		НовыйНабор.НомерСправки		   = НомерСправки;
		НовыйНабор.СерияСправки		   = СерияСправки;
		НовыйНабор.СрокДействияСправки = СрокДействияСправки;
		
		НовыйНабор.ФизЛицо                          = ФизЛицо;
		Набор.Записать();
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти