
#Область ДействияКомандФормы

&НаКлиенте
Процедура ДействияФормыПоквартирнаяКарточкаСформировать(Команда)
	
	ДействияФормыПоквартирнаяКарточкаСформироватьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ДействияФормыПоквартирнаяКарточкаСформироватьНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
	ОтчетОбъект.ПоквартирнаяКарточкаВывести(ТабДок, ЛицевыеСчета, ВариантОтчета);		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОткрытьИзЛС") Тогда
		
		//Отчет.ЛицевойСчет = Параметры.ОткрытьИзЛС.Ссылка; 
		ЛицевыеСчета.Вставить(0, Параметры.ОткрытьИзЛС.Ссылка);
		
		ДействияФормыПоквартирнаяКарточкаСформироватьНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти