
#Область ОбщиеПеременные

// Функция получает массив непроведенных документов.
//
// Параметры:
//  МассивДокументов - Массив.
//
// Возвращаемое значение:
//  МассивНепроведенных - Массив.
// 
Функция ПолучитьМассивНепроведенныхДокументов(МассивДокументов) Экспорт 
	
	МассивНепроведенных = Новый Массив;
	ИмяДокумента 		= МассивДокументов[0].Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК Документ
	|ГДЕ
	|	Документ.Ссылка В (&МассивДокументов)
	|	И Не Документ.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаИзЗапроса.Следующий() Цикл
			МассивНепроведенных.Добавить(ВыборкаИзЗапроса.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивНепроведенных;
	
КонецФункции // ПолучитьМассивНепроведенныхДокументов()

// Функция получает проводит непроведенные документы.
//
// Параметры:
//  МассивДокументов - Массив.
//
// Возвращаемое значение:
//  МассивНепроведенных - Массив.
// 
Функция ПровестиНепроведенныеДокументы(МассивДокументов) Экспорт 
	
	МассивНепроведенных = Новый Массив;
	
	Заголовок = "Проведение документов при печати";
	
	Для Каждого ТекДокумент Из МассивДокументов Цикл
		
		ДокументОбъект   = ТекДокумент.ПолучитьОбъект();
		ДокументПроведен = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументОбъект
																		,РежимЗаписиДокумента.Проведение
																		,Заголовок
																		,"Ошибки");
		Если Не ДокументПроведен Тогда	
			МассивНепроведенных.Добавить(ТекДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивНепроведенных;
	
КонецФункции // ПровестиНепроведенныеДокументы()

#КонецОбласти

#Область ПроцедурыФормированияПечатнойФормы

// Процедура формирует печатный документ объекта.
//
// Параметры:
//  ИмяКоллекции	 - Строка. ("Справочники", "Документы"...).
//  ИмяОбъекта		 - Строка.
//  ИмяМакета	   	 - Строка.
//  МассивСсылок 	 - Массив.
//  ПараметрыПечати  - Структура. По умолчанию Неопределено.
//  ПечатныйДокумент - ТабличныйДокумент. Возвращаемый.
// 
Процедура СформироватьПечатныйДокумент(ИмяКоллекции
								   	  ,ИмяОбъекта
									  ,ИмяМакета
									  ,Ссылка
									  ,ПараметрыПечати
									  ,ПечатныйДокумент) Экспорт
	
	
КонецПроцедуры

// Процедура выводит горизонтальный разделитель страниц.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент.
//  ПервыйОбъект	  - Булево. По умолчанию ложь. Возвращаемый.
// 
Процедура ВывестиГоризонтальныйРазделительСтраниц(ТабличныйДокумент, ПервыйОбъект = Ложь) Экспорт
	
	Если Не ПервыйОбъект Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ПервыйОбъект = Ложь;
	
КонецПроцедуры // ВывестиГоризонтальныйРазделительСтраниц()

// Процедура формирует печатный документ для печати из внешней печатной формы.
//
// Параметры:
//  СтруктураОбработки - Структура.
//  ПечатныйДокумент   - ТабличныйДокумент. Возвращаемый.
//
// Возвращаемое значение:
//  ТабличныйДокумент
//
Процедура НапечататьВнешнююФорму(СтруктураОбработки, ПечатныйДокумент) Экспорт

	ДвоичныеДанные = СтруктураОбработки.СсылкаНаВнешнююОбработку.Принадлежность[СтруктураОбработки.НомерСтроки - 1].ХранилищеВнешнейОбработки.Получить();
	
	// Получим массив ссылок внешней обработки.
	МассивСсылок = ?(СтруктураОбработки.Свойство("МассивСсылок")
				    ,СтруктураОбработки.МассивСсылок
					,Новый Массив);
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	// Получить дополнительные параметры внешней обработки.
	ДополнительныеПараметры = ?(СтруктураОбработки.Свойство("ДополнительныеПараметрыОбработки")
							   ,СтруктураОбработки.ДополнительныеПараметрыОбработки
							   ,Неопределено);
	
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = СтруктураОбработки.СсылкаНаВнешнююОбработку.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	
	Попытка
		
		ДвоичныеДанные.Записать(ИмяФайла);
		
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		
		Если МассивСсылок.Количество() = 1 Тогда
			Обработка.СсылкаНаОбъект = МассивСсылок[0];
		Иначе
			Обработка.СсылкаНаОбъект = МассивСсылок;
		КонецЕсли;
		
		// Передадим внешней обработке дополнительные параметры.
		Если Не ДополнительныеПараметры = Неопределено Тогда
			
			// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение.
			Если Не Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
				Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
			КонецЕсли;
			
		КонецЕсли;
		
		ПечатныйДокумент = Обработка.Печать();
		
		УдалитьФайлы(ИмяФайла);
		
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Не удалось сформировать внешнюю печатную форму!'");
		ТекстСообщения = ТекстСообщения + " " + ОписаниеОшибки();
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры // НапечататьВнешнююФорму()

#КонецОбласти

#Область ПодключаемоеОборудование

// Функция возвращает список подключенного обрудования в справочнике ПО, по выбранной КассеККМ
//
Функция ПолучитьСписокОборудования(ТипыПО, КассаККМ) Экспорт
	
	Возврат Документы.бит_ЧекККМ.ПолучитьСписокОборудования(ТипыПО, КассаККМ);
	
КонецФункции

// БИТ_ЖКХ 11.01.2017 11:40:22 Начало правки...
Функция ПолучитьСписокОборудованияПоКассеККМ(КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_КассыККМПодключенноеОборудование.Оборудование
	|ИЗ
	|	Справочник.бит_КассыККМ.ПодключенноеОборудование КАК бит_КассыККМПодключенноеОборудование
	|ГДЕ
	|	бит_КассыККМПодключенноеОборудование.Ссылка = &КассаККМ";
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Оборудование");
	
	Возврат Результат;
	
КонецФункции
// БИТ_ЖКХ 11.01.2017 11:40:22 Конец правки.

#КонецОбласти