#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбщегоНазначения
	
// БИТ_ЖКХ 13.10.2011
//
Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено) Экспорт

	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект
												,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")
												,ПараметрОбъектКопирования);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ПервоначальноеЗаполнениеДокумента();
КонецПроцедуры

#КонецОбласти

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.НомерСправки) ИЛИ ЭтотОбъект.НомерСправки = "б/н" Тогда
		ЭтотОбъект.НомерСправки = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ЭтотОбъект.Номер, Истина, Истина);
	КонецЕсли; 
	
КонецПроцедуры
 
#КонецЕсли