
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнаяОрганизация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	
	Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Организация");
	Эл.ВидСравнения     = ?(ТипЗнч(ОсновнаяОрганизация) = Тип("СправочникСсылка.Организации"), ВидСравненияКомпоновкиДанных.Равно, ВидСравненияКомпоновкиДанных.ВСписке);
	Эл.ПравоеЗначение   = ОсновнаяОрганизация;
	Эл.Использование    = ?(ЗначениеЗаполнено(ОсновнаяОрганизация), Истина, Ложь);
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

#КонецОбласти