
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Процедура выполняет расчет итоговых значений в строке дерева данных.
//
// Параметры:
//  СтрокаДерева  – СтрокаДереваЗначений.
//
Процедура ВыполнитьПересчетВСтрокеДерева(СтрокаДерева)
	
	Если СтрокаДерева = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Итог = 0;
	
	Для каждого Колонка Из мКолонкиДерева Цикл
		
		Итог = Итог +  СтрокаДерева[Колонка.Ключ];
		
	КонецЦикла; 
	
	СтрокаДерева.Итого = Итог;
	
КонецПроцедуры

&НаКлиенте
// Вычисляет сумму по верхним (по отношению к стартовой) строкам деревам значения для указанной колонки
// Параметры:
//  СтартоваяСтрока  – СтрокаДереваЗначений.
//  ИмяКолонки       – Строка.
//
Процедура ВычислитьИтогПоВерхнимУровням(СтартоваяСтрока,ИмяКолонки)
	
	Если СтартоваяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СтрокаРодитель = СтартоваяСтрока.ПолучитьРодителя();
	
	Если СтрокаРодитель <> Неопределено Тогда
		
		Итог     = 0;
		
		ЭлементыРодителя =  СтрокаРодитель.ПолучитьЭлементы ();
		
		Для каждого СтрокаДерева Из ЭлементыРодителя Цикл
			
			Итог = Итог + СтрокаДерева[ИмяКолонки];
			
		КонецЦикла; 
		
		Если СтрокаРодитель.ЭтоГруппа Тогда
			
			СтрокаРодитель[ИмяКолонки]     = Итог;
			
			ВыполнитьПересчетВСтрокеДерева(СтрокаРодитель);
			
		КонецЕсли; 
		
		ВычислитьИтогПоВерхнимУровням(СтрокаРодитель,ИмяКолонки);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьПереноса(ПереносимыйЭлемент, Знач НовыйРодитель)
	
	Пока НЕ НовыйРодитель = Неопределено Цикл
		
		Если ПереносимыйЭлемент = НовыйРодитель Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
		НовыйРодитель = НовыйРодитель.ПолучитьРодителя();
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СкопироватьСтрокуДерева(РеквизитДерево, Приемник, Источник)
	
	Перем НоваяСтрока, ОбратныйИндекс, КолПодчиненныхСтрок;
	
	// Источник может быть уже перенесен.
	// Это происходит если выделены несколько элементов.
	// Одной и той же ветви дерева на разных уровнях иерархии.
	
	Если Источник = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если Приемник = Неопределено Тогда
		
		// Добавляем в корень.
		НоваяСтрока = РеквизитДерево.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
	
	КолПодчиненныхСтрок = Источник.ПолучитьЭлементы().Количество();
	
	Для ОбратныйИндекс = 1 По КолПодчиненныхСтрок Цикл
		
		ПодчиненнаяСтрока = Источник.ПолучитьЭлементы()
		[КолПодчиненныхСтрок - ОбратныйИндекс];
		
		СкопироватьСтрокуДерева(РеквизитДерево, НоваяСтрока, ПодчиненнаяСтрока);
		
	КонецЦикла;
	
	Если Источник.ПолучитьРодителя() = Неопределено Тогда
		
		РеквизитДерево.ПолучитьЭлементы().Удалить(Источник);
		
	Иначе
		
		Источник.ПолучитьРодителя().ПолучитьЭлементы().Удалить(Источник);
		
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		ИнициализироватьКолонки();
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		Дерево = ДокументОбъект.ХранилищеДерева.Получить();
		
		Если НЕ Дерево = Неопределено Тогда
			
			ЗаполнитьДеревоОбходом(Дерево);
			
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования")
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ИнициализироватьКолонки();
		
		ХранилищеДереваРодителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ХранилищеДерева");
		
		Дерево = ХранилищеДереваРодителя.Получить();
		
		Если НЕ Дерево = Неопределено Тогда
			
			ЗаполнитьДеревоОбходом(Дерево);
			
		КонецЕсли;
	КонецЕсли; 
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
	// БИТ ЖКХ 14.01.2020
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.Печать.
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаПечать);
	// Конец СтандартныеПодсистемы.Печать.
	Элементы.ГруппаПечать.Вид = ВидГруппыФормы.Подменю;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Объект.Здание) Тогда
			Адрес = ЗначениеРеквизитаОбъектаСервер(Объект.Здание, "ПочтовыйАдрес");
		Иначе
			Адрес = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
    УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Дерево = РеквизитФормыВЗначение("ДанныеДерева");
	
	Если НЕ Дерево.Строки.Количество() = 0 Тогда
		
		ТекущийОбъект.ХранилищеДерева = Новый ХранилищеЗначения(Дерево);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Адрес = ЗначениеРеквизитаОбъектаСервер(Объект.Здание, "ПочтовыйАдрес");
	Иначе
		Адрес = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

// Процедура - обработчик события "Нажатие" кнопки "Заполнить".
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ДанныеДерева.ПолучитьЭлементы().Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Данные будут очищены, продолжить?", РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
		
	Иначе
		
		ОбновитьДерво();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ОбновитьДерво();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляДанныеДерева

&НаКлиенте
Процедура ДанныеДереваПриИзменении(Элемент)
	
	ТекущиеДанныеДрева   = Элемент.ТекущиеДанные;
	ТекущаяЭлементДерева = Элемент.ТекущийЭлемент;
	
	Если ТекущаяЭлементДерева = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущиеДанныеДрева = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяКолонки = ТекущаяЭлементДерева.Имя;
	
	Если ИмяКолонки = "ДанныеДереваСтатьяОборотов" Тогда
		
		ЕдиницаИзмерения = ЕдиницаИзмеренияНаСервере(ТекущиеДанныеДрева.СтатьяОборотов);
		
		ТекущиеДанныеДрева.ЕдиницаИзмерения = ЕдиницаИзмерения;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияНаСервере(СтатьяОборотов)
	
	Возврат СтатьяОборотов.ЕдиницаИзмерения;
	
КонецФункции

// Процедура - обработчик события "ПриАктивизацииЯчейки" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанныеДрева   = Элемент.ТекущиеДанные;
	ТекущаяЭлементДерева = Элемент.ТекущийЭлемент;
	
	Если ТекущаяЭлементДерева = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущиеДанныеДрева = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяКолонки = ТекущаяЭлементДерева.Имя;
	
	Если ТекущиеДанныеДрева.ВыводитьВШапку Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "ВыводитьВоВсеКолонки" Тогда
			
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
			
		Иначе
			
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанныеДрева.ВыводитьВоВсеКолонки Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "ВыводитьВШапку" Тогда
			
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
			
		Иначе
			
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПроверкаПеретаскивания" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Узел нельзя переносить в узлы подчиненные ему самому, т.е. родительский узел нельзя переносить в дочерние.
	// Проверим это условие для всех выделенных элементов.
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитДерево = ЭтаФорма["ДанныеДерева"];
	
	ИДНовыйРодитель = Строка;
	
	НовыйРодитель = ?(ИДНовыйРодитель = Неопределено, Неопределено,
	РеквизитДерево.НайтиПоИдентификатору(ИДНовыйРодитель));
	
	МассивИДПереносимыхЭлементов = ПараметрыПеретаскивания.Значение;
	
	Для каждого ИДПереносимыйЭлемент из МассивИДПереносимыхЭлементов Цикл
		
		ПереносимыйЭлемент = РеквизитДерево.НайтиПоИдентификатору(
		ИДПереносимыйЭлемент);
		
		Если НЕ ПроверитьВозможностьПереноса(ПереносимыйЭлемент,
			НовыйРодитель) Тогда
			
			ПараметрыПеретаскивания.Действие=ДействиеПеретаскивания.Отмена;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДереваПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитДерево = ЭтаФорма["ДанныеДерева"];
	
	ИДПриемник = Строка;
	
	Приемник = ?(ИДПриемник = Неопределено, Неопределено,
	РеквизитДерево.НайтиПоИдентификатору(ИДПриемник));
	
	МассивИДИсточник = ПараметрыПеретаскивания.Значение;
	
	Для Каждого ИДИсточник Из МассивИДИсточник Цикл
		
		Источник = РеквизитДерево.НайтиПоИдентификатору(ИДИсточник);
		НоваяСтрока = СкопироватьСтрокуДерева(РеквизитДерево,Приемник,Источник);
		
		// Производится копирование в корень.
		// Для "красоты" развернем вновь созданную ветвь.
		
		Если Приемник = Неопределено и НоваяСтрока<>Неопределено Тогда
			
			Элементы["ДанныеДерева"].Развернуть(НоваяСтрока.ПолучитьИдентификатор(),
			Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Для "красоты" развернем ветвь-родителя.
	
	Если НЕ Приемник = Неопределено Тогда
		
		Элементы["ДанныеДерева"].Развернуть(ИДПриемник, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
КонецПроцедуры

// Процедура выполняет создание колонок в табличном поле ДанныеДерева.
//
&НаСервере
Процедура ИнициализироватьКолонки(ОчиститьРеквизиты = Ложь)
	
	Если ОчиститьРеквизиты Тогда
		
		УдалитьКолонки();
		
	КонецЕсли; 
	
	КоличествоИнтервалов = 1; // РазностьДат(Объект.ДатаНачалаПланирования, Объект.ДатаОкончанияПланирования, "Месяц")+1;.
	
	// Добавление колонок дерева.
	ДобавляемыеРеквизиты = Новый Массив;
	
	МассивТипов = Новый Массив(); 
	МассивТипов.Добавить(ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	МассивТипов.Добавить(ОбщегоНазначения.ОписаниеТипаСтрока(200)); 
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов); 
	
	ТипКолонки = ОписаниеТипов;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	мКолонкиДерева = Новый Структура;
	
	Для каждого Реквизит Из ДобавляемыеРеквизиты Цикл
		
		ПутьКДанным = "" + Элементы.ДанныеДерева.Имя + "." + Реквизит.Имя;
		
		ЭУ = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), Элементы.ДанныеДерева);
		ЭУ.ПутьКДанным = ПутьКДанным;
		
		ЭУ.Вид            = ВидПоляФормы.ПолеВвода;
		ЭУ.Видимость      = Истина;
		ЭУ.ЦветФона       = WebЦвета.Роса;
		ЭУ.Ширина         = 10;
		ЭУ.ШрифтЗаголовка = Новый Шрифт("MS Shell Dlg", 8, Истина);
		
		мКолонкиДерева.Вставить(ЭУ.Имя);
		
		ЭУ.УстановитьДействие("ПриИзменении", "ДанныеДереваПериодПриИзменении");
		
	КонецЦикла; 
	
	// Доабавление итоговой колонки.
	ДобавляемыеРеквизиты.Очистить();
	
	МассивТипов = Новый Массив(); 
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов); 
	
	ТипКолонки = ОписаниеТипов;
	
	ИмяКолонки = "ВыводитьВШапку";
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, ИмяКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЕсли;
	
	МассивТипов = Новый Массив(); 
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов); 
	
	ТипКолонки = ОписаниеТипов;
	
	ИмяКолонки = "ВыводитьВоВсеКолонки";
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, ИмяКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЕсли;
	
	ТипКолонки = ОбщегоНазначения.ОписаниеТипаСтрока(200);
	
	ИмяКолонки = "Информация";
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, ИмяКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЕсли;
	
	ТипКолонки = ОбщегоНазначения.ОписаниеТипаСтрока(200);
	
	ИмяКолонки = "C_";
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, ИмяКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЕсли;
	
	ТипКолонки = ОбщегоНазначения.ОписаниеТипаСтрока(200);
	
	ИмяКолонки = "X";
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, ИмяКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЕсли;
	
	ТипКолонки = ОбщегоНазначения.ОписаниеТипаСтрока(200);
	
	ИмяКолонки = "X2";
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, ИмяКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЕсли;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого Реквизит Из ДобавляемыеРеквизиты Цикл
		
		ПутьКДанным = "" + Элементы.ДанныеДерева.Имя + "." + Реквизит.Имя;
		
		ЭУ = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), Элементы.ДанныеДерева);
		ЭУ.ПутьКДанным = ПутьКДанным;
		
		ЭУ.Вид            = ВидПоляФормы.ПолеВвода;
		
		ЭУ.Видимость      = Истина;
		
		Если ЭУ.ПутьКДанным = "ДанныеДерева.X2" Тогда
			ЭУ.Видимость      = Ложь;
		КонецЕсли;
		
		ЭУ.ЦветФона       = WebЦвета.Перламутровый;
		ЭУ.Ширина         = 10;
		ЭУ.ШрифтЗаголовка = Новый Шрифт("MS Shell Dlg", 8, Истина);
		
	КонецЦикла;
	
	НазначитьОформление();
	
	Элементы.ДанныеДерева.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры

&НаСервере
// Процедура создания условного оформления колонкам созданым автоматически.
//
Процедура НазначитьОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	// Цвет фона, ТолькоПросмотр.
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона"      , WebЦвета.Перламутровый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУсловия  = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДанныеДерева.ЭтоГруппа");
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	Для каждого ИмяПоля Из мКолонкиДерева Цикл
		
		ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля.Ключ);
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура выполняет заполнение колонок в табличном поле ДанныеДерева.
//
&НаСервере
Процедура ЗаполнитьДерево()
	
	СтруктураНастроек = Документы.бит_ФормированиеПаспортаДома.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Кодификатор");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Наименование");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Ссылка");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЕдиницаИзмерения");
	
	СтруктураНастроек.ШаблонСметы = ?(ЗначениеЗаполнено(Объект.ШаблонСметы), Объект.ШаблонСметы, Неопределено);
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "СтатьиОборотов";
	
	СтруктураРезультата = Документы.бит_ФормированиеПаспортаДома.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	Результат = СтруктураРезультата.РезультатЗапроса;
	
	КореньДерева = ДанныеДерева.ПолучитьЭлементы();
	
	КореньДерева.Очистить();
	
	ДобавитьГруппировкуВДерево(Результат, КореньДерева, ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
КонецПроцедуры

&НаСервере
// Выводит группировку в дерево значений.
// Параметры:
//  ВыборкаВерхняя - РезультатЗапроса или ВыборкаИзРезультатаЗапроса.
//  СтрокиДерева   - Коллекция строк дерева значений.
//
Процедура ДобавитьГруппировкуВДерево(ВыборкаВерхняя, СтрокаДерева, СпособОбхода)
	
	Выборка = ВыборкаВерхняя.Выбрать(СпособОбхода);
	
	Пока Выборка.Следующий() Цикл
		
		// Если в группе нет элементов, то не выводим её.
		Добавлять = Истина;
		
		Если Выборка.Ссылка.ЭтоГруппа  Тогда
			
			Добавлять = Ложь;
			ПроверитьНаличиеПодчиненныхЭлементов(Выборка,Добавлять);
			
		КонецЕсли;
		
		Если Добавлять Тогда
			
			ВыборкаНижняя = Выборка.Выбрать(СпособОбхода);
			ЭтоГруппа = ?(Выборка.Ссылка.ЭтоГруппа ИЛИ ВыборкаНижняя.Количество()>0,Истина,Ложь);
			
			ТекСтрока = СтрокаДерева.Добавить();
			ТекСтрока.СтатьяОборотов   = Выборка.Ссылка;
			ТекСтрока.ЭтоГруппа        = ЭтоГруппа;
			ТекСтрока.Кодификатор      = Выборка.Кодификатор;
			ТекСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			ТекСтрока.Идентификатор    = Новый УникальныйИдентификатор;
			
			Если Выборка.Кодификатор = "4.2.1" или Выборка.Кодификатор = "4.2.1."  
				или Выборка.Кодификатор = "4.2.2" или Выборка.Кодификатор = "4.2.2."  
				или Выборка.Кодификатор = "4.3" или Выборка.Кодификатор = "4.3."  
				
				или Выборка.Кодификатор = "5.18.5.1.1" или Выборка.Кодификатор = "5.18.5.1.1."  
				или Выборка.Кодификатор = "5.18.5.1.2" или Выборка.Кодификатор = "5.18.5.1.2."  
				или Выборка.Кодификатор = "5.18.5.1.3" или Выборка.Кодификатор = "5.18.5.1.3."  
				или Выборка.Кодификатор = "5.18.5.1.4" или Выборка.Кодификатор = "5.18.5.1.4."
				или Выборка.Кодификатор = "5.18.5.1.5" или Выборка.Кодификатор = "5.18.5.1.5."  
				или Выборка.Кодификатор = "5.18.5.1.6" или Выборка.Кодификатор = "5.18.5.1.6."  
				или Выборка.Кодификатор = "5.18.5.1.7" или Выборка.Кодификатор = "5.18.5.1.7."  
				
				или Выборка.Кодификатор = "5.18.5.2.1" или Выборка.Кодификатор = "5.18.5.2.1."  
				или Выборка.Кодификатор = "5.18.5.2.2" или Выборка.Кодификатор = "5.18.5.2.2."  
				или Выборка.Кодификатор = "5.18.5.2.3" или Выборка.Кодификатор = "5.18.5.2.3."  
				или Выборка.Кодификатор = "5.18.5.2.4" или Выборка.Кодификатор = "5.18.5.2.4."
				или Выборка.Кодификатор = "5.18.5.2.5" или Выборка.Кодификатор = "5.18.5.2.5."  
				или Выборка.Кодификатор = "5.18.5.2.6" или Выборка.Кодификатор = "5.18.5.2.6."  
				или Выборка.Кодификатор = "5.18.5.2.7" или Выборка.Кодификатор = "5.18.5.2.7." 
				
				или Выборка.Кодификатор = "5.18.5.3" или Выборка.Кодификатор = "5.18.5.3."  
				или Выборка.Кодификатор = "5.20" или Выборка.Кодификатор = "5.20."  
				
				или Выборка.Кодификатор = "07" или Выборка.Кодификатор = "07." 
				или Выборка.Кодификатор = "08" или Выборка.Кодификатор = "08." или Выборка.Кодификатор = "8" или Выборка.Кодификатор = "8."
				или Выборка.Кодификатор = "11" или Выборка.Кодификатор = "11." или Выборка.Кодификатор = "11" или Выборка.Кодификатор = "11."
				
				или Выборка.Кодификатор = "11.1.4" или Выборка.Кодификатор = "11.1.4."  
				или Выборка.Кодификатор = "11.1.6" или Выборка.Кодификатор = "11.1.6."  
				или Выборка.Кодификатор = "11.1.6.3" или Выборка.Кодификатор = "11.1.6.3." 
				
				Тогда
				
				ТекСтрока.МожноДобавить	= Истина;
				
			КонецЕсли;
			
			ТекСтрока = ТекСтрока.ПолучитьЭлементы();
			
		КонецЕсли;
		
		ДобавитьГруппировкуВДерево(Выборка, ТекСтрока, СпособОбхода);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
// Процедура проверяет наличие подчиненных элементов. Рекурсивный вызов.
//
// Параметры:
//  ВыборкаВерхняя  – ВыборкаИзРезультатаЗапроса.
//  ЕстьЭлементы    - Булево.
//
Процедура ПроверитьНаличиеПодчиненныхЭлементов(ВыборкаВерхняя,ЕстьЭлементы)
	
	Выборка = ВыборкаВерхняя.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Ссылка.ЭтоГруппа Тогда
			
			ЕстьЭлементы = Истина;
			Возврат;
			
		КонецЕсли; 
		ПроверитьНаличиеПодчиненныхЭлементов(Выборка,ЕстьЭлементы);
		Если ЕстьЭлементы Тогда
			
			Возврат;
			
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

// Процедура выполняет удаление реквизитов и элементов формы созданых программно.
//
&НаСервере
Процедура УдалитьКолонки()
	
	Если мКолонкиДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеРеквизиты = Новый Массив;
	
	МассивРеквизитов = ПолучитьРеквизиты("ДанныеДерева");
	
	Для каждого Реквизит Из МассивРеквизитов Цикл
		
		Колонка = мКолонкиДерева.Свойство(Реквизит.Имя);
		
		Если Колонка Тогда
			
			УдаляемыеРеквизиты.Добавить(Реквизит.Путь + "." +Реквизит.Имя);
			
			УдаляемыЭлемент = Элементы.Найти(Реквизит.Имя);
			
			Если НЕ УдаляемыЭлемент = Неопределено Тогда
				
				Элементы.Удалить(УдаляемыЭлемент);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	УдаляемыЭлемент = Элементы.Найти("Итого");
	
	Если НЕ УдаляемыЭлемент = Неопределено Тогда
		
		Элементы.Удалить(УдаляемыЭлемент);
		
	КонецЕсли;
	
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
КонецПроцедуры

// Процедура выполняет обновлени данных таблиц формы.
//
&НаСервере
Процедура ОбновитьДерво()
	
	КореньДерева = ДанныеДерева.ПолучитьЭлементы();
	
	КореньДерева.Очистить();
	
	ИнициализироватьКолонки(Истина);
	
	ЗаполнитьДерево();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОбходом(Дерево, Строкародитель = Неопределено)
	
	Если Строкародитель = Неопределено Тогда
		ДеревоДляЗаполнения = ДанныеДерева.ПолучитьЭлементы();
	Иначе
		ДеревоДляЗаполнения = Строкародитель.ПолучитьЭлементы();
	КонецЕсли; 
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		
		НоваяСтрока = ДеревоДляЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
		
		ЗаполнитьДеревоОбходом(СтрокаДерева, НоваяСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПаспортаДома(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Перед печатью запишите документ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли; 
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Параметры.Ключ);
	
	Результат = РезультатНаСервере(МассивОбъектов);
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ФормированиеПаспортаДома"
	,"Макет"
	,"Паспорт дома"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Функция РезультатНаСервере(МассивОбъектов)
	
	Результат = Документы.бит_ФормированиеПаспортаДома.ПечатьДокумента(МассивОбъектов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьПодгруппы(Команда)
	
	ТекущаяСтрока = Элементы.ДанныеДерева.ТекущиеДанные;
	
	Корень = ТекущаяСтрока.ПолучитьЭлементы();
	
	Если Корень.Количество() > 0 Тогда
		
		Если ЗначениеХ = 0 Тогда
			ЗначениеХ = 2 ;	
		Иначе		
			ЗначениеХ = ЗначениеХ + 1;
		КонецЕсли;
		
		ДобавитьПодгруппу = Ложь;
		ЦиклДобавленияПодстрок(Корень,ТекущаяСтрока,ДобавитьПодгруппу,Неопределено,ЗначениеХ,1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦиклДобавленияПодстрок(Корень,ТекущаяСтрока,ДобавитьПодгруппу,ТекСтрокаПодстроки,ЗначениеХ,ЗначениеХ2)
	
	Добавлена = 0;
	
	Если ДобавитьПодгруппу = Истина Тогда
		
		Для Каждого Стр из ТекСтрокаПодстроки Цикл
			
			Если Стр.Добавлена Тогда
				Добавлена = Добавлена + 1;
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе
		
		Для Каждого Стр из Корень Цикл
			
			Если Стр.Добавлена Тогда
				Добавлена = Добавлена + 1;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	НачальноеКоличествоПодстрок = Корень.Количество() - Добавлена;
	
	Если НачальноеКоличествоПодстрок = 0 тогда
		
		НачальноеКоличествоПодстрок = Корень.Количество();
		Если НачальноеКоличествоПодстрокДобавлено = 0 Тогда
			НачальноеКоличествоПодстрокДобавлено = НачальноеКоличествоПодстрок;
		КонецЕсли;	
	КонецЕсли;	
	
	Если НачальноеКоличествоПодстрокДобавлено > 0 и НачальноеКоличествоПодстрок = 0 Тогда
		Если ДобавитьПодгруппу = Ложь Тогда
			ЗначениеХ = Корень.Количество()/НачальноеКоличествоПодстрокДобавлено + 1;
		КонецЕсли;
		
		ОсталосьСтрок = НачальноеКоличествоПодстрокДобавлено;
	Иначе	
		Если ДобавитьПодгруппу = Ложь Тогда
			ЗначениеХ = Корень.Количество()/НачальноеКоличествоПодстрок + 1;
		КонецЕсли;
		
		ОсталосьСтрок = НачальноеКоличествоПодстрок;
	КонецЕсли;
	
	Для Каждого СтрокаДерева из Корень Цикл
		
		Если ДобавитьПодгруппу = Истина Тогда
			ТекСтрока = ТекСтрокаПодстроки.Добавить();
		Иначе	
			ТекСтрока = Корень.Добавить();
		КонецЕсли;
		
		ТекСтрока.СтатьяОборотов   = СтрокаДерева.СтатьяОборотов;
		ТекСтрока.ЭтоГруппа        = Ложь;
		
		СтрокаРодителя = ТекущаяСтрока;
		НетРодителя = Ложь;
		Пока НетРодителя = Ложь Цикл
			
			родитель = СтрокаРодителя.получитьродителя();
			Если НЕ родитель = Неопределено тогда
				СтрокаРодителя = родитель;
				НетРодителя = Ложь;
			Иначе	
				КорневойКодификатор =  СтрокаРодителя.Кодификатор;
				НетРодителя = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Найти(ТекущаяСтрока.Кодификатор,".") = 2 Тогда
			
			Если Прав(СтрокаДерева.Кодификатор,1) = "." Тогда
				
				Если ДобавитьПодгруппу = Истина Тогда
					
					Если Найти(СтрокаДерева.Кодификатор,"0") = 6 Тогда
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-8) + "." + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,6));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-8) + "." + "X" + Прав(СтрокаДерева.Кодификатор,6));
					Иначе
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-8) + "." + ЗначениеХ + "." + Прав(СтрокаДерева.Кодификатор,4));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-8) + "." + "X" + "." + Прав(СтрокаДерева.Кодификатор,4));
					КонецЕсли;
					
					Если Найти(ТекСтрока.Кодификатор,"..") Тогда
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,5));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "X" + Прав(СтрокаДерева.Кодификатор,5));
					КонецЕсли;
					
				Иначе	
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,3));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + "X" + Прав(СтрокаДерева.Кодификатор,3));
				КонецЕсли;
				
			Иначе
				
				Если ДобавитьПодгруппу = Истина Тогда
					
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "." + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,4));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "." + "X" + Прав(СтрокаДерева.Кодификатор,4));
					
					Если Найти(ТекСтрока.Кодификатор,"..") Тогда
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,5));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "X" + Прав(СтрокаДерева.Кодификатор,5));
					КонецЕсли;
					
				Иначе	
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + "." + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,2));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + "." + "X" + Прав(СтрокаДерева.Кодификатор,2));
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Лев(ТекущаяСтрока.Кодификатор,1) = "0" Тогда
			
			Если Прав(СтрокаДерева.Кодификатор,1) = "." Тогда
				
				Если Найти(Прав(СтрокаДерева.Кодификатор,3),"0") = 1 Тогда
					
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,2) + ЗначениеХ + "."+ Прав(СтрокаДерева.Кодификатор,2));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,2) + "X" + "."+ Прав(СтрокаДерева.Кодификатор,2));
					
				ИначеЕсли Найти(Прав(СтрокаДерева.Кодификатор,3),"0") = 2 Тогда
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,2) + ЗначениеХ + "."+ Прав(СтрокаДерева.Кодификатор,3));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,2) + "X" + "."+ Прав(СтрокаДерева.Кодификатор,3));
				Иначе
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,2) + ЗначениеХ + "."+ Прав(СтрокаДерева.Кодификатор,3));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,2) + "X" + "."+ Прав(СтрокаДерева.Кодификатор,3));
				КонецЕсли;
				
			Иначе	
				
				Если Найти(Прав(СтрокаДерева.Кодификатор,3),"0") = 1 Тогда
					
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,2) + ЗначениеХ + "."+ Прав(СтрокаДерева.Кодификатор,2));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,2) + "X" + "."+ Прав(СтрокаДерева.Кодификатор,2));
					
				ИначеЕсли Найти(Прав(СтрокаДерева.Кодификатор,3),"0") = 2 Тогда
					
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,2) + ЗначениеХ + "."+ Прав(СтрокаДерева.Кодификатор,1));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,2) + "X" + "."+ Прав(СтрокаДерева.Кодификатор,1));
				Иначе
					
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,2) + ЗначениеХ + "."+ Прав(СтрокаДерева.Кодификатор,3));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,2) + "X" + "."+ Прав(СтрокаДерева.Кодификатор,3));
					
					Если Найти(ТекСтрока.Кодификатор,"..") Тогда
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,3));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + "X" + Прав(СтрокаДерева.Кодификатор,3));
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Найти(ТекущаяСтрока.Кодификатор,".") = 3 Тогда
			
			
			Если Прав(СтрокаДерева.Кодификатор,1) = "." Тогда
				
				Если ДобавитьПодгруппу = Истина Тогда
					
					Если Найти(СтрокаДерева.Кодификатор,"0") = 6 Тогда
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-8) + "." + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,6));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-8) + "." + "X" + Прав(СтрокаДерева.Кодификатор,6));
					Иначе
						ТекСтрока.Кодификатор = Лев(ТекущаяСтрока.Кодификатор,3) + ЗначениеХ + Прав(ТекущаяСтрока.Кодификатор,3)+ ЗначениеХ2 +Прав(СтрокаДерева.Кодификатор,3);
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Лев(ТекущаяСтрока.Кодификатор,3) + "X" + Прав(ТекущаяСтрока.Кодификатор,3)+ "X" +Прав(СтрокаДерева.Кодификатор,3);
						
						Если НЕ ЗначениеХ2 = 0 Тогда
							ТекСтрока.X2 = ЗначениеХ2;
						КонецЕсли;
					КонецЕсли;
					
					Если Найти(ТекСтрока.Кодификатор,"..") Тогда
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,5));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "X" + Прав(СтрокаДерева.Кодификатор,5));
					КонецЕсли;
					
				Иначе	
					
					Если НЕ СтрокаДерева.X2 = "" Тогда 
						ТекСтрока.X2 = ЗначениеХ2 + 1;
					КонецЕсли;
					
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,3));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + "X" + Прав(СтрокаДерева.Кодификатор,3));
					
					Если ТекущаяСтрока.Кодификатор	= "11.1.4." или ТекущаяСтрока.Кодификатор	= "11.1.6." 
						или ТекущаяСтрока.Кодификатор	= "11.2.4." или ТекущаяСтрока.Кодификатор	= "11.2.6." 
						или ТекущаяСтрока.Кодификатор	= "11.3.4." или ТекущаяСтрока.Кодификатор	= "11.3.6." Тогда
							
						Если ЗначениеЗаполнено(СтрокаДерева.C_) Тогда
							ТекСтрока.C_ = СтрокаДерева.C_;
						Иначе	
							
							Если ЗначениеЗаполнено(СтрокаДерева.X) Тогда
								ТекСтрока.C_ =  СтрЗаменить(ТекСтрока.C_,"" + "." + СтрокаДерева.X + "." + "",".X.");
							Иначе	
								ТекСтрока.C_ =  СтрЗаменить(ТекСтрока.C_,"" + "." + "1" + "." + "",".X.");
								ТекСтрока.C_ =  СтрЗаменить(ТекСтрока.C_,".X.X.",".X.1.");
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
				
			Иначе
				
				Если ДобавитьПодгруппу = Истина Тогда
					
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "." + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,4));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "." + "X" + Прав(СтрокаДерева.Кодификатор,4));
					
					Если Найти(ТекСтрока.Кодификатор,"..") Тогда
						ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,5));
						ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-6) + "X" + Прав(СтрокаДерева.Кодификатор,5));
					КонецЕсли;
					
				Иначе	
					ТекСтрока.Кодификатор = Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + "." + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,2));
					ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,СтрДлина(СтрокаДерева.Кодификатор)-4) + "." + "X" + Прав(СтрокаДерева.Кодификатор,2));
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			ТекСтрока.Кодификатор      = Строка(Лев(СтрокаДерева.Кодификатор,5) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,3));
			ТекСтрока.C_ = "C_" +КорневойКодификатор+ "."+ Строка(Лев(СтрокаДерева.Кодификатор,5) + ЗначениеХ + Прав(СтрокаДерева.Кодификатор,3));
		КонецЕсли;
		
		ТекСтрока.X = ЗначениеХ;
		
		ТекСтрока.ЕдиницаИзмерения = СтрокаДерева.ЕдиницаИзмерения;
		ТекСтрока.Идентификатор    = Новый УникальныйИдентификатор;
		
		ТекСтрока.Добавлена = Истина;
		
		Подстроки = СтрокаДерева.ПолучитьЭлементы();
		
		Если  Подстроки.Количество() > 0 Тогда
			ДобавитьПодгруппу = Истина;	
			
			ТекСтрокаПодстроки = ТекСтрока.ПолучитьЭлементы();
			
			Если ТекСтрока.Кодификатор = "11."+ ЗначениеХ +".4." или ТекСтрока.Кодификатор = "11."+ ЗначениеХ +".4" 
				или ТекСтрока.Кодификатор = "11."+ ЗначениеХ +".6." или ТекСтрока.Кодификатор = "11."+ ЗначениеХ +".6" 
				или ТекСтрока.Кодификатор = "11."+ ЗначениеХ +".6.3." или ТекСтрока.Кодификатор = "11."+ ЗначениеХ +".6.3" 
				Тогда
				
				Если НЕ ТекСтрока.X2 = "" Тогда 
					ЗначениеХ2 = Число(ТекСтрока.X2)+1;  
				КонецЕсли;
				
				ТекСтрока.МожноДобавить = Истина;
				ЦиклДобавленияПодстрок(Подстроки,ТекСтрока,ДобавитьПодгруппу,ТекСтрокаПодстроки,ЗначениеХ,ЗначениеХ2);
			Иначе	
				
				ЦиклДобавленияПодстрок(Подстроки,ТекСтрока,ДобавитьПодгруппу,ТекСтрокаПодстроки,ЗначениеХ,ЗначениеХ2);
			КонецЕсли;
		
			ДобавитьПодгруппу = Ложь;	
		КонецЕсли;	
		
		ОсталосьСтрок = ОсталосьСтрок -1;
		Если ОсталосьСтрок = 0 Тогда
			
			Прервать;	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	// Выгрузка файла.
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.ОткрытьФайл(Строка(Объект.КаталогВыгрузки + "\" + Объект.ИмяФайлаВыгрузки + ".xml"), "UTF-8");
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("data");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("meta_data");
	ЗаписьXML.ЗаписатьНачалоЭлемента("year");
	
	Год = бит_ОбщегоНазначения.УбитьЛишнее(Строка(Год(Объект.Дата)));
	ЗаписьXML.ЗаписатьБезОбработки(Год); 
	ЗаписьXML.ЗаписатьКонецЭлемента(); // year.
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("month");
	ЗаписьXML.ЗаписатьБезОбработки(Строка(Месяц(Объект.Дата))); 
	ЗаписьXML.ЗаписатьКонецЭлемента(); // month.
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("inn");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // inn.
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("kpp");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // kpp.
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ogrn");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ogrn.
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("adr_code");
	ЗаписьXML.ЗаписатьБезОбработки("345 1"); 
	ЗаписьXML.ЗаписатьКонецЭлемента(); // adr_code.
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("doc_type");
	ЗаписьXML.ЗаписатьБезОбработки("2"); 
	ЗаписьXML.ЗаписатьКонецЭлемента(); // doc_type.
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // meta_data.
	
	КореньДерева = РеквизитФормыВЗначение("ДанныеДерева");
	
	НомерУровня = 0;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("C_ЭП_МКД");
	ЗаписьXML.ЗаписатьАтрибут("код","ЭП_МКД");
	ЗаписьXML.ЗаписатьАтрибут("наименование","ЭП МКД");
	ЗаписьXML.ЗаписатьАтрибут("тип","Заголовок");
	
	Для каждого Уровень0 Из КореньДерева.Строки Цикл
		
		НомерУровня = НомерУровня + 1;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("C_"+Уровень0.Кодификатор+".");
		ЗаписьXML.ЗаписатьАтрибут("код",Уровень0.Кодификатор+".");
		ЗаписьXML.ЗаписатьАтрибут("наименование",Строка(Уровень0.СтатьяОборотов));
		ЗаписьXML.ЗаписатьАтрибут("тип","Заголовок");
		
		Для каждого Уровень1 Из Уровень0.Строки Цикл
			
			Если Найти(Уровень1.Кодификатор,0) = 1 Тогда
				
				КолСимволов = СтрДлина(Уровень1.Кодификатор);
				Если Найти(Уровень1.Кодификатор,".") > 0 Тогда  
					Кодификатор = Сред(Уровень1.Кодификатор,2,КолСимволов-1);
				Иначе	
					Кодификатор = Строка(Сред(Уровень1.Кодификатор,2,КолСимволов) + ".");
				КонецЕсли;	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("C_"+Уровень0.Кодификатор+"."+Кодификатор);
			Иначе
				ЗаписьXML.ЗаписатьНачалоЭлемента("C_"+Уровень0.Кодификатор+"."+Уровень1.Кодификатор);
			КонецЕсли;	
			
			ЗаписьXML.ЗаписатьАтрибут("код",Уровень0.Кодификатор+"."+Кодификатор);
			ЗаписьXML.ЗаписатьАтрибут("наименование",Строка(Уровень1.СтатьяОборотов));
			
			Если Кодификатор = "1." ИЛИ Кодификатор = "2." Тогда
				
				ЗаписьXML.ЗаписатьАтрибут("тип","Строка");
				ЗаписьXML.ЗаписатьАтрибут("значение",Уровень1.Информация);      
				ЗаписьXML.ЗаписатьАтрибут("дата_начала",Строка(Формат(Объект.ДатаНачалаПланирования, "ДФ=dd.MM.yyyy")));
				ЗаписьXML.ЗаписатьАтрибут("дата_окончания",Строка(Формат(Объект.ДатаОкончанияПланирования, "ДФ=dd.MM.yyyy")));
				
			ИначеЕсли Кодификатор = "7." ИЛИ Кодификатор = "8." ИЛИ Кодификатор = "11." Тогда
				ЗаписьXML.ЗаписатьАтрибут("тип","Список");
				ЗаписьXML.ЗаписатьАтрибут("номер_в_списке",Кодификатор);
				ЗаписьXML.ЗаписатьАтрибут("дата_начала",Строка(Формат(Объект.ДатаНачалаПланирования, "ДФ=dd.MM.yyyy")));
				ЗаписьXML.ЗаписатьАтрибут("дата_окончания",Строка(Формат(Объект.ДатаОкончанияПланирования, "ДФ=dd.MM.yyyy")));
				
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("тип","Заголовок");
			КонецЕсли;
			
			Для каждого Уровень2 Из Уровень1.Строки Цикл
				
				Если Найти(Уровень2.Кодификатор,0) = 1 Тогда
					
					КолСимволов = СтрДлина(Уровень2.Кодификатор);
					Если Найти(Уровень2.Кодификатор,".") > 0 Тогда  
						Кодификатор = Сред(Уровень2.Кодификатор,2,КолСимволов-1);
					Иначе	
						Кодификатор = Строка(Сред(Уровень2.Кодификатор,2,КолСимволов) + ".");
					КонецЕсли;	
					
					C_ = "C_"+Уровень1.Кодификатор+"."+Кодификатор;
					
					Пока Найти(C_,"..") > 0 Цикл
						
						C_ = СтрЗаменить(C_,"..",".");
						
					КонецЦикла;	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента(C_);
					
				ИначеЕсли Найти(Уровень2.Кодификатор,0) = 3 и Прав(Уровень2.Кодификатор,1) <> "0" Тогда
					
					КолСимволов = СтрДлина(Уровень2.Кодификатор);
					Если Найти(Уровень2.Кодификатор,".") > 0 Тогда 
						
						Если Найти(Уровень2.Кодификатор,".") = 2 Тогда 
							Кодификатор = Лев(Уровень2.Кодификатор,2);
						ИначеЕсли Найти(Уровень2.Кодификатор,".") = 3 Тогда	
							Кодификатор = Лев(Уровень2.Кодификатор,3);
						КонецЕсли;	
						
						C_ = "C_"+Уровень0.Кодификатор+"."+Кодификатор+Прав(Уровень2.Кодификатор,1)+ ".";
						
						Пока Найти(C_,"..") > 0 Цикл
							
							C_ = СтрЗаменить(C_,"..",".");
							
						КонецЦикла;	
						
						ЗаписьXML.ЗаписатьНачалоЭлемента(C_);
						
					Иначе
						
						Если Найти(Уровень2.Кодификатор,".") = 2 Тогда 
							Кодификатор = Лев(Уровень2.Кодификатор,2);
						ИначеЕсли Найти(Уровень2.Кодификатор,".") = 3 Тогда	
							Кодификатор = Лев(Уровень2.Кодификатор,3);
						КонецЕсли;	
						
						C_ = "C_"+Уровень0.Кодификатор+"."+Кодификатор+Прав(Уровень2.Кодификатор,1) + ".";
						
						Пока Найти(C_,"..") > 0 Цикл
							
							C_ = СтрЗаменить(C_,"..",".");
							
						КонецЦикла;	
						
						ЗаписьXML.ЗаписатьНачалоЭлемента(C_);
						
					КонецЕсли;	
					
					код = Уровень0.Кодификатор+"."+Кодификатор+Прав(Уровень2.Кодификатор,1) + ".";
					
					Пока Найти(код,"..") > 0 Цикл
						
						код = СтрЗаменить(код,"..",".");
						
					КонецЦикла;	
					
					ЗаписьXML.ЗаписатьАтрибут("код",код);
					
				Иначе	
					
					C_ = "C_"+Уровень0.Кодификатор+"."+Уровень2.Кодификатор+".";
					
					Пока Найти(C_,"..") > 0 Цикл
						
						C_ = СтрЗаменить(C_,"..",".");
						
					КонецЦикла;	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента(C_);
					
					код = Уровень0.Кодификатор+"."+Кодификатор+Прав(Уровень2.Кодификатор,1) + ".";
					
					Пока Найти(код,"..") > 0 Цикл
						
						код =  СтрЗаменить(код,"..",".");
						
					КонецЦикла;	
					
					ЗаписьXML.ЗаписатьАтрибут("код",код);
					
				КонецЕсли;	
				
				ЗаписьXML.ЗаписатьАтрибут("наименование",Строка(Уровень2.СтатьяОборотов));
				ЗаписьXML.ЗаписатьАтрибут("тип","Строка");
				ЗаписьXML.ЗаписатьАтрибут("значение",Уровень2.Информация);      
				ЗаписьXML.ЗаписатьАтрибут("дата_начала",Строка(Формат(Объект.ДатаНачалаПланирования, "ДФ=dd.MM.yyyy")));
				ЗаписьXML.ЗаписатьАтрибут("дата_окончания",Строка(Формат(Объект.ДатаОкончанияПланирования, "ДФ=dd.MM.yyyy")));
				
				Для каждого Уровень3 Из Уровень2.Строки Цикл
					
					Если Найти(Уровень3.Кодификатор,0) = 1 Тогда
						
						КолСимволов = СтрДлина(Уровень3.Кодификатор);
						Если Найти(Уровень2.Кодификатор,".") > 0 Тогда  
							Кодификатор = Сред(Уровень3.Кодификатор,2,КолСимволов-1);
						Иначе	
							Кодификатор = Строка(Сред(Уровень3.Кодификатор,2,КолСимволов) + ".");
						КонецЕсли;	
						
						C_3 = "C_"+Уровень2.Кодификатор+"."+Кодификатор;
						
						Если Уровень3.Кодификатор <> "4.2.1." и Уровень3.Кодификатор <> "4.2.2." Тогда
							ЗаписьXML.ЗаписатьНачалоЭлемента(C_3);
						КонецЕсли;
						
					ИначеЕсли Найти(Уровень3.Кодификатор,0) = 3 и Прав(Уровень3.Кодификатор,1) <> "0" Тогда
						
						КолСимволов = СтрДлина(Уровень3.Кодификатор);
						Если Найти(Уровень3.Кодификатор,".") > 0 Тогда 
							
							Если Найти(Уровень3.Кодификатор,".") = 2 Тогда 
								Кодификатор = Лев(Уровень3.Кодификатор,2);
							ИначеЕсли Найти(Уровень3.Кодификатор,".") = 3 Тогда	
								Кодификатор = Лев(Уровень3.Кодификатор,3);
							КонецЕсли;	
							
							C_3 = "C_"+Уровень0.Кодификатор+Кодификатор+Прав(Уровень3.Кодификатор,1);
							Если Уровень3.Кодификатор <> "4.2.1." и Уровень3.Кодификатор <> "4.2.2." Тогда
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_3);
							КонецЕсли;
						Иначе
							
							Если Найти(Уровень3.Кодификатор,".") = 2 Тогда 
								Кодификатор = Лев(Уровень3.Кодификатор,2);
							ИначеЕсли Найти(Уровень3.Кодификатор,".") = 3 Тогда	
								Кодификатор = Лев(Уровень3.Кодификатор,3);
							КонецЕсли;	
							
							C_3 = "C_"+Кодификатор+Прав(Уровень3.Кодификатор,1) + ".";
							Если Уровень3.Кодификатор <> "4.2.1." и Уровень3.Кодификатор <> "4.2.2." Тогда
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_3);
							КонецЕсли;	
							
						КонецЕсли;	
						
					Иначе	
						Если Прав(Уровень3.Кодификатор,1) = "." Тогда
							
							C_3 = "C_"+Уровень0.Кодификатор+"."+Уровень3.Кодификатор;
							Если Уровень3.Кодификатор <> "4.2.1." и Уровень3.Кодификатор <> "4.2.2." Тогда
								
								Пока Найти(C_3,".0") > 0 Цикл
									
									C_3 = СтрЗаменить(C_3,".0",".");
									
								КонецЦикла;	
								
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_3);
							КонецЕсли;	
						Иначе
							C_3 = "C_"+Уровень0.Кодификатор+"."+Уровень3.Кодификатор+".";
							Если Уровень3.Кодификатор <> "4.2.1." и Уровень3.Кодификатор <> "4.2.2." Тогда
								
								Пока Найти(C_3,".0") > 0 Цикл
									
									C_3 = СтрЗаменить(C_3,".0",".");
									
								КонецЦикла;	
								
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_3);
							КонецЕсли;	
						КонецЕсли;	
						
					КонецЕсли;	
					
					Если Уровень3.Кодификатор <> "4.2.1." и Уровень3.Кодификатор <> "4.2.2." Тогда
						
						Если Прав(Уровень3.Кодификатор,1) = "." Тогда
							
							код = Уровень0.Кодификатор+"."+Уровень3.Кодификатор;
							
								Пока Найти(код,".0") > 0 Цикл
									
									код = СтрЗаменить(код,".0",".");
									
								КонецЦикла;	
							
							ЗаписьXML.ЗаписатьАтрибут("код",код);					
						Иначе	
							
							код = Уровень0.Кодификатор+"."+Уровень3.Кодификатор+".";
							
								Пока Найти(код,".0") > 0 Цикл
									
									код = СтрЗаменить(код,".0",".");
									
								КонецЦикла;	
							
							ЗаписьXML.ЗаписатьАтрибут("код",код);					
						КонецЕсли;
						
						ЗаписьXML.ЗаписатьАтрибут("наименование",Строка(Уровень3.СтатьяОборотов));
						ЗаписьXML.ЗаписатьАтрибут("тип","Строка");
						ЗаписьXML.ЗаписатьАтрибут("значение",Уровень3.Информация); 
						ЗаписьXML.ЗаписатьАтрибут("дата_начала",Строка(Формат(Объект.ДатаНачалаПланирования, "ДФ=dd.MM.yyyy")));
						ЗаписьXML.ЗаписатьАтрибут("дата_окончания",Строка(Формат(Объект.ДатаОкончанияПланирования, "ДФ=dd.MM.yyyy")));
						
					КонецЕсли;
					
					ПредX = "1";
					
					Для каждого Уровень4 Из Уровень3.Строки Цикл
						
						Если (Уровень3.Кодификатор = "4.2.1." или Уровень3.Кодификатор = "4.2.2.") и Уровень4.X <> ПредX и НЕ ПредX = "1" Тогда
							ЗаписьXML.ЗаписатьКонецЭлемента();// Список
						КонецЕсли;
						
						Если (Уровень3.Кодификатор = "4.2.1." или Уровень3.Кодификатор = "4.2.2.") и Уровень4.X <> ПредX Тогда
							
							ЗаписьXML.ЗаписатьНачалоЭлемента(C_3);
							Если Прав(Уровень3.Кодификатор,1) = "." Тогда
								ЗаписьXML.ЗаписатьАтрибут("код",Уровень0.Кодификатор+"."+Уровень3.Кодификатор);					
							Иначе	
								ЗаписьXML.ЗаписатьАтрибут("код",Уровень0.Кодификатор+"."+Уровень3.Кодификатор+".");					
							КонецЕсли;
							ЗаписьXML.ЗаписатьАтрибут("наименование",Строка(Уровень3.СтатьяОборотов));
							ЗаписьXML.ЗаписатьАтрибут("тип","Список");
							
							Если Уровень3.Строки.Количество() > 0 Тогда
								Если ЗначениеЗаполнено(Уровень4.X) или Уровень4.X = "1" Тогда 
									ЗаписьXML.ЗаписатьАтрибут("номер_в_списке",Уровень4.X);
								Иначе	
									ЗаписьXML.ЗаписатьАтрибут("номер_в_списке","1");
								КонецЕсли;
								
							КонецЕсли;
							ЗаписьXML.ЗаписатьАтрибут("дата_начала",Строка(Формат(Объект.ДатаНачалаПланирования, "ДФ=dd.MM.yyyy")));
							ЗаписьXML.ЗаписатьАтрибут("дата_окончания",Строка(Формат(Объект.ДатаОкончанияПланирования, "ДФ=dd.MM.yyyy")));
						КонецЕсли;
						
						Если Найти(Уровень4.Кодификатор,0) = 1 Тогда
							
							КолСимволов = СтрДлина(Уровень4.Кодификатор);
							Если Найти(Уровень3.Кодификатор,".") > 0 Тогда  
								Кодификатор = Сред(Уровень4.Кодификатор,2,КолСимволов-1);
							Иначе	
								Кодификатор = Строка(Сред(Уровень4.Кодификатор,2,КолСимволов) + ".");
							КонецЕсли;	
							
							Если ЗначениеЗаполнено(Уровень4.X) Тогда
								C_4 = Уровень4.C_;
							Иначе	
								C_4 = "C_"+Уровень3.Кодификатор+"."+Кодификатор;
							КонецЕсли;	
							ЗаписьXML.ЗаписатьНачалоЭлемента(C_4);
							
						ИначеЕсли Найти(Уровень4.Кодификатор,0) = 3 и Прав(Уровень4.Кодификатор,1) <> "0" Тогда
							
							КолСимволов = СтрДлина(Уровень4.Кодификатор);
							Если Найти(Уровень4.Кодификатор,".") > 0 Тогда 
								
								Если Найти(Уровень4.Кодификатор,".") = 2 Тогда 
									Кодификатор = Лев(Уровень4.Кодификатор,2);
								ИначеЕсли Найти(Уровень4.Кодификатор,".") = 3 Тогда	
									Кодификатор = Лев(Уровень4.Кодификатор,3);
								КонецЕсли;	
								
								Если ЗначениеЗаполнено(Уровень4.X) Тогда
									C_4 = Уровень4.C_;
								Иначе	
									C_4 = "C_"+Уровень0.Кодификатор+Кодификатор+Прав(Уровень4.Кодификатор,1);
								КонецЕсли;	
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_4);
								
							Иначе
								
								Если Найти(Уровень4.Кодификатор,".") = 2 Тогда 
									Кодификатор = Лев(Уровень4.Кодификатор,2);
								ИначеЕсли Найти(Уровень4.Кодификатор,".") = 3 Тогда	
									Кодификатор = Лев(Уровень4.Кодификатор,3);
								КонецЕсли;	
								
								Если ЗначениеЗаполнено(Уровень4.X) Тогда
									C_4 = Уровень4.C_;
								Иначе	
									C_4 = "C_"+Кодификатор+Прав(Уровень4.Кодификатор,1) + ".";
								КонецЕсли;	
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_4);
								
							КонецЕсли;	
							
						Иначе	
							Если Прав(Уровень4.Кодификатор,1) = "." Тогда
								
								
								Если ЗначениеЗаполнено(Уровень4.X) Тогда
									C_4 = Уровень4.C_;
								Иначе	
									C_4 = "C_"+Уровень0.Кодификатор+"."+Уровень4.Кодификатор;
								КонецЕсли;	
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_4);
								
							Иначе	
								
								Если ЗначениеЗаполнено(Уровень4.X) Тогда
									C_4 = Уровень4.C_;
								Иначе	
									C_4 = "C_"+Уровень0.Кодификатор+"."+Уровень4.Кодификатор+".";
								КонецЕсли;
								ЗаписьXML.ЗаписатьНачалоЭлемента(C_4);
								
							КонецЕсли;	
							
						КонецЕсли;	
						
						Если Прав(Уровень4.Кодификатор,1) = "." Тогда
							ЗаписьXML.ЗаписатьАтрибут("код",Уровень0.Кодификатор+"."+Уровень4.Кодификатор);					
						Иначе	
							ЗаписьXML.ЗаписатьАтрибут("код",Уровень0.Кодификатор+"."+Уровень4.Кодификатор+".");					
						КонецЕсли;	
						
						ЗаписьXML.ЗаписатьАтрибут("наименование",Строка(Уровень4.СтатьяОборотов));
						ЗаписьXML.ЗаписатьАтрибут("тип","Строка");
						ЗаписьXML.ЗаписатьАтрибут("значение",Уровень4.Информация);      
						ЗаписьXML.ЗаписатьАтрибут("дата_начала",Строка(Формат(Объект.ДатаНачалаПланирования, "ДФ=dd.MM.yyyy")));
						ЗаписьXML.ЗаписатьАтрибут("дата_окончания",Строка(Формат(Объект.ДатаОкончанияПланирования, "ДФ=dd.MM.yyyy")));
						
						ЗаписьXML.ЗаписатьКонецЭлемента(); // "C_"+Уровень4.Кодификатор+".".
						
						Если (Уровень3.Кодификатор = "4.2.1." или Уровень3.Кодификатор = "4.2.2.") Тогда
							
							СтрокиКоличество = Уровень3.Строки.Количество(); 
							ИндексТекСтроки = Уровень3.Строки.Индекс(Уровень4);
							
							Если ИндексТекСтроки = СтрокиКоличество-1 Тогда
								ЗаписьXML.ЗаписатьКонецЭлемента(); // Список.
							КонецЕсли;	
						КонецЕсли;
						
						ПредX = Уровень4.X;
						
					КонецЦикла;
					
					Если Уровень3.Кодификатор <> "4.2.1." и Уровень3.Кодификатор <> "4.2.2." Тогда
						ЗаписьXML.ЗаписатьКонецЭлемента(); // "C_"+Уровень3.Кодификатор+".".
					КонецЕсли;
					
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента(); // "C_"+Уровень2.Кодификатор+".".
				
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента(); // "C_"+Уровень1.Кодификатор+".".
			
		КонецЦикла;	
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "C_"+Уровень0.Кодификатор+".".
	КонецЦикла;	
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // C_ЭП_МКД.
	ЗаписьXML.ЗаписатьКонецЭлемента(); // data.
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог   = Объект[Элемент.Имя];
	Диалог.Заголовок = "Укажите каталог...";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя]  = Диалог.Каталог;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.КаталогВыгрузки);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, Имяреквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Имяреквизита);
	
КонецФункции

#КонецОбласти