Функция ПроверитьДоступностьРеквизитов() Экспорт
		
	ДоступностьРеквизитовЭлементаСправочника = Новый Структура;
	
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ДеревоНачислений", 				Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ТаблицаНачислений", 				Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ГруппаПредоставленныеУслуги",	Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ГруппаБиллинговыеУслуги", 		Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ГруппаЛьготы", 					Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ГруппаСписокВведенныхРазовых", 	Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ГруппаДанныеПоСчетчикам", 		Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ГруппаДанныеПоРаспределениям", 	Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("НеВестиРасчетПени", 				Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("Льготный", 						Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("СчетИзвещения", 					Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("КопияФинансовоЛицевогоСчета", 	Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("КарточкаРасчетовПоЛицевомуСчету",Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ОтчетОДвиженияхНаЛСПомесячно", 	Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("лб_ГруппаЛевобережье",		 	Истина);
	ДоступностьРеквизитовЭлементаСправочника.Вставить("ГруппаЖурналДокументов",		 	Истина);
	
	
	Если РольДоступна("бит_ПаспортнаяСлужба") Тогда
		ДоступностьРеквизитовЭлементаСправочника.ДеревоНачислений 				 = Ложь;
	//+08.12.2022_Мурас Д. - Задача 9926:
	//Открыть Таблицу начислений, вкладку Предоставленные услуги для сотрудников Паспортной службы
		ДоступностьРеквизитовЭлементаСправочника.ТаблицаНачислений 				 = Истина;
		ДоступностьРеквизитовЭлементаСправочника.ГруппаПредоставленныеУслуги 	 = Истина;
	//-08.12.2022_Мурас Д.
		ДоступностьРеквизитовЭлементаСправочника.ГруппаБиллинговыеУслуги 		 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.ГруппаЛьготы 					 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.ГруппаСписокВведенныхРазовых 	 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.ГруппаДанныеПоСчетчикам 		 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.ГруппаДанныеПоРаспределениям 	 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.НеВестиРасчетПени 				 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.Льготный 			 			 = Ложь;
		//ДоступностьРеквизитовЭлементаСправочника.СчетИзвещения 					 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.КопияФинансовоЛицевогоСчета 	 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.КарточкаРасчетовПоЛицевомуСчету = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.ОтчетОДвиженияхНаЛСПомесячно 	 = Ложь;
		ДоступностьРеквизитовЭлементаСправочника.лб_ГруппаЛевобережье		 	 = Ложь;
	КонецЕсли;

	Возврат ДоступностьРеквизитовЭлементаСправочника;
	
КонецФункции

Функция ПроверитьРольПаспортнойСлужбы() Экспорт
	Если РольДоступна("бит_ПаспортнаяСлужба") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции