#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// Функция возврщает дату документа.
//
// Параметры
//	Нет.
//
// Возвращаемое значение:
//   Дата   - дата документа.
//
Функция ПолучитьДатуДокумента()  Экспорт
	
	Если ЭтоНовый() Тогда
		
		ДатаБезВремени = НачалоДня(ТекущаяДата());
		
		Если ДатаБезВремени = Дата Тогда
			
			Возврат  ТекущаяДата();
			
		Иначе
			
			Возврат Дата;
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	
КонецФункции

// Процедура удалает строки табличной части с пустым значем.
//
// Параметры
//	Нет.
//
Процедура УдалитьПустыеСтроки() Экспорт
	
	КоличествоЗаписей = Услуги.Количество();
	
	Для Ном = 1 По КоличествоЗаписей Цикл
		
		ТекСтрока = Услуги[КоличествоЗаписей - Ном];
		
		Если ТекСтрока.Сумма = 0 и ТекСтрока.СуммаПени = 0 И ТекСтрока.Начислено = 0 И ТекСтрока.Долг = 0 Тогда
			
			Услуги.Удалить(ТекСтрока);
			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

// Процедура заполняет табличную часть счетчики.
//
// Параметры
//	Нет.
//
Процедура ЗаполнениеТаблицыСчетчиков() Экспорт
	
	Счетчики.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("ТипСчетчика",Перечисления.бит_ТипСчетчика.Индивидуальный);
	ТекстУсловия = " Счетчик.ТипСчетчика = &ТипСчетчика";
	
	Если НЕ ЛицевойСчет = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда // по лицевому счету.
		Запрос.УстановитьПараметр("Объект",ЛицевойСчет);
		ТекстУсловия = ТекстУсловия + " И Объект = &Объект";
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, " + ТекстУсловия+ ") КАК бит_СчетчикиНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, ) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		НовСтрока = Счетчики.Добавить();

		НовСтрока.Счетчик             = Выборка.Счетчик;
		НовСтрока.Услуга              = Выборка.Услуга;
		НовСтрока.Разрядность         = Выборка.Разрядность;
		НовСтрока.ПредыдущиеПоказания = Выборка.ПредыдущиеПоказания;
		
	КонецЦикла; 
	
	
КонецПроцедуры

// Процедура выполняет печать макета.
//
Процедура Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ТоварныйЧек");
	
	ОпластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОпластьШапка.Параметры.Номер       = Номер;
	ОпластьШапка.Параметры.КодКассы    = КодКассы;
	ОпластьШапка.Параметры.ЛицевойСчет = ЛицевойСчет;
	ОпластьШапка.Параметры.Адрес       = Адрес;
	
	ТабДокумент.Вывести(ОпластьШапка);
	
	Для каждого Строка Из Услуги Цикл
		
		ОбластьСтрока.Параметры.НомерСтроки = Строка.НомерСтроки;
		ОбластьСтрока.Параметры.Услуга      = Строка.Услуга;
		ОбластьСтрока.Параметры.Сумма       = Строка.Сумма + Строка.СуммаПени;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	ОбластьПодвал.Параметры.Итого         = Услуги.Итог("Сумма") + Услуги.Итог("СуммаПени");
	ОбластьПодвал.Параметры.Получено      = Итого;
	ОбластьПодвал.Параметры.Сдача         = Сдача;
	ОбластьПодвал.Параметры.Ответственный = Ответственный;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура выполняет проверку пустых значений шапки документа.
//
// Параметры
//	Отказ     - Булево - флаг отмены проведения покумента,
//  Заголовок - Строка - содержит заголовок документа.
//
Процедура ПроверитьЗаполнениеШапки(Отказ, Заголовок)
	
	ОбязательныеРеквизитыШапки = "Касса, ШаблонИзвещений, ЛицевойСчет, СуммаОплаты";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	
КонецПроцедуры

// Процедура выполняет проверку реквизитов платежа.
//
Процедура ПроверкаРеквизитовПлатежа(Отказ, Заголовок)
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг Тогда
		Возврат;
	КонецЕсли; 
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Продажа  Тогда
		Итог = Услуги.Итог("Сумма") + Услуги.Итог("СуммаПени");
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.ПродажаВнешнийБиллинг Тогда
		Итог = БиллинговыеУслуги.Итог("Сумма");
	КонецЕсли; 
	
	Текст = "";
	
	Если СуммаОплаты < Итог Тогда
		
		Текст = Текст +
		"Сумма оплаты не может быть меньше распределенной по услугам суммы!";
		Отказ = Истина;
		
	КонецЕсли;
	
	Если СуммаОплаты > Итого Тогда
		
		Текст = Текст + 
		"Сумма оплаты не может быть больше полученного платежа!";
		Отказ = Истина;
		
	КонецЕсли;
	
	Остаток = СуммаОплаты - Итог;
	
	Если  Остаток = 0 Тогда
		Отказ = ложь;
	Иначе
		
		Отказ = Истина;
		Если НЕ ЗначениеЗаполнено(Текст) Тогда
			Текст = "Распределите всю сумму оплаты по услугам.";
		КонецЕсли;
		
		//Сообщение = Новый СообщениеПользователю();
		//Сообщение.Текст = "Распределите всю сумму оплаты по услугам.";
		//Сообщение.УстановитьДанные(ЭтотОбъект);
		//Сообщение.Сообщить();
		
	КонецЕсли;
	
	Если Итого >= 15000 И НЕ ЗначениеЗаполнено(Плательщик) Тогда
		
		Текст = Текст + 
		"|Платеж 15 тыс.руб. или более, укажите плательщика!";
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если Отказ Тогда
		
		Текст = Заголовок + Символы.ПС + Текст;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура выполняет проведени документа по регистрам.
//
// Параметры
//	Нет.
//
Процедура ДвижениеДокументаПоРегистрам()
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Продажа Тогда
		Для каждого Строка Из Услуги Цикл
			
			Если Строка.Сумма <> 0 ИЛИ Строка.СуммаПени <> 0 Тогда
				
				Движение = Движения.бит_НачисленияКасс.Добавить();
				
				Движение.Период             = Дата;
				Движение.ЛицевойСчет        = ЛицевойСчет;
				Движение.КассаККМ           = Касса;
				Движение.ШаблонИзвещений    = ШаблонИзвещений;
				Движение.Услуга             = Строка.Услуга;
				
				Движение.СуммаОплаты = ?(ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат, -Строка.Сумма    , Строка.Сумма);
				Движение.СуммаПени   = ?(ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат, -Строка.СуммаПени, Строка.СуммаПени);
				
			КонецЕсли; 
			
		КонецЦикла;
	Иначе
		Для каждого Строка Из БиллинговыеУслуги Цикл
			
			Если Строка.Сумма <> 0 Тогда
				
				Движение = Движения.бит_НачисленияКасс.Добавить();
				
				Движение.Период             = Дата;
				Движение.ЛицевойСчет        = ЛицевойСчет;
				Движение.КассаККМ           = Касса;
				Движение.ШаблонИзвещений    = ШаблонИзвещений;
				Движение.Услуга             = Строка.Услуга;
				
				Движение.СуммаОплаты = ?(ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг, -Строка.Сумма    , Строка.Сумма);
				
			КонецЕсли; 
			
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

// Функция считает сумму, оплаченную наличными.
//
// Возвращаемое значение:
//  Число - сумма, оплаченная наличными.
//
Функция ПолучитьСуммуНаличнойОплаты() Экспорт
	
	СуммаНаличнойОплаты = СуммаОплаты;
	
	Возврат СуммаНаличнойОплаты;
	
КонецФункции

// Функция считает сумму, оплаченную безналичными.
//
// Возвращаемое значение:
//  Число - сумма, оплаченная наличными.
//
Функция ПолучитьСуммуБезналичнойОплаты() Экспорт
	
	СуммаБезналичнойОплаты = 0;
	
	Возврат СуммаБезналичнойОплаты;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = "Запись документа: " + СокрЛП(Ссылка);
	
	ПроверитьЗаполнениеШапки(Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = "Проведение документа: " + СокрЛП(Ссылка);
	
	ПроверитьЗаполнениеШапки(Отказ, Заголовок);
	
	ПроверкаРеквизитовПлатежа(Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		
		ДвижениеДокументаПоРегистрам();
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = "Запись документа: " + СокрЛП(Ссылка);
	
	Если ЭтоНовый() Тогда
		
		ДатаБезВремени = НачалоДня(ТекущаяДата());
		
		Если ДатаБезВремени = Дата Тогда
			
			Дата = ТекущаяДата();
			
		КонецЕсли;		
		
	КонецЕсли;
	
	ПроверкаРеквизитовПлатежа(Отказ, Заголовок);
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если ЭтотОбъект.ЧекПробитНаККМ 
		И ЭтотОбъект.ПометкаУдаления
		И НЕ РольДоступна("бит_ПраваНаУдалениеЧеков") Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Чек пробит на кассе. Установка пометки на удаление невозможна.'");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ЧекПробитНаККМ = Ложь;
	ВидОперации    = Перечисления.бит_ВидыОперацийЧекККМ.Продажа;		
	КодПачки       = "" + Касса.КодКассы + "" + Формат(День(Дата), "ЧЦ=2; ЧВН=") + "" + Формат(Месяц(Дата), "ЧЦ=2; ЧВН=");
	КодКассы       = Касса.КодКассы;
	Организация    = Касса.Владелец;
	
КонецПроцедуры

//27.12.2018

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
  ПараметрыЖКХ = Новый Структура;
  ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"								, Ложь);
  ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"						, Ложь);
  ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"								, Ложь);
  ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"							, Ложь);
  ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика"	, Ложь);
  ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
  ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты"							, Ложь);
  ПараметрыЖКХ.Вставить("ВариантРасчетаНДС"										, Ложь);
	
  бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(ЭтотОбъект.Дата),  ЭтотОбъект.Организация, ПараметрыЖКХ);	
  
  если ПараметрыЖКХ.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.ДокументБезНДС тогда
	  
    МассивНепроверяемыхРеквизитов = Новый Массив();
    МассивНепроверяемыхРеквизитов.Добавить("Услуги.СтавкаНДС"); 
    УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
  конецесли;	
КонецПроцедуры


Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    // перед удалением реквизита из массива необходимо проверить, что он там есть
    // (не был удален ранее платформой или в коде).
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры


#КонецОбласти

#КонецЕсли