#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// Распределение оплаты по поставщикам.
//
// Параметры:
//  ЛицевыеСчета - таблица значений.
//
Процедура РаспределениеОплаты(ЛицевыеСчета)Экспорт 
	
	СтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Организация,КонецМесяца(Дата));	
	СписокЛС.Очистить();
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.ЛицевойСчет,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик
	|ПОМЕСТИТЬ СведенияОБиллинговыхУслугах
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(&Момент, Организация = &Организация) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|ГДЕ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчета.ЛицевойСчет,
	|	ЛицевыеСчета.Услуга,
	|	ЛицевыеСчета.Сумма
	|ПОМЕСТИТЬ ЛС
	|ИЗ
	|	&ЛицевыеСчета КАК ЛицевыеСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛС.ЛицевойСчет,
	|	ЛС.Услуга,
	|	ЛС.Сумма,
	|	СведенияОБиллинговыхУслугах.Поставщик
	|ПОМЕСТИТЬ ЛицевыеСчета
	|ИЗ
	|	ЛС КАК ЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СведенияОБиллинговыхУслугах КАК СведенияОБиллинговыхУслугах
	|		ПО ЛС.ЛицевойСчет = СведенияОБиллинговыхУслугах.ЛицевойСчет
	|			И ЛС.Услуга = СведенияОБиллинговыхУслугах.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчета.ЛицевойСчет,
	|	ЛицевыеСчета.Услуга,
	|	бит_бу_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	ЕСТЬNULL(ЛицевыеСчета.Сумма, 0) КАК Сумма,
	|	ЛицевыеСчета.Поставщик
	|ИЗ
	|	ЛицевыеСчета КАК ЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_бу_ПолучателиДенежныхСредств.СрезПоследних(&Момент, ) КАК бит_бу_ПолучателиДенежныхСредствСрезПоследних
	|		ПО ЛицевыеСчета.Услуга = бит_бу_ПолучателиДенежныхСредствСрезПоследних.Услуга";
	
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("Момент"      ,КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация" ,Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если ТипЗнч(Выборка.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") тогда  
			Строки = СписокЛС.Добавить();
			Строки.Поставщик         = Выборка.Поставщик;
			Строки.Услуга = Выборка.Услуга;
			
			Строки.СчетАбонента =  СтруктураСчетовЖКХ.СчетСторПКУ;
			СтрокаСубконта      = Строки.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
			Если Не СтрокаСубконта = Неопределено тогда
				Строки["Субконто"+СтрокаСубконта.НомерСтроки] = Выборка.ПолучательДенежныхСредств;
			КонецЕсли;
			СтрокаСубконта = Строки.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
			Если Не СтрокаСубконта = Неопределено тогда
				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				МассивВидовДоговоров = Новый Массив;
				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
				Если РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,
																					Выборка.ПолучательДенежныхСредств,
																					Организация,
																					МассивВидовДоговоров) Тогда  	
					Строки["Субконто"+СтрокаСубконта.НомерСтроки] = ОсновнойДоговорКонтрагента;
				КонецЕсли;
			КонецЕсли;
			
			Строки.СчетКУ = СтруктураСчетовЖКХ.СчетСторПКУОплата;
			СтрокаСубконтаКУ = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
			Если Не СтрокаСубконтаКУ = Неопределено тогда
				Строки["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Выборка.ПолучательДенежныхСредств;
			КонецЕсли;
			СтрокаСубконтаКУ = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
			Если Не СтрокаСубконтаКУ = Неопределено тогда
				ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				МассивВидовДоговоров = Новый Массив;
				МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
				Если РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,
																					Выборка.ПолучательДенежныхСредств,
																					Организация,
																					МассивВидовДоговоров) Тогда  	
					Строки["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = ОсновнойДоговорКонтрагента;
				КонецЕсли;
			КонецЕсли;
			Строки.Сумма = Выборка.Сумма;
		КонецЕсли;	 
		
	КонецЦикла;
	
	МВТ.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Организация");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура выполняет движения по регистрам.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоЛС, Отказ, Заголовок)
	
	ДатаДока = Дата;
	
	СтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(СтруктураШапкиДокумента.Организация,КонецМесяца(СтруктураШапкиДокумента.Дата));
	
	Если СтруктураСчетовЖКХ.СчетДохода = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СтруктураСчетовЖКХ.СчетДохода) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан счет дохода в настройках параметров ЖКХ.
		|Проводки по учету выручки (вознаграждение) от поступивших денежных средств, не сформированы!!!";
		Сообщение.Сообщить();
		
		СчетДохода = Неопределено;
		
	Иначе
		
		СчетДохода = СтруктураСчетовЖКХ.СчетДохода;
		
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из ТаблицаПоЛС Цикл	
		Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда  			 			
			
			Проводка = Движения.Хозрасчетный.Добавить();
			мСумма = СтрокаТЧ.Сумма;
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Содержание = "Распределение оплаты по поставщикам";
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
			Проводка.СчетКт = СтрокаТЧ.СчетКУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
			Проводка.Сумма = СтрокаТЧ.Сумма;
			
			Сумма = СтрокаТЧ.Сумма * СтрокаТЧ.Поставщик.КомиссионныйСбор;
			
			Если СчетДохода <> Неопределено И Сумма <> 0 Тогда
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Учтена выручка (вознаграждение) от поступивших денежных средств.";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетДт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтруктураСчетовЖКХ.СчетДохода;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураСчетовЖКХ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураСчетовЖКХ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураСчетовЖКХ.Субконто3);
				Проводка.Сумма = Сумма;
				
			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем СтруктураШапкиДокумента;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Подготовим структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Сумма"            ,"Сумма");
	СтруктураПолей.Вставить("Поставщик"        ,"Поставщик");
	СтруктураПолей.Вставить("Услуга"           , "Услуга");
	СтруктураПолей.Вставить("СчетАбонента"     ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"        ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"        ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"        ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"           ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"      ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"      ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"      ,"СубконтоКУ3");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокЛС", СтруктураПолей);
	ТаблицаПоЛС               = РезультатЗапросаПоУслугам.Выгрузить();
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоЛС, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТЗСписокЛС = СписокЛС.Выгрузить(,"ЛицевойСчет");
	
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_бу_ОплатаБиллинговыхУслуг") Тогда
		
		Организация       = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения;
		Дата              = ДанныеЗаполнения.Дата;
		ТаблицаЛС         = ДокументОснование.СписокУслуг.Выгрузить();
		РаспределениеОплаты(ТаблицаЛС);
		Комментарий       = "Документ введен на основании"
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли