
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТаблицыРасшифровкиВХранилище") Тогда
		
		ТаблицаРасшифровкиИзФормыЭлемента  = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыРасшифровкиВХранилище);
		ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаСчетчиков");
   
	    ЗначениеВРеквизитФормы(ТаблицаРасшифровкиИзФормыЭлемента, "ТаблицаСчетчиков");

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
