
#Область ПеременныеМодуля

Перем ПрошлыйМетаданныеСсылкиИсточника;
Перем ДвиженияРегистра;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ИдентификаторОбработки = ОбъектОбработка.Метаданные().ПолноеИмя();	
		
	ПроверятьОбновления 	= Истина;
	
	РежимЗагрузки           = мВосстановитьЗначение("РежимЗагрузки", ИдентификаторОбработки);		
	ИмяВидаРегистра         = мВосстановитьЗначение("ИмяВидаРегистра", ИдентификаторОбработки);
	ТипОбъектаСправочника   = мВосстановитьЗначение("ТипОбъектаСправочника", ИдентификаторОбработки);
	СсылкаИсточника         = мВосстановитьЗначение("СсылкаИсточника", ИдентификаторОбработки);
	РегистрДокумента    	= мВосстановитьЗначение("РегистрДокумента", ИдентификаторОбработки);
	СсылкаДокумента   		= мВосстановитьЗначение("СсылкаДокумента", ИдентификаторОбработки);
	ТабличнаяЧастьИсточника = мВосстановитьЗначение("ТабличнаяЧастьИсточника", ИдентификаторОбработки);
	ПроверятьОбновления		= мВосстановитьЗначение("ПроверятьОбновления", ИдентификаторОбработки);
	
	ОчиститьТаблицыНастроек();
	
	СписокДокументов = Элементы.ПЗ_СсылкаИсточника.СписокВыбора;	
	Для каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		СписокДокументов.Добавить(Документы[ОбъектМетаданных.Имя].ПустаяСсылка(), ОбъектМетаданных.Представление());
	КонецЦикла;
	
	Для каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		СписокДокументов.Добавить(Справочники[ОбъектМетаданных.Имя].ПустаяСсылка(), ОбъектМетаданных.Представление());
	КонецЦикла;
	СписокДокументов.СортироватьПоПредставлению();
	
	Для каждого МДСправочник Из Метаданные.Справочники Цикл
		Элементы.ТипОбъекта.СписокВыбора.Добавить(МДСправочник.Имя, МДСправочник.Синоним);
	КонецЦикла;
	                
	МДНезависимый = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый;
	Для каждого МДРегистрСведений Из Метаданные.РегистрыСведений Цикл
		Если МДРегистрСведений.РежимЗаписи = МДНезависимый Тогда
			Элементы.ИмяВидаРегистра.СписокВыбора.Добавить(МДРегистрСведений.Имя, МДРегистрСведений.Синоним);
		КонецЕсли; 
	КонецЦикла;
	
	Типы = Новый Массив;
	ВидыТипов = Новый Структура("Справочники,Документы");
	Для каждого КлючИЗначение Из ВидыТипов Цикл
		Для каждого ОбъектМетаданных Из Метаданные[КлючИЗначение.Ключ] Цикл
			Если ОбъектМетаданных.ТабличныеЧасти.Количество() Тогда
				Типы.Добавить(Тип(СтрЗаменить(ОбъектМетаданных.ПолноеИмя(),".","Ссылка.")));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Элементы.СсылкаИсточника.ОграничениеТипа = Новый ОписаниеТипов(Типы);
	
	Попытка
		СсылкаИсточника = Параметры.ОбъектыНазначения[0];
		ИдентификаторКоманды = Параметры.ИдентификаторКоманды;
		РежимЗагрузки = 1;
		
		ИмяФормыВладельца = Параметры.ИмяФормы;
		ИнформацияОВладельце = Неопределено;
		Выполнить("ИнформацияОВладельце = ДополнительныеОтчетыИОбработкиПовтИсп.ПараметрыФормыНазначаемогоОбъекта(ИмяФормыВладельца)");
		
		СсылкаРодителя  = ИнформацияОВладельце.СсылкаРодителя;
		ЭтоФормаОбъекта = ИнформацияОВладельце.ЭтоФормаОбъекта;
	    ЭтаФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ВыполняетсяЗаполнениеТЧОбъекта = Истина;
		Элементы.Переместить(Элементы.КоманднаяПанельИфостарт, Элементы.ГруппаЗагрузкаВТабличнуюЧасть);
		Элементы.КоманднаяПанельИфостарт.РастягиватьПоГоризонтали = Ложь;
	Исключение
	КонецПопытки;

	УстановитьСписокТабличныхЧастей();
		
	Инициализация();
	
	УстановитьИсточник();
	
	КоличествоСозданныхПодчиненныхНастроек = 0;
	
	Если РежимЗагрузки = 0 Тогда	
		ПолучитьПодчиненныеСправочники();			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущаяВерсия = "2.6";
	
	СисИнфо = Новый СистемнаяИнформация;
	Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.3" Тогда
		Выполнить("Элементы.СсылкаИсточника.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;");
		Выполнить("Элементы.СсылкаДокумента.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;");
		ВерсияПлатформы83 = Истина;
	КонецЕсли;
		
	Если ВыполняетсяЗаполнениеТЧОбъекта Тогда	
		Элементы.РежимЗагрузки.Видимость = Ложь;
		Элементы.СсылкаИсточника.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВосстановитьНастройкиПриОткрытии();
	
	ОбновитьДанныеТабличногоДокументаСервер();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПриОткрытии()
	
	Строка = СписокСохраненныхНастроек.НайтиСтроки(Новый Структура("Пометка", Истина));	

	Если ЗначениеЗаполнено(Строка) Тогда
		СостояниеВыполнения = мВосстановитьЗначение("Настройки:"+ Строка[0].Представление, ИдентификаторОбработки);
		ВосстановитьНастройкиИзСостоянияВыполнения(СостояниеВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
   Если ЗавершениеРаботы Тогда
        ТекстПредупреждения = НСтр("ru = 'Настройки обработки ""Загрузка данных из табличного документа"" будут потеряны.'");
		Отказ = Истина;
        Возврат;
    КонецЕсли;

	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УдаленаНастройка" Тогда
		Строки = СписокСохраненныхНастроек.НайтиСтроки(Новый Структура("Представление", Параметр));
		Для каждого строка Из Строки Цикл
			СписокСохраненныхНастроек.Удалить(Строка);	
		КонецЦикла;
	ИначеЕсли ИмяСобытия = "УстановленаНастройкаПоУмолчанию" Тогда
		Строки = СписокСохраненныхНастроек.НайтиСтроки(Новый Структура("Представление", Параметр.Представление));
		Если Строки.Количество() > 0 Тогда
			ТекущиеДанные = Строки[0];
			ТекущиеДанные.Пометка = Параметр.Пометка;	
			Если ТекущиеДанные.Пометка Тогда
				Для каждого ЭлементСписка Из СписокСохраненныхНастроек Цикл
					Если ЭлементСписка.Пометка и Не ЭлементСписка = ТекущиеДанные Тогда
						ЭлементСписка.Пометка = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	мСохранитьЗначение("РежимЗагрузки",	РежимЗагрузки, ИдентификаторОбработки);
	мСохранитьЗначение("СсылкаИсточника", СсылкаИсточника, ИдентификаторОбработки);
	мСохранитьЗначение("ТабличнаяЧастьИсточника", ТабличнаяЧастьИсточника, ИдентификаторОбработки);
	мСохранитьЗначение("ИмяВидаРегистра", ИмяВидаРегистра, ИдентификаторОбработки);
	мСохранитьЗначение("ТипОбъектаСправочника", ТипОбъектаСправочника, ИдентификаторОбработки);	
	мСохранитьЗначение("РегистрДокумента", РегистрДокумента, ИдентификаторОбработки);
	мСохранитьЗначение("СсылкаДокумента", СсылкаДокумента, ИдентификаторОбработки);
	мСохранитьЗначение("ПроверятьОбновления", ПроверятьОбновления, ИдентификаторОбработки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимЗагрузкиПриИзменении(Элемент)
	
	ТипОбъектаСправочника	= Неопределено;
	СсылкаИсточника			= Неопределено;
	ИмяВидаРегистра			= Неопределено;
	ТабличнаяЧастьИсточника	= Неопределено;
	СсылкаДокумента 		= Неопределено;
	РегистрДокумента		= Неопределено;
	
	УстановитьСписокТабличныхЧастей();
	УстановитьИсточник();
	ОчиститьСозданныеСтраницы();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	ОчиститьСозданныеСтраницы();
	УстановитьИсточник();
	УправлениеВидимостью();	
	ПолучитьПодчиненныеСправочники();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ПустаяСтрока(ТипОбъектаСправочника) Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ПолучитьФорму("Справочник."+ТипОбъектаСправочника+".ФормаСписка");
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СсылкаИсточникаПриИзменении(Элемент)
	
	ТабличнаяЧастьИсточника = "";
	УстановитьСписокТабличныхЧастей();
	Если РежимЗагрузки = 5 Тогда
		УстановитьСписокРегистров();	
	КонецЕсли;
	ОчиститьСозданныеСтраницы();		
	УстановитьИсточник();
	УправлениеВидимостью();
			
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьИсточникаПриИзменении(Элемент)
	
	ОчиститьСозданныеСтраницы();		
	УстановитьИсточник();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяВидаРегистраПриИзменении(Элемент)
	УстановитьИсточник();
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ИмяВидаРегистраОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ПустаяСтрока(ИмяВидаРегистра) Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ПолучитьФорму("РегистрСведений."+ИмяВидаРегистра+".ФормаСписка");
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СсылкаДокументаПриИзменении(Элемент)
	
	СсылкаДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СсылкаДокументаПриИзмененииНаСервере()
	
	РегистрДокумента = "";	
	Если РежимЗагрузки = 3 Тогда
		Если ПрошлыйМетаданныеСсылкиИсточника = Неопределено или СсылкаДокумента = Неопределено или Не ПрошлыйМетаданныеСсылкиИсточника = СсылкаДокумента.Метаданные() Тогда
			
			УстановитьСписокРегистров();
			УстановитьИсточник();
			ЗаполнитьВТаблицуЗначенийДвиженияРегистраДокумента();
			
		КонецЕсли;
	Иначе		
		Если ПрошлыйМетаданныеСсылкиИсточника = Неопределено или СсылкаИсточника = Неопределено или Не ПрошлыйМетаданныеСсылкиИсточника = СсылкаИсточника.Метаданные() Тогда
			
			УстановитьСписокТабличныхЧастей();
			УстановитьИсточник();
			
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗагружаемыхРеквизитов

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовОписаниеТиповНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки(СтандартнаяОбработка);
	
	Элемент.ДоступныеТипы = ТекДанные.ДоступныеТипы;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки(СтандартнаяОбработка);
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбораЗначенияПоУмолчанию = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаВыбораЗначенияПоУмолчанию", ,ЭтаФорма);
	
	ФормаВыбораЗначенияПоУмолчанию.ЗначениеПоУмолчанию = ТекДанные.ЗначениеПоУмолчанию;
	ФормаВыбораЗначенияПоУмолчанию.НастройкаЗагрузки = ТекДанные.НастройкаЗагрузки;
	
	ФормаВыбораЗначенияПоУмолчанию.Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = ТекДанные.ОписаниеТипов;	
			
	СписокВыбора = ФормаВыбораЗначенияПоУмолчанию.Элементы.НастройкаЗагрузки.СписокВыбора;	
	нСтруктура = Новый Структура("ЗагружаетсяДоОбъекта", Истина);
	ТЗ_ДопНастроек = ТаблицыНастроек.НайтиСтроки(нСтруктура); 	
	Для каждого Строка Из ТЗ_ДопНастроек Цикл
		Если ТекДанные.ОписаниеТипов.СодержитТип(Тип("СправочникСсылка."+Строка.Справочник)) Тогда
			СписокВыбора.Добавить(Строка.Значение, Строка.Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокВыбора.Количество() <> 0 Тогда
		ФормаВыбораЗначенияПоУмолчанию.Элементы.НастройкаЗагрузки.Видимость = Истина;
	Иначе
		ФормаВыбораЗначенияПоУмолчанию.Элементы.НастройкаЗагрузки.Видимость = Ложь;	
	КонецЕсли;

	ФормаВыбораЗначенияПоУмолчанию.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПредставлениеДопУсловийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки(СтандартнаяОбработка);
	
	СтандартнаяОбработка = Ложь;
	Если ТекДанные.РежимЗагрузки = "Вычислять" Тогда
		ФормаРедактированияВыражения = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаРедактированияВыражения", ,ЭтаФорма);
		
		ПолеТекстовогоДокумента = ФормаРедактированияВыражения.ПолеТекстовогоДокумента;
		ПолеТекстовогоДокумента.УстановитьТекст(ТекДанные.Выражение);
		
		ФормаРедактированияВыражения.Открыть();
	Иначе
		ДоступныеТипы	= ТекДанные.ОписаниеТипов;
		
		СписокВыбораВладельца	= ПолучитьСписокВыбора(ТекДанные.ИмяРеквизита, "СвязьПоВладельцу");
		СписокВыбораСвязейПоТипу = ПолучитьСписокВыбора(ТекДанные.ИмяРеквизита, "СвязьПоТипу");
		
		СписокВыбораИскатьПо = ПолучитьСписокИменПредставлений(ТекДанные.ОписаниеТипов);
		
		ФормаРедактированияСвязи = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаРедактированияСвязи", ,ЭтаФорма);
		ФормаРедактированияСвязи.ИспользуемыеТипы = ДоступныеТипы;
		ФормаРедактированияСвязи.ИскатьПо = ТекДанные.ИскатьПо;
		ФормаРедактированияСвязи.ИспользоватьВладельца = (СписокВыбораВладельца.Количество() > 0);
		ФормаРедактированияСвязи.ИспользоватьТипы = (СписокВыбораСвязейПоТипу.Количество() > 0);
		ФормаРедактированияСвязи.СвязьПоВладельцу = ТекДанные.СвязьПоВладельцу;
		ФормаРедактированияСвязи.СвязьПоТипу = ТекДанные.СвязьПоТипу;
			
		Сп = ФормаРедактированияСвязи.Элементы.ИскатьПо.СписокВыбора;
		Сп.Очистить();
		Для каждого ЭлСписка Из СписокВыбораИскатьПо Цикл
			Сп.Добавить(ЭлСписка.Значение, ЭлСписка.Представление);
		КонецЦикла;
		
		Сп = ФормаРедактированияСвязи.Элементы.СвязьПоВладельцу.СписокВыбора;
		Сп.Очистить();
		Для каждого ЭлСписка Из СписокВыбораВладельца Цикл
			Сп.Добавить(ЭлСписка.Значение, ЭлСписка.Представление);
		КонецЦикла;
		
		Сп = ФормаРедактированияСвязи.Элементы.СвязьПоТипу.СписокВыбора;
		Сп.Очистить();
		Для каждого ЭлСписка Из СписокВыбораСвязейПоТипу Цикл
			Сп.Добавить(ЭлСписка.Значение, ЭлСписка.Представление);
		КонецЦикла;

		ФормаРедактированияСвязи.Открыть();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПредставлениеДопУсловийОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки(СтандартнаяОбработка);
	
	ТекДанные.ПредставлениеДопУсловий = "";
	ТекДанные.ИскатьПо = "";
	ТекДанные.СвязьПоВладельцу = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимЗагрузкиПриИзменении(Элемент)
	
	ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки();
	
	Если ТекДанные.РежимЗагрузки = "Вычислять" Тогда
		ТекДанные.ПредставлениеДопУсловий = ТекДанные.Выражение;
	ИначеЕсли ТекДанные.РежимЗагрузки = "Устанавливать" Тогда
		ТекДанные.ПредставлениеДопУсловий = "";
	Иначе
		ТекДанные.ПредставлениеДопУсловий = ?(ПустаяСтрока(ТекДанные.ИскатьПо), "", "Искать по "+ТекДанные.ИскатьПо)
				+?(ПустаяСтрока(ТекДанные.СвязьПоВладельцу), "", " по владельцу "+ТекДанные.СвязьПоВладельцу);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
	
		Если ВыбранноеЗначение.Источник = "ФормаРедактированияСобытий" И ВыбранноеЗначение.Результат = Истина Тогда
			
			ПередЗаписьюОбъекта		= ВыбранноеЗначение.ПередЗаписьюОбъекта;
			ПриЗаписиОбъекта		= ВыбранноеЗначение.ПриЗаписиОбъекта;
			ПослеДобавленияСтроки	= ВыбранноеЗначение.ПослеДобавленияСтроки;
			ПослеЗаписиОбъекта		= ВыбранноеЗначение.ПослеЗаписиОбъекта;
			
		ИначеЕсли ВыбранноеЗначение.Источник = "ФормаРедактированияВыражения" И ВыбранноеЗначение.Результат = Истина Тогда
			
			ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки();
			
			ТекДанные.Выражение = ВыбранноеЗначение.Выражение;
			ТекДанные.ПредставлениеДопУсловий = ТекДанные.Выражение;
			
		ИначеЕсли ВыбранноеЗначение.Источник = "ФормаРедактированияСвязи" И ВыбранноеЗначение.Результат = Истина Тогда
			
			ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки();
			
			ТекДанные.ИскатьПо = ВыбранноеЗначение.ИскатьПо;
			ТекДанные.СвязьПоВладельцу = ВыбранноеЗначение.СвязьПоВладельцу;
			ТекДанные.СвязьПоТипу = ВыбранноеЗначение.СвязьПоТипу;
			ТекДанные.ПредставлениеДопУсловий = ?(ПустаяСтрока(ТекДанные.ИскатьПо), "", "Искать по "+ТекДанные.ИскатьПо)
			+?(ПустаяСтрока(ТекДанные.СвязьПоВладельцу), "", " по владельцу "+ТекДанные.СвязьПоВладельцу);
			
		ИначеЕсли ВыбранноеЗначение.Источник = "ФормаДобавленияДополнительнойНастройки" Тогда
			
			НаименованиеСтраницы = ДобавитьСтраницуНастроек(ВыбранноеЗначение.Значение, ВыбранноеЗначение.Представление, НЕ ВыбранноеЗначение.ЗагружаетсяДоОбъекта, ВыбранноеЗначение.ЭтоРегистр, ВыбранноеЗначение.ЗагружаетсяДоОбъекта);
			ЗаполнитьНастройкамиСозданнуюСтраницу(НаименованиеСтраницы, ВыбранноеЗначение.Значение, ВыбранноеЗначение.ЭтоРегистр, ВыбранноеЗначение.ЗагружаетсяДоОбъекта);		
			
		ИначеЕсли ВыбранноеЗначение.Источник = "ФормаНастроек" Тогда
			
			ПерваяСтрокаДанныхТабличногоДокумента = ВыбранноеЗначение.ПерваяСтрокаДанныхТабличногоДокумента;
			НеСоздаватьНовыхЭлементов = ВыбранноеЗначение.НеСоздаватьНовыхЭлементов;
			ЗамещатьСуществующиеЗаписи = ВыбранноеЗначение.ЗамещатьСуществующиеЗаписи;
			
		ИначеЕсли ВыбранноеЗначение.Источник = "ФормаСохраненияНастроек" Тогда
			
			СохранитьНастройкуВбазе(ВыбранноеЗначение.СписокНастроек.Пометка, ВыбранноеЗначение.СписокНастроек.Представление);	
			
		ИначеЕсли ВыбранноеЗначение.Источник = "ФормаВосстановленияНастроек" Тогда
			
			ВосстановитьНастройкиВБазе(ВыбранноеЗначение.СписокНастроек.Представление);	
			ОбновитьДанныеТабличногоДокумента(Истина);
			УправлениеВидимостью();
			
		ИначеЕсли ВыбранноеЗначение.Источник = "ФормаВыбораЗначенияПоУмолчанию" Тогда
			
			ТекДанные = мПолучитьТекущиеДанныеСтраницыНастройки();
			
			ТекДанные.ЗначениеПоУмолчанию = ВыбранноеЗначение.ЗначениеПоУмолчанию;
			ТекДанные.НастройкаЗагрузки = ВыбранноеЗначение.НастройкаЗагрузки;
			
			ТекДанные.ПредставлениеЗначенияПоУмолчанию = ?(ПустаяСтрока(ТекДанные.НастройкаЗагрузки), "", "По настройке: "+ВыбранноеЗначение.ЗаголовокНастройкиЗагрузки)
				+?(ПустаяСтрока(ТекДанные.ЗначениеПоУмолчанию), "", ?(ПустаяСтрока(ТекДанные.НастройкаЗагрузки), "", ", ") + ТекДанные.ЗначениеПоУмолчанию);
		КонецЕсли;
	                                 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	СтруктураТекстВопроса = ПолучитьТекстВопросаИсточника();
	КоличествоЭлементов = ТаблицаПодготовленныхДанных.Количество();
	Если НЕ ПустаяСтрока(СтруктураТекстВопроса.Ошибка) Тогда
		ПоказатьПредупреждение(, СтруктураТекстВопроса.Ошибка);
		
		Если ВыполняетсяЗаполнениеТЧОбъекта Тогда
			ПараметрыКоманды = Новый Структура("ДополнительнаяОбработкаСсылка, ОбъектыНазначения, СопровождающийТекст");
			ПараметрыКоманды.ДополнительнаяОбработкаСсылка = ОбъектСсылка;
			ПараметрыКоманды.СопровождающийТекст = "";
			
			Состояние(ПараметрыКоманды.СопровождающийТекст);
			
			РезультатВыполнения = ВыполнитьКомандуНапрямую(ИдентификаторКоманды, ПараметрыКоманды);
			ЗагрузитьРезультат(РезультатВыполнения);	
		КонецЕсли;
		
	Иначе
		
		ТекстВопроса = НСтр("ru='Загрузить ""%1"" ""%2""'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, КоличествоЭлементов, СтруктураТекстВопроса.ТекстВопроса);
		Оповещение = Новый ОписаниеОповещения("КомандаЗагрузитьЗавершение", ЭтотОбъект);				
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		ЗагрузитьДанныеСервер();
	КонецЕсли;	
	
	Если ВыполняетсяЗаполнениеТЧОбъекта Тогда
		ПараметрыКоманды = Новый Структура("ДополнительнаяОбработкаСсылка, ОбъектыНазначения, СопровождающийТекст");
		ПараметрыКоманды.ДополнительнаяОбработкаСсылка = ОбъектСсылка;
		ПараметрыКоманды.СопровождающийТекст = "";
		
		Состояние(ПараметрыКоманды.СопровождающийТекст);
		
		РезультатВыполнения = ВыполнитьКомандуНапрямую(ИдентификаторКоманды, ПараметрыКоманды);
		ЗагрузитьРезультат(РезультатВыполнения);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультат(РезультатВыполнения)
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") И ЭтоФормаОбъекта Тогда
		ВладелецФормы.Прочитать();
	КонецЕсли;
	
	Выполнить("ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ВладелецФормы, РезультатВыполнения)");

КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрыть(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Табличный документ (*.mxl)|*.mxl|Лист Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Текстовый документ (*.txt)|*.txt|dBase III (*.dbf)|*.dbf|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ТабличныйДокумент = Элементы.ТабДокумент;
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".mxl" Тогда
			мПрочитатьТабличныйДокументИзMXL(ДиалогВыбораФайла.ПолноеИмяФайла);
		ИначеЕсли нРег(ФайлНаДиске.Расширение) = ".xls"
			ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx" Тогда
			мПрочитатьТабличныйДокументИзExcel(ДиалогВыбораФайла.ПолноеИмяФайла);
		ИначеЕсли нРег(ФайлНаДиске.Расширение) = ".txt" Тогда
			мПрочитатьТабличныйДокументИзТекста(ДиалогВыбораФайла.ПолноеИмяФайла);
		ИначеЕсли нРег(ФайлНаДиске.Расширение) = ".dbf" Тогда
			мПрочитатьТабличныйДокументИзDBF(ДиалогВыбораФайла.ПолноеИмяФайла);
		КонецЕсли;
		УправлениеВидимостью();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок = "Сохранить табличный документ в файл";
	ДиалогВыбораФайла.Фильтр    = "Табличный документ (*.mxl)|*.mxl|Лист Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Текстовый документ (*.txt)|*.txt|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ТабличныйДокумент = Элементы.ТабДокумент;
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".mxl" Тогда
			ТабличныйДокумент.Записать(ДиалогВыбораФайла.ПолноеИмяФайла,ТипФайлаТабличногоДокумента.MXL);
		ИначеЕсли нРег(ФайлНаДиске.Расширение) = ".xls"
			ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx" Тогда
			ТабличныйДокумент.Записать(ДиалогВыбораФайла.ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
		ИначеЕсли нРег(ФайлНаДиске.Расширение) = ".txt" Тогда
			ТабличныйДокумент.Записать(ДиалогВыбораФайла.ПолноеИмяФайла,ТипФайлаТабличногоДокумента.TXT);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	ОбновитьДанныеТабличногоДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТаблицуДанных(Команда)
	
	ПолучитьТаблицуДанныхНаСервере();
	
	Элементы.ГруппаЗагрузкаНастройка.ТекущаяСтраница = Элементы.ТаблицаДанных;
	Элементы.ПродолжитьНастройку.Видимость = Истина;
	Элементы.Загрузить.Видимость = Истина;
	Элементы.Загрузить.КнопкаПоУмолчанию = Истина;	
	Элементы.РежимЗагрузки.ТолькоПросмотр = Истина;
	Элементы.СсылкаИсточника.ТолькоПросмотр = Истина;
	Элементы.СсылкаДокумента.ТолькоПросмотр = Истина;
	Элементы.ИмяВидаРегистра.ТолькоПросмотр = Истина;
	Элементы.ТабличнаяЧастьИсточника.ТолькоПросмотр = Истина;
	Элементы.ТипОбъекта.ТолькоПросмотр = Истина;
	Элементы.РегистрДокумента.ТолькоПросмотр = Истина;
	Элементы.ПЗ_СсылкаИсточника.ТолькоПросмотр = Истина;
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Элементы[КлючИЗначение.Ключ].Видимость = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСледующееПримечание(Команда)
	
	Нашли = Ложь;
	
	Колонка = ТабличныйДокумент.ТекущаяОбласть.Лево + 1;
	Строка  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	Пока Не Нашли и Строка <= ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Пока Не Нашли и Колонка <=  ТабличныйДокумент.ШиринаТаблицы Цикл
			
			Область = ТабличныйДокумент.Область("R" + Формат(Строка, "ЧГ=") + "C" + Формат(Колонка, "ЧГ="));
			Нашли = Не ПустаяСтрока(Область.Примечание.Текст);
			
			Колонка = Колонка + 1;
		КонецЦикла;
		Строка = Строка + 1;
		Колонка = 1;
	КонецЦикла;
	
	Если Нашли Тогда
		ТабличныйДокумент.ТекущаяОбласть = Область;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Достигнут конец документа'"));		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредыдущееПримечание(Команда)
	
	Нашли = Ложь;
	
	Колонка = ТабличныйДокумент.ТекущаяОбласть.Лево - 1;
	Строка  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	Пока Не Нашли и Строка > 0 Цикл
		
		Пока Не Нашли и Колонка > 0 Цикл
			
			Область = ТабличныйДокумент.Область("R" + Формат(Строка, "ЧГ=") + "C" + Формат(Колонка, "ЧГ="));
			Нашли = Не ПустаяСтрока(Область.Примечание.Текст);
			
			Колонка = Колонка - 1;
		КонецЦикла;
		Строка = Строка - 1;
		Колонка = ТабличныйДокумент.ШиринаТаблицы;
	КонецЦикла;
	
	Если Нашли Тогда
		ТабличныйДокумент.ТекущаяОбласть = Область;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Достигнуто начало документа'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьЗначенияИзФайла(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ЗаголовокДиалога = "Открыть статус выполнения из файла";
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "Настройка универсальной загрузки (*.qxlz)|*.qxlz";
	ДиалогОткрытияФайла.Заголовок = ЗаголовокДиалога;
	ДиалогОткрытияФайла.Фильтр = Фильтр;	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		
		файлТекстовый = Новый ДвоичныеДанные(Файл);	
		АдресХранилища = ПоместитьВоВременноеХранилище(файлТекстовый, Новый УникальныйИдентификатор);
		
		ВосстановитьТаблицу(АдресХранилища);
	КонецЕсли;
	
	ОбновитьДанныеТабличногоДокумента(Истина);
	УправлениеВидимостью();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьЗначенияВФайл(Команда)
	
	Таблицы = Новый СписокЗначений;
	
	Таблицы.Добавить("ТекущаяВерсия");
	Таблицы.Добавить("ЗамещатьСуществующиеЗаписи");
	Таблицы.Добавить("ИмяВидаРегистра");
	Таблицы.Добавить("Колонка_ПриИзмененииСоздатьДокумент");
	Таблицы.Добавить("НеСоздаватьНовыхЭлементов");
	Таблицы.Добавить("ПерваяСтрокаДанныхТабличногоДокумента");
	Таблицы.Добавить("ПередЗаписьюОбъекта");
	Таблицы.Добавить("ПослеДобавленияСтроки");
	Таблицы.Добавить("ПриЗаписиОбъекта");
	Таблицы.Добавить("ПослеЗаписиОбъекта");
	Таблицы.Добавить("РежимЗагрузки");
	Таблицы.Добавить("РучнаяНумерацияКолонокТабличногоДокумента");
	Таблицы.Добавить("СсылкаДокумента");
	Таблицы.Добавить("СсылкаИсточника");
	Таблицы.Добавить("ТабличнаяЧастьИсточника");
	Таблицы.Добавить("ТипОбъектаСправочника");
	Таблицы.Добавить("РегистрДокумента");
	Таблицы.Добавить("ТаблицыНастроек");
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Таблицы.Добавить(КлючИЗначение.Значение);	
	КонецЦикла;
	
	СохранитьТаблицуВФайл(Таблицы);
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ФормаНастроек = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаСохраненияНастройки", ,ЭтаФорма);
	
	Если СписокСохраненныхНастроек.Количество() = 0 Тогда
		ТекущиеДанные = ФормаНастроек.СписокНастроек.Добавить();
		ТекущиеДанные.Представление = "Основная";
		ФормаНастроек.СоздавалиНовуюСтроку = Истина;
	Иначе
		ФормаНастроек.СоздавалиНовуюСтроку = Ложь;
		Для каждого строка Из СписокСохраненныхНастроек Цикл
			ЗаполнитьЗначенияСвойств(ФормаНастроек.СписокНастроек.Добавить(), Строка);		
		КонецЦикла;
	КонецЕсли;
		
	ФормаНастроек.ИдентификаторОбработки = ИдентификаторОбработки;
	
	ФормаНастроек.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройки(Команда)
	
	ФормаНастроек = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаВыбораНастройки", ,ЭтаФорма);
	
	Для каждого строка Из СписокСохраненныхНастроек Цикл
		ЗаполнитьЗначенияСвойств(ФормаНастроек.СписокНастроек.Добавить(), Строка);		
	КонецЦикла;
	
	ФормаНастроек.ИдентификаторОбработки = ИдентификаторОбработки;
	
	ФормаНастроек.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеречитать(Команда)
	ЗаполнитьНастройкиКолонок();
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	стр = Новый Структура("Ключ", Элементы.ГруппаЗагрузкаНастройка.ТекущаяСтраница.Имя);
	СтрокаНастроек = ТаблицыНастроек.НайтиСтроки(стр);	
	Если СтрокаНастроек.Количество() > 0 Тогда
		Для каждого ЗагружаемыйРеквизит Из ЭтаФорма[СтрокаНастроек[0].Значение] Цикл
			ЗагружаемыйРеквизит.Пометка = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	стр = Новый Структура("Ключ", Элементы.ГруппаЗагрузкаНастройка.ТекущаяСтраница.Имя);
	СтрокаНастроек = ТаблицыНастроек.НайтиСтроки(стр);	
	Если СтрокаНастроек.Количество() > 0 Тогда
		Для каждого ЗагружаемыйРеквизит Из ЭтаФорма[СтрокаНастроек[0].Значение] Цикл
			Если НЕ ЗагружаемыйРеквизит.НеУбиратьПометку Тогда
				ЗагружаемыйРеквизит.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРучнаяНумерацияКолонокТабличногоДокумента(Команда)
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Элементы[КлючИЗначение.Значение + "РучнаяНумерацияКолонокТабличногоДокумента"].Пометка = НЕ Элементы[КлючИЗначение.Значение + "РучнаяНумерацияКолонокТабличногоДокумента"].Пометка;
		РучнаяНумерацияКолонокТабличногоДокумента = Элементы[КлючИЗначение.Значение + "РучнаяНумерацияКолонокТабличногоДокумента"].Пометка;	
	КонецЦикла;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренумероватьКолонки(Команда)
	
	НомерКолонки = 1;
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Для каждого Реквизит Из ЭтаФорма[КлючИЗначение.Значение] Цикл
			Если Реквизит.Пометка И Реквизит.РежимЗагрузки <> "Устанавливать" Тогда
				Если Не Реквизит.НомерКолонки = НомерКолонки Тогда
					Реквизит.НомерКолонки = НомерКолонки;
				КонецЕсли;
				НомерКолонки = НомерКолонки + 1;
			Иначе
				Реквизит.НомерКолонки = 0;
			КонецЕсли;
			
			Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
				Реквизит.РежимЗагрузки = "Устанавливать"
			ИначеЕсли Не Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
				Реквизит.РежимЗагрузки = "Искать"
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСобытия(Команда)
	
	ФормаРедактированиеСобытий = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаРедактированияСобытий", ,ЭтаФорма);
	
	ФормаРедактированиеСобытий.РежимЗагрузки = РежимЗагрузки;
	
	ФормаРедактированиеСобытий.ПередЗаписьюОбъекта	.УстановитьТекст(ПередЗаписьюОбъекта);
	ФормаРедактированиеСобытий.ПриЗаписиОбъекта		.УстановитьТекст(ПриЗаписиОбъекта);
	ФормаРедактированиеСобытий.ПослеДобавленияСтроки.УстановитьТекст(ПослеДобавленияСтроки);
	ФормаРедактированиеСобытий.ПослеЗаписиОбъекта.УстановитьТекст(ПослеЗаписиОбъекта);
	
	ФормаРедактированиеСобытий.Открыть();
		
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	ФормаНастроек = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаНастроек", ,ЭтаФорма);
	ФормаНастроек.ЗамещатьСуществующиеЗаписи = ЗамещатьСуществующиеЗаписи;
	ФормаНастроек.НеСоздаватьНовыхЭлементов = НеСоздаватьНовыхЭлементов;
	ФормаНастроек.ПерваяСтрокаДанныхТабличногоДокумента = ПерваяСтрокаДанныхТабличногоДокумента;
	ФормаНастроек.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьОбновления(Команда)
	Элементы.ПроверятьОбновления.Пометка = НЕ Элементы.ПроверятьОбновления.Пометка;
	ПроверятьОбновления = Элементы.ПроверятьОбновления.Пометка;	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьНастройку(Команда)
	
	Элементы.РежимЗагрузки.ТолькоПросмотр = Ложь;
	Элементы.СсылкаИсточника.ТолькоПросмотр = Ложь;
	Элементы.СсылкаДокумента.ТолькоПросмотр = Ложь;
	Элементы.ИмяВидаРегистра.ТолькоПросмотр = Ложь;
	Элементы.ТабличнаяЧастьИсточника.ТолькоПросмотр = Ложь;
	Элементы.ТипОбъекта.ТолькоПросмотр = Ложь;
	Элементы.РегистрДокумента.ТолькоПросмотр = Ложь;
	Элементы.ПЗ_СсылкаИсточника.ТолькоПросмотр = Ложь;

	ПродолжитьНастройкуНаСервере();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройкиДляЗагрузкиСправочникаИлиТЧ(Команда)
	
	ФормаДобавленияДополнительнойНастройки = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаДобавленияДополнительнойНастройки", ,ЭтаФорма);
	
	Список = ФормаДобавленияДополнительнойНастройки.Элементы.ДобавляемыйОбъект.СписокВыбора;
	Список.Очистить();
    Для каждого сп Из СписокДобавляемыхСтраниц Цикл
		Список.Добавить(сп.Значение, сп.Представление);	
	КонецЦикла;
	Если РежимЗагрузки = 0 Тогда
		ФормаДобавленияДополнительнойНастройки.Элементы.ДобавляемыйОбъект.Заголовок = "Подчиненный справочник";	
	ИначеЕсли РежимЗагрузки = 1 ИЛИ РежимЗагрузки = 5 Тогда
		ФормаДобавленияДополнительнойНастройки.Элементы.ДобавляемыйОбъект.Заголовок = "Табличная часть";	
	КонецЕсли;
	
	ФормаДобавленияДополнительнойНастройки.Открыть();
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройкиДляЗагрузкиРегистра(Команда)
	
	ФормаДобавленияДополнительнойНастройки = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаДобавленияДополнительнойНастройки", ,ЭтаФорма);
	
	Список = ФормаДобавленияДополнительнойНастройки.Элементы.ДобавляемыйОбъект.СписокВыбора;
	Список.Очистить();
    Для каждого сп Из СписокДобавляемыхСтраницРегистры Цикл
		Список.Добавить(сп.Значение, сп.Представление);	
	КонецЦикла;
	
	ФормаДобавленияДополнительнойНастройки.Элементы.ДобавляемыйОбъект.Заголовок = "Регистр";	
	ФормаДобавленияДополнительнойНастройки.ЭтоРегистр = Истина;
	
	ФормаДобавленияДополнительнойНастройки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПредЗагрузкуСправочника(Команда)
	
	ФормаДобавленияДополнительнойНастройки = ПолучитьФорму(ИдентификаторОбработки+".Форма.ФормаДобавленияДополнительнойНастройки", ,ЭтаФорма);
	
	Список = ФормаДобавленияДополнительнойНастройки.Элементы.ДобавляемыйОбъект.СписокВыбора;
	Список.Очистить();
    Для каждого сп Из Элементы.ТипОбъекта.СписокВыбора Цикл
		Список.Добавить(сп.Значение, сп.Представление);	
	КонецЦикла;
	
	ФормаДобавленияДополнительнойНастройки.Элементы.ДобавляемыйОбъект.Заголовок = "Справочник";	
	ФормаДобавленияДополнительнойНастройки.ЗагружаетсяДоОбъекта = Истина;
	
	ФормаДобавленияДополнительнойНастройки.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина". 
// В случае работы на клиенте или на сервере выводит в окно сообщений,
// в случае внешнего соединения вызывает исключение.
//
// Параметры:
//  ТекстСообщения - строка, текст сообщения,
//  Отказ          - булево, признак отказа (необязательный).
//
Процедура мСообщитьОбОшибке(ТекстСообщения, Отказ = Ложь, Заголовок = "")

	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	Если ОкончаниеСлужебногоСообщения > 0 И НачалоСлужебногоСообщения > 0 Тогда
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) +
		                 Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
	КонецЕсли;
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(Заголовок) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Заголовок);
		Заголовок = "";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция "расщепляет" строку на подстроки, используя заданный
//		разделитель. Разделитель может иметь любую длину.
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например,
//		ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов,
//		три из которых - пустые строки, а
//		ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов.
//
//	Параметры:
//		Стр - 			строка, которую необходимо разложить на подстроки.
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки.
//
Функция мРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				Попытка		
					МассивСтрок.Добавить(Число(Стр));	
				Исключение
					МассивСтрок.Добавить(0);
				КонецПопытки; 
				Возврат МассивСтрок;
			КонецЕсли;
			
			Попытка
				
				МассивСтрок.Добавить(Число(Лев(Стр,Поз-1)));
				
			Исключение
				МассивСтрок.Добавить(0);
			КонецПопытки; 
			
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция приводит строковое представление числа к его значению.
//
// Параметры:
//  Представление - Представление числа,
//  ОписаниеТипов - Допустимое описание типов численного значения.
//
// Возвращаемое значение:
//  Значение типа число.
//
Функция мПривестиКЧислу(Представление, Знач ОписаниеТипов = Неопределено, Примечание = "")
	
	Если ОписаниеТипов = Неопределено Тогда
		ОписаниеТипов = Новый ОписаниеТипов("Число");
	КонецЕсли;
	
	НРегПредставление = НРег(Представление);
	Если НРегПредставление = "да" или НРегПредставление = "истина" или НРегПредставление = "включено" Тогда
		Возврат 1;
	ИначеЕсли НРегПредставление = "нет" или НРегПредставление = "ложь" или НРегПредставление = "выключено" Тогда
		Возврат 0;
	КонецЕсли;
	
	Результат = СтрЗаменить(Представление, " ", "");
	Попытка
		Результат = Число(Результат);
	Исключение
		Примечание = "Неправильный формат числа";
		Возврат 0;
	КонецПопытки;
	
	Результат1 = ОписаниеТипов.ПривестиЗначение(Результат);
	
	Если Не Результат1 = Результат Тогда
		Примечание = "Недопустимое числовое значение";
	КонецЕсли;
	
	Возврат Результат1;
	
КонецФункции

&НаСервереБезКонтекста
// Функция приводит строковое представление даты к его значению
//
// Параметры:
//  Представление - Представление числа,
//  ОписаниеТипов - Допустимое описание типов значения типа дата.
//
// Возвращаемое значение:
//  Значение типа дата.
//
Функция мПривестиКДате(Представление, ТипРеквизита, Примечание = "")
	
	Результат = ТипРеквизита.ПривестиЗначение(Представление);
	Если Результат = '00010101' Тогда
		
		МассивЧастей = ПолучитьЧастиПредставленияДаты(Представление);
		Если ТипРеквизита.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
			
			Попытка
				
				Если МассивЧастей.Количество() = 3 Тогда
					Результат = Дата(1,1,1, МассивЧастей[0],МассивЧастей[1],МассивЧастей[2]);
				ИначеЕсли МассивЧастей.Количество() = 6 Тогда
					Результат = Дата(1,1,1, МассивЧастей[3],МассивЧастей[4],МассивЧастей[5]);
				КонецЕсли;
				
			Исключение
				Примечание = "Неправильный формат даты";
			КонецПопытки;
			
		ИначеЕсли МассивЧастей.Количество() = 3 или МассивЧастей.Количество() = 6 Тогда
			
			Если МассивЧастей[0] >= 1000 Тогда
				Временно = МассивЧастей[0];
				МассивЧастей[0] = МассивЧастей[2];
				МассивЧастей[2] = Временно;
			КонецЕсли;
			
			Если МассивЧастей[2] < 100 Тогда
				МассивЧастей[2] = МассивЧастей[2] + ?(МассивЧастей[2] < 30, 2000,1900);
			КонецЕсли;
			
			Попытка
				Если МассивЧастей.Количество() = 3 или ТипРеквизита.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
					Результат = Дата(МассивЧастей[2],МассивЧастей[1],МассивЧастей[0]);
				Иначе
					Результат = Дата(МассивЧастей[2],МассивЧастей[1],МассивЧастей[0],МассивЧастей[3],МассивЧастей[4],МассивЧастей[5]);
				КонецЕсли;
			Исключение
				Примечание = "Неправильный формат даты";
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
// Функция приводит к виду движения накопления.
//
Функция мПривестиКВидуДвиженияНакопления(Представление, ТипРеквизита, Примечание = "")
	
	Если ВРег(Представление) = "ПРИХОД" Тогда
		Возврат ВидДвиженияНакопления.Приход;
	ИначеЕсли ВРег(Представление) = "РАСХОД" Тогда
		Возврат ВидДвиженияНакопления.Расход;
	Иначе
		Примечание = "Неправильный вид движения накопления";	
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
// Функция возвращает части представления даты.
//
// Параметры:
//  Представление - Представление даты.
//
// Возвращаемое значение:
//  массив частей даты.
//
Функция ПолучитьЧастиПредставленияДаты(ЗНАЧ Представление)
	
	МассивЧастей = Новый Массив;
	НачалоЦифры = 0;
	Для к = 1 По СтрДлина(Представление) Цикл
		
		Символ = Сред(Представление, к ,1);
		ЭтоЦифра = Символ >= "0" и Символ <= "9";
		
		Если ЭтоЦифра Тогда
			
			Если НачалоЦифры = 0 Тогда
				НачалоЦифры = к;
			КонецЕсли;
			
		Иначе
			
			Если Не НачалоЦифры = 0 Тогда
				МассивЧастей.Добавить(Число(Сред(Представление,НачалоЦифры, к - НачалоЦифры)));
			КонецЕсли;
			
			НачалоЦифры = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не НачалоЦифры = 0 Тогда
		МассивЧастей.Добавить(Число(Сред(Представление,НачалоЦифры)));
	КонецЕсли;
	
	Возврат МассивЧастей;
КонецФункции

&НаСервереБезКонтекста
// Функция возвращает менеджер по типу значения.
//
// Параметры:
//  ТипЗначения - Тип значения, по которому нужна вернуть менеджер.
//
// Возвращаемое значение:
//  менеджер.
Функция ПолучитьМенеджераПоТипу(ТипЗначения)
	
	Если Не ТипЗначения = Неопределено Тогда
		МенеджерыОбъектовМетаданных = Новый Структура("Справочники, Перечисления, Документы, ПланыВидовХарактеристик, ПланыСчетов, ПланыВидовРасчета, БизнесПроцессы, Задачи",
				Справочники,
				Перечисления,
				Документы,
				ПланыВидовХарактеристик,
				ПланыСчетов,
				ПланыВидовРасчета,
				БизнесПроцессы,
				Задачи);
		Для Каждого МенеджерОбъектаМетаданных Из МенеджерыОбъектовМетаданных Цикл
			Если МенеджерОбъектаМетаданных.Значение.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
				Менеджер = МенеджерОбъектаМетаданных.Значение[Метаданные.НайтиПоТипу(ТипЗначения).Имя];
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат Менеджер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция проверяет на принадлежность объекта к типу ДокументыСсылка.
//
// Параметры:
//	ПроверяемыйОбъект - Объект который требуется проверить.
//
Функция мЭтоДокумент(ПроверяемыйОбъект)
	
	Возврат Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПроверяемыйОбъект));
	
КонецФункции

&НаКлиенте
Функция мПолучитьТекущиеДанныеСтраницыНастройки(СтандартнаяОбработка = Истина)
	
	стр = Новый Структура("Ключ", Элементы.ГруппаЗагрузкаНастройка.ТекущаяСтраница.Имя);
	СтрокаНастроек = ТаблицыНастроек.НайтиСтроки(стр);	
	Если СтрокаНастроек.Количество() > 0 Тогда
		ТекДанные = Элементы[СтрокаНастроек[0].Значение].ТекущиеДанные;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Возврат ТекДанные;
	
КонецФункции

&НаКлиенте
// Процедура выбора файла в который требуется сохранить настройки.
//
// Парметры:
// 	Таблица - Строка с наименование реквизита (или список значений с наименованиями) которые требуется сохранить.
//
Процедура СохранитьТаблицуВФайл(Таблица)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ЗаголовокДиалога = "Сохранить статус выполнения в файл";
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "Настройка универсальной загрузки (*.qxlz)|*.qxlz";
	ДиалогОткрытияФайла.Заголовок = ЗаголовокДиалога;
	ДиалогОткрытияФайла.Фильтр = Фильтр;	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		
		АдресХранилища = СохранитьТаблицу(Таблица);
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
		ДвоичныеДанные.Записать(Файл);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция сохраяет список значений в структуру и сохраняет его в хранилище значений.
// 
// Парметры:
// 	Таблица - Строка с наименование реквизита (или список значений с наименованиями) которые требуется сохранить.
//
Функция СохранитьТаблицу(Таблица)
	
	СостояниеВыполнения = Новый Структура;
	
	Если ТипЗнч(Таблица) = Тип("СписокЗначений") Тогда
		Для каждого Стр Из Таблица Цикл
			СостояниеВыполнения = ВыгрузитьТаблицыВСтруктуру(Стр.Значение, СостояниеВыполнения);	
		КонецЦикла;	
	Иначе
		СостояниеВыполнения = ВыгрузитьТаблицыВСтруктуру(Таблица, СостояниеВыполнения);
	КонецЕсли;
	
	временныйФайл = КаталогВременныхФайлов() + "\temp.txt";
    
	Если ЗначениеЗаполнено(временныйФайл) Тогда
		ЗначениеВФайл(временныйФайл, СостояниеВыполнения);
	КонецЕсли;
	
	СостояниеВыполнения.Очистить();
	
	файлТекстовый = Новый ДвоичныеДанные(временныйФайл);	
	АдресХранилища = ПоместитьВоВременноеХранилище(файлТекстовый, Новый УникальныйИдентификатор);
	
	Возврат(АдресХранилища);
	
КонецФункции

&НаСервере
// Функция выгружает значение сохраняемых реквизитов в структуру.
//
// Параметры:
//	Таблица - Реквизит который требуется выгрузить в структуру,
//	СостояниеВыполнения - Структура в которую выгружаются значения реквизитов.
//
Функция ВыгрузитьТаблицыВСтруктуру(Таблица, СостояниеВыполнения)
	
	Если (ТипЗнч(ЭтаФорма[Таблица]) = Тип("ДанныеФормыКоллекция"))
		ИЛИ (ТипЗнч(ЭтаФорма[Таблица]) = Тип("ДанныеФормыДерево")) Тогда
		ТаблицаОб = РеквизитФормыВЗначение(Таблица);
		СостояниеВыполнения.Вставить(Таблица, ТаблицаОб);
	Иначе
		СостояниеВыполнения.Вставить(Таблица, ЭтаФорма[Таблица]);	
	КонецЕсли;
	
	Возврат(СостояниеВыполнения);
	
КонецФункции

&НаСервере
// Процедура получает сохраненную в хранилище структуру с настройками.
//
// Параметры:
// 	АдресХранилища - адрес в хранилище значений.
//
Процедура ВосстановитьТаблицу(АдресХранилища)
	
	файл = ПолучитьИзВременногоХранилища(АдресХранилища);
 
    временныйФайл = КаталогВременныхФайлов() + "\" + СтрЗаменить(СокрЛП(АдресХранилища),"/", "-") + ".txt";
    файл.Записать(временныйФайл);
	
	Попытка
		СостояниеВыполнения = ЗначениеИзФайла(временныйФайл);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось прочитать файл'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	ВосстановитьНастройкиИзСостоянияВыполнения(СостояниеВыполнения);
	
КонецПроцедуры

&НаСервере
// Процедура восстанавливает настройки из структуры.
//
// Параметры:
// 	СостояниеВыполнения - Структура из которой требуется восстановить настройки.
//
Процедура ВосстановитьНастройкиИзСостоянияВыполнения(СостояниеВыполнения)
	
	ВосстановленнаяТекущаяВерсия = Неопределено;
	СостояниеВыполнения.Свойство("ТекущаяВерсия", ВосстановленнаяТекущаяВерсия);
	
	ВостановитьТаблицуИзСоответствия("ЗамещатьСуществующиеЗаписи", СостояниеВыполнения);	
	ВостановитьТаблицуИзСоответствия("НеСоздаватьНовыхЭлементов", СостояниеВыполнения);
	ВостановитьТаблицуИзСоответствия("РучнаяНумерацияКолонокТабличногоДокумента", СостояниеВыполнения);
	ВостановитьТаблицуИзСоответствия("ПерваяСтрокаДанныхТабличногоДокумента", СостояниеВыполнения);
	ВостановитьТаблицуИзСоответствия("ПередЗаписьюОбъекта", СостояниеВыполнения);
	ВостановитьТаблицуИзСоответствия("ПослеДобавленияСтроки", СостояниеВыполнения);
	ВостановитьТаблицуИзСоответствия("ПриЗаписиОбъекта", СостояниеВыполнения);	
	ВостановитьТаблицуИзСоответствия("ПослеЗаписиОбъекта", СостояниеВыполнения);
	
	Если НЕ ВыполняетсяЗаполнениеТЧОбъекта Тогда
		ТипОбъектаСправочника	= Неопределено;
		СсылкаИсточника			= Неопределено;
		ИмяВидаРегистра			= Неопределено;
		ТабличнаяЧастьИсточника	= Неопределено;
		СсылкаДокумента 		= Неопределено;
		РегистрДокумента		= Неопределено;
		
		ВостановитьТаблицуИзСоответствия("РежимЗагрузки", СостояниеВыполнения);	
		УстановитьИсточник();	
		ВостановитьТаблицуИзСоответствия("СсылкаДокумента", СостояниеВыполнения);
		ВостановитьТаблицуИзСоответствия("СсылкаИсточника", СостояниеВыполнения);
		ВостановитьТаблицуИзСоответствия("ИмяВидаРегистра", СостояниеВыполнения);
		ВостановитьТаблицуИзСоответствия("РегистрДокумента", СостояниеВыполнения);
		ВостановитьТаблицуИзСоответствия("ТипОбъектаСправочника", СостояниеВыполнения);
	КонецЕсли;
				
	УстановитьСписокТабличныхЧастей();
	УстановитьСписокРегистров();
	Если РежимЗагрузки = 3 Тогда
		ЗаполнитьВТаблицуЗначенийДвиженияРегистраДокумента();
	КонецЕсли;
	
	ВостановитьТаблицуИзСоответствия("ТабличнаяЧастьИсточника", СостояниеВыполнения);
	
	ОчиститьСозданныеСтраницы(Истина);		
	
	ТаблицыНастроек.Очистить();
	КоличествоСозданныхПодчиненныхНастроек = 0;
	
	ВосстановленнаяТаблицаНастроек = Новый ТаблицаЗначений;
	СостояниеВыполнения.Свойство("ТаблицыНастроек", ВосстановленнаяТаблицаНастроек);
	
	Для каждого КлючИЗначение Из ВосстановленнаяТаблицаНастроек Цикл
		Если ВыполнитьСравнениеВерсий(ВосстановленнаяТекущаяВерсия, "2.5") Тогда
			ДобавитьСтраницуНастроек(КлючИЗначение.Справочник, КлючИЗначение.Представление, КлючИЗначение.ДопНастройки, КлючИЗначение.ЭтоРегистр, КлючИЗначение.ЗагружаетсяДоОбъекта);
			Если КлючИЗначение.ДопНастройки ИЛИ КлючИЗначение.ЗагружаетсяДоОбъекта Тогда
				ЗаполнитьНастройкамиСозданнуюСтраницу(КлючИЗначение.Значение, КлючИЗначение.Справочник, КлючИЗначение.ЭтоРегистр, КлючИЗначение.ЗагружаетсяДоОбъекта);
			КонецЕсли;	
		ИначеЕсли ВыполнитьСравнениеВерсий(ВосстановленнаяТекущаяВерсия, "2.4") Тогда
			ДобавитьСтраницуНастроек(КлючИЗначение.Справочник, КлючИЗначение.Представление, КлючИЗначение.ДопНастройки, КлючИЗначение.ЭтоРегистр);
			Если КлючИЗначение.ДопНастройки Тогда
				ЗаполнитьНастройкамиСозданнуюСтраницу(КлючИЗначение.Значение, КлючИЗначение.Справочник, КлючИЗначение.ЭтоРегистр);
			КонецЕсли;
		Иначе	
			ДобавитьСтраницуНастроек(КлючИЗначение.Справочник, КлючИЗначение.Представление, КлючИЗначение.ДопНастройки);
			Если КлючИЗначение.ДопНастройки Тогда
				ЗаполнитьНастройкамиСозданнуюСтраницу(КлючИЗначение.Значение, КлючИЗначение.Справочник);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если РежимЗагрузки = 5 Тогда
		НовыйЭлемент = Элементы.Добавить("Колонка_ПриИзмененииСоздатьДокумент", Тип("ПолеФормы"), Элементы["СтраницаТаблицаЗагружаемыхРеквизитов"]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Колонка_ПриИзмененииСоздатьДокумент";
		НовыйЭлемент.РежимВыбораИзСписка = Истина;
		Элементы.Переместить(Элементы["Колонка_ПриИзмененииСоздатьДокумент"], Элементы["СтраницаТаблицаЗагружаемыхРеквизитов"], Элементы["ТаблицаЗагружаемыхРеквизитовКоманднаяПанель"]);
	КонецЕсли;
	
	ЗаполнитьНастройкиКолонок();
	
	Если РежимЗагрузки = 5 Тогда
		ВостановитьТаблицуИзСоответствия("Колонка_ПриИзмененииСоздатьДокумент", СостояниеВыполнения);
	КонецЕсли;
	
	Для каждого КлючИЗначение Из ВосстановленнаяТаблицаНастроек Цикл
		ВосстановленнаяТаблицаЗагружаемыхРеквизитов = Новый ТаблицаЗначений;
		СостояниеВыполнения.Свойство(КлючИЗначение.Значение, ВосстановленнаяТаблицаЗагружаемыхРеквизитов);		
		ТЗ = РеквизитФормыВЗначение(КлючИЗначение.Значение);
		ВосстановитьЗначенияНастроекИзТаблицыРеквизитов(ТЗ, ВосстановленнаяТаблицаЗагружаемыхРеквизитов);
		ЗначениеВРеквизитФормы(ТЗ, КлючИЗначение.Значение);
	КонецЦикла;
	
	СостояниеВыполнения.Очистить();	
	
КонецПроцедуры

&НаСервере
// Процедура восстанавливает реквизит, таблицу значений или дерево значений из структуры.
//
// Параметры:
//	Таблица - Наименование восстанавливаемого реквизита, таблицы значений или дерева значений (Строка),
//	СостояниеВыполнения - Структура, из которого требуется восстановить значение.
//
Процедура ВостановитьТаблицуИзСоответствия(Таблица, СостояниеВыполнения)
	
	Если ТипЗнч(ЭтаФорма[Таблица]) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаОб = Новый ТаблицаЗначений;
		Если НЕ СостояниеВыполнения.Свойство(Таблица, ТаблицаОб) Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ТаблицаОб, Таблица);
	ИначеЕсли ТипЗнч(ЭтаФорма[Таблица]) = Тип("ДанныеФормыДерево") Тогда
		ДеревоОб = Новый ДеревоЗначений;
		Если НЕ СостояниеВыполнения.Свойство(Таблица, ДеревоОб) Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ДеревоОб, Таблица);	
	Иначе
		Если НЕ СостояниеВыполнения.Свойство(Таблица, ЭтаФорма[Таблица]) Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура сохраняет настройки в базе данных.
//
// Параметры:
//	Пометка - Определяет, что данная настройка должна восстанавливаться при открытии (Булево),
//	Представление - Наименование выбранной настройки под которым она будет сохранена в Хранилище настроек данных формы.
//
Процедура СохранитьНастройкуВбазе(Пометка, Представление)
	
	Если Пометка Тогда
		Строка = СписокСохраненныхНастроек.НайтиСтроки(Новый Структура("Пометка", Истина));	
	КонецЕсли;
	Если ЗначениеЗаполнено(Строка) Тогда
		Строка[0].Пометка = Ложь;	
	КонецЕсли;
	
	Строка = СписокСохраненныхНастроек.НайтиСтроки(Новый Структура("Представление", Представление));
		
	Если НЕ ЗначениеЗаполнено(Строка) Тогда
		нСтрока = СписокСохраненныхНастроек.Добавить();
		нСтрока.Представление = Представление;
		нСтрока.Пометка = Пометка;
	Иначе
		Строка[0].Пометка = Пометка;
	КонецЕсли;
	
	Таблицы = Новый СписокЗначений;
	
	Таблицы.Добавить("ТекущаяВерсия");
	Таблицы.Добавить("ЗамещатьСуществующиеЗаписи");
	Таблицы.Добавить("ИмяВидаРегистра");
	Таблицы.Добавить("Колонка_ПриИзмененииСоздатьДокумент");
	Таблицы.Добавить("НеСоздаватьНовыхЭлементов");
	Таблицы.Добавить("ПерваяСтрокаДанныхТабличногоДокумента");
	Таблицы.Добавить("ПередЗаписьюОбъекта");
	Таблицы.Добавить("ПослеДобавленияСтроки");
	Таблицы.Добавить("ПриЗаписиОбъекта");
	Таблицы.Добавить("ПослеЗаписиОбъекта");
	Таблицы.Добавить("РежимЗагрузки");
	Таблицы.Добавить("РучнаяНумерацияКолонокТабличногоДокумента");
	Таблицы.Добавить("СсылкаДокумента");
	Таблицы.Добавить("СсылкаИсточника");
	Таблицы.Добавить("ТабличнаяЧастьИсточника");
	Таблицы.Добавить("ТипОбъектаСправочника");
	Таблицы.Добавить("РегистрДокумента");
	Таблицы.Добавить("ТаблицыНастроек");
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Таблицы.Добавить(КлючИЗначение.Значение);	
	КонецЦикла;
	
	СостояниеВыполнения = Новый Структура;	
	
	Для каждого Стр Из Таблицы Цикл
		СостояниеВыполнения = ВыгрузитьТаблицыВСтруктуру(Стр.Значение, СостояниеВыполнения);	
	КонецЦикла;	
	
	мСохранитьЗначение("Настройки:"+ Представление, СостояниеВыполнения, ИдентификаторОбработки);
	
КонецПроцедуры

&НаСервере
// Процедура восстанавливает настройки в базе данных.
//
// Параметры:
//	Представление - Наименование выбранной настройки под которым она сохранена в Хранилище настроек данных формы.
//
Процедура ВосстановитьНастройкиВБазе(Представление)
	
	СостояниеВыполнения = мВосстановитьЗначение("Настройки:"+ Представление, ИдентификаторОбработки);
	ВосстановитьНастройкиИзСостоянияВыполнения(СостояниеВыполнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура восстанавливает значение из Хранилища настроек данных формы.
//
// Параметы:
//	Имя - Наименование под которым объект был сохранен в хранилище настроек дынных формы.
//
Функция мВосстановитьЗначение(Имя, ИдентификаторОбработки)
	Возврат ХранилищеНастроекДанныхФорм.Загрузить(ИдентификаторОбработки, Имя);
КонецФункции

&НаСервереБезКонтекста
// Процедура сохраняет значение в Хранилище настроек данных формы.
//
// Параметры:
//	Имя - Наименование под которым будет сохранено значение,
//	Значение - Объект который требуется сохранить.
//
Процедура мСохранитьЗначение(Имя, Знач Значение, ИдентификаторОбработки)
	
	Если ТипЗнч(Значение) = Тип("ДанныеФормыКоллекция") Тогда
	
		Значение = ДанныеФормыВЗначение(Значение, Тип("ТаблицаЗначений"));
	
	КонецЕсли; 

	ХранилищеНастроекДанныхФорм.Сохранить(ИдентификаторОбработки, Имя, Значение);

КонецПроцедуры

&НаСервере
// Процедура заполняет список выбора элемента управления "ТабличнаяЧастьИсточника".
//
Процедура УстановитьСписокТабличныхЧастей()
	
	СписокВыбора = Элементы.ТабличнаяЧастьИсточника.СписокВыбора;	
	
	СписокВыбора.Очистить();
	Если СсылкаИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокДобавляемыхСтраниц.Очистить();
	Для каждого ТабличнаяЧасть Из СсылкаИсточника.Метаданные().ТабличныеЧасти Цикл
		СписокВыбора.Добавить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Представление());
		СписокДобавляемыхСтраниц.Добавить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Представление());
	КонецЦикла;
	Если НЕ ПустаяСтрока(ТабличнаяЧастьИсточника) И СписокВыбора.НайтиПоЗначению(ТабличнаяЧастьИсточника) = Неопределено Тогда
		ТабличнаяЧастьИсточника = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура заполняет список выбора элемента управления "РегистрДокумента".
//
Процедура УстановитьСписокРегистров()
	
	Если РежимЗагрузки = 3 Тогда
		ИмяОбъекта = "СсылкаДокумента";
	ИначеЕсли РежимЗагрузки = 5 Тогда
		ИмяОбъекта = "СсылкаИсточника";
	Иначе
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.РегистрДокумента.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если РежимЗагрузки = 3 и СсылкаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокДобавляемыхСтраницРегистры.Очистить();
	Если мЭтоДокумент(ЭтаФорма[ИмяОбъекта]) Тогда
		Для каждого Движение Из ЭтаФорма[ИмяОбъекта].Метаданные().Движения Цикл
			СписокВыбора.Добавить(Движение.Имя, Движение.Представление());
			СписокДобавляемыхСтраницРегистры.Добавить(Движение.Имя, Движение.Представление());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура формирует структуру колонок загружаемых реквизитов из табличной части "ТаблицаЗагружаемыхРеквизитов".
//
// Параметры:
//  нет.
//
Процедура СформироватьСтруктуруКолонок(ПолучаемаяТаблица = Неопределено)
	
	НомерКолонки = 1;
	Колонки = Новый Структура;
	
	Если ЗначениеЗаполнено(ПолучаемаяТаблица) Тогда
		СформироватьСтруктуруКолонокТаблицы(Колонки, ПолучаемаяТаблица, НомерКолонки);
	Иначе
		Для каждого Таблица Из ТаблицыНастроек Цикл
			СформироватьСтруктуруКолонокТаблицы(Колонки, Таблица.Значение, НомерКолонки);	
		КонецЦикла;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("Колонки", Колонки);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруКолонокТаблицы(Колонки, ПолучаемаяТаблица, НомерКолонки)
	
	ТЗ = РеквизитФормыВЗначение(ПолучаемаяТаблица);
	ВремКолонки = ТЗ.СкопироватьКолонки();
	Для каждого ЗагружаемыйРеквизит Из ТЗ Цикл
		Колонка = Новый Структура;
		Для каждого КолонкаЗагружаемыхРеквизитов Из ВремКолонки.Колонки Цикл
			Если Не РучнаяНумерацияКолонокТабличногоДокумента И КолонкаЗагружаемыхРеквизитов.Имя = "НомерКолонки" Тогда
				Если ЗагружаемыйРеквизит.Пометка Тогда
					Колонка.Вставить("НомерКолонки",НомерКолонки);
					НомерКолонки = НомерКолонки + 1;
				Иначе
					Колонка.Вставить("НомерКолонки",0);
				КонецЕсли;
			Иначе
				Колонка.Вставить(КолонкаЗагружаемыхРеквизитов.Имя,ЗагружаемыйРеквизит[КолонкаЗагружаемыхРеквизитов.Имя]);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПолучаемаяТаблица = "ТаблицаЗагружаемыхРеквизитов" Тогда
			Колонки.Вставить(Колонка.ИмяРеквизита,Колонка);
		Иначе
			Колонки.Вставить(ПолучаемаяТаблица + Колонка.ИмяРеквизита,Колонка);
		КонецЕсли;			
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура создает колонки Таблицы подготовленных даннных и добавляет их на форму.
//
Процедура СформироватьКолонкиТаблицыПодготовленныхДанных()
	
	ОчиститьТаблицуПодготовленныхДанных();
	
	Для каждого Таблица Из ТаблицыНастроек Цикл
		МассивДобавляемыхРеквизитов = Новый Массив;
		
		ТЗ = РеквизитФормыВЗначение(Таблица.Значение);
		Для каждого ЗагружаемыйРеквизит Из ТЗ Цикл
			Если ЗагружаемыйРеквизит.Пометка Тогда
				Если Таблица.Значение = "ТаблицаЗагружаемыхРеквизитов" Тогда
					ИмяРеквизита = ЗагружаемыйРеквизит.ИмяРеквизита;	
				Иначе
					ИмяРеквизита = Таблица.Значение + ЗагружаемыйРеквизит.ИмяРеквизита;
				КонецЕсли;
			
				нРеквизит = Новый РеквизитФормы(ИмяРеквизита, ЗагружаемыйРеквизит.ОписаниеТипов, "ТаблицаПодготовленныхДанных",ЗагружаемыйРеквизит.ПредставлениеРеквизита);
				МассивДобавляемыхРеквизитов.Добавить(нРеквизит);
			КонецЕсли;	
		КонецЦикла;
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		Группа = Элементы.Добавить("ПД_Группа" + Таблица.Значение, Тип("ГруппаФормы"), Элементы.ТаблицаПодготовленныхДанных);
		Группа.Вид = ВидГруппыФормы.ГруппаКолонок;
		
		Группа.Заголовок = Таблица.Заголовок;
		Группа.Группировка = ГруппировкаКолонок.Горизонтальная;
		Группа.ОтображатьВШапке = Истина;
		
		Для каждого Реквизит Из МассивДобавляемыхРеквизитов Цикл
			НовыйЭлемент = Элементы.Добавить("ТаблицаПодготовленныхДанных" + Реквизит.Имя, Тип("ПолеФормы"), Группа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТаблицаПодготовленныхДанных." + Реквизит.Имя;	
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
// Процедура очищает таблицу подготовленных данных.
//
Процедура ОчиститьТаблицуПодготовленныхДанных()
	
	МассивРеквизитовУдалить = Новый Массив;
	
	Реквизиты = ПолучитьРеквизиты("ТаблицаПодготовленныхДанных");
		
	Если Реквизиты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для каждого Реквизит Из Реквизиты  Цикл
		МассивРеквизитовУдалить.Добавить("ТаблицаПодготовленныхДанных." + Реквизит.Имя);
		Элементы.Удалить(Элементы["ТаблицаПодготовленныхДанных" + Реквизит.Имя]);
	КонецЦикла;
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Элементы.Удалить(Элементы["ПД_Группа" + КлючИЗначение.Значение]);
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивРеквизитовУдалить);
	
	Элементы.Загрузить.Видимость = Ложь;
	Элементы.КонтрольЗаполнения.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаСервере
// Процедура формирует шапку табличного документа, в соответствии с таблицей загружаемых реквизитов.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент, у которого необходимо сформировать шапку.
//
Процедура СформироватьШапкуТабличногоДокумента(ТабличныйДокумент)
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаЗагружаемыхРеквизитов");
	
	Таблица = ТЗ.Скопировать();
	Таблица.Сортировать("НомерКолонки");
	
	Колонки = ДополнительныеСвойства.Колонки;
	
	Для каждого КлючИЗначение Из Колонки Цикл
		ЗагружаемыйРеквизит = КлючИЗначение.Значение;
		НомерКолонки = ЗагружаемыйРеквизит.НомерКолонки;
		Если Не ЗагружаемыйРеквизит.Пометка Или НомерКолонки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗагружаемыйРеквизит.ШиринаКолонки = 0 Тогда
			
			ШиринаКолонки = 40;
			Если ЗагружаемыйРеквизит.ОписаниеТипов.Типы().Количество() = 1 Тогда
				ПервыйТип = ЗагружаемыйРеквизит.ОписаниеТипов.Типы()[0];
				Если ПервыйТип = Тип("Строка") Тогда
					Если ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина = 0 Тогда
						ШиринаКолонки = 80;
					Иначе
						ШиринаКолонки = Мин(Макс(ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина,10),80);
					КонецЕсли;
				ИначеЕсли ПервыйТип = Тип("Число") Тогда
					ШиринаКолонки = Макс(ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.Разрядность,10);
				ИначеЕсли ПервыйТип = Тип("Булево") Тогда
					ШиринаКолонки = 10;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ШиринаКолонки = ЗагружаемыйРеквизит.ШиринаКолонки;
		КонецЕсли;
		
		
		Область = ТабличныйДокумент.Область("R1C"+НомерКолонки);
		БылТекст = Не ПустаяСтрока(Область.Текст);
		Область.Текст       = ?(БылТекст,Область.Текст + Символы.ПС,"") + ЗагружаемыйРеквизит.ПредставлениеРеквизита;
		Область.Расшифровка = ЗагружаемыйРеквизит.ИмяРеквизита;
		Область.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
		Область.Обвести(Линия, Линия, Линия, Линия);
		
		ОбластьКолонки = ТабличныйДокумент.Область("C"+НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = ?(БылТекст,Макс(ОбластьКолонки.ШиринаКолонки,ШиринаКолонки),ШиринаКолонки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция возвращает метаданные источника данных
//
// Параметры:
//  ТребуютсяМетаданныеШапки - если требуется получить метаданные не табличной части, а шапки документа,
//  Справочник - Справочник, метаданные которого нужно получить, при загрузки подчиненных справочников.
//
// Возвращаемое значение:
//  Объект метаданных.
//
Функция ПолучитьМетаданныеИсточника(ОбъектЗагрузки = Неопределено, ЭтоРегистр = Ложь, ТекРежимЗагрузки = Неопределено)
	
	Если ТекРежимЗагрузки = Неопределено Тогда
		ТекРежимЗагрузки = РежимЗагрузки;	
	КонецЕсли;
	
	Если ТекРежимЗагрузки = 0 Тогда
		Если ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
			Возврат Метаданные.Справочники[ОбъектЗагрузки];
		ИначеЕсли НЕ ПустаяСтрока(ТипОбъектаСправочника) Тогда
			Возврат Метаданные.Справочники[ТипОбъектаСправочника];
		КонецЕсли; 
	ИначеЕсли ТекРежимЗагрузки = 1 Тогда
		Если ЗначениеЗаполнено(СсылкаИсточника) Тогда
			Если ЗначениеЗаполнено(ОбъектЗагрузки) Тогда 
				Возврат СсылкаИсточника.Метаданные().ТабличныеЧасти.Найти(ОбъектЗагрузки);	
			ИначеЕсли ЗначениеЗаполнено(ТабличнаяЧастьИсточника) Тогда
				Возврат СсылкаИсточника.Метаданные().ТабличныеЧасти.Найти(ТабличнаяЧастьИсточника);
			КонецЕсли;
		КонецЕсли; 
	ИначеЕсли ТекРежимЗагрузки = 2 Тогда
		Если Не ПустаяСтрока(ИмяВидаРегистра) Тогда
			Возврат Метаданные.РегистрыСведений[ИмяВидаРегистра];
		КонецЕсли; 
	ИначеЕсли ТекРежимЗагрузки = 3 ИЛИ ТекРежимЗагрузки = 4 Тогда
		
		Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
			Если ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
				ИмяВозвращаемогоРегистра = ОбъектЗагрузки;	
			Иначе
				ИмяВозвращаемогоРегистра = РегистрДокумента;	
			КонецЕсли;		
			Для каждого Движение Из СсылкаДокумента.Метаданные().Движения Цикл
				Если Движение.Имя = ИмяВозвращаемогоРегистра Тогда
					Возврат Движение;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТекРежимЗагрузки = 5 Тогда
		
		Если СсылкаИсточника <> Неопределено Тогда
			Если ЗначениеЗаполнено(ОбъектЗагрузки) И ЭтоРегистр Тогда
				Для каждого Движение Из СсылкаИсточника.Метаданные().Движения Цикл
				Если Движение.Имя = ОбъектЗагрузки Тогда
					Возврат Движение;
				КонецЕсли; 
			КонецЦикла;	
			ИначеЕсли ЗначениеЗаполнено(ОбъектЗагрузки) Тогда 
				Возврат СсылкаИсточника.Метаданные().ТабличныеЧасти.Найти(ОбъектЗагрузки);
			Иначе
				Возврат СсылкаИсточника.Метаданные();
			КонецЕсли;		
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
// Проверяет наличие выбранных метаданных.
//
Функция ЕстьВыбранныеМетаданные()

	Возврат Не ПолучитьМетаданныеИсточника() = Неопределено;

КонецФункции

&НаСервере
Функция ПолучитьТекстВопросаИсточника()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника();
	
	Ошибка = "";
	ТекстВопросаИсточника = "";
	
	Если РежимЗагрузки = 0 Тогда
		ТекстВопросаИсточника = " элементов в справочник: """ + МетаданныеИсточника.Представление() + """";
		
	ИначеЕсли РежимЗагрузки = 1 Тогда
		
		Если СсылкаИсточника.Пустая() Тогда
			Ошибка = "Не выбрана ссылка";
		Иначе
			ОбъектИсточника = СсылкаИсточника.ПолучитьОбъект();
			ТекстВопросаИсточника = " строк в табличную часть: """ + МетаданныеИсточника.Представление() + """";
		КонецЕсли;
		
	ИначеЕсли РежимЗагрузки = 2 Тогда
		
		ТекстВопросаИсточника = " записей в регистр сведений: """ + МетаданныеИсточника.Представление() + """";
		
	КонецЕсли;
	
	Возврат Новый Структура("Ошибка, ТекстВопроса", Ошибка, ТекстВопросаИсточника);
	
КонецФункции

&НаСервере
// Основная функция загрузки данных.
//
Функция ЗагрузитьДанныеСервер(ИмяОбъекта = Неопределено, ИмяТЗ = Неопределено, ТекРежимЗагрузки = Неопределено)

	Если ТекРежимЗагрузки = Неопределено Тогда
		ТекРежимЗагрузки = РежимЗагрузки;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяТЗ) Тогда
		ИмяТЗ = "ТаблицаЗагружаемыхРеквизитов";		
	КонецЕсли;
	
	ТабДанные = РеквизитФормыВЗначение("ТаблицаПодготовленныхДанных");
	ТаблицаРеквизитов = РеквизитФормыВЗначение(ИмяТЗ);

	ЗаписыватьОбъект = истина;
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(ИмяОбъекта,,ТекРежимЗагрузки);
	
	Если ТекРежимЗагрузки = 0 Тогда
		Источник = Справочники[ТипОбъектаСправочника].ПустаяСсылка();
	ИначеЕсли ТекРежимЗагрузки = 1 Тогда
		ОбъектИсточника = СсылкаИсточника.ПолучитьОбъект();
		Источник = ОбъектИсточника[ТабличнаяЧастьИсточника];
	ИначеЕсли ТекРежимЗагрузки = 3 Тогда		
		Если СсылкаДокумента.Пустая() Тогда
			ТекстСообщения = НСтр("ru = 'Не выбран документ'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли; 
		ОбъектИсточника = СсылкаДокумента.ПолучитьОбъект(); 
		Источник = ПолучитьИзВременногоХранилища(АдресХранилищаДвиженияРегистра);
	ИначеЕсли ТекРежимЗагрузки = 5 Тогда
		Если НЕ ЗначениеЗаполнено(Колонка_ПриИзмененииСоздатьДокумент) Тогда
			ТекстСообщения = НСтр("ru = 'Не выбрана колонка при изменении которой будут создаваться новые объекты!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
		
		ТабДанные.Сортировать(Колонка_ПриИзмененииСоздатьДокумент);

		ЭтоДокумент = мЭтоДокумент(СсылкаИсточника);
		
		Если ЭтоДокумент Тогда
			ОбъектИсточника = Документы[МетаданныеИсточника.Имя].СоздатьДокумент();
		Иначе
			ОбъектИсточника = Справочники[МетаданныеИсточника.Имя].СоздатьЭлемент();
		КонецЕсли;
		
		ТекстВопросаИсточника = " строк в документы: """ + МетаданныеИсточника.Родитель().Представление() + """";
	КонецЕсли;
	
	ТекстВопросаИсточника = ПолучитьТекстВопросаИсточника().ТекстВопроса;
	
	Запрос = Неопределено;
	Если ТекРежимЗагрузки = 0 Тогда
		
		СтрокиПоиска = ЭтаФорма[ИмяТЗ].НайтиСтроки(Новый Структура("ПолеПоиска,Пометка",Истина,Истина));
		Если Не СтрокиПоиска.Количество() = 0 Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|Справочник.Ссылка КАК Ссылка
			|ИЗ Справочник."+МетаданныеИсточника.Имя+" КАК Справочник
			|Где";
			
			Для каждого СтрокаПоиска Из СтрокиПоиска Цикл
				ТекстЗапроса = ТекстЗапроса +"
				|Справочник."+СтрокаПоиска.ИмяРеквизита+" = &" + СтрокаПоиска.ИмяРеквизита + "
				|И";
				
			КонецЦикла;
			
			ТекстЗапроса = Лев(ТекстЗапроса,СтрДлина(ТекстЗапроса) - 2);
			Запрос = Новый Запрос (ТекстЗапроса);
		КонецЕсли;
	ИначеЕсли ТекРежимЗагрузки = 1 ИЛИ ТекРежимЗагрузки = 3 Тогда
		Источник.Очистить();	
	ИначеЕсли ТекРежимЗагрузки = 2 Тогда		
		
		ИзмеренияРегистра = Новый Структура;
		Для каждого Реквизит Из ТаблицаРеквизитов Цикл
			Если Реквизит.МожетБытьПолемПоиска Тогда
				ИзмеренияРегистра.Вставить(Реквизит.ИмяРеквизита, Реквизит.ОписаниеТипов);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Очищаем источники у дополнительный табличный частей и движений.	
	нСтруктура = Новый Структура("ДопНастройки, ЗагружаетсяДоОбъекта", Истина, Ложь);
	ТЗ_ДопНастроек = ТаблицыНастроек.Выгрузить(нСтруктура);
	Для каждого Строка Из ТЗ_ДопНастроек Цикл
		Если ТекРежимЗагрузки = 1 Тогда
			ДопИсточник = ОбъектИсточника[Строка.Справочник];
			ДопИсточник.Очистить();
		ИначеЕсли ТекРежимЗагрузки = 3 Тогда		
			ДопИсточник = ОбъектИсточника.Движения[Строка.Справочник];
			ДопИсточник.Очистить();
			ДопИсточник.Записывать = Истина;
		КонецЕсли;				
	КонецЦикла;	
	
	// Получаем таблицу объектов загружаемых до основного объекта.
	нСтруктура = Новый Структура("ЗагружаетсяДоОбъекта", Истина);
	ТЗ_ЗагружаетсяДоОбъекта = ТаблицыНастроек.Выгрузить(нСтруктура);
	
	КоличествоЭлементов = ТабДанные.Количество();
	
	ТекстСообщения = НСтр("ru = 'Выполняется загрузка %1
							|Всего: %2
							|---------------------------------------------'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстВопросаИсточника, КоличествоЭлементов);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	Загружено = 0;
	ПредыдущееЗначениеПриИзмененииДляНовогоДокумента = "";
	
	НомерТекущейСтроки = 1;
		
	Для каждого ЗагружаемаяСтрока Из ТабДанные Цикл
		ТекстыЯчеек = Неопределено;
		Отказ = Ложь;
		
		Для Каждого сСтрока из ТЗ_ЗагружаетсяДоОбъекта Цикл
			
			сСтрока.ОбъектСсылка = ЗагрузитьВСправочник(ЗагружаемаяСтрока, ТекстыЯчеек, сСтрока.Справочник, , сСтрока.Значение, ТЗ_ЗагружаетсяДоОбъекта);			
			
		КонецЦикла;
		
		ТекущаяСтрока = Новый Структура;
		
		Для Каждого сСтрока из ЭтаФорма[ИмяТЗ] Цикл
			
			Если ЗначениеЗаполнено(сСтрока.НастройкаЗагрузки) Тогда
				
				стр = Новый Структура("Значение", сСтрока.НастройкаЗагрузки);
				СтрокаНастроек = ТЗ_ЗагружаетсяДоОбъекта.НайтиСтроки(стр);
				Если СтрокаНастроек.Количество() <> 0 Тогда
					
					Если ЗначениеЗаполнено(СтрокаНастроек[0].ОбъектСсылка) Тогда
						ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, СтрокаНастроек[0].ОбъектСсылка);	
					Иначе
						ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, ЗагружаемаяСтрока[сСтрока.ИмяРеквизита]);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли сСтрока.Пометка Тогда
				
				ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, ЗагружаемаяСтрока[сСтрока.ИмяРеквизита]);
				
			КонецЕсли;
			
		КонецЦикла;
			
		Если ТекРежимЗагрузки = 5 Тогда
			
			ТекущееЗначениеПриИзмененииДляНовогоДокумента = ЗагружаемаяСтрока[Колонка_ПриИзмененииСоздатьДокумент];
			
			Если ПредыдущееЗначениеПриИзмененииДляНовогоДокумента <> ТекущееЗначениеПриИзмененииДляНовогоДокумента Тогда
				Если НомерТекущейСтроки <> 1 Тогда
					Если ЗаписыватьОбъект и ЗаписатьОбъект(ОбъектИсточника, ТекстыЯчеек, ПередЗаписьюОбъекта, ПриЗаписиОбъекта) Тогда
						
						ТекстСообщения = НСтр("ru = 'Выполнена загрузка %1 %2'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстВопросаИсточника, ОбъектИсточника);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						
						ТекстСообщения = НСтр("ru = %1 из %2 элементов.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, Загружено, КоличествоЭлементов);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Иначе
						ТекстСообщения = НСтр("ru = 'Объект не записан: %1.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, Объект);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						ЗаписыватьОбъект = Истина;
					КонецЕсли;
				КонецЕсли;
				
				ПредыдущееЗначениеПриИзмененииДляНовогоДокумента = ЗагружаемаяСтрока[Колонка_ПриИзмененииСоздатьДокумент];
			
				ОбъектИсточника = НайтиСоздатьДокументПриПоточнойЗагрузке(МетаданныеИсточника, ТекущаяСтрока, ЭтоДокумент, ИмяТЗ);
				
				Для каждого Строка Из ТЗ_ДопНастроек Цикл
					Если Строка.ЭтоРегистр Тогда
						ДопИсточник = ОбъектИсточника.Движения[Строка.Справочник];
						ДопИсточник.Записывать = Истина;
					Иначе
						ДопИсточник = ОбъектИсточника[Строка.Справочник];		
					КонецЕсли;
					ДопИсточник.Очистить();
				КонецЦикла;
				
				Если Не Отказ Тогда
					ТекстСообщения = НСтр("ru = 'Создан новый документ '");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ТекстСообщения = НСтр("ru = 'При создании нового документа возникли ошибки. '");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					ЗаписыватьОбъект = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекРежимЗагрузки = 0 Тогда
			
			ЗагружаемыйОбъект = Неопределено;
			Если Не Запрос = Неопределено Тогда
				СтрокаОшибок = "";
				Для каждого СтрокаПоиска Из СтрокиПоиска Цикл
					
					ЗначениеРеквизита = Неопределено;
					
					ТекущаяСтрока.Свойство(СтрокаПоиска.ИмяРеквизита,ЗначениеРеквизита);
					Если ПустаяСтрока(ЗначениеРеквизита) Тогда
						СтрокаОшибок = ?(ПустаяСтрока(СтрокаОшибок),"",СтрокаОшибок + ", ") + СтрокаПоиска.ПредставлениеРеквизита;
					Иначе
						Запрос.УстановитьПараметр(СтрокаПоиска.ИмяРеквизита,ТекущаяСтрока[СтрокаПоиска.ИмяРеквизита]);
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ПустаяСтрока(СтрокаОшибок) Тогда
					ТекстСообщения = НСтр("ru = 'Строка %1 не может быть записана.Не указано значение ключевых реквизитов: %2'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, НомерТекущейСтроки, СтрокаОшибок);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Продолжить;
				КонецЕсли;
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ЗагружаемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
				КонецЕсли;
				
			КонецЕсли;
			
			ОбъектНайден = Не ЗагружаемыйОбъект = Неопределено;
			Если Не ОбъектНайден Тогда
				Если НеСоздаватьНовыхЭлементов Тогда
					Продолжить;
				Иначе
					ЗагружаемыйОбъект = Справочники[МетаданныеИсточника.Имя].СоздатьЭлемент();
				КонецЕсли;		
			КонецЕсли;
			Если ОбъектНайден и ЗамещатьСуществующиеЗаписи Тогда     
                ОбъектНайден = Ложь;
            КонецЕсли;
		ИначеЕсли ТекРежимЗагрузки = 1 Тогда
			ЗагружаемыйОбъект = Источник.Добавить();
			ОбъектНайден = Ложь;
		ИначеЕсли ТекРежимЗагрузки = 2 Тогда
			ЗагружаемыйОбъект = РегистрыСведений[МетаданныеИсточника.Имя].СоздатьМенеджерЗаписи();
			Для каждого КлючИЗначение Из ТекущаяСтрока Цикл
				
				Если ИзмеренияРегистра.Свойство(КлючИЗначение.Ключ) Тогда
					ЗагружаемыйОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗамещатьСуществующиеЗаписи Тогда
				ЗагружаемыйОбъект.Прочитать();
				ОбъектНайден = ЗагружаемыйОбъект.Выбран();
			Иначе
				ОбъектНайден = Ложь;
			КонецЕсли;
			
		ИначеЕсли ТекРежимЗагрузки = 3 ИЛИ ТекРежимЗагрузки = 4 Тогда
			
			ЗагружаемыйОбъект = Источник.Добавить();
			ОбъектНайден = Ложь;
			
		ИначеЕсли ТекРежимЗагрузки = 5 Тогда
			Если ЗначениеЗаполнено(ТабличнаяЧастьИсточника) Тогда
				ЗагружаемыйОбъект = ОбъектИсточника[ТабличнаяЧастьИсточника].Добавить(); 	
			Иначе
				ЗагружаемыйОбъект = ОбъектИсточника;
			КонецЕсли;
			ОбъектНайден = Ложь;
			
		КонецЕсли;
		
		// Заполняем данными объект из строки загрузки.
		Если Не ОбъектНайден  Тогда
			
			Попытка
				ЗаполнитьЗначенияСвойств(ЗагружаемыйОбъект, ТекущаяСтрока);
			Исключение
				мСообщитьОбОшибке("Ошибка при установки значений реквизитов " + ОписаниеОшибки());
			    Отказ = Истина;
			КонецПопытки;
			
		КонецЕсли;
		
		// Загружаем данные по дополнительным таблицам настроек.
		СписокПодчиненныхСправочников = Новый СписокЗначений;		
		Для каждого Строка Из ТЗ_ДопНастроек Цикл
			
			Если ТекРежимЗагрузки = 0 Тогда
				
				РезультатЗагрузкиСправочника = ЗагрузитьВСправочник(ЗагружаемаяСтрока, ТекстыЯчеек, Строка.Справочник, ЗагружаемыйОбъект.Ссылка, Строка.Значение, ТЗ_ЗагружаетсяДоОбъекта);	
				СписокПодчиненныхСправочников.Добавить(РезультатЗагрузкиСправочника);
			
			ИначеЕсли (ТекРежимЗагрузки = 1 ИЛИ ТекРежимЗагрузки = 3 ИЛИ ТекРежимЗагрузки = 5) И НЕ Строка.ЗагружаетсяДоОбъекта Тогда
				
				ЗагрузитьДанныеВДполнительнуюТЧИлиРегистр(ОбъектИсточника, ЗагружаемаяСтрока, ТекстыЯчеек, Строка.Справочник, Строка.Значение, Строка.ЭтоРегистр, ТЗ_ЗагружаетсяДоОбъекта);					
				
			КонецЕсли;
			
		КонецЦикла;

		
		Если ТекРежимЗагрузки = 0 Тогда
			Если Не Отказ и ЗаписатьОбъект(ЗагружаемыйОбъект, ТекстыЯчеек, ПередЗаписьюОбъекта, ПриЗаписиОбъекта) Тогда
				ТекстСообщения = НСтр("ru = '%1 элемент справочника: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ?(ОбъектНайден,"Изменен","Загружен"), ЗагружаемыйОбъект.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Загружено = Загружено + 1;
			Иначе
				ТекстСообщения = НСтр("ru = 'Объект не %1. Элемент справочника: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ?(ОбъектНайден,"изменен","загружен"), ЗагружаемыйОбъект);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			ОбработатьСобытиеПослеЗаписиОбъекта(ЗагружаемыйОбъект, СписокПодчиненныхСправочников, ПослеЗаписиОбъекта);
		ИначеЕсли ТекРежимЗагрузки = 1 Тогда
			
			Если Не ОбработатьСобытиеПослеДобавленияСтроки(ОбъектИсточника, ЗагружаемыйОбъект, ТекстыЯчеек, ПослеДобавленияСтроки) Тогда
				Отказ = Истина;
			КонецЕсли;
			
			Если Не Отказ Тогда
				ТекстСообщения = НСтр("ru = 'Добавлена строка: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, (Загружено + 1));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ТекстСообщения = НСтр("ru = 'При добавлении строки %1 возникли ошибки. '");
				ТекстСообщения = СтрШаблон(ТекстСообщения, (Загружено + 1));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ЗаписыватьОбъект = Ложь;
			КонецЕсли;
			
			Загружено = Загружено + 1;
			
		ИначеЕсли ТекРежимЗагрузки = 2 Тогда
			Если Не Отказ и ЗаписатьОбъект(ЗагружаемыйОбъект, ТекстыЯчеек, ПередЗаписьюОбъекта, ПриЗаписиОбъекта) Тогда
				ТекстСообщения = НСтр("ru = '%1 запись № %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ?(ОбъектНайден,"Изменена","Добавлена"), НомерТекущейСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Загружено = Загружено + 1;
			Иначе
				ТекстСообщения = НСтр("ru = 'Запись не %1. № записи: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ?(ОбъектНайден,"изменена","загружена"), НомерТекущейСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		ИначеЕсли ТекРежимЗагрузки = 3 Тогда
			
			Если Не ОбработатьСобытиеПослеДобавленияСтроки(ОбъектИсточника, ЗагружаемыйОбъект, ТекстыЯчеек, ПослеДобавленияСтроки) Тогда
				Отказ = Истина;
			КонецЕсли;
			
			Если Не Отказ Тогда
				ТекстСообщения = НСтр("ru = 'Добавлена проводка: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, (Загружено + 1));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				ЗагружаемыйОбъект.Активность  = Истина;
				ЗагружаемыйОбъект.Регистратор = ОбъектИсточника;
				ЗагружаемыйОбъект.Период 	   = ОбъектИсточника.Дата;
				ЗагружаемыйОбъект.НомерСтроки = Загружено+1;
				ЗагружаемыйОбъект.МоментВремени = ОбъектИсточника.МоментВремени();
			Иначе
				ТекстСообщения = НСтр("ru = 'При добавлении проводки %1 возникли ошибки. '");
				ТекстСообщения = СтрШаблон(ТекстСообщения, (Загружено + 1));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ЗаписыватьОбъект = Ложь;
			КонецЕсли;
			
			Загружено = Загружено + 1;
			
		ИначеЕсли ТекРежимЗагрузки = 5 Тогда
			
			Если Не ОбработатьСобытиеПослеДобавленияСтроки(ОбъектИсточника, ЗагружаемыйОбъект, ТекстыЯчеек, ПослеДобавленияСтроки) Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
	КонецЦикла;
	ТекстСообщения = НСтр("ru = '---------------------------------------------'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	Если ТекРежимЗагрузки = 1  Тогда
		Если ЗаписыватьОбъект и ЗаписатьОбъект(ОбъектИсточника, "", ПередЗаписьюОбъекта, ПриЗаписиОбъекта) Тогда
			
			ТекстСообщения = НСтр("ru = 'Выполнена загрузка %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстВопросаИсточника);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ТекстСообщения = НСтр("ru = '%1 из %2 элементов.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Загружено, КоличествоЭлементов);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Истина;
		Иначе
			ТекстСообщения = НСтр("ru = 'Объект не записан: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗагружаемыйОбъект);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТекРежимЗагрузки = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Выполнена загрузка %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстВопросаИсточника);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ТекстСообщения = НСтр("ru = '%1 из %2 элементов.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Загружено, КоличествоЭлементов);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Истина;
	ИначеЕсли ТекРежимЗагрузки = 2 Тогда
		ТекстСообщения = НСтр("ru = 'Выполнена загрузка %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстВопросаИсточника);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ТекстСообщения = НСтр("ru = '%1 из %2 записей.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Загружено, КоличествоЭлементов);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Истина;
	ИначеЕсли ТекРежимЗагрузки = 3 Тогда
		
		ОбъектИсточника.Движения[РегистрДокумента].Записывать = Истина;
		ОбъектИсточника.Движения[РегистрДокумента].Загрузить(Источник);
		
		Если ЗаписыватьОбъект и ЗаписатьОбъект(ОбъектИсточника, "", ПередЗаписьюОбъекта, ПриЗаписиОбъекта) Тогда
			
			ТекстСообщения = НСтр("ru = 'Выполнена загрузка %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстВопросаИсточника);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ТекстСообщения = НСтр("ru = '%1 из %2 проводок.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Загружено, КоличествоЭлементов);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Истина;
		Иначе
			ТекстСообщения = НСтр("ru = 'Объект не записан: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Объект);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТекРежимЗагрузки = 5 Тогда 
		Если ЗаписыватьОбъект и ЗаписатьОбъект(ОбъектИсточника, ТекстыЯчеек, ПередЗаписьюОбъекта, ПриЗаписиОбъекта) Тогда
			
			ТекстСообщения = НСтр("ru = 'Выполнена загрузка %1 %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстВопросаИсточника, ОбъектИсточника);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ТекстСообщения = НСтр("ru = '%1 из %2 элементов.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Загружено, КоличествоЭлементов);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ТекстСообщения = НСтр("ru = 'Объект не записан: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Объект);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ЗаписыватьОбъект = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецФункции

&НаСервере
// Функция загрузки подчиненных справочников.
//
// Параметры:
// 	ЗагружаемаяСтрока - строка таблицы подготовленных данных,
// 	ТекстыЯчеек - Строка табличного документа,
//	Справочник - наименование метаданных загружаемого подчиненного справочника,
//	Владелец - Владелец загружаемого подчиненного справочника,
//	ТаблицаНастроек - Наименование таблицы значений с настройками загрузки.
//
Функция ЗагрузитьВСправочник(ЗагружаемаяСтрока, ТекстыЯчеек, Справочник, Владелец = Неопределено, ТаблицаНастроек, ТЗ_ЗагружаетсяДоОбъекта)

	МетаданныеИсточника = ПолучитьМетаданныеИсточника(Справочник, , 0);
	
	Источник = Справочники[Справочник].ПустаяСсылка();
		
	Запрос = Неопределено;
		
	СтрокиПоиска = ЭтаФорма[ТаблицаНастроек].НайтиСтроки(Новый Структура("ПолеПоиска,Пометка",Истина,Истина));
	
	Если Не СтрокиПоиска.Количество() = 0 Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1           
		|Справочник.Ссылка КАК Ссылка
		|ИЗ Справочник."+МетаданныеИсточника.Имя+" КАК Справочник
		|Где";
		
		Для каждого СтрокаПоиска Из СтрокиПоиска Цикл
			ТекстЗапроса = ТекстЗапроса +"
			|Справочник."+СтрокаПоиска.ИмяРеквизита+" = &" + СтрокаПоиска.ИмяРеквизита + "
			|И";
			
		КонецЦикла;
		
		Если Владелец <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса +"
				|Справочник.Владелец = &Владелец
				|И";
		КонецЕсли;
		
		ТекстЗапроса = Лев(ТекстЗапроса,СтрДлина(ТекстЗапроса) - 2);
		Запрос = Новый Запрос (ТекстЗапроса);
	КонецЕсли;
	
	ТекущаяСтрока = Новый Структура;
	Для Каждого сСтрока из ЭтаФорма[ТаблицаНастроек] Цикл
		
		Если ЗначениеЗаполнено(сСтрока.НастройкаЗагрузки) Тогда
			
			стр = Новый Структура("Значение", сСтрока.НастройкаЗагрузки);
			СтрокаНастроек = ТЗ_ЗагружаетсяДоОбъекта.НайтиСтроки(стр);
			Если СтрокаНастроек.Количество() <> 0 Тогда
				
				Если ЗначениеЗаполнено(СтрокаНастроек[0].ОбъектСсылка) Тогда
					ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, СтрокаНастроек[0].ОбъектСсылка);	
				Иначе
					ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, ЗагружаемаяСтрока[ТаблицаНастроек + сСтрока.ИмяРеквизита]);	
				КонецЕсли;
			КонецЕсли;
		
		ИначеЕсли сСтрока.Пометка Тогда
			
			ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, ЗагружаемаяСтрока[ТаблицаНастроек + сСтрока.ИмяРеквизита]);	
			
		КонецЕсли;
		
	КонецЦикла;
			
	ЗагружаемыйОбъект = Неопределено;
	Если Не Запрос = Неопределено Тогда
		СтрокаОшибок = "";
		Для каждого СтрокаПоиска Из СтрокиПоиска Цикл
			
			ЗначениеРеквизита = Неопределено;
			
			ТекущаяСтрока.Свойство(СтрокаПоиска.ИмяРеквизита,ЗначениеРеквизита);
			Если ПустаяСтрока(ЗначениеРеквизита) Тогда
				СтрокаОшибок = ?(ПустаяСтрока(СтрокаОшибок),"",СтрокаОшибок + ", ") + СтрокаПоиска.ПредставлениеРеквизита;
			Иначе
				Запрос.УстановитьПараметр(СтрокаПоиска.ИмяРеквизита,ТекущаяСтрока[СтрокаПоиска.ИмяРеквизита]);
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Владелец",Владелец);
		
		Если Не ПустаяСтрока(СтрокаОшибок) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибок);
			Возврат Неопределено;
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗагружаемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
	КонецЕсли;
	
	ОбъектНайден = Не ЗагружаемыйОбъект = Неопределено;
	Если Не ОбъектНайден Тогда
		Если НеСоздаватьНовыхЭлементов Тогда
			Возврат ЗагружаемыйОбъект.Ссылка;
		Иначе
			ЗагружаемыйОбъект = Справочники[МетаданныеИсточника.Имя].СоздатьЭлемент();
		КонецЕсли;	
	КонецЕсли;
	
	Если ОбъектНайден и ЗамещатьСуществующиеЗаписи Тогда     
		ОбъектНайден = Ложь;
	КонецЕсли;
	
	Если Не ОбъектНайден  Тогда
		Попытка
			ЗаполнитьЗначенияСвойств(ЗагружаемыйОбъект, ТекущаяСтрока);
		Исключение
			мСообщитьОбОшибке("Ошибка при установки значений реквизитов " + ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если Владелец <> Неопределено Тогда
		ЗагружаемыйОбъект.Владелец = Владелец;
	КонецЕсли;
	
	Попытка
		ЗагружаемыйОбъект.Записать();
		Возврат ЗагружаемыйОбъект.Ссылка;
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось записать: %1, %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗагружаемыйОбъект, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;	
	
КонецФункции

&НаСервере
// Функция загрузки в дополнительные табличные части и движения документа.
//
// Параметры:
// 	ОбъектИсточника - Основной объект загрузки (Объект), 
//	ЗагружаемаяСтрока - Строка загружаемых данных (Строка таблицы значений),
//	ТекстыЯчеек - Строка табличного документа,
//	ОбъектЗагрузки - Наименование табличной части или регистра в который загружаются данные (Строка),
//	ТаблицаНастроек - Таблица настроек соответствующая данному объекту загрузки (Таблица значений),
//	ЭтоРегистр - Определяет, что объект загрузки Регистр или Табличная часть (Булево).
//
Функция ЗагрузитьДанныеВДполнительнуюТЧИлиРегистр(ОбъектИсточника, ЗагружаемаяСтрока, ТекстыЯчеек, ОбъектЗагрузки, ТаблицаНастроек, ЭтоРегистр, ТЗ_ЗагружаетсяДоОбъекта)
	
	Отказ = Ложь;
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(ОбъектЗагрузки, ЭтоРегистр);
	
	Если РежимЗагрузки = 1 Тогда
		Источник = ОбъектИсточника[ОбъектЗагрузки];
	ИначеЕсли РежимЗагрузки = 3 ИЛИ ЭтоРегистр Тогда		
		Источник = ОбъектИсточника.Движения[ОбъектЗагрузки];
	ИначеЕсли РежимЗагрузки = 5 Тогда	
		Источник = ОбъектИсточника[ОбъектЗагрузки];		
	КонецЕсли;
			
	ТекущаяСтрока = Новый Структура;
	Для Каждого сСтрока из ЭтаФорма[ТаблицаНастроек] Цикл
		
		Если ЗначениеЗаполнено(сСтрока.НастройкаЗагрузки) Тогда
			
			стр = Новый Структура("Значение", сСтрока.НастройкаЗагрузки);
			СтрокаНастроек = ТЗ_ЗагружаетсяДоОбъекта.НайтиСтроки(стр);
			Если СтрокаНастроек.Количество() <> 0 Тогда
				
				Если ЗначениеЗаполнено(СтрокаНастроек[0].ОбъектСсылка) Тогда
					ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, СтрокаНастроек[0].ОбъектСсылка);	
				Иначе
					ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, ЗагружаемаяСтрока[ТаблицаНастроек + сСтрока.ИмяРеквизита]);	
				КонецЕсли;
			КонецЕсли;
		
		ИначеЕсли сСтрока.Пометка Тогда
			
			ТекущаяСтрока.Вставить(сСтрока.ИмяРеквизита, ЗагружаемаяСтрока[ТаблицаНастроек + сСтрока.ИмяРеквизита]);	
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗагружаемыйОбъект = Источник.Добавить();
	
	Попытка
		ЗаполнитьЗначенияСвойств(ЗагружаемыйОбъект, ТекущаяСтрока);
	Исключение
		мСообщитьОбОшибке("Ошибка при установки значений реквизитов " + ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
		
	Если (РежимЗагрузки = 1 ИЛИ РежимЗагрузки = 5) И Не Отказ Тогда 
		ТекстСообщения = НСтр("ru = 'Добавлена строка в табличную часть: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектЗагрузки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	ИначеЕсли РежимЗагрузки = 3 И Не Отказ Тогда		
		
		ЗагружаемыйОбъект.Активность  = Истина;
		ЗагружаемыйОбъект.Регистратор = ОбъектИсточника.Ссылка;
		ЗагружаемыйОбъект.Период 	   = ОбъектИсточника.Дата;
		
		ТекстСообщения = НСтр("ru = 'Добавлена запись в регистр: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектЗагрузки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
			
КонецФункции

&НаСервере
// Функция ищет или создает документы при поточной загрузке документов
//
// Параметры:
//	МетаданныеИсточника - Метаданные документа,
//	ТекстыЯчеек - загружаемая строка табличного документа,
//	ЭтоДокумент - Булево, отображет загружаются данные в табличную часть Документа (истина) или Справочника (ложь).
//
Функция НайтиСоздатьДокументПриПоточнойЗагрузке(МетаданныеИсточника, ТекущаяСтрока, ЭтоДокумент, ИмяТЗ)
	
	СтрокиПоиска = ЭтаФорма[ИмяТЗ].НайтиСтроки(Новый Структура("ПолеПоиска,Пометка",Истина,Истина));	
	
	Если ЭтоДокумент Тогда
		ОбъектИсточника = Документы[МетаданныеИсточника.Имя].СоздатьДокумент();
	Иначе
		ОбъектИсточника = Справочники[МетаданныеИсточника.Имя].СоздатьЭлемент();	
	КонецЕсли;
	
	Если Не СтрокиПоиска.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		
		Если ЭтоДокумент Тогда
			ТекстЗапроса =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|Документ.Ссылка КАК Ссылка
				|ИЗ Документ."+МетаданныеИсточника.Имя+" КАК Документ
				|Где";
		Иначе
			ТекстЗапроса =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|Справочник.Ссылка КАК Ссылка
				|ИЗ Справочник."+МетаданныеИсточника.Имя+" КАК Документ
				|Где";
		КонецЕсли;
		
		Для каждого СтрокаПоиска Из СтрокиПоиска Цикл
			ТекстЗапроса = ТекстЗапроса +"
				|Документ."+СтрокаПоиска.ИмяРеквизита+" = &" + СтрокаПоиска.ИмяРеквизита + "
				|И";
				
				Запрос.УстановитьПараметр(СтрокаПоиска.ИмяРеквизита, ТекущаяСтрока[СтрокаПоиска.ИмяРеквизита]);	
		КонецЦикла;
		
		Запрос.Текст = Лев(ТекстЗапроса,СтрДлина(ТекстЗапроса) - 2);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() > 0 Тогда
			ОбъектИсточника = Результат[0].Ссылка.ПолучитьОбъект();
		КонецЕсли;

	КонецЕсли;
	
	Возврат ОбъектИсточника;
	
КонецФункции

&НаСервереБезКонтекста
// Функция вычисляет значение ячейки для режима "Вычислять"
//
// Параметры:
//  Выражение		- програмный код, который необходимо выполнить,
//  ТекущиеДанные	- структура загруженных значений,
//  ТекстЯчейки		- текст текущей ячейки,
//  ТекстыЯчеек		- массив текстов ячеек строки,
//  Результат		- результат вычисления.
//
// Возвращаемое значение:
//  Структура, сордержащая Результат и ОписаниеОшибки.
Функция ВычислитьЗначениеЯчейки(Знач Выражение,Знач ТекущиеДанные,Знач ТекстЯчейки, Знач ТекстыЯчеек,Знач Результат)
	
	ТекстЯчейки = СокрЛП(ТекстЯчейки);
	ОписаниеОшибки = "";
	Попытка
		Выполнить(Выражение);
	Исключение
		мСообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Новый Структура("Результат,ОписаниеОшибки",Результат,ОписаниеОшибки);
	
КонецФункции

&НаСервереБезКонтекста
// Функция записывает объект в информационную базу данных, 
// используя события определенные пользователем в форме редактирования событий.
//
// Параметры:
//  Объект				- записываемый объект,
//  ТекстыЯчеек			- массив текстов ячеек, загружаемой строки,
//  ПередЗаписьюОбъекта	- текст события перед записью объекта,
//	ПриЗаписиОбъекта	- текст события при записи объекта.
//
// Возвращаемое значение:
//  Истина, если объект записан, Ложь - иначе.
//
Функция ЗаписатьОбъект(Объект, ТекстыЯчеек = Неопределено, ПередЗаписьюОбъекта, ПриЗаписиОбъекта)
	
	Отказ = Ложь;
	НачатьТранзакцию();
	
	Если Не ПустаяСтрока(ПередЗаписьюОбъекта) Тогда
		Попытка
			Выполнить(ПередЗаписьюОбъекта);
			Если Отказ Тогда
				ОписаниеОшибки = ""; // Установлен отказ перед записью объекта.
			КонецЕсли;
		Исключение
			Отказ = Истина;
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Если Не Отказ  Тогда
		Попытка
			Объект.Записать();
		Исключение
			Отказ = Истина;
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Если Не Отказ и Не ПустаяСтрока(ПриЗаписиОбъекта) Тогда
		
		Попытка
			Выполнить(ПриЗаписиОбъекта);
			Если Отказ Тогда
				ОписаниеОшибки = ""; // Установлен отказ при записи объекта.
			КонецЕсли;
			
		Исключение
			Отказ = Истина;
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Если Не Отказ  Тогда
			Попытка
				Объект.Записать();
			Исключение
				Отказ = Истина;
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		мСообщитьОбОшибке(ОписаниеОшибки);
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервереБезКонтекста
// Функция обрабатывает событие "После добавления строки",
// определенное пользователем в форме редактирования событий.
//
// Параметры:
//  Объект      - записываемый объект,
//  ТекущиеДанные  - структура загруженных значений,
//  ТекстыЯчеек    - массив текстов ячеек строки.
//
// Возвращаемое значение:
//  Истина, если в событие "После добавления строки" не был установлен Отказ, Ложь - иначе.
//
Функция ОбработатьСобытиеПослеДобавленияСтроки(Объект, ТекущиеДанные, ТекстыЯчеек, ПослеДобавленияСтроки)
	
	Попытка
		
		Выполнить(ПослеДобавленияСтроки);
		
	Исключение
		
		мСообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
// Функция обрабатывает событие "После добавления строки",
// определенное пользователем в форме редактирования событий.
//
// Параметры:
//  Объект      - записываемый объект,
//  ТекущиеДанные  - структура загруженных значений,
//  ТекстыЯчеек    - массив текстов ячеек строки.
//
// Возвращаемое значение:
//  Истина, если в событие "После добавления строки" не был установлен Отказ, Ложь - иначе.
//
Функция ОбработатьСобытиеПослеЗаписиОбъекта(Объект, СписокОбъектов, ПослеЗаписиОбъекта)
	
	Попытка
		
		Выполнить(ПослеЗаписиОбъекта);
		
	Исключение
		
		мСообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция выполняет контроль заполнения строки данных табличного документа
// сообщает об ошибках и устанавливает коментарии к ошибочным ячейкам.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент, у которого необходимо сформировать шапку,
//  НомерСтроки       - Число, номер строки табличного документа,
//  ТекстыЯчеек    - возвращает массив текстов ячеек строки.
//
// Возвращаемое значение:
//  структура, ключ - Имя загружаемого реквизита, Значение - Значение загружаемого реквизита.
//
Функция КонтрольЗаполненияСтроки(ТабличныйДокумент, НомерСтроки, ТекстыЯчеек = Неопределено, КоличествоОшибок = 0)
	
	ТекстыЯчеек = Новый Массив;
	ТекстыЯчеек.Добавить(Неопределено);
	Для к = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ТекстыЯчеек.Добавить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(К,"ЧГ=")).Текст));
	КонецЦикла;
	
	Колонки = ДополнительныеСвойства.Колонки;
	
	ТекущаяСтрока = Новый Структура;
	Для каждого КлючИЗначение Из Колонки Цикл
		
		Колонка = КлючИЗначение.Значение;
		
		Если Колонка.Пометка Тогда
			
			Если Колонка.РежимЗагрузки = "Устанавливать" Тогда
				
				Результат = Колонка.ЗначениеПоУмолчанию;
				ТекущаяСтрока.Вставить(КлючИЗначение.Ключ,Результат);
				
			ИначеЕсли Не Колонка.НомерКолонки = 0 Тогда
				
				Если Не ОбработатьОбласть(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(Колонка.НомерКолонки,"ЧГ=")), Колонка, ТекущаяСтрока, ТекстыЯчеек, КлючИЗначение.Ключ) Тогда
					КоличествоОшибок = КоличествоОшибок + 1;
				КонецЕсли;
				
			ИначеЕсли Колонка.РежимЗагрузки = "Вычислять" Тогда
				
				Вычисление  = ВычислитьЗначениеЯчейки(Колонка.Выражение,ТекущаяСтрока,"",ТекстыЯчеек,Колонка.ЗначениеПоУмолчанию);
				Результат   = Вычисление.Результат;
				Примечание  = Вычисление.ОписаниеОшибки;
				
				Если НЕ ЗначениеЗаполнено(Результат) Тогда
					Результат = Колонка.ЗначениеПоУмолчанию;
				КонецЕсли;
	
				ТекущаяСтрока.Вставить(КлючИЗначение.Ключ,Результат);
				
				Если Не ПустаяСтрока(Примечание) Тогда
					ТекстСообщения = НСтр("ru = 'Строка [%1](%2): %3'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, НомерСтроки, Колонка.ПредставлениеРеквизита, Примечание);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КоличествоОшибок = КоличествоОшибок + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	Возврат ТекущаяСтрока;
	
КонецФункции

&НаСервере
// Процедура выполняет обработку области табличного документа,
// заполняет расшифровку по представлению ячейки в соответствии со структурой загружаемых реквизитов,
// сообщает об ошибке и устанавливает коментарий, если ячейка содержит ошибку.
//
// Параметры:
//  Область - область табличного документа,
//  Колонка - Структура, свойства, в соответствии с которыми необходимо выполнить обработку области,
//  ТекущиеДанные  - структура загруженных значений,
//  ТекстыЯчеек    - массив текстов ячеек строки.
//
Функция ОбработатьОбласть(Область, Колонка, ТекущиеДанные, ТекстыЯчеек, ИмяКолонки)
	
	Представление = Область.Текст;
	Примечание = "";
	
	Если Колонка.РежимЗагрузки = "Вычислять" Тогда
		
		Вычисление = ВычислитьЗначениеЯчейки(Колонка.Выражение,ТекущиеДанные,Представление, ТекстыЯчеек, Колонка.ЗначениеПоУмолчанию);
		Если Не ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			Результат   = Неопределено;
			Примечание = ""+ Вычисление.ОписаниеОшибки;
		Иначе
			Результат = Вычисление.Результат;
		КонецЕсли;
		
	ИначеЕсли ПустаяСтрока(Представление) Тогда
		Результат = Неопределено;
	Иначе
		НайденныеЗначения = ПолучитьВозможныеЗначения(Колонка, Представление, Примечание, ТекущиеДанные);
		
		Если НайденныеЗначения.Количество() = 0 Тогда
			
			Примечание = "Не найден"+?(Примечание = "","", Символы.ПС+Примечание);
			Результат = Неопределено;
			
		ИначеЕсли НайденныеЗначения.Количество() = 1 Тогда
			
			Результат = НайденныеЗначения[0];
			
			
		Иначе
			
			Примечание = "Не однозначное представление. Вариантов: "+НайденныеЗначения.Количество()+?(Примечание = "","", Символы.ПС+Примечание);
			
			Нашли = Ложь;
			НашлиЗначениеПоУмолчанию = Ложь;
			Для каждого НайденноеЗначение Из НайденныеЗначения Цикл
				Если НайденноеЗначение = Область.Расшифровка Тогда
					Нашли = Истина;
					Прервать;
				КонецЕсли;
				Если НайденноеЗначение = Колонка.ЗначениеПоУмолчанию Тогда
					НашлиЗначениеПоУмолчанию = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Не Нашли Тогда
				
				Если НашлиЗначениеПоУмолчанию Тогда
					НайденноеЗначение = Колонка.ЗначениеПоУмолчанию;
				Иначе
					НайденноеЗначение = НайденныеЗначения[0];
				КонецЕсли;
			КонецЕсли;
			Результат = НайденноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Колонка.ЗначениеПоУмолчанию;
	КонецЕсли;
			
	ТекущиеДанные.Вставить(ИмяКолонки,Результат);
	
	Область.Расшифровка = Результат;
	Область.Примечание.Текст = Примечание;
	
	Если Не ПустаяСтрока(Примечание) Тогда
		ТекстСообщения = НСтр("ru = 'Ячейка[%1](%2): %3'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Область.Имя, Колонка.ПредставлениеРеквизита, Примечание);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат ПустаяСтрока(Примечание);
	
КонецФункции

&НаСервере
// Функция возвращает массив возможных значений для текущей колонки по представлению.
//
// Параметры:
//  Колонка - Структура, свойства, в соответствии с которыми необходимо получить возможные значения,
//  Представление - Строка, по которой необходимо вернуть массив значений,
//  Примечание    - массив текстов ячеек строки,
//  ТекущиеДанные  - структура загруженных значений.
//
// Возвращаемое значение:
//  массив возможных значений.
//
Функция ПолучитьВозможныеЗначения(Колонка, Представление, Примечание, ТекущиеДанные)
	
	
	Примечание = "";
	
	НайденныеЗначения = Новый Массив;
	
	Если ПустаяСтрока(Представление) Тогда
		
		Возврат НайденныеЗначения;
		
	Иначе
		СвязьПоТипу = Неопределено;
		Если Не ПустаяСтрока(Колонка.СвязьПоТипу)  Тогда
			
			Если ТипЗНЧ(Колонка.СвязьПоТипу) = Тип("Строка") Тогда
				ТекущиеДанные.Свойство(Колонка.СвязьПоТипу,СвязьПоТипу);
			Иначе
				СвязьПоТипу = Колонка.СвязьПоТипу;
			КонецЕсли;
			Если Не СвязьПоТипу = Неопределено Тогда
				
				ЭлементСвязиПоТипу = Колонка.ЭлементСвязиПоТипу;
				Если ЭлементСвязиПоТипу = 0 Тогда
					ЭлементСвязиПоТипу = 1;
				КонецЕсли;
				ВидыСубконто = СвязьПоТипу.ВидыСубконто;
				Если ЭлементСвязиПоТипу > ВидыСубконто.Количество() Тогда
					Возврат НайденныеЗначения;
				КонецЕсли;
				Тип = СвязьПоТипу.ВидыСубконто[ЭлементСвязиПоТипу-1].ВидСубконто.ТипЗначения;
			Иначе
				Тип = Колонка.ОписаниеТипов;
			КонецЕсли;
			 
		Иначе
			Тип = Колонка.ОписаниеТипов;
		КонецЕсли;
	КонецЕсли;
	ПримитивныеТипы = Новый Структура ("Число, Строка, Дата, Булево, ВидДвиженияНакопления", Тип("Число"), Тип("Строка"), Тип("Дата"), Тип("Булево"), Тип("ВидДвиженияНакопления"));
	Для каждого ТипРеквизита Из Тип.Типы() Цикл
		
		Если ТипРеквизита = ПримитивныеТипы.Число Или ТипРеквизита = ПримитивныеТипы.Булево Тогда
			НайденныеЗначения.Добавить(мПривестиКЧислу(Представление, Колонка.ОписаниеТипов, Примечание));
		ИначеЕсли ТипРеквизита = ПримитивныеТипы.Строка или ТипРеквизита = ПримитивныеТипы.Дата Тогда
			НайденныеЗначения.Добавить(мПривестиКДате(Представление, Колонка.ОписаниеТипов, Примечание));	
		ИначеЕсли ТипРеквизита = ПримитивныеТипы.ВидДвиженияНакопления Тогда
			НайденныеЗначения.Добавить(мПривестиКВидуДвиженияНакопления(Представление, Колонка.ОписаниеТипов, Примечание));	
		Иначе
			
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТипРеквизита);
			
			Если Перечисления.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
				
				// Это Перечисление.
				Для каждого Перечисление Из ПолучитьМенеджераПоТипу(ТипРеквизита) Цикл
					Если Строка(Перечисление) = Представление Тогда
						НайденныеЗначения.Добавить(Перечисление);
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
				
				// Это документ.
				
				Менеджер = ПолучитьМенеджераПоТипу(ТипРеквизита);
				Если Колонка.ИскатьПо = "Номер" Тогда
				ИначеЕсли Колонка.ИскатьПо = "Дата" Тогда
				Иначе
						
					ДлиннаСинонима = СтрДлина(""+МетаданныеТипа);
						
					Если Лев(Представление, ДлиннаСинонима) = ""+МетаданныеТипа Тогда
						НомерИДата = СокрЛП(Сред(Представление, ДлиннаСинонима+1));
						ПозицияОт = Найти(НомерИДата, " от ");
						Если Не ПозицияОт = 0 Тогда
							НомерДок = Лев(НомерИДата, ПозицияОт-1);
							Попытка
								ДатаДок  = Дата(Сред(НомерИДата, ПозицияОт+4));
							Исключение
								ДатаДок = Неопределено;
							КонецПопытки;
							Если Не ДатаДок = Неопределено Тогда
								НайденноеЗначение = Менеджер.НайтиПоНомеру(НомерДок, ДатаДок);
								Если Не НайденноеЗначение.Пустая() Тогда
									НайденныеЗначения.Добавить(НайденноеЗначение);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
						
				КонецЕсли;
					
			ИначеЕсли Не МетаданныеТипа = Неопределено Тогда
				
				ИскатьПо = Колонка.ИскатьПо;
				ЭтоСправочник = Справочники.ТипВсеСсылки().СодержитТип(ТипРеквизита);
				Если ПустаяСтрока(ИскатьПо) Тогда
					СтрокаОсновногоПредставления = Строка(МетаданныеТипа.ОсновноеПредставление);
					
					Если СтрокаОсновногоПредставления = "ВВидеКода" Тогда
						ИскатьПо = "Код";
					ИначеЕсли СтрокаОсновногоПредставления = "ВВидеНаименования" Тогда
						ИскатьПо = "Наименование";
					ИначеЕсли СтрокаОсновногоПредставления = "ВВидеНомера" Тогда
						ИскатьПо = "Номер";
					КонецЕсли;
				КонецЕсли;
				
					
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	_Таблица.Ссылка
				|ИЗ
				|	" + МетаданныеТипа.ПолноеИмя() + " КАК _Таблица
				|ГДЕ";
				
				Запрос.Текст = Запрос.Текст + "
				|	_Таблица." + ИскатьПо + " = &Представление";
				Запрос.УстановитьПараметр("Представление",Представление);
				
				Если ЭтоСправочник и Не ПустаяСтрока(Колонка.СвязьПоВладельцу) и МетаданныеТипа.Владельцы.Количество() Тогда
					
					СвязьПоВладельцу = Неопределено;
					Если ТипЗНЧ(Колонка.СвязьПоВладельцу) = Тип("Строка") Тогда
						ТекущиеДанные.Свойство(Колонка.СвязьПоВладельцу,СвязьПоВладельцу);
					Иначе
						СвязьПоВладельцу = Колонка.СвязьПоВладельцу;
					КонецЕсли;
					
					Если Не СвязьПоВладельцу = Неопределено Тогда
						Запрос.Текст = Запрос.Текст + "
						|	И _Таблица.Владелец = &СвязьПоВладельцу";
						Запрос.УстановитьПараметр("СвязьПоВладельцу",СвязьПоВладельцу);
					КонецЕсли;
					
				КонецЕсли;
				
				Выборка =  Запрос.Выполнить().Выбрать();
					
				Пока Выборка.Следующий() Цикл
					НайденныеЗначения.Добавить(Выборка.Ссылка);
				КонецЦикла;
			Иначе
				Примечание = "Не описан способ поиска";
				Примечание = "Для Колонки не определен тип значения";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныеЗначения;
	
КонецФункции

// Функция возвращает массив, элементами которого выступают возможные имена представления загружаемого реквизита.
//
// Параметры:
//  ЗагружаемыйРеквизит - Строка таблицы значений загружаемого реквизита.
//
// Возвращаемое значение:
//  список значений; значение списка - строка имя представления.
//
&НаСервере
Функция ПолучитьСписокИменПредставлений(ОписаниеТипов)
	
	СписокВыбора = Новый СписокЗначений;

	Если ОписаниеТипов.Типы().Количество() > 0 Тогда
		
		ТаблицаТипы = Новый ТаблицаЗначений;
		ТаблицаТипы.Колонки.Добавить("СтрокаПоиска", Новый ОписаниеТипов("Строка"));
		ТаблицаТипы.Колонки.Добавить("ПредставлениеПоиска", Новый ОписаниеТипов("Строка"));
		ТаблицаТипы.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
		Для каждого Тип Из ОписаниеТипов.Типы() Цикл
			
			МетаданныеТипа      = Метаданные.НайтиПоТипу(Тип);
			ЭтоСправочник       = Справочники.ТипВсеСсылки().СодержитТип(Тип);
			ЭтоСчет             = ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип);
			ЭтоВидХарактеристик = ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип);
			Если ЭтоСправочник ИЛИ ЭтоСчет Или ЭтоВидХарактеристик Тогда
				
				ЕстьКод = МетаданныеТипа.ДлинаКода > 0;
				ЕстьИмя = МетаданныеТипа.ДлинаНаименования > 0;
				
				ВидОсновногоПредставление = ?(ЭтоСправочник, Метаданные.СвойстваОбъектов.ОсновноеПредставлениеСправочника,
				?(ЭтоСчет,Метаданные.СвойстваОбъектов.ОсновноеПредставлениеСчета,Метаданные.СвойстваОбъектов.ОсновноеПредставлениеВидаХарактеристики));
				
				Если МетаданныеТипа.ОсновноеПредставление = ВидОсновногоПредставление.ВВидеКода Тогда
					
					Если ЕстьКод Тогда
						Стр = ТаблицаТипы.Найти("Код", "СтрокаПоиска");
						Если ЗначениеЗаполнено(Стр) Тогда
							Стр.Количество = Стр.Количество + 1;
						Иначе
                        	Стр = ТаблицаТипы.Добавить();
							Стр.СтрокаПоиска = "Код";
							Стр.ПредставлениеПоиска = "Код";
							Стр.Количество = 1;
						КонецЕсли;
					КонецЕсли;
					
					Если ЕстьИмя Тогда
						Стр = ТаблицаТипы.Найти("Наименование", "СтрокаПоиска");
						Если ЗначениеЗаполнено(Стр) Тогда
							Стр.Количество = Стр.Количество + 1;
						Иначе
                        	Стр = ТаблицаТипы.Добавить();
							Стр.СтрокаПоиска = "Наименование";
							Стр.ПредставлениеПоиска = "Наименование";
							Стр.Количество = 1;
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					
					Если ЕстьИмя Тогда
						Стр = ТаблицаТипы.Найти("Наименование", "СтрокаПоиска");
						Если ЗначениеЗаполнено(Стр) Тогда
							Стр.Количество = Стр.Количество + 1;
						Иначе
                        	Стр = ТаблицаТипы.Добавить();
							Стр.СтрокаПоиска = "Наименование";
							Стр.ПредставлениеПоиска = "Наименование";
							Стр.Количество = 1;
						КонецЕсли;
					КонецЕсли;
					
					Если ЕстьКод Тогда
						Стр = ТаблицаТипы.Найти("Код", "СтрокаПоиска");
						Если ЗначениеЗаполнено(Стр) Тогда
							Стр.Количество = Стр.Количество + 1;
						Иначе
                        	Стр = ТаблицаТипы.Добавить();
							Стр.СтрокаПоиска = "Код";
							Стр.ПредставлениеПоиска = "Код";
							Стр.Количество = 1;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				Для каждого Реквизит Из МетаданныеТипа.Реквизиты Цикл
					
					Если Не Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать
					 И Реквизит.Тип.Типы().Количество() = 1 и Реквизит.Тип.Типы()[0] = Тип ("Строка") Тогда
						
						Стр = ТаблицаТипы.Найти(Реквизит.Имя, "СтрокаПоиска");
						Если ЗначениеЗаполнено(Стр) Тогда
							Стр.Количество = Стр.Количество + 1;
						Иначе
                        	Стр = ТаблицаТипы.Добавить();
							Стр.СтрокаПоиска = Реквизит.Имя;
							Стр.ПредставлениеПоиска = Реквизит.Представление();
							Стр.Количество = 1;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Количество", ОписаниеТипов.Типы().Количество());
		
		НайденныеСтроки = ТаблицаТипы.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			СписокВыбора.Добавить(Строка.СтрокаПоиска, Строка.ПредставлениеПоиска);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Функция возвращает список, элементами которого выступают возможные связи по типу для загружаемого реквизита.
//
// Параметры:
//  ЗагружаемыйРеквизит - Строка таблицы значений загружаемого реквизита.
//
// Возвращаемое значение:
//  список значений; значение списка - строка имя колонки связи или ссылка на элемент связи.
//
&НаСервере
Функция ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, ТЗ)
	
	СписокВыбора = Новый СписокЗначений;
	
	ВозможныеПланыСчетов = Новый Структура;
	Для каждого ПланСчетов Из Метаданные.ПланыСчетов Цикл
		Попытка
			Если ПланСчетов.ВидыСубконто.Тип = ЗагружаемыйРеквизит.ОписаниеТипов Тогда
				
				ВозможныеПланыСчетов.Вставить(ПланСчетов.Имя,ПланыСчетов[ПланСчетов.Имя]);
				
			КонецЕсли;
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	
	Для каждого ПланСчетов Из ВозможныеПланыСчетов Цикл
		ТипЗНЧПланСчетов = ТипЗНЧ(ПланСчетов.Значение.ПустаяСсылка());
		Для каждого КолонкаСвязиПоТипу Из ТЗ Цикл
			Если КолонкаСвязиПоТипу.ОписаниеТипов.Типы()[0] = ТипЗНЧПланСчетов Тогда
				СписокВыбора.Добавить(КолонкаСвязиПоТипу.ИмяРеквизита,КолонкаСвязиПоТипу.ИмяРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если Не ВозможныеПланыСчетов.Количество() = 0 Тогда
		СписокВыбора.Добавить(Неопределено, "< пустое значение >");
	КонецЕсли;
	
	Для каждого ПланСчетов Из ВозможныеПланыСчетов Цикл
		СписокВыбора.Добавить("ПланСчетовСсылка."+ПланСчетов.Ключ,"<"+ПланСчетов.Ключ+">");
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

// Функция возвращает список, элементами которого выступают возможные связи по владельцу для загружаемого реквизита.
//
// Параметры:
//  ЗагружаемыйРеквизит - Строка таблицы значений загружаемого реквизита.
//
// Возвращаемое значение:
//  список значений; значение списка - строка имя колонки связи или ссылка на элемент связи.
//
&НаСервере
Функция ПолучитьСписокСвязейПоВладельцу(ОписаниеТипов, ТаблицаКолонок)
	
	ЕстьТипСамогоОбъекта = Ложь;
	МетаданныеИсточника = ПолучитьМетаданныеИсточника();
	Если РежимЗагрузки = 0 Тогда
		ОписаниеТиповСправочника = Тип(СтрЗаменить(МетаданныеИсточника.ПолноеИмя(),".","Ссылка."));
	Иначе
		ОписаниеТиповСправочника = Неопределено;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	ТипыВладельцев = Новый Соответствие;
	Для каждого ТипКолонки Из ОписаниеТипов.Типы() Цикл
		Если Справочники.ТипВсеСсылки().СодержитТип(ТипКолонки) Тогда
			Для каждого Владелец Из Метаданные.НайтиПоТипу(ТипКолонки).Владельцы Цикл
				ТипВладельца   = Тип(СтрЗаменить(Владелец.ПолноеИмя(), ".", "Ссылка."));
				Если ТипыВладельцев[ТипВладельца] = Неопределено Тогда
					
					Если ТипВладельца = ОписаниеТиповСправочника Тогда
						
						ЕстьТипСамогоОбъекта = Истина;
						
					КонецЕсли;
					 
					ТипыВладельцев.Вставить(Владелец.ПолноеИмя(), Владелец.ПолноеИмя());
					Для каждого КолонкаСвязиПоВладельцу Из ТаблицаКолонок Цикл
						Если КолонкаСвязиПоВладельцу.ОписаниеТипов.Типы()[0] = ТипВладельца И СписокВыбора.НайтиПоЗначению(КолонкаСвязиПоВладельцу.ИмяРеквизита) = Неопределено Тогда
							// Возможно надо будет по всем типам проходить.
							СписокВыбора.Добавить(КолонкаСвязиПоВладельцу.ИмяРеквизита,КолонкаСвязиПоВладельцу.ИмяРеквизита);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТипыВладельцев.Количество() = 0 Тогда
		СписокВыбора.Добавить(Неопределено, "< пустое значение >");
	КонецЕсли;
	 
	
	Для каждого КлючИЗначение Из ТипыВладельцев Цикл
		СписокВыбора.Добавить(КлючИЗначение.Значение, "<"+КлючИЗначение.Значение+">");
	КонецЦикла;
	
	Если ЕстьТипСамогоОбъекта Тогда
		
		СписокВыбора.Вставить(0,"<Создаваемый объект>", "<Создаваемый объект>");
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
// Процедура получает таблицу данных из табличного документа.
//
Процедура ПолучитьТаблицуДанныхНаСервере()

	СформироватьСтруктуруКолонок();
	СформироватьКолонкиТаблицыПодготовленныхДанных();
	КоличествоЭлементов = ТабличныйДокумент.ВысотаТаблицы - ПерваяСтрокаДанныхТабличногоДокумента + 1;
	
	КоличествоОшибок = 0;
	ТЗ = РеквизитФормыВЗначение("ТаблицаПодготовленныхДанных");
	ТЗ.Очистить();
	
	Для К = 0  По КоличествоЭлементов - 1 Цикл
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), КонтрольЗаполненияСтроки(ТабличныйДокумент, К + ПерваяСтрокаДанныхТабличногоДокумента,,КоличествоОшибок));
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, "ТаблицаПодготовленныхДанных");
	
	Если КоличествоОшибок Тогда
		ТекстСообщения = НСтр("ru = 'Выявлено ячеек, содержащих ошибки/неоднозначное представление: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, КоличествоОшибок);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Возвращает список выбора, закэшированный в таблице значений для реквизита
//
// Параметры:
//  ИмяРеквизита  - Строка - Имя реквизита, для которого нужно
//		получить связанный список выбора,
//  ВидСписка - Строка - Вид возращаемого списка.
// Возвращаемое значение:
//   СписокЗначений - список значений для выбора для этого реквизита.
//
Функция ПолучитьСписокВыбора(ИмяРеквизита, ТипСписка)

	ТЗ = РеквизитФормыВЗначение("СпискиВыбораРеквизитов");
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизита", ИмяРеквизита);
	Отбор.Вставить("ТипСписка", ТипСписка);
	
	Стр = ТЗ.НайтиСтроки(Отбор);
	
	Если Стр.Количество() > 0 Тогда
		Возврат Стр[0].СписокВыбора;
	Иначе
		Возврат Новый СписокЗначений;
	КонецЕсли;

КонецФункции

&НаСервере
// Заполняет настройки колонок по умолчанию или по переданным настройкам
//
// Параметры:
//  ТабличнаяЧасть - Таблица настроек которую требуется заполнить,
//	ЭтоРегистр - Определяет, что мы заполняем настройки для регистра, а не табличной части,
//	ОбъектЗагрузки - Объект настройками загрузки которого заполняется таблица настроек.	
//
Процедура ЗаполнитьНастройкиКолонок(ТабличнаяЧасть = Неопределено, ЭтоРегистр = Ложь, ОбъектЗагрузки = Неопределено)
	
	Если ЗначениеЗаполнено(ТабличнаяЧасть) Тогда
		ТЗ = РеквизитФормыВЗначение(ТабличнаяЧасть);	
	Иначе
		ТЗ = РеквизитФормыВЗначение("ТаблицаЗагружаемыхРеквизитов");		
	КонецЕсли;
	
	ТЗ.Очистить();
		
	Если РежимЗагрузки = 0 Тогда
		ЗаполнитьНастройкиКолонокСправочника(ТЗ);
	ИначеЕсли РежимЗагрузки = 1 Тогда
		ЗаполнитьНастройкиКолонокТабличнойЧасти(ТЗ);
	ИначеЕсли РежимЗагрузки = 2 Тогда
		ЗаполнитьНастройкиКолонокРегистраСведений(ТЗ);
	ИначеЕсли РежимЗагрузки = 3 ИЛИ ЭтоРегистр Тогда
		ЗаполнитьНастройкиКолонокРегистраДокумента(ТЗ, ОбъектЗагрузки, ЭтоРегистр);
	КонецЕсли;
	
	НомерКолонки = 1;	
			
	Если РежимЗагрузки = 5 И НЕ ЭтоРегистр Тогда
		ЗаполнитьНастройкиКолонокТабличнойЧасти(ТЗ);			
	КонецЕсли;
		
   	УстновитьПредставлениеДопУсловийТЗ(ТЗ, НомерКолонки);
	Если ЗначениеЗаполнено(ТабличнаяЧасть) Тогда
		ЗначениеВРеквизитФормы(ТЗ, ТабличнаяЧасть);	
	Иначе
		ЗначениеВРеквизитФормы(ТЗ, "ТаблицаЗагружаемыхРеквизитов");		
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
// Процедура восстанавливает таблицу настроек из структуры
//
// Параметры:
//	ТаблицаРеквизитов - таблица значений которую заполняемя,
//  ВосстановленнаяТаблицаРеквизитов - таблица значений, по которой заполняем ТаблицуРеквизитов.
//
Процедура ВосстановитьЗначенияНастроекИзТаблицыРеквизитов(ТаблицаРеквизитов, ВосстановленнаяТаблицаРеквизитов)
	
	НомерКолонкиОформления = 0;

	Для каждого Колонка Из ВосстановленнаяТаблицаРеквизитов Цикл

		ЗагружаемыйРеквизит = ТаблицаРеквизитов.Найти(Колонка.ИмяРеквизита,"ИмяРеквизита");
		Если Не ЗагружаемыйРеквизит = Неопределено Тогда
			Индекс = ТаблицаРеквизитов.Индекс(ЗагружаемыйРеквизит);
			Если Индекс >= НомерКолонкиОформления Тогда
				ЗаполнитьЗначенияСвойств(ЗагружаемыйРеквизит, Колонка);
				
				ТаблицаРеквизитов.Сдвинуть(ЗагружаемыйРеквизит, НомерКолонкиОформления - Индекс);
				НомерКолонкиОформления = НомерКолонкиОформления + 1;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Заполняет настройки колонок по умолчанию для табличной части.
//
Процедура ЗаполнитьНастройкиКолонокТабличнойЧасти(ТЗ, ОбъектЗагрузки = Неопределено)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(ОбъектЗагрузки);
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если РежимЗагрузки = 5 И НЕ ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
		СписокКолонок = Элементы["Колонка_ПриИзмененииСоздатьДокумент"].СписокВыбора;
		СписокКолонок.Очистить();
	КонецЕсли;

	Для каждого Реквизит Из МетаданныеИсточника.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя = "Ссылка" 
			ИЛИ Реквизит.Имя = "ПометкаУдаления" 
			ИЛИ Реквизит.Имя = "НомерСтроки"
			ИЛИ Реквизит.Имя = "Предопределенный"
			ИЛИ Реквизит.Имя = "Проведен" Тогда
				Продолжить;
		КонецЕсли;
		ЗагружаемыйРеквизит                        	= ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           	= Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита 	= Реквизит.Представление();
		ЗагружаемыйРеквизит.ОписаниеТипов 			= МетаданныеИсточника.СтандартныеРеквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска 	= Истина;
		ЗагружаемыйРеквизит.ПолеПоиска 				= Истина;
		ЗагружаемыйРеквизит.НеУбиратьПометку 		= Истина;
		Если РежимЗагрузки = 5 И НЕ ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
			СписокКолонок.Добавить(Реквизит.Имя, Реквизит.Представление());
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		ЗагружаемыйРеквизит                        	= ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           	= Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита 	= Реквизит.Представление();
		ЗагружаемыйРеквизит.ОписаниеТипов 			= МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска 	= Истина;
		Если РежимЗагрузки = 5 И НЕ ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
			СписокКолонок.Добавить(Реквизит.Имя, Реквизит.Представление());
		КонецЕсли;
	КонецЦикла;
	
	Если РежимЗагрузки = 5 И НЕ ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
		Если СписокКолонок.Количество() > 0 Тогда
			Колонка_ПриИзмененииСоздатьДокумент = СписокКолонок[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	ОбработатьТаблицуЗагружаемыхРеквизитов(ТЗ);
	
КонецПроцедуры

// Заполняет настройки колонок по умолчанию для справочника.
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокСправочника(ТЗ, Справочник = Неопределено, ТекРежимЗагрузки = Неопределено)
	
	Если ТекРежимЗагрузки = Неопределено Тогда
		ТекРежимЗагрузки = РежимЗагрузки;	
	КонецЕсли;
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(Справочник, , ТекРежимЗагрузки);
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МетаданныеИсточника.ДлинаКода > 0 Тогда
		
		ЗагружаемыйРеквизит = ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Код";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Код";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		Если МетаданныеИсточника.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
			ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаКода));
		Иначе
			ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(МетаданныеИсточника.ДлинаКода));
		КонецЕсли;
		
	КонецЕсли;
	
	Если МетаданныеИсточника.ДлинаНаименования > 0 Тогда
		
		ЗагружаемыйРеквизит = ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Наименование";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Наименование";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаНаименования));
		
	КонецЕсли;
	
	Если МетаданныеИсточника.Владельцы.Количество() > 0 И НЕ ЗначениеЗаполнено(Справочник) Тогда
		
		ЗагружаемыйРеквизит = ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Владелец";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Владелец";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		СтрокаОписанияТипов = "";
			
		Для каждого Владелец Из МетаданныеИсточника.Владельцы Цикл
			СтрокаОписанияТипов = ?(ПустаяСтрока(СтрокаОписанияТипов),"",СтрокаОписанияТипов + ", ") + Владелец.ПолноеИмя();
		КонецЦикла;
			
		СтрокаОписанияТипов = СтрЗаменить(СтрокаОписанияТипов,".","Ссылка.");
		ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов(СтрокаОписанияТипов);
		
	КонецЕсли;
	
	Если МетаданныеИсточника.Иерархический Тогда
		
		ЗагружаемыйРеквизит = ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Родитель";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Родитель";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов(СтрЗаменить(МетаданныеИсточника.ПолноеИмя(),".","Ссылка."));
		
	КонецЕсли;
	
	Для каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		Если Не Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы Тогда
			ЗагружаемыйРеквизит                        = ТЗ.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Не Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать;
			ЗагружаемыйРеквизит.ОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
		КонецЕсли;
	КонецЦикла;
	
	ОбработатьТаблицуЗагружаемыхРеквизитов(ТЗ);
	
КонецПроцедуры

&НаСервере
// Заполняет настройки колонок по умолчанию для регистра сведений.
//
Процедура ЗаполнитьНастройкиКолонокРегистраСведений(ТЗ)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МетаданныеИсточника.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		
		ЗагружаемыйРеквизит = ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Период";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Период";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска = Истина;
		ЗагружаемыйРеквизит.ПолеПоиска           = Истина;
		
		ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов("Дата", , , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		
	КонецЕсли;
	
	Для каждого Реквизит Из МетаданныеИсточника.Измерения Цикл
		ЗагружаемыйРеквизит                        = ТЗ.Добавить();
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска = Истина;
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ОписаниеТипов = МетаданныеИсточника.Измерения[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	Для каждого Реквизит Из МетаданныеИсточника.Ресурсы Цикл
		ЗагружаемыйРеквизит                        = ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ОписаниеТипов = МетаданныеИсточника.Ресурсы[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	Для каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		ЗагружаемыйРеквизит                        = ТЗ.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	ОбработатьТаблицуЗагружаемыхРеквизитов(ТЗ);
		
КонецПроцедуры // ()

&НаСервере
// Заполняет настройки колонок по умолчанию для регистра документа.
//
Процедура ЗаполнитьНастройкиКолонокРегистраДокумента(ТаблицаЗагружаемыхРеквизитов, ОбъектЗагрузки = Неопределено, ЭтоРегистр = Ложь)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(ОбъектЗагрузки, ЭтоРегистр);
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Кол = 0;
	Попытка   
		Кол = МетаданныеИсточника.ПланСчетов.МаксКоличествоСубконто;
	Исключение КонецПопытки;
	Если Кол>0 Тогда
		Для нн = 4 по ДвиженияРегистра.Колонки.Количество()-1 Цикл
			Реквизит = ДвиженияРегистра.Колонки[нн];
			Если (Реквизит.Имя="МоментВремени") Тогда Продолжить КонецЕсли;
			
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Заголовок;
			ЗагружаемыйРеквизит.ОписаниеТипов 		   = Новый ОписаниеТипов(Реквизит.ТипЗначения, , "Null");
		КонецЦикла;
	Иначе
		
		Попытка
			Если МетаданныеИсточника.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
				ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
				ЗагружаемыйРеквизит.ИмяРеквизита           = "ВидДвижения";
				ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Вид движения";
				ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов("ВидДвиженияНакопления");	
			КонецЕсли;
		Исключение

		КонецПопытки;

		Для каждого Реквизит Из МетаданныеИсточника.Измерения Цикл
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ОписаниеТипов          = МетаданныеИсточника.Измерения[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
		КонецЦикла;
		
		Для каждого Реквизит Из МетаданныеИсточника.Ресурсы Цикл
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ОписаниеТипов = МетаданныеИсточника.Ресурсы[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
		КонецЦикла;
		
		Для каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
		КонецЦикла;
		
	КонецЕсли;		
	
	ОбработатьТаблицуЗагружаемыхРеквизитов(ТаблицаЗагружаемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуЗагружаемыхРеквизитов(ТаблицаЗагружаемыхРеквизитов)
	
	СпискиВыбораРеквизитов.Очистить();
	
	Для каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит.ОписаниеТипов);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
				
		СписокВыбора = ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит.ОписаниеТипов, ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СтрокаСпискаВладелец = СпискиВыбораРеквизитов.Добавить();
		СтрокаСпискаВладелец.ИмяРеквизита = ЗагружаемыйРеквизит.ИмяРеквизита;
		СтрокаСпискаВладелец.ТипСписка = "СвязьПоВладельцу";
		СтрокаСпискаВладелец.СписокВыбора = СписокВыбора;
		
		СписокВыбора = ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		
		СтрокаСпискаТипы = СпискиВыбораРеквизитов.Добавить();
		СтрокаСпискаТипы.ИмяРеквизита =  ЗагружаемыйРеквизит.ИмяРеквизита;
		СтрокаСпискаТипы.ТипСписка = "СвязьПоТипу";
		СтрокаСпискаТипы.СписокВыбора =  СписокВыбора;
	
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			Если Лев(СтрокаСпискаТипы.ИмяРеквизита, 10) = "СубконтоДт" Тогда
				ЗагружаемыйРеквизит.СвязьПоТипу = "СчетДт";	
			ИначеЕсли Лев(СтрокаСпискаТипы.ИмяРеквизита, 10) = "СубконтоКт" Тогда
				ЗагружаемыйРеквизит.СвязьПоТипу = "СчетКт";	
			Иначе
				ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			КонецЕсли;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
				
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
				
			Иначе
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		ЗагружаемыйРеквизит.ДоступныеТипы = ЗагружаемыйРеквизит.ОписаниеТипов;
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстновитьПредставлениеДопУсловийТЗ(ТЗ, НомерКолонки = 1)
	
	Для каждого ЗагружаемыйРеквизит Из ТЗ Цикл
		Если ЗагружаемыйРеквизит.РежимЗагрузки = "Вычислять" Тогда
			ЗагружаемыйРеквизит.ПредставлениеДопУсловий = ЗагружаемыйРеквизит.Выражение;
		Иначе
			ЗагружаемыйРеквизит.ПредставлениеДопУсловий = ?(ПустаяСтрока(ЗагружаемыйРеквизит.ИскатьПо), "", "Искать по "+ЗагружаемыйРеквизит.ИскатьПо)
			+?(ПустаяСтрока(ЗагружаемыйРеквизит.СвязьПоВладельцу), "", " по владельцу "+ЗагружаемыйРеквизит.СвязьПоВладельцу);
		КонецЕсли;
		Если НЕ ЗагружаемыйРеквизит.ОписаниеТипов.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			ЗагружаемыйРеквизит.Пометка      = Истина;
			ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
// Заполняет в таблицу значений движения регистра документа.
//
Процедура ЗаполнитьВТаблицуЗначенийДвиженияРегистраДокумента(ОбъектЗагрузки = Неопределено, НаименованиеСтраницы = Неопределено) Экспорт
	
	ПолучаемДанныеОсновногоРегистра = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
		РегистрЗагрузки = ОбъектЗагрузки;
	Иначе
		РегистрЗагрузки = РегистрДокумента;
		ПолучаемДанныеОсновногоРегистра = Истина;
	КонецЕсли;
	
	Если СокрЛП(РегистрЗагрузки)<>"" Тогда
				
		ФлагОшибки=0;
		Попытка
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	* 
			|ИЗ
			|	РегистрБухгалтерии."+РегистрЗагрузки+".ДвиженияССубконто(, , Регистратор = &Регистратор, , ) КАК ЖурналПроводок";
			
			Если РежимЗагрузки = 3 Тогда
				Запрос.УстановитьПараметр("Регистратор", СсылкаДокумента.Ссылка);
			ИначеЕсли РежимЗагрузки = 5 Тогда
				Запрос.УстановитьПараметр("Регистратор", СсылкаИсточника.Ссылка);
			КонецЕсли;
			
			Результат = Запрос.Выполнить();
			
			ДвиженияРегистра = Результат.Выгрузить();
			
			ДвиженияРегистра.Колонки.Добавить("МоментВремени", Новый ОписаниеТипов("Дата"));
			
			Если ПолучаемДанныеОсновногоРегистра Тогда
				АдресХранилищаДвиженияРегистра = ПоместитьВоВременноеХранилище(ДвиженияРегистра, Новый УникальныйИдентификатор);
			КонецЕсли;		
		Исключение
			ФлагОшибки=1;
		КонецПопытки;
		
		Если ФлагОшибки=1 Тогда
			ФлагОшибки=0;
			Попытка
				ТабПоле = РегистрыНакопления[РегистрЗагрузки].СоздатьНаборЗаписей();	
			Исключение
				ФлагОшибки=1;
			КонецПопытки;
			
			Если ФлагОшибки=1 Тогда
				ФлагОшибки=0;
				Попытка
					ТабПоле = РегистрыРасчета[РегистрЗагрузки].СоздатьНаборЗаписей();
				Исключение
					ФлагОшибки=1;
				КонецПопытки;
			КонецЕсли;
			
			Если ФлагОшибки=1 Тогда
				ФлагОшибки=0;
				Попытка
					ТабПоле = РегистрыСведений[РегистрЗагрузки].СоздатьНаборЗаписей();
				Исключение
					ФлагОшибки=1;
				КонецПопытки;
			КонецЕсли;
			
			Попытка
				Если (РежимЗагрузки = 3) ИЛИ ((РежимЗагрузки = 4) И (ЗначениеЗаполнено(СсылкаДокумента))) Тогда
					Отбор = новый структура;
					Отбор.Вставить("Регистратор",СсылкаДокумента);
					ТабПоле.Отбор.Регистратор.Значение = СсылкаДокумента.Ссылка;
					ТабПоле.Прочитать();
					ДвиженияРегистра = ТабПоле.Выгрузить();
					Если ПолучаемДанныеОсновногоРегистра Тогда
						АдресХранилищаДвиженияРегистра = ПоместитьВоВременноеХранилище(ДвиженияРегистра, Новый УникальныйИдентификатор);
					КонецЕсли;	
				КонецЕсли;
			Исключение
				
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	
	ЗаполнитьНастройкиКолонок(НаименованиеСтраницы, Истина, ОбъектЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТабличногоДокументаСервер()

	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруКолонок();
	СформироватьШапкуТабличногоДокумента(ТабличныйДокумент);
	
	НомерСтроки = ПерваяСтрокаДанныхТабличногоДокумента;
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника();
	Если РежимЗагрузки = 0 или РежимЗагрузки = 2 или РежимЗагрузки = 3 или РежимЗагрузки = 4 или РежимЗагрузки = 5 или МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗагрузки = 1 Тогда
		Источник = СсылкаИсточника[ТабличнаяЧастьИсточника];	
	КонецЕсли;
			
	Для каждого Строка Из Источник Цикл
		
		НомерКолонки = 0;
		
		Для каждого ЗагружаемыйРеквизит Из ЭтаФорма["ТаблицаЗагружаемыхРеквизитов"] Цикл
			
			Если ЗагружаемыйРеквизит.Пометка Тогда
				
				Если РучнаяНумерацияКолонокТабличногоДокумента Тогда
					НомерКолонки = ЗагружаемыйРеквизит.НомерКолонки;
				Иначе
					НомерКолонки = НомерКолонки + 1;
				КонецЕсли;
				
				Область = ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C"+НомерКолонки);
				Значение = Строка[ЗагружаемыйРеквизит.ИмяРеквизита];
				
				Попытка
					Представление = Значение[ЗагружаемыйРеквизит.ИскатьПо];
					
				Исключение
					
					Представление = Значение;
					
				КонецПопытки;
				
				Область.Текст = Представление;
				Область.Расшифровка = Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеТабличногоДокумента(БезВопросов = Ложь)
	
	Если (РежимЗагрузки = 0 или РежимЗагрузки = 2) и Элементы.ТабДокумент.Высота > 1 И Не БезВопросов Тогда
		
		ТекстВопроса = НСтр("ru='Табличный документ содержит данные. Очистить?'");
		Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеТабличногоДокументаЗавершение", ЭтотОбъект);				
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОбновитьДанныеТабличногоДокументаСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеТабличногоДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ОбновитьДанныеТабличногоДокументаСервер();
	
КонецПроцедуры

// Функция считывает в табличный документ данные из файла в формате Excel
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент, в который необходимо прочитать данные,
//  ИмяФайла           - имя файла в формате Excel, из которого необходимо прочитать данные,
//  НомерЛистаExcel    - номер листа книги Excel, из которого необходимо прочитать данные.
//
// Возвращаемое значение:
//  Истина, если файл прочитан, Ложь - иначе.
//
&НаКлиенте
Функция мПрочитатьТабличныйДокументИзExcel(ИмяФайла, НомерЛистаExcel = 1) Экспорт
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл не существует!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		ТекстСообщения = НСтр("ru = 'Обработка файла Microsoft Excel...'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка. Возможно неверно указан номер листа книги Excel.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат ложь;
		
	КонецПопытки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	ColumnCount = ActiveCell.Column;
	Для Column = 1 По ColumnCount Цикл
		ТабличныйДокумент.Область("C" + Формат(Column, "ЧГ=")).ШиринаКолонки = ExcelЛист.Columns(Column).ColumnWidth;
	КонецЦикла;
	Для Row = 1 По RowCount Цикл
		
		Для Column = 1 По ColumnCount Цикл
			ТабличныйДокумент.Область("R" + Формат(Row, "ЧГ=") +"C" + Формат(Column, "ЧГ=")).Текст = ExcelЛист.Cells(Row,Column).Text;
		КонецЦикла;
		
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	Возврат Истина;
	
КонецФункции

// Функция считывает в табличный документ данные из файла в формате TXT
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент, в который необходимо прочитать данные,
//  ИмяФайла           - имя файла в формате TXT, из которого необходимо прочитать данные.
//
// Возвращаемое значение:
//  Истина, если файл прочитан, Ложь - иначе.
//
&НаКлиенте
Функция мПрочитатьТабличныйДокументИзТекста(ИмяФайла) Экспорт
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл не существует!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	Попытка
		ТекстовыйДокумент.Прочитать(ИмяФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка открытия файла!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Для ТекущаяСтрока = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
		ТекущаяКолонка = 0;
		Для каждого Значение Из мРазложитьСтрокуВМассивПодстрок(ТекстовыйДокумент.ПолучитьСтроку(ТекущаяСтрока),Символы.Таб) Цикл
			ТекущаяКолонка = ТекущаяКолонка + 1;
			ТабличныйДокумент.Область("R" + Формат(ТекущаяСтрока, "ЧГ=") +"C" + Формат(ТекущаяКолонка, "ЧГ=")).Текст = Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция считывает в табличный документ данные из файла в формате dBase III (*.dbf).
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент, в который необходимо прочитать данные,
//  ИмяФайла           - имя файла в формате TXT, из которого необходимо прочитать данные.
//
// Возвращаемое значение:
//  Истина, если файл прочитан, Ложь - иначе.
//
&НаКлиенте
Функция мПрочитатьТабличныйДокументИзDBF(ИмяФайла) Экспорт
	
	#Если Не ВебКлиент Тогда
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл не существует!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	XBase  = Новый XBase;
	XBase.Кодировка = КодировкаXBase.OEM;
	Попытка
		XBase.ОткрытьФайл(ИмяФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка открытия файла!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТекущаяСтрока = 1;
	
	
	ТекущаяКолонка = 0;
	Для каждого Поле Из XBase.поля Цикл
		ТекущаяКолонка = ТекущаяКолонка + 1;
		ТабличныйДокумент.Область("R" + Формат(ТекущаяСтрока, "ЧГ=") +"C" + Формат(ТекущаяКолонка, "ЧГ=")).Текст = Поле.Имя;
	КонецЦикла;
	
	
	Рез = XBase.Первая();
	Пока Не XBase.ВКонце() Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		ТекущаяКолонка = 0;
		Для каждого Поле Из XBase.поля Цикл
			ТекущаяКолонка = ТекущаяКолонка + 1;
			ТабличныйДокумент.Область("R" + Формат(ТекущаяСтрока, "ЧГ=") +"C" + Формат(ТекущаяКолонка, "ЧГ=")).Текст = XBase.ПолучитьЗначениеПоля(ТекущаяКолонка - 1);
		КонецЦикла;
		
		XBase.Следующая();
	КонецЦикла;
	
	Возврат Истина;
	
	#Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка открытия файла! Веб-клиент не поддерживает данный функционал!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	#КонецЕсли
	
КонецФункции

&НаСервере
Процедура ПрочитатьТабличныйДокументИзMXLНаСервере(АдресХранилища)

	Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ИмяФайлаВременное = ПолучитьИмяВременногоФайла("mxl");
	
	Данные.Записать(ИмяФайлаВременное);
	ТабличныйДокумент.Прочитать(ИмяФайлаВременное);
	УдалитьФайлы(ИмяФайлаВременное);
	
КонецПроцедуры

&НаКлиенте
Процедура мПрочитатьТабличныйДокументИзMXL(ИмяФайла)

	ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
	
	АдресФайла = "";
	АдресФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, ЭтаФорма.УникальныйИдентификатор);
	
	ПрочитатьТабличныйДокументИзMXLНаСервере(АдресФайла);

КонецПроцедуры

&НаКлиенте
// Процедура управляет видимостью элементов управления
//
Процедура УправлениеВидимостью()
	
	Если Не Элементы.ГруппаПанельРежима.ТекущаяСтраница = Элементы.ГруппаПанельРежима.ПодчиненныеЭлементы[РежимЗагрузки] Тогда
		Элементы.ГруппаПанельРежима.ТекущаяСтраница = Элементы.ГруппаПанельРежима.ПодчиненныеЭлементы[РежимЗагрузки];
	КонецЕсли;
		
	УстановитьВидимостьКомандНаПанелях();
	
	Элементы.ДобавитьЗагрузкуВладельца.Видимость = РежимЗагрузки = 0;	
	Элементы.ДобавитьДополнительнуюТЧ.Видимость = ЗначениеЗаполнено(ТабличнаяЧастьИсточника);
	Элементы.ДобавитьДополнительныйРегистр.Видимость = ЗначениеЗаполнено(РегистрДокумента);
	
КонецПроцедуры

&НаСервере
// Процедура управляет видимостью элементов управления на каждой из программно созданных панелях настроек.
//
Процедура УстановитьВидимостьКомандНаПанелях()
	
	ДоступностьКнопкиСохранитьЗначения    = ЕстьВыбранныеМетаданные();

	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Элементы[КлючИЗначение.Значение + "НомерКолонки"].Видимость = РучнаяНумерацияКолонокТабличногоДокумента;
		Элементы[КлючИЗначение.Значение + "ПеренумероватьКолонки"].Видимость = РучнаяНумерацияКолонокТабличногоДокумента;		
		
		Элементы[КлючИЗначение.Значение + "СохранитьНастройки"].Доступность = ДоступностьКнопкиСохранитьЗначения;
		Элементы[КлючИЗначение.Значение + "СохранитьЗначенияВФайл"].Доступность = ДоступностьКнопкиСохранитьЗначения;
		
		Элементы[КлючИЗначение.Значение + "ВосстановитьНастройки"].Доступность = (СписокСохраненныхНастроек.Количество() <> 0);		
		
		Если Не КлючИЗначение.ДопНастройки И НЕ КлючИЗначение.ЗагружаетсяДоОбъекта Тогда
			Элементы[КлючИЗначение.Значение + "ПолеПоиска"].Видимость = (РежимЗагрузки = 0) ИЛИ (РежимЗагрузки = 2) ИЛИ (РежимЗагрузки = 5);
		ИначеЕсли КлючИЗначение.ЗагружаетсяДоОбъекта Тогда
			Элементы[КлючИЗначение.Значение + "ПолеПоиска"].Видимость = Истина;	
		Иначе
			Элементы[КлючИЗначение.Значение + "ПолеПоиска"].Видимость = (РежимЗагрузки = 0);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура выполняет установку реквизитов, связанных с источником данных.
//
Процедура УстановитьИсточник()
	
	Источник        = Неопределено;
	ОбъектИсточника = Неопределено;
	ПрошлыйМетаданныеСсылкиИсточника = Неопределено;
	МетаданныеИсточника = ПолучитьМетаданныеИсточника();
	
	ОчиститьТаблицуПодготовленныхДанных();
	ПродолжитьНастройкуНаСервере();
	
	Если ((РежимЗагрузки = 1) ИЛИ (РежимЗагрузки = 5)) И Не СсылкаИсточника = Неопределено Тогда
		ПрошлыйМетаданныеСсылкиИсточника = СсылкаИсточника.Метаданные();
	ИначеЕсли (РежимЗагрузки = 3 ИЛИ РежимЗагрузки = 4) И Не СсылкаДокумента = Неопределено Тогда
	    ПрошлыйМетаданныеСсылкиИсточника = СсылкаДокумента.Метаданные();
		ЗаполнитьВТаблицуЗначенийДвиженияРегистраДокумента();
	КонецЕсли;

	Если МетаданныеИсточника = Неопределено Тогда
		ЭтаФорма["ТаблицаЗагружаемыхРеквизитов"].Очистить();
	Иначе
		Врем = мВосстановитьЗначение(МетаданныеИсточника.ПолноеИмя(), ИдентификаторОбработки);
		ЗаполнитьНастройкиКолонок();
	КонецЕсли;
		
	ОбновитьДанныеТабличногоДокументаСервер();
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаЗагружаемыхРеквизитов");
		
КонецПроцедуры

&НаСервере
// Процедура выполняет инициализацию служебных переменных и констант модуля.
//
Процедура Инициализация()	
	
	ДополнительныеСвойства = Новый Структура;
	
	ДополнительныеСвойства.Вставить("ПримитивныеТипы", Новый Структура ("Число, Строка, Дата, Булево",
	Тип("Число"), Тип("Строка"), Тип("Дата"), Тип("Булево")));
	
	Если ПерваяСтрокаДанныхТабличногоДокумента < 2 Тогда
		ПерваяСтрокаДанныхТабличногоДокумента = 2;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Колонки", Новый Структура);

КонецПроцедуры

&НаСервере
// Функция выполняет загрузку данных и возврат результат когда обработка подключена как обработка заполнения объекта.
//
Функция ВыполнитьКомандуНапрямую(ИдентификаторКоманды, ПараметрыКоманды, Результат = Неопределено)
	Выполнить("Результат = ДополнительныеОтчетыИОбработки.ВыполнитьКомандуИзФормыВнешнегоОбъекта(ИдентификаторКоманды, ПараметрыКоманды, ЭтаФорма)"); 
	Возврат Результат;
КонецФункции

&НаСервере
// Процедура восстанавливает видимость таблиц настроек.
//
Процедура ПродолжитьНастройкуНаСервере()
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Элементы[КлючИЗначение.Ключ].Видимость = Истина;	
	КонецЦикла;
	Элементы.ПродолжитьНастройку.Видимость = Ложь;
	Элементы.Загрузить.Видимость = Ложь;
	Элементы.КонтрольЗаполнения.КнопкаПоУмолчанию = Истина;
	
	ОчиститьТаблицуПодготовленныхДанных();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыполнитьСравнениеВерсий(ПроверяемаяВерсия, ТекущаяВерсия)

	ПроверяемаяВерсия = ?(ПустаяСтрока(ПроверяемаяВерсия), "0.0.0.0", ПроверяемаяВерсия);
	ТекущаяВерсия = ?(ПустаяСтрока(ТекущаяВерсия), "0.0.0.0", ТекущаяВерсия);

	МассивТекущий = мРазложитьСтрокуВМассивПодстрок(ТекущаяВерсия, ".");
	МассивНаСайте = мРазложитьСтрокуВМассивПодстрок(ПроверяемаяВерсия, ".");
		
	КоличествоРазрядовТекущее = МассивТекущий.Количество()-1;
	КоличествоРазрядовНаСайте = МассивНаСайте.Количество()-1;
	
	Обновляем = Ложь;
	
	Для х = 0 ПО КоличествоРазрядовТекущее Цикл
		
		Если х > КоличествоРазрядовНаСайте Тогда
			
			Прервать;
			
		КонецЕсли;
		
		Если МассивТекущий[х] > МассивНаСайте[х] Тогда		
			
			Прервать;
			
		КонецЕсли;
		
		Если МассивТекущий[х] < МассивНаСайте[х] Тогда
			
			Обновляем = Истина;
			
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Обновляем
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСведенияОВнешнейОбработке(ВторойВариантРегистрации = Ложь, ПараметрыРегистрации = Неопределено) Экспорт
	
	Выполнить("ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(""2.1.3.1"")");	
	
	ПараметрыРегистрации.Версия = "2.5";
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	ПараметрыРегистрации.Информация = "";
	
	Если ВторойВариантРегистрации Тогда	
		Выполнить("ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка()");
		ПараметрыРегистрации.Наименование = "Загрузка данных из табличного документа";
		
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
		НоваяКоманда.Представление = "Загрузка данных из табличного документа";
		НоваяКоманда.Идентификатор = "ЗаполнитьДанныхИзТабличногоДокумента";
		Выполнить("НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы()");
		НоваяКоманда.ПоказыватьОповещение = Истина;	
	Иначе	
		Выполнить("ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта()");
		ПараметрыРегистрации.Наименование = "Заполнение табличной части из табличного документа";
				
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
		НоваяКоманда.Представление = "Заполнение табличной части из табличного документа";
		НоваяКоманда.Идентификатор = "ЗаполнитьДокументИзТабличногоДокумента";
		Выполнить("НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы()");
		НоваяКоманда.ПоказыватьОповещение = Истина;
	КонецЕсли;

	Возврат ПараметрыРегистрации;
	
КонецФункции

&НаСервере
// Процедура добавляет реквизиты и элементы формы, для загрузки подчиенных справочников.
//
//	ЗагружаемыйОбъект - Объект метаданных для которго создается страница настройки (Строка),
//	Представление - Представление объекта метаданных для которого создается страница настройки (Строка),
// 	ЭтоДопСтраница - Определяет это основная страница настройки или дополнительно создаваемая (булево),
//	ЭтоРегистр - Определяет, что добавляемая страница, является настройкой для загрузки в один из регистров (булево).
//
Функция ДобавитьСтраницуНастроек(ЗагружаемыйОбъект, Представление, ЭтоДопСтраница = Ложь, ЭтоРегистр = Ложь, ЗагружаетсяДоОбъекта = Ложь)
	
	Если ЭтоДопСтраница ИЛИ ЗагружаетсяДоОбъекта Тогда
		НаименованиеСтраницы = "ПодчиненныйСправочник_"+КоличествоСозданныхПодчиненныхНастроек;
		ПредставлениеСтраницы = "" + (КоличествоСозданныхПодчиненныхНастроек + 1) + ": "+Представление;
		
		КоличествоСозданныхПодчиненныхНастроек = КоличествоСозданныхПодчиненныхНастроек + 1;
	Иначе
		НаименованиеСтраницы = ЗагружаемыйОбъект;
		ПредставлениеСтраницы = Представление;
	КонецЕсли;
	
	нСтрокаНастроек = ТаблицыНастроек.Добавить();
	нСтрокаНастроек.Ключ = "Страница" + НаименованиеСтраницы; 
	нСтрокаНастроек.Значение = НаименованиеСтраницы;
	нСтрокаНастроек.Справочник = ЗагружаемыйОбъект;
	нСтрокаНастроек.Заголовок = ПредставлениеСтраницы;
	нСтрокаНастроек.ДопНастройки = ЭтоДопСтраница;
	нСтрокаНастроек.Представление = Представление;
	нСтрокаНастроек.ЭтоРегистр = ЭтоРегистр;
	нСтрокаНастроек.ЗагружаетсяДоОбъекта = ЗагружаетсяДоОбъекта;
	
	СтраницаГруппыРеквизитов = Элементы.Добавить("Страница" + НаименованиеСтраницы, Тип("ГруппаФормы"), Элементы.ГруппаЗагрузкаНастройка);
   	СтраницаГруппыРеквизитов.Вид = ВидГруппыФормы.Страница;
	СтраницаГруппыРеквизитов.Заголовок = ПредставлениеСтраницы;
	
	МассивДобавляемыхРеквизитов = Новый Массив;	
	нРеквизит = Новый РеквизитФормы(НаименованиеСтраницы, Новый ОписаниеТипов("ТаблицаЗначений"),,НаименованиеСтраницы);
	МассивДобавляемыхРеквизитов.Добавить(нРеквизит);	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	// Добавляем командную панель и ее кнопки.
	нКоманднаяПанель = Элементы.Добавить(НаименованиеСтраницы + "КоманднаяПанель", Тип("ГруппаФормы"), СтраницаГруппыРеквизитов);
	нКоманднаяПанель.Вид = ВидГруппыФормы.КоманднаяПанель;
	
	УстановитьФлажки = Элементы.Добавить(НаименованиеСтраницы + "УстановитьФлажки", Тип("КнопкаФормы"), нКоманднаяПанель);
	УстановитьФлажки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	УстановитьФлажки.ИмяКоманды = "УстановитьФлажки";	
	СнятьФлажки = Элементы.Добавить(НаименованиеСтраницы + "СнятьФлажки", Тип("КнопкаФормы"), нКоманднаяПанель);
	СнятьФлажки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	СнятьФлажки.ИмяКоманды = "СнятьФлажки";

	ВосстановитьЗначенияИзФайла = Элементы.Добавить(НаименованиеСтраницы + "ВосстановитьЗначенияИзФайла", Тип("КнопкаФормы"), нКоманднаяПанель);
	ВосстановитьЗначенияИзФайла.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	ВосстановитьЗначенияИзФайла.ИмяКоманды = "ВосстановитьЗначенияИзФайла";
	СохранитьЗначенияВФайл = Элементы.Добавить(НаименованиеСтраницы + "СохранитьЗначенияВФайл", Тип("КнопкаФормы"), нКоманднаяПанель);
	СохранитьЗначенияВФайл.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	СохранитьЗначенияВФайл.ИмяКоманды = "СохранитьЗначенияВФайл";	
	
	ВосстановитьНастройки = Элементы.Добавить(НаименованиеСтраницы + "ВосстановитьНастройки", Тип("КнопкаФормы"), нКоманднаяПанель);
	ВосстановитьНастройки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	ВосстановитьНастройки.ИмяКоманды = "ВосстановитьНастройки";
	СохранитьНастройки = Элементы.Добавить(НаименованиеСтраницы + "СохранитьНастройки", Тип("КнопкаФормы"), нКоманднаяПанель);
	СохранитьНастройки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	СохранитьНастройки.ИмяКоманды = "СохранитьНастройки";	
				
	ГруппаПеренумерования = Элементы.Добавить(НаименованиеСтраницы + "НумерацияКолонок", Тип("ГруппаФормы"), нКоманднаяПанель);
	ГруппаПеренумерования.Вид = ВидГруппыФормы.Подменю;
	ГруппаПеренумерования.Заголовок = "Нумерация колонок";
	
	ПеренумероватьКолонки = Элементы.Добавить(НаименованиеСтраницы + "РучнаяНумерацияКолонокТабличногоДокумента", Тип("КнопкаФормы"), ГруппаПеренумерования);
	ПеренумероватьКолонки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;	
	ПеренумероватьКолонки.ИмяКоманды = "РучнаяНумерацияКолонокТабличногоДокумента";
	ПеренумероватьКолонки.Пометка = РучнаяНумерацияКолонокТабличногоДокумента;
	
	ПеренумероватьКолонки = Элементы.Добавить(НаименованиеСтраницы + "ПеренумероватьКолонки", Тип("КнопкаФормы"), ГруппаПеренумерования);
	ПеренумероватьКолонки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;	
	ПеренумероватьКолонки.ИмяКоманды = "ПеренумероватьКолонки";	

	Если НЕ ЭтоДопСтраница И НЕ ЗагружаетсяДоОбъекта Тогда
		УстановитьФлажки = Элементы.Добавить(НаименованиеСтраницы + "События", Тип("КнопкаФормы"), нКоманднаяПанель);
		УстановитьФлажки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		УстановитьФлажки.ИмяКоманды = "События";
	КонецЕсли;
	
	// Добавляем таблицу значений на форму.
	ЭлементТаблицаФормы = Элементы.Добавить(НаименованиеСтраницы, Тип("ТаблицаФормы"), СтраницаГруппыРеквизитов);
    ЭлементТаблицаФормы.ПутьКДанным = НаименованиеСтраницы;
	ЭлементТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	                                                                                 
	ТЗ_Основа = ДанныеФормыВЗначение(ПодготовленнаяТаблицаРеквизитов, Тип("ТаблицаЗначений"));
	Для каждого Колонка Из ТЗ_Основа.Колонки Цикл
		нРеквизит = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, НаименованиеСтраницы, Колонка.Заголовок);
		МассивДобавляемыхРеквизитов.Добавить(нРеквизит);	
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);		
			
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "Пометка", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "Пометка";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "ПредставлениеРеквизита", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "ПредставлениеРеквизита";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Заголовок = "Представление реквизита";
	
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "ПолеПоиска", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "ПолеПоиска";
	НовыйЭлемент.Заголовок = "Поле поиска";
	
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "ОписаниеТипов", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "ОписаниеТипов";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора","ТаблицаЗагружаемыхРеквизитовОписаниеТиповНачалоВыбора");
    НовыйЭлемент.Заголовок = "Описание типов";
	
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "РежимЗагрузки", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "РежимЗагрузки";
    НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Добавить("Искать");
	НовыйЭлемент.СписокВыбора.Добавить("Устанавливать");
	НовыйЭлемент.СписокВыбора.Добавить("Вычислять");	
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ТаблицаЗагружаемыхРеквизитовРежимЗагрузкиПриИзменении");
	НовыйЭлемент.Заголовок = "Режим загрузки";
	
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "НомерКолонки", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "НомерКолонки";
	НовыйЭлемент.Заголовок = "Номер колонки";
	
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "ПредставлениеЗначенияПоУмолчанию", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "ПредставлениеЗначенияПоУмолчанию";
    НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюНачалоВыбора");
	НовыйЭлемент.СвязьПоТипу = Новый СвязьПоТипу("Элементы."+НаименованиеСтраницы + ".ТекущиеДанные.ОписаниеТипов");
	НовыйЭлемент.Заголовок = "Значение по умолчанию";
	НовыйЭлемент.ВыбиратьТип = Ложь;
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.РедактированиеТекста = Ложь;
	
	НовыйЭлемент = Элементы.Добавить(НаименованиеСтраницы + "ПредставлениеДопУсловий", Тип("ПолеФормы"), ЭлементТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = НаименованиеСтраницы + "." + "ПредставлениеДопУсловий";
	НовыйЭлемент.ВыбиратьТип = Ложь;
	НовыйЭлемент.КнопкаВыбора = Истина;
    НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ТаблицаЗагружаемыхРеквизитовПредставлениеДопУсловийНачалоВыбора");
	НовыйЭлемент.УстановитьДействие("Очистка", "ТаблицаЗагружаемыхРеквизитовПредставлениеДопУсловийОчистка");
	НовыйЭлемент.Заголовок = "Представление доп. условий";
	НовыйЭлемент.РедактированиеТекста = Ложь;
	
	ДобавитьУсловноеОформлениеТаблицыНастроек(НаименованиеСтраницы);
	
	УстановитьВидимостьКомандНаПанелях();
	
	Возврат НаименованиеСтраницы;
	
КонецФункции

&НаСервере
// Процедура получает список справочников где, основной справочник является владельцем.
//
Процедура ПолучитьПодчиненныеСправочники()
	
	СписокДобавляемыхСтраниц.Очистить();
	
	Если ЗначениеЗаполнено(ТипОбъектаСправочника) Тогда
		МетСпр = Метаданные.Справочники;
		
		Для каждого Спр Из МетСпр Цикл
			Для каждого Владелец Из Спр.Владельцы Цикл
				Если Владелец = Метаданные.Справочники[ТипОбъектаСправочника] Тогда
					СписокДобавляемыхСтраниц.Добавить(Спр.Имя, Спр.Синоним);	
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура заполняет настройками дополнительно созданную страницу настройки.
//
// 	НаименованиеСтраницы - Наименование страницы настройки которую требуется заполнить (строка),
//	ОбъектЗагрузки - объект метаданных настройками загрузки которого заполняется страница (строка),
//	ЭтоРегистр - Определяет, что добавляемая страница, является настройкой для загрузки в один из регистров (булево). 
//
Процедура ЗаполнитьНастройкамиСозданнуюСтраницу(НаименованиеСтраницы, ОбъектЗагрузки, ЭтоРегистр = Ложь, ЗагружаетсяДоОбъекта = Ложь)
	
	Если ЗагружаетсяДоОбъекта Тогда
		ТекРежимЗагрузки = 0;
	Иначе
		ТекРежимЗагрузки = РежимЗагрузки;
	КонецЕсли;
	
	ТЗ = РеквизитФормыВЗначение(НаименованиеСтраницы);	
	Если ТекРежимЗагрузки = 0 Тогда
		ЗаполнитьНастройкиКолонокСправочника(ТЗ, ОбъектЗагрузки, ТекРежимЗагрузки);	
	ИначеЕсли ТекРежимЗагрузки = 1 ИЛИ ТекРежимЗагрузки = 5 Тогда
		Если ЭтоРегистр Тогда
			ЗаполнитьВТаблицуЗначенийДвиженияРегистраДокумента(ОбъектЗагрузки, НаименованиеСтраницы);
			ЗаполнитьНастройкиКолонокРегистраДокумента(ТЗ, ОбъектЗагрузки, ЭтоРегистр);
		Иначе
			ЗаполнитьНастройкиКолонокТабличнойЧасти(ТЗ, ОбъектЗагрузки);
		КонецЕсли;
	ИначеЕсли ТекРежимЗагрузки = 3 Тогда
		ЗаполнитьВТаблицуЗначенийДвиженияРегистраДокумента(ОбъектЗагрузки, НаименованиеСтраницы);
		ЗаполнитьНастройкиКолонокРегистраДокумента(ТЗ, ОбъектЗагрузки);	
	КонецЕсли;
	УстновитьПредставлениеДопУсловийТЗ(ТЗ);	
	ЗначениеВРеквизитФормы(ТЗ, НаименованиеСтраницы);

КонецПроцедуры

&НаСервере
// Процедура удаляет программно созданные реквизиты и элементы формы.
//
//	РежимВосстановления - Показывает, что происходит восстановление настроек и не требуется очищать таблицы настроек (булево).
//
Процедура ОчиститьСозданныеСтраницы(РежимВосстановления = Ложь)
	
	МассивРеквизитовУдалить = Новый Массив;
	
	Для каждого КлючИЗначение Из ТаблицыНастроек Цикл
		Элементы.Удалить(Элементы[КлючИЗначение.Ключ]);
		МассивРеквизитовУдалить.Добавить(КлючИЗначение.Значение);	
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивРеквизитовУдалить);
	
	КоличествоСозданныхПодчиненныхНастроек = 0;
	
	Если НЕ РежимВосстановления Тогда
		ОчиститьТаблицыНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура очищает таблицы настроек и добавляет на форму пустую основную таблицу настройки.
//
Процедура ОчиститьТаблицыНастроек()
	
	ТаблицыНастроек.Очистить();
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	
	ДобавитьСтраницуНастроек("ТаблицаЗагружаемыхРеквизитов", "Настройка");
	
	Если РежимЗагрузки = 5 Тогда
		НовыйЭлемент = Элементы.Добавить("Колонка_ПриИзмененииСоздатьДокумент", Тип("ПолеФормы"), Элементы["СтраницаТаблицаЗагружаемыхРеквизитов"]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Колонка_ПриИзмененииСоздатьДокумент";
		НовыйЭлемент.РежимВыбораИзСписка = Истина;
		Элементы.Переместить(Элементы["Колонка_ПриИзмененииСоздатьДокумент"], Элементы["СтраницаТаблицаЗагружаемыхРеквизитов"], Элементы["ТаблицаЗагружаемыхРеквизитовКоманднаяПанель"]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура добавляет условное оформление к добавленной странице настройки
//
//	НаименованиеЭлемента - Наименование таблицы настройки условное оформление которой нужно добавить.
//
Процедура ДобавитьУсловноеОформлениеТаблицыНастроек(НаименованиеЭлемента)
	
	Оформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".МожетБытьПолемПоиска");
	Отбор.ПравоеЗначение = Ложь;	
	ЗначениеУО = Оформление.Оформление.Элементы.Найти("ТолькоПросмотр");
	ЗначениеУО.Значение = Истина;
	ЗначениеУО.Использование = Истина;	
	ПолеУО = Оформление.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + "ПолеПоиска");
	ПолеУО.Использование = Истина;
	
	Оформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".РежимЗагрузки");
	Отбор.ПравоеЗначение = "Вычислять";	
	ЗначениеУО = Оформление.Оформление.Элементы.Найти("ТолькоПросмотр");
	ЗначениеУО.Значение = Ложь;
	ЗначениеУО.Использование = Истина;	
	ПолеУО = Оформление.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + "ПредставлениеДопУсловий");
	ПолеУО.Использование = Истина;
		
	Оформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();	
	ОтборГруппаИЛИ = Оформление.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппаИЛИ.Использование = Истина;
	ОтборГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	Отбор = ОтборГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".РежимЗагрузки");
	Отбор.ПравоеЗначение = "Устанавливать";		
	ОтборГруппаИ = ОтборГруппаИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппаИ.Использование = Истина;
	ОтборГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;	
	Отбор = ОтборГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".РежимЗагрузки");
	Отбор.ПравоеЗначение = "Искать";
	Отбор = ОтборГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".ИскатьПо");
	Отбор.ПравоеЗначение = "";
	Отбор = ОтборГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".СвязьПоВладельцу");
	Отбор.ПравоеЗначение = "";
	Отбор = ОтборГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".СвязьПоТипу");
	Отбор.ПравоеЗначение = "";
	ЗначениеУО = Оформление.Оформление.Элементы.Найти("ТолькоПросмотр");
	ЗначениеУО.Значение = Истина;
	ЗначениеУО.Использование = Истина;	
	ПолеУО = Оформление.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + "ПредставлениеДопУсловий");
	ПолеУО.Использование = Истина;
	
	Оформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + ".НеУбиратьПометку");
	Отбор.ПравоеЗначение = Истина;
	ЗначениеУО = Оформление.Оформление.Элементы.Найти("ТолькоПросмотр");
	ЗначениеУО.Значение = Истина;
	ЗначениеУО.Использование = Истина;	
	ПолеУО = Оформление.Поля.Элементы.Добавить();
	ПолеУО.Поле = Новый ПолеКомпоновкиДанных(НаименованиеЭлемента + "Пометка");
	ПолеУО.Использование = Истина;
	
КонецПроцедуры                 

#КонецОбласти
