
#Область ПеременныеМодуля

&НаКлиенте
Перем мТекущийТипОбъекта; // Хранит текущий тип объекта.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	фЭтоТолстыйКлиент = Ложь;
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда	 
		фЭтоТолстыйКлиент = Истина;	 
	#КонецЕсли  
	
	Если фЭтоТолстыйКлиент Тогда
		
		ТипОбъекта = ТекущийОбъект.ПолучитьТипЗначенияОбъекта();
		
	КонецЕсли; 
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	фЭтоТолстыйКлиент = Ложь;
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда	 
		фЭтоТолстыйКлиент = Истина;	 
	#КонецЕсли  
	Элементы.ТипОбъекта.Видимость = фЭтоТолстыйКлиент;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если фЭтоТолстыйКлиент Тогда
		
		ТекущийОбъект.СохранитьТип(ТипОбъекта);
		
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТекущийТипОбъекта = ТипОбъекта;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	Отказ = Ложь;
	ИзменениеТипаОбъекта(Отказ);
	
	Если Отказ Тогда
		
		ТипОбъекта = мТекущийТипОбъекта;
		Возврат;
		
	КонецЕсли; 
	
	мТекущийТипОбъекта = ТипОбъекта;	 
	
КонецПроцедуры // ТипОбъектаПриИзменении()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ИзменениеТипаОбъекта(Отказ)
	
	МассивТипов = ТипОбъекта.Типы();
	
	Если МассивТипов.Количество() = 1 Тогда
		
		МетаОбъект = Метаданные.НайтиПоТипу(МассивТипов[0]);
		
		Если НЕ МетаОбъект = Неопределено Тогда
			
			Объект.Наименование     = МетаОбъект.Синоним;
			Объект.ИмяОбъекта       = МетаОбъект.Имя;
			Объект.ИмяОбъектаПолное = МетаОбъект.ПолноеИмя();
			
		Иначе	
			
			Отказ = Истина;
			
			ТекстСообщения =  НСтр("ru = 'Не удалось найти объект метаданных, соответствующий выбранному типу.'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
			
		КонецЕсли; 
		
	Иначе
		
		// Выбор хотя бы одного типа контролируется платформой в системном диалоге выбора типа,
		// Следовательно, данная ветка соответствует выбору составного типа.
		ТекстСообщения =  НСтр("ru = 'Выбор составного типа недопустим!'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры // ИзменениеТипаОбъекта()

#КонецОбласти