
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьОписания();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет данными некоторые поля справочника.
//
&НаСервере
Процедура ЗаполнитьОписания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	               |	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
	               |ИЗ
	               |	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Момент, Распределение = &Ссылка) КАК бит_РаспределенияНаУслугахСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	               |	бит_РаспределенияНаУслугахСрезПоследних.Услуга";      
				   
	Запрос.УстановитьПараметр("Момент" ,КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка" ,СправочникОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		
		НовСтрока = СписокЛС.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла; 
	
	
	ТЗСписокЛС = ДанныеФормыВЗначение(СписокЛС,Тип("ТаблицаЗначений"));
	
	УслугаСписокУслуг = ТЗСписокЛС.Скопировать(,"Услуга");
	УслугаСписокУслуг.Свернуть("Услуга");
	
	ЗначениеВДанныеФормы(УслугаСписокУслуг,СписокУслуг);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_РаспределенияНаУслугахСрезПоследних.Объект
	               |ИЗ
	               |	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Момент, Распределение = &Ссылка) КАК бит_РаспределенияНаУслугахСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_РаспределенияНаУслугахСрезПоследних.Объект";      
				   
	Запрос.УстановитьПараметр("Момент" ,КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка" ,СправочникОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбъектСписокЗданий = Выборка.Объект;	
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_РаспределенияНаУслугахСрезПоследних.Период КАК Дата,
	               |	бит_РаспределенияНаУслугахСрезПоследних.Использовать КАК Использовать
	               |ИЗ
	               |	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	               |			&Момент,
	               |			Распределение = &Ссылка
	               |				И Объект = &Объект
	               |				И Использовать) КАК бит_РаспределенияНаУслугахСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_РаспределенияНаУслугахСрезПоследних.Период,
	               |	бит_РаспределенияНаУслугахСрезПоследних.Использовать
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_РаспределенияНаУслугахСрезПоследних.Период,
	               |	бит_РаспределенияНаУслугахСрезПоследних.Использовать
	               |ИЗ
	               |	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	               |			&Момент,
	               |			Распределение = &Ссылка
	               |				И Объект = &Объект
	               |				И (НЕ Использовать)) КАК бит_РаспределенияНаУслугахСрезПоследних";      
				   
	Запрос.УстановитьПараметр("Момент" ,КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка" ,СправочникОбъект.Ссылка);
	Запрос.УстановитьПараметр("Объект" ,ОбъектСписокЗданий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Использовать Тогда
			
			ДатаУстановки = Выборка.Дата;
			
		Иначе
			
			ДатаСнятия	  = Выборка.Дата;
		
		КонецЕсли; 	
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Услуги устанавливаются документом ""Установка распределения"".");
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередНачаломИзменения(Элемент, Отказ)
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Услуги устанавливаются документом ""Установка распределения"".");
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

