
#Область ПеременныеМодуля

&НаКлиенте
Перем мФизЛицо; // Физическое лицо.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Заголовок = Строка("Воинский учет физ. лица " + Запись.ФизЛицо);
	
	мФизЛицо = Запись.ФизЛицо;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ВоинскийУчет"), Запись.ФизЛицо);
	Оповестить("ОбновитьДанныеВоинскогоУчета", Запись.ФизЛицо);
	Если мФизЛицо <> Запись.ФизЛицо Тогда
		// Оповестим также форму того физлица, данные которого начинали редактировать.
		Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ВоинскийУчет"), мФизЛицо);
		Оповестить("ОбновитьДанныеВоинскогоУчета", мФизЛицо);
		мФизЛицо = Запись.ФизЛицо;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	ЭтаФорма.Заголовок = Строка("Воинский учет физ. лица " + Запись.ФизЛицо);
	
КонецПроцедуры

#КонецОбласти