
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НаименованиеСоставное = ПолучитьНаименованиеСоставное(Объект.Родитель);
	
	// БИТ_ЖКХ_22112013_начало_изменений Для тонкого клиента
	// Если ТипЗнч(Объект.Родитель.НаименованиеСоставное) = Тип("СправочникСсылка.Контрагенты") Тогда   - было.
	Если ТипЗнч(НаименованиеСоставное) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Элементыформы.Родитель.Наименование = Родитель.НаименованиеСоставное.Наименование;.
		// Объект.Контрагент = Объект.Родитель.НаименованиеСоставное; - было.
		Объект.Контрагент = НаименованиеСоставное;
		// БИТ_ЖКХ_22112013_окончание_изменений
		
		Элементы.Контрагент.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыОбработчикиСобытийЭлементовФормы

//  Процедура - обработчик события "ПриИзменении" поля ввода "НомерДокумента".
//
&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	
	ЗаполнитьСведения();
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Наименование".
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьСведения();
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Дата".
// 
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьСведения();
	
КонецПроцедуры	

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет свединя элемента справочника.
//
&НаКлиенте
Процедура ЗаполнитьСведения()
	
	Если ЗначениеЗаполнено(Объект.Наименование) И ЗначениеЗаполнено(Объект.НомерДокумента) И ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Значение = Объект.Наименование +" № "+Объект.НомерДокумента+" от "+ Формат(Объект.Дата,"ДФ=dd.MM.yyyy"); 
		Объект.СведенияОДокументе = Значение;
		// Наименование = СведенияОДокументе;.
		
	КонецЕсли; 
	
КонецПроцедуры

// БИТ_ЖКХ_22112013_начало_изменений Для тонкого клиента
&НаСервереБезКонтекста
Функция ПолучитьНаименованиеСоставное(Родитель)
	Возврат Родитель.НаименованиеСоставное;	
КонецФункции	
// БИТ_ЖКХ_22112013_окончание_изменений

#КонецОбласти
