
//#Область ЗачетАвансов

//// Готовится таблица для формирования проводок зачета авансов по расчетам с поставщиками и покупателями.
//// На основании подготовленных функцией ПодготовитьПараметрыЗачетАванса данных документа.
//// И остатков по счету авансов на момент проведения.
//// Таблица содержит как данные по зачтенным авансам, так и данные о возникшей по документу-регистратору задолженности.
//// Вызывается при проведении документов поступления и реализации.
////
//// Параметры:
////  ТаблицаДокумента  - <ТаблицаЗначений> - данные документа,.
////  По которым определяется, какие движения будут сформированы.
////  ТаблицаДокументыАвансов - <ТаблицаЗначений> - данные документа.
////  О документах расчетов, авансы по которым зачитываются, и о суммах зачета.
////  Используется только при способе зачета авансов "По документу".
////  ТаблицаРеквизиты  - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////  Отказ  - <Булево> - флаг отказа от проведения.
////
//Функция ПодготовитьТаблицуВзаиморасчетовЗачетАвансов(ТаблицаДокумента, ТаблицаДокументыАвансов, ТаблицаРеквизиты, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыТаблицыВзаиморасчетовЗачетАвансов(ТаблицаДокумента, ТаблицаДокументыАвансов, ТаблицаРеквизиты);

//	ТаблицаВзаиморасчетов = ПустаяТаблицаВзаиморасчетовЗачетАвансов();
//	
//	Если Параметры.Реквизиты.Количество() = 0
//		ИЛИ Параметры.ТаблицаДокумента.Количество() = 0 Тогда
//		Возврат ТаблицаВзаиморасчетов;
//	КонецЕсли;
//	
//	Реквизиты = Параметры.Реквизиты[0];

//	ОстаткиАвансов = ПолучитьОстаткиАвансов(Параметры.ТаблицаДокумента, Реквизиты, Отказ);

//	Для каждого СтрокаДокумента Из Параметры.ТаблицаДокумента Цикл

//		НераспределенныйОстаток = СтрокаДокумента.СуммаВзаиморасчетов;

//		Если Реквизиты.СпособЗачетаАвансов <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда

//			ОстаткиАвансовПоДоговору = ОстаткиАвансов.НайтиСтроки(
//				Новый Структура("Счет,Контрагент,ДоговорКонтрагента",
//				СтрокаДокумента.СчетАвансов,
//				СтрокаДокумента.Контрагент,
//				СтрокаДокумента.ДоговорКонтрагента));

//			ДобавитьСтрокиЗачтенныхАвансов(
//				ТаблицаВзаиморасчетов,
//				НераспределенныйОстаток,
//				ОстаткиАвансовПоДоговору,
//				СтрокаДокумента,
//				Реквизиты);

//		Иначе // ПоДокументу.

//			Для каждого СтрокаТаблицыАвансов Из Параметры.ДокументыАвансов Цикл

//				Если СтрокаТаблицыАвансов.СуммаЗачета > 0 Тогда
//					НераспределенныйОстатокПоДокументу = СтрокаТаблицыАвансов.СуммаЗачета;
//					НераспределенныйОстаток = НераспределенныйОстаток - СтрокаТаблицыАвансов.СуммаЗачета;
//				Иначе
//					НераспределенныйОстатокПоДокументу = НераспределенныйОстаток;
//				КонецЕсли;

//				ОстаткиАвансовПоДокументуРасчетов = ОстаткиАвансов.НайтиСтроки(
//					Новый Структура("Счет,Контрагент,ДоговорКонтрагента,ДокументРасчетов",
//					СтрокаТаблицыАвансов.СчетАвансов,
//					СтрокаТаблицыАвансов.Контрагент,
//					СтрокаТаблицыАвансов.ДоговорКонтрагента,
//					СтрокаТаблицыАвансов.ДокументАванса));

//				ДобавитьСтрокиЗачтенныхАвансов(
//					ТаблицаВзаиморасчетов,
//					НераспределенныйОстатокПоДокументу,
//					ОстаткиАвансовПоДокументуРасчетов,
//					СтрокаДокумента,
//					Реквизиты);

//				ПроверитьНехваткуОстаткаАванса(
//					НераспределенныйОстатокПоДокументу,
//					СтрокаТаблицыАвансов,
//					СтрокаДокумента.ВалютаВзаиморасчетов,
//					Реквизиты.Регистратор,
//					Отказ);

//				Если СтрокаТаблицыАвансов.СуммаЗачета = 0 Тогда
//					НераспределенныйОстаток = НераспределенныйОстатокПоДокументу;
//				КонецЕсли;

//			КонецЦикла;

//		КонецЕсли;

//		ДобавитьСтрокуЗадолженности(
//			ТаблицаВзаиморасчетов,
//			НераспределенныйОстаток,
//			СтрокаДокумента,
//			Реквизиты);

//	КонецЦикла;

//	Возврат ТаблицаВзаиморасчетов;

//КонецФункции

//// Формируются проводки зачета авансов по расчетам с поставщиками и покупателями.
//// Вызывается при проведении документов поступления и реализации.
////
//// Параметры:
////  ТаблицаВзаиморасчетов - <ТаблицаЗначений> - таблица с данными.
////  По зачету авансов в разрезе документов расчетов.
////                          Создается функцией ПодготовитьТаблицуВзаиморасчетовЗачетАвансов.
////  ТаблицаРеквизиты      - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                          Структура таблицы описана в функции ПодготовитьПараметрыЗачетАвансов.
////  Движения              - Коллекция движений документа.
////  Отказ                 - <Булево> - флаг отказа от проведения.
////
//Процедура СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыЗачетАвансов(ТаблицаВзаиморасчетов, ТаблицаРеквизиты);

//	Если Параметры.Реквизиты.Количество() = 0
//		ИЛИ Параметры.Взаиморасчеты.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;

//	Реквизиты = Параметры.Реквизиты[0];

//	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);

//	ДтКтРасчетов = ?(Реквизиты.НаправлениеДвижения = "Поступление", "Дт", "Кт");
//	ДтКтАвансов  = ?(ДтКтРасчетов = "Дт", "Кт", "Дт");

//	ЭтоВозвратОтПокупателя = Реквизиты.ЭтоВозврат И (Реквизиты.НаправлениеДвижения = "Поступление");

//	// Для проводок по вспомогательным счетам задолженности УСН.
//	ДтКтУСН     = ?(ЭтоВозвратОтПокупателя, ?(ДтКтАвансов = "Дт", "Кт", "Дт"), ДтКтАвансов);
//	ЗнакСуммУСН = ?(ЭтоВозвратОтПокупателя, -1, 1);

//	НачалоОценкиНУПоКурсуАвансов = Константы.НачалоОценкиДоходовИРасходовВНУПоКурсуАвансов.Получить();
//	НУПоКурсуАвансов = ЗначениеЗаполнено(НачалоОценкиНУПоКурсуАвансов) И НачалоОценкиНУПоКурсуАвансов <= Реквизиты.Период;
//	
//	Для каждого СтрокаВзаиморасчетов Из Параметры.Взаиморасчеты Цикл

//		СодержаниеОперации = СодержаниеПроводокПоЗачетуАвансов(
//			Реквизиты.НаправлениеДвижения, Реквизиты.ЭтоВозврат, СтрокаВзаиморасчетов.ВидДоговора);

//		// Основная проводка по зачету аванса.

//		Если (СтрокаВзаиморасчетов.ДокументРасчетов <> Реквизиты.Регистратор) И (НЕ ЭтоВозвратОтПокупателя) Тогда

//			Проводка = Движения.Хозрасчетный.Добавить();

//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = СодержаниеОперации;

//			Проводка["Счет" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СчетРасчетов;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "ДокументыРасчетовСКонтрагентами", 
//																															ДокументРасчетовПоЗачетуАвансов(Реквизиты.Регистратор));
//			СвойстваСчетаРасчетов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//			КонецЕсли;
//			Если СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.ПодразделениеРасчетов;
//			КонецЕсли;

//			Проводка["Счет" + ДтКтАвансов] = СтрокаВзаиморасчетов.СчетАвансов;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтАвансов], Проводка["Субконто" + ДтКтАвансов], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтАвансов], Проводка["Субконто" + ДтКтАвансов], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтАвансов], Проводка["Субконто" + ДтКтАвансов], "ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//			СвойстваСчетаАвансов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтАвансов]);
//			Если СвойстваСчетаАвансов.Валютный Тогда
//				Проводка["Валюта" + ДтКтАвансов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтАвансов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//			Конецесли;
//			Если СвойстваСчетаАвансов.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтАвансов] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Если СтрокаВзаиморасчетов.РасчетыВВалюте
//				И НЕ Реквизиты.ЭтоВозврат Тогда
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;
//			Иначе
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаРуб;
//			КонецЕсли;

//			Если ОтражатьВНалоговомУчете Тогда
//				
//				Если (СтрокаВзаиморасчетов.РасчетыВУсловныхЕдиницах ИЛИ НУПоКурсуАвансов)
//					И НЕ Реквизиты.ЭтоВозврат Тогда
//					СуммаНУ = СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;
//				Иначе
//					СуммаНУ = СтрокаВзаиморасчетов.СуммаРуб;
//				КонецЕсли;
//				Если СвойстваСчетаРасчетов.НалоговыйУчет Тогда
//					Проводка["СуммаНУ" + ДтКтРасчетов] = СуммаНУ;
//					Проводка["СуммаПР" + ДтКтРасчетов] = Проводка.Сумма - СуммаНУ;
//					Проводка["СуммаВР" + ДтКтРасчетов] = 0;
//				КонецЕсли;
//				Если СвойстваСчетаАвансов.НалоговыйУчет Тогда
//					Проводка["СуммаНУ" + ДтКтАвансов] = СуммаНУ;
//					Проводка["СуммаПР" + ДтКтАвансов] = Проводка.Сумма - СуммаНУ;
//					Проводка["СуммаВР" + ДтКтАвансов] = 0;
//				КонецЕсли;

//			КонецЕсли;

//		КонецЕсли;

//		// Проводки по вспомогательным счетам задолженности УСН.

//		Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда

//			ФормироватьПроводкиУСН			= Реквизиты.УчитыватьЗадолженностьУСН;
//			ФормироватьПроводкиУСНПатент	= Реквизиты.УчитыватьЗадолженностьУСНПатент; 

//			ДокументРасчетовВПроводку = СтрокаВзаиморасчетов.ДокументРасчетов;
//			Если СтрокаВзаиморасчетов.ДокументРасчетов = Реквизиты.Регистратор Тогда
//            	ДокументРасчетовВПроводку = ДокументРасчетовПоЗачетуАвансов(СтрокаВзаиморасчетов.ДокументРасчетов);
//			КонецЕсли; 
//			
//			// Проводка по вспомогательному счету УСН по задолженности ЕНВД.

//			Если ФормироватьПроводкиУСН И (СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД <> 0) Тогда

//				Проводка = Движения.Хозрасчетный.Добавить();

//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = "Расчеты по деятельности ЕНВД";

//				Если СтрокаВзаиморасчетов.РасчетыВВалюте Тогда
//					Проводка["Счет" + ДтКтУСН]          = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД;
//					Проводка["Валюта" + ДтКтУСН]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтУСН] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД * ЗнакСуммУСН;
//				Иначе
//					Проводка["Счет" + ДтКтУСН]          = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД;
//				Конецесли;

//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "ДокументыРасчетовСКонтрагентами", ДокументРасчетовВПроводку);
//				
//				СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтУСН]);
//				Если СвойстваСчета.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтУСН] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;

//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаРуб_ЕНВД * ЗнакСуммУСН;

//			КонецЕсли;
//			
//			Если ФормироватьПроводкиУСНПатент И (СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент <> 0) Тогда
//				
//				Проводка = Движения.Хозрасчетный.Добавить();
//			
//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = ?(Реквизиты.Период < УчетУСН.ДатаНачалаДействияПатентнойСистемы(),
//					НСтр("ru = 'Расчеты по деятельности УСН на патенте'"),
//					НСтр("ru = 'Расчеты по деятельности на патенте'"));
//	
//				Если СтрокаВзаиморасчетов.РасчетыВВалюте Тогда
//					Проводка["Счет" + ДтКтУСН]          = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент;
//					Проводка["Валюта" + ДтКтУСН]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтУСН] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент * ЗнакСуммУСН;
//				Иначе
//					Проводка["Счет" + ДтКтУСН]          = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент;
//				Конецесли;
//				
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "ДокументыРасчетовСКонтрагентами", ДокументРасчетовВПроводку);

//				СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтУСН]);
//				Если СвойстваСчета.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтУСН] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;

//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаРуб_Патент * ЗнакСуммУСН;
//			
//			КонецЕсли;

//			// Проводка по вспомогательному счету УСН по задолженности перед комитентом.

//			Если ФормироватьПроводкиУСН И (СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента <> 0) Тогда

//				Проводка = Движения.Хозрасчетный.Добавить();

//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = "Расчеты за товары и услуги комитента";

//				Если СтрокаВзаиморасчетов.РасчетыВВалюте Тогда
//					Проводка["Счет" + ДтКтУСН]          = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент;
//					Проводка["Валюта" + ДтКтУСН]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтУСН] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента * ЗнакСуммУСН;
//				Иначе
//					Проводка["Счет" + ДтКтУСН]          = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент;
//				Конецесли;

//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтУСН], Проводка["Субконто" + ДтКтУСН], "ДокументыРасчетовСКонтрагентами", ДокументРасчетовВПроводку);

//				СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтУСН]);
//				Если СвойстваСчета.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтУСН] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;

//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаРуб_Комитента * ЗнакСуммУСН;

//			КонецЕсли;

//		КонецЕсли;

//	КонецЦикла;

//	Движения.Хозрасчетный.Записывать = Истина;

//КонецПроцедуры

//// Формируются проводки зачета авансов по расчетам с комитентами.
//// Вызывается при проведении документов реализации, которыми реализуются товары и услуги комитентов.
//// После определения списанных партий комиссионных товаров процедурой списания партий.
////
//// Параметры:
////  ТаблицаТоварыУслугиКомитентов - <ТаблицаЗначений> - таблица реализованных товаров и услуг комитентов.
////  ТаблицаРеквизиты  - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                      Структура таблицы описана в функции ПодготовитьПараметрыЗачетАвансов.
////  Движения  - коллекция движений документа.
////  Отказ     - <Булево> - флаг отказа от проведения.
////
//Процедура СформироватьДвиженияЗачетАвансовКомитентов(ТаблицаТоварыУслугиКомитентов, ТаблицаРеквизиты, Движения, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыЗачетАвансовКомитентов(ТаблицаТоварыУслугиКомитентов, ТаблицаРеквизиты);

//	Если Параметры.Реквизиты.Количество() = 0
//		ИЛИ Параметры.ТоварыУслугиКомитентов.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Реквизиты = Параметры.Реквизиты[0];

//	// Готовим из таблицы товаров и услуг комитентов стандартную таблицу расчетов по документу.

//    Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ТаблицаТоварыУслугиКомитентов", Параметры.ТоварыУслугиКомитентов);
//	Запрос.УстановитьПараметр("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
//	Запрос.УстановитьПараметр("Регистратор", Реквизиты.Регистратор);
//	Запрос.УстановитьПараметр("ВидДоговораСКомитентом", БухгалтерскийУчетПереопределяемый.ПолучитьВидДоговораСКомитентом());
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ТаблицаТоварыУслугиКомитентов.Подразделение КАК Подразделение,
//	|	ТаблицаТоварыУслугиКомитентов.Комитент КАК Контрагент,
//	|	ТаблицаТоварыУслугиКомитентов.ДоговорКомиссии КАК ДоговорКонтрагента,
//	|	ТаблицаТоварыУслугиКомитентов.ВалютаРасчетовСКомитентом КАК ВалютаВзаиморасчетов,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТоварыУслугиКомитентов.ВалютаРасчетовСКомитентом = &ВалютаРеглУчета
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК РасчетыВВалюте,
//	|	ТаблицаТоварыУслугиКомитентов.СчетРасчетовСКомитентом КАК СчетРасчетов,
//	|	ТаблицаТоварыУслугиКомитентов.СчетАвансовСКомитентом КАК СчетАвансов,
//	|	ТаблицаТоварыУслугиКомитентов.СуммаРасчетовСКомитентом КАК СуммаВзаиморасчетов,
//	|	ТаблицаТоварыУслугиКомитентов.СуммаРуб КАК СуммаРуб
//	|ПОМЕСТИТЬ ТаблицаТоварыУслугиКомитентов
//	|ИЗ
//	|	&ТаблицаТоварыУслугиКомитентов КАК ТаблицаТоварыУслугиКомитентов
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаТоварыУслугиКомитентов.Подразделение,
//	|	ТаблицаТоварыУслугиКомитентов.Контрагент,
//	|	ТаблицаТоварыУслугиКомитентов.ДоговорКонтрагента,
//	|	ВЫРАЗИТЬ(ТаблицаТоварыУслугиКомитентов.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов).УчетАгентскогоНДС КАК УчетАгентскогоНДС,
//	|	ЗНАЧЕНИЕ(Перечисление.СпособыЗачетаАвансов.Автоматически) КАК СпособЗачетаАвансов,
//	|	&ВидДоговораСКомитентом КАК ВидДоговора,
//	|	ТаблицаТоварыУслугиКомитентов.ВалютаВзаиморасчетов,
//	|	ТаблицаТоварыУслугиКомитентов.РасчетыВВалюте,
//	|	&Регистратор КАК ДокументРасчетов,
//	|	ЛОЖЬ КАК РасчетыВУсловныхЕдиницах,
//	|	ТаблицаТоварыУслугиКомитентов.СчетРасчетов,
//	|	ТаблицаТоварыУслугиКомитентов.СчетАвансов,
//	|	СУММА(ТаблицаТоварыУслугиКомитентов.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
//	|	0 КАК СуммаВзаиморасчетовЕНВД,
//	|	0 КАК СуммаВзаиморасчетовПатент,
//	|	0 КАК СуммаВзаиморасчетовКомитента,
//	|	СУММА(ТаблицаТоварыУслугиКомитентов.СуммаРуб) КАК СуммаРуб
//	|ИЗ
//	|	ТаблицаТоварыУслугиКомитентов КАК ТаблицаТоварыУслугиКомитентов
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТоварыУслугиКомитентов.Подразделение,
//	|	ТаблицаТоварыУслугиКомитентов.Контрагент,
//	|	ТаблицаТоварыУслугиКомитентов.ДоговорКонтрагента,
//	|	ТаблицаТоварыУслугиКомитентов.ВалютаВзаиморасчетов,
//	|	ТаблицаТоварыУслугиКомитентов.РасчетыВВалюте,
//	|	ТаблицаТоварыУслугиКомитентов.СчетРасчетов,
//	|	ТаблицаТоварыУслугиКомитентов.СчетАвансов";

//	ТаблицаДокумента = Запрос.Выполнить().Выгрузить();

//	// Формирование таблицы взаиморасчетов и движений по зачету авансов происходит стандартным образом.

//	ТаблицаДокументовАванса = Неопределено; // Для способа зачета "Автоматически" не используется.

//	ТаблицаВзаиморасчетыКомитентов = ПодготовитьТаблицуВзаиморасчетовЗачетАвансов(
//		ТаблицаДокумента, ТаблицаДокументовАванса, ТаблицаРеквизиты, Отказ);

//	СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчетыКомитентов, ТаблицаРеквизиты, Движения, Отказ);

//КонецПроцедуры

//// Подготовка параметров для функции ПодготовитьТаблицуВзаиморасчетовЗачетАвансов.
//// На основании переданных документом таблиц.
////
//// Параметры:
////  ТаблицаДокумента  - <ТаблицаЗначений> - данные документа,.
////  По которым определяется, какие движения будут сформированы.
////                      Создается в модуле менеджера документа.
////  ТаблицаДокументыАвансов - <ТаблицаЗначений> - данные.
////  Документа о документах расчетов,.
////  Аавансы по которым зачитываются, и о суммах зачета.
////                      Используется только при способе зачета авансов "По документу",.
////                      Для других способов может быть передана пустая таблица.
////                      Создается в модуле менеджера документа.
////  ТаблицаРеквизиты  - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                      Создается в модуле менеджера документа.
////
//// Возвращаемое значение:
////   <Структура>   - структура из 3 таблиц: ТаблицаДокумента, ДокументыАвансов, Реквизиты.
////
//Функция ПодготовитьПараметрыТаблицыВзаиморасчетовЗачетАвансов(ТаблицаДокумента, ТаблицаДокументыАвансов, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.ТаблицаДокумента.

//	СписокОбязательныхКолонок = ""
//	+ "Контрагент,"                    // <СправочникСсылка.Контрагенты> - контрагент, аванс по которому зачитывается.
//	+ "ДоговорКонтрагента,"            // <СправочникСсылка.ДоговорыКонтрагентов> - договор, аванс по которому зачитывается.
//	+ "ВалютаВзаиморасчетов,"          // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "ВидДоговора,"                   //
//	+ "РасчетыВУсловныхЕдиницах,"      // <Булево> - Истина для договора с расчетами в условных единицах.
//	+ "УчетАгентскогоНДС,"             // <Булево> - Истина договор предусматривает исполнение обязанностей налогового агента по НДС.
//	+ "РасчетыВВалюте,"                // <Булево> - Истина для договора с расчетами в любой валюте, кроме рублей (в т.ч и в условных единицах).
//	+ "ДокументРасчетов,"              // <ДокументСсылка> - документ-регистратор.
//	+ "СчетРасчетов,"                  // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом.
//	+ "СчетАвансов,"                   // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом по авансам.
//	+ "Подразделение,"                 // <Ссылка на справочник подразделений>.
//	+ "СуммаВзаиморасчетов,"           // <Число,15,2> - сумма поступления или реализации в валюте взаиморасчетов.
//	+ "СуммаРуб,"                      // <Число,15,2> - сумма поступления или реализации в рублях.
//	+ "СуммаВзаиморасчетовКомитента,"  // <Число,15,2> - сумма в валюте взаиморасчетов реализованных товаров и услуг комитентов по организации на УСН.
//	+ "СуммаВзаиморасчетовПатент,"     // <Число,15,2> - сумма в валюте взаиморасчетов реализованных товаров и услуг по деяетльности на патенте.
//	+ "СуммаВзаиморасчетовЕНВД";       // <Число,15,2> - сумма в валюте взаиморасчетов реализованных товаров и услуг по деятельности ЕНВД по организации на УСН.

//	Параметры.Вставить("ТаблицаДокумента", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаДокумента, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента,"           // <СправочникСсылка.Валюты>. 
//	+ "СпособЗачетаАвансов,"       // <ПеречислениеСсылка.СпособыЗачетаАвансов>.
//	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения,"       // <Строка> - "Поступление" при зачете авансов, выданных поставщикам (при поступлении материальных ценностей).
//	                               //          - "Выбытие" при зачете авансов, полученных от покупателей (при выбытии материальных ценностей).
//	+ "ЭтоВозврат";                // <Булево> - Истина при возврате материальных ценностей (от покупателя или поставщику).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.ДокументыАвансов.

//	СписокОбязательныхКолонок = ""
//	+ "НомерСтроки,"         // <Число,6,0> - номер строки таб.части ДокументыАвансов документа поступления или реализации.
//	+ "СчетАвансов,"         // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом по авансам.
//	+ "Контрагент,"          // <СправочникСсылка.Контрагенты> - контрагент, аванс по которому зачитывается.
//	+ "ДоговорКонтрагента,"  // <СправочникСсылка.ДоговорыКонтрагентов> - договор, аванс по которому зачитывается.
//	+ "ДокументАванса,"      // <ДокументСсылка> - документ расчетов, аванс по которому зачитывается.
//	+ "СуммаЗачета";         // <Число,15,2> - сумма зачитываемого аванса в валюте взаиморасчетов,.
//	                         // Если СуммаЗачета = 0 - зачитывается масимально возможная сумма.

//	Параметры.Вставить("ДокументыАвансов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаДокументыАвансов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//// Подготовка параметров для процедуры СформироватьДвиженияЗачетАвансов.
////
//// Параметры:
////  ТаблицаВзаиморасчетов - <ТаблицаЗначений> - данные документа,.
////  По которым определяется, какие движения будут сформированы.
////                          Создается функцией ПодготовитьТаблицуВзаиморасчетовЗачетАвансов.
////  ТаблицаРеквизиты      - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////
//// Возвращаемое значение:
////   <Структура> - структура из 2 таблиц: Взаиморасчеты, Реквизиты.
////
//Функция ПодготовитьПараметрыЗачетАвансов(ТаблицаВзаиморасчетов, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения,"       // <Строка> - "Поступление" при зачете авансов, выданных поставщикам (при поступлении материальных ценностей).
//	                               //          - "Выбытие" при зачете авансов, полученных от покупателей (при выбытии материальных ценностей).
//	+ "ЭтоВозврат";                // <Булево> - Истина при возврате материальных ценностей (от покупателя или поставщику).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Взаиморасчеты.

//	СписокОбязательныхКолонок = ""
//		+ "Контрагент,"                   // <СправочникСсылка.Контрагенты>.
//		+ "ДоговорКонтрагента,"           // <СправочникСсылка.ДоговорыКонтрагентов>.
//		+ "ДокументРасчетов,"             // <ДокументСсылка>.
//		+ "ВидДоговора,"                  //
//		+ "ВалютаВзаиморасчетов,"         // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//		+ "РасчетыВУсловныхЕдиницах,"     // <Булево> - флаг расчетов в условных единицах.
//		+ "СчетРасчетов,"                 // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом.
//		+ "СчетАвансов,"                  // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов по авансам.
//		+ "Подразделение,"                // <Ссылка на справочник подразделений> - подразделение по счету авансов.
//		+ "ПодразделениеРасчетов,"        // <Ссылка на справочник подразделений> - подразделение по счету расчетов.
//		+ "РасчетыВВалюте,"               // <Булево>  - флаг расчетов в валюте (в т.ч. и в условных единицах).
//		+ "СуммаВзаиморасчетов,"          // <Число,15,2> - сумма в валюте взаиморасчетов.
//		+ "СуммаРубПоКурсуАванса,"        // <Число,15,2> - сумма в рублях по курсу на дату аванса.
//		+ "СуммаРуб,"                     // <Число,15,2> - сумма в рублях (для валютных расчетов - по курсу на дату документа).
//		+ "СуммаВзаиморасчетовЕНВД,"      // <Число,15,2> - сумма в валюте расчетов по договору по деятельности ЕНВД.
//		+ "СуммаРуб_ЕНВД,"                // <Число,15,2> - сумма в рублях по деятельности ЕНВД.
//		+ "СуммаВзаиморасчетовПатент,"    // <Число,15,2> - сумма в валюте расчетов по договору по деятельности на патенте.
//		+ "СуммаРуб_Патент,"              // <Число,15,2> - сумма в рублях по деятельности на патенте.
//		+ "СуммаВзаиморасчетовКомитента," // <Число,15,2> - сумма в валюте расчетов по договору при реализации товаров и услуг комитентов.
//		+ "СуммаРуб_Комитента";           // <Число,15,2> - сумма в рублях при реализации товаров и услуг комитентов.

//	Параметры.Вставить("Взаиморасчеты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаВзаиморасчетов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//// Подготовка параметров для процедуры СформироватьДвиженияЗачетАвансовКомитентов.
////
//// Параметры:
////  ТаблицаТоварыУслугиКомитентов - <ТаблицаЗначений> - данные о реализованных товарах и услугах комитентов.
////
//// Возвращаемое значение:
////   <Структура> - структура из 1 таблицы: ТоварыУслугиКомитентов.
////
//Функция ПодготовитьПараметрыЗачетАвансовКомитентов(ТаблицаТоварыУслугиКомитентов, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Реквизиты.

//	СписокОбязательныхКолонок = ""
//		+ "Регистратор";             // <ДокументСсылка>.

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы ТоварыУслугиКомитентов.

//	СписокОбязательныхКолонок = ""
//		+ "Подразделение,"             // <Ссылка на справочник подразделений>.
//		+ "Комитент,"                  // <СправочникСсылка.Контрагенты>.
//		+ "ДоговорКомиссии,"           // <СправочникСсылка.ДоговорыКонтрагентов> - договор с комитентом.
//		+ "ВалютаРасчетовСКомитентом," // <СправочникСсылка.Валюты> - валюта расчетов по договору с комитентом.
//		+ "СчетРасчетовСКомитентом,"   // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с комитентом.
//		+ "СчетАвансовСКомитентом,"    // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов по авансам.
//		+ "СуммаРасчетовСКомитентом,"  // <Число,15,2> - сумма в валюте расчетов с комитентом.
//		+ "СуммаРуб";                  // <Число,15,2> - сумма в рублях (для валютных расчетов - по курсу на дату документа).

//	Параметры.Вставить("ТоварыУслугиКомитентов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаТоварыУслугиКомитентов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//Функция ПустаяТаблицаОстаткиАвансов()

//	ПустаяТаблица = Новый ТаблицаЗначений;
//	ПустаяТаблица.Колонки.Добавить("Счет");
//	ПустаяТаблица.Колонки.Добавить("Валюта");
//	ПустаяТаблица.Колонки.Добавить("Контрагент");
//	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента");
//	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов");
//	ПустаяТаблица.Колонки.Добавить("Подразделение");
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов");
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ");
//	ПустаяТаблица.Колонки.Добавить("СуммаНУ");

//	Возврат ПустаяТаблица;

//КонецФункции

//Функция ПустаяТаблицаВзаиморасчетовЗачетАвансов()

//	ПустаяТаблица = Новый ТаблицаЗначений();

//	ПустаяТаблица.Колонки.Добавить("Контрагент",            Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
//	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента",    БухгалтерскийУчетКлиентСерверПереопределяемый.ПолучитьОписаниеТиповДоговора());
//	ПустаяТаблица.Колонки.Добавить("ВалютаВзаиморасчетов",  Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",      Документы.ТипВсеСсылки());
//	ПустаяТаблица.Колонки.Добавить("ДатаДокументаРасчетов", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
//	ПустаяТаблица.Колонки.Добавить("Подразделение",         БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ПустаяТаблица.Колонки.Добавить("ПодразделениеРасчетов", БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",          Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("СчетАвансов",           Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("ОстатокВзаиморасчетов", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов",   ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРуб",              ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРубПоКурсуАванса", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));

//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовЕНВД",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРуб_ЕНВД",                ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовПатент",    ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРуб_Патент",              ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовКомитента", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРуб_Комитента",           ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));

//	ПустаяТаблица.Колонки.Добавить("ВидДоговора");
//	ПустаяТаблица.Колонки.Добавить("РасчетыВВалюте",           Новый ОписаниеТипов("Булево"));
//	ПустаяТаблица.Колонки.Добавить("РасчетыВУсловныхЕдиницах", Новый ОписаниеТипов("Булево"));
//	ПустаяТаблица.Колонки.Добавить("УчетАгентскогоНДС",        Новый ОписаниеТипов("Булево"));

//	Возврат ПустаяТаблица;

//КонецФункции

//Функция ПолучитьОстаткиАвансов(ТаблицаДокумента, Реквизиты, Отказ)

//	ОпределятьСостояниеРасчетов = БухгалтерскийУчетПереопределяемый.ПроводитьПоРасчетамСКонтрагентами(Реквизиты.Организация, Реквизиты.Период);

//	Если ТаблицаДокумента.Количество() = 0
//			ИЛИ Реквизиты.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать
//			ИЛИ НЕ ОпределятьСостояниеРасчетов Тогда
//		Возврат ПустаяТаблицаОстаткиАвансов();
//	КонецЕсли;

//	ТаблицаДоговоров = ТаблицаДокумента.Скопировать(, "СчетАвансов,Контрагент,ДоговорКонтрагента");
//	ТаблицаДоговоров.Свернуть("СчетАвансов,Контрагент,ДоговорКонтрагента");

//	СтрокиСПустымСчетом = Новый Массив;
//	Для каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
//		Если НЕ ЗначениеЗаполнено(СтрокаДоговора.СчетАвансов) 
//			ИЛИ (НЕ БухгалтерскийУчетВызовСервераПовтИсп.НаСчетеВедетсяУчетПоКонтрагентам(СтрокаДоговора.СчетАвансов) 
//			И НЕ БухгалтерскийУчетВызовСервераПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СтрокаДоговора.СчетАвансов)) Тогда
//			СтрокиСПустымСчетом.Добавить(СтрокаДоговора);
//		КонецЕсли;
//	КонецЦикла;
//	Для каждого СтрокаСПустымСчетом Из СтрокиСПустымСчетом Цикл
//		ТаблицаДоговоров.Удалить(СтрокаСПустымСчетом);
//	КонецЦикла;

//	Если ТаблицаДоговоров.Количество() = 0 Тогда
//		Возврат ПустаяТаблицаОстаткиАвансов();
//	КонецЕсли;

//	ТаблицаДоговоров.Индексы.Добавить("СчетАвансов");
//	ТаблицаСчетов = ТаблицаДоговоров.Скопировать(, "СчетАвансов");
//	ТаблицаСчетов.Свернуть("СчетАвансов");
//	
//	// Блокируем регистр Хозрасчетный для получения остатков.
//	Блокировка = Новый БлокировкаДанных;
//	
//	Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
//	
//		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаСчета.СчетАвансов);
//		
//		ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозрасчетный");
//		ЭлементБлокировки.УстановитьЗначение("Период",      Новый Диапазон(, Реквизиты.Период));
//		ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
//		ЭлементБлокировки.УстановитьЗначение("Счет",        СтрокаСчета.СчетАвансов);
//		
//		ОтборПоСчету = Новый Структура("СчетАвансов", СтрокаСчета.СчетАвансов);
//		ТаблицаДоговоровПоСчету = ТаблицаДоговоров.Скопировать(ОтборПоСчету, "Контрагент,ДоговорКонтрагента");
//		ЭлементБлокировки.ИсточникДанных = ТаблицаДоговоровПоСчету;
//		
//		Для НомерСубконто = 1 По ДанныеСчета.КоличествоСубконто Цикл
//			Если ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты Тогда
//				ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "Контрагент");
//			ИначеЕсли ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры Тогда
//				ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ДоговорКонтрагента");
//			КонецЕсли;
//		КонецЦикла; 
//		
//	КонецЦикла; 
//	
//	Если Реквизиты.УчитыватьЗадолженностьУСН И Реквизиты.ЭтоВозврат Тогда
//		
//		// Дополнительные блокировки по вспомогательным счетам задолженности УСН.
//		ТаблицаИсточникДанных = ТаблицаДоговоров.Скопировать(, "Контрагент,ДоговорКонтрагента");
//		ТаблицаИсточникДанных.Свернуть("Контрагент,ДоговорКонтрагента");

//		ВыборкаСчетовУСН = ПланыСчетов.Хозрасчетный.Выбрать(ПланыСчетов.Хозрасчетный.УСНВспомогательныеСчета);
//		Пока ВыборкаСчетовУСН.Следующий() Цикл
//			ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозрасчетный");
//			ЭлементБлокировки.УстановитьЗначение("Период",      Новый Диапазон(, Реквизиты.Период));
//			ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
//			ЭлементБлокировки.УстановитьЗначение("Счет",        ВыборкаСчетовУСН.Ссылка);
//			ЭлементБлокировки.ИсточникДанных = ТаблицаИсточникДанных;
//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//				ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "Контрагент");
//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//				ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ДоговорКонтрагента");
//		КонецЦикла;

//	КонецЕсли;
//	
//	Блокировка.Заблокировать();
//	
//	// Получаем остатки.
//	
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("Организация",           Реквизиты.Организация);
//	Запрос.УстановитьПараметр("МоментВремениОстатков", Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор));
//	Запрос.УстановитьПараметр("ВидыСубконтоРасчетов",  ВидыСубконтоРасчетов());
//	Запрос.УстановитьПараметр("СчетаАвансов",          РазличныеЗначенияКолонкиТаблицы(ТаблицаДоговоров, "СчетАвансов"));
//	Запрос.УстановитьПараметр("Множитель",           ?(Реквизиты.НаправлениеДвижения = "Выбытие", -1, 1));
//	Запрос.УстановитьПараметр("ПустоеПодразделение",   БухгалтерскийУчетПереопределяемый.ПустоеПодразделение());
//	МассивКонтрагенты = ТаблицаДокумента.ВыгрузитьКолонку("Контрагент");
//	МассивКонтрагенты = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивКонтрагенты);
//	Запрос.УстановитьПараметр("МассивКонтрагенты", МассивКонтрагенты);
//	МассивДоговоры    = ТаблицаДокумента.ВыгрузитьКолонку("ДоговорКонтрагента");
//	МассивДоговоры    = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивДоговоры);
//	Запрос.УстановитьПараметр("МассивДоговоры", МассивДоговоры);
//	Запрос.УстановитьПараметр("СубсчетаУСН", БухгалтерскийУчетВызовСервераПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.УСНВспомогательныеСчета));

//	Запрос.Текст = ТекстЗапросаОстаткиАвансов(Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент);

//	ОстаткиАвансов = Запрос.Выполнить().Выгрузить();
//	ОбщегоНазначенияБПВызовСервера.УпорядочитьТаблицуПоДокументу(ОстаткиАвансов, "ДокументРасчетов", "ДатаДокументаРасчетов");
//	// Индекc используется функцией ПодготовитьТаблицуВзаиморасчетовЗачетАвансов.
//	Если Реквизиты.СпособЗачетаАвансов <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
//		ОстаткиАвансов.Индексы.Добавить("Счет,Контрагент,ДоговорКонтрагента");
//	Иначе
//		ОстаткиАвансов.Индексы.Добавить("Счет,Контрагент,ДоговорКонтрагента,ДокументРасчетов");
//	КонецЕсли;

//	Возврат ОстаткиАвансов;

//КонецФункции

//Функция ТекстЗапросаОстаткиАвансов(УчитыватьЗадолженностьУСН)

//	Если УчитыватьЗадолженностьУСН Тогда

//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	Остатки.Счет КАК Счет,
//		|	Остатки.Валюта КАК Валюта,
//		|	Остатки.Субконто1 КАК Субконто1,
//		|	Остатки.Субконто2 КАК Субконто2,
//		|	Остатки.Субконто3 КАК Субконто3,
//		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение) КАК Подразделение,
//		|	ВЫБОР
//		|		КОГДА Остатки.Счет.Валютный
//		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|	КОНЕЦ КАК СуммаВзаиморасчетов,
//		|	Остатки.СуммаОстаток * &Множитель КАК СуммаБУ,
//		|	Остатки.СуммаНУОстаток * &Множитель КАК СуммаНУ
//		|ПОМЕСТИТЬ ОстаткиАвансов
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СчетаАвансов),
//		|			&ВидыСубконтоРасчетов,
//		|			Организация = &Организация
//		|				И Субконто1 В (&МассивКонтрагенты)
//		|				И Субконто2 В (&МассивДоговоры)) КАК Остатки
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА Остатки.Счет.Валютный
//		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|		КОНЕЦ > 0
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Субконто1,
//		|	Субконто2,
//		|	Субконто3,
//		|	Подразделение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ОстаткиУСН.Субконто1 КАК Субконто1,
//		|	ОстаткиУСН.Субконто2 КАК Субконто2,
//		|	ОстаткиУСН.Субконто3 КАК Субконто3,
//		|	ЕСТЬNULL(ОстаткиУСН.Подразделение, &ПустоеПодразделение) КАК Подразделение,
//		|	ВЫБОР
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД)
//		|			ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД)
//		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК СуммаВзаиморасчетовЕНВД,
//		|	ВЫБОР
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД)
//		|				ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД)
//		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК СуммаБУ_ЕНВД,
//		|	ВЫБОР
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент)
//		|			ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент)
//		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК СуммаВзаиморасчетовПатент,
//		|	ВЫБОР
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент)
//		|				ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент)
//		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК СуммаБУ_Патент,
//		|	ВЫБОР
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент)
//		|			ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент)
//		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК СуммаВзаиморасчетовКомитента,
//		|	ВЫБОР
//		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент)
//		|				ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент)
//		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК СуммаБУ_Комитента
//		|ПОМЕСТИТЬ ОстаткиАвансовУСН
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СубсчетаУСН),
//		|			&ВидыСубконтоРасчетов,
//		|			Организация = &Организация
//		|				И Субконто1 В (&МассивКонтрагенты)
//		|				И Субконто2 В (&МассивДоговоры)) КАК ОстаткиУСН
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Субконто1,
//		|	Субконто2,
//		|	Субконто3,
//		|	Подразделение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ОстаткиАвансов.Счет КАК Счет,
//		|	ОстаткиАвансов.Валюта КАК Валюта,
//		|	ОстаткиАвансов.Субконто1 КАК Контрагент,
//		|	ОстаткиАвансов.Субконто2 КАК ДоговорКонтрагента,
//		|	ОстаткиАвансов.Субконто3 КАК ДокументРасчетов,
//		|	ОстаткиАвансов.Подразделение КАК Подразделение,
//		|	СУММА(ОстаткиАвансов.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
//		|	СУММА(ОстаткиАвансов.СуммаБУ) КАК СуммаБУ,
//		|	СУММА(ОстаткиАвансов.СуммаНУ) КАК СуммаНУ,
//		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовЕНВД, 0)) КАК СуммаВзаиморасчетовЕНВД,
//		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаБУ_ЕНВД, 0)) КАК СуммаБУ_ЕНВД,
//		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовПатент, 0)) КАК СуммаВзаиморасчетовПатент,
//		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаБУ_Патент, 0)) КАК СуммаБУ_Патент,
//		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовКомитента, 0)) КАК СуммаВзаиморасчетовКомитента,
//		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаБУ_Комитента, 0)) КАК СуммаБУ_Комитента
//		|ИЗ
//		|	ОстаткиАвансов КАК ОстаткиАвансов
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиАвансовУСН КАК ОстаткиАвансовУСН
//		|		ПО ОстаткиАвансов.Субконто1 = ОстаткиАвансовУСН.Субконто1
//		|			И ОстаткиАвансов.Субконто2 = ОстаткиАвансовУСН.Субконто2
//		|			И ОстаткиАвансов.Субконто3 = ОстаткиАвансовУСН.Субконто3
//		|			И ОстаткиАвансов.Подразделение = ОстаткиАвансовУСН.Подразделение
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОстаткиАвансов.Счет,
//		|	ОстаткиАвансов.Валюта,
//		|	ОстаткиАвансов.Субконто1,
//		|	ОстаткиАвансов.Субконто2,
//		|	ОстаткиАвансов.Субконто3,
//		|	ОстаткиАвансов.Подразделение";

//	Иначе

//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	Остатки.Счет КАК Счет,
//		|	Остатки.Валюта КАК Валюта,
//		|	Остатки.Субконто1 КАК Контрагент,
//		|	Остатки.Субконто2 КАК ДоговорКонтрагента,
//		|	Остатки.Субконто3 КАК ДокументРасчетов,
//		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение) КАК Подразделение,
//		|	ВЫБОР
//		|		КОГДА Остатки.Счет.Валютный
//		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|	КОНЕЦ КАК СуммаВзаиморасчетов,
//		|	Остатки.СуммаОстаток * &Множитель КАК СуммаБУ,
//		|	Остатки.СуммаНУОстаток * &Множитель КАК СуммаНУ,
//		|	0 КАК СуммаВзаиморасчетовЕНВД,
//		|	0 КАК СуммаБУ_ЕНВД,
//		|	0 КАК СуммаВзаиморасчетовПатент,
//		|	0 КАК СуммаБУ_Патент,
//		|	0 КАК СуммаВзаиморасчетовКомитента,
//		|	0 КАК СуммаБУ_Комитента
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СчетаАвансов),
//		|			&ВидыСубконтоРасчетов,
//		|			Организация = &Организация
//		|				И Субконто1 В (&МассивКонтрагенты)
//		|				И Субконто2 В (&МассивДоговоры)) КАК Остатки
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА Остатки.Счет.Валютный
//		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|		КОНЕЦ > 0";

//	КонецЕсли;

//	Возврат ТекстЗапроса;

//КонецФункции

//Процедура ДобавитьСтрокиЗачтенныхАвансов(ТаблицаВзаиморасчетов, НераспределеннаяСумма, ОстаткиАвансов, СтрокаДокумента, Реквизиты)

//	Если (Реквизиты.УчитыватьЗадолженностьУСН или Реквизиты.УчитыватьЗадолженностьУСНПатент) И Реквизиты.ЭтоВозврат Тогда
//		СуммаВзаиморасчетовЕНВД      = СтрокаДокумента.СуммаВзаиморасчетовЕНВД;
//		СуммаВзаиморасчетовПатент    = СтрокаДокумента.СуммаВзаиморасчетовПатент;
//		СуммаВзаиморасчетовКомитента = СтрокаДокумента.СуммаВзаиморасчетовКомитента;
//	КонецЕсли;

//	Для каждого СтрокаОстатка Из ОстаткиАвансов Цикл

//		Если НераспределеннаяСумма <= 0 Тогда
//			Прервать;
//		КонецЕсли;

//		ЗачитываемыйАванс = Мин(НераспределеннаяСумма, СтрокаОстатка.СуммаВзаиморасчетов);

//		Если ЗачитываемыйАванс <= 0 Тогда
//			Продолжить;
//		КонецЕсли;

//		СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();

//		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаДокумента,
//			"СчетРасчетов,СчетАвансов,Контрагент,ДоговорКонтрагента,ВидДоговора,
//			|ВалютаВзаиморасчетов,РасчетыВВалюте,РасчетыВУсловныхЕдиницах, УчетАгентскогоНДС");
//		СтрокаВзаиморасчетов.ПодразделениеРасчетов = СтрокаДокумента.Подразделение;

//		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаОстатка,
//			"Подразделение,ДокументРасчетов,ДатаДокументаРасчетов");

//		СтрокаВзаиморасчетов.ОстатокВзаиморасчетов = СтрокаОстатка.СуммаВзаиморасчетов;
//		СтрокаВзаиморасчетов.СуммаВзаиморасчетов   = ЗачитываемыйАванс;

//		КоэффициентКурсаАванса = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
//			?(СтрокаОстатка.СуммаВзаиморасчетов = 0, 0, СтрокаОстатка.СуммаБУ / СтрокаОстатка.СуммаВзаиморасчетов));

//		КоэффициентРуб = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
//			?(СтрокаОстатка.СуммаВзаиморасчетов = 0, 0, СтрокаДокумента.СуммаРуб / СтрокаДокумента.СуммаВзаиморасчетов));

//		СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса = Окр(ЗачитываемыйАванс * КоэффициентКурсаАванса, 2);
//		СтрокаВзаиморасчетов.СуммаРуб              = Окр(ЗачитываемыйАванс * КоэффициентРуб, 2);

//		Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД = Мин(СтрокаВзаиморасчетов.СуммаВзаиморасчетов, ?(Реквизиты.ЭтоВозврат, Мин(СуммаВзаиморасчетовЕНВД, СтрокаОстатка.СуммаВзаиморасчетовЕНВД), СтрокаОстатка.СуммаВзаиморасчетовЕНВД));
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД = Макс(0, СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД);

//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента = Мин(СтрокаВзаиморасчетов.СуммаВзаиморасчетов, ?(Реквизиты.ЭтоВозврат, Мин(СуммаВзаиморасчетовКомитента, СтрокаОстатка.СуммаВзаиморасчетовКомитента), СтрокаОстатка.СуммаВзаиморасчетовКомитента));
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента = Макс(0, СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента);
//			
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент = Мин(СтрокаВзаиморасчетов.СуммаВзаиморасчетов, ?(Реквизиты.ЭтоВозврат, Мин(СуммаВзаиморасчетовПатент, СтрокаОстатка.СуммаВзаиморасчетовПатент), СтрокаОстатка.СуммаВзаиморасчетовПатент));
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент = Макс(0, СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент);

//			КоэффициентЕНВД = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
//				?(СтрокаОстатка.СуммаВзаиморасчетовЕНВД = 0, 0,
//				СтрокаОстатка.СуммаБУ_ЕНВД / СтрокаОстатка.СуммаВзаиморасчетовЕНВД));
//				
//			КоэффициентПатент = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
//				?(СтрокаОстатка.СуммаВзаиморасчетовПатент = 0, 0,
//				СтрокаОстатка.СуммаБУ_Патент / СтрокаОстатка.СуммаВзаиморасчетовПатент));

//			КоэффициентКомитента = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
//				?(СтрокаОстатка.СуммаВзаиморасчетовКомитента = 0, 0,
//				СтрокаОстатка.СуммаБУ_Комитента / СтрокаОстатка.СуммаВзаиморасчетовКомитента));

//			СтрокаВзаиморасчетов.СуммаРуб_ЕНВД      = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД * КоэффициентЕНВД, 2);
//			СтрокаВзаиморасчетов.СуммаРуб_Патент    = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент * КоэффициентПатент, 2);
//			СтрокаВзаиморасчетов.СуммаРуб_Комитента = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента * КоэффициентКомитента, 2);

//			СтрокаОстатка.СуммаВзаиморасчетовЕНВД = СтрокаОстатка.СуммаВзаиморасчетовЕНВД - СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//			СтрокаОстатка.СуммаБУ_ЕНВД = СтрокаОстатка.СуммаБУ_ЕНВД - СтрокаВзаиморасчетов.СуммаРуб_ЕНВД;

//			СтрокаОстатка.СуммаВзаиморасчетовПатент = СтрокаОстатка.СуммаВзаиморасчетовПатент - СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//			СтрокаОстатка.СуммаБУ_Патент = СтрокаОстатка.СуммаБУ_Патент - СтрокаВзаиморасчетов.СуммаРуб_Патент;

//			СтрокаОстатка.СуммаВзаиморасчетовКомитента = СтрокаОстатка.СуммаВзаиморасчетовКомитента - СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//			СтрокаОстатка.СуммаБУ_Комитента = СтрокаОстатка.СуммаБУ_Комитента - СтрокаВзаиморасчетов.СуммаРуб_Комитента;

//		КонецЕсли;

//		НераспределеннаяСумма = НераспределеннаяСумма - ЗачитываемыйАванс;

//		СтрокаОстатка.СуммаВзаиморасчетов = СтрокаОстатка.СуммаВзаиморасчетов - СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		СтрокаОстатка.СуммаБУ             = СтрокаОстатка.СуммаБУ - СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;

//	КонецЦикла;

//КонецПроцедуры

//Процедура ДобавитьСтрокуЗадолженности(ТаблицаВзаиморасчетов, НераспределеннаяСумма, СтрокаДокумента, Реквизиты)

//	Если НераспределеннаяСумма <= 0 Тогда
//		Возврат;
//	КонецЕсли;

//	СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();

//	ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаДокумента,
//		"СчетРасчетов,СчетАвансов,Контрагент,ДоговорКонтрагента,ВалютаВзаиморасчетов,РасчетыВВалюте,РасчетыВУсловныхЕдиницах, УчетАгентскогоНДС, Подразделение");

//	СтрокаВзаиморасчетов.ПодразделениеРасчетов = СтрокаДокумента.Подразделение;
//	СтрокаВзаиморасчетов.ДокументРасчетов      = Реквизиты.Регистратор;
//	СтрокаВзаиморасчетов.ДатаДокументаРасчетов = Реквизиты.Период;

//	СтрокаВзаиморасчетов.СуммаВзаиморасчетов = НераспределеннаяСумма;

//	КоэффициентРуб = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
//		?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0, СтрокаДокумента.СуммаРуб / СтрокаДокумента.СуммаВзаиморасчетов));

//	СтрокаВзаиморасчетов.СуммаРуб              = Окр(НераспределеннаяСумма * КоэффициентРуб, 2);
//	СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса = СтрокаВзаиморасчетов.СуммаРуб;

//	Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда

//		КоэффициентЕНВД = ?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0,
//			СтрокаДокумента.СуммаВзаиморасчетовЕНВД / СтрокаДокумента.СуммаВзаиморасчетов);

//		КоэффициентПатент = ?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0,
//			СтрокаДокумента.СуммаВзаиморасчетовПатент / СтрокаДокумента.СуммаВзаиморасчетов);
//			
//		КоэффициентКомитента = ?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0,
//			СтрокаДокумента.СуммаВзаиморасчетовКомитента / СтрокаДокумента.СуммаВзаиморасчетов);

//		СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД      = Окр(НераспределеннаяСумма * КоэффициентЕНВД, 2);
//		СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент    = Окр(НераспределеннаяСумма * КоэффициентПатент, 2);
//		СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента = Окр(НераспределеннаяСумма * КоэффициентКомитента, 2);

//		СтрокаВзаиморасчетов.СуммаРуб_ЕНВД      = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД * КоэффициентРуб, 2);
//		СтрокаВзаиморасчетов.СуммаРуб_Патент    = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент * КоэффициентРуб, 2);
//		СтрокаВзаиморасчетов.СуммаРуб_Комитента = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента * КоэффициентРуб, 2);

//	КонецЕсли;

//КонецПроцедуры

//Процедура ПроверитьНехваткуОстаткаАванса(НераспределенныйОстаток, СтрокаТаблицыАвансов, ВалютаВзаиморасчетов, Регистратор, Отказ)

//	Если СтрокаТаблицыАвансов.СуммаЗачета > 0
//		И НераспределенныйОстаток > 0
//		И ЗначениеЗаполнено(СтрокаТаблицыАвансов.СчетАвансов)Тогда

//		ТекстОшибки = НСтр("ru='Указана сумма зачета, превышающая остаток незачтенного аванса.
//			|Документ аванса: ""%1""
//			|Указана сумма зачета: %2 %3; Остаток аванса: %4 %3; Превышение: %5 %3'");
//		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			ТекстОшибки,
//			СтрокаТаблицыАвансов.ДокументАванса,
//			СтрокаТаблицыАвансов.СуммаЗачета,
//			ВалютаВзаиморасчетов,
//			СтрокаТаблицыАвансов.СуммаЗачета - НераспределенныйОстаток,
//			НераспределенныйОстаток);

//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Регистратор, , , Отказ);

//	КонецЕсли;

//КонецПроцедуры

//Функция СодержаниеПроводокПоЗачетуАвансов(НаправлениеДвижения, ЭтоВозврат, ВидДоговора)

//	Если НаправлениеДвижения = "Поступление" Тогда

//		Если ЭтоВозврат Тогда
//			Содержание = "Выделение аванса. Оплаченная часть.";
//		ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСПоставщиком(ВидДоговора) Тогда
//			Содержание= "Зачет аванса поставщику";
//		ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомиссионером(ВидДоговора) 
//			ИЛИ БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомиссионеромНаЗакупку(ВидДоговора) Тогда
//			Содержание = "Зачет аванса комиссионеру (агенту)";
//		ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомитентом(ВидДоговора) 
//			ИЛИ БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомитентомНаЗакупку(ВидДоговора) Тогда
//			Содержание = "Зачет аванса комитенту (принципалу)";
//		Иначе
//			Содержание = "Зачет аванса";
//		КонецЕсли;

//	Иначе // "Выбытие".

//		Если ЭтоВозврат Тогда
//			Если БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСПоставщиком(ВидДоговора) Тогда
//				Содержание = "Возврат поставщику. Неоплаченная часть.";
//			ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомиссионером(ВидДоговора) 
//				ИЛИ БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомиссионеромНаЗакупку(ВидДоговора) Тогда
//				Содержание = "Возврат комиссионеру (агенту). Неоплаченная часть.";
//			ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомитентом(ВидДоговора)
//				ИЛИ БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомитентомНаЗакупку(ВидДоговора) Тогда
//				Содержание = "Возврат комитенту (принципалу). Неоплаченная часть.";
//			Иначе
//				Содержание = "Возврат. Неоплаченная часть.";
//			КонецЕсли;
//		ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСПокупателем(ВидДоговора) Тогда
//			Содержание = "Зачет аванса покупателя";
//		ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомиссионером(ВидДоговора)
//			ИЛИ БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомиссионеромНаЗакупку(ВидДоговора) Тогда
//			Содержание = "Зачет аванса комиссионера (агента)";
//		ИначеЕсли БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомитентом(ВидДоговора) 
//			ИЛИ БухгалтерскийУчетПереопределяемый.ЭтоВидДоговораСКомитентомНаЗакупку(ВидДоговора) Тогда
//			Содержание = "Зачет аванса комитента (принципала)";
//		Иначе
//			Содержание = "Зачет аванса";
//		КонецЕсли;

//	КонецЕсли;

//	Возврат Содержание;

//КонецФункции

//Функция ДокументРасчетовПоЗачетуАвансов(ДокументРасчетов)
//	
//	Если ТипЗнч(ДокументРасчетов) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
//		ИсходныйДокументРасчетов = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ДокументРасчетов, Истина);
//	ИначеЕсли ТипЗнч(ДокументРасчетов) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
//		ИсходныйДокументРасчетов = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументРеализации(ДокументРасчетов, Истина);
//	Иначе
//		ИсходныйДокументРасчетов = ДокументРасчетов;	
//	КонецЕсли;

//	Возврат ИсходныйДокументРасчетов;
//	
//КонецФункции

//#КонецОбласти

//#Область ПогашениеЗадолженности

//// Готовится таблица для формирования проводок погашения задолженности по расчетам с поставщиками и покупателями,.
//// На основании данных документа и остатков по счету расчетов на момент проведения.
//// Вызывается при проведении документов движения денежных средств,.
//// А также других документов, погашающих задолженность.
////
//// Параметры:
////  РасшифровкаПлатежа - <ТаблицаЗначений> - данные табличной части документа,.
////  По которым определяется, какие движения будут сформированы.
////                       Создается в модуле менеджера документа.
////  ТаблицаРеквизиты   - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                       Создается в модуле менеджера документа.
////  Отказ  - <Булево> - флаг отказа от проведения.
////
//Функция ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности(РасшифровкаПлатежа, ТаблицаРеквизиты, Отказ, ВидДокумента = Неопределено) Экспорт

//	Параметры = ПодготовитьПараметрыТаблицыВзаиморасчетовПогашениеЗадолженности(РасшифровкаПлатежа, ТаблицаРеквизиты, ВидДокумента);

//	Реквизиты = Параметры.Реквизиты[0];

//	ТаблицаВзаиморасчетов = ПустаяТаблицаВзаиморасчетовПогашениеЗадолженности(Реквизиты.УчитыватьЗадолженностьУСН, ВидДокумента);

//	Если Параметры.РасшифровкаПлатежа.Количество() = 0 Тогда
//		Возврат ТаблицаВзаиморасчетов;
//	КонецЕсли;

//	ОстаткиЗадолженности = ПолучитьОстаткиЗадолженности(Параметры.РасшифровкаПлатежа, Реквизиты, Отказ);

//	Для каждого СтрокаПлатежа Из Параметры.РасшифровкаПлатежа Цикл

//		НераспределенныйОстаток   = СтрокаПлатежа.СуммаВзаиморасчетов;
//		НераспределенныйОстатокБУ = СтрокаПлатежа.СуммаРуб;
//		
//		ДобавитьСтрокиПогашенияЗадолженности(
//			ТаблицаВзаиморасчетов,
//			НераспределенныйОстаток,
//			НераспределенныйОстатокБУ,
//			ОстаткиЗадолженности,
//			СтрокаПлатежа,
//			Реквизиты,
//			Отказ);

//		ДобавитьСтрокуАванса(
//			ТаблицаВзаиморасчетов,
//			НераспределенныйОстаток,
//			НераспределенныйОстатокБУ,
//			СтрокаПлатежа,
//			Реквизиты);

//	КонецЦикла;

//	ТаблицаВзаиморасчетов.Индексы.Добавить("СчетРасчетов, Контрагент, ДоговорКонтрагента, ДокументРасчетов");

//	Для каждого СтрокаОстатка Из ОстаткиЗадолженности Цикл

//		СтруктураОтбора = Новый Структура;
//		СтруктураОтбора.Вставить("СчетРасчетов",       СтрокаОстатка.СчетРасчетов);
//		СтруктураОтбора.Вставить("Контрагент",         СтрокаОстатка.Контрагент);
//		СтруктураОтбора.Вставить("ДоговорКонтрагента", СтрокаОстатка.ДоговорКонтрагента);
//		СтруктураОтбора.Вставить("ДокументРасчетов",   СтрокаОстатка.ДокументРасчетов);

//		СтрокиРаспределения = ТаблицаВзаиморасчетов.НайтиСтроки(СтруктураОтбора);
//		ИтогоСуммаВзаиморасчетов = 0;
//		Для каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
//			ИтогоСуммаВзаиморасчетов = ИтогоСуммаВзаиморасчетов + СтрокаРаспределения.СуммаВзаиморасчетов;
//		КонецЦикла;

//		Для каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
//			СтрокаРаспределения.ОстатокВзаиморасчетов = Окр(
//				СтрокаОстатка.ОстатокВзаиморасчетов * СтрокаРаспределения.СуммаВзаиморасчетов / ИтогоСуммаВзаиморасчетов, 2);
//			СтрокаОстатка.ОстатокВзаиморасчетов = СтрокаОстатка.ОстатокВзаиморасчетов - СтрокаРаспределения.ОстатокВзаиморасчетов;
//			ИтогоСуммаВзаиморасчетов            = ИтогоСуммаВзаиморасчетов - СтрокаРаспределения.СуммаВзаиморасчетов;
//		КонецЦикла;

//	КонецЦикла;

//	Возврат ТаблицаВзаиморасчетов;

//КонецФункции

//// Формируются проводки погашения задолженности по расчетам с поставщиками и покупателями.
//// Вызывается при проведении документов движения денежных средств,.
//// А также других документов, погашающих задолженность.
////
//// Параметры:
////  ТаблицаВзаиморасчетов - <ТаблицаЗначений> - таблица с данными.
////  По погашению задолженности в разрезе документов расчетов.
////                          Создается функцией ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности.
////                          Используются колонки, описанные в функции ПодготовитьПараметрыПогашениеЗадолженности.
////  ТаблицаРеквизиты      - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                          Структура таблицы описана в функции ПодготовитьПараметрыПогашениеЗадолженности.
////  Движения              - коллекция движений документа.
////  Отказ                 - <Булево> - флаг отказа от проведения.
////
//Процедура СформироватьДвиженияПогашениеЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыПогашениеЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты);

//	Если Параметры.Взаиморасчеты.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;

//	Реквизиты = Параметры.Реквизиты[0];

//	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);

//	ДтКтРасчетов = ?(Реквизиты.НаправлениеДвижения = "Поступление", "Кт", "Дт");
//	ДтКтКорСчета = ?(ДтКтРасчетов = "Кт", "Дт", "Кт");

//	Для каждого СтрокаВзаиморасчетов из Параметры.Взаиморасчеты Цикл

//		// Основная проводка по счету расчетов.

//		Проводка = Движения.Хозрасчетный.Добавить();

//		Проводка.Период       = Реквизиты.Период;
//		Проводка.Организация  = Реквизиты.Организация;
//		Проводка.Содержание   = СтрокаВзаиморасчетов.Содержание;

//		Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ;

//		Проводка["Счет" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СчетРасчетов;

//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//		СвойстваСчетаРасчетов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//		Если СвойстваСчетаРасчетов.Валютный Тогда
//			Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//			Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//		КонецЕсли;

//		Проводка["Счет" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорСчет;

//		Для Ном = 1 по 3 Цикл
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтКорСчета], Проводка["Субконто" + ДтКтКорСчета],
//				Ном, СтрокаВзаиморасчетов["КорСубконто" + Ном]);
//		КонецЦикла;

//		СвойстваКорСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтКорСчета]);
//		Если СвойстваКорСчета.Валютный Тогда
//			Проводка["Валюта" + ДтКтКорСчета]        = Реквизиты.ВалютаДокумента;
//			Проводка["ВалютнаяСумма" + ДтКтКорСчета] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваКорСчета.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорПодразделение;
//		КонецЕсли;

//		Если ОтражатьВНалоговомУчете Тогда
//			СуммаНУ = СтрокаВзаиморасчетов.СуммаНУ;
//			Если СвойстваСчетаРасчетов.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтРасчетов] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтРасчетов] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтРасчетов] = 0;
//			КонецЕсли;
//			Если СвойстваКорСчета.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтКорСчета] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтКорСчета] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтКорСчета] = 0;
//			КонецЕсли;
//		КонецЕсли;

//		// Проводки по вспомогательным счетам задолженности УСН.
//		Если Реквизиты.УчитыватьЗадолженностьУСН
//			ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда
//			
//			// Проводка Дт УСН.01 (УСН.21) - если ДтКтРасчетов = "Дт".
//			// Или Кт УСН.01 (УСН.21)  - если ДтКтРасчетов = "Кт".
//			Если Реквизиты.УчитыватьЗадолженностьУСН
//				И СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД <> 0 Тогда
//				
//				Проводка = Движения.Хозрасчетный.Добавить();
//				
//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = "Расчеты по деятельности ЕНВД";
//				
//				Если СвойстваСчетаРасчетов.Валютный Тогда
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД;
//				Иначе
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД;
//				КонецЕсли;
//				
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);
//				
//				СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//				Если СвойстваСчетаУСН.Валютный Тогда
//					Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//				КонецЕсли;
//				Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;
//				
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_ЕНВД;
//				
//			КонецЕсли;
//			
//			// Проводка Дт УСН.02 (УСН.22) - если ДтКтРасчетов = "Дт".
//			// Или Кт УСН.02 (УСН.22)  - если ДтКтРасчетов = "Кт".
//			Если Реквизиты.УчитыватьЗадолженностьУСН
//				И СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента <> 0 Тогда
//				
//				Проводка = Движения.Хозрасчетный.Добавить();
//				
//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = "Расчеты за товары и услуги комитента";
//				
//				Если СвойстваСчетаРасчетов.Валютный Тогда
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент;
//				Иначе
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент;
//				КонецЕсли;
//				
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);
//				
//				СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//				Если СвойстваСчетаУСН.Валютный Тогда
//					Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//				КонецЕсли;
//				Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;
//				
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Комитента;
//				
//			КонецЕсли;
//			
//			Если Реквизиты.УчитыватьЗадолженностьУСНПатент И СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент <> 0 Тогда
//				
//				Проводка = Движения.Хозрасчетный.Добавить();
//				
//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = ?(Реквизиты.Период < УчетУСН.ДатаНачалаДействияПатентнойСистемы(),
//					НСтр("ru = 'Расчеты по деятельности УСН на патенте'"),
//					НСтр("ru = 'Расчеты по деятельности на патенте'"));
//				
//				Если СвойстваСчетаРасчетов.Валютный Тогда
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент;
//				Иначе
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент;
//				КонецЕсли;
//				
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);
//				
//				СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//				Если СвойстваСчетаУСН.Валютный Тогда
//					Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//				КонецЕсли;
//				Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;
//				
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Патент;
//				
//			КонецЕсли;
//			
//		КонецЕсли;

//	КонецЦикла;

//	Движения.Хозрасчетный.Записывать = Истина;

//КонецПроцедуры

//// Подготовка параметров для функции ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности.
//// На основании переданных документом таблиц.
////
//// Параметры:
////  РасшифровкаПлатежа - <ТаблицаЗначений> - данные табличной.
////  Части документа, по которым определяется, какие движения будут сформированы.
////                       Создается в модуле менеджера документа.
////  ТаблицаРеквизиты   - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                       Создается в модуле менеджера документа.
////
//// Возвращаемое значение:
////   <Структура>   - структура из 2 таблиц: РасшифровкаПлатежа и Реквизиты.
////
//Функция ПодготовитьПараметрыТаблицыВзаиморасчетовПогашениеЗадолженности(РасшифровкаПлатежа, ТаблицаРеквизиты, ВидДокумента)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.РасшифровкаПлатежа.

//	СписокОбязательныхКолонок = ""
//	+ "НомерСтроки,"                      // <Число, 6,0> - номер строки документа.
//	+ "Подразделение,"                    // <Ссылка на справочник подразделений>.
//	+ "Контрагент,"                       // <СправочникСсылка.Контрагенты> - контрагент, задолженность по которому погашается.
//	+ "ДоговорКонтрагента,"               // <СправочникСсылка.ДоговорыКонтрагентов> - договор, задолженность по которому погашается.
//	+ "ВалютаВзаиморасчетов,"             // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ ?(ВидДокумента = Неопределено,"","ВалютаВзаиморасчетовСПолучателем,") // <СправочникСсылка.Валюты> - валюта расчетов по договору.	
//	+ "РасчетыВУсловныхЕдиницах,"         // <Булево> - Истина для договора с расчетами в условных единицах.
//	+ "РасчетыВВалюте,"                   // <Булево> - Истина для договора с расчетами в любой валюте, кроме рублей (в т.ч и в условных единицах).
//	+ "СпособПогашенияЗадолженности,"     // <ПеречислениеСсылка.СпособыПогашенияЗадолженности>.
//	+ "ДокументРасчетов,"                 // <ДокументСсылка> - документ расчетов, задолженность по которому погашается при способе "По документу".
//	+ "СчетРасчетов,"                     // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом.
//	+ "СчетАвансов,"                      // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом по авансам.
//	+ "ПорядокОтраженияАванса,"           // <ПеречислениеСсылка.ПорядокОтраженияАвансов, СправочникСсылка.Патенты> - Порядок отражения аванса для УСН.
//	+ "КорСчет,"                          // <ПланСчетовСсылка.Хозрасчетный> - счет, коррекспондирующий со счетом расчетов с контрагентом.
//	+ "КорСубконто1,"                     // <Характеристика.ВидыСубконтоХозрасчетные> - субконто 1 по корсчету.
//	+ "КорСубконто2,"                     // <Характеристика.ВидыСубконтоХозрасчетные> - субконто 2 по корсчету.
//	+ "КорСубконто3,"                     // <Характеристика.ВидыСубконтоХозрасчетные> - субконто 3 по корсчету.
//	+ "КорПодразделение,"                 // <Ссылка на справочник подразделений> - подразделение по корсчету.
//	+ "СуммаВзаиморасчетов,"              // <Число,15,2> - сумма погашения задолженности в валюте взаиморасчетов.
//	+ "СуммаРуб,"                         // <Число,15,2> - сумма погашения задолженности в рублях.
//	+ "Содержание";                       // <Строка,150>.

//	Параметры.Вставить("РасшифровкаПлатежа", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		РасшифровкаПлатежа, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента,"           // <СправочникСсылка.Валюты>.
//	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения,"       // <Строка> - "Поступление" при погашении дебиторской задолженности (поступлении денежных средств).
//	                               //          - "Выбытие" при погашении кредиторской задолженности (выбытии денежных средств).
//	+ "ЭтоВозврат";                // <Булево> - Истина при возврате денежных средств (покупателю или от поставщика).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//// Подготовка параметров для процедуры СформироватьДвиженияПогашениеЗадолженности.
////
//// Параметры:
////  ТаблицаВзаиморасчетов - <ТаблицаЗначений> - данные табличной.
////  Части документа, по которым определяется, какие движения будут сформированы.
////                          Создается функцией ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности.
////  ТаблицаРеквизиты      - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                          Создается в модуле менеджера документа.
////
//// Возвращаемое значение:
////   <Структура>   - структура из 2 таблиц: Взаиморасчеты и Реквизиты.
////
//Функция ПодготовитьПараметрыПогашениеЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента,"           // <СправочникСсылка.Валюты>.
//	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения";       // <Строка> - "Поступление" при погашении дебиторской задолженности (поступлении денежных средств).
//	                               //          - "Выбытие" при погашении кредиторской задолженности (выбытии денежных средств).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Взаиморасчеты.

//	СписокОбязательныхКолонок = ""
//	+ "Подразделение,"                 // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается.
//	+ "Контрагент,"                    // <СправочникСсылка.Контрагенты> - контрагент, задолженность по которому погашается.
//	+ "ДоговорКонтрагента,"            // <СправочникСсылка.ДоговорыКонтрагентов> - договор, задолженность по которому погашается.
//	+ "ДокументРасчетов,"              // <ДокументСсылка> - документ расчетов, задолженность по которому погашается.
//	+ "ВалютаВзаиморасчетов,"          // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "СчетРасчетов,"                  // <ПланСчетовСсылка.Хозрасчетный> - счет расчетов, задолженность по которому погашается.
//	+ "КорСчет,"                       // <ПланСчетовСсылка.Хозрасчетный> - счет, корреспондирующий со счетом расчетов.
//	+ "КорСубконто1,"                  // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто2,"                  // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто3,"                  // <Характеристика.ВидыСубконтоХозрасчетные>
//	+ "КорПодразделение,"              // <Ссылка на справочник подразделений> - подразделение по корсчету.
//	+ "СуммаВзаиморасчетов,"           // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "СуммаБУ,"                       // <Число,15,2> - сумма в рублях в оценке для бух.учета.
//	+ "СуммаНУ,"                       // <Число,15,2> - сумма в рублях в оценке для налогового учета.
//	+ "СуммаВзаиморасчетовЕНВД,"       // <Число,15,2> - сумма по деятельности ЕНВД в валюте взаиморасчетов.
//	+ "СуммаБУ_ЕНВД,"                  // <Число,15,2> - сумма по деятельности ЕНВД в рублях.
//	+ "СуммаВзаиморасчетовПатент,"     // <Число,15,2> - сумма по деятельности на патенте в валюте взаиморасчетов.
//	+ "СуммаБУ_Патент,"                // <Число,15,2> - сумма по деятельности на патенте в рублях.
//	+ "СуммаВзаиморасчетовКомитента,"  // <Число,15,2> - сумма за товары и услуги комитентов в валюте взаиморасчетов.
//	+ "СуммаБУ_Комитента,"
//	+ "Содержание";                    // <Строка,150>.

//	Параметры.Вставить("Взаиморасчеты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаВзаиморасчетов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//Функция ПустаяТаблицаВзаиморасчетовПогашениеЗадолженности(УчитыватьЗадолженностьУСН, ВидДокумента = Неопределено)

//	ПустаяТаблица = Новый ТаблицаЗначений();

//	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",          Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("ВалютаВзаиморасчетов",  Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	
//	Если НЕ ВидДокумента = Неопределено Тогда
//		ПустаяТаблица.Колонки.Добавить("ВалютаВзаиморасчетовСПолучателем",  Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	КонецЕсли;
//	
//	ПустаяТаблица.Колонки.Добавить("Подразделение",         БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ПустаяТаблица.Колонки.Добавить("Контрагент",            Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
//	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента",    БухгалтерскийУчетКлиентСерверПереопределяемый.ПолучитьОписаниеТиповДоговора());
//	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",      Документы.ТипВсеСсылки());
//	ПустаяТаблица.Колонки.Добавить("ДатаДокументаРасчетов", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
//	ПустаяТаблица.Колонки.Добавить("ОстатокВзаиморасчетов", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов",   ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ",               ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРуб",              ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаНУ",               ОбщегоНазначения.ОписаниеТипаЧисло(15,2));

//	ПустаяТаблица.Колонки.Добавить("РасчетыВУсловныхЕдиницах", Новый ОписаниеТипов("Булево"));
//	ПустаяТаблица.Колонки.Добавить("Разница",                  ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",                Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
//	ПустаяТаблица.Колонки.Добавить("КорСчет",                 Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("КорПодразделение",        БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ОписаниеТипаСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Тип;
//	Для Ном = 1 По 3 Цикл
//		ПустаяТаблица.Колонки.Добавить("КорСубконто" + Ном, ОписаниеТипаСубконто);
//	КонецЦикла;

//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовЕНВД",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_ЕНВД",                 ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовПатент",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_Патент",                 ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовКомитента", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_Комитента",            ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("Содержание",                   ОбщегоНазначения.ОписаниеТипаСтрока(150));

//	Возврат ПустаяТаблица;

//КонецФункции

//Функция ПолучитьОстаткиЗадолженности(РасшифровкаПлатежа, Реквизиты, Отказ)

//	ОпределятьСостояниеРасчетов = БухгалтерскийУчетПереопределяемый.ПроводитьПоРасчетамСКонтрагентами(Реквизиты.Организация, Реквизиты.Период);

//	Если РасшифровкаПлатежа.Количество() = 0
//		ИЛИ НЕ ОпределятьСостояниеРасчетов Тогда
//		Возврат ПустаяТаблицаОстаткиЗадолженности();
//	КонецЕсли;

//	ТаблицаДоговоров = РасшифровкаПлатежа.СкопироватьКолонки("СчетРасчетов,Контрагент,ДоговорКонтрагента");
//	Для каждого СтрокаПлатежа Из РасшифровкаПлатежа Цикл
//		Если СтрокаПлатежа.СпособПогашенияЗадолженности <> Перечисления.СпособыПогашенияЗадолженности.НеПогашать Тогда
//			НоваяСтрока = ТаблицаДоговоров.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлатежа);
//		КонецЕсли;
//	КонецЦикла;
//	ТаблицаДоговоров.Свернуть("СчетРасчетов,Контрагент,ДоговорКонтрагента");

//	Если ТаблицаДоговоров.Количество() = 0 Тогда
//		Возврат ПустаяТаблицаОстаткиЗадолженности();
//	КонецЕсли;

//	ТаблицаДоговоров.Индексы.Добавить("СчетРасчетов");
//	ТаблицаСчетов = ТаблицаДоговоров.Скопировать(, "СчетРасчетов");
//	ТаблицаСчетов.Свернуть("СчетРасчетов");
//	
//	// Блокируем регистр Хозрасчетный для получения остатков.
//	
//	Блокировка = Новый БлокировкаДанных;
//	
//	Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
//	
//		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаСчета.СчетРасчетов);
//		
//		// Основная блокировка по счетам задолженности.
//		ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозрасчетный");
//		ЭлементБлокировки.УстановитьЗначение("Период",      Новый Диапазон(, Реквизиты.Период));
//		ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
//		ЭлементБлокировки.УстановитьЗначение("Счет",        СтрокаСчета.СчетРасчетов);
//		
//		ОтборПоСчету = Новый Структура("СчетРасчетов", СтрокаСчета.СчетРасчетов);
//		ТаблицаДоговоровПоСчету = ТаблицаДоговоров.Скопировать(ОтборПоСчету, "Контрагент,ДоговорКонтрагента");
//		ЭлементБлокировки.ИсточникДанных = ТаблицаДоговоровПоСчету;
//		
//		Для НомерСубконто = 1 По ДанныеСчета.КоличествоСубконто Цикл
//			Если ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты Тогда
//				ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "Контрагент");
//			ИначеЕсли ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры Тогда
//				ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ДоговорКонтрагента");
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	Если Реквизиты.УчитыватьЗадолженностьУСН 
//		И НЕ Реквизиты.ЭтоВозврат Тогда
//		
//		// Дополнительные блокировки по вспомогательным счетам задолженности УСН.
//		ТаблицаИсточникДанных = ТаблицаДоговоров.Скопировать(, "Контрагент,ДоговорКонтрагента");
//		ТаблицаИсточникДанных.Свернуть("Контрагент,ДоговорКонтрагента");
//		
//		ВыборкаСчетовУСН = ПланыСчетов.Хозрасчетный.Выбрать(ПланыСчетов.Хозрасчетный.УСНВспомогательныеСчета);
//		Пока ВыборкаСчетовУСН.Следующий() Цикл
//			ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозрасчетный");
//			ЭлементБлокировки.УстановитьЗначение("Период",      Новый Диапазон(, Реквизиты.Период));
//			ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
//			ЭлементБлокировки.УстановитьЗначение("Счет",        ВыборкаСчетовУСН.Ссылка);
//			ЭлементБлокировки.ИсточникДанных = ТаблицаИсточникДанных;
//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//				ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "Контрагент");
//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
//				ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ДоговорКонтрагента");
//		КонецЦикла;

//	КонецЕсли;
//	
//	Блокировка.Заблокировать();
//	
//	// Получаем остатки.
//	
//	Запрос = Новый Запрос;

//	Запрос.УстановитьПараметр("Организация",           Реквизиты.Организация);
//	Запрос.УстановитьПараметр("МоментВремениОстатков", Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор));
//	Запрос.УстановитьПараметр("ВидыСубконтоРасчетов",  ВидыСубконтоРасчетов());
//	Запрос.УстановитьПараметр("ВидыСубконтоКонтрагентыДоговоры", ВидыСубконтоКонтрагентыДоговоры());

//	СчетаРасчетов = РазличныеЗначенияКолонкиТаблицы(ТаблицаДоговоров, "СчетРасчетов");
//	СчетаРасчетовПоДокументам = Новый Массив;
//	СчетаКонтрагентыДоговоры  = Новый Массив;
//	Для каждого СчетРасчетов Из СчетаРасчетов Цикл
//		Если БухгалтерскийУчетВызовСервераПовтИсп.НаСчетеВедетсяУчетПоДокументамРасчетов(СчетРасчетов) Тогда
//			СчетаРасчетовПоДокументам.Добавить(СчетРасчетов);
//		Иначе
//			СчетаКонтрагентыДоговоры.Добавить(СчетРасчетов);
//		КонецЕсли;
//	КонецЦикла;

//	Запрос.УстановитьПараметр("СчетаРасчетовПоДокументам", СчетаРасчетовПоДокументам);
//	Запрос.УстановитьПараметр("СчетаКонтрагентыДоговоры",  СчетаКонтрагентыДоговоры);
//	Запрос.УстановитьПараметр("Контрагенты", РазличныеЗначенияКолонкиТаблицы(ТаблицаДоговоров, "Контрагент"));
//	Запрос.УстановитьПараметр("Договоры",    РазличныеЗначенияКолонкиТаблицы(ТаблицаДоговоров, "ДоговорКонтрагента"));
//	Запрос.УстановитьПараметр("Множитель", ?(Реквизиты.НаправлениеДвижения = "Выбытие", -1, 1));
//	Запрос.УстановитьПараметр("ПустоеПодразделение", БухгалтерскийУчетПереопределяемый.ПустоеПодразделение());
//	Запрос.УстановитьПараметр("СубсчетаУСН", БухгалтерскийУчетВызовСервераПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.УСНВспомогательныеСчета));

//	Запрос.Текст = ТекстЗапросаОстаткиЗадолженности(Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент);

//	ОстаткиЗадолженности = Запрос.Выполнить().Выгрузить();

//	ОстаткиЗадолженности.Колонки.Добавить(
//		"ОстатокВзаиморасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
//	ОстаткиЗадолженности.ЗагрузитьКолонку(
//		ОстаткиЗадолженности.ВыгрузитьКолонку("СуммаВзаиморасчетов"), "ОстатокВзаиморасчетов");

//	ОбщегоНазначенияБПВызовСервера.ПронумероватьТаблицу(ОстаткиЗадолженности, "НомерСтроки");
//	ОбщегоНазначенияБПВызовСервера.УпорядочитьТаблицуПоДокументу(ОстаткиЗадолженности, "ДокументРасчетов", "ДатаДокументаРасчетов");
//	// Индексы используются в процедуре ДобавитьСтрокиПогашенияЗадолженности.
//	ОстаткиЗадолженности.Индексы.Добавить("НомерСтроки");
//	ОстаткиЗадолженности.Индексы.Добавить("СчетРасчетов,Контрагент,ДоговорКонтрагента");

//	Возврат ОстаткиЗадолженности;

//КонецФункции

//Функция ПустаяТаблицаОстаткиЗадолженности()

//	ПустаяТаблица = Новый ТаблицаЗначений;
//	ПустаяТаблица.Колонки.Добавить("НомерСтроки");
//	ПустаяТаблица.Колонки.Добавить("СчетРасчетов");
//	ПустаяТаблица.Колонки.Добавить("Валюта");
//	ПустаяТаблица.Колонки.Добавить("Контрагент");
//	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента");
//	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов");
//	ПустаяТаблица.Колонки.Добавить("Подразделение");
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов");
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ");
//	ПустаяТаблица.Колонки.Добавить("СуммаНУ");

//	Возврат ПустаяТаблица;

//КонецФункции

//Функция ТекстЗапросаОстаткиЗадолженности(УчитыватьЗадолженностьУСН)

//	Если УчитыватьЗадолженностьУСН Тогда

//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	Остатки.Счет КАК Счет,
//		|	Остатки.Субконто1 КАК Субконто1,
//		|	Остатки.Субконто2 КАК Субконто2,
//		|	Остатки.Субконто3 КАК Субконто3,
//		|	ЕСТЬNULL(Остатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
//		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение) КАК Подразделение,
//		|	ВЫБОР
//		|		КОГДА Остатки.Счет.Валютный
//		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|	КОНЕЦ КАК СуммаВзаиморасчетов,
//		|	Остатки.СуммаОстаток * &Множитель КАК СуммаБУ,
//		|	ЕСТЬNULL(Остатки.СуммаНУОстаток, 0) * &Множитель КАК СуммаНУ
//		|ПОМЕСТИТЬ ОстаткиЗадолженности
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СчетаРасчетовПоДокументам),
//		|			&ВидыСубконтоРасчетов,
//		|			Организация = &Организация
//		|				И Субконто1 В (&Контрагенты)
//		|				И Субконто2 В (&Договоры)) КАК Остатки
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА Остатки.Счет.Валютный
//		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|		КОНЕЦ > 0
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	Остатки.Счет,
//		|	Остатки.Субконто1,
//		|	Остатки.Субконто2,
//		|	НЕОПРЕДЕЛЕНО,
//		|	ЕСТЬNULL(Остатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)),
//		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение),
//		|	ВЫБОР
//		|		КОГДА Остатки.Счет.Валютный
//		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|	КОНЕЦ,
//		|	Остатки.СуммаОстаток * &Множитель,
//		|	ЕСТЬNULL(Остатки.СуммаНУОстаток, 0) * &Множитель
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СчетаКонтрагентыДоговоры),
//		|			&ВидыСубконтоКонтрагентыДоговоры,
//		|			Организация = &Организация
//		|				И Субконто1 В (&Контрагенты)
//		|				И Субконто2 В (&Договоры)) КАК Остатки
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА Остатки.Счет.Валютный
//		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|		КОНЕЦ > 0
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Субконто1,
//		|	Субконто2,
//		|	Субконто3,
//		|	Подразделение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ОстаткиУСН.Субконто1 КАК Субконто1,
//		|	ОстаткиУСН.Субконто2 КАК Субконто2,
//		|	ОстаткиУСН.Субконто3 КАК Субконто3,
//		|	ЕСТЬNULL(ОстаткиУСН.Подразделение, &ПустоеПодразделение) КАК Подразделение,
//		|	СУММА(ВЫБОР
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД)
//		|				ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД)
//		|				ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаВзаиморасчетовЕНВД,
//		|	СУММА(ВЫБОР
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД)
//		|					ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД)
//		|				ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаБУ_ЕНВД,
//		|	СУММА(ВЫБОР
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент)
//		|				ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент)
//		|				ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаВзаиморасчетовПатент,
//		|	СУММА(ВЫБОР
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент)
//		|					ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент)
//		|				ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаБУ_Патент,
//		|	СУММА(ВЫБОР
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент)
//		|				ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент)
//		|				ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаВзаиморасчетовКомитента,
//		|	СУММА(ВЫБОР
//		|			КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент)
//		|					ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент)
//		|				ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаБУ_Комитента
//		|ПОМЕСТИТЬ ОстаткиЗадолженностиУСН
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СубсчетаУСН),
//		|			&ВидыСубконтоРасчетов,
//		|			Организация = &Организация
//		|				И Субконто1 В (&Контрагенты)
//		|				И Субконто2 В (&Договоры)) КАК ОстаткиУСН
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОстаткиУСН.Субконто1,
//		|	ОстаткиУСН.Субконто2,
//		|	ОстаткиУСН.Субконто3,
//		|	ЕСТЬNULL(ОстаткиУСН.Подразделение, &ПустоеПодразделение)
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Субконто1,
//		|	Субконто2,
//		|	Субконто3,
//		|	Подразделение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ОстаткиЗадолженности.Счет КАК СчетРасчетов,
//		|	ОстаткиЗадолженности.Валюта КАК Валюта,
//		|	ОстаткиЗадолженности.Субконто1 КАК Контрагент,
//		|	ОстаткиЗадолженности.Субконто2 КАК ДоговорКонтрагента,
//		|	ОстаткиЗадолженности.Субконто3 КАК ДокументРасчетов,
//		|	ОстаткиЗадолженности.Подразделение КАК Подразделение,
//		|	СУММА(ОстаткиЗадолженности.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
//		|	СУММА(ОстаткиЗадолженности.СуммаБУ) КАК СуммаБУ,
//		|	СУММА(ОстаткиЗадолженности.СуммаНУ) КАК СуммаНУ,
//		|	СУММА(ЕСТЬNULL(ОстаткиЗадолженностиУСН.СуммаВзаиморасчетовЕНВД, 0)) КАК СуммаВзаиморасчетовЕНВД,
//		|	СУММА(ЕСТЬNULL(ОстаткиЗадолженностиУСН.СуммаБУ_ЕНВД, 0)) КАК СуммаБУ_ЕНВД,
//		|	СУММА(ЕСТЬNULL(ОстаткиЗадолженностиУСН.СуммаВзаиморасчетовПатент, 0)) КАК СуммаВзаиморасчетовПатент,
//		|	СУММА(ЕСТЬNULL(ОстаткиЗадолженностиУСН.СуммаБУ_Патент, 0)) КАК СуммаБУ_Патент,
//		|	СУММА(ЕСТЬNULL(ОстаткиЗадолженностиУСН.СуммаВзаиморасчетовКомитента, 0)) КАК СуммаВзаиморасчетовКомитента,
//		|	СУММА(ЕСТЬNULL(ОстаткиЗадолженностиУСН.СуммаБУ_Комитента, 0)) КАК СуммаБУ_Комитента
//		|ИЗ
//		|	ОстаткиЗадолженности КАК ОстаткиЗадолженности
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЗадолженностиУСН КАК ОстаткиЗадолженностиУСН
//		|		ПО ОстаткиЗадолженности.Субконто1 = ОстаткиЗадолженностиУСН.Субконто1
//		|			И ОстаткиЗадолженности.Субконто2 = ОстаткиЗадолженностиУСН.Субконто2
//		|			И ОстаткиЗадолженности.Субконто3 = ОстаткиЗадолженностиУСН.Субконто3
//		|			И ОстаткиЗадолженности.Подразделение = ОстаткиЗадолженностиУСН.Подразделение
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОстаткиЗадолженности.Счет,
//		|	ОстаткиЗадолженности.Валюта,
//		|	ОстаткиЗадолженности.Субконто1,
//		|	ОстаткиЗадолженности.Субконто2,
//		|	ОстаткиЗадолженности.Субконто3,
//		|	ОстаткиЗадолженности.Подразделение";

//	Иначе

//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	Остатки.Счет КАК СчетРасчетов,
//		|	Остатки.Субконто1 КАК Контрагент,
//		|	Остатки.Субконто2 КАК ДоговорКонтрагента,
//		|	Остатки.Субконто3 КАК ДокументРасчетов,
//		|	ЕСТЬNULL(Остатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
//		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение) КАК Подразделение,
//		|	ВЫБОР
//		|		КОГДА Остатки.Счет.Валютный
//		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|	КОНЕЦ КАК СуммаВзаиморасчетов,
//		|	Остатки.СуммаОстаток * &Множитель КАК СуммаБУ,
//		|	ЕСТЬNULL(Остатки.СуммаНУОстаток, 0) * &Множитель КАК СуммаНУ
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СчетаРасчетовПоДокументам),
//		|			&ВидыСубконтоРасчетов,
//		|			Организация = &Организация
//		|				И Субконто1 В (&Контрагенты)
//		|				И Субконто2 В (&Договоры)) КАК Остатки
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА Остатки.Счет.Валютный
//		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|		КОНЕЦ > 0
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	Остатки.Счет,
//		|	Остатки.Субконто1,
//		|	Остатки.Субконто2,
//		|	НЕОПРЕДЕЛЕНО,
//		|	ЕСТЬNULL(Остатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)),
//		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение),
//		|	ВЫБОР
//		|		КОГДА Остатки.Счет.Валютный
//		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|	КОНЕЦ,
//		|	Остатки.СуммаОстаток * &Множитель,
//		|	ЕСТЬNULL(Остатки.СуммаНУОстаток, 0) * &Множитель
//		|ИЗ
//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//		|			&МоментВремениОстатков,
//		|			Счет В (&СчетаКонтрагентыДоговоры),
//		|			&ВидыСубконтоКонтрагентыДоговоры,
//		|			Организация = &Организация
//		|				И Субконто1 В (&Контрагенты)
//		|				И Субконто2 В (&Договоры)) КАК Остатки
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА Остатки.Счет.Валютный
//		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
//		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
//		|		КОНЕЦ > 0";

//	КонецЕсли;

//	Возврат ТекстЗапроса;

//КонецФункции

//Процедура ДобавитьСтрокиПогашенияЗадолженности(ТаблицаВзаиморасчетов, НераспределеннаяСумма, НераспределеннаяСуммаБУ, ОстаткиЗадолженности, СтрокаПлатежа, Реквизиты, Отказ)

//	Если СтрокаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.НеПогашать Тогда
//		Возврат;
//	КонецЕсли;

//	РасчетыВВалюте           = СтрокаПлатежа.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить();
//	РасчетыВУсловныхЕдиницах = СтрокаПлатежа.РасчетыВУсловныхЕдиницах;
//	Регистратор              = Реквизиты.Регистратор;

//	Отбор = Новый Структура("СчетРасчетов,Контрагент,ДоговорКонтрагента");
//	Если СтрокаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу Тогда
//		Отбор.Вставить("ДокументРасчетов");
//	КонецЕсли;
//	ЗаполнитьЗначенияСвойств(Отбор, СтрокаПлатежа);
//	ОстаткиЗадолженностиСОтбором = ОстаткиЗадолженности.Скопировать(Отбор);
//	ОстаткиЗадолженностиСОтбором.Сортировать("ДатаДокументаРасчетов,ДокументРасчетов", Новый СравнениеЗначений);

//	Для каждого СтрокаОстатка Из ОстаткиЗадолженностиСОтбором Цикл

//		Если НераспределеннаяСумма <= 0 Тогда
//			Прервать;
//		КонецЕсли;

//		ПогашеннаяСумма = Мин(НераспределеннаяСумма, СтрокаОстатка.СуммаВзаиморасчетов);
//		Если ПогашеннаяСумма <= 0 Тогда
//			Продолжить;
//		КонецЕсли;

//		СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаПлатежа);
//		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаОстатка);
//		
//		КоэффициентРуб = ?(НЕ РасчетыВВалюте, 1,
//			?(СтрокаОстатка.СуммаВзаиморасчетов = 0, 0, СтрокаПлатежа.СуммаРуб / СтрокаПлатежа.СуммаВзаиморасчетов));
//		КурсВзаиморасчетов = ?(НераспределеннаяСумма = 0, 0, Окр(НераспределеннаяСуммаБУ / НераспределеннаяСумма, 4));
//		
//		СтрокаВзаиморасчетов.СуммаВзаиморасчетов = ПогашеннаяСумма;
//		СтрокаВзаиморасчетов.СуммаРуб            = Окр(ПогашеннаяСумма * КоэффициентРуб, 2);
//		
//		Если РасчетыВВалюте Тогда

//			// Погашение долга в валюте производится в БУ и НУ по курсу тек.документа.
//			// Погашение долга в условных единицах производятся в БУ по курсу тек.документа, в НУ формируется суммовая разница,.
//			// 	Для ПБУ 18 образуется постоянная разница, равная суммовой.

//			// Возвраты в валюте производятся в БУ по курсу остатка, в НУ по курсу.
//			// Тек.документа, для ПБУ 18 образуется постоянная разница.
//			// Возвраты в условных единицах производятся в БУ и НУ только по курсу остатка,.
//			// 	Если курс остатка БУ отличается от курса тек.документа - сообщается об ошибке и документ возврата не проводится.

//			Если РасчетыВУсловныхЕдиницах И (ПогашеннаяСумма = НераспределеннаяСумма) Тогда
//				СуммаПоКурсуДокумента = НераспределеннаяСуммаБУ;
//				// Погашаемая сумма (в условных единицах) в этом случае - расчетная, без округления до 2 знаков.
//				// Это помогает обойти ошибки округления при расчете сумм по курсу остатка.
//				ПогашаемаяСуммаВзаиморасчетов = НераспределеннаяСуммаБУ / КурсВзаиморасчетов;
//			Иначе
//				СуммаПоКурсуДокумента = Окр(ПогашеннаяСумма * КурсВзаиморасчетов, 2);
//				ПогашаемаяСуммаВзаиморасчетов = ПогашеннаяСумма;
//			КонецЕсли;

//			СуммаБУпоКурсуОстатка = Окр(
//				ПогашеннаяСумма * СтрокаОстатка.СуммаБУ / СтрокаОстатка.СуммаВзаиморасчетов, 2);
//			СуммаНУпоКурсуОстатка = Окр(
//				ПогашеннаяСумма * СтрокаОстатка.СуммаНУ / СтрокаОстатка.СуммаВзаиморасчетов, 2);

//			Если Реквизиты.ЭтоВозврат Тогда

//				// Возвраты предоплаты в валюте и в условных единицах производятся в БУ и НУ по курсу предоплаты.
//				СтрокаВзаиморасчетов.СуммаБУ = СуммаБУпоКурсуОстатка;
//				СтрокаВзаиморасчетов.СуммаНУ = СуммаБУпоКурсуОстатка;
//				
//				Если РасчетыВУсловныхЕдиницах Тогда

//					КурсОстаткаОтличаетсяОтКурсаДокумента = СуммаПоКурсуДокумента <> СуммаБУпоКурсуОстатка;
//					Если КурсОстаткаОтличаетсяОтКурсаДокумента Тогда
//						ТекстОшибки = НСтр("ru='Рублевая сумма возврата по договору в условных единицах отличается от суммы по курсу остатка долга.
//							|	Договор: ""%1"", документ расчетов: ""%2"":
//							|	Сумма возврата: %3 %4, по курсу остатка: %5 руб.
//							|	Возврат по документу: %6 руб.
//							|	Возвраты по договору в условных единицах должны производиться по курсу остатка долга!'");
//						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//							ТекстОшибки,
//							СтрокаОстатка.ДоговорКонтрагента,
//							СтрокаОстатка.ДокументРасчетов,
//							ПогашеннаяСумма,
//							СтрокаПлатежа.ВалютаВзаиморасчетов,
//							СуммаБУпоКурсуОстатка,
//							СуммаПоКурсуДокумента);
//						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Регистратор, , , Отказ);
//					КонецЕсли;

//				Иначе
//					// При расчетах в валюте дополнительно передается отдельная сумма.
//					// Для "обратной" переоценки в НУ возвращаемой суммы до курса поступления предоплаты.
//					СтрокаВзаиморасчетов.Разница = СуммаПоКурсуДокумента - СуммаБУпоКурсуОстатка;

//				КонецЕсли;

//			Иначе

//				// Погашение долга в валюте и в условных единицах производятся в БУ и НУ по курсу тек.документа.
//				СтрокаВзаиморасчетов.СуммаБУ = СуммаПоКурсуДокумента;
//				// При расчетах в у.е дополнительно передается.
//				// Отдельная сумма для формирования в НУ суммовой разницы.
//				Если РасчетыВУсловныхЕдиницах Тогда
//					СтрокаВзаиморасчетов.СуммаНУ = СуммаНУпоКурсуОстатка;
//					СтрокаВзаиморасчетов.Разница = СуммаПоКурсуДокумента - СуммаНУпоКурсуОстатка;
//				Иначе
//					СтрокаВзаиморасчетов.СуммаНУ = СуммаПоКурсуДокумента;
//				КонецЕсли;

//			КонецЕсли;

//		Иначе
//			// Расчеты в рублях.
//			СтрокаВзаиморасчетов.СуммаБУ = ПогашеннаяСумма;
//			СтрокаВзаиморасчетов.СуммаНУ = ПогашеннаяСумма;
//		КонецЕсли;

//		Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда

//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД = Окр(СтрокаОстатка.СуммаВзаиморасчетовЕНВД
//				* СтрокаВзаиморасчетов.СуммаВзаиморасчетов / СтрокаОстатка.СуммаВзаиморасчетов, 2);
//				
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент = Окр(СтрокаОстатка.СуммаВзаиморасчетовПатент
//				* СтрокаВзаиморасчетов.СуммаВзаиморасчетов / СтрокаОстатка.СуммаВзаиморасчетов, 2);

//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента = Окр(СтрокаОстатка.СуммаВзаиморасчетовКомитента
//				* СтрокаВзаиморасчетов.СуммаВзаиморасчетов / СтрокаОстатка.СуммаВзаиморасчетов, 2);

//			Если РасчетыВВалюте И (СтрокаОстатка.СуммаВзаиморасчетовЕНВД <> 0) Тогда
//				СтрокаВзаиморасчетов.СуммаБУ_ЕНВД = Окр(СтрокаОстатка.СуммаБУ_ЕНВД
//					* СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД / СтрокаОстатка.СуммаВзаиморасчетовЕНВД, 2);
//			Иначе
//				СтрокаВзаиморасчетов.СуммаБУ_ЕНВД = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//			КонецЕсли;
//			
//			Если РасчетыВВалюте И (СтрокаОстатка.СуммаВзаиморасчетовПатент <> 0) Тогда
//				СтрокаВзаиморасчетов.СуммаБУ_Патент = Окр(СтрокаОстатка.СуммаБУ_Патент
//					* СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент / СтрокаОстатка.СуммаВзаиморасчетовПатент, 2);
//			Иначе
//				СтрокаВзаиморасчетов.СуммаБУ_Патент = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//			КонецЕсли;

//			Если РасчетыВВалюте И (СтрокаОстатка.СуммаВзаиморасчетовКомитента <> 0) Тогда
//				СтрокаВзаиморасчетов.СуммаБУ_Комитента = Окр(СтрокаОстатка.СуммаБУ_Комитента
//					* СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента / СтрокаОстатка.СуммаВзаиморасчетовКомитента, 2);
//			Иначе
//				СтрокаВзаиморасчетов.СуммаБУ_Комитента = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//			КонецЕсли;

//		КонецЕсли;

//		НераспределеннаяСумма   = НераспределеннаяСумма   - СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		НераспределеннаяСуммаБУ = НераспределеннаяСуммаБУ - СтрокаВзаиморасчетов.СуммаБУ;

//		// Остатки уменьшаем в строке основной таблицы остатков.
//		СтрокаОстаткаБезОтбора = ОстаткиЗадолженности.Найти(СтрокаОстатка.НомерСтроки, "НомерСтроки");

//		СтрокаОстаткаБезОтбора.СуммаВзаиморасчетов = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетов
//			- СтрокаВзаиморасчетов.СуммаВзаиморасчетов;

//		СтрокаОстаткаБезОтбора.СуммаБУ = СтрокаОстаткаБезОтбора.СуммаБУ - СтрокаВзаиморасчетов.СуммаБУ;
//		СтрокаОстаткаБезОтбора.СуммаНУ = СтрокаОстаткаБезОтбора.СуммаНУ - СтрокаВзаиморасчетов.СуммаНУ;

//		Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда

//			СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовЕНВД      = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовЕНВД
//				- СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//			СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовПатент    = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовПатент
//				- СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;				
//			СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовКомитента = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовКомитента
//				- СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//			СтрокаОстаткаБезОтбора.СуммаБУ_ЕНВД      = СтрокаОстаткаБезОтбора.СуммаБУ_ЕНВД
//				- СтрокаВзаиморасчетов.СуммаБУ_ЕНВД;
//			СтрокаОстаткаБезОтбора.СуммаБУ_Патент    = СтрокаОстаткаБезОтбора.СуммаБУ_Патент
//				- СтрокаВзаиморасчетов.СуммаБУ_Патент;
//			СтрокаОстаткаБезОтбора.СуммаБУ_Комитента = СтрокаОстаткаБезОтбора.СуммаБУ_Комитента
//				- СтрокаВзаиморасчетов.СуммаБУ_Комитента;

//		КонецЕсли;

//	КонецЦикла;

//КонецПроцедуры

//Процедура ДобавитьСтрокуАванса(ТаблицаВзаиморасчетов, НераспределеннаяСумма, НераспределеннаяСуммаБУ, СтрокаДокумента, Реквизиты)

//	Если НераспределеннаяСумма <= 0 Тогда
//		Возврат;
//	КонецЕсли;

//	РасчетыВВалюте = СтрокаДокумента.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить();

//	СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();

//	ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаДокумента);
//	СтрокаВзаиморасчетов.СчетРасчетов          = СтрокаДокумента.СчетАвансов;
//	СтрокаВзаиморасчетов.ДокументРасчетов      = Реквизиты.Регистратор;
//	СтрокаВзаиморасчетов.ДатаДокументаРасчетов = Реквизиты.Период;

//	// Для нераспределенных сумм подразделение определяется по кор.счету,.
//	// Если оно не было явно задано в колонке "Подразделение" таблицы документа.
//	// Как, например, для операции "Поступление от продаж по платежным картам".
//	Если НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Подразделение) Тогда
//		СтрокаВзаиморасчетов.Подразделение = СтрокаДокумента.КорПодразделение;
//	КонецЕсли;
//	
//	КоэффициентРуб = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
//		?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0, СтрокаДокумента.СуммаРуб / СтрокаДокумента.СуммаВзаиморасчетов));
//	СтрокаВзаиморасчетов.СуммаРуб              = Окр(НераспределеннаяСумма * КоэффициентРуб, 2);
//	СтрокаВзаиморасчетов.СуммаВзаиморасчетов = НераспределеннаяСумма;
//	
//	СтрокаВзаиморасчетов.СуммаБУ = НераспределеннаяСуммаБУ;
//	СтрокаВзаиморасчетов.СуммаНУ = НераспределеннаяСуммаБУ;
//	
//	Если (Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент) 
//		И ЗначениеЗаполнено(СтрокаДокумента.ПорядокОтраженияАванса) Тогда
//		Если СтрокаДокумента.ПорядокОтраженияАванса = Перечисления.ПорядокОтраженияАвансов.ДоходЕНВД Тогда
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//			СтрокаВзаиморасчетов.СуммаБУ_ЕНВД = СтрокаВзаиморасчетов.СуммаБУ;
//		ИначеЕсли СтрокаДокумента.ПорядокОтраженияАванса = Перечисления.ПорядокОтраженияАвансов.ДоходКомитента Тогда
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//			СтрокаВзаиморасчетов.СуммаБУ_Комитента = СтрокаВзаиморасчетов.СуммаБУ;
//		ИначеЕсли ТипЗнч(СтрокаДокумента.ПорядокОтраженияАванса) = Тип("СправочникСсылка.Патенты") Тогда
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//			СтрокаВзаиморасчетов.СуммаБУ_Патент = СтрокаВзаиморасчетов.СуммаБУ;
//		КонецЕсли;
//	КонецЕсли;

//КонецПроцедуры

//#КонецОбласти

//#Область Взаиморасчет

//Функция ПодготовитьСтруктуруТаблицВзаимозачета(ТаблицаДебиторскаяЗадолженность,	ТаблицаДебиторскаяЗадолженностьВозвратАванса,
//	ТаблицаКредиторскаяЗадолженность, ТаблицаКредиторскаяЗадолженностьВозвратАванса, ТаблицаРеквизиты, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыТаблицыВзаимозачета(ТаблицаДебиторскаяЗадолженность, ТаблицаДебиторскаяЗадолженностьВозвратАванса,
//		ТаблицаКредиторскаяЗадолженность, ТаблицаКредиторскаяЗадолженностьВозвратАванса, ТаблицаРеквизиты);

//	Реквизиты = Параметры.Реквизиты[0];

//	ТаблицаДебиторскаяЗадолженностьВзаимозачет = ПустаяТаблицаВзаимозачет();
//	ТаблицаДебиторскаяЗадолженностьВозвратАвансаВзаимозачет = ПустаяТаблицаВзаимозачет();
//	ТаблицаКредиторскаяЗадолженностьВзаимозачет = ПустаяТаблицаВзаимозачет();
//	ТаблицаКредиторскаяЗадолженностьВозвратАвансаВзаимозачет = ПустаяТаблицаВзаимозачет();

//	// Обход таблицы дебиторской задолженности.
//	Для каждого СтрокаДебиторскойЗадолженности Из Параметры.ТаблицаДебиторскаяЗадолженность Цикл

//		Если ЗначениеЗаполнено(СтрокаДебиторскойЗадолженности.КорСчет) Тогда

//			СтрокаВзаимозачета = ТаблицаДебиторскаяЗадолженностьВзаимозачет.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности);
//			
//		Иначе

//			// Обход таблицы кредиторской задолженности.
//			Для каждого СтрокаКредиторскойЗадолженности Из Параметры.ТаблицаКредиторскаяЗадолженность Цикл

//				Если СтрокаДебиторскойЗадолженности.СуммаБУ = 0 Тогда
//					Прервать;
//				КонецЕсли;

//				Если СтрокаКредиторскойЗадолженности.СуммаБУ = 0 Тогда
//				    Продолжить;
//				КонецЕсли;

//			    Если ЗначениеЗаполнено(СтрокаКредиторскойЗадолженности.КорСчет) Тогда

//					СтрокаВзаимозачета = ТаблицаКредиторскаяЗадолженностьВзаимозачет.Добавить();
//					ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаКредиторскойЗадолженности);

//					СтрокаКредиторскойЗадолженности.СуммаБУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаНУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = 0;

//				Иначе

//					СтрокаВзаимозачета = ТаблицаДебиторскаяЗадолженностьВзаимозачет.Добавить();
//					ЗаполнитьПараметрыВзаимозачета(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности,
//						СтрокаКредиторскойЗадолженности, Реквизиты);

//				КонецЕсли;

//			КонецЦикла;

//			// Обход таблицы кредиторской задолженности (возврат аванса).
//			Для каждого СтрокаКредиторскойЗадолженности Из ТаблицаКредиторскаяЗадолженностьВозвратАванса Цикл

//				Если СтрокаДебиторскойЗадолженности.СуммаБУ = 0 Тогда
//					Прервать;
//				КонецЕсли;

//				Если СтрокаКредиторскойЗадолженности.СуммаБУ = 0 Тогда
//				    Продолжить;
//				КонецЕсли;

//				Если ЗначениеЗаполнено(СтрокаКредиторскойЗадолженности.КорСчет) Тогда

//					СтрокаВзаимозачета = ТаблицаКредиторскаяЗадолженностьВозвратАванса.Добавить();
//					ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаКредиторскойЗадолженности);

//					СтрокаКредиторскойЗадолженности.СуммаБУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаНУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = 0;

//				Иначе

//					СтрокаВзаимозачета = ТаблицаДебиторскаяЗадолженностьВзаимозачет.Добавить();
//					ЗаполнитьПараметрыВзаимозачета(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности,
//						СтрокаКредиторскойЗадолженности, Реквизиты);

//				КонецЕсли;

//			КонецЦикла;

//		КонецЕсли;

//	КонецЦикла;

//	// Обход таблицы дебиторской задолженности (возврат аванса).
//	Для каждого СтрокаДебиторскойЗадолженности Из Параметры.ТаблицаДебиторскаяЗадолженностьВозвратАванса Цикл

//		Если ЗначениеЗаполнено(СтрокаДебиторскойЗадолженности.КорСчет) Тогда

//			СтрокаВзаимозачета = ТаблицаДебиторскаяЗадолженностьВозвратАвансаВзаимозачет.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности);

//		Иначе

//			// Обход таблицы кредиторской задолженности.
//			Для каждого СтрокаКредиторскойЗадолженности Из Параметры.ТаблицаКредиторскаяЗадолженность Цикл

//				Если СтрокаДебиторскойЗадолженности.СуммаБУ = 0 Тогда
//					Прервать;
//				КонецЕсли;

//				Если СтрокаКредиторскойЗадолженности.СуммаБУ = 0 Тогда
//				    Продолжить;
//				КонецЕсли;

//				Если ЗначениеЗаполнено(СтрокаКредиторскойЗадолженности.КорСчет) Тогда

//					СтрокаВзаимозачета = ТаблицаКредиторскаяЗадолженностьВзаимозачет.Добавить();
//					ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаКредиторскойЗадолженности);

//					СтрокаКредиторскойЗадолженности.СуммаБУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаНУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = 0;

//				Иначе

//					СтрокаВзаимозачета = ТаблицаДебиторскаяЗадолженностьВозвратАвансаВзаимозачет.Добавить();
//					ЗаполнитьПараметрыВзаимозачета(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности,
//						СтрокаКредиторскойЗадолженности, Реквизиты);

//				КонецЕсли;

//			КонецЦикла;

//			// Обход таблицы кредиторской задолженности (возврат аванса).
//			Для каждого СтрокаКредиторскойЗадолженности Из ТаблицаКредиторскаяЗадолженностьВозвратАванса Цикл

//				Если СтрокаДебиторскойЗадолженности.СуммаБУ = 0 Тогда
//					Прервать;
//				КонецЕсли;

//				Если СтрокаКредиторскойЗадолженности.СуммаБУ = 0 Тогда
//				    Продолжить;
//				КонецЕсли;

//				Если ЗначениеЗаполнено(СтрокаКредиторскойЗадолженности.КорСчет) Тогда

//					СтрокаВзаимозачета = ТаблицаКредиторскаяЗадолженностьВозвратАванса.Добавить();
//					ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаКредиторскойЗадолженности);

//					СтрокаКредиторскойЗадолженности.СуммаБУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаНУ = 0;
//					СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = 0;

//				Иначе

//					СтрокаВзаимозачета = ТаблицаДебиторскаяЗадолженностьВозвратАвансаВзаимозачет.Добавить();
//					ЗаполнитьПараметрыВзаимозачета(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности,
//						СтрокаКредиторскойЗадолженности, Реквизиты);

//				КонецЕсли;

//			КонецЦикла;

//		КонецЕсли;

//	КонецЦикла;

//	// Обход оставшейся кредиторской задолженности.
//	Для каждого СтрокаКредиторскойЗадолженности Из Параметры.ТаблицаКредиторскаяЗадолженность Цикл

//		Если СтрокаКредиторскойЗадолженности.СуммаБУ = 0
//		И СтрокаКредиторскойЗадолженности.СуммаНУ = 0
//		И СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = 0 Тогда
//			Продолжить;
//		КонецЕсли;

//		СтрокаВзаимозачета = ТаблицаКредиторскаяЗадолженностьВзаимозачет.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаКредиторскойЗадолженности);

//	КонецЦикла;

//	// Обход таблицы оставшейся кредиторской задолженности (возврат аванса).
//	Для каждого СтрокаКредиторскойЗадолженности Из ТаблицаКредиторскаяЗадолженностьВозвратАванса Цикл

//		Если СтрокаКредиторскойЗадолженности.СуммаБУ = 0
//		И СтрокаКредиторскойЗадолженности.СуммаНУ = 0
//		И СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = 0 Тогда
//			Продолжить;
//		КонецЕсли;

//		СтрокаВзаимозачета = ТаблицаКредиторскаяЗадолженностьВозвратАвансаВзаимозачет.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаКредиторскойЗадолженности);

//	КонецЦикла;

//	СтруктураТаблицВзаимозачета = Новый Структура;
//	СтруктураТаблицВзаимозачета.Вставить("ТаблицаДебиторскаяЗадолженность", ТаблицаДебиторскаяЗадолженностьВзаимозачет);
//	СтруктураТаблицВзаимозачета.Вставить("ТаблицаДебиторскаяЗадолженностьВозвратАванса", ТаблицаДебиторскаяЗадолженностьВозвратАвансаВзаимозачет);
//	СтруктураТаблицВзаимозачета.Вставить("ТаблицаКредиторскаяЗадолженность", ТаблицаКредиторскаяЗадолженностьВзаимозачет);
//	СтруктураТаблицВзаимозачета.Вставить("ТаблицаКредиторскаяЗадолженностьВозвратАванса", ТаблицаКредиторскаяЗадолженностьВозвратАвансаВзаимозачет);

//	Возврат СтруктураТаблицВзаимозачета;

//КонецФункции

//Функция ПодготовитьПараметрыТаблицыВзаимозачета(ТаблицаДебиторскаяЗадолженность, ТаблицаДебиторскаяЗадолженностьВозвратАванса,
//	ТаблицаКредиторскаяЗадолженность, ТаблицаКредиторскаяЗадолженностьВозвратАванса, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента";           // <СправочникСсылка.Валюты>.

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Взаиморасчеты

//	СписокОбязательныхКолонок = ""
//	+ "Подразделение,"                    // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается.
//	+ "Контрагент,"                       // <СправочникСсылка.Контрагенты> - контрагент, задолженность по которому погашается.
//	+ "ДоговорКонтрагента,"               // <СправочникСсылка.ДоговорыКонтрагентов> - договор, задолженность по которому погашается.
//	+ "ДокументРасчетов,"                 // <ДокументСсылка> - документ расчетов, задолженность по которому погашается.
//	+ "ДатаДокументаРасчетов,"            // <Дата> - дата документа расчетов, задолженность по которому погашается.
//	+ "ВалютаВзаиморасчетов,"             // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "СчетРасчетов,"                     // <ПланСчетовСсылка.Хозрасчетный> - счет расчетов, задолженность по которому погашается.
//	+ "КорСчет,"                          // <ПланСчетовСсылка.Хозрасчетный> - счет, корреспондирующий со счетом расчетов.
//	+ "КорСубконто1,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто2,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто3,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорПодразделение,"                 // <Ссылка на справочник подразделений> - подразделение по корсчету.
//	+ "ОстатокВзаиморасчетов,"            // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "СуммаВзаиморасчетов,"              // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "СуммаБУ,"                          // <Число,15,2> - сумма в рублях в оценке для бух.учета.
//	+ "СуммаНУ,"                          // <Число,15,2> - сумма в рублях в оценке для налогового учета.
//	+ "СуммаВзаиморасчетовЕНВД,"          // <Число,15,2> - сумма по деятельности ЕНВД в валюте взаиморасчетов.
//	+ "СуммаВзаиморасчетовПатент,"        // <Число,15,2> - сумма по деятельности на патенте в валюте взаиморасчетов.
//	+ "СуммаБУ_ЕНВД,"                     // <Число,15,2> - сумма по деятельности ЕНВД в рублях.
//	+ "СуммаБУ_Патент,"                   // <Число,15,2> - сумма по деятельности на патенте в рублях.
//	+ "СуммаВзаиморасчетовКомитента,"     // <Число,15,2> - сумма за товары и услуги комитентов в валюте взаиморасчетов.
//	+ "СуммаБУ_Комитента,"
//	+ "РасчетыВУсловныхЕдиницах,"         // <Булево> - признак ведения расчетов в условных единицах.
//	+ "Разница,"                          // <Число,15,2> - суммовая разница при расчетах в условных единицах.
//	+ "СтавкаНДС,"                        // <ПеречислениеСсылка.СтавкиНДС> - ставка НДС.
//	+ "Содержание";                       // <Строка,150>.

//	Параметры.Вставить("ТаблицаДебиторскаяЗадолженность", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаДебиторскаяЗадолженность, СписокОбязательныхКолонок));

//	Параметры.Вставить("ТаблицаДебиторскаяЗадолженностьВозвратАванса", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаДебиторскаяЗадолженностьВозвратАванса, СписокОбязательныхКолонок));

//	Параметры.Вставить("ТаблицаКредиторскаяЗадолженность", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаКредиторскаяЗадолженность, СписокОбязательныхКолонок));

//	Параметры.Вставить("ТаблицаКредиторскаяЗадолженностьВозвратАванса", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаКредиторскаяЗадолженностьВозвратАванса, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//Процедура ЗаполнитьПараметрыВзаимозачета(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности, СтрокаКредиторскойЗадолженности, Реквизиты)

//	РасчетыВВалюте = Реквизиты.ВалютаДокумента <> Константы.ВалютаРегламентированногоУчета.Получить();

//	СуммаСоответствия = ?(РасчетыВВалюте,
//		Мин(СтрокаДебиторскойЗадолженности.СуммаВзаиморасчетов, СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов),
//		Мин(СтрокаДебиторскойЗадолженности.СуммаБУ, СтрокаКредиторскойЗадолженности.СуммаБУ));

//	Если СуммаСоответствия = 0 Тогда
//		Возврат;
//	КонецЕсли;

//	ЗаполнитьЗначенияСвойств(СтрокаВзаимозачета, СтрокаДебиторскойЗадолженности);

//	Если НЕ ЗначениеЗаполнено(СтрокаВзаимозачета.КорСчет) Тогда
//		СтрокаВзаимозачета.КорСчет                 = СтрокаКредиторскойЗадолженности.СчетРасчетов;
//		СтрокаВзаимозачета.КорПодразделение        = СтрокаКредиторскойЗадолженности.Подразделение;
//		СтрокаВзаимозачета.КорСубконто1            = СтрокаКредиторскойЗадолженности.Контрагент;
//		СтрокаВзаимозачета.КорСубконто2            = СтрокаКредиторскойЗадолженности.ДоговорКонтрагента;
//		СтрокаВзаимозачета.КорСубконто3            = СтрокаКредиторскойЗадолженности.ДокументРасчетов;
//		СтрокаВзаимозачета.КорВалютаВзаиморасчетов = СтрокаКредиторскойЗадолженности.ВалютаВзаиморасчетов;
//	КонецЕсли;
//	
//	Если РасчетыВВалюте Тогда

//		СтрокаВзаимозачета.СуммаВзаиморасчетов    = СуммаСоответствия;
//		СтрокаВзаимозачета.КорСуммаВзаиморасчетов = СуммаСоответствия;

//		Коэффициент = ?(СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = 0, 0, СуммаСоответствия /
//			СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов);

//		СтрокаВзаимозачета.СуммаБУ = Окр(СтрокаКредиторскойЗадолженности.СуммаБУ * Коэффициент, 2);
//		СтрокаВзаимозачета.СуммаНУ = Окр(СтрокаКредиторскойЗадолженности.СуммаНУ * Коэффициент, 2);

//	Иначе

//		СтрокаВзаимозачета.СуммаБУ = СуммаСоответствия;

//		Коэффициент = ?(СтрокаКредиторскойЗадолженности.СуммаБУ = 0, 0, СуммаСоответствия /
//			СтрокаКредиторскойЗадолженности.СуммаБУ);

//		СтрокаВзаимозачета.СуммаНУ = Окр(СтрокаКредиторскойЗадолженности.СуммаНУ * Коэффициент, 2);
//		
//		СтрокаВзаимозачета.КорСуммаВзаиморасчетов = Окр(СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов * Коэффициент, 2);
//		
//		Если Коэффициент = 1 Тогда
//			
//			КоэффициентДляСуммыВзаиморасчетов = ?(СтрокаДебиторскойЗадолженности.СуммаБУ = 0, 0, СуммаСоответствия /
//			СтрокаДебиторскойЗадолженности.СуммаБУ);
//			
//			СтрокаВзаимозачета.СуммаВзаиморасчетов    = Окр(СтрокаДебиторскойЗадолженности.СуммаВзаиморасчетов * КоэффициентДляСуммыВзаиморасчетов, 2);
//			
//		Иначе
//			СтрокаВзаимозачета.СуммаВзаиморасчетов    = СтрокаДебиторскойЗадолженности.СуммаВзаиморасчетов;
//		КонецЕсли;	
//		
//	КонецЕсли;

//	СтрокаДебиторскойЗадолженности.СуммаБУ = СтрокаДебиторскойЗадолженности.СуммаБУ -
//		СтрокаВзаимозачета.СуммаБУ;
//	СтрокаДебиторскойЗадолженности.СуммаНУ = СтрокаДебиторскойЗадолженности.СуммаНУ -
//		СтрокаВзаимозачета.СуммаНУ;
//	СтрокаДебиторскойЗадолженности.СуммаВзаиморасчетов = СтрокаДебиторскойЗадолженности.СуммаВзаиморасчетов -
//		СтрокаВзаимозачета.СуммаВзаиморасчетов;

//	СтрокаКредиторскойЗадолженности.СуммаБУ = СтрокаКредиторскойЗадолженности.СуммаБУ -
//		СтрокаВзаимозачета.СуммаБУ;
//	СтрокаКредиторскойЗадолженности.СуммаНУ = СтрокаКредиторскойЗадолженности.СуммаНУ -
//		СтрокаВзаимозачета.СуммаНУ;
//	СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов = СтрокаКредиторскойЗадолженности.СуммаВзаиморасчетов -
//		СтрокаВзаимозачета.КорСуммаВзаиморасчетов;

//КонецПроцедуры

//#КонецОбласти

//#Область ПереносЗадолженности

//Функция ПодготовитьТаблицуВзаиморасчетовПереносЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыТаблицыВзаиморасчетовПереносЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты);

//	Реквизиты = Параметры.Реквизиты[0];

//	ТаблицаПереносЗадолженности = ПустаяТаблицаВзаиморасчетовПереносЗадолженности(Реквизиты.УчитыватьЗадолженностьУСН);

//	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();

//	Для каждого СтрокаВзаиморасчетов Из Параметры.Взаиморасчеты Цикл
//		
//		Если СтрокаВзаиморасчетов.ВалютаВзаиморасчетовСПолучателем = ВалютаРеглУчета Тогда
//			КурсВалюты = 1;
//			КратностьВалюты = 1;
//		Иначе
//			ПараметрыКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаВзаиморасчетов.ВалютаВзаиморасчетовСПолучателем, Реквизиты.Период);
//			КурсВалюты = ПараметрыКурса.Курс;
//			КратностьВалюты = ПараметрыКурса.Кратность;
//		КонецЕсли;

//		СтрокаПереносЗадолженности = ТаблицаПереносЗадолженности.Добавить();

//		ЗаполнитьЗначенияСвойств(СтрокаПереносЗадолженности, СтрокаВзаиморасчетов);

//		Если СтрокаВзаиморасчетов.ВалютаВзаиморасчетовСПолучателем = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов Тогда

//			СтрокаПереносЗадолженности.КорВалютаВзаиморасчетов = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//			СтрокаПереносЗадолженности.КорСуммаВзаиморасчетов = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;

//		Иначе

//			СтрокаПереносЗадолженности.КорВалютаВзаиморасчетов = СтрокаВзаиморасчетов.ВалютаВзаиморасчетовСПолучателем;
//			СтрокаПереносЗадолженности.КорСуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
//				СтрокаВзаиморасчетов.СуммаБУ,
//				ВалютаРеглУчета, СтрокаВзаиморасчетов.ВалютаВзаиморасчетовСПолучателем,
//				1, КурсВалюты,
//				1, КратностьВалюты);

//		КонецЕсли;

//	КонецЦикла;

//	Возврат ТаблицаПереносЗадолженности;

//КонецФункции

//Процедура СформироватьДвиженияПереносЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыПереносЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты);

//	Если Параметры.Взаиморасчеты.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;

//	Реквизиты = Параметры.Реквизиты[0];

//	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);

//	ДтКтРасчетов = ?(Реквизиты.НаправлениеДвижения = "Поступление", "Кт", "Дт");
//	ДтКтКорСчета = ?(ДтКтРасчетов = "Кт", "Дт", "Кт");

//	Для каждого СтрокаВзаиморасчетов из Параметры.Взаиморасчеты Цикл

//		// Основная проводка по счету расчетов.

//		Проводка = Движения.Хозрасчетный.Добавить();

//		Проводка.Период       = Реквизиты.Период;
//		Проводка.Организация  = Реквизиты.Организация;
//		Проводка.Содержание   = СтрокаВзаиморасчетов.Содержание;

//		Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ;

//		Проводка["Счет" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СчетРасчетов;

//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//		СвойстваСчетаРасчетов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//		Если СвойстваСчетаРасчетов.Валютный Тогда
//			Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//			Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//		КонецЕсли;

//		Проводка["Счет" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорСчет;

//		Для Ном = 1 по 3 Цикл
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтКорСчета], Проводка["Субконто" + ДтКтКорСчета],
//				Ном, СтрокаВзаиморасчетов["КорСубконто" + Ном]);
//		КонецЦикла;

//		СвойстваКорСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтКорСчета]);
//		Если СвойстваКорСчета.Валютный Тогда
//			Проводка["Валюта" + ДтКтКорСчета]        = СтрокаВзаиморасчетов.КорВалютаВзаиморасчетов;
//			Проводка["ВалютнаяСумма" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорСуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваКорСчета.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорПодразделение;
//		КонецЕсли;

//		Если ОтражатьВНалоговомУчете Тогда
//			СуммаНУ = СтрокаВзаиморасчетов.СуммаНУ;
//			Если СвойстваСчетаРасчетов.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтРасчетов] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтРасчетов] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтРасчетов] = 0;
//			КонецЕсли;
//			Если СвойстваКорСчета.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтКорСчета] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтКорСчета] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтКорСчета] = 0;
//			КонецЕсли;
//		КонецЕсли;

//		// Проводки по вспомогательным счетам задолженности УСН.

//		// Проводка Дт УСН.01 (УСН.21) - если ДтКтРасчетов = "Дт".
//		// Или Кт УСН.01 (УСН.21)  - если ДтКтРасчетов = "Кт".
//		Если Реквизиты.УчитыватьЗадолженностьУСН
//			И СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД <> 0 Тогда

//			Проводка = Движения.Хозрасчетный.Добавить();

//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = "Погашение задолженности по деятельности ЕНВД";

//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД;
//				Проводка["Счет" + ДтКтКорСчета] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД;
//			Иначе
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД;
//				Проводка["Счет" + ДтКтКорСчета] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД;
//			КонецЕсли;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//			Для Ном = 1 по 3 Цикл
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтКорСчета], Проводка["Субконто" + ДтКтКорСчета],
//				Ном, СтрокаВзаиморасчетов["КорСубконто" + Ном]);
//			КонецЦикла;
//			
//			СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаУСН.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["Валюта" + ДтКтКорСчета]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//				Проводка["ВалютнаяСумма" + ДтКтКорСчета] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//			КонецЕсли;
//			Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				Проводка["Подразделение" + ДтКтКорСчета] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_ЕНВД;

//		КонецЕсли;

//		// Проводка Дт УСН.02 (УСН.22) - если ДтКтРасчетов = "Дт".
//		// Или Кт УСН.02 (УСН.22)  - если ДтКтРасчетов = "Кт".
//		Если Реквизиты.УчитыватьЗадолженностьУСН
//			И СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента <> 0 Тогда

//			Проводка = Движения.Хозрасчетный.Добавить();

//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = "Погашение задолженности за товары и услуги комитента";

//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент;
//				Проводка["Счет" + ДтКтКорСчета] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент;
//			Иначе
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент;
//				Проводка["Счет" + ДтКтКорСчета] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент;
//			КонецЕсли;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//			Для Ном = 1 по 3 Цикл
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтКорСчета], Проводка["Субконто" + ДтКтКорСчета],
//				Ном, СтрокаВзаиморасчетов["КорСубконто" + Ном]);
//			КонецЦикла;
//			
//			СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаУСН.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["Валюта" + ДтКтКорСчета]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//				Проводка["ВалютнаяСумма" + ДтКтКорСчета] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//			КонецЕсли;
//			Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				Проводка["Подразделение" + ДтКтКорСчета] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Комитента;

//		КонецЕсли;
//		
//		// Проводка Дт УСН.03 (УСН.31) - если ДтКтРасчетов = "Дт".
//		// Или Кт УСН.03 (УСН.31)  - если ДтКтРасчетов = "Кт".
//		Если Реквизиты.УчитыватьЗадолженностьУСНПатент
//			И СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент <> 0 Тогда

//			Проводка = Движения.Хозрасчетный.Добавить();

//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = "Погашение задолженности по деятельности ЕНВД";

//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент;
//				Проводка["Счет" + ДтКтКорСчета] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент;
//			Иначе
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент;
//				Проводка["Счет" + ДтКтКорСчета] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент;
//			КонецЕсли;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);
//				
//			Для Ном = 1 по 3 Цикл
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтКорСчета], Проводка["Субконто" + ДтКтКорСчета],
//				Ном, СтрокаВзаиморасчетов["КорСубконто" + Ном]);
//			КонецЦикла;

//			СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаУСН.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["Валюта" + ДтКтКорСчета]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//				Проводка["ВалютнаяСумма" + ДтКтКорСчета] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//			КонецЕсли;
//			Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				Проводка["Подразделение" + ДтКтКорСчета] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Патент;

//		КонецЕсли;

//	КонецЦикла;

//	Движения.Хозрасчетный.Записывать = Истина;

//КонецПроцедуры

//Функция ПодготовитьПараметрыТаблицыВзаиморасчетовПереносЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                           // <Дата> - период движений - дата документа.
//	+ "Регистратор,"                      // <ДокументСсылка>.
//	+ "Организация,"                      // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента,"                  // <СправочникСсылка.Валюты>.
//	+ "УчитыватьЗадолженностьУСН,"        // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент,"  // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения";              // <Строка> - "Поступление" при погашении дебиторской задолженности (поступлении денежных средств).
//	                                      //          - "Выбытие" при погашении кредиторской задолженности (выбытии денежных средств).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Взаиморасчеты.

//	СписокОбязательныхКолонок = ""
//	+ "Подразделение,"                    // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается.
//	+ "Контрагент,"                       // <СправочникСсылка.Контрагенты> - контрагент, задолженность по которому погашается.
//	+ "ДоговорКонтрагента,"               // <СправочникСсылка.ДоговорыКонтрагентов> - договор, задолженность по которому погашается.
//	+ "ДокументРасчетов,"                 // <ДокументСсылка> - документ расчетов, задолженность по которому погашается.
//	+ "ВалютаВзаиморасчетов,"             // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "ВалютаВзаиморасчетовСПолучателем," // <СправочникСсылка.Валюты>.
//	+ "СчетРасчетов,"                     // <ПланСчетовСсылка.Хозрасчетный> - счет расчетов, задолженность по которому погашается.
//	+ "КорСчет,"                          // <ПланСчетовСсылка.Хозрасчетный> - счет, корреспондирующий со счетом расчетов.
//	+ "КорСубконто1,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто2,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто3,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорПодразделение,"                 // <Ссылка на справочник подразделений> - подразделение по корсчету.
//	+ "ОстатокВзаиморасчетов,"
//	+ "СуммаВзаиморасчетов,"              // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "СуммаБУ,"                          // <Число,15,2> - сумма в рублях в оценке для бух.учета.
//	+ "СуммаНУ,"                          // <Число,15,2> - сумма в рублях в оценке для налогового учета.
//	+ "СуммаВзаиморасчетовЕНВД,"          // <Число,15,2> - сумма по деятельности ЕНВД в валюте взаиморасчетов.
//	+ "СуммаБУ_ЕНВД,"                     // <Число,15,2> - сумма по деятельности ЕНВД в рублях.
//	+ "СуммаВзаиморасчетовПатент,"        // <Число,15,2> - сумма по деятельности на патенте в валюте взаиморасчетов.
//	+ "СуммаБУ_Патент,"                   // <Число,15,2> - сумма по деятельности на патенте в рублях.
//	+ "СуммаВзаиморасчетовКомитента,"     // <Число,15,2> - сумма за товары и услуги комитентов в валюте взаиморасчетов.
//	+ "СуммаБУ_Комитента,"
//	+ "РасчетыВУсловныхЕдиницах,"         // <Булево> - признак ведения расчетов в условных единицах.
//	+ "Разница,"                          // <Число,15,2> - суммовая разница при расчетах в условных единицах.
//	+ "СтавкаНДС,"                        // <ПеречислениеСсылка.СтавкиНДС> - ставка НДС.
//	+ "Содержание";                       // <Строка,150>.

//	Параметры.Вставить("Взаиморасчеты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаВзаиморасчетов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//Функция ПодготовитьПараметрыПереносЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента,"           // <СправочникСсылка.Валюты>.
//	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения";       // <Строка> - "Поступление" при погашении дебиторской задолженности (поступлении денежных средств).
//	                               //          - "Выбытие" при погашении кредиторской задолженности (выбытии денежных средств).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Взаиморасчеты.

//	СписокОбязательныхКолонок = ""
//	+ "Подразделение,"                 // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается.
//	+ "Контрагент,"                    // <СправочникСсылка.Контрагенты> - контрагент, задолженность по которому погашается.
//	+ "ДоговорКонтрагента,"            // <СправочникСсылка.ДоговорыКонтрагентов> - договор, задолженность по которому погашается.
//	+ "ДокументРасчетов,"              // <ДокументСсылка> - документ расчетов, задолженность по которому погашается.
//	+ "ВалютаВзаиморасчетов,"             // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "ВалютаВзаиморасчетовСПолучателем," // <СправочникСсылка.Валюты>.
//	+ "СчетРасчетов,"                     // <ПланСчетовСсылка.Хозрасчетный> - счет расчетов, задолженность по которому погашается.
//	+ "КорСчет,"                          // <ПланСчетовСсылка.Хозрасчетный> - счет, корреспондирующий со счетом расчетов.
//	+ "КорСубконто1,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто2,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто3,"                     // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорПодразделение,"                 // <Ссылка на справочник подразделений> - подразделение по корсчету.
//	+ "КорВалютаВзаиморасчетов,"          // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "КорСуммаВзаиморасчетов,"           // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "СуммаВзаиморасчетов,"              // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "СуммаБУ,"                       // <Число,15,2> - сумма в рублях в оценке для бух.учета.
//	+ "СуммаНУ,"                       // <Число,15,2> - сумма в рублях в оценке для налогового учета.
//	+ "СуммаВзаиморасчетовЕНВД,"       // <Число,15,2> - сумма по деятельности ЕНВД в валюте взаиморасчетов.
//	+ "СуммаБУ_ЕНВД,"                  // <Число,15,2> - сумма по деятельности ЕНВД в рублях.
//	+ "СуммаВзаиморасчетовПатент,"     // <Число,15,2> - сумма по деятельности на патенте в валюте взаиморасчетов.
//	+ "СуммаБУ_Патент,"                // <Число,15,2> - сумма по деятельности на патенте в рублях.
//	+ "СуммаВзаиморасчетовКомитента,"  // <Число,15,2> - сумма за товары и услуги комитентов в валюте взаиморасчетов.
//	+ "СуммаБУ_Комитента,"
//	+ "Содержание";                   // <Строка,150>.

//	Параметры.Вставить("Взаиморасчеты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаВзаиморасчетов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//Функция ПустаяТаблицаВзаиморасчетовПереносЗадолженности(УчитыватьЗадолженностьУСН)

//	ПустаяТаблица = Новый ТаблицаЗначений();

//	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",          Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("ВалютаВзаиморасчетов",  Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	ПустаяТаблица.Колонки.Добавить("ВалютаВзаиморасчетовСПолучателем",  Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	ПустаяТаблица.Колонки.Добавить("Подразделение",         БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ПустаяТаблица.Колонки.Добавить("Контрагент",            Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
//	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента",    БухгалтерскийУчетКлиентСерверПереопределяемый.ПолучитьОписаниеТиповДоговора());
//	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",      Документы.ТипВсеСсылки());
//	ПустаяТаблица.Колонки.Добавить("ДатаДокументаРасчетов", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
//	ПустаяТаблица.Колонки.Добавить("ОстатокВзаиморасчетов", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов",   ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ",               ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРуб",              ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаНУ",               ОбщегоНазначения.ОписаниеТипаЧисло(15,2));

//	ПустаяТаблица.Колонки.Добавить("РасчетыВУсловныхЕдиницах", Новый ОписаниеТипов("Булево"));
//	ПустаяТаблица.Колонки.Добавить("Разница",                  ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",                Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
//	ПустаяТаблица.Колонки.Добавить("КорСчет",                 Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("КорПодразделение",        БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ОписаниеТипаСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Тип;
//	Для Ном = 1 По 3 Цикл
//		ПустаяТаблица.Колонки.Добавить("КорСубконто" + Ном, ОписаниеТипаСубконто);
//	КонецЦикла;
//	ПустаяТаблица.Колонки.Добавить("КорВалютаВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	ПустаяТаблица.Колонки.Добавить("КорСуммаВзаиморасчетов", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));

//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовЕНВД",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_ЕНВД",                 ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовПатент",    ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_Патент",               ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовКомитента", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_Комитента",            ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("Содержание",                   ОбщегоНазначения.ОписаниеТипаСтрока(150));

//	Возврат ПустаяТаблица;

//КонецФункции

//#КонецОбласти

//#Область СписаниеЗадолженности

//Функция ПодготовитьТаблицуВзаиморасчетовСписаниеЗадолженности(РасшифровкаПлатежа, ТаблицаРеквизиты, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыТаблицыВзаиморасчетовСписаниеЗадолженности(РасшифровкаПлатежа, ТаблицаРеквизиты);

//	Реквизиты = Параметры.Реквизиты[0];

//	ТаблицаВзаиморасчетов = ПустаяТаблицаВзаиморасчетовПогашениеЗадолженности(Реквизиты.УчитыватьЗадолженностьУСН);

//	Если Параметры.РасшифровкаПлатежа.Количество() = 0 Тогда
//		Возврат ТаблицаВзаиморасчетов;
//	КонецЕсли;

//	ОстаткиЗадолженности = ПолучитьОстаткиЗадолженности(Параметры.РасшифровкаПлатежа, Реквизиты, Отказ);

//	Для каждого СтрокаПлатежа Из Параметры.РасшифровкаПлатежа Цикл

//		НераспределенныйОстаток = СтрокаПлатежа.СуммаВзаиморасчетов;

//		ДобавитьСтрокиСписанияЗадолженности(
//			ТаблицаВзаиморасчетов,
//			НераспределенныйОстаток,
//			ОстаткиЗадолженности,
//			СтрокаПлатежа,
//			Реквизиты,
//			Отказ);

//		ДобавитьСтрокуАвансаСписаниеЗадолженности(
//			ТаблицаВзаиморасчетов,
//			НераспределенныйОстаток,
//			СтрокаПлатежа,
//			Реквизиты);

//	КонецЦикла;

//	Возврат ТаблицаВзаиморасчетов;

//КонецФункции

//Процедура СформироватьДвиженияСписаниеЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыПогашениеЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты);

//	Если Параметры.Взаиморасчеты.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;

//	Реквизиты = Параметры.Реквизиты[0];

//	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);

//	ДтКтРасчетов = ?(Реквизиты.НаправлениеДвижения = "Поступление", "Кт", "Дт");
//	ДтКтКорСчета = ?(ДтКтРасчетов = "Кт", "Дт", "Кт");

//	Для каждого СтрокаВзаиморасчетов из Параметры.Взаиморасчеты Цикл

//		// Основная проводка по счету расчетов.

//		Проводка = Движения.Хозрасчетный.Добавить();

//		Проводка.Период       = Реквизиты.Период;
//		Проводка.Организация  = Реквизиты.Организация;
//		Проводка.Содержание   = СтрокаВзаиморасчетов.Содержание;

//		Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ;

//		Проводка["Счет" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СчетРасчетов;

//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//		СвойстваСчетаРасчетов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//		Если СвойстваСчетаРасчетов.Валютный Тогда
//			Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//			Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//		КонецЕсли;

//		Проводка["Счет" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорСчет;

//		Для Ном = 1 по 3 Цикл
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтКорСчета], Проводка["Субконто" + ДтКтКорСчета],
//				Ном, СтрокаВзаиморасчетов["КорСубконто" + Ном]);
//		КонецЦикла;

//		СвойстваКорСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтКорСчета]);
//		Если СвойстваКорСчета.Валютный Тогда
//			Проводка["Валюта" + ДтКтКорСчета]        = Реквизиты.ВалютаДокумента;
//			Проводка["ВалютнаяСумма" + ДтКтКорСчета] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваКорСчета.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорПодразделение;
//		КонецЕсли;

//		Если ОтражатьВНалоговомУчете Тогда
//			СуммаНУ = СтрокаВзаиморасчетов.СуммаНУ;
//			Если СвойстваСчетаРасчетов.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтРасчетов] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтРасчетов] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтРасчетов] = 0;
//			КонецЕсли;
//			Если СвойстваКорСчета.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтКорСчета] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтКорСчета] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтКорСчета] = 0;
//			КонецЕсли;
//		КонецЕсли;

//		// Проводки по вспомогательным счетам задолженности УСН.

//		// Проводка Дт УСН.01 (УСН.21) - если ДтКтРасчетов = "Дт".
//		// Или Кт УСН.01 (УСН.21)  - если ДтКтРасчетов = "Кт".
//		Если Реквизиты.УчитыватьЗадолженностьУСН
//			И СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД <> 0 Тогда

//			Проводка = Движения.Хозрасчетный.Добавить();

//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = "Погашение задолженности по деятельности ЕНВД";

//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД;
//			Иначе
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД;
//			КонецЕсли;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//			СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаУСН.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//			КонецЕсли;
//			Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_ЕНВД;

//		КонецЕсли;

//		// Проводка Дт УСН.02 (УСН.22) - если ДтКтРасчетов = "Дт".
//		// Или Кт УСН.02 (УСН.22)  - если ДтКтРасчетов = "Кт".
//		Если Реквизиты.УчитыватьЗадолженностьУСН
//			И СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента <> 0 Тогда

//			Проводка = Движения.Хозрасчетный.Добавить();

//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = "Погашение задолженности за товары и услуги комитента";

//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент;
//			Иначе
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент;
//			КонецЕсли;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//			СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаУСН.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//			КонецЕсли;
//			Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Комитента;

//		КонецЕсли;
//		
//		// Проводка Дт УСН.03 (УСН.31) - если ДтКтРасчетов = "Дт".
//		// Или Кт УСН.03 (УСН.31)  - если ДтКтРасчетов = "Кт".
//		Если Реквизиты.УчитыватьЗадолженностьУСНПатент
//			И СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент <> 0 Тогда

//			Проводка = Движения.Хозрасчетный.Добавить();

//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = "Погашение задолженности по деятельности ЕНВД";

//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент;
//			Иначе
//				Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент;
//			КонецЕсли;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//			СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаУСН.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//			КонецЕсли;
//			Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Патент;

//		КонецЕсли;

//	КонецЦикла;

//	Движения.Хозрасчетный.Записывать = Истина;

//КонецПроцедуры

//Функция ПодготовитьПараметрыТаблицыВзаиморасчетовСписаниеЗадолженности(РасшифровкаПлатежа, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.РасшифровкаПлатежа.

//	СписокОбязательныхКолонок = ""
//	+ "НомерСтроки,"                   // <Число, 6,0> - номер строки документа.
//	+ "Подразделение,"                 // <Ссылка на справочник подразделений>.
//	+ "Контрагент,"                    // <СправочникСсылка.Контрагенты> - контрагент, задолженность по которому погашается.
//	+ "ДоговорКонтрагента,"            // <СправочникСсылка.ДоговорыКонтрагентов> - договор, задолженность по которому погашается.
//	+ "ВалютаВзаиморасчетов,"          // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "РасчетыВУсловныхЕдиницах,"      // <Булево> - Истина для договора с расчетами в условных единицах.
//	+ "РасчетыВВалюте,"                // <Булево> - Истина для договора с расчетами в любой валюте, кроме рублей (в т.ч и в условных единицах).
//	+ "СпособПогашенияЗадолженности,"  // <ПеречислениеСсылка.СпособыПогашенияЗадолженности>.
//	+ "ДокументРасчетов,"              // <ДокументСсылка> - документ расчетов, задолженность по которому погашается при способе "По документу".
//	+ "СчетРасчетов,"                  // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом.
//	+ "СчетАвансов,"                   // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом по авансам.
//	+ "КорСчет,"                       // <ПланСчетовСсылка.Хозрасчетный> - счет, коррекспондирующий со счетом расчетов с контрагентом.
//	+ "КорСубконто1,"                  // <Характеристика.ВидыСубконтоХозрасчетные> - субконто 1 по корсчету.
//	+ "КорСубконто2,"                  // <Характеристика.ВидыСубконтоХозрасчетные> - субконто 2 по корсчету.
//	+ "КорСубконто3,"                  // <Характеристика.ВидыСубконтоХозрасчетные> - субконто 3 по корсчету.
//	+ "КорПодразделение,"              // <Ссылка на справочник подразделений> - подразделение по корсчету.
//	+ "СуммаВзаиморасчетов,"           // <Число,15,2> - сумма погашения задолженности в валюте взаиморасчетов.
//	+ "СуммаРуб,"                      // <Число,15,2> - сумма погашения задолженности в рублях.
//	+ "СуммаНУ,"                       // <Число,15,2> - сумма признания доходов (расходов) в рублях.
//	+ "Содержание";                    // <Строка,150>.

//	Параметры.Вставить("РасшифровкаПлатежа", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		РасшифровкаПлатежа, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента,"           // <СправочникСсылка.Валюты>.
//	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения,"       // <Строка> - "Поступление" при погашении дебиторской задолженности (поступлении денежных средств).
//	                               //          - "Выбытие" при погашении кредиторской задолженности (выбытии денежных средств).
//	+ "ЭтоВозврат";                // <Булево> - Истина при возврате денежных средств (покупателю или от поставщика).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//Процедура ДобавитьСтрокиСписанияЗадолженности(ТаблицаВзаиморасчетов, НераспределеннаяСумма, ОстаткиЗадолженности, СтрокаПлатежа, Реквизиты, Отказ)

//	Если СтрокаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.НеПогашать Тогда
//		Возврат;
//	КонецЕсли;

//	РасчетыВВалюте           = СтрокаПлатежа.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить();
//	РасчетыВУсловныхЕдиницах = СтрокаПлатежа.РасчетыВУсловныхЕдиницах;
//	Регистратор              = Реквизиты.Регистратор;

//	КоэффициентНУ = ?(СтрокаПлатежа.СуммаНУ = 0, 0, СтрокаПлатежа.СуммаНУ / СтрокаПлатежа.СуммаРуб);

//	Отбор = Новый Структура("СчетРасчетов,Контрагент,ДоговорКонтрагента");
//	Если СтрокаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу Тогда
//		Отбор.Вставить("ДокументРасчетов");
//	КонецЕсли;
//	ЗаполнитьЗначенияСвойств(Отбор, СтрокаПлатежа);
//	ОстаткиЗадолженностиСОтбором = ОстаткиЗадолженности.Скопировать(Отбор);
//	ОстаткиЗадолженностиСОтбором.Сортировать("ДатаДокументаРасчетов,ДокументРасчетов", Новый СравнениеЗначений);

//	Для каждого СтрокаОстатка Из ОстаткиЗадолженностиСОтбором Цикл

//		Если НераспределеннаяСумма <= 0 Тогда
//			Прервать;
//		КонецЕсли;

//		ПогашеннаяСумма = Мин(НераспределеннаяСумма, СтрокаОстатка.СуммаВзаиморасчетов);
//		Если ПогашеннаяСумма <= 0 Тогда
//			Продолжить;
//		КонецЕсли;

//		СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаПлатежа);
//		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаОстатка);

//		СтрокаВзаиморасчетов.СуммаВзаиморасчетов = ПогашеннаяСумма;

//		Если РасчетыВВалюте Тогда

//			// Погашение долга в валюте производится в БУ и НУ по курсу тек.документа.
//			// Погашение долга в условных единицах производятся в БУ по курсу тек.документа, в НУ формируется суммовая разница,.
//			// 	Для ПБУ 18 образуется постоянная разница, равная суммовой.

//			// Возвраты в валюте производятся в БУ по курсу остатка,.
//			// Вв НУ по курсу тек.документа, для ПБУ 18 образуется постоянная разница.
//			// Возвраты в условных единицах производятся в БУ и НУ только по курсу остатка,.
//			// 	Если курс остатка БУ отличается от курса тек.документа - сообщается об ошибке и документ возврата не проводится.

//			СуммаПоКурсуДокумента = Окр(
//				ПогашеннаяСумма * СтрокаПлатежа.СуммаРуб / СтрокаПлатежа.СуммаВзаиморасчетов, 2);

//			СуммаБУпоКурсуОстатка = Окр(
//				ПогашеннаяСумма * СтрокаОстатка.СуммаБУ / СтрокаОстатка.СуммаВзаиморасчетов, 2);
//			СуммаНУпоКурсуОстатка = Окр(
//				ПогашеннаяСумма * СтрокаОстатка.СуммаНУ / СтрокаОстатка.СуммаВзаиморасчетов, 2);

//			Если Реквизиты.ЭтоВозврат Тогда

//				// Возвраты предоплаты в валюте и в условных единицах производятся в БУ и НУ по курсу предоплаты.
//				СтрокаВзаиморасчетов.СуммаБУ = СуммаБУпоКурсуОстатка;
//				СтрокаВзаиморасчетов.СуммаНУ = Окр(СуммаБУпоКурсуОстатка * КоэффициентНУ, 2);

//				Если РасчетыВУсловныхЕдиницах Тогда

//					КурсОстаткаОтличаетсяОтКурсаДокумента = СуммаПоКурсуДокумента <> СуммаБУпоКурсуОстатка;
//					Если КурсОстаткаОтличаетсяОтКурсаДокумента Тогда
//						ТекстОшибки = НСтр("ru='Рублевая сумма возврата по договору в условных единицах отличается от суммы по курсу остатка долга.
//							|	Договор: ""%1"", документ расчетов: ""%2"":
//							|	Сумма возврата: %3 %4, по курсу остатка: %5 руб.
//							|	Возврат по документу: %6 руб.
//							|	Возвраты по договору в условных единицах должны производиться по курсу остатка долга!'");
//						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//							ТекстОшибки,
//							СтрокаОстатка.ДоговорКонтрагента,
//							СтрокаОстатка.ДокументРасчетов,
//							ПогашеннаяСумма,
//							СтрокаОстатка.Валюта,
//							СуммаБУпоКурсуОстатка,
//							СуммаПоКурсуДокумента);
//						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Регистратор, , , Отказ);
//					КонецЕсли;

//				Иначе
//					// При расчетах в валюте дополнительно передается отдельная сумма.
//					// Для "обратной" переоценки в НУ возвращаемой суммы до курса поступления предоплаты.
//					СтрокаВзаиморасчетов.Разница = СуммаПоКурсуДокумента - СуммаБУпоКурсуОстатка;

//				КонецЕсли;

//			Иначе

//				// Погашение долга в валюте и в условных единицах производятся в БУ и НУ по курсу тек.документа.
//				СтрокаВзаиморасчетов.СуммаБУ = СуммаПоКурсуДокумента;
//				СтрокаВзаиморасчетов.СуммаНУ = Окр(СуммаПоКурсуДокумента * КоэффициентНУ, 2);

//				// При расчетах в у.е дополнительно передается.
//				// Отдельная сумма для формирования в НУ суммовой разницы.
//				Если РасчетыВУсловныхЕдиницах Тогда
//					СтрокаВзаиморасчетов.Разница = СуммаПоКурсуДокумента - СуммаНУпоКурсуОстатка;
//				КонецЕсли;

//			КонецЕсли;

//		Иначе
//			// Расчеты в рублях.
//			СтрокаВзаиморасчетов.СуммаБУ = ПогашеннаяСумма;
//			СтрокаВзаиморасчетов.СуммаНУ = Окр(ПогашеннаяСумма * КоэффициентНУ, 2);
//		КонецЕсли;

//		Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда

//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД = Окр(СтрокаОстатка.СуммаВзаиморасчетовЕНВД
//				* СтрокаВзаиморасчетов.СуммаВзаиморасчетов / СтрокаОстатка.СуммаВзаиморасчетов, 2);
//				
//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент = Окр(СтрокаОстатка.СуммаВзаиморасчетовПатент
//				* СтрокаВзаиморасчетов.СуммаВзаиморасчетов / СтрокаОстатка.СуммаВзаиморасчетов, 2);

//			СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента = Окр(СтрокаОстатка.СуммаВзаиморасчетовКомитента
//				* СтрокаВзаиморасчетов.СуммаВзаиморасчетов / СтрокаОстатка.СуммаВзаиморасчетов, 2);

//			Если РасчетыВВалюте И (СтрокаОстатка.СуммаВзаиморасчетовЕНВД <> 0) Тогда
//				СтрокаВзаиморасчетов.СуммаБУ_ЕНВД = Окр(СтрокаОстатка.СуммаБУ_ЕНВД
//					* СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД / СтрокаОстатка.СуммаВзаиморасчетовЕНВД, 2);
//			Иначе
//				СтрокаВзаиморасчетов.СуммаБУ_ЕНВД = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//			КонецЕсли;
//			
//			Если РасчетыВВалюте И (СтрокаОстатка.СуммаВзаиморасчетовПатент <> 0) Тогда
//				СтрокаВзаиморасчетов.СуммаБУ_Патент = Окр(СтрокаОстатка.СуммаБУ_Патент
//					* СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент / СтрокаОстатка.СуммаВзаиморасчетовПатент, 2);
//			Иначе
//				СтрокаВзаиморасчетов.СуммаБУ_Патент = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//			КонецЕсли;

//			Если РасчетыВВалюте И (СтрокаОстатка.СуммаВзаиморасчетовКомитента <> 0) Тогда
//				СтрокаВзаиморасчетов.СуммаБУ_Комитента = Окр(СтрокаОстатка.СуммаБУ_Комитента
//					* СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента / СтрокаОстатка.СуммаВзаиморасчетовКомитента, 2);
//			Иначе
//				СтрокаВзаиморасчетов.СуммаБУ_Комитента = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//			КонецЕсли;

//		КонецЕсли;

//		НераспределеннаяСумма = НераспределеннаяСумма - ПогашеннаяСумма;

//		// Остатки уменьшаем в строке основной таблицы остатков.
//		СтрокаОстаткаБезОтбора = ОстаткиЗадолженности.Найти(СтрокаОстатка.НомерСтроки, "НомерСтроки");

//		СтрокаОстаткаБезОтбора.СуммаВзаиморасчетов = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетов
//			- СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		СтрокаОстаткаБезОтбора.СуммаБУ = СтрокаОстаткаБезОтбора.СуммаБУ - СтрокаВзаиморасчетов.СуммаБУ;
//		СтрокаОстаткаБезОтбора.СуммаНУ = СтрокаОстаткаБезОтбора.СуммаНУ - СтрокаВзаиморасчетов.СуммаНУ;
//		Если РасчетыВУсловныхЕдиницах Тогда
//			СтрокаОстаткаБезОтбора.СуммаНУ = СтрокаОстаткаБезОтбора.СуммаНУ + СтрокаВзаиморасчетов.Разница;
//		КонецЕсли;

//		Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда

//			СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовЕНВД      = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовЕНВД
//				- СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//			СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовПатент    = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовПатент
//				- СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//			СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовКомитента = СтрокаОстаткаБезОтбора.СуммаВзаиморасчетовКомитента
//				- СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//			СтрокаОстаткаБезОтбора.СуммаБУ_ЕНВД      = СтрокаОстаткаБезОтбора.СуммаБУ_ЕНВД
//				- СтрокаВзаиморасчетов.СуммаБУ_ЕНВД;
//			СтрокаОстаткаБезОтбора.СуммаБУ_Патент    = СтрокаОстаткаБезОтбора.СуммаБУ_Патент
//				- СтрокаВзаиморасчетов.СуммаБУ_Патент;
//			СтрокаОстаткаБезОтбора.СуммаБУ_Комитента = СтрокаОстаткаБезОтбора.СуммаБУ_Комитента
//				- СтрокаВзаиморасчетов.СуммаБУ_Комитента;

//		КонецЕсли;

//	КонецЦикла;

//КонецПроцедуры

//Процедура ДобавитьСтрокуАвансаСписаниеЗадолженности(ТаблицаВзаиморасчетов, НераспределеннаяСумма, СтрокаДокумента, Реквизиты)

//	Если НераспределеннаяСумма <= 0 Тогда
//		Возврат;
//	КонецЕсли;

//	РасчетыВВалюте = СтрокаДокумента.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить();

//	СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();

//	ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаДокумента);
//	СтрокаВзаиморасчетов.СчетРасчетов          = СтрокаДокумента.СчетАвансов;
//	СтрокаВзаиморасчетов.ДокументРасчетов      = Реквизиты.Регистратор;
//	СтрокаВзаиморасчетов.ДатаДокументаРасчетов = Реквизиты.Период;

//	// Для нераспределенных сумм подразделение определяется по кор.счету,.
//	// Если оно не было явно задано в колонке "Подразделение" таблицы документа.
//	// Как, например, для операции "Поступление от продаж по платежным картам".
//	Если НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Подразделение) Тогда
//		СтрокаВзаиморасчетов.Подразделение = СтрокаДокумента.КорПодразделение;
//	КонецЕсли;

//	СтрокаВзаиморасчетов.СуммаВзаиморасчетов = НераспределеннаяСумма;

//	Если РасчетыВВалюте Тогда
//		СтрокаВзаиморасчетов.СуммаБУ = Окр(НераспределеннаяСумма
//			* СтрокаДокумента.СуммаРуб / СтрокаДокумента.СуммаВзаиморасчетов, 2);
//	Иначе
//		СтрокаВзаиморасчетов.СуммаБУ = НераспределеннаяСумма;
//	КонецЕсли;

//	КоэффициентНУ = ?(СтрокаДокумента.СуммаНУ = 0, 0, СтрокаДокумента.СуммаНУ / СтрокаДокумента.СуммаРуб);

//	СтрокаВзаиморасчетов.СуммаНУ = Окр(СтрокаВзаиморасчетов.СуммаБУ * КоэффициентНУ, 2);

//КонецПроцедуры

//#КонецОбласти

//#Область КомиссионноеВознаграждение

//Процедура СформироватьДвиженияПоКомиссионномуВознаграждению(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт
//	
//	Параметры = ПодготовитьПараметрыПоКомиссионномуВознаграждению(ТаблицаВзаиморасчетов, ТаблицаРеквизиты);
//	
//	Если Параметры.Реквизиты.Количество() = 0
//		ИЛИ Параметры.КомиссионноеВознаграждение.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Реквизиты = Параметры.Реквизиты[0];
//	
//	Отбор = Новый Структура("ДокументРасчетов", Реквизиты.Регистратор);
//	ТаблицаКомиссионноеВознаграждение = Параметры.КомиссионноеВознаграждение.Скопировать(Отбор);
//	
//	Если ТаблицаКомиссионноеВознаграждение.Количество() = 0 
//		 ИЛИ НЕ Реквизиты.УдержатьВознаграждение 
//		 ИЛИ Реквизиты.СчетАвансов = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТаблицаКомиссионноеВознаграждение.ЗаполнитьЗначения(Реквизиты.СчетАвансов, "СчетАвансов");
//	ДтКтРасчетов = ?(Реквизиты.НаправлениеДвижения = "Поступление", "Дт", "Кт");
//	ДтКтАвансов  = ?(ДтКтРасчетов = "Дт", "Кт", "Дт");
//	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);
//	
//	Для каждого СтрокаВзаиморасчетов Из ТаблицаКомиссионноеВознаграждение Цикл
//		
//		Если СтрокаВзаиморасчетов.СчетРасчетов <> СтрокаВзаиморасчетов.СчетАвансов Тогда
//			
//			Проводка = Движения.Хозрасчетный.Добавить();
//			Проводка.Период       = Реквизиты.Период;
//			Проводка.Организация  = Реквизиты.Организация;
//			Проводка.Содержание   = "Оказание услуг по договору комиссии";

//			Проводка["Счет" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СчетРасчетов;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//				"ДокументыРасчетовСКонтрагентами", Реквизиты.Регистратор);

//			СвойстваСчетаРасчетов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//			Если СвойстваСчетаРасчетов.Валютный Тогда
//				Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//			КонецЕсли;
//			Если СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.ПодразделениеРасчетов;
//			КонецЕсли;

//			Проводка["Счет" + ДтКтАвансов] = СтрокаВзаиморасчетов.СчетАвансов;

//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтАвансов], Проводка["Субконто" + ДтКтАвансов],
//				"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтАвансов], Проводка["Субконто" + ДтКтАвансов],
//				"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтАвансов], Проводка["Субконто" + ДтКтАвансов],
//				"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//			СвойстваСчетаАвансов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтАвансов]);
//			Если СвойстваСчетаАвансов.Валютный Тогда
//				Проводка["Валюта" + ДтКтАвансов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//				Проводка["ВалютнаяСумма" + ДтКтАвансов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//			Конецесли;
//			Если СвойстваСчетаАвансов.УчетПоПодразделениям Тогда
//				Проводка["Подразделение" + ДтКтАвансов] = СтрокаВзаиморасчетов.Подразделение;
//			КонецЕсли;

//			Если СтрокаВзаиморасчетов.РасчетыВВалюте
//				И НЕ Реквизиты.ЭтоВозврат Тогда
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;
//			Иначе
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаРуб;
//			КонецЕсли;

//			Если ОтражатьВНалоговомУчете Тогда

//				Если СтрокаВзаиморасчетов.РасчетыВУсловныхЕдиницах
//					И НЕ Реквизиты.ЭтоВозврат Тогда
//					СуммаНУ = СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;
//				Иначе
//					СуммаНУ = СтрокаВзаиморасчетов.СуммаРуб;
//				КонецЕсли;
//				Если СвойстваСчетаРасчетов.НалоговыйУчет Тогда
//					Проводка["СуммаНУ" + ДтКтРасчетов] = СуммаНУ;
//					Проводка["СуммаПР" + ДтКтРасчетов] = Проводка.Сумма - СуммаНУ;
//					Проводка["СуммаВР" + ДтКтРасчетов] = 0;
//				КонецЕсли;
//				Если СвойстваСчетаАвансов.НалоговыйУчет Тогда
//					Проводка["СуммаНУ" + ДтКтАвансов] = СуммаНУ;
//					Проводка["СуммаПР" + ДтКтАвансов] = Проводка.Сумма - СуммаНУ;
//					Проводка["СуммаВР" + ДтКтАвансов] = 0;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Движения.Хозрасчетный.Записывать = Истина;
//	
//КонецПроцедуры

//Функция ПодготовитьПараметрыПоКомиссионномуВознаграждению(ТаблицаВзаиморасчетов, ТаблицаРеквизиты)
//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "УдержатьВознаграждение,"    // <Булево> - Удержать вознаграждение.
//	+ "ЭтоВозврат,"                // <Булево>.
//	+ "СчетАвансов,"               // <ПланСчетовСсылка.Хозрасчетный> - счет, на котором будет учтено комиссионное вознаграждение.
//	+ "НаправлениеДвижения"        // <Строка> - "Поступление" при зачете авансов, выданных поставщикам (при поступлении материальных ценностей).
//	                               //          - "Выбытие" при зачете авансов, полученных от покупателей (при выбытии материальных ценностей).
//	;
//	
//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Взаиморасчеты.

//	СписокОбязательныхКолонок = ""
//		+ "Контрагент,"                   // <СправочникСсылка.Контрагенты>.
//		+ "ДоговорКонтрагента,"           // <СправочникСсылка.ДоговорыКонтрагентов>.
//		+ "ДокументРасчетов,"             // <ДокументСсылка>.
//		+ "ВидДоговора,"                  //
//		+ "ВалютаВзаиморасчетов,"         // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//		+ "РасчетыВУсловныхЕдиницах,"     // <Булево> - флаг расчетов в условных единицах.
//		+ "СчетРасчетов,"                 // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом.
//		+ "СчетАвансов,"                  // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов по авансам.
//		+ "Подразделение,"                // <Ссылка на справочник подразделений> - подразделение по счету авансов.
//		+ "ПодразделениеРасчетов,"        // <Ссылка на справочник подразделений> - подразделение по счету расчетов.
//		+ "РасчетыВВалюте,"               // <Булево>  - флаг расчетов в валюте (в т.ч. и в условных единицах).
//		+ "СуммаВзаиморасчетов,"          // <Число,15,2> - сумма в валюте взаиморасчетов.
//		+ "СуммаРубПоКурсуАванса,"        // <Число,15,2> - сумма в рублях по курсу на дату аванса.
//		+ "СуммаРуб,"                     // <Число,15,2> - сумма в рублях (для валютных расчетов - по курсу на дату документа).
//		+ "СуммаВзаиморасчетовЕНВД,"      // <Число,15,2> - сумма в валюте расчетов по договору по деятельности ЕНВД.
//		+ "СуммаРуб_ЕНВД,"                // <Число,15,2> - сумма в рублях по деятельности ЕНВД.
//		+ "СуммаВзаиморасчетовКомитента," // <Число,15,2> - сумма в валюте расчетов по договору при реализации товаров и услуг комитентов.
//		+ "СуммаРуб_Комитента";           // <Число,15,2> - сумма в рублях при реализации товаров и услуг комитентов.

//	Параметры.Вставить("КомиссионноеВознаграждение", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаВзаиморасчетов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//	
//КонецФункции

//#КонецОбласти

//#Область ПоступлениеЗакупленныхТоваровИУслугКомитентов

//Процедура СформироватьДвиженияПоступлениеЗакупленныхТоваровУслугКомитентов(ТаблицаВзаиморасчеты, ТаблицаРеквизиты, Движения, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыПоступлениеЗакупленныхТоваровУслугКомитентов(ТаблицаВзаиморасчеты, ТаблицаРеквизиты);

//	Если Параметры.Взаиморасчеты.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;

//	Реквизиты = Параметры.Реквизиты[0];

//	ПоддержкаПБУ18 = УчетнаяПолитика.ПоддержкаПБУ18(Реквизиты.Организация, Реквизиты.Период);
//	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);

//	Для каждого СтрокаТаблицы Из Параметры.Взаиморасчеты Цикл
//		
//		// Проводка по формированию задолженности комитента по договору комиссии на закупку перед нами. 
//		// И нашей задолженности перед поставщиком.
//		
//		Проводка = Движения.Хозрасчетный.Добавить();

//		Проводка.Период      = Реквизиты.Период;
//		Проводка.Организация = Реквизиты.Организация;
//		Проводка.Содержание  = СтрокаТаблицы.Содержание;

//		Проводка.СчетДт = СтрокаТаблицы.СчетРасчетовКомитента;
//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаТаблицы.Комитент);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", СтрокаТаблицы.ДоговорКомитента);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицы.ДокументРасчетовКомитента);

//		СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);

//		Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
//			Проводка.ПодразделениеДт = Реквизиты.Подразделение;
//		КонецЕсли;
//		
//		Если СвойстваСчетаДт.Валютный Тогда
//			Проводка.ВалютаДт        = СтрокаТаблицы.ДоговорКомитента.ВалютаВзаиморасчетов;
//			Проводка.ВалютнаяСуммаДт = СтрокаТаблицы.СуммаВзаиморасчетовКомитент;
//		КонецЕсли;

//		Проводка.СчетКт = СтрокаТаблицы.СчетРасчетовПоставщика;
//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаТаблицы.Поставщик);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", СтрокаТаблицы.ДоговорПоставщика);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", СтрокаТаблицы.ДокументРасчетовПоставщика);

//		СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);

//		Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
//			Проводка.ПодразделениеКт = Реквизиты.Подразделение;
//		КонецЕсли;

//		Если СвойстваСчетаКт.Валютный Тогда
//			Проводка.ВалютаКт        = СтрокаТаблицы.ВалютаВзаиморасчетовПоставщика;
//			Проводка.ВалютнаяСуммаКт = СтрокаТаблицы.СуммаВзаиморасчетов;
//		КонецЕсли;
//		
//		Проводка.Сумма = СтрокаТаблицы.СуммаБУ;

//		Если ОтражатьВНалоговомУчете Тогда

//			Если СвойстваСчетаДт.НалоговыйУчет Тогда
//				Проводка.СуммаНУДт = СтрокаТаблицы.СуммаНУ;
//				Если ПоддержкаПБУ18 Тогда
//					Проводка.СуммаПРДт = СтрокаТаблицы.СуммаБУ - СтрокаТаблицы.СуммаНУ;
//					Проводка.СуммаВРДт = 0;
//				КонецЕсли;
//			КонецЕсли;

//			Если СвойстваСчетаКт.НалоговыйУчет Тогда
//				Проводка.СуммаНУКт = СтрокаТаблицы.СуммаНУ;
//				Если ПоддержкаПБУ18 Тогда
//					Проводка.СуммаПРКт = СтрокаТаблицы.СуммаБУ - СтрокаТаблицы.СуммаНУ;
//					Проводка.СуммаВРКт = 0;
//				КонецЕсли;
//			КонецЕсли;

//		КонецЕсли;

//	КонецЦикла;

//	Движения.Хозрасчетный.Записывать = Истина;

//КонецПроцедуры

//Функция ПодготовитьПараметрыПоступлениеЗакупленныхТоваровУслугКомитентов(ТаблицаВзаиморасчеты, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Взаиморасчеты.

//	СписокОбязательныхКолонок = ""
//	+ "СчетРасчетовКомитента,"          // <ПланСчетовСсылка.Хозрасчетный> - счет расчетов с комитентом по договору на закупку.
//	+ "Комитент,"                       // <СправочникСсылка.Контрагенты> - комитент, для которого закупаются товары и услуги.
//	+ "ДоговорКомитента,"               // <СправочникСсылка.ДоговорыКонтрагентов> - договор с комитентом, по которому закупаются товары и услуги.
//	+ "ДокументРасчетовКомитента,"      // <ДокументСсылка> - документ расчетов, по которому увеличивается задолженность комитента.
//	+ "СчетРасчетовПоставщика,"         // <ПланСчетовСсылка.Хозрасчетный> - счет расчетов с поставщиком.
//	+ "Поставщик,"                      // <СправочникСсылка.Контрагенты> - поставщик, у которого закупаются товары и услуги для комитента.
//	+ "ДоговорПоставщика,"              // <СправочникСсылка.ДоговорыКонтрагентов> - договор с поставщиком, по которому закупаются товары и услуги для комитента.
//	+ "ВалютаВзаиморасчетовПоставщика," // <СправочникСсылка.Валюты> - валюта расчетов по договору с поставщиком.
//	+ "ДокументРасчетовПоставщика,"     // <ДокументСсылка> - документ расчетов, по которому увеличивается наша задолженность перед поставщиком.
//	+ "СуммаВзаиморасчетов,"            // <Число,15,2> - сумма в валюте расчетов с поставщиком.
//	+ "СуммаВзаиморасчетовКомитент,"    // <Число,15,2> - сумма в валюте расчетов с комитентом.
//	+ "СуммаБУ,"                        // <Число,15,2> - сумма в рублях.
//	+ "СуммаНУ,"                        // <Число,15,2> - сумма в рублях (НУ).
//	+ "Содержание";                     // <Строка,150> - содержание проводки.

//	Параметры.Вставить("Взаиморасчеты",
//		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаВзаиморасчеты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Регистратор,"                    // <ДокументСсылка> - документ-регистратор движений.
//	+ "Период,"                         // <Дата> - период движений - дата документа.
//	+ "Организация,"                    // <СправочникСсылка.Организация> - организация документа.
//	+ "Подразделение,";                 // <Ссылка на справочник подразделений> - подразделение документа.

//	Параметры.Вставить("Реквизиты",
//		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//#КонецОбласти

#Область ЗаполнениеДокументовИПроверкаПравильности

// Возвращает таблицу значений со счетами, используемыми для учета взаиморсчетов.
//
// Параметры:
//  <ВключатьГруппыСчетов>  	- <Булево> - нужно ли в таблицу включать группы счетов?.
//  <РаскрыватьГруппыСчетов>  	- <Булево> - нужно ли в таблицу включать субсчета групп счетов?.
//								Если первый параметр установлен в ЛОЖЬ, второй параметр не учитывается (всегда ИСТИНА).
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений с единственной колонкой "СчетУчета".
//
Функция ПолучитьТаблицуСчетовУчетаВзаиморасчетов(ВключатьГруппыСчетов = Ложь, РаскрыватьГруппыСчетов = Истина) Экспорт

	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ФинансовыеВложения);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);

	СписокСчетовИсключить = Новый Массив;
	СписокСчетовИсключить.Добавить(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСчетов", 	СписокСчетов);
	Запрос.УстановитьПараметр("СписокСчетовИсключить", СписокСчетовИсключить);
	Запрос.УстановитьПараметр("ЛицевыеСчета", 	ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК СчетРасчетов
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	НЕ Хозрасчетный.Ссылка В (&СписокСчетовИсключить)
	|	И Хозрасчетный.ВидыСубконто.ВидСубконто = &ЛицевыеСчета
	|	И НЕ Хозрасчетный.Забалансовый
	|УПОРЯДОЧИТЬ ПО
	|	Хозрасчетный.Порядок";
						 
	Возврат Запрос.Выполнить();
	
КонецФункции // ПолучитьСчетаВзаиморасчетовПоУмолчанию()
 
//// Проверяет возможность проведения в регламентированном учете в зависимости от договора взаиморасчетов.
////
//Функция ПроверитьВозможностьПроведенияВРеглУчете(ДокументОбъект, ДоговорКонтрагента, ТекстСообщения = "") Экспорт
//	
//	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
//		
//	Если ОбщегоНазначенияБП.ЕстьРеквизитДокумента("ВидОперации", ДокументОбъект.Ссылка.Метаданные()) Тогда
//		ВидОперации = ДокументОбъект.ВидОперации;
//	Иначе
//		ВидОперации = Неопределено;
//	КонецЕсли;
//	
//	Если ОбщегоНазначенияБП.ЕстьРеквизитДокумента("ВалютаДокумента", ДокументОбъект.Ссылка.Метаданные()) Тогда
//		ВалютаДокумента = ДокументОбъект.ВалютаДокумента;
//	Иначе
//		ВалютаДокумента = ВалютаРегламентированногоУчета;
//	КонецЕсли;
//	
//	ТекстСообщения = "";
//	
//	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровПоставщику") Тогда
//		ЭтоДокументОплаты = Ложь;
//	Иначе
//		ЭтоДокументОплаты = 
//		УчетВзаиморасчетов.ОпределениеНаправленияДвиженияДляДокументаДвиженияДенежныхСредств(ДокументОбъект, ВидОперации).Направление <> Неопределено;
//	КонецЕсли; 	
//	
//	ВалютаВзаиморасчетов     = ДоговорКонтрагента.ВалютаВзаиморасчетов;
//	РасчетыВУсловныхЕдиницах = ДоговорКонтрагента.РасчетыВУсловныхЕдиницах;
//	
//	Если ВалютаВзаиморасчетов <> ВалютаДокумента 
//		И ВалютаРегламентированногоУчета <> ВалютаДокумента Тогда
//		// Документ выписан в валюте отличной от валюты регламентированного.
//		// Учета и валюты расчетов. Возможно только в документах оплаты.
//		ТекстСообщения = НСтр("ru = 'Валюта документа (%1) отличается 
//							   |от валюты регламентированного учета (%2) 
//							   |и валюты расчетов по договору ""%3"" (%4).'");
//		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВалютаДокумента, 
//		                                                                         ВалютаРегламентированногоУчета,
//		                                                                         ДоговорКонтрагента, ВалютаВзаиморасчетов);
//		Возврат Ложь;
//	ИначеЕсли ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
//		Если ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета И НЕ РасчетыВУсловныхЕдиницах Тогда
//			// Документ выписан в валюте регламентированного учета. Валюта расчетов иная. Договор не в у.е. 
//			ТекстСообщения = НСтр("ru = 'Валюта расчетов по договору ""%1"" (%2) отличается 
//								   |от валюты регламентированного учета (%3).
//								   |В этом случае документы могут быть выписаны в валюте регламентированного учета
//								   |только при расчетах в условных единицах.'");
//			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДоговорКонтрагента, 
//			                                                                         ВалютаВзаиморасчетов,
//			                                                                         ВалютаРегламентированногоУчета);
//			Возврат Ложь;
//		КонецЕсли;
//	Иначе
//		// Валюта документа равна валюте взаиморасчетов (отличной от валюты  рег. учета).	
//		Если РасчетыВУсловныхЕдиницах И ЭтоДокументОплаты Тогда 
//			// При расчетах в у.е. документы оплаты могут выписываться только в валюте рег.учета.
//			ТекстСообщения = НСтр("ru = 'Документ оплаты при расчете по договору (%1) в условных единицах
//								   |может быть выписан только в валюте регламентированного учета (%2).'");
//			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДоговорКонтрагента, 
//			                                                                         ВалютаРегламентированногоУчета);
//			Возврат Ложь;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат Истина;

//КонецФункции // ПроверитьВозможностьПроведенияВРеглУчете()

#КонецОбласти

//#Область ПодготовкаПроведенияДокументов

//Функция ОпределениеНаправленияДвиженияДляДокументаДвиженияДенежныхСредств(Знач ВидДокумента,ВидОперации = неопределено) Экспорт

//	ВидДействийДокумента = Новый Структура("Направление,РасчетыВозврат");
//	ВидыДокументовДДС    = Новый Соответствие();

//	ВидыДокументовДДС.Вставить("СписаниеСРасчетногоСчета", "Выбытие");
//	ВидыДокументовДДС.Вставить("РасходныйКассовыйОрдер", "Выбытие");
//	ВидыДокументовДДС.Вставить("ПоступлениеНаРасчетныйСчет", "Поступление");
//	ВидыДокументовДДС.Вставить("ПриходныйКассовыйОрдер", "Поступление");

//	ВидыДокументовДДС.Вставить("АвансовыйОтчет", "Выбытие");
//	ВидыДокументовДДС.Вставить("ВозвратТоваровПоставщику", "Поступление");
//	ВидыДокументовДДС.Вставить("ДокументРасчетовСКонтрагентом", "Поступление");
//	
//	
//	
//	ВидОперацииРасчет  = Перечисления.РасчетыВозврат.Расчеты;
//	ВидОперацииВозврат = Перечисления.РасчетыВозврат.Возврат;
//	
//	Если ТипЗнч(ВидДокумента) = Тип("Строка") Тогда
//		// Получен непосредственно вид документа.
//		// Дополнительные действия не требуются.
//		
//		ВидДействийДокумента.Вставить("Направление",ВидыДокументовДДС[ВидДокумента]);
//		
//	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ВидДокумента)) Тогда
//		ТипСсылки = ТипЗнч(ВидДокумента);
//		// Получена ссылка на документ. Необходимо определить его вид.
//	    Для каждого ТекущееЗначениеСоответствия Из ВидыДокументовДДС Цикл
//			Если ТипСсылки = Тип("ДокументСсылка."+ТекущееЗначениеСоответствия.Ключ) Тогда
//				ВидДействийДокумента.Вставить("Направление",ТекущееЗначениеСоответствия.Значение);
//				Прервать;
//			КонецЕсли; 
//		КонецЦикла; 
//		
//		// Специфическая обработка.
//		Если ТипСсылки = Тип("ДокументСсылка.АвансовыйОтчет") тогда
//			ВидДействийДокумента.Вставить("РасчетыВозврат", ВидОперацииРасчет);
//			Возврат ВидДействийДокумента;
//		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ВозвратТоваровПоставщику") тогда
//			ВидДействийДокумента.Вставить("РасчетыВозврат", ВидОперацииВозврат);
//			Возврат ВидДействийДокумента;
//		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") тогда
//			ВидДействийДокумента.Вставить("РасчетыВозврат", ВидОперацииРасчет);
//			Возврат ВидДействийДокумента;
//		КонецЕсли;
//	КонецЕсли; 
//	
//	Если ЗначениеЗаполнено(ВидОперации) тогда

//		// Определение вида операции.

//		РасчетВозвратПоВидуОпераций = Новый Соответствие();

//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ОплатаПоставщику,ВидОперацииРасчет);
//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ВозвратПокупателю,ВидОперацииВозврат);

//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ОплатаПокупателя,ВидОперацииРасчет);
//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика,ВидОперацииВозврат);

//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику,ВидОперацииРасчет);
//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю,ВидОперацииВозврат);

//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя,ВидОперацииРасчет);
//		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика,ВидОперацииВозврат);

//		ВидДействийДокумента.Вставить("РасчетыВозврат",РасчетВозвратПоВидуОпераций[ВидОперации]);

//	ИначеЕсли ВидДокумента="АвансовыйОтчет" тогда
//		ВидДействийДокумента.Вставить("РасчетыВозврат", ВидОперацииРасчет);
//	ИначеЕсли ВидДокумента="ВозвратТоваровПоставщику" тогда
//		ВидДействийДокумента.Вставить("РасчетыВозврат", ВидОперацииВозврат);
//	ИначеЕсли ВидДокумента="ДокументРасчетовСКонтрагентом" тогда
//		ВидДействийДокумента.Вставить("РасчетыВозврат", ВидОперацииРасчет);
//	Конецесли;

//	Возврат ВидДействийДокумента;

//КонецФункции

//Процедура ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаЗначений, Реквизиты, ВключитьНДСВОсновнуюСумму = Истина) Экспорт
//	
//	Перем СуммаВключаетНДС,ВидРасчетовПоДоговору;
//	
//	ВалютаРегламентированногоУчета = Реквизиты.ВалютаРеглУчета;
//	
//	ЕстьНДС = ТаблицаЗначений.Колонки.Найти("НДС") <> Неопределено;
//	ЕстьСтавкаНДС = ТаблицаЗначений.Колонки.Найти("СтавкаНДС") <> Неопределено;
//	ЕстьВалюта = Реквизиты.Свойство("ВалютаДокумента");
//	
//	Если ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ГТДИмпорт") Тогда 
//		// Для документа ГТДИмпорт передается специфическая структура таблицы, суммы НДС разделены по строкам. 
//		// С суммами без НДС. Расчет может производиться только пересчетом по курсу.
//		РасчетСуммыНДСПоСтавке = Ложь;
//	ИначеЕсли ЕстьВалюта И ЕстьНДС И ЕстьСтавкаНДС И Реквизиты.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
//		РасчетСуммыНДСПоСтавке =  Истина;
//	Иначе
//		РасчетСуммыНДСПоСтавке = Ложь;
//	КонецЕсли; 
//	
//	Реквизиты.Свойство("СуммаВключаетНДС", СуммаВключаетНДС);
//	СуммаВключаетНДС = (СуммаВключаетНДС = Истина);
//	
//	Если Реквизиты.Свойство("ДоговорКонтрагента") тогда
//		Если Реквизиты.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета 
//			ИЛИ НЕ ЗначениеЗаполнено(Реквизиты.ВалютаВзаиморасчетов) Тогда
//			
//			ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВВалютеРегламентированногоУчета;
//			
//		ИначеЕсли Реквизиты.РасчетыВУсловныхЕдиницах Тогда
//			
//			ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВУсловныхЕдиницах;
//			
//		Иначе
//			
//			ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВИностраннойВалюте;
//			
//		Конецесли;

//	КонецЕсли;
//	
//	// Дополним колонки ТЗ при необходимости.
//	СтруктураОбязательныхКолонок = Новый Структура("Сумма" + ?(ЕстьНДС, ",НДС,СуммаБезНДС", "") + ?(ЕстьВалюта, ",СуммаВал" + ?(ЕстьНДС, ",НДСВал,СуммаБезНДСВал", ""), ""));
//	
//	СтруктураОбязательныхКолонок.Вставить("СуммаБУ");
//	Если ЕстьНДС Тогда
//		СтруктураОбязательныхКолонок.Вставить("СуммаБУБезНДС");
//	КонецЕсли;
//	
//	Для каждого Колонка Из СтруктураОбязательныхКолонок Цикл
//		
//		Если ТаблицаЗначений.Колонки.Найти(Колонка.Ключ) = Неопределено тогда
//			ТаблицаЗначений.Колонки.Добавить(Колонка.Ключ, ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	// Дополним колонки ТЗ при необходимости нечисловыми полями.
//	Если ТаблицаЗначений.Колонки.Найти("СчетУчетаЦенности") = Неопределено тогда
//		ТаблицаЗначений.Колонки.Добавить("СчетУчетаЦенности");
//	КонецЕсли;
//	
//	Если ТаблицаЗначений.Колонки.Найти("ВидЦенности") = Неопределено тогда
//		ТаблицаЗначений.Колонки.Добавить("ВидЦенности");
//	КонецЕсли;
//	
//	Если ТаблицаЗначений.Колонки.Найти("Ценность") = Неопределено тогда
//		ТаблицаЗначений.Колонки.Добавить("Ценность");
//	КонецЕсли;
//	
//	Если ТаблицаЗначений.Колонки.Найти("Тара") = Неопределено тогда
//		ТаблицаЗначений.Колонки.Добавить("Тара", Новый ОписаниеТипов("Булево"));
//	КонецЕсли;
//	
//	// Определим суммы по документу (Сумму без НДС и корректную основную сумму).
//	Если ЕстьНДС тогда
//		
//		Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
//			СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - ?(СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
//			
//			Если РасчетСуммыНДСПоСтавке Тогда
//				СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.НДС;
//			Иначе
//				СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаБезНДС + ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДС, 0);
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Если ЕстьВалюта тогда
//		
//		// Заполним валютные колонки суммами документа.
//		Для каждого Колонка Из СтруктураОбязательныхКолонок Цикл
//			
//			Если Прав(Колонка.Ключ, 3) = "Вал" Тогда
//				ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку(Лев(Колонка.Ключ, СтрДлина(Колонка.Ключ) - 3)), Колонка.Ключ);
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		Если НЕ (Реквизиты.ВалютаДокумента = ВалютаРегламентированногоУчета) Тогда
//			
//			Если НЕ Реквизиты.Свойство("КурсДокумента") ИЛИ НЕ Реквизиты.Свойство("КратностьДокумента") тогда
//				КоэффициентПересчета = 1;
//			ИначеЕсли Число(Реквизиты.КурсДокумента) = 0 ИЛИ Число(Реквизиты.КратностьДокумента) = 0 тогда
//				КоэффициентПересчета = 1;
//			Иначе
//				КоэффициентПересчета = Реквизиты.КурсДокумента/Реквизиты.КратностьДокумента;
//			КонецЕсли;
//			
//			// Распределение суммы по таблице.
//			СуммаРег = Окр(ТаблицаЗначений.Итог("СуммаВал") * КоэффициентПересчета, 2);
//			
//			РаспределениеРег = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаРег, ТаблицаЗначений.ВыгрузитьКолонку("Сумма"));
//			Если РаспределениеРег <> Неопределено Тогда
//				ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеРег,"Сумма");
//			КонецЕсли; 
//			
//			Если ЕстьНДС Тогда
//				Если РасчетСуммыНДСПоСтавке Тогда
//					Если БухгалтерскийУчетКлиентСерверПереопределяемый.ДокументЯвляетсяРеализациейОтгруженныхТоваров(Реквизиты.Ссылка) Тогда
//						Если Реквизиты.НачислятьНДСПоОтгрузке Тогда
//							
//							// Выделение суммы НДС, Расчет суммы без НДС.
//							Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
//								
//								ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
//								Если СтрокаТаблицы.НДС = 0 Тогда
//									СтрокаТаблицы.НДС = 0;
//								Иначе
//									СтрокаТаблицы.НДС = (СтрокаТаблицы.СуммаВал * ЗначениеСтавкиНДС /(100 + ЗначениеСтавкиНДС)) * Реквизиты.КурсДокументаОтгрузки/Реквизиты.КратностьДокументаОтгрузки;
//								КонецЕсли;
//								СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
//								
//							КонецЦикла;
//							НДСРег = ТаблицаЗначений.Итог("НДС");
//							
//							// Корректировка таблицы в случае если не ВключитьНДСВОсновнуюСумму.
//							Если НЕ ВключитьНДСВОсновнуюСумму Тогда
//								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"),"Сумма");
//								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДСВал"),"СуммаВал");
//							КонецЕсли;
//						Иначе
//							// Выделение суммы НДС, Расчет суммы без НДС.
//							Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
//								ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
//								Если СтрокаТаблицы.НДС = 0 Тогда
//									СтрокаТаблицы.НДС = 0;
//								Иначе
//									СтрокаТаблицы.НДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТаблицы.Сумма * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС), 2));
//								КонецЕсли;
//								
//								СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
//							КонецЦикла;
//							НДСРег = ТаблицаЗначений.Итог("НДС");
//							
//							// Корректировка таблицы в случае если не ВключитьНДСВОсновнуюСумму.
//							Если НЕ ВключитьНДСВОсновнуюСумму Тогда
//								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "Сумма");
//								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДСВал"), "СуммаВал");
//							КонецЕсли;							
//						КонецЕсли;	
//                    Иначе
//						// Выделение суммы НДС, Расчет суммы без НДС.
//						Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
//							
//							ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
//							Если СтрокаТаблицы.НДС = 0 Тогда
//								СтрокаТаблицы.НДС = 0;
//							Иначе
//								СтрокаТаблицы.НДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТаблицы.Сумма * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС), 2));
//							КонецЕсли;
//							
//							СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
//							
//						КонецЦикла;
//						НДСРег = ТаблицаЗначений.Итог("НДС");
//						
//						// Корректировка таблицы.
//						Если НЕ ВключитьНДСВОсновнуюСумму Тогда
//							ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "Сумма");
//							ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДСВал"), "СуммаВал");
//						КонецЕсли; 
//                    КонецЕсли; 
//				Иначе
//					НДСРег = Окр(ТаблицаЗначений.Итог("НДСВал") * КоэффициентПересчета, 2);
//					// Распределение суммы по таблице.
//					РаспределениеРег = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(НДСРег,ТаблицаЗначений.выгрузитьКолонку("НДС"));
//					Если РаспределениеРег <> Неопределено Тогда
//						ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеРег, "НДС");
//					КонецЕсли; 
//					
//					// Расчет суммы без НДС.
//					Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
//						СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДС, 0);
//					КонецЦикла;
//				КонецЕсли; 
//			КонецЕсли;
//		Иначе
//			
//			// Документ в национальной валюте.
//			Если ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВУсловныхЕдиницах 
//				ИЛИ ((ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ОтражениеНДСКВычету")
//				ИЛИ ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ОтражениеНачисленияНДС"))
//				И Реквизиты.ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета) Тогда
//				
//				// Необходимо определить сумму расчетов с контрагентом в валюте договора.
//				Если НЕ Реквизиты.Свойство("КурсВзаиморасчетов") ИЛИ НЕ Реквизиты.Свойство("КратностьВзаиморасчетов") Тогда
//					КоэффициентПересчета = 1;
//				ИначеЕсли Число(Реквизиты.КурсВзаиморасчетов) = 0 ИЛИ Число(Реквизиты.КратностьВзаиморасчетов) = 0 Тогда
//					КоэффициентПересчета = 1;
//				Иначе
//					КоэффициентПересчета = Реквизиты.КратностьВзаиморасчетов / Реквизиты.КурсВзаиморасчетов;
//				КонецЕсли;
//				
//				СуммаВал = Окр(ТаблицаЗначений.Итог("Сумма") * КоэффициентПересчета, 2);
//				// Распределение суммы по таблице.
//				РаспределениеВал = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаВал,ТаблицаЗначений.ВыгрузитьКолонку("СуммаВал"));
//				Если РаспределениеВал <> Неопределено Тогда
//					ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеВал, "СуммаВал");
//				КонецЕсли; 
//				
//				
//				Если ЕстьНДС Тогда
//					
//					НДСВал = Окр(ТаблицаЗначений.Итог("НДС") * КоэффициентПересчета, 2);
//					// Распределение суммы по таблице.
//					РаспределениеВал = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(НДСВал,ТаблицаЗначений.ВыгрузитьКолонку("НДСВал"));
//					Если РаспределениеВал <> Неопределено Тогда
//						ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеВал, "НДСВал");
//					КонецЕсли; 
//					
//					// Расчет суммы без НДС.
//					Для каждого СтрокаТаблицы из ТаблицаЗначений Цикл
//						СтрокаТаблицы.СуммаБезНДСВал = СтрокаТаблицы.СуммаВал - ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДСВал, 0);
//					КонецЦикла;
//					
//					
//				КонецЕсли;
//				
//			КонецЕсли
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	// На этапе подготовки таблицы суммы для БУ совпадают с суммами для остальных видов учета (НУ, НДС...).
//	// При зачете авансов в иностранной валюте в 2008 году суммы БУ.
//	// Будут корректироваться с учетом курсов зачтенных авансов,.
//	// А суммы для других видов учета остаются прежними.
//	
//	ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("Сумма"), "СуммаБУ");
//	Если ЕстьНДС Тогда
//		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "СуммаБУБезНДС");
//	КонецЕсли;
//	
//	ТаблицаЗначений.Колонки.Добавить("СуммаНУ", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	Если ЕстьНДС Тогда
//		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБУБезНДС"), "СуммаНУ");
//	Иначе
//		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБУ"), "СуммаНУ");
//	КонецЕсли;
//	
//	СтруктураПараметров = Новый Структура("СчетЗатрат,Субконто1,Субконто2,Субконто3");
//		
//	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
//		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидЦенности) Тогда
//			ЗаполнитьЗначенияСвойств(СтруктураПараметров, СтрокаТаблицы);
//			СтрокаТаблицы.ВидЦенности = 
//				УчетНДС.ОпределитьВидЦенности(СтруктураПараметров.СчетЗатрат, СтруктураПараметров.Субконто1, СтруктураПараметров.Субконто2, СтруктураПараметров.Субконто3);
//		КонецЕсли; 
//	КонецЦикла;	
//		
//КонецПроцедуры

//Процедура ПодготовитьТаблицуДокументаРасчетыВВалюте(ТаблицаСуммДокумента, Реквизиты) Экспорт

//	Если Реквизиты.ВалютаДокумента <> Реквизиты.ВалютаРеглУчета Тогда // Документ оформлен в валюте расчетов.
//		
//		ИтогСуммаРуб = ?(Реквизиты.КратностьВзаиморасчетов = 0, 0,
//			Окр(ТаблицаСуммДокумента.Итог("СуммаВзаиморасчетов") * Реквизиты.КурсВзаиморасчетов / Реквизиты.КратностьВзаиморасчетов, 2));
//		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
//			ИтогСуммаРуб, ТаблицаСуммДокумента, "СуммаРуб", "СуммаВзаиморасчетов");
//		
//		Если ТаблицаСуммДокумента.Колонки.Найти("СуммаНДСРуб") <> Неопределено Тогда
//			// Сумма НДС в рублях рассчитывается построчно исходя из общей рублевой суммы по этой строке и ставки НДС.
//			Для каждого СтрокаТаблицы Из ТаблицаСуммДокумента Цикл
//				ПроцентНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
//				СтрокаТаблицы.СуммаНДСРуб = Окр(СтрокаТаблицы.СуммаРуб * ПроцентНДС / (100 + ПроцентНДС), 2);
//			КонецЦикла;
//		КонецЕсли;
//		
//	Иначе // Договор в у.е., документ оформлен в рублях.
//		
//		Курс      = Реквизиты.КурсВзаиморасчетов;
//		Кратность = Реквизиты.КратностьВзаиморасчетов;
//		
//		Если Реквизиты.КурсВзаиморасчетов = 1 и Реквизиты.КратностьВзаиморасчетов = 1 Тогда
//			
//			КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаВзаиморасчетов, Реквизиты.Период);
//			
//			Курс      = КурсИКратность.Курс;
//			Кратность = КурсИКратность.Кратность
//			
//		КонецЕсли;
//		
//		ИтогСуммаВзаиморасчетов = ?(Курс = 0 ИЛИ Кратность = 0, 0,
//			Окр(ТаблицаСуммДокумента.Итог("СуммаРуб") / (Курс / Кратность), 2));
//		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
//			ИтогСуммаВзаиморасчетов, ТаблицаСуммДокумента, "СуммаВзаиморасчетов", "СуммаРуб");
//		
//		Если ТаблицаСуммДокумента.Колонки.Найти("СуммаНДСВзаиморасчетов") <> Неопределено 
//			И ТаблицаСуммДокумента.Колонки.Найти("СуммаНДСРуб") <> Неопределено Тогда
//			// Сумма НДС в валюте рассчитывается в целом по документу и распределяется по строкам.
//			ИтогСуммаНДСВзаиморасчетов = ?(Курс = 0 ИЛИ Кратность = 0, 0,
//				Окр(ТаблицаСуммДокумента.Итог("СуммаНДСРуб") / (Курс / Кратность), 2));
//			ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
//				ИтогСуммаНДСВзаиморасчетов, ТаблицаСуммДокумента, "СуммаНДСВзаиморасчетов", "СуммаНДСРуб");
//		КонецЕсли;
//			
//	КонецЕсли;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ВспомогательныеФункцииИПроцедуры

//Функция ВидыСубконтоРасчетов()

//	ВидыСубконтоРасчетов = Новый Массив;
//	ВидыСубконтоРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
//	ВидыСубконтоРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
//	ВидыСубконтоРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);

//	Возврат ВидыСубконтоРасчетов;

//КонецФункции

//Функция ВидыСубконтоКонтрагентыДоговоры()

//	ВидыСубконтоКонтрагентыДоговоры = Новый Массив;
//	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
//	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);

//	Возврат ВидыСубконтоКонтрагентыДоговоры;

//КонецФункции

//Функция РазличныеЗначенияКолонкиТаблицы(ТаблицаЗначений, ИмяКолонки)

//	ВсеЗначенияКолонки = ТаблицаЗначений.ВыгрузитьКолонку(ИмяКолонки);
//	РазличныеЗначения  = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(ВсеЗначенияКолонки);
//	Возврат РазличныеЗначения;

//КонецФункции

//// Возвращает договор контрагента, если организация, указанная в данном договоре, доступна пользователю.
////
//Функция ДоступныйДоговорКонтрагента(ДоговорСсылка) Экспорт

//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
//	|	ДоговорыКонтрагентов.Организация
//	|ИЗ
//	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	|ГДЕ
//	|	ДоговорыКонтрагентов.Ссылка = &ДоговорСсылка";

//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		ДоговорКонтрагента = Выборка.Договор;

//	Иначе
//		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
//	КонецЕсли;

//	Возврат ДоговорКонтрагента;

//КонецФункции // ДоступныйДоговорКонтрагента()

//// Формируются проводки погашения задолженности по расчетам с поставщиками и покупателями.
//// Вызывается при проведении документов движения денежных средств,.
//// А также других документов, погашающих задолженность.
////
//// Параметры:
////  ТаблицаВзаиморасчетов - <ТаблицаЗначений> - таблица с данными.
////  По погашению задолженности в разрезе документов расчетов.
////                          Создается функцией ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности.
////                          Используются колонки, описанные в функции ПодготовитьПараметрыПогашениеЗадолженности.
////  ТаблицаРеквизиты      - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
////                          Структура таблицы описана в функции ПодготовитьПараметрыПогашениеЗадолженности.
////  Движения              - коллекция движений документа.
////  Отказ                 - <Булево> - флаг отказа от проведения.
////
//Процедура СформироватьДвиженияВзаимозачет(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт

//	Параметры = ПодготовитьПараметрыВзаимозачета(ТаблицаВзаиморасчетов, ТаблицаРеквизиты);

//	Если Параметры.Взаиморасчеты.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;

//	Реквизиты = Параметры.Реквизиты[0];

//	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);

//	ДтКтРасчетов = ?(Реквизиты.НаправлениеДвижения = "Поступление", "Кт", "Дт");
//	ДтКтКорСчета = ?(ДтКтРасчетов = "Кт", "Дт", "Кт");

//	Для каждого СтрокаВзаиморасчетов из Параметры.Взаиморасчеты Цикл

//		// Основная проводка по счету расчетов.

//		Проводка = Движения.Хозрасчетный.Добавить();

//		Проводка.Период       = Реквизиты.Период;
//		Проводка.Организация  = Реквизиты.Организация;
//		Проводка.Содержание   = СтрокаВзаиморасчетов.Содержание;

//		Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ;

//		Проводка["Счет" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СчетРасчетов;

//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],
//			"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);

//		СвойстваСчетаРасчетов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//		Если СвойстваСчетаРасчетов.Валютный Тогда
//			Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//			Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//		КонецЕсли;

//		Проводка["Счет" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорСчет;

//		Для Ном = 1 по 3 Цикл
//			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтКорСчета], Проводка["Субконто" + ДтКтКорСчета],
//				Ном, СтрокаВзаиморасчетов["КорСубконто" + Ном]);
//		КонецЦикла;

//		СвойстваКорСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтКорСчета]);
//		Если СвойстваКорСчета.Валютный Тогда
//			Проводка["Валюта" + ДтКтКорСчета]        = СтрокаВзаиморасчетов.КорВалютаВзаиморасчетов;
//			Проводка["ВалютнаяСумма" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорСуммаВзаиморасчетов;
//		КонецЕсли;
//		Если СвойстваКорСчета.УчетПоПодразделениям Тогда
//			Проводка["Подразделение" + ДтКтКорСчета] = СтрокаВзаиморасчетов.КорПодразделение;
//		КонецЕсли;

//		Если ОтражатьВНалоговомУчете Тогда
//			СуммаНУ = СтрокаВзаиморасчетов.СуммаНУ;
//			Если СвойстваСчетаРасчетов.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтРасчетов] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтРасчетов] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтРасчетов] = 0;
//			КонецЕсли;
//			Если СвойстваКорСчета.НалоговыйУчет Тогда
//				Проводка["СуммаНУ" + ДтКтКорСчета] = СуммаНУ;
//				Проводка["СуммаПР" + ДтКтКорСчета] = Проводка.Сумма - СуммаНУ;
//				Проводка["СуммаВР" + ДтКтКорСчета] = 0;
//			КонецЕсли;
//		КонецЕсли;

//		// Проводки по вспомогательным счетам задолженности УСН.
//		Если Реквизиты.УчитыватьЗадолженностьУСН
//			ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда
//			
//			// Проводка Дт УСН.01 (УСН.21) - если ДтКтРасчетов = "Дт".
//			// Или Кт УСН.01 (УСН.21)  - если ДтКтРасчетов = "Кт".
//			Если Реквизиты.УчитыватьЗадолженностьУСН
//				И СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД <> 0 Тогда
//				
//				Проводка = Движения.Хозрасчетный.Добавить();
//				
//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = "Расчеты по деятельности ЕНВД";
//				
//				Если СвойстваСчетаРасчетов.Валютный Тогда
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД;
//				Иначе
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД;
//				КонецЕсли;
//				
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],"Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],"Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов],"ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);
//				
//				СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//				Если СвойстваСчетаУСН.Валютный Тогда
//					Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД;
//				КонецЕсли;
//				Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;
//				
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_ЕНВД;
//				
//			КонецЕсли;
//			
//			// Проводка Дт УСН.02 (УСН.22) - если ДтКтРасчетов = "Дт".
//			// Или Кт УСН.02 (УСН.22)  - если ДтКтРасчетов = "Кт".
//			Если Реквизиты.УчитыватьЗадолженностьУСН
//				И СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента <> 0 Тогда
//				
//				Проводка = Движения.Хозрасчетный.Добавить();
//				
//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = "Расчеты за товары и услуги комитента";
//				
//				Если СвойстваСчетаРасчетов.Валютный Тогда
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент;
//				Иначе
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент;
//				КонецЕсли;
//				
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);
//				
//				СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//				Если СвойстваСчетаУСН.Валютный Тогда
//					Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента;
//				КонецЕсли;
//				Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;
//				
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Комитента;
//				
//			КонецЕсли;
//			
//			Если Реквизиты.УчитыватьЗадолженностьУСНПатент И СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент <> 0 Тогда
//				
//				Проводка = Движения.Хозрасчетный.Добавить();
//				
//				Проводка.Период       = Реквизиты.Период;
//				Проводка.Организация  = Реквизиты.Организация;
//				Проводка.Содержание   = ?(Реквизиты.Период < УчетУСН.ДатаНачалаДействияПатентнойСистемы(),
//					НСтр("ru = 'Расчеты по деятельности УСН на патенте'"),
//					НСтр("ru = 'Расчеты по деятельности на патенте'"));
//				
//				Если СвойстваСчетаРасчетов.Валютный Тогда
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент;
//				Иначе
//					Проводка["Счет" + ДтКтРасчетов] = ПланыСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент;
//				КонецЕсли;
//				
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Контрагенты", СтрокаВзаиморасчетов.Контрагент);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "Договоры", СтрокаВзаиморасчетов.ДоговорКонтрагента);
//				БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + ДтКтРасчетов], Проводка["Субконто" + ДтКтРасчетов], "ДокументыРасчетовСКонтрагентами", СтрокаВзаиморасчетов.ДокументРасчетов);
//				
//				СвойстваСчетаУСН = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКтРасчетов]);
//				Если СвойстваСчетаУСН.Валютный Тогда
//					Проводка["Валюта" + ДтКтРасчетов]        = СтрокаВзаиморасчетов.ВалютаВзаиморасчетов;
//					Проводка["ВалютнаяСумма" + ДтКтРасчетов] = СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент;
//				КонецЕсли;
//				Если СвойстваСчетаУСН.УчетПоПодразделениям Тогда
//					Проводка["Подразделение" + ДтКтРасчетов] = СтрокаВзаиморасчетов.Подразделение;
//				КонецЕсли;
//				
//				Проводка.Сумма = СтрокаВзаиморасчетов.СуммаБУ_Патент;
//				
//			КонецЕсли;
//			
//		КонецЕсли;

//	КонецЦикла;

//	Движения.Хозрасчетный.Записывать = Истина;

//КонецПроцедуры

//Функция ПодготовитьПараметрыВзаимозачета(ТаблицаВзаиморасчетов, ТаблицаРеквизиты)

//	Параметры = Новый Структура;

//	// Подготовка таблицы Параметры.Реквизиты.

//	СписокОбязательныхКолонок = ""
//	+ "Период,"                    // <Дата> - период движений - дата документа.
//	+ "Регистратор,"               // <ДокументСсылка>.
//	+ "Организация,"               // <СправочникСсылка.Организации>.
//	+ "ВалютаДокумента,"           // <СправочникСсылка.Валюты>.
//	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН.
//	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент.
//	+ "НаправлениеДвижения";       // <Строка> - "Поступление" при погашении дебиторской задолженности (поступлении денежных средств).
//	                               //          - "Выбытие" при погашении кредиторской задолженности (выбытии денежных средств).

//	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаРеквизиты, СписокОбязательныхКолонок));

//	// Подготовка таблицы Параметры.Взаиморасчеты

//	СписокОбязательныхКолонок = ""
//	+ "Подразделение,"                 // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается.
//	+ "Контрагент,"                    // <СправочникСсылка.Контрагенты> - контрагент, задолженность по которому погашается.
//	+ "ДоговорКонтрагента,"            // <СправочникСсылка.ДоговорыКонтрагентов> - договор, задолженность по которому погашается.
//	+ "ДокументРасчетов,"              // <ДокументСсылка> - документ расчетов, задолженность по которому погашается.
//	+ "ВалютаВзаиморасчетов,"          // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "КорВалютаВзаиморасчетов,"       // <СправочникСсылка.Валюты> - валюта расчетов по договору.
//	+ "СчетРасчетов,"                  // <ПланСчетовСсылка.Хозрасчетный> - счет расчетов, задолженность по которому погашается.
//	+ "КорСчет,"                       // <ПланСчетовСсылка.Хозрасчетный> - счет, корреспондирующий со счетом расчетов.
//	+ "КорСубконто1,"                  // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто2,"                  // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорСубконто3,"                  // <Характеристика.ВидыСубконтоХозрасчетные>.
//	+ "КорПодразделение,"              // <Ссылка на справочник подразделений> - подразделение по корсчету.
//	+ "СуммаВзаиморасчетов,"           // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "КорСуммаВзаиморасчетов,"        // <Число,15,2> - сумма в валюте взаиморасчетов.
//	+ "СуммаБУ,"                       // <Число,15,2> - сумма в рублях в оценке для бух.учета.
//	+ "СуммаНУ,"                       // <Число,15,2> - сумма в рублях в оценке для налогового учета.
//	+ "СуммаВзаиморасчетовЕНВД,"       // <Число,15,2> - сумма по деятельности ЕНВД в валюте взаиморасчетов.
//	+ "СуммаБУ_ЕНВД,"                  // <Число,15,2> - сумма по деятельности ЕНВД в рублях.
//	+ "СуммаВзаиморасчетовПатент,"     // <Число,15,2> - сумма по деятельности на патенте в валюте взаиморасчетов.
//	+ "СуммаБУ_Патент,"                // <Число,15,2> - сумма по деятельности на патенте в рублях.
//	+ "СуммаВзаиморасчетовКомитента,"  // <Число,15,2> - сумма за товары и услуги комитентов в валюте взаиморасчетов.
//	+ "СуммаБУ_Комитента,"
//	+ "Содержание";                    // <Строка,150>.

//	Параметры.Вставить("Взаиморасчеты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
//		ТаблицаВзаиморасчетов, СписокОбязательныхКолонок));

//	Возврат Параметры;

//КонецФункции

//Функция ПустаяТаблицаВзаимозачет()

//	ПустаяТаблица = Новый ТаблицаЗначений();

//	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",             Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("ВалютаВзаиморасчетов",     Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	ПустаяТаблица.Колонки.Добавить("КорВалютаВзаиморасчетов",  Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//	
//	ПустаяТаблица.Колонки.Добавить("Подразделение",          БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ПустаяТаблица.Колонки.Добавить("Контрагент",             Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
//	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента",     БухгалтерскийУчетКлиентСерверПереопределяемый.ПолучитьОписаниеТиповДоговора());
//	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",       Документы.ТипВсеСсылки());
//	ПустаяТаблица.Колонки.Добавить("ДатаДокументаРасчетов",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
//	ПустаяТаблица.Колонки.Добавить("ОстатокВзаиморасчетов",  ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов",    ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("КорСуммаВзаиморасчетов", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ",                ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаРуб",               ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СуммаНУ",                ОбщегоНазначения.ОписаниеТипаЧисло(15,2));

//	ПустаяТаблица.Колонки.Добавить("РасчетыВУсловныхЕдиницах", Новый ОписаниеТипов("Булево"));
//	ПустаяТаблица.Колонки.Добавить("Разница",                  ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
//	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",                Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
//	ПустаяТаблица.Колонки.Добавить("КорСчет",                 Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
//	ПустаяТаблица.Колонки.Добавить("КорПодразделение",        БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
//	ОписаниеТипаСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Тип;
//	Для Ном = 1 По 3 Цикл
//		ПустаяТаблица.Колонки.Добавить("КорСубконто" + Ном, ОписаниеТипаСубконто);
//	КонецЦикла;

//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовЕНВД",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_ЕНВД",                 ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовПатент",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_Патент",                 ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовКомитента", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("СуммаБУ_Комитента",            ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ПустаяТаблица.Колонки.Добавить("Содержание",                   ОбщегоНазначения.ОписаниеТипаСтрока(150));

//	Возврат ПустаяТаблица;

//КонецФункции

//#КонецОбласти