
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_ДанныеГорГаза.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.лб_ДанныеГорГаза КАК лб_ДанныеГорГаза
	               |ГДЕ
	               |	лб_ДанныеГорГаза.Дата МЕЖДУ &ДатаН И &ДатаК
	               |	И НЕ лб_ДанныеГорГаза.ПометкаУдаления
	               |	И лб_ДанныеГорГаза.Организация = &Организация
	               |	И лб_ДанныеГорГаза.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаК", КонецДня(КонецМесяца(Дата)));
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(НачалоМесяца(Дата)));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'За указанный период уже имееться документ!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры
