
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Дата") Тогда
		
	    мТаблицаФизЛицДолей.Параметры.УстановитьЗначениеПараметра("Момент",      Параметры.Дата);
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЛицевойСчет") Тогда

	    мТаблицаФизЛицДолей.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Параметры.ЛицевойСчет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:58:53 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:58:53 Конец правки.

	
	МассивФизЛиц = Новый Массив;
	
	Для каждого СтрМас из Элементы.мТаблицаФизЛицДолей.ВыделенныеСтроки Цикл
		
		МассивФизЛиц.Добавить(Элементы.мТаблицаФизЛицДолей.ДанныеСтроки(СтрМас).ФизЛицо);
		
	КонецЦикла;	
	
	АдресФизЛицВХранилище = ПоместитьВоВременноеХранилище(МассивФизЛиц, УникальныйИдентификатор);
	
	Структура = Новый Структура("АдресФизЛицВХранилище", АдресФизЛицВХранилище);
	
	ОповеститьОВыборе(Структура);

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
