#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбщегоНазначения

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(Отказ)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "КодКассы";
	ОбязательныеРеквизитыШапки = "ПодразделениеОрганизации";
	ОбязательныеРеквизитыШапки = "Контрагент";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""Кассы ККМ"".");
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура выполняет проверку уникальности кода
//
Процедура ПроверитьУникальностьКода(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_КассыККМ.Ссылка,
	|	бит_КассыККМ.КодКассы
	|ИЗ
	|	Справочник.бит_КассыККМ КАК бит_КассыККМ
	|ГДЕ
	|	(НЕ бит_КассыККМ.Ссылка = &Ссылка)
	|	И бит_КассыККМ.КодКассы = &КодКассы";
	
	Запрос.УстановитьПараметр("Ссылка"   , Ссылка);
	Запрос.УстановитьПараметр("КодКассы" , КодКассы); 
		
	Если НЕ Запрос.Выполнить().Пустой() Тогда
	
		Отказ = Истина;
		
		// БИТ_ЖКХ 02.03.2015{{
		// Сообщить("Код кассы не уникален. Пожалуйста введите друкой код кассы.", СтатусСообщения.ОченьВажное); 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Код кассы не уникален. Пожалуйста введите друкой код кассы.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 02.03.2015}}
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗакрытием" формы
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(Отказ);
	
	Если НЕ Отказ Тогда
		ПроверитьУникальностьКода(Отказ);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли