
#Область ПроцедурыИФункцииУправленияВнешнимВидомФорм

// Процедура управляет свойствами элементов формы.
//
&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ВидСравненияСтатусКвартиры.Доступность  = ИспользоватьОтборСтатусКвартиры;
	Элементы.ВидСравненияТипКвартиры.Доступность     = ИспользоватьОтборТипКвартиры;
	
	Элементы.СтатусКвартиры.Доступность = ИспользоватьОтборСтатусКвартиры;
	Элементы.ТипКвартиры.Доступность    = ИспользоватьОтборТипКвартиры;
	
	Элементы.НачальныйНомер.Доступность = Объект.Нумерация = "ПоПорядку"; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
	Объект.ДатаУстановкиСчетчиков = ТекущаяДата();
	
	Объект.Нумерация            = "ПоПорядку"; 
	Объект.ТипСчетчика          = Перечисления.бит_ТипСчетчика.Индивидуальный;
	Объект.КоэффициентУмножения = 1;
	
	МассивВидыСравнений = Новый Массив;
	МассивВидыСравнений.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	МассивВидыСравнений.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	МассивВидыСравнений.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	МассивВидыСравнений.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Для каждого ЭлементМассива Из МассивВидыСравнений Цикл
		
		Элементы.ВидСравненияСтатусКвартиры.СписокВыбора.Добавить(ЭлементМассива);
		Элементы.ВидСравненияТипКвартиры.СписокВыбора.Добавить(ЭлементМассива);
		Элементы.ВидСравненияВидСчетчика.СписокВыбора.Добавить(ЭлементМассива);
		Элементы.ВидСравненияЛицевыеСчета.СписокВыбора.Добавить(ЭлементМассива);
		Элементы.ВидСравненияСписокЗданий.СписокВыбора.Добавить(ЭлементМассива);
		
	КонецЦикла; 
	
	ВидСравненияВидСчетчика    = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияЛицевыеСчета   = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияСписокЗданий   = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияТипКвартиры    = ВидСравненияКомпоновкиДанных.Равно;
	
	Заголовок = Элементы.ЗаведениеИУстановкаСчетчиков.Заголовок;
	
	Элементы.ДеревоСчетчиковГруппаУстановкаСЧ.Видимость = Ложь;
	
	УправлениеЭлементамиФормы();
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
КонецПроцедуры

// БИТ_ЖКХ 04.02.2015{{
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если ИнтерфейсТакси Тогда
		
		Элементы.ДеревоСчетчиков.Высота = 10;
		Элементы.ДеревоСчетчиков.РастягиватьПоВертикали = Ложь; 
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 04.02.2015}}

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

#Область СтраницаЗаведениеИУстановкаСчетчиков

// Процедура - обработчик события "ПриИзменении" поля ввода "УлицаЛицевогоСчета".
//
&НаКлиенте
Процедура УлицаЛицевогоСчетаПриИзменении(Элемент)
	
	Объект.Здание               = Неопределено;
	Корпус                      = "";
	
	ДеревоСчетчиков.ПолучитьЭлементы().Очистить();
	Объект.Услуги.Очистить();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Здание".
//
&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)

	Корпус  =   ПолучитьКорпусНаСервере(Объект.Здание);
	ДеревоСчетчиков.ПолучитьЭлементы().Очистить();
	
	Объект.Услуги.Очистить();
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьКорпусНаСервере(Здание)
	
	Возврат Здание.Корпус;
	
КонецФункции	

// Процедура - обработчик события "НачалоВыбора" поля ввода "Здание".
//
&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Улица", Объект.УлицаЛицевогоСчета);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Нумерация".
//
&НаКлиенте
Процедура НумерацияПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
	Если НЕ Объект.Нумерация = "ПоПорядку" Тогда
		
		Объект.НачальныйНомер = 0;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода "Разрядность".
//
&НаКлиенте
Процедура РазрядностьОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ПравильныйКод = КодСимвола("9");
	
	СтрокаМаксЗначения = бит_ОбщегоНазначения.УбитьЛишнее(Текст);
	
	Длина = СтрДлина(СтрокаМаксЗначения);
	Для Значение=1 По Длина Цикл
		КодЦифры = КодСимвола(СтрокаМаксЗначения,Значение);
		Если НЕ КодЦифры = ПравильныйКод Тогда
			Объект.Разрядность = 0;

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Введены некорректные данные. ""Максимальное значение"" может содержать только цифру ""9""!");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтраницаИзменениеСоставаУслугПоСчетчикам

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик");
	КонецЕсли; 
	
	ВыполнитьПроверкуПоСпискуСчетчиков();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.УдалитьУслугиСоСчетчика"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияВидСчетчикаПриИзменении(Элемент)
	
	Если ВидСравненияВидСчетчика = Неопределено Тогда
		
		ВидСравненияВидСчетчика = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыСчетчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияВидСчетчика = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияВидСчетчика = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_ВидыСчетчиков.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыСчетчикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияСписокЗданийПриИзменении(Элемент)
	
	Если ВидСравненияСписокЗданий = Неопределено Тогда
		
		ВидСравненияСписокЗданий = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияСписокЗданий = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияСписокЗданий = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияЛицевыеСчетаПриИзменении(Элемент)
	
	Если ВидСравненияЛицевыеСчета = Неопределено Тогда
		
		ВидСравненияЛицевыеСчета = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияЛицевыеСчета = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияЛицевыеСчета = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДействияКомандФормы

#Область СтраницаМенюКоманды

&НаКлиенте
Процедура ЗаведениеИУстановкаСчетчиков(Команда)
	
	ПриВыбореПунктаМеню(Элементы.ЗаведениеИУстановкаСчетчиков);
	
	Элементы.ЗаведениеИУстановкаСчетчиков.Пометка     = Истина;
	Элементы.ИзменениеСоставаУслугПоСчетчикам.Пометка = Ложь;
	Элементы.СнятиеСчетчиков.Пометка                  = Ложь;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗаведениеИУстановкаСчетчиков;
	Элементы.Страницы.ТекущаяСтраница      = Элементы.ГруппаЛицевыеСчета;
	
	Элементы.ДеревоСчетчиковГруппаСозданиеСЧ.Видимость  = Истина;
	Элементы.ДеревоСчетчиковГруппаУстановкаСЧ.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСоставаУслугПоСчетчикам(Команда)
	
	ПриВыбореПунктаМеню(Элементы.ИзменениеСоставаУслугПоСчетчикам);
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаИзменениеСоставаУслугПоСчетчикам;
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик");
	Элементы.ГруппаСписокУслуг.Видимость = Истина;
	Элементы.ВидОперации.Доступность     = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСчетчиков(Команда)
	
	ПриВыбореПунктаМеню(Элементы.СнятиеСчетчиков);
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаИзменениеСоставаУслугПоСчетчикам;
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика");
	Элементы.ГруппаСписокУслуг.Видимость = Ложь;
	Элементы.ВидОперации.Доступность     = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СтраницаИзменениеСоставаУслугПоСчетчикамКоманды

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	ВыполнитьОперациюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетчиковУстановитьФлажки(Команда)
	
	Для каждого СтрокаТабилицы Из ТаблицаСчетчиков Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабилицы.Документ) Тогда
			СтрокаТабилицы.Обрабатывать = НЕ СтрокаТабилицы.ЕстьОшибка;
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборУслуг(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФормуВыбораУслуг(ЭтаФорма,ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСчетчиков(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборВидСчетчика = Новый Структура;
	ОтборВидСчетчика.Вставить("ИмяПоля"       , "ВидСчетчика");
	ОтборВидСчетчика.Вставить("ПравоеЗначение", ВидыСчетчика);
	ОтборВидСчетчика.Вставить("Использование" , ИспользоватьОтборВидСчетчика);
	ОтборВидСчетчика.Вставить("ВидСравнения"  , ВидСравненияВидСчетчика);
	
	ДополнительныеОтборы = Новый Структура;
	ДополнительныеОтборы.Вставить("ОтборВидСчетчика", ОтборВидСчетчика);
	
	ПараметрыФормыВыбора = Новый Структура;
	
	ПараметрыФормыВыбора.Вставить("Дата"                , КонецДня(ТекущаяДата()));
	ПараметрыФормыВыбора.Вставить("Установлен"          , Истина);
	ПараметрыФормыВыбора.Вставить("ТипСчетчика"         , ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Индивидуальный"));
	ПараметрыФормыВыбора.Вставить("РежимВыбора"         , Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор"  , Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"  , Ложь);
	ПараметрыФормыВыбора.Вставить("ДополнительныеОтборы", ДополнительныеОтборы);
	
	Если ИспользоватьОтборЛицевойСчет Тогда
		
		Если ТипЗнч(ЛицевыеСчета) = Тип("СписокЗначений") Тогда
			СписокОбъектовУчета = ЛицевыеСчета;
		Иначе
			СписокОбъектовУчета = Новый СписокЗначений;
			СписокОбъектовУчета.Добавить(ЛицевыеСчета);
		КонецЕсли;
		
		ПараметрыФормыВыбора.Вставить("СписокОбъектовУчета", СписокОбъектовУчета);
		
	ИначеЕсли ИспользоватьОтборСписокЗданий Тогда
		
		Если ТипЗнч(СписокЗданий) = Тип("СписокЗначений") Тогда
			СписокОбъектовУчета = СписокЗданий;
		Иначе
			СписокОбъектовУчета = Новый СписокЗначений;
			СписокОбъектовУчета.Добавить(СписокЗданий);
		КонецЕсли;
		
		ПараметрыФормыВыбора.Вставить("СписокОбъектовУчета", СписокОбъектовУчета);
		ПараметрыФормыВыбора.Вставить("ЭтоСписокЗданий"    , Истина);
		
	КонецЕсли;
	
	Если НЕ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика") Тогда
		ПараметрыФормыВыбора.Вставить("Многотарифный", Ложь);
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_Счетчики.Форма.ФормаВыбораСчетчиков", ПараметрыФормыВыбора, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СтраницаЗаведениеИУстановкаСчетчиковКоманды

// Процедура - действие команды "Вернуться".
//
&НаКлиенте
Процедура СоздатьНовыеСчетчики(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЛицевыеСчета;
	
	Элементы.ДеревоСчетчиковГруппаСозданиеСЧ.Видимость  = Истина;
	Элементы.ДеревоСчетчиковГруппаУстановкаСЧ.Видимость = Ложь;
	
	Объект.Услуги.Очистить();
	ДеревоСчетчиков.ПолучитьЭлементы().Очистить();
	
	Объект.ВидСчетчика            = Неопределено;
	Объект.УлицаЛицевогоСчета     = Неопределено;
	Объект.Здание                 = Неопределено;
	Объект.Разрядность            = 0;
	Объект.ДатаУстановкиСчетчиков = ТекущаяДата();
	Корпус                        = 0;
	Объект.Нумерация              = "ПоПорядку";
	Объект.Префикс                = "";
	Объект.Постфикс               = "";
	Объект.НачальныйНомер         = "";
	
	ИспользоватьОтборСтатусКвартиры = Ложь;
	ИспользоватьОтборТипКвартиры    = Ложь;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ИспользоватьОтборТипКвартиры;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = ИспользоватьОтборСтатусКвартиры;
	
	ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияТипКвартиры    = ВидСравненияКомпоновкиДанных.Равно;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ВидСравнения   = ВидСравненияТипКвартиры;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения   = ВидСравненияСтатусКвартиры;
	
	ТипКвартиры    = Неопределено;
	СтатусКвартиры = Неопределено;
	
	ПоместитьЗначениеВОтборКомпановщика(ТипКвартиры   , 0);
	ПоместитьЗначениеВОтборКомпановщика(СтатусКвартиры, 1);
	
КонецПроцедуры

// Процедура - действие команды "ЗаполнитьОбновитьСписокЛС".
//
&НаКлиенте
Процедура ЗаполнитьОбновитьСписокЛС(Команда)
	
	ОбновитьСписокЛС();
	
КонецПроцедуры

// Процедура - действие команды "СоздатьНаименования".
//
&НаКлиенте
Процедура СоздатьНаименования(Команда)
	
	СформироватьНаименования();
	
КонецПроцедуры

// Процедура - действие команды "ОчиститьНаименования".
//
&НаКлиенте
Процедура ОчиститьНаименования(Команда)
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		СтрокаТаблицы.НаименованиеСчетчика = "";
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура - действие команды "СоздатьСчетчики".
//
&НаКлиенте
Процедура СоздатьСчетчики(Команда)
	
	СформироватьСчетчики();
	
КонецПроцедуры

// Процедура - действие команды "УстановитьСчетчики".
//
&НаКлиенте
Процедура УстановитьСчетчики(Команда)
	
	Ответ = Неопределено;
	
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьСчетчикиЗавершение", ЭтотОбъект), "Будет выполнена установка счетчиков, проверьте заполнение показаний счетчиков в таблице. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетчикиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		СоздатьДокументы();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - действие команды "УстановитьФлажки".
//
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		СтрокаТаблицы.Обрабатывать = Истина;
		
		Ветка = СтрокаТаблицы.ПолучитьЭлементы();
		
		Для каждого Строка Из Ветка Цикл
			
			Строка.Обрабатывать = Истина;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура - действие команды "СнятьФлажки".
//
&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		СтрокаТаблицы.Обрабатывать = Ложь;
		
		Ветка = СтрокаТаблицы.ПолучитьЭлементы();
		
		Для каждого Строка Из Ветка Цикл
			
			Строка.Обрабатывать = Ложь;
			
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура - действие команды "ВыполнитьПроверку".
//
&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	
	ПроверкаУслугПоЛС();
	
КонецПроцедуры

// Процедура - действие команды "Многотарифные".
//
&НаКлиенте
Процедура Многотарифные(Команда)
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Для каждого СтрокаДерева Из Корень Цикл
		
		Если НЕ СтрокаДерева.Обрабатывать Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаДерева.Многотарифный      = Истина;
		СтрокаДерева.НачальныеПоказания = 0;
		СтрокаДерева.КонечныеПоказания  = 0;
		
		Веткка =  СтрокаДерева.ПолучитьЭлементы();
		Веткка.Очистить();
		
		Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
			
			НоваяСТрока = Веткка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСТрока, СтрокаДерева);
			НоваяСТрока.Услуга = СтрокаТаблицы.Услуга;
			
		КонецЦикла; 
		
		Элементы.ДеревоСчетчиков.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура - действие команды "СнятьМноготарфные".
//
&НаКлиенте
Процедура СнятьМноготарфные(Команда)
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Для каждого СтрокаДерева Из Корень Цикл
		
		Если НЕ СтрокаДерева.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДерева.Многотарифный = Ложь;
		
		Веткка =  СтрокаДерева.ПолучитьЭлементы();
		
		Веткка.Очистить();
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляУслуги

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля "Услуги".
//
&НаКлиенте
Процедура УслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Услуга" табличного поля "Услуги".
//
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	ПроверкаУслугПоЛС();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "Услуга" табличного поля "Услуги".
//
&НаКлиенте
Процедура УслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокУслуг = СформироватьСписокУслуг();
	
	Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
		
		Поиск = СписокУслуг.НайтиПоЗначению(СтрокаТаблицы.Услуга) ;
		Если НЕ Поиск = Неопределено Тогда
			
			СписокУслуг.Удалить(Поиск);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",,Элемент);
	
	ОтборУслуг = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУслуг.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборУслуг.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборУслуг.ПравоеЗначение = СписокУслуг;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "Услуга" табличного поля " Услуги".
//
&НаКлиенте
Процедура УслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.Услуга = ВыбранноеЗначение Тогда
		
		ИзменитьДобавитьСтрокуДерева(ТекущаяСтрока.Услуга, ВыбранноеЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляДеревоСчетчиков

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением" табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода "Счетчик"
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковСчетчикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.ДокументУстановкаСчетчика) Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "Счетчик" табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковСчетчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДокументУстановкаСчетчика) Тогда
			
			СписокСчетчиков = СформироватьСписокСчетчиков();
			
			Корень = ДеревоСчетчиков.ПолучитьЭлементы();
			
			Для каждого СтрокаДерева Из Корень Цикл
				
				Если НЕ СтрокаДерева.Счетчик.Пустая() Тогда
					
					СписокСчетчиков.Добавить(СтрокаДерева.Счетчик);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			ФормаВыбора = ПолучитьФорму("Справочник.бит_Счетчики.Форма.ФормаВыбораУправляемая",,Элемент);
			
			ОтборУслуг = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборУслуг.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
			ОтборУслуг.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			ОтборУслуг.ПравоеЗначение = СписокСчетчиков;
			
			ФормаВыбора.Открыть();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "Очистка" поля ввода "Счетчик" табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковСчетчикОчистка(Элемент, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.ДокументУстановкаСчетчика) Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода "ДокументУстановкаСчетчика".
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковДокументУстановкаСчетчикаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Процедура - обработчик события "Очистка" поля ввода "ДокументУстановкаСчетчика". 
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковДокументУстановкаСчетчикаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "ДокументУстановкаСчетчика".
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковДокументУстановкаСчетчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "НачальныеПоказания". 
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковНачальныеПоказанияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	ТекСтрокаСчетчикРазрядность = РазрядностьНаСервере(ТекСтрока.Счетчик);
	
	Если ТекСтрока.НачальныеПоказания > ТекСтрокаСчетчикРазрядность Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Начальные показания не могут быть больше максимального значения счетчика = " + ТекСтрокаСчетчикРазрядность);
		
		ТекСтрока.НачальныеПоказания = 0;
		Возврат;
		
	КонецЕсли;
	
	Если ТекСтрока.КонечныеПоказания = 0 Тогда
		ТекСтрока.КонечныеПоказания = ТекСтрока.НачальныеПоказания;
	КонецЕсли; 
	
КонецПроцедуры

// БИТ_ЖКХ 05.06.2014
&НаСервере
Функция РазрядностьНаСервере(Счетчик)
	
	Возврат Счетчик.Разрядность;
	
КонецФункции	
// БИТ_ЖКХ 05.06.2014

// Процедура - обработчик события "ПриИзменении" поля ввода "КонечныеПоказания". 
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковКонечныеПоказанияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	// БИТ_ЖКХ 04.02.2015{{
	Разрядность = РазрядностьНаСервере(ТекСтрока.Счетчик);
	// БИТ_ЖКХ 04.02.2015}}
	
	Если ТекСтрока.КонечныеПоказания > Разрядность Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Конечные показания не могут быть больше максимального значения счетчика = " + Разрядность);
		
		ТекСтрока.КонечныеПоказания = 0;
		Возврат;
		
	КонецЕсли;
	
	Если ТекСтрока.КонечныеПоказания < ТекСтрока.НачальныеПоказания Тогда
		
		Разность = Разрядность - ТекСтрока.НачальныеПоказания + 1 + ТекСтрока.КонечныеПоказания; 
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДеревоСчетчиковКонечныеПоказанияПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), "Произойдет переход через 0 на разность: " + Разность +". Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСчетчиковКонечныеПоказанияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ТекСтрока.КонечныеПоказания = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Многотарифный". 
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковМноготарифныйПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Строки = ТекущаяСтрока.ПолучитьЭлементы();
	
	Если ТекущаяСтрока.Многотарифный Тогда
		
		Строки.Очистить();
		
		ТекущаяСтрока.НачальныеПоказания = 0;
		ТекущаяСтрока.КонечныеПоказания  = 0;
		
		Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
			
			НоваяСТрока = Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСТрока, ТекущаяСтрока);
			НоваяСТрока.Услуга = СтрокаТаблицы.Услуга;
			
		КонецЦикла;
		
	Иначе
		
		Строки.Очистить();
		
	КонецЕсли; 
	
	Элементы.ДеревоСчетчиков.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Счетчик". 
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковСчетчикПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Дерево = ТекущаяСтрока.ПолучитьЭлементы();
	
	Для каждого СтрокаДерева Из Дерево Цикл
		
		СтрокаДерева.Счетчик = ТекущаяСтрока.Счетчик;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Обрабатывать". 
// Табличного поля "ДеревоСчетчиков".
//
&НаКлиенте
Процедура ДеревоСчетчиковОбрабатыватьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	Дерево = ТекущаяСтрока.ПолучитьЭлементы();
	
	Для каждого СтрокаДерева Из Дерево Цикл
		
		СтрокаДерева.Обрабатывать =  ТекущаяСтрока.Обрабатывать;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСписокУслуг

&НаКлиенте
Процедура СписокУслугПослеУдаления(Элемент)
	ВыполнитьПроверкуПоСпискуСчетчиков();
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отка = Копирование;
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугЗначениеПриИзменении(Элемент)
	
	ВыполнитьПроверкуПоСпискуСчетчиков();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораУслуг(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ СписокУслуг.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаСчетчиков

&НаКлиенте
Процедура ТаблицаСчетчиковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Копирование;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетчиковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ТаблицаСчетчиков.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока.Обрабатывать = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетчиковСчетчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВыбора = Новый Структура;
	
	ПараметрыФормыВыбора.Вставить("Дата"       , КонецДня(ТекущаяДата()));
	ПараметрыФормыВыбора.Вставить("Установлен" , Истина);
	ПараметрыФормыВыбора.Вставить("ТипСчетчика", ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Индивидуальный"));
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	
	ОтборВидСчетчика = Новый Структура;
	ОтборВидСчетчика.Вставить("ИмяПоля"       , "ВидСчетчика");
	ОтборВидСчетчика.Вставить("ПравоеЗначение", ВидыСчетчика);
	ОтборВидСчетчика.Вставить("Использование" , ИспользоватьОтборВидСчетчика);
	ОтборВидСчетчика.Вставить("ВидСравнения"  , ВидСравненияВидСчетчика);
	
	ДополнительныеОтборы = Новый Структура;
	ДополнительныеОтборы.Вставить("ОтборВидСчетчика", ОтборВидСчетчика);
	
	ПараметрыФормыВыбора.Вставить("ДополнительныеОтборы", ДополнительныеОтборы);
	
	Если ИспользоватьОтборЛицевойСчет Тогда
		
		Если ТипЗнч(ЛицевыеСчета) = Тип("СписокЗначений") Тогда
			СписокОбъектовУчета = ЛицевыеСчета;
		Иначе
			СписокОбъектовУчета = Новый СписокЗначений;
			СписокОбъектовУчета.Добавить(ЛицевыеСчета);
		КонецЕсли;
		
		ПараметрыФормыВыбора.Вставить("СписокОбъектовУчета", СписокОбъектовУчета);
		
	ИначеЕсли ИспользоватьОтборСписокЗданий Тогда
		
		Если ТипЗнч(СписокЗданий) = Тип("СписокЗначений") Тогда
			СписокОбъектовУчета = СписокЗданий;
		Иначе
			СписокОбъектовУчета = Новый СписокЗначений;
			СписокОбъектовУчета.Добавить(СписокЗданий);
		КонецЕсли;
		
		ПараметрыФормыВыбора.Вставить("СписокОбъектовУчета", СписокОбъектовУчета);
		ПараметрыФормыВыбора.Вставить("ЭтоСписокЗданий"    , Истина);
		
	КонецЕсли;
	
	Если НЕ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика") Тогда
		ПараметрыФормыВыбора.Вставить("Многотарифный", Ложь);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_Счетчики.Форма.ФормаВыбораСчетчиков", ПараметрыФормыВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетчиковСчетчикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ТаблицаСчетчиков.ТекущиеДанные;
	
	Результат = ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	Если НЕ Результат = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Результат);
		ТекущаяСтрока.Счетчик      = ВыбранноеЗначение;
		ТекущаяСтрока.Документ     = Неопределено;
		ТекущаяСтрока.Обрабатывать = НЕ Результат.ЕстьОшибка;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСчетчиковДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура выполняет заполнение дерева лицевыми счетами.
//
&НаСервере
Процедура ОбновитьСписокЛС()
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Корень.Очистить();
		
	СтруктураНастроек = Обработки.бит_ГрупповаяОбработкаСчетчиков.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЛицевойСчет");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Наименование");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Обрабатывать");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Квартира");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"  , КонецДня(ТекущаяДата()));
	СтруктураНастроек.ПараметрыДанных.Вставить("Здание", Объект.Здание);
	СтруктураНастроек.ПараметрыДанных.Вставить("Улица" , Объект.УлицаЛицевогоСчета);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "СписокЛицевыхСчетов";
	
	СтруктураРезультата = Обработки.бит_ГрупповаяОбработкаСчетчиков.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Корень.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура выполняет создание элементов справочника бит_Счетчики.
//
&НаСервере
Процедура СформироватьСчетчики()
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		Если СтрокаТаблицы.Обрабатывать и ЗначениеЗаполнено(СтрокаТаблицы.НаименованиеСчетчика) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Счетчик)Тогда
			
			НовыйСчетчик = Справочники.бит_Счетчики.СоздатьЭлемент();
			НовыйСчетчик.Наименование         = СтрокаТаблицы.НаименованиеСчетчика;
			НовыйСчетчик.ВидСчетчика          = Объект.ВидСчетчика;
			НовыйСчетчик.ТипСчетчика          = Объект.ТипСчетчика;
			НовыйСчетчик.Разрядность          = Объект.Разрядность;
			НовыйСчетчик.КоэффициентУмножения = Объект.КоэффициентУмножения;
			
			Если бит_ОбщегоНазначения.ЗаписатьСправочник(НовыйСчетчик, "Автоматическое создание счетчика: ","Ошибки") Тогда;
				
				СтрокаТаблицы.Счетчик = НовыйСчетчик.Ссылка;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Функция возвращает список услуг.
//
&НаСервере
Функция СформироватьСписокУслуг()
	
	Дата = ?(ЗначениеЗаполнено(Объект.ДатаУстановкиСчетчиков),Объект.ДатаУстановкиСчетчиков, ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"  , КонецДня(Дата));
	Запрос.УстановитьПараметр("Улица" , Объект.УлицаЛицевогоСчета);
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			&Дата,
	|			Услуга.СпособыРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|				И Улица = &Улица
	|				И Здание = &Здание) КАК бит_ШаблоныУслугСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ШаблоныУслугСрезПоследних.Услуга";
	
	СписокУслуг = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокУслуг.Добавить(Выборка.Услуга);
		
	КонецЦикла; 
	
	Возврат  СписокУслуг;
	
КонецФункции // ()

// Процедура выполняет проверку возмножности установки счетчика по Услуге.
//
&НаСервере
Процедура ПроверкаУслугПоЛС()
	
	ТаблицаЛС = Новый ТаблицаЗначений;
	ТаблицаЛС.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаЛС.Колонки.Добавить("Услуга"     , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицыУслуги Из Объект.Услуги Цикл
		
		Для каждого СтрокаТаблицы Из Корень Цикл
			
			НовСтрока = ТаблицаЛС.Добавить();
			
			НовСтрока.ЛицевойСчет = СтрокаТаблицы.ЛицевойСчет;
			НовСтрока.Услуга      = СтрокаТаблицыУслуги.Услуга;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Мвт;
	Запрос.УстановитьПараметр("Дата"        , КонецДня(?(ЗначениеЗаполнено(Объект.ДатаУстановкиСчетчиков), Объект.ДатаУстановкиСчетчиков, ТекущаяДата())));
	Запрос.УстановитьПараметр("ТаблицаЛС"   , ТаблицаЛС);
	Запрос.УстановитьПараметр("Здание"      , Объект.Здание);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.Услуга
	|ПОМЕСТИТЬ ОсновнойЛС
	|ИЗ
	|	&ТаблицаЛС КАК ТаблицаЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ПОМЕСТИТЬ ЛСсУслугами
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			Услуга В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Таб.Услуга КАК Услуга
	|				ИЗ
	|					ОсновнойЛС КАК Таб)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновнойЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ОсновнойЛС.Услуга,
	|	ЛСсУслугами.Услуга КАК НетУслуги
	|ИЗ
	|	ОсновнойЛС КАК ОсновнойЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛСсУслугами КАК ЛСсУслугами
	|		ПО ОсновнойЛС.ЛицевойСчет = ЛСсУслугами.ЛицевойСчет
	|			И ОсновнойЛС.Услуга = ЛСсУслугами.Услуга
	|ГДЕ
	|	ЛСсУслугами.Услуга ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК Счетчик,
	|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
	|	бит_ГрупповыеСчетчикиНаУслугахСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет.Здание = &Здание
	|				И Услуга В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Таб.Услуга
	|					ИЗ
	|						ОсновнойЛС КАК Таб)) КАК бит_ГрупповыеСчетчикиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|				&Дата,
	|				Объект = &Здание
	|					И ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	|					И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)
	|					И Услуга В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Таб.Услуга
	|						ИЗ
	|							ОсновнойЛС КАК Таб)) КАК бит_ГрупповыеСчетчикиНаУслугахСрезПоследних
	|		ПО бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик = бит_ГрупповыеСчетчикиНаУслугахСрезПоследних.Счетчик
	|			И бит_ГрупповыеСчетчикиСрезПоследних.Услуга = бит_ГрупповыеСчетчикиНаУслугахСрезПоследних.Услуга
	|			И бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание = бит_ГрупповыеСчетчикиНаУслугахСрезПоследних.Объект
	|ГДЕ
	|	бит_ГрупповыеСчетчикиНаУслугахСрезПоследних.Использовать
	|	И бит_ГрупповыеСчетчикиСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	|			&Дата,
	|			Объект = &Здание
	|				И Услуга В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Таб.Услуга
	|					ИЗ
	|						ОсновнойЛС КАК Таб)) КАК бит_РаспределенияНаУслугахСрезПоследних
	|ГДЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет";
	
	Результат = Запрос.ВыполнитьПакет();
	
	СписокЛС = Результат[0].Выгрузить();
	СписокСЧ = Результат[1].Выгрузить();
	СписокРП = Результат[2].Выгрузить();
	
	Отбор    = Новый Структура;
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		СтрокаТаблицы.Ошибка = "";
		
		Отбор.Очистить();
		
		Отбор.Вставить("ЛицевойСчет", СтрокаТаблицы.ЛицевойСчет);
		МассивСтрок = СписокЛС.НайтиСтроки(Отбор);
		
		Услуги = "";
		
		Для каждого СтрокаМассива Из МассивСтрок Цикл
			
			Услуги = Услуги +?(Услуги = ""," ",", ")+ СтрокаМассива.Услуга;
			
		КонецЦикла;
		
		Если НЕ Услуги = "" Тогда
			
			СтрокаТаблицы.Ошибка       = "На лицевом счете не установлены услуги :" + Услуги + ".";
			СтрокаТаблицы.Обрабатывать = Ложь;
			
		КонецЕсли;
		
		МассивСтрок = СписокСЧ.НайтиСтроки(Отбор);
		
		Услуги = "";
		
		Для каждого СтрокаМассива Из МассивСтрок Цикл
			
			Услуги = Услуги +?(Услуги = ""," ",", ")+ СтрокаМассива.Услуга;
			
		КонецЦикла;
		
		Если НЕ Услуги = "" Тогда
			
			СтрокаТаблицы.Обрабатывать = Ложь;
			СтрокаТаблицы.Ошибка       = СтрокаТаблицы.Ошибка + ?(СтрокаТаблицы.Ошибка = "","",",") + "На лицевом счете установлен груп. счетчик на услуги: "+Услуги+".";
			
		КонецЕсли; 
		
		МассивСтрок = СписокРП.НайтиСтроки(Отбор);
		
		Услуги = "";
		
		Для каждого СтрокаМассива Из МассивСтрок Цикл
			
			Услуги = Услуги +?(Услуги = ""," ",", ")+ СтрокаМассива.Услуга;
			
		КонецЦикла;
		
		Если НЕ Услуги = "" Тогда
			
			СтрокаТаблицы.Обрабатывать = Ложь;
			СтрокаТаблицы.Ошибка       = СтрокаТаблицы.Ошибка + ?(СтрокаТаблицы.Ошибка = "","",",") + "На лицевом счете установлено распределение на услуги: "+Услуги+".";
			
		КонецЕсли; 
		
	КонецЦикла;
	
	МВТ.Закрыть();
	
КонецПроцедуры

// Функция возвращает список счетчиков.
//
&НаСервере
Функция СформироватьСписокСчетчиков()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДата()));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик";
	
	СписокСЧ = Новый СписокЗначений;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокСЧ.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Счетчик"));
	
	Возврат  СписокСЧ;
	
КонецФункции // ()

// Процедура выполняет создание документов бит_УстановкаСчетчика.
//
&НаСервере
Процедура СоздатьДокументы()
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	Если Объект.Услуги.Количество() = 0 Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнена таблица услуг!");
		
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		Если СтрокаТаблицы.Обрабатывать И ЗначениеЗаполнено(СтрокаТаблицы.Счетчик) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументУстановкаСчетчика) Тогда
			
			НовыйДокумент = Документы.бит_УстановкаСчетчика.СоздатьДокумент();
			
			НовыйДокумент.ВидОперации        = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика;
			НовыйДокумент.Дата               = ?(ЗначениеЗаполнено(Объект.ДатаУстановкиСчетчиков),Объект.ДатаУстановкиСчетчиков,ТекущаяДата());
			НовыйДокумент.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
			
			НовыйДокумент.Объект                 = СтрокаТаблицы.ЛицевойСчет;
			НовыйДокумент.Организация            = СтрокаТаблицы.ЛицевойСчет.Организация;
			НовыйДокумент.Счетчик                = СтрокаТаблицы.Счетчик;
			НовыйДокумент.МестоУстановкиСчетчика = СтрокаТаблицы.МестоУстановкиСчетчика;
			НовыйДокумент.СпособРасчета          = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам;
			НовыйДокумент.Ответственный          = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
			НовыйДокумент.Комментарий            = "Документ создан автоматически из обработки ""Групповая обработка счетчиков"".";
			
			Если СтрокаТаблицы.Многотарифный Тогда
				
				Ветка = СтрокаТаблицы.ПолучитьЭлементы();
				
				Для каждого СтрокаДерева Из Ветка Цикл
					
					Если НЕ СтрокаДерева.Обрабатывать Тогда
						Продолжить;
					КонецЕсли; 
					
					НовСтрока = НовыйДокумент.Услуги.Добавить();
					НовСтрока.Услуга              = СтрокаДерева.Услуга;
					НовСтрока.СпособРаспределения = Перечисления.бит_СпособыРаспределения.НеИспользуется;
					НовСтрока.НачальныеПоказания  = СтрокаДерева.НачальныеПоказания;
					НовСтрока.КонечныеПоказания   = СтрокаДерева.КонечныеПоказания;
					
				КонецЦикла;
				
				Если НовыйДокумент.Услуги.Количество() = 1 Тогда
					
					НовыйДокумент.НачальныеПоказания = НовыйДокумент.Услуги[0].НачальныеПоказания;
					НовыйДокумент.КонечныеПоказания  = НовыйДокумент.Услуги[0].КонечныеПоказания;
					
					НовыйДокумент.Услуги[0].НачальныеПоказания = 0;
					НовыйДокумент.Услуги[0].КонечныеПоказания  = 0;
					
				Иначе
					
					НовыйДокумент.Многотарифный = Истина;
					
				КонецЕсли; 
				
			Иначе
				
				Для каждого СтрокаТаблицыУслги Из Объект.Услуги Цикл
					
					НовСтрока = НовыйДокумент.Услуги.Добавить();
					
					НовСтрока.Услуга              = СтрокаТаблицыУслги.Услуга;
					НовСтрока.СпособРаспределения = Перечисления.бит_СпособыРаспределения.НеИспользуется;
					
					
				КонецЦикла;
				
				НовыйДокумент.НачальныеПоказания = СтрокаТаблицы.НачальныеПоказания;
				НовыйДокумент.КонечныеПоказания  = СтрокаТаблицы.КонечныеПоказания;
				
			КонецЕсли; 
			
			Попытка
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаТаблицы.ДокументУстановкаСчетчика = НовыйДокумент.Ссылка;
				
				Если НЕ Ветка = Неопределено Тогда
					
					Для каждого СтрокаДерева Из Ветка Цикл
						
						СтрокаДерева.ДокументУстановкаСчетчика = НовыйДокумент.Ссылка;
						
					КонецЦикла;
					
				КонецЕсли; 
				
			Исключение

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
				
			КонецПопытки; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура сформировывает наименования счетчиков.
//
&НаСервере
Процедура СформироватьНаименования()
	
	Корень = ДеревоСчетчиков.ПолучитьЭлементы();
	
	ТекущийНомер = Объект.НачальныйНомер;
	ДлинаНомера  = 50;
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		Если СтрокаТаблицы.Обрабатывать Тогда
			
			Пока Истина Цикл
				
				Если Объект.Нумерация   = "ПоПорядку" Тогда
					ПеременнаяЧастьНомера = "" + Формат(ТекущийНомер, "ЧГ=0");
					ТекущийНомер  = ТекущийНомер + 1;
				ИначеЕсли Объект.Нумерация   = "Квартира"  Тогда
					ПеременнаяЧастьНомера = "" + СтрокаТаблицы.Квартира;
				ИначеЕсли Объект.Нумерация   = "ЛицевойСчет"  Тогда
					ПеременнаяЧастьНомера = "" + СтрокаТаблицы.ЛицевойСчет;
				КонецЕсли; 
				
				КандидатВНомера = Объект.Префикс + ПеременнаяЧастьНомера + Объект.Постфикс;
				НайденыйЛС      = Справочники.бит_Счетчики.НайтиПоНаименованию(КандидатВНомера, Истина);
				
				Если НайденыйЛС.Пустая() Тогда
					Прервать;
				Иначе
					
					Если Объект.Нумерация = "ПоПорядку" Тогда

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Номер "+КандидатВНомера+" пропущен, т.к. счетчик с таким номером уже есть");
						
					Иначе

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Номер "+КандидатВНомера+" не может быть использован т.к. счетчик с таким номером уже есть");
						
						КандидатВНомера = "";
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ СтрДлина(КандидатВНомера)>ДлинаНомера Тогда
				СтрокаТаблицы.НаименованиеСчетчика = КандидатВНомера;
			Иначе

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Внимание! Номер счетчика для лицевого счета "+СтрокаТаблицы.ЛицевойСчет+" превышает допустимые "+ДлинаНомера+" символов!");
				
			КонецЕсли;
			
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

// Процедура выполняет замену или добавление услуги для многотарифных счетчиков.
//
&НаСервере
Процедура ИзменитьДобавитьСтрокуДерева(ТекущаяУслуга, НоваяУсулга)
	
	Дерево = РеквизитФормыВЗначение("ДеревоСчетчиков");
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если СтрокаДерева.Обрабатывать И СтрокаДерева.Многотарифный Тогда
			
			СтрокаПоиска = СтрокаДерева.Строки.Найти(ТекущаяУслуга, "Услуга");
			
			Если СтрокаПоиска = Неопределено Тогда
				
				НоваяСтрока =  СтрокаДерева.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
				НоваяСтрока.Услуга = НоваяУсулга;
				
			Иначе
				
				СтрокаПоиска.Услуга             = НоваяУсулга;
				СтрокаПоиска.НачальныеПоказания = 0;
				СтрокаПоиска.КонечныеПоказания  = 0;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоСчетчиков");
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("НежилоеПомещение", Справочники.бит_ТипыКвартиры.НежилоеПомещение);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = Обработки.бит_ГрупповаяОбработкаСчетчиков.ПолучитьМакет("СписокЛицевыхСчетов");
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры // ЗагрузитьНастройкиОтбораПоУмолчанию()

&НаКлиенте
Процедура ПоместитьЗначениеВОтборКомпановщика(Значение, Индекс)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[Индекс].ПравоеЗначение = Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборТипКвартирыПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ИспользоватьОтборТипКвартиры;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборСтатусКвартирыПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = ИспользоватьОтборСтатусКвартиры;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияТипКвартирыПриИзменении(Элемент)
	
	Если ВидСравненияТипКвартиры = Неопределено Тогда
		
		ВидСравненияТипКвартиры = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияТипКвартиры = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияТипКвартиры = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(ТипКвартиры) = Тип("СписокЗначений") Тогда
		
		ТипКвартиры = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(ТипКвартиры, 0);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ВидСравнения   = ВидСравненияТипКвартиры;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияСтатусКвартирыПриИзменении(Элемент)
	
	Если ВидСравненияСтатусКвартиры = Неопределено Тогда
		
		ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(СтатусКвартиры) = Тип("СписокЗначений") Тогда
		
		СтатусКвартиры = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(СтатусКвартиры, 0);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения   = ВидСравненияСтатусКвартиры;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКвартирыПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(ТипКвартиры, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКвартирыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияТипКвартиры = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияТипКвартиры = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_ТипыКвартиры.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКвартирыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусКвартирыПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(СтатусКвартиры, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусКвартирыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СтатусыКвартиры.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусКвартирыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСчетчиковМестоУстановкиСчетчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ДеревоСчетчиков.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", ТекущаяСтрока.ЛицевойСчет.Квартира);
	
	ОткрытьФорму("Справочник.бит_Комнаты.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКУстановкеСчетчиков(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаУслуги;
	
	Элементы.ДеревоСчетчиковГруппаСозданиеСЧ.Видимость  = Ложь;
	Элементы.ДеревоСчетчиковГруппаУстановкаСЧ.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура открывает форму выбора услуг.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОткрытьФормуВыбораУслуг(ВладелецФормы, ПараметрыФормы = Неопределено)
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь; 
	
	тмпСписокУслуг = ПолучитьСписокУслуг();
	
	Для каждого ЭлементСписка Из СписокУслуг Цикл
		
		Поиск = тмпСписокУслуг.НайтиПоЗначению(ЭлементСписка.Значение);
		
		Если НЕ Поиск = Неопределено Тогда
			тмпСписокУслуг.Удалить(Поиск);
		КонецЕсли; 
		
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", тмпСписокУслуг);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", ПараметрыФормы, ВладелецФормы);
	
КонецПроцедуры // () 

&НаСервере
Функция ПолучитьСписокУслуг()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент"     , КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПоСчетчикам", Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_УслугиЖКХСпособыРасчета.Ссылка КАК Услуга
	|ИЗ
	|	Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|ГДЕ
	|	бит_УслугиЖКХСпособыРасчета.СпособРасчета = &ПоСчетчикам
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_УслугиЖКХСпособыРасчета.Ссылка";
	
	Результат = Новый СписокЗначений;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Результат.ЗагрузитьЗначения(ТаблицаРезультат.ВыгрузитьКолонку("Услуга"));
	
	Возврат Результат;
	
КонецФункции // ()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая" Тогда
		
		ОбработкаВыбораУсулгНаСервере(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.бит_Счетчики.Форма.ФормаВыбораСчетчиков" Тогда
		
		ОбработкаВыбораСчетчикаНаСервере(ВыбранноеЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура выбора услуг.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбработкаВыбораУсулгНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			
			Поиск = СписокУслуг.НайтиПоЗначению(ЭлементМассива);
			Если Поиск = Неопределено Тогда
				СписокУслуг.Добавить(ЭлементМассива);
			КонецЕсли; 
			
		КонецЦикла; 
		
		ВыполнитьПроверкуПоСпискуСчетчиков(); 
		
	КонецЕсли; 
	
КонецПроцедуры // ()

&НаСервере
// Процедура проверяет по списку счетчиков.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ВыполнитьПроверкуПоСпискуСчетчиков()
	
	Если ТаблицаСчетчиков.Количество() > 0 Тогда
		
		Для каждого СтрокаТаблицы Из ТаблицаСчетчиков Цикл
			
			Результат = ВыполнитьПроверкуСчетчика(СтрокаТаблицы.Счетчик, СписокУслуг, ВидОперации, Объект.ДатаУстановкиСчетчиков);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат);
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
				СтрокаТаблицы.Обрабатывать = НЕ Результат.ЕстьОшибка;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры // () 

&наСервере
// Процедура обработка выбора.
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	тмпТаблицаСчетчиков = ТаблицаСчетчиков.Выгрузить();
	Поиск = тмпТаблицаСчетчиков.Найти(ВыбранноеЗначение, "Счетчик");
	
	Если НЕ Поиск = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Результат = ВыполнитьПроверкуСчетчика(ВыбранноеЗначение, СписокУслуг, ВидОперации, Объект.ДатаУстановкиСчетчиков);
	
	Возврат Результат;
	
КонецФункции // () 

&НаСервере
// Процедура обработка выбора счетчика.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбработкаВыбораСчетчикаНаСервере(ВыбранноеЗначение)
	
	тмпТаблицаСчетчиков = ТаблицаСчетчиков.Выгрузить();
	
	Для каждого Счетчик Из ВыбранноеЗначение Цикл
		
		Поиск = тмпТаблицаСчетчиков.Найти(Счетчик, "Счетчик");
		
		Если НЕ Поиск = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = ТаблицаСчетчиков.Добавить();
		НоваяСтрока.Счетчик = Счетчик;
		
		Результат = ВыполнитьПроверкуСчетчика(Счетчик, СписокУслуг, ВидОперации, Объект.ДатаУстановкиСчетчиков);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
		НоваяСтрока.Документ     = Неопределено;
		НоваяСтрока.Обрабатывать = НЕ Результат.ЕстьОшибка;
		
	КонецЦикла; 
	
КонецПроцедуры // ()

&НаКлиенте
// Процедура меняет доступность и видимость элементов.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ПриВыбореПунктаМеню(Элемент)
	
	Заголовок = Элемент.Заголовок;
	
	Элементы.ДеревоСчетчиковГруппаСозданиеСЧ.Видимость  = Истина;
	Элементы.ДеревоСчетчиковГруппаУстановкаСЧ.Видимость = Ложь;
	
	Объект.Услуги.Очистить();
	ДеревоСчетчиков.ПолучитьЭлементы().Очистить();
	СписокУслуг.Очистить();
	ТаблицаСчетчиков.Очистить();
	
	ВидОперации                   = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик");
	
	Объект.ВидСчетчика            = Неопределено;
	Объект.УлицаЛицевогоСчета     = Неопределено;
	Объект.Здание                 = Неопределено;
	Объект.Разрядность            = 0;
	Объект.ДатаУстановкиСчетчиков = ТекущаяДата();
	Корпус                        = 0;
	Объект.Нумерация              = "ПоПорядку";
	Объект.Префикс                = "";
	Объект.Постфикс               = "";
	Объект.НачальныйНомер         = "";
	
	ИспользоватьОтборСтатусКвартиры = Ложь;
	ИспользоватьОтборТипКвартиры    = Ложь;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ИспользоватьОтборТипКвартиры;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = ИспользоватьОтборСтатусКвартиры;
	
	ВидСравненияСтатусКвартиры = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияТипКвартиры    = ВидСравненияКомпоновкиДанных.Равно;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ВидСравнения   = ВидСравненияТипКвартиры;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения   = ВидСравненияСтатусКвартиры;
	
	ТипКвартиры    = Неопределено;
	СтатусКвартиры = Неопределено;
	
	ПоместитьЗначениеВОтборКомпановщика(ТипКвартиры   , 0);
	ПоместитьЗначениеВОтборКомпановщика(СтатусКвартиры, 1);
	
	СписокЗданий = Неопределено;
	ЛицевыеСчета = Неопределено;
	ВидыСчетчика = Неопределено;
	
	ВидСравненияЛицевыеСчета = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияСписокЗданий = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияВидСчетчика  = ВидСравненияКомпоновкиДанных.Равно;
	
	ИспользоватьОтборВидСчетчика  = Ложь;
	ИспользоватьОтборЛицевойСчет  = Ложь;
	ИспользоватьОтборСписокЗданий = Ложь;
	
КонецПроцедуры // () 

&НаСервереБезКонтекста
// Процедура проверяет счетчик. 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ВыполнитьПроверкуСчетчика(Знач Счетчик, Знач СписокУслуг, Знач ВидОперации, Знач Дата)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ОбъектУчета", Неопределено);
	СтруктураРезультат.Вставить("ЕстьОшибка" , Ложь);
	СтруктураРезультат.Вставить("Сообщение"  , "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("Счетчик"    , Счетчик);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Счетчик = &Счетчик
	|				И ИСТИНА) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|ИТОГИ ПО
	|	Объект";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		СтруктураРезультат.ЕстьОшибка = Истина;
		СтруктураРезультат.Сообщение  = СтруктураРезультат.Сообщение + " Счетчик не установлен;";
		
	Иначе
		
		ВыборкаОбъект = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОбъект.Следующий() Цикл
			
			СтруктураРезультат.ОбъектУчета = ВыборкаОбъект.Объект;
			
			Если НЕ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика Тогда
				
				РезультатЛС = ПроверитьНаличиеУслугНаОбъектеУчета(ВыборкаОбъект.Объект, СписокУслуг, Дата);
				
				Если РезультатЛС.ЕстьОшибка Тогда
					СтруктураРезультат.ЕстьОшибка = Истина;
					СтруктураРезультат.Сообщение  = СтруктураРезультат.Сообщение + РезультатЛС.Сообщение; 
				КонецЕсли;
				
			КонецЕсли; 
			
			Выборка = ВыборкаОбъект.Выбрать();
			
			СписокУслугНаСчетчик = Новый СписокЗначений;
			
			Пока Выборка.Следующий() Цикл
				СписокУслугНаСчетчик.Добавить(Выборка.Услуга);
			КонецЦикла;
			
			Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик Тогда
				
				Для каждого ЭлементСписка Из СписокУслугНаСчетчик Цикл
					
					Услуга =  ЭлементСписка.Значение;
					
					Если НЕ СписокУслуг.НайтиПоЗначению(Услуга) = Неопределено Тогда
						
						СтруктураРезультат.ЕстьОшибка = Истина;
						СтруктураРезультат.Сообщение  = СтруктураРезультат.Сообщение + " Услуга : " + Услуга + " установлена на счетчике;";
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла; 
				
			ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УдалитьУслугиСоСчетчика Тогда
				
				Для каждого ЭлементСписка Из СписокУслуг Цикл
					
					Услуга =  ЭлементСписка.Значение;
					
					Если СписокУслугНаСчетчик.НайтиПоЗначению(Услуга) = Неопределено Тогда
						
						СтруктураРезультат.ЕстьОшибка = Истина;
						СтруктураРезультат.Сообщение  = СтруктураРезультат.Сообщение + " Услуга : " + Услуга + " не установлена на счетчике;";
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции // () 

&НаСервереБезКонтекста
// Процедура проверяет наличие услуг на объекте учета.
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ПроверитьНаличиеУслугНаОбъектеУчета(Знач ОбъектУчета, Знач СписокУслуг, Знач Дата)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ЕстьОшибка = Ложь;
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибка", ЕстьОшибка);
	Результат.Вставить("Сообщение" , "");
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ОбъектУчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	ТаблицаУслуг = Запрос.Выполнить().Выгрузить();
	
	ТекстСообщения = "";
	
	Для каждого ЭлементСписка Из СписокУслуг Цикл
		
		Если ТаблицаУслуг.Найти(ЭлементСписка.Значение) = Неопределено Тогда
			
			Результат.ЕстьОшибка = Истина;
			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения),"",",") + ЭлементСписка.Значение ;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Результат.ЕстьОшибка Тогда
		Результат.Сообщение  = " На личевом счете не установлены услуги: " + ТекстСообщения + ";";
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // () 

&НаСервере
// Процедура создает установку счетчика. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ВыполнитьОперациюНаСервере()
	
	Для каждого СтрокаТаблицы Из ТаблицаСчетчиков Цикл
		
		Если НЕ СтрокаТаблицы.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.Обрабатывать = Ложь;
		
		ДокументОбъект = Документы.бит_УстановкаСчетчика.СоздатьДокумент();
		
		ДокументОбъект.Дата        = Объект.ДатаУстановкиСчетчиков;
		ДокументОбъект.ВидОперации = ВидОперации;
		ДокументОбъект.Организация = СтрокаТаблицы.ОбъектУчета.Организация;
		ДокументОбъект.Счетчик     = СтрокаТаблицы.Счетчик;
		ДокументОбъект.Объект      = СтрокаТаблицы.ОбъектУчета;
		
		КэшДокумента = Документы.бит_УстановкаСчетчика.ОбновитьКэшДокумента(ДокументОбъект);
		
		Если НЕ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика Тогда
			
			ЗаполнитьЗначенияСвойств(ДокументОбъект, КэшДокумента);
			
			Для каждого ЭлементСписка Из СписокУслуг Цикл
				
				НоваяСтрока = ДокументОбъект.Услуги.Добавить();
				НоваяСтрока.Услуга = ЭлементСписка.Значение;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаТаблицы.Документ = ДокументОбъект.Ссылка;
			
		Исключение
			
			СтрокаТаблицы.ЕстьОшибка = Истина;
			СтрокаТаблицы.Сообщение  = ОписаниеОшибки(); 
			
		КонецПопытки; 
		
	КонецЦикла; 
	
КонецПроцедуры // () 

&НаКлиенте
Процедура СкрытьПоказатьМеню(Команда)
	
	Элементы.Меню.Видимость = Не Элементы.Меню.Видимость;
	
	Если Элементы.Меню.Видимость Тогда
		Элементы.ФормаСкрытьПоказатьМеню.Заголовок = "Скрыть меню";
	Иначе
		Элементы.ФормаСкрытьПоказатьМеню.Заголовок = "Показать меню";
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти