
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура устанавливает монопольный режим, если не удалось блокируем форму.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура УстановитьМонопольный()
	
	Попытка
		
		УстановитьМонопольныйРежимНаСервере();

		ТекстСообщения = "Редактирование элементов регистра осуществляется в"
		+ " МОНОПОЛЬНОМ режиме. Пока открыта данная форма другие пользователи не могут работать с базой!"; 
		
		УстановитьНадписьНаСервере(ТекстСообщения);

		Элементы.НадписьИнформация.ЦветТекста = Новый Цвет(0,0,255);
		
		ИзменитьДоступностьЭлементовФорм(Истина);
		
	Исключение
		
		ТекстСообщения = "Не удалось установить МОНОПОЛЬНЫЙ режим (с базой работают другие пользователи или недостаточно прав)!"
		+ " Редактирование  элементов регистра осуществляется в МОНОПОЛЬНОМ режиме.";
		
		УстановитьНадписьНаСервере(ТекстСообщения);
		
		Элементы.НадписьИнформация.ЦветТекста = Новый Цвет(255,0,0);
		
		ИзменитьДоступностьЭлементовФорм(Ложь);
		
	КонецПопытки;
	
КонецПроцедуры // УстановитьМонопольный()

&НаСервере
Процедура УстановитьМонопольныйРежимНаСервере()
	
	УстановитьМонопольныйРежим(Истина);
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)

	КэшированныеЗначения  = Новый Структура;                              
	
	КэшированныеЗначения.Вставить("ТолькоПросмотр", Неопределено);
	
КонецПроцедуры

// Процедура изменяет доступность элементов форм.
//
// Параметры;
//  НовоеЗначение - Булево.
//
&НаКлиенте
Процедура ИзменитьДоступностьЭлементовФорм(НовоеЗначение)
	
	ТолькоПросмотр = Не НовоеЗначение;
	
	мКэшЗначений.ТолькоПросмотр = ТолькоПросмотр;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздать.Доступность 			 = НовоеЗначение;

	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаИзменить.Доступность 			 = НовоеЗначение;
	
КонецПроцедуры // ИзменитьДоступностьЭлементовФорм()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьМонопольный();
	
КонецПроцедуры

// Процедура - обработчик события "ПриЗакрытии" формы.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 10:34:38 Начало правки... 
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 10:34:40 Конец правки. 

	Попытка
		УстановитьМонопольныйРежимНаСервере();
	Исключение
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

//  Процедура - обработчик события "Нажатие" кнопки "Добавить" коммандной панели Формы.
//
&НаКлиенте
Процедура Добавить(Команда)

	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("мТекущаяСтрока",Неопределено);
	
	ФормаЭлемента = Неопределено;

	
	ОткрытьФорму("РегистрСведений.бит_ПениПоУслугамЖКХ.Форма.ФормаРедактированияУправляемая",Новый Структура("Добавить",ПараметрыФормы),ЭтаФорма,,,, Новый ОписаниеОповещения("ДобавитьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ФормаЭлемента = Результат;

КонецПроцедуры

//  Процедура - обработчик события "Нажатие" кнопки "Изменить" коммандной панели "ДействияФормы".
//
&НаКлиенте
Процедура ДействияФормыИзменить(Команда)
	
// Если установлен режим редактирования в диалоге, тогда.
Если Не мКэшЗначений.ТолькоПросмотр Тогда
	
	СтандартнаяОбработка = Ложь;
	
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Ключ",Элементы.Список.ТекущаяСтрока);
	
	ФормаЭлемента = Неопределено;

	
	ОткрытьФорму("РегистрСведений.бит_ПениПоУслугамЖКХ.Форма.ФормаРедактированияУправляемая",ПараметрыФормы,ЭтаФорма,,,, Новый ОписаниеОповещения("ДействияФормыИзменитьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
Иначе	
	Элементы.Список.ИзменитьСтроку();
КонецЕсли;
		
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыИзменитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ФормаЭлемента = Результат;

КонецПроцедуры

//  Процедура - обработчик события "Нажатие" кнопки "МонопольныйРежим" коммандной панели "ДействияФормы".
//
&НаКлиенте
Процедура УстановитьРежим(Команда)
	
	УстановитьМонопольный();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСписок

//  Процедура - обработчик события "Выбор" табличного поля "Список"
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не мКэшЗначений.ТолькоПросмотр Тогда
		
		СтандартнаяОбработка = Ложь;
		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",ВыбраннаяСтрока);
		
		ФормаЭлемента = Неопределено;
		
		
		ОткрытьФорму("РегистрСведений.бит_ПениПоУслугамЖКХ.Форма.ФормаРедактированияУправляемая",ПараметрыФормы,Элемент,,,, Новый ОписаниеОповещения("СписокВыборЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ФормаЭлемента = Результат;

КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьНаСервере(ТекстСообщения)
	
	НадписьИнформация  = ТекстСообщения;
	
КонецПроцедуры

#КонецОбласти