Функция СведенияОВнешнейОбработке() Экспорт 
    
    РегистрационныеДанные = Новый Структура();
    РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
    РегистрационныеДанные.Вставить("Наименование", "Справка расчет по услугам ЖКХ");
    РегистрационныеДанные.Вставить("Версия", "1.0");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Информация", "Справка расчет по услугам ЖКХд");
        
    ТаблицаКоманд = ПолучитьТаблицуКоманд();

    // Добавим команду в таблицу
    ДобавитьКоманду(ТаблицаКоманд, "Справка расчет по услугам ЖКХ", "1" , "ОткрытиеФормы", Истина, );
        
       // Сохраним таблицу команд в параметры регистрации обработки
    РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);

    Возврат РегистрационныеДанные;

КонецФункции

Функция ПолучитьТаблицуКоманд()
    
    // Создадим пустую таблицу команд и колонки в ней
    Команды = Новый ТаблицаЗначений;

    // Как будет выглядеть описание печатной формы для пользователя
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 

    // Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));

    // Тут задается, как должна вызваться команда обработки
    // Возможные варианты:
    // - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
    // - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
    // - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));

    // Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));

    // Для печатной формы должен содержать строку ПечатьMXL 
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
   
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор)
    
    // Добавляем команду в таблицу команд по переданному описанию.
    // Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////

Функция СформироватьПечатнуюФорму() экспорт
	
	ТабДок = Новый ТабличныйДокумент;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИсполнительныйЛист.Ссылка КАК Документ,
	|	бит_ИсполнительныйЛист.ПериодОбразованияЗадолженностиПо КАК ПериодОбразованияЗадолженностиПо,
	|	бит_ИсполнительныйЛист.ЛицевойСчет КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.бит_ИсполнительныйЛист КАК бит_ИсполнительныйЛист
	|ГДЕ
	|	бит_ИсполнительныйЛист.Проведен = ИСТИНА
	|	И бит_ИсполнительныйЛист.ЛицевойСчет В(&ЛицевойСчет)
	|	И бит_ИсполнительныйЛист.Услуга В(&Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ИсковоеЗаявление.Ссылка КАК Документ,
	|	бит_ИсковоеЗаявление.ПериодОбразованияЗадолженностиПо КАК ПериодОбразованияЗадолженностиПо,
	|	бит_ИсковоеЗаявление.ЛицевойСчет КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВременнаяТаблица1
	|ИЗ
	|	Документ.бит_ИсковоеЗаявление КАК бит_ИсковоеЗаявление
	|ГДЕ
	|	бит_ИсковоеЗаявление.Проведен = ИСТИНА
	|	И бит_ИсковоеЗаявление.ЛицевойСчет В(&ЛицевойСчет)
	|	И бит_ИсковоеЗаявление.Услуга В(&Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВременнаяТаблица.ЛицевойСчет ЕСТЬ NULL
	|			ТОГДА ВременнаяТаблица1.ЛицевойСчет
	|		ИНАЧЕ ВременнаяТаблица.ЛицевойСчет
	|	КОНЕЦ КАК ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблица.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И НЕ ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|			ТОГДА ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо
	|		КОГДА НЕ ВременнаяТаблица.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И НЕ ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И ВременнаяТаблица.ПериодОбразованияЗадолженностиПо > ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо
	|			ТОГДА ВременнаяТаблица.ПериодОбразованияЗадолженностиПо
	|		КОГДА НЕ ВременнаяТаблица.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И НЕ ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И ВременнаяТаблица.ПериодОбразованияЗадолженностиПо < ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо
	|			ТОГДА ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо
	|		ИНАЧЕ ВременнаяТаблица.ПериодОбразованияЗадолженностиПо
	|	КОНЕЦ КАК ПериодОбразованияЗадолженностиПо,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблица.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И НЕ ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|			ТОГДА ВременнаяТаблица1.Документ
	|		КОГДА НЕ ВременнаяТаблица.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И НЕ ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И ВременнаяТаблица.ПериодОбразованияЗадолженностиПо > ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо
	|			ТОГДА ВременнаяТаблица.Документ
	|		КОГДА НЕ ВременнаяТаблица.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И НЕ ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо ЕСТЬ NULL
	|				И ВременнаяТаблица.ПериодОбразованияЗадолженностиПо < ВременнаяТаблица1.ПериодОбразованияЗадолженностиПо
	|			ТОГДА ВременнаяТаблица1.Документ
	|		ИНАЧЕ ВременнаяТаблица.Документ
	|	КОНЕЦ КАК Документ
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВременнаяТаблица1 КАК ВременнаяТаблица1
	|		ПО ВременнаяТаблица.ЛицевойСчет = ВременнаяТаблица1.ЛицевойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодОбразованияЗадолженностиПо УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ПериодОбразованияЗадолженностиПо)
	|ПО
	|	ЛицевойСчет";
	ЛицевыеСчета = ПолучитьМассивЛС();
	Запрос.УстановитьПараметр("Услуга", ГруппаУслуг(Услуга));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевыеСчета);
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеИспЛист = РезультатЗапроса.Выгрузить();

	МассивЛСИспЛисты = ПолучитьЛСПоПолюДокумент(ДанныеИспЛист);
	
	Если НЕ ОтборПоПериоду Тогда
		Для каждого ЛицевойСчет из МассивЛСИспЛисты Цикл
			ЛицевыеСчета.Удалить(ЛицевыеСчета.Найти(ЛицевойСчет));
		КонецЦикла;
	КонецЕсли;
	//формируем справки БЕЗ исполнительного листа или если стоит флаг "по периоду"
	Для каждого Лс из ЛицевыеСчета Цикл
		Если ПрошелПорогПоДолгу(Лс, КоличествоМесяцевЗадолженности, НачалоМесяца((ДобавитьМесяц(ТекущаяДата(), -1))),  ГруппаУслуг(Услуга)) или ОтборПоПериоду Тогда
			ДатаНачалаЗадложенности = ПолучитьДатуНачалаЗадолженности(Лс, ГруппаУслуг(Услуга));
			ДатаНачалаСправки = ?(ЗначениеЗаполнено(Период.ДатаНачала) И ОтборПоПериоду, Период.ДатаНачала, ДатаНачалаЗадложенности);
			МассивСобственников = МассивСобственников(Лс);
			Если ЗначениеЗаполнено(ДатаНачалаСправки) Тогда
				Если Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000003") ИЛИ ДелитьПоСобственникам Тогда
					Для каждого Собственник Из МассивСобственников Цикл
						ЗаполнитьТабДок(ТабДок, Лс, Услуга, Дата(1 ,1, 1) , НачалоМесяца(ДатаНачалаСправки), ПолучитьКонецПериодаРасчета(), ЛОЖЬ, Собственник);
					КонецЦикла;
				Иначе
					ЗаполнитьТабДок(ТабДок, Лс, Услуга, Дата(1 ,1, 1) , НачалоМесяца(ДатаНачалаСправки), ПолучитьКонецПериодаРасчета(), ЛОЖЬ, ЛОЖЬ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//формируем справки по тем у кого есть исполнительные листы
	Если не РезультатЗапроса.Пустой() и НЕ ОтборПоПериоду Тогда
		ВыборкаЛС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//обход по каждому ЛС
		Пока ВыборкаЛС.Следующий() Цикл
			ВыборкаДокумент = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//берем первую строку с исполнительным листом с последней датой
			Если ВыборкаДокумент.Следующий() Тогда
				Документ = ВыборкаДокумент.Документ;
				МассивСобственников = МассивСобственников(Документ.ЛицевойСчет);
				МесяцевНеПодачиВСуд = (ТекущаяДата() - Документ.ПериодОбразованияЗадолженностиПо)/3600/24/30;
				ДатаНачалаСправки = ?(Период.ДатаНачала > Документ.ПериодОбразованияЗадолженностиПо и ОтборПоПериоду, Период.ДатаНачала , Документ.ПериодОбразованияЗадолженностиПо);
				ДатаНачалаСправки = ?(ЗначениеЗаполнено(Период.ДатаНачала) И ОтборПоПериоду, Период.ДатаНачала, ДатаНачалаСправки);
				Если МесяцевНеПодачиВСуд >= СрокНеПодачиВСуд И ПрошелПорогПоДолгу(Документ.ЛицевойСчет, КоличествоМесяцевЗадолженности, ДатаНачалаСправки, ГруппаУслуг(Услуга)) Тогда
					Если Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000003") ИЛИ ДелитьПоСобственникам Тогда
						Для каждого Собственник Из МассивСобственников Цикл
							ЗаполнитьТабДок(ТабДок, Документ.ЛицевойСчет, Документ.Услуга, Документ.ПериодОбразованияЗадолженностиОт, ДатаНачалаСправки, ПолучитьКонецПериодаРасчета(), Истина, Собственник);
						КонецЦикла;
					Иначе
						ЗаполнитьТабДок(ТабДок, Документ.ЛицевойСчет, Документ.Услуга, Документ.ПериодОбразованияЗадолженностиОт, ДатаНачалаСправки, ПолучитьКонецПериодаРасчета(), Истина, Ложь);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьКонецПериодаРасчета()
	Возврат ?(ОтборПоПериоду И ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, ТекущаяДата());
КонецФункции

Функция МассивСобственников(Лс)
	
	МассивСобственников = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Наименование КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры = &Муниципальная
		|			ТОГДА 1
		|		ИНАЧЕ бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади
		|	КОНЕЦ КАК ДоляПлощади,
		|	ВЫБОР
		|		КОГДА бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры = &Муниципальная
		|			ТОГДА ""1""
		|		ИНАЧЕ бит_ПроживающиеПоЛССрезПоследних.лб_ДоляПлощадиСтрокой
		|	КОНЕЦ КАК лб_ДоляПлощадиСтрокой,
		|	ЛОЖЬ КАК ЭтоСовместнаяСобственность
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ЛицевойСчет = &ЛС) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|ГДЕ
		|	ВЫБОР
		|			КОГДА бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры = &Муниципальная
		|					И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &Ответственный
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади > 0
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЛС", ЛС);
	Запрос.УстановитьПараметр("Муниципальная", Справочники.бит_СтатусыКвартиры.Неприватизированная);
	Запрос.УстановитьПараметр("Ответственный", Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивСобственников = РезультатЗапроса.Выгрузить();
	Собственники = "";
	ДоляСовместойСобственности = 0;
	СуммаЧислителейДолей = 0;
	ЗнаменательСовместнойСобственности = 0;
	ДоляСовместойСобственностиСтрока = "";
	МассивИндесовСовместнойСобственности = Новый Массив;
	
	Для каждого СтрокаСобственник Из МассивСобственников Цикл
		ЭтоСовместнаяСобственность = ?(СтрНачинаетсяС(СтрокаСобственник.лб_ДоляПлощадиСтрокой, "с") или СтрНачинаетсяС(СтрокаСобственник.лб_ДоляПлощадиСтрокой, "о"), Истина, Ложь);
		Если ЭтоСовместнаяСобственность Тогда 
			СтрокаДанных = СтрЗаменить(СтрокаСобственник.лб_ДоляПлощадиСтрокой, "с","");	
			СтрокаДанных = СтрЗаменить(СтрокаДанных, "о","");
		КонецЕсли;
		СтрокаДанных = СтрЗаменить(СтрокаДанных, "/"," ");
		МассивЧисел = СтрРазделить(СтрокаДанных, " ");
		Попытка
			Числитель = Число(МассивЧисел[0]);
			Знаменатель = Число(МассивЧисел[1]);
		Исключение
			Числитель = 0;
			Знаменатель = 0;
		КонецПопытки;
		
		ЗнаменательСовместнойСобственности = Знаменатель;
		Если ЭтоСовместнаяСобственность Тогда
			ДоляСовместойСобственности = ДоляСовместойСобственности + Числитель / Знаменатель;
			СуммаЧислителейДолей = СуммаЧислителейДолей + Числитель;
			МассивИндесовСовместнойСобственности.Добавить(СтрокаСобственник);
			Собственники = Собственники + (СтрокаСобственник.ФизЛицо) + Символы.ПС;
		Иначе
			Попытка
				СтрокаСобственник.ДоляПлощади = Числитель / Знаменатель;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Если ДоляСовместойСобственности > 0 Тогда
		
		Для каждого Строка Из МассивИндесовСовместнойСобственности Цикл
			МассивСобственников.Удалить(Строка);
		КонецЦикла;
		
		НоваяСтрока = МассивСобственников.Добавить();
		НоваяСтрока.ФизЛицо = Собственники;
		НоваяСтрока.ДоляПлощади = ДоляСовместойСобственности;
		НоваяСтрока.лб_ДоляПлощадиСтрокой = Строка(Строка(СуммаЧислителейДолей) + "/" + Строка(Знаменатель));
		НоваяСтрока.ЭтоСовместнаяСобственность = Истина;
	КонецЕсли;	
	
	Возврат МассивСобственников;
КонецФункции

Функция ПолучитьТарифыОДН(Услуга, ЛицевойСчет, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ХВ
		|				ТОГДА бит_СтавкиНаУслугиСрезПоследних.Тариф
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ТарифХВ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ГВ
		|				ТОГДА бит_СтавкиНаУслугиСрезПоследних.Тариф
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ТарифГВ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ВО
		|				ТОГДА бит_СтавкиНаУслугиСрезПоследних.Тариф
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ТарифВО,
		|	СУММА(ВЫБОР
		|			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ЭЛ
		|				ТОГДА бит_СтавкиНаУслугиСрезПоследних.Тариф
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ТарифЭЛ
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|			,
		|			ЛицевойСчет = &ЛицевойСчет
		|				И Услуга В (&Услуга)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&Период, ) КАК бит_СтавкиНаУслугиСрезПоследних
		|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
		|			И бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
		|			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга", ГруппаУслуг(Услуга));
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаТарифы = РезультатЗапроса.Выбрать().Выгрузить();
	
	//СтрокаТарифы = "";
	//
	//Пока Выборка.Следующий() Цикл
	//	 СтрокаТарифы = СтрокаТарифы + Выборка.УслугаНаименованиеСокращенное + " - " + Выборка.Тариф + ";  ";
	//КонецЦикла;
	
	Возврат ТаблицаТарифы;
	
КонецФункции

Функция ПолучитьПлощадь(ЛицевойСчет, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(, Квартира = &кв) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("кв", ЛицевойСчет.Квартира);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат  Выборка.ОбщаяПлощадь;
	КонецЦикла;
	
	Возврат 0;

КонецФункции

Функция ПолучитьСтрокуФизЛица(Собственники)
	Строка = "";
	Если ТипЗнч(Собственники) = Тип("Массив") Тогда
		Для каждого ФизЛицо Из Собственники Цикл
			Строка = Строка + Строка(ФизЛицо) + Символы.ПС;
		КонецЦикла;
		
	Иначе
		Строка = Строка(Собственники);
	КонецЕсли;

	Возврат Строка;
КонецФункции

Процедура ЗаполнитьТабДок(ТабДок, ЛицевойСчет, Услуга, ПериодОбразованияЗадолженностиОт, ПериодОбразованияЗадолженностиПо, КонецПериодаРасчета, ПоИсполнительномуЛисту, Собственник)
	
				//ТабДок.Очистить();
				ТабДок.АвтоМасштаб = Истина;

				
				УслугаСодРем        = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001");
				УслугаВО     	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000015");
				УслугаГВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011");
				УслугаХВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012");
				УслугаЭЭ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010");
	
				Коэфф = 1;
				ЭтоОДН = ЭтоОДН(Услуга);
				
				Если ЭтоОДН Тогда
					Макет = ПолучитьМакет("МакетСправкаОДН");
				Иначе
					Макет = ПолучитьМакет("МакетСправка");
				КонецЕсли;
				
				ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Основная");
				ОбластьШапка.Параметры.УслугаЖКХ = ?(ЗначениеЗаполнено(Услуга.ГруппаУслуги), Услуга.ГруппаУслуги, Услуга);
				ОбластьШапка.Параметры.Адрес = Строка(ЛицевойСчет.Здание) + " кв. " + Строка(ЛицевойСчет.Квартира.Наименование);
				ОбластьШапка.Параметры.НомерЛицевогоСчета = ЛицевойСчет;
				Если Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000003") или ДелитьПоСобственникам Тогда
					СтрокаСовместнойСобственности = ?(Собственник.ЭтоСовместнаяСобственность, "совмест. соб-ть" + Символы.ПС, "");
					ОбластьШапка.Параметры.ФИО = СтрокаСовместнойСобственности + Собственник.ФизЛицо + " " + Строка(?(Собственник.лб_ДоляПлощадиСтрокой = "1","", Собственник.лб_ДоляПлощадиСтрокой));
					Коэфф = Собственник.ДоляПлощади;
					ОбластьШапкаПоСобственникам = Макет.ПолучитьОбласть("ШапкаПоСобственникам|Основная");
					//ОбластьШапкаПоСобственникам.Параметры.Тариф = "";//ПолучитьТарифы(Услуга, ЛицевойСчет, ТекущаяДата());
					ОбластьШапкаПоСобственникам.Параметры.Площадь = Формат(Окр(ПолучитьПлощадь(ЛицевойСчет, Период)* Коэфф, 2), "ЧДЦ=2");
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьШапка);
				
				Если Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000003") или ДелитьПоСобственникам Тогда
					ТабДок.Вывести(ОбластьШапкаПоСобственникам);
				КонецЕсли;
				
				ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы|Основная"));
				
				ДанныеЗадолженностиНаНачалоСправки = ПолучитьЗадолженностьНаНачалоСправки(ПериодОбразованияЗадолженностиПо, ЛицевойСчет, Услуга);
				ДолгУслуга = ДанныеЗадолженностиНаНачалоСправки.Итог("СуммаОстаток") * Коэфф;
				ДолгУслугаЗаПрошлыйПериод = ДолгУслуга;
				ДанныеСодРем = ДанныеЗадолженностиНаНачалоСправки.Найти(УслугаСодРем, "УслугаЖКХ");
				ДанныеГВ = ДанныеЗадолженностиНаНачалоСправки.Найти(УслугаГВ, "УслугаЖКХ");
				ДанныеХВ = ДанныеЗадолженностиНаНачалоСправки.Найти(УслугаХВ, "УслугаЖКХ");
				ДанныеВО = ДанныеЗадолженностиНаНачалоСправки.Найти(УслугаВО, "УслугаЖКХ");
				ДанныеЭЛ = ДанныеЗадолженностиНаНачалоСправки.Найти(УслугаЭЭ, "УслугаЖКХ");
				ДолгСодРем = ?(ЗначениеЗаполнено(ДанныеСодРем), ДанныеСодРем.СуммаОстаток, 0);
				ДолгГВ = ?(ЗначениеЗаполнено(ДанныеГВ), ДанныеГВ.СуммаОстаток, 0) * Коэфф;
				ДолгХВ = ?(ЗначениеЗаполнено(ДанныеХВ), ДанныеХВ.СуммаОстаток, 0) * Коэфф;
				ДолгВО = ?(ЗначениеЗаполнено(ДанныеВО), ДанныеВО.СуммаОстаток, 0) * Коэфф;
				ДолгЭЛ = ?(ЗначениеЗаполнено(ДанныеЭЛ), ДанныеЭЛ.СуммаОстаток, 0) * Коэфф;
				ДолгЗаПрошлыйПериод = ДолгГВ + ДолгХВ + ДолгВО + ДолгЭЛ + ДолгСодРем;
				ИтогоНачислено = 0;
				ИтогоПерерасчеты = 0;
				ИтогоОплатаТекПериод = 0;
				ИтогоОплатаПрошлыйПериод = 0;
				ДолгТекПериод = 0;
				СуммаПерерасчеты = 0;
				
				ДанныеСправки = ПолучитьДанныеДляСправки(ПериодОбразованияЗадолженностиОт, ПериодОбразованияЗадолженностиПо, КонецПериодаРасчета, ЛицевойСчет, Услуга);
				//ДанныеРазовых = ПолучитьДанныеРазовых(ПериодОбразованияЗадолженностиПо, КонецПериодаРасчета, ЛицевойСчет, Услуга);
				МассивСортировки = ПолучитьМассивСортировки(ДанныеСправки);
				//Для каждого СтрокаДанных Из ДанныеСправки Цикл
#Область ЗаполнениеТаблицы
	
				//++bit_AnisimovaMV_23.10.2023 
				ПереплатаНаНачалоПериода = 0;   
				Если ДолгСодРем < 0 Тогда       
					 ПереплатаНаНачалоПериода = ПереплатаНаНачалоПериода+ДолгСодРем; 
				 КонецЕсли; 
				Если ДолгГВ < 0 Тогда       
					 ПереплатаНаНачалоПериода = ПереплатаНаНачалоПериода+ДолгГВ; 
				 КонецЕсли;   
				Если ДолгХВ < 0 Тогда       
					 ПереплатаНаНачалоПериода = ПереплатаНаНачалоПериода+ДолгХВ; 
				КонецЕсли;
				Если ДолгВО < 0 Тогда       
					 ПереплатаНаНачалоПериода = ПереплатаНаНачалоПериода+ДолгВО; 
				 КонецЕсли;     
				Если ДолгЭЛ < 0 Тогда       
					 ПереплатаНаНачалоПериода = ПереплатаНаНачалоПериода+ДолгЭЛ; 
				КонецЕсли;
				//--bit_AnisimovaMV_23.10.2023	
				Для каждого Ключ Из МассивСортировки Цикл                         
					МассивДанных = ДанныеСправки.Получить(Ключ);
					ДанныеПоЛС = МассивДанных[0];
					ДанныеНачИОпл = МассивДанных[1];
					ДанныеНачичсленияОснова = МассивДанных[2];
					ДанныеРазовые = МассивДанных[3];
					ОбластьТаблица = Макет.ПолучитьОбласть("Таблица|Основная");
					ОбластьТаблица.Параметры.Период = ПериодСтрокой(Ключ);
					ЭтоСтрокаНачислений = Ложь;
					ЭтоПерваяСтрока = Истина;
					//СтруктураПодвала = ПодвалКвитанции(ДанныеПоЛС, ТекущаяДата());
					Если ДанныеПоЛС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда 
						Площадь = ДанныеПоЛС.ЖилаяПлощадь;
					Иначе
						Площадь = ДанныеПоЛС.ОбщаяПлощадь; 
					КонецЕсли;
					
					СуммаНачислено = 0;
					СуммаОплатыПрошлыйПериод = 0;
					СуммаОплатыТекПериод = 0;
					СуммаПерерасчеты = 0;
					ВыводСодРем = 0; 
					ВыводГВ = 0;
					ВыводХВ = 0;
					ВыводВО = 0;
					ВыводЭЛ = 0;
					КоличествоОплат = ДанныеНачИОпл.Количество();
					СтрокаБухСправки = ДанныеНачИОпл.НайтиСтроки(Новый Структура("СуммаОплачено, ДатаОплаты", 0 , КонецМесяца(Ключ)));
					
					Для каждого СтрокаОплаты Из ДанныеНачИОпл Цикл
					//
					//Для Счетчик = КоличествоОплат -1 по Счетчик = 0 Цикл
					//	
						//СтрокаОплаты = ДанныеНачИОпл[Счетчик];
						
						ЭтоСтрокаНачислений = ?((СтрокаОплаты.ДатаОплаты < Дата('2000.01.01')), Истина, Ложь);
						СуммаОплат = СтрокаОплаты.ВООпл + СтрокаОплаты.ГВОпл + СтрокаОплаты.СодРемОпл + СтрокаОплаты.ХВОпл + СтрокаОплаты.ЭЛОпл;
						ЭтоБухСправка = ?(СтрокаОплаты.ДатаОплаты = КонецМесяца(Ключ) и СуммаОплат = 0, Истина, Ложь);
#Область ОДН						
						Если ЭтоОДН Тогда
							Если ЭтоСтрокаНачислений Тогда
								СуммаНачислено = (СтрокаОплаты.СодРемНач + СтрокаОплаты.ХВНач + СтрокаОплаты.ГВНач + СтрокаОплаты.ВОНач + СтрокаОплаты.ЭЛНач) * Коэфф;
								
								ОбластьТаблица.Параметры.ЕдСод = ?(Ключ >= Дата('2023.02.01'), "м2", "м2");
								ОбластьТаблица.Параметры.ЕдГВ = ?(Ключ >= Дата('2023.02.01'), "м3", "м2");
								ОбластьТаблица.Параметры.ЕдХВ = ?(Ключ >= Дата('2023.02.01'), "м3", "м2");
								ОбластьТаблица.Параметры.ЕдЭЛ = ?(Ключ >= Дата('2023.02.01'), "кВт", "м2");
								ОбластьТаблица.Параметры.ЕдВО = ?(Ключ >= Дата('2023.02.01'), "м3", "м2");
								
								ОбластьТаблица.Параметры.НачисленоСодРем	= Формат(СтрокаОплаты.СодРемНач * Коэфф, "ЧДЦ=2; ЧН=");
								СодРемНач = СтрокаОплаты.СодРемНач * Коэфф;
								ОбластьТаблица.Параметры.ОплатаТекПериодСодРем  = СтрокаОплаты.СодРемОпл;
								СтрокаРазовые = ДанныеРазовые.Найти(УслугаСодРем, "УслугаЖКХ");
								ОбластьТаблица.Параметры.ПерерасчетыСодРем = ?(ЗначениеЗаполнено(СтрокаРазовые), Формат(СтрокаРазовые.СуммаОборот * Коэфф, "ЧДЦ=2; ЧН="), 0);
								СуммаРазовые = ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								Если СуммаРазовые < 0 Тогда   
									//СтрокаРазовые.СуммаОборот = СтрокаРазовые.СуммаОборот - СодРемНач;
									СодРемНач = СодРемНач + СуммаРазовые;  
									
									Если СодРемНач < 0 Тогда
										//ДолгСодРем = ДолгСодРем + СодРемНач; АнисимоваМВ_07.11_1бит
										СодРемНач = 0;
									КонецЕсли;
								Иначе
									СодРемНач = СодРемНач + СуммаРазовые;
								КонецЕсли;
								
								СуммаПерерасчеты = СуммаПерерасчеты + ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								
								ОбластьТаблица.Параметры.НачисленоХВ		= Формат(СтрокаОплаты.ХВНач * Коэфф, "ЧДЦ=2; ЧН=");
								ХВНач = СтрокаОплаты.ХВНач * Коэфф;
								ОбластьТаблица.Параметры.ОплатаТекПериодХВ	= СтрокаОплаты.ХВОпл; 
								СтрокаРазовые = ДанныеРазовые.Найти(УслугаХВ, "УслугаЖКХ");
								ОбластьТаблица.Параметры.ПерерасчетыХВ = ?(ЗначениеЗаполнено(СтрокаРазовые), Формат(СтрокаРазовые.СуммаОборот* Коэфф, "ЧДЦ=2; ЧН="), 0);
								СуммаРазовые = ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								Если СуммаРазовые < 0 Тогда    
									 //СтрокаРазовые.СуммаОборот = СтрокаРазовые.СуммаОборот + ХВНач;
									ХВНач = ХВНач + СуммаРазовые;
									Если ХВНач < 0 Тогда
										//ДолгХВ = ДолгХВ + ХВНач; АнисимоваМВ_07.11_1бит
										ХВНач = 0;
									КонецЕсли;
								Иначе
									ХВНач = ХВНач + СуммаРазовые;
								КонецЕсли;
								//ХВНач = ХВНач + СуммаРазовые;
								СуммаПерерасчеты = СуммаПерерасчеты + ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								
								ОбластьТаблица.Параметры.НачисленоГВ		= Формат(СтрокаОплаты.ГВНач * Коэфф, "ЧДЦ=2; ЧН=");
								ГВНач = СтрокаОплаты.ГВНач * Коэфф;
								ОбластьТаблица.Параметры.ОплатаТекПериодГВ	= СтрокаОплаты.ГВОпл;
								СтрокаРазовые = ДанныеРазовые.Найти(УслугаГВ, "УслугаЖКХ");
								ОбластьТаблица.Параметры.ПерерасчетыГВ = ?(ЗначениеЗаполнено(СтрокаРазовые), Формат(СтрокаРазовые.СуммаОборот * Коэфф, "ЧДЦ=2; ЧН="), 0);
								СуммаРазовые = ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								Если СуммаРазовые < 0 Тогда  
									 //СтрокаРазовые.СуммаОборот = СтрокаРазовые.СуммаОборот + ГВНач;
									ГВНач = ГВНач + СуммаРазовые;
									Если ГВНач < 0 Тогда
										//ДолгГВ = ДолгГВ + ГВНач; АнисимоваМВ_07.11_1бит
										ГВНач = 0;
									КонецЕсли;
								Иначе
									ГВНач = ГВНач + СуммаРазовые;
								КонецЕсли;
								//ГВНач = ГВНач + СуммаРазовые;
								СуммаПерерасчеты = СуммаПерерасчеты + ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								
								ОбластьТаблица.Параметры.НачисленоВО		= Формат(СтрокаОплаты.ВОНач * Коэфф, "ЧДЦ=2; ЧН=");
								ВОНач = СтрокаОплаты.ВОНач * Коэфф;
								ОбластьТаблица.Параметры.ОплатаТекПериодВО	= СтрокаОплаты.ВООпл;
								СтрокаРазовые = ДанныеРазовые.Найти(УслугаВО, "УслугаЖКХ");
								ОбластьТаблица.Параметры.ПерерасчетыВО = ?(ЗначениеЗаполнено(СтрокаРазовые), Формат(СтрокаРазовые.СуммаОборот * Коэфф, "ЧДЦ=2; ЧН="), 0);
								СуммаРазовые = ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								Если СуммаРазовые < 0 Тогда    
									 //СтрокаРазовые.СуммаОборот = СтрокаРазовые.СуммаОборот + ВОНач;
									ВОНач = ВОНач + СуммаРазовые;
									Если ВОНач < 0 Тогда
										//ДолгВО = ДолгВО + ВОНач;  АнисимоваМВ_07.11_1бит
										ВОНач = 0;
									КонецЕсли;
								Иначе
									ВОНач = ВОНач + СуммаРазовые;
								КонецЕсли;
								//ВОНач = ВОНач + СуммаРазовые;
								СуммаПерерасчеты = СуммаПерерасчеты + ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								
								ОбластьТаблица.Параметры.НачисленоЭЛ		= Формат(СтрокаОплаты.ЭЛНач * Коэфф, "ЧДЦ=2; ЧН=");
								ЭЛНач = СтрокаОплаты.ЭЛНач * Коэфф;
								ОбластьТаблица.Параметры.ОплатаТекПериодЭЛ	= СтрокаОплаты.ЭЛОпл;
								СтрокаРазовые = ДанныеРазовые.Найти(УслугаЭЭ, "УслугаЖКХ");
								ОбластьТаблица.Параметры.ПерерасчетыЭЛ = ?(ЗначениеЗаполнено(СтрокаРазовые), Формат(СтрокаРазовые.СуммаОборот * Коэфф, "ЧДЦ=2; ЧН="), 0);
								СуммаРазовые = ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								Если СуммаРазовые < 0 Тогда  
									 //СтрокаРазовые.СуммаОборот = СтрокаРазовые.СуммаОборот + ЭЛНач;
									ЭЛНач = ЭЛНач + СуммаРазовые;
									Если ЭЛНач < 0 Тогда
										//ДолгЭЛ = ДолгЭЛ + ЭЛНач;  АнисимоваМВ_07.11_1бит  
										ЭЛНач = 0;
									КонецЕсли;
								Иначе
									ЭЛНач = ЭЛНач + СуммаРазовые;
								КонецЕсли;
								//ЭЛНач = ЭЛНач + СуммаРазовые;
								СуммаПерерасчеты = СуммаПерерасчеты + ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
								
								ОбластьТаблица.Параметры.ОбъемСодРем 					= Формат(Площадь * Коэфф, "ЧДЦ=2");
								ОбластьТаблица.Параметры.ТарифСодРем 					= Формат(ДанныеНачичсленияОснова.Найти(УслугаСодРем, "УслугаЖКХ").ОсновнаяСтавка, "ЧДЦ=2");
								// эл
								ДанныеНачичсленияЭЛ = ДанныеНачичсленияОснова.Найти(УслугаЭЭ, "УслугаЖКХ");	
								Если ДанныеПоЛС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
									ОбластьТаблица.Параметры.ОбъемЭЛ            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияЭЛ), ДанныеНачичсленияЭЛ.Объем, 0) * ДанныеПоЛС.ЖилаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								Иначе	
									ОбластьТаблица.Параметры.ОбъемЭЛ            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияЭЛ), ДанныеНачичсленияЭЛ.Объем, 0) * ДанныеПоЛС.ОбщаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								КонецЕсли;
								ОбластьТаблица.Параметры.ТарифЭЛ 				= ?(Ключ >= Дата('2023.02.01'), Формат(ДанныеПоЛС.СтоимостьКВтч, "ЧДЦ=2"), Формат(ДанныеПоЛС.ТарифЭЛ, "ЧДЦ=2"));
								// гв
								ДанныеНачичсленияГВ = ДанныеНачичсленияОснова.Найти(УслугаГВ, "УслугаЖКХ");	
								Если ДанныеПоЛС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
									ОбластьТаблица.Параметры.ОбъемГВ            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияГВ), ДанныеНачичсленияГВ.Объем, 0) * ДанныеПоЛС.ЖилаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								Иначе	
									ОбластьТаблица.Параметры.ОбъемГВ            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияГВ), ДанныеНачичсленияГВ.Объем, 0) * ДанныеПоЛС.ОбщаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								КонецЕсли;
								ОбластьТаблица.Параметры.ТарифГВ 				= ?(Ключ >= Дата('2023.02.01'), Формат(ДанныеПоЛС.СтоимостьГКалл * ДанныеПоЛС.НормативНаПодогрев + ДанныеПоЛС.СтоимостьКубаХВнаГВ, "ЧДЦ=2"), Формат(ДанныеПоЛС.ТарифГВ, "ЧДЦ=2"));
								// хв
								ДанныеНачичсленияХВ = ДанныеНачичсленияОснова.Найти(УслугаХВ, "УслугаЖКХ");	
								Если ДанныеПоЛС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
									ОбластьТаблица.Параметры.ОбъемХВ            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияХВ), ДанныеНачичсленияХВ.Объем, 0) * ДанныеПоЛС.ЖилаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								Иначе	
									ОбластьТаблица.Параметры.ОбъемХВ            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияХВ), ДанныеНачичсленияХВ.Объем, 0) * ДанныеПоЛС.ОбщаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								КонецЕсли;
								ОбластьТаблица.Параметры.ТарифХВ 				= ?(Ключ >= Дата('2023.02.01'), Формат(ДанныеПоЛС.СтоимостьКубаХВ, "ЧДЦ=2"), Формат(ДанныеПоЛС.ТарифХВ, "ЧДЦ=2"));
								// во
								ДанныеНачичсленияВО = ДанныеНачичсленияОснова.Найти(УслугаВО, "УслугаЖКХ");	
								Если ДанныеПоЛС.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
									ОбластьТаблица.Параметры.ОбъемВО            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияВО), ДанныеНачичсленияВО.Объем, 0) * ДанныеПоЛС.ЖилаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								Иначе	
									ОбластьТаблица.Параметры.ОбъемВО            = ?(Ключ >= Дата('2023.02.01'),Формат(?(ЗначениеЗаполнено(ДанныеНачичсленияВО), ДанныеНачичсленияВО.Объем, 0) * ДанныеПоЛС.ОбщаяПлощадь * Коэфф, "ЧДЦ=4; ЧН="), Формат(Площадь * Коэфф, "ЧДЦ=2"));
								КонецЕсли;
								ОбластьТаблица.Параметры.ТарифВО 				= ?(Ключ >= Дата('2023.02.01'), Формат(ДанныеПоЛС.СтоимостьКубаВО, "ЧДЦ=2"), Формат(ДанныеПоЛС.ТарифВО, "ЧДЦ=2"));
								БухПоПрошломуПериоду = Ложь;	
								Если СтрокаБухСправки.Количество() = 1 Тогда
									
									Если (ДолгСодРем + ДолгХВ + ДолгГВ + ДолгВО + ДолгЭЛ) > 0 тогда
										ДолгСодРем = ДолгСодРем - СтрокаБухСправки[0].СодРемОпл * Коэфф; 
										ДолгХВ = ДолгХВ - СтрокаБухСправки[0].ХВОпл * Коэфф; 
										ДолгГВ = ДолгГВ - СтрокаБухСправки[0].ГВОпл * Коэфф; 
										ДолгВО = ДолгВО - СтрокаБухСправки[0].ВООпл * Коэфф; 
										ДолгЭЛ = ДолгЭЛ - СтрокаБухСправки[0].ЭЛОпл * Коэфф;           
										
										//++АнисимоваМВ 10.11_2023     
										СуммаОплатыПрошлыйПериод = СуммаОплатыПрошлыйПериод + СтрокаБухСправки[0].СодРемОпл + СтрокаБухСправки[0].ХВОпл
																	+ СтрокаБухСправки[0].ГВОпл + СтрокаБухСправки[0].ВООпл + СтрокаБухСправки[0].ЭЛОпл;
										//--АнисимоваМВ 10.11_2023
										Если ДолгХВ < 0 и ДолгСодРем > 0 Тогда 
											ДолгСодРем = ДолгСодРем + ДолгХВ;
											ДолгХВ = 0;
											Если ДолгСодРем < 0 Тогда 
												ХВНач = ХВНач + ДолгСодРем;
												ДолгХВ = 0;
											КонецЕсли;
										КонецЕсли;
										Если ДолгГВ < 0 и ДолгСодРем > 0 Тогда 
											ДолгСодРем = ДолгСодРем + ДолгГВ;
											ДолгГВ = 0;
											Если ДолгСодРем < 0 Тогда 
												ГВНач = ГВНач + ДолгСодРем;
												ДолгГВ = 0;
											КонецЕсли;
										КонецЕсли;
										Если ДолгВО < 0 и ДолгСодРем > 0 Тогда 
											ДолгСодРем = ДолгСодРем + ДолгВО;
											ДолгВО = 0;
											Если ДолгСодРем < 0 Тогда 
												ВОНач = ВОНач + ДолгСодРем;
												ДолгВО = 0;
											КонецЕсли;
										КонецЕсли;
										Если ДолгЭЛ < 0 и ДолгСодРем > 0 Тогда 
											ДолгСодРем = ДолгСодРем + ДолгЭЛ;
											ДолгЭЛ = 0;
											Если ДолгСодРем < 0 Тогда 
												ЭЛНач = ЭЛНач + ДолгСодРем;
												ДолгЭЛ = 0;
											КонецЕсли;
										КонецЕсли;
										БухПоПрошломуПериоду = Истина;
									Иначе	
										СодРемНач = СодРемНач - СтрокаБухСправки[0].СодРемОпл * Коэфф; //Анисимова был -
										ХВНач = ХВНач - СтрокаБухСправки[0].ХВОпл * Коэфф; 
										ГВНач = ГВНач - СтрокаБухСправки[0].ГВОпл * Коэфф; 
										ВОНач = ВОНач - СтрокаБухСправки[0].ВООпл * Коэфф; 
										ЭЛНач = ЭЛНач - СтрокаБухСправки[0].ЭЛОпл * Коэфф;  
										СуммаОплатыТекПериод = СуммаОплатыТекПериод + СтрокаБухСправки[0].СодРемОпл + СтрокаБухСправки[0].ХВОпл
																	+ СтрокаБухСправки[0].ГВОпл + СтрокаБухСправки[0].ВООпл + СтрокаБухСправки[0].ЭЛОпл;
									КОнецЕсли;
								КонецЕсли;
								
							Иначе // если Период оплаты попадает в период по исп листам или по периодам не попавшим в справку
								//Если СтрокаОплаты.ПериодОплаты >= ПериодОбразованияЗадолженностиПо Тогда

								Если ((СтрокаОплаты.ПериодОплаты < ПериодОбразованияЗадолженностиПо или
									(СтрокаОплаты.ЭтоИсполнительныйЛист И СтрокаОплаты.ДатаИсполнительногоЛистаОт < ПериодОбразованияЗадолженностиПо))
									и НЕ ЭтоБухСправка) 
									или (ЭтоБухСправка и БухПоПрошломуПериоду)Тогда
									ВыводСодРем = СтрокаОплаты.СодРемОпл * Коэфф;//ВыводСодРем + ?(ЭтоПерваяСтрока, Окр(ОбластьТаблица.Параметры.ОплатаТекПериодСодРем + СтрокаОплаты.СодРемОпл, 2), СтрокаОплаты.СодРемОпл); 
									СуммаСодРем = ВыводСодРем;//?(ВыводСодРем < 0, 0, ВыводСодРем );//, СтрокаОплаты.СодРемОпл  );
									
									//ВыводСодРем = ?(ВыводСодРем < 0, ВыводСодРем, 0);
									//ВыводГВ = ?(ВыводГВ < 0, ВыводГВ, 0);
									//ВыводХВ = ?(ВыводХВ < 0, ВыводХВ, 0);
									//ВыводВО = ?(ВыводВО < 0, ВыводВО, 0);
									//ВыводЭЛ = ?(ВыводЭЛ < 0, ВыводЭЛ, 0);
									//++АнисимоваМВ_07.11_2023_1бит    
									Если ДолгСодРем<0 Тогда  
										 ДолгСодРем = 0;
									//--АнисимоваМВ_07.11_2023_1бит
									ИначеЕсли НЕ ЭтоБухСправка Тогда
										ДолгСодРем = ДолгСодРем - СуммаСодРем;
									КОнецЕсли;
									//содрем
									ЗаполнениеОБластиУслугиОДНПоПрошломуПериоду(Истина, СтрокаОплаты, ДолгСодРем, СуммаСодРем, ЭтоПерваяСтрока, ОбластьТаблица.Параметры.ОплатаТекПериодСодРем, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодСодРем, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоБухСправка, БухПоПрошломуПериоду, ДолгГВ, ДолгХВ , ДолгВО , ДолгЭЛ);
									//ОДН
									ВыводГВ =  СтрокаОплаты.ГВОпл * Коэфф;//?(ЭтоПерваяСтрока, Окр(ОбластьТаблица.Параметры.ОплатаТекПериодГВ + СтрокаОплаты.ГВОпл, 2), СтрокаОплаты.ГВОпл);
									ВыводХВ =  СтрокаОплаты.ХВОпл * Коэфф;//?(ЭтоПерваяСтрока, Окр(ОбластьТаблица.Параметры.ОплатаТекПериодХВ + СтрокаОплаты.ХВОпл, 2), СтрокаОплаты.ХВОпл);
									ВыводВО =  СтрокаОплаты.ВООпл * Коэфф;//?(ЭтоПерваяСтрока, Окр(ОбластьТаблица.Параметры.ОплатаТекПериодВО + СтрокаОплаты.ВООпл, 2), СтрокаОплаты.ВООпл);
									ВыводЭЛ =  СтрокаОплаты.ЭЛОпл * Коэфф;//?(ЭтоПерваяСтрока, Окр(ОбластьТаблица.Параметры.ОплатаТекПериодЭЛ + СтрокаОплаты.ЭЛОпл, 2), СтрокаОплаты.ЭЛОпл);
									СуммаГВ = ВыводГВ;//?(ВыводГВ < 0, 0, ВыводГВ );
									СуммаХВ = ВыводХВ;//?(ВыводХВ < 0, 0, ВыводХВ );
									СуммаВО = ВыводВО;//?(ВыводВО < 0, 0, ВыводВО );
									СуммаЭЛ = ВыводЭЛ;//?(ВыводЭЛ < 0, 0, ВыводЭЛ );
									Если НЕ ЭтоБухСправка Тогда
										ДолгГВ = ДолгГВ - СуммаГВ;
										ДолгХВ = ДолгХВ - СуммаХВ;
										ДолгВО = ДолгВО - СуммаВО;
										ДолгЭЛ = ДолгЭЛ - СуммаЭЛ;
									КОнецЕсли;
									//гв
									Если СуммаГВ <> 0 Тогда
										ЗаполнениеОБластиУслугиОДНПоПрошломуПериоду(Ложь, СтрокаОплаты, ДолгГВ, СуммаГВ, ЭтоПерваяСтрока, ОбластьТаблица.Параметры.ОплатаТекПериодГВ, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодГВ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоБухСправка, БухПоПрошломуПериоду);
									КонецЕсли;	
									//хв
									Если СуммаХВ <> 0 Тогда
										ЗаполнениеОБластиУслугиОДНПоПрошломуПериоду(Ложь, СтрокаОплаты, ДолгХВ, СуммаХВ, ЭтоПерваяСтрока, ОбластьТаблица.Параметры.ОплатаТекПериодХВ, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодХВ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоБухСправка, БухПоПрошломуПериоду);
									КонецЕсли;	
									//во
									Если СуммаВО <> 0 Тогда
										ЗаполнениеОБластиУслугиОДНПоПрошломуПериоду(Ложь, СтрокаОплаты, ДолгВО, СуммаВО, ЭтоПерваяСтрока, ОбластьТаблица.Параметры.ОплатаТекПериодВО, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодВО, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоБухСправка, БухПоПрошломуПериоду);
									КонецЕсли;	
									//эл
									Если СуммаЭЛ <> 0 Тогда
										ЗаполнениеОБластиУслугиОДНПоПрошломуПериоду(Ложь, СтрокаОплаты, ДолгЭЛ, СуммаЭЛ, ЭтоПерваяСтрока, ОбластьТаблица.Параметры.ОплатаТекПериодЭЛ, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодЭЛ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоБухСправка, БухПоПрошломуПериоду);
									КонецЕсли;									
									ОбластьТаблица.Параметры.ДатаОплаты	=  ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ДатаОплаты) + Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
									//++bit_AnisimovaMV_23.10.2023   
									ОбластьТаблица.Параметры.ПериодОплатыОмск	=  ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ПериодОплатыОмск) + Формат(СтрокаОплаты.ПериодОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
                                    	
									//--bit_AnisimovaMV_23.10.2023
									ЭтоПерваяСтрока = Ложь;
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////									
								иначе
									СуммаСодРем = СтрокаОплаты.СодРемОпл * Коэфф;//?(ЭтоПерваяСтрока, Окр(ОбластьТаблица.Параметры.ОплатаТекПериодСодРем + СтрокаОплаты.СодРемОпл, 2), СтрокаОплаты.СодРемОпл);
									//++bit_AnisimovaMV_13.11.2023 Меняем начислления по периоду оплаты Омск     
									Если СтрокаОплаты.ПериодОплаты = Ключ Тогда 
										СодРемНач = СодРемНач - СуммаСодРем;
									Иначе 
										СтрокаПоПериоду = ДанныеСправки.Получить(СтрокаОплаты.ПериодОплаты);
										НачИОплатаТек = СтрокаПоПериоду[1];     
										ДанныеРазовыеТек = СтрокаПоПериоду[3];     
										Начисления = НачИОплатаТек.Найти(Дата(1900,1,1),"ДатаОплаты");             
										СодРемНачТек = Начисления.СодРемНач;  
										СодРемНачТек = СодРемНачТек - СуммаСодРем;
										ГВНачТек = Начисления.ГВНач;
										ХВНачТек = Начисления.ХВНач;
										ВОНачТек = Начисления.ВОНач;
										ЭЛНачТек = Начисления.ЭЛНач;
									КонецЕсли;
									//--bit_AnisimovaMV_13.11.2023  	
									  
									
									Если ЭтоБухСправка Тогда
										СальдоОДН = ПолучитьНачальноеСальдо(ЛицевойСчет, Ключ);
										ДолженПоОДН = ?((СальдоОДН[0].ГВ + СальдоОДН[0].ХВ + СальдоОДН[0].ВО + СальдоОДН[0].ЭЭ) > 0, Истина , Ложь);
									Иначе
										ДолженПоОДН = Ложь;
									КонецЕсли;
									//содрем          
									//++bit_AnisimovaMV_13.11.2023 Меняем начислления по периоду оплаты Омск     
									ЗаполнениеОБластиУслугиОДНПоТекПериоду(Истина, СтрокаОплаты, СуммаСодРем,
																			?(СтрокаОплаты.ПериодОплаты = Ключ, СодРемНач, СодРемНачТек), ДолгСодРем, ОбластьТаблица.Параметры.ОплатаТекПериодСодРем, 
																			ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодСодРем, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, 
																			ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо, ЛицевойСчет,
																			?(СтрокаОплаты.ПериодОплаты = Ключ, Ключ, СтрокаОплаты.ПериодОплаты),
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ДанныеРазовые, ДанныеРазовыеТек), 
																			Коэфф, 
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ГВнач, ГВНачТек),  
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ХВНач, ХВНачТек),   
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ВОНач, ВОНачТек),
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ЭЛНач, ЭЛНачТек),
																			ДолженПоОДН,
																			ДолгГВ, ДолгХВ, ДолгВО, ДолгЭЛ, ОбластьТаблица);     
									//--bit_AnisimovaMV_13.11.2023  	
									СуммаГВ = СтрокаОплаты.ГВОпл * Коэфф;
									СуммаХВ = СтрокаОплаты.ХВОпл * Коэфф;
									СуммаВО = СтрокаОплаты.ВООпл * Коэфф;
									СуммаЭЛ = СтрокаОплаты.ЭЛОпл * Коэфф;
									ГВНач = ?(СтрокаОплаты.ПериодОплаты = Ключ, ГВнач, ГВНачТек) - СуммаГВ;
									ХВНач = ?(СтрокаОплаты.ПериодОплаты = Ключ, ХВНач, ХВНачТек) - СуммаХВ;
									ВОНач = ?(СтрокаОплаты.ПериодОплаты = Ключ, ВОНач, ВОНачТек) - СуммаВО;
									ЭЛНач = ?(СтрокаОплаты.ПериодОплаты = Ключ, ЭЛНач, ЭЛНачТек) - СуммаЭЛ;
									////гв
									//ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаГВ, ГВНач, ДолгГВ, ОбластьТаблица.Параметры.ОплатаТекПериодГВ, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодГВ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);
									////хв
									//ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаХВ, ХВНач, ДолгХВ, ОбластьТаблица.Параметры.ОплатаТекПериодХВ, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодХВ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);
									////во
									//ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаВО, ВОНач, ДолгВО, ОбластьТаблица.Параметры.ОплатаТекПериодВО, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодВО, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);
									////эл
									//ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаЭЛ, ЭЛНач, ДолгЭЛ, ОбластьТаблица.Параметры.ОплатаТекПериодЭЛ, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодЭЛ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);
									//++bit_AnisimovaMV_13.11.2023 Меняем начислления по периоду оплаты Омск     
									ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаГВ,
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ГВнач, ГВНачТек), ДолгГВ, ОбластьТаблица.Параметры.ОплатаТекПериодГВ, 
																			ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодГВ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, 
																			ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);     
									ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаХВ,
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ХВНач, ХВНачТек), ДолгХВ, ОбластьТаблица.Параметры.ОплатаТекПериодХВ, 
																			ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодХВ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, 
																			ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);     
									ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаВО,
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ВОнач, ВОНачТек), ДолгВО, ОбластьТаблица.Параметры.ОплатаТекПериодВО, 
																			ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодВО, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, 
																			ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);     
 
									ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты, СуммаЭЛ,
																			?(СтрокаОплаты.ПериодОплаты = Ключ, ЭЛнач, ЭЛНачТек), ДолгЭЛ, ОбластьТаблица.Параметры.ОплатаТекПериодЭЛ, 
																			ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодЭЛ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, 
																			ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);     
									//--bit_AnisimovaMV_13.11.2023  	
																		
									
									ОбластьТаблица.Параметры.ДатаОплаты	= ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ДатаОплаты) + Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
									//++bit_AnisimovaMV_23.10.2023      
									ОбластьТаблица.Параметры.ПериодОплатыОмск	=  ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ПериодОплатыОмск) + Формат(СтрокаОплаты.ПериодОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
									//--bit_AnisimovaMV_23.10.2023
									ЭтоПерваяСтрока = Ложь;
								КонецЕсли;
							КонецЕсли;
#КонецОбласти
						Иначе
#Область ОстальныеУслуги
							Если ЭтоСтрокаНачислений Тогда
								УслугаНач = 0;
								ЗаполнитьНачисленияПоУслуге(ОбластьТаблица, ДанныеПоЛС, ДанныеРазовые, СтрокаОплаты, Услуга, Площадь, СуммаПерерасчеты, СуммаНачислено, УслугаНач, Коэфф); 
							Иначе
								Если ЭтоБухСправка = Неопределено ТОгда 
									ЭтоБухСправка = Ложь;
								КонецЕсли;
								Если БухПоПрошломуПериоду = Неопределено ТОгда 
									БухПоПрошломуПериоду = Ложь;
								КонецЕсли;
								Если (СтрокаОплаты.ПериодОплаты < ПериодОбразованияЗадолженностиПо  
											Или (СтрокаОплаты.ЭтоИсполнительныйЛист И СтрокаОплаты.ДатаИсполнительногоЛистаОт < ПериодОбразованияЗадолженностиПо))
											и НЕ ЭтоБухСправка или (ЭтоБухСправка и БухПоПрошломуПериоду)  Тогда
									СуммаУслуга = ПолучитьСуммуОплатыПоуслуге(СтрокаОплаты, Услуга) * Коэфф;
									ДолгУслуга = ДолгУслуга - СуммаУслуга;
									
									ЗаполнениеОБластиУслугиОДНПоПрошломуПериоду(Ложь, СтрокаОплаты, ДолгУслуга, СуммаУслуга, ЭтоПерваяСтрока, ОбластьТаблица.Параметры.ОплатаТекПериод, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериод, СуммаОплатыТекПериод, 	СуммаОплатыПрошлыйПериод, Ложь, Ложь);
									ОбластьТаблица.Параметры.ДатаОплаты	= ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ДатаОплаты) + Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
									//++bit_AnisimovaMV_23.10.2023      
									ОбластьТаблица.Параметры.ПериодОплатыОмск	=  ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ПериодОплатыОмск) + Формат(СтрокаОплаты.ПериодОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
									//--bit_AnisimovaMV_23.10.2023
									ЭтоПерваяСтрока = Ложь;

								иначе
									СуммаУслуга =  ПолучитьСуммуОплатыПоуслуге(СтрокаОплаты, Услуга) * Коэфф;
									
									//++bit_AnisimovaMV_23.10.2023    
									Если СтрокаОплаты.ПериодОплаты >= ПериодОбразованияЗадолженностиПо  Тогда
									   УслугаНач = 0;
									Иначе
										УслугаНач = УслугаНач - СуммаУслуга;    
									КонецЕсли;
									//УслугаНач = УслугаНач - СуммаУслуга;
									//--bit_AnisimovaMV_23.10.2023    
									
									ЗаполнениеОБластиУслугиОДНПоТекПериоду(Ложь, СтрокаОплаты,СуммаУслуга, УслугаНач, ДолгУслуга, ОбластьТаблица.Параметры.ОплатаТекПериод, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериод, СуммаОплатыТекПериод, 	СуммаОплатыПрошлыйПериод, ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо);
									ОбластьТаблица.Параметры.ДатаОплаты	= ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ДатаОплаты) + Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
									//++bit_AnisimovaMV_23.10.2023      
									ОбластьТаблица.Параметры.ПериодОплатыОмск	=  ?(ЭтоПерваяСтрока, "", ОбластьТаблица.Параметры.ПериодОплатыОмск) + Формат(СтрокаОплаты.ПериодОплаты, "ДФ=dd.MM.yyyy") + Символы.ПС;
									//--bit_AnisimovaMV_23.10.2023
									
									ЭтоПерваяСтрока = Ложь;
								КонецЕсли;
							КонецЕсли;
#КонецОбласти
						КонецЕсли;
						//Счетчик = Счетчик + 1;
					КонецЦикла;
					//итоги за месяц
					Если ЭтоОДН Тогда
						ОбластьТаблица.Параметры.СуммаНачислено				= Формат(СуммаНачислено, "ЧДЦ=2; ЧН=");
						ОбластьТаблица.Параметры.СуммаОплатыПрошлыйПериод	= Формат(СуммаОплатыПрошлыйПериод, "ЧДЦ=2; ЧН=");
						ОбластьТаблица.Параметры.СуммаПерерасчеты			= Формат(СуммаПерерасчеты, "ЧДЦ=2; ЧН=");
						ОбластьТаблица.Параметры.СуммаОплатыТекПериод		= Формат(СуммаОплатыТекПериод, "ЧДЦ=2; ЧН=");
					КонецЕсли;
					Если СуммаОплатыТекПериод = 0 Тогда
						//ОбластьТаблица.Параметры.ОплатаТекПериодЭЛ = "";
						//ОбластьТаблица.Параметры.ОплатаТекПериодГВ = "";
						//ОбластьТаблица.Параметры.ОплатаТекПериодХВ = "";
						//ОбластьТаблица.Параметры.ОплатаТекПериодВО = "";
						//ОбластьТаблица.Параметры.ОплатаТекПериодСодРем = "";
					КонецЕсли;
					ИтогоНачислено = ИтогоНачислено + СуммаНачислено;
					ИтогоПерерасчеты = ИтогоПерерасчеты + СуммаПерерасчеты;
					ИтогоОплатаТекПериод = ИтогоОплатаТекПериод + СуммаОплатыТекПериод;
					ИтогоОплатаПрошлыйПериод = ИтогоОплатаПрошлыйПериод + СуммаОплатыПрошлыйПериод;
					ТабДок.Вывести(ОбластьТаблица);
				КонецЦикла;
#КонецОбласти				
////////////////////////////////////////////////////////////////////////////////       
				//++bit_AnisimovaMV_23.10.2023 
				//Если ЭтоОдн Тогда 
				// 	ПереплатаНаНачалоПериода = ?(ДолгЗаПрошлыйПериод<0, ДолгЗаПрошлыйПериод, 0);  
				//Иначе        
				// 	ПереплатаНаНачалоПериода = ?(ДолгУслугаЗаПрошлыйПериод<0, ДолгУслугаЗаПрошлыйПериод, 0);  
				//КонецЕсли;
				//--bit_AnisimovaMV_23.10.2023	

				ОбластьИтогиТаблица= Макет.ПолучитьОбласть("ИтогиТаблица|Основная");
				ОбластьИтогиТаблица.Параметры.СуммаНачислено			= Формат(ИтогоНачислено, "ЧДЦ=2; ЧН=");
				ОбластьИтогиТаблица.Параметры.СуммаПерерасчеты			= Формат(ИтогоПерерасчеты, "ЧДЦ=2; ЧН=");
				ОбластьИтогиТаблица.Параметры.СуммаОплатыПрошлыйПериод	= Формат(ИтогоОплатаПрошлыйПериод, "ЧДЦ=2; ЧН=");
				ОбластьИтогиТаблица.Параметры.СуммаОплатыТекПериод		= Формат(ИтогоОплатаТекПериод, "ЧДЦ=2; ЧН=");
				ТабДок.Вывести(ОбластьИтогиТаблица);
				//++Анисимова 10.11.2023 1бит_ Добавлено условие для вывода итога, если переплата за прошлый период возникла в периоде отбора
				//Если ДолгЗаПрошлыйПериод <> 0 Или ДолгУслугаЗаПрошлыйПериод > 0 Тогда 
				Если ДолгЗаПрошлыйПериод <> 0 Или ДолгУслугаЗаПрошлыйПериод > 0 Или ИтогоОплатаПрошлыйПериод <> 0 Тогда 
				//--Анисимова 10.11.2023 1бит_ Добавлено условие для вывода итога, если переплата за прошлый период возникла в периоде отбора
					ОбластьИтогиПрошПериод = Макет.ПолучитьОбласть("ИтогиПрошПериод|Основная");
					ОбластьИтогиПрошПериод.Параметры.ЗадолженностьНаНачалоСправки	= Формат(?(ЭтоОдн, ДолгЗаПрошлыйПериод, ДолгУслугаЗаПрошлыйПериод), "ЧДЦ=2; ЧН=");
					ОбластьИтогиПрошПериод.Параметры.СуммаОплатыПрошлыйПериод		= Формат(ИтогоОплатаПрошлыйПериод, "ЧДЦ=2; ЧН=");
					ОбластьИтогиПрошПериод.Параметры.ДолгЗаПрошлыйПериод			= Формат(?(ЭтоОдн, ДолгЗаПрошлыйПериод, ДолгУслугаЗаПрошлыйПериод) - ИтогоОплатаПрошлыйПериод, "ЧДЦ=2; ЧН=");
					ТабДок.Вывести(ОбластьИтогиПрошПериод);
				КонецЕсли;
				
				ОбластьИтогиТекПериод = Макет.ПолучитьОбласть("ИтогиТекПериод|Основная");
				ОбластьИтогиТекПериод.Параметры.СуммаНачислено			= Формат(ИтогоНачислено + ИтогоПерерасчеты, "ЧДЦ=2; ЧН=");
				ОбластьИтогиТекПериод.Параметры.СуммаОплатыТекПериод	= Формат(ИтогоОплатаТекПериод, "ЧДЦ=2; ЧН=");     
				//++bit_AnisimovaMV_23.10.2023         
				ОбластьИтогиТекПериод.Параметры.ДолгТекПериод			= Формат(ИтогоНачислено + ИтогоПерерасчеты - ИтогоОплатаТекПериод + ПереплатаНаНачалоПериода, "ЧДЦ=2; ЧН=");
				//ОбластьИтогиТекПериод.Параметры.ДолгТекПериод			= Формат(ИтогоНачислено + ИтогоПерерасчеты - ИтогоОплатаТекПериод, "ЧДЦ=2; ЧН=");
				//--bit_AnisimovaMV_23.10.2023
				ТабДок.Вывести(ОбластьИтогиТекПериод);
					
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Процедура ЗаполнитьОблатьТаблица(ОбластьТаблица, СтрокаПерерасчеты, СтрокаСуммаОплатыПрошлыйПериод, СтрокаСуммаОплатыТекПериод, СтрокаДатаОплаты, СтрокаПериодОплаты )
	ОбластьТаблица.Параметры.Перерасчеты = Строка(ОбластьТаблица.Параметры.Перерасчеты) + СтрокаПерерасчеты + Символы.ПС;
							
	ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериод = Строка(ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериод) +  ?(ЗначениеЗаполнено(СокрЛП(СтрокаСуммаОплатыПрошлыйПериод)), СтрокаСуммаОплатыПрошлыйПериод, "0,00") + Символы.ПС;
	ОбластьТаблица.Параметры.ОплатаТекПериод = Строка(ОбластьТаблица.Параметры.ОплатаТекПериод) + ?(ЗначениеЗаполнено(СокрЛП(СтрокаСуммаОплатыТекПериод)), СтрокаСуммаОплатыТекПериод, "0,00") + Символы.ПС;
	ОбластьТаблица.Параметры.ДатаОплаты = Строка(ОбластьТаблица.Параметры.ДатаОплаты) + СтрокаДатаОплаты + Символы.ПС; 
	//++bit_AnisimovaMV_23.10.2023      
	ОбластьТаблица.Параметры.ПериодОплатыОмск	=  Строка(ОбластьТаблица.Параметры.ПериодОплатыОмск) + СтрокаПериодОплаты + Символы.ПС;
	//--bit_AnisimovaMV_23.10.2023
КонецПроцедуры

Функция ПолучитьДанныеРазовых(НачалоПериодаРасчета, КонецПериодаРасчета, ЛицевойСчет, УслугаЖКХ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			ЛицевойСчет = &ЛицевойСчет
		|				И УслугаЖКХ В (&УслугаЖКХ)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("УслугаЖКХ", ГруппаУслуг(УслугаЖКХ));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции

Функция ПолучитьМассивСортировки(ДанныеСправки)
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Ключ");
	ТаблицаЗначений.Колонки.Добавить("Дата");
	Для каждого СтрокаДанных Из ДанныеСправки Цикл
		Стр = ТаблицаЗначений.Добавить();
		Стр.Ключ = СтрокаДанных.Ключ;
		Стр.Дата = СтрокаДанных.Ключ;
	КонецЦикла;
	
	ТаблицаЗначений.Сортировать("Дата");
	ТаблицаЗначений.Свернуть("Ключ");
	
	Массив = ТаблицаЗначений.ВыгрузитьКолонку("Ключ");
	
	Возврат Массив;
КонецФункции

Функция ПолучитьДанныеДляСправки(ПериодОбразованияЗадолженностиОт, ПериодОбразованияЗадолженностиПо, КонецПериодаРасчета, ЛицевойСчет, Услуга)
	
	ДатаНачалоРасчетаСправки = НачалоДня(ПериодОбразованияЗадолженностиПо);
	НачалоПериодаОбразованияЗадолженности = НачалоДня(ПериодОбразованияЗадолженностиОт);

	НежилоеПомещение = Справочники.бит_ТипыКвартиры.НайтиПоКоду("000000000003");
	МакетКв = Справочники.бит_ВариантыСчетовИзвещений.бит_Основная2023;
	ВидОплаты = Справочники.лб_ВидыОплат.НайтиПоКоду("000000032");//бухгалтерская справка
	
	ПериодРасчета = ДатаНачалоРасчетаСправки;
	ДанныеСправки = Новый Соответствие;
	Пока ПериодРасчета <= КонецМесяца(КонецПериодаРасчета) Цикл 
		
		ДатаНачала = НачалоМесяца(ПериодРасчета);
		ДатаОкончания = КонецМесяца(ПериодРасчета);//?(КонецМесяца(ПериодРасчета) > ТекущаяДата(), ТекущаяДата(), КонецМесяца(ПериодРасчета));
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НежилоеПомещение", НежилоеПомещение);
		Запрос.УстановитьПараметр("Период", ПериодРасчета);//Дата("20230301"));//ПериодРасчета);
		Запрос.УстановитьПараметр("ШаблонКвитанции", МакетКв);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СписокЛС", ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокЗданий", ЛицевойСчет.Здание);
		Если ПериодРасчета >= Дата("20230201") и Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000001")  Тогда
			
			Запрос.Текст = ТекстЗапросаДанныеПоЛСПосле("", "", "");
		Иначе
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
			Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Здание);
			Запрос.УстановитьПараметр("Квартира", ЛицевойСчет.Квартира);
			Запрос.УстановитьПараметр("Услуга", ГруппаУслуг(Услуга));
			Запрос.УстановитьПараметр("Период", ДатаНачала);
			УстановитьПараметрыУслуг(Запрос);
			Запрос.Текст = ТекстЗапросаДанныеПоЛСДо();
		КонецЕсли;
		ДанныеЛС = Запрос.Выполнить().Выгрузить();
		Если ДанныеЛС.Количество() = 0 Тогда
			//ПериодРасчета = КонецМесяца(КонецПериодаРасчета) + 1;
			ДанныеЛС = ПолучитьПустуюТаблицуДанныхПоЛС(ЛицевойСчет);
			
		КонецЕсли;
		//
		Ключ = ДатаНачала;
		
		ЗапросНачисленоОплачено = Новый Запрос;
		ЗапросНачисленоОплачено.Текст = ТекстЗапросаНачисленияПоЛС();
		ЗапросНачисленоОплачено.УстановитьПараметр("Услуга",  ГруппаУслуг(Услуга));
		ЗапросНачисленоОплачено.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
		ЗапросНачисленоОплачено.УстановитьПараметр("ДатаНачала", ДатаНачала);
		ЗапросНачисленоОплачено.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		ЗапросНачисленоОплачено.УстановитьПараметр("ВидОплаты", ВидОплаты);
		ЗапросНачисленоОплачено.УстановитьПараметр("ДатаПроизв", Дата("19000101"));
		ЗапросНачисленоОплачено.УстановитьПараметр("ИсполнительныйЛист", Справочники.лб_ВидыОплат.НайтиПоНаименованию("Исполнительные листы"));
		УстановитьПараметрыУслуг(ЗапросНачисленоОплачено);
		ДанныеНачисленоОплачено	= ЗапросНачисленоОплачено.Выполнить().Выгрузить();
		//СуммаОплачено СуммаНачислено УслугаЖКХ ЛицевойСчет ПериодОплаты/Начисления
		ЗапросНачисленоОсновная = Новый Запрос;
		ЗапросНачисленоОсновная.УстановитьПараметр("Период", ДатаНачала);
		ЗапросНачисленоОсновная.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		ЗапросНачисленоОсновная.УстановитьПараметр("Здание", ЛицевойСчет.Здание);
		ЗапросНачисленоОсновная.УстановитьПараметр("РежимПотребления", ДанныеЛС[0].РежимПотребления);
		ЗапросНачисленоОсновная.УстановитьПараметр("СтатусКвартиры", ДанныеЛС[0].СтатусКвартиры);
		ЗапросНачисленоОсновная.УстановитьПараметр("ТипКвартиры", ДанныеЛС[0].ТипКвартиры);
		//ТарифХВ = ВыборкаЛС.СтоимостьКубаХВ;	
		ЗапросНачисленоОсновная.Текст = ТекстЗапросаНачисленияОсновная();
		
		ТаблицаНачисления = ЗапросНачисленоОсновная.Выполнить().Выгрузить();
		
		ТаблицаРазовые = ПолучитьДанныеРазовых(ДатаНачала, ДатаОкончания, ЛицевойСчет, Услуга);
		
		МассивДанных = Новый Массив;
		Если НЕ ДанныеНачисленоОплачено.Количество() = 0 Тогда
			МассивДанных.Вставить(0, ДанныеЛС[0]); 
			МассивДанных.Вставить(1, ДанныеНачисленоОплачено);
			МассивДанных.Вставить(2, ТаблицаНачисления);
			МассивДанных.Вставить(3, ТаблицаРазовые);
			ДанныеСправки.Вставить(Ключ, МассивДанных);
		КонецЕсли;
		ПериодРасчета = ДобавитьМесяц(ПериодРасчета, 1);
	КонецЦикла;
	
	Возврат ДанныеСправки;
	
КонецФункции

Процедура ДобавитьДанныеВСтрокуТЧ(Таб, ВыборкаПериод, ПериодКлюч , ПериодОбразованияЗадолженностиПо)
	
	Строка = Таб.Добавить();
	
	Строка.Период = Формат(ПериодКлюч, "ДФ=ММММ.гггг");
	Строка.СуммаНачислено = ВыборкаПериод.СуммаНачислено;
	Строка.ДатаОплаты = НачалоДня(ВыборкаПериод.ДатаОплатыНачисления);
	Строка.ПериодКлюч = НачалоДня(ПериодКлюч);
	
	Если ВыборкаПериод.ПериодВзаиморасчетов  < ПериодОбразованияЗадолженностиПо Тогда
		Строка.СуммаОплатыПрошлыйПериод = ВыборкаПериод.СуммаОплачено; 
		Строка.СуммаОплатыТекПериод = 0;
	Иначе 
		Строка.СуммаОплатыПрошлыйПериод = 0; 
		Строка.СуммаОплатыТекПериод = ВыборкаПериод.СуммаОплачено;
	КонецЕсли;
	
	Если Строка.СуммаОплатыПрошлыйПериод > 0 Тогда
		Строка.ПериодВзаиморасчетов = НачалоДня(КонецМесяца(Строка.ДатаОплаты));
	Иначе
		Строка.ПериодВзаиморасчетов = НачалоДня(ВыборкаПериод.ПериодВзаиморасчетов);
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция ПолучитьЗадолженностьНаНачалоСправки(ПериодОбразованияЗадолженностиПо, ЛицевойСчет, Услуга)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК СуммаОстаток,
		|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
		|			&ДатаЗадолженности,
		|			ЛицевойСчет = &лс
		|				И УслугаЖКХ В (&УслугаЖКХ)) КАК бит_НачисленияПоУслугамЖКХОстатки";
	
	Запрос.УстановитьПараметр("ДатаЗадолженности", ПериодОбразованияЗадолженностиПо);
	Запрос.УстановитьПараметр("лс", ЛицевойСчет);
	Запрос.УстановитьПараметр("УслугаЖКХ", ГруппаУслуг(Услуга));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивЛС() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	
	Если ОтборЛС и СписокЛС.Количество() > 0 Тогда 
		
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)";
		
		МассивЛС = СписокЛС.ВыгрузитьКолонку("ЛицевойСчет");
		Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
			МассивЛС.Добавить(ЛицевойСчет)
		КонецЕсли;
		Запрос.УстановитьПараметр("ЛицевыеСчета", МассивЛС);
		
	КонецЕсли;
	
	Если ОтборУчасток И СписокУчастков.Количество() > 0 Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Здание.Участок В(&СписокУчастков)";
		
		УчасткиТмп = СписокУчастков.ВыгрузитьКолонку("Участок");
		УчасткиОтбор = Новый Массив;
		Для Каждого Участок Из УчасткиТмп Цикл
			Если СтрДлина(СокрЛП(Участок.Код))> 2 Тогда
				УчасткиОтбор.Добавить(Участок)
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокУчастков", УчасткиОтбор);
		
	КонецЕсли;
	
	Если ОтборЗдание И СписокЗданий.Количество() > 0 Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Здание В(&ЗданиеОтбор)";
		ЗданиеОтбор = СписокЗданий.ВыгрузитьКолонку("Здание");
		
		Запрос.УстановитьПараметр("ЗданиеОтбор", ЗданиеОтбор);
		
	КонецЕсли;
	
	Если Запрос.Текст = "" Тогда
		МассивЛС = Новый Массив;
		МассивЛС.Добавить(ЛицевойСчет);
		Возврат МассивЛС;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи.ВыгрузитьКолонку("ЛицевойСчет");	
	
КонецФункции

Функция ПолучитьЛСПоПолюДокумент(Данные)
	
	МассивЛс = Новый Массив;
	
	Для каждого СтрокаТЧ из Данные Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Документ) Тогда
			МассивЛс.Добавить(СтрокаТЧ.ЛицевойСчет);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЛС;
	
КонецФункции

Функция ПредставлениеЧисла(Число)
	Число = Окр(Число, 2, РежимОкругления.Окр15как10);
	Возврат Строка(?(Число = 0 , "0,00", ?(Число-Цел(Число)= 0 , Строка(Число) + ",00", Строка(Цел(Число)) + "," + ?(Число-Цел(Число)< 0.1, "0" + Строка(МодульЧисла((Число-Цел(Число))*100)), Строка(МодульЧисла((Число-Цел(Число))*100)) ) )));
КонецФункции

Функция ГруппаУслуг(Услуга)
	
	ЗапросУслуги = Новый Запрос;
	ЗапросУслуги.Текст = 
		"ВЫБРАТЬ
		|	бит_УслугиЖКХ.Ссылка КАК Услуга
		|ИЗ
		|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|ГДЕ
		|	бит_УслугиЖКХ.ГруппаУслуги В(&ОбязательныеГруппыУслуг)";
	
	ОбязательныеУслуги = Новый Массив();
	ОбязательныеУслуги.Добавить(Услуга.ГруппаУслуги);
	
	ЗапросУслуги.УстановитьПараметр("ОбязательныеГруппыУслуг", ОбязательныеУслуги);
	РезультатЗапроса = ЗапросУслуги.Выполнить();
	
	Если  НЕ РезультатЗапроса.Пустой() Тогда
		ОтборУслуги = РезультатЗапроса.Выгрузить();
		ОтборУслуги = ОтборУслуги.ВыгрузитьКолонку("Услуга");
		Если Услуга.ГруппаУслуги = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008") Тогда
			//ОтборУслуги.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000009"));
		КонецЕсли;
	Иначе
		ОтборУслуги = Услуга;
	КонецЕсли;
	
	Возврат ОтборУслуги;

КонецФункции

Функция МодульЧисла(Число)
 Возврат ?(Число<0, -Число, Число);
КонецФункции

Функция ОбработкаРезультатов(РезультатЗапроса, ПериодОбразованияЗадолженностиПо)
	
	Таблица = РезультатЗапроса.Выгрузить();
	ВидОплаты = Справочники.лб_ВидыОплат.НайтиПоКоду("000000032");//бухгалтерская справка

	КоличествоСтрок = Таблица.Количество();
	Индекс = 0;
	Пока Индекс < КоличествоСтрок Цикл
		Строка =  Таблица.Получить(Индекс);
		Если НЕ ЗначениеЗаполнено(Строка.ЛицевойСчет) Тогда
			 ИндексПериода = Индекс;
			 Индекс = Индекс + 1;
			 Продолжить;
		 КонецЕсли;
		Если (Строка.СуммаОплачено = 0 и Строка.СуммаНачислено = 0) Тогда
			Таблица.Удалить(Индекс);
			КоличествоСтрок = Таблица.Количество();
			Продолжить;
		КонецЕсли;
		 
		 
		 Если (Строка.ВидОплаты = ВидОплаты ИЛИ Строка.СуммаОплачено < 0)Тогда //бухгалтерская справка
			НомерСтрокиУдалить = Индекс;
			СуммаКорректировки = Строка.СуммаОплачено;
			//Индекс = ДанныеСтрокОплаты.Количество();
			Пока НЕ (СуммаКорректировки = 0 ) Цикл
				Если Не (Индекс - 1) = ИндексПериода Тогда
					ПредыдущаяСтрока = Таблица.Получить(Индекс - 1);
					Если НЕ (ЗначениеЗаполнено(ПредыдущаяСтрока.ВидОплаты)) ТОГДА
						Индекс = Индекс -1;
						Продолжить;
					КонецЕсли;
					ПредыдущаяСтрока.СуммаОплачено = ПредыдущаяСтрока.СуммаОплачено + СуммаКорректировки;
					Если ПредыдущаяСтрока.СуммаОплачено < 0   Тогда
						СуммаКорректировки = ПредыдущаяСтрока.СуммаОплачено;
						ПредыдущаяСтрока.СуммаОплачено = 0;
					Иначе
						СуммаКорректировки = 0;
					КонецЕсли;
					Индекс = Индекс -1;
				Иначе
					СуммаКорректировки = 0;
				КонецЕсли;
			КонецЦикла ;
			Таблица.Удалить(НомерСтрокиУдалить);
		КонецЕсли ;
	    Индекс = Индекс +1;
		КоличествоСтрок = Таблица.Количество();
	КонецЦикла;
	

	Возврат Таблица;	
	
КонецФункции

Функция ПрошелПорогПоДолгу(ЛС, КоличествоМесяцевЗадолженности, ДатаНачалаСправки, Услуга)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаПриход) КАК СуммаНачислено,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Запись,
		|			,
		|			ЛицевойСчет = &ЛС
		|				И УслугаЖКХ В (&Услуга)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	ВТ.СуммаНачислено КАК СуммаНачислено
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
		|			,
		|			ЛицевойСчет = &Лс
		|				И УслугаЖКХ В (&Услуга)) КАК бит_НачисленияПоУслугамЖКХОстатки
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет = ВТ.ЛицевойСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
		|	ВТ.СуммаНачислено";
	
	Запрос.УстановитьПараметр("ЛС", ЛС);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДобавитьМесяц(ДатаНачалаСправки, -3)));
	Запрос.УстановитьПараметр("КонецПериода", НачалоМесяца(ДатаНачалаСправки));
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		//Возврат Ложь;
	КонецЕсли;
	
	//КоличествоМесяцев = Цел((ТекущаяДата() - ДатаНачалаСправки) / 3600/24/30);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	СреднееНачислениеМесяц = ?(ЗначениеЗаполнено(Выборка.СуммаНачислено), Выборка.СуммаНачислено, 0) / 3;//?(КоличествоМесяцев = 0 , 1, КоличествоМесяцев);
	Остаток = ?(ЗначениеЗаполнено(Выборка.СуммаОстаток), Выборка.СуммаОстаток, 0);	
	Если СреднееНачислениеМесяц * КоличествоМесяцевЗадолженности < Остаток Тогда
		Возврат Истина;
	Иначе Возврат ЛОЖЬ;
	КонецЕсли;

	
КонецФункции

Функция ПолучитьДатуНачалаЗадолженности(Лс, Услуга)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период КАК Период,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
		|			,
		|			,
		|			Месяц,
		|			,
		|			ЛицевойСчет = &лс
		|				И УслугаЖКХ В (&Услуга)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("лс", лс);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат НачалоМесяца(Выборка.Период);
	КонецЦикла;
	
	Возврат Дата(1,1,1);
КонецФункции

////////////////////////////////

Функция ТекстЗапросаДанныеПоЛСПосле(ТекстОтборЗдания, ТекстОтборЛС, ДляНежилых) 
	
	Возврат "ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КоличествоПроживающих,
	        |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	        |ПОМЕСТИТЬ ВТ_КоличествоПроживающих
	        |ИЗ
	        |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет В (&СписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	        |ГДЕ
	        |	НЕ бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	        |	бит_ЛицевыеСчета.Здание КАК Здание,
	        |	бит_ЛицевыеСчета.Квартира КАК Квартира,
	        |	бит_СведенияОКвартиреСрезПоследних.лб_НеВыводитьСтрокуДомофон КАК НеВыводитьДомофон,
	        |	лб_ОтветственныеЗаЛицевыеСчета.Ответственный КАК Ответственный,
	        |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК КвартираПредставление,
	        |	бит_ЛицевыеСчета.Организация КАК ОрганизацияСсылка,
	        |	ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 1, 4) + "" "" + ПОДСТРОКА(бит_ЛицевыеСчета.Наименование, 5, 7) КАК НомерЛС,
	        |	бит_ЛицевыеСчета.Наименование КАК ЛСНомер,
	        |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	        |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	        |	бит_СведенияОКвартиреСрезПоследних.лб_НеВыводитьСтрокуДомофон КАК лб_НеВыводитьСтрокуДомофон,
	        |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
	        |	бит_ЛицевыеСчета.ЕЛСГИСЖКХ КАК ЕЛСГИСЖКХ,
	        |	ВТ_КоличествоПроживающих.КоличествоПроживающих КАК КоличествоПроживающих
	        |ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	        |ИЗ
	        |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Период, ) КАК бит_СведенияОКвартиреСрезПоследних
	        |		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ОтветственныеЗаЛицевыеСчета КАК лб_ОтветственныеЗаЛицевыеСчета
	        |		ПО бит_ЛицевыеСчета.Ссылка = лб_ОтветственныеЗаЛицевыеСчета.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоПроживающих КАК ВТ_КоличествоПроживающих
	        |		ПО бит_ЛицевыеСчета.Ссылка = ВТ_КоличествоПроживающих.ЛицевойСчет
	        |ГДЕ
	        |	НЕ бит_ЛицевыеСчета.Архивный
	        |	И бит_ЛицевыеСчета.Ссылка В(&СписокЛС)
	       // |	И бит_СведенияОКвартиреСрезПоследних.ТипКвартиры <> &НежилоеПомещение
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ХВ_М, 0) КАК ОДН_ХВ_М,
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ХВ_Р, 0) КАК ОДН_ХВ_Р,
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ГВ_М, 0) КАК ОДН_ГВ_М,
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ГВ_Р, 0) КАК ОДН_ГВ_Р,
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ЭЭ_кВт, 0) КАК ОДН_ЭЭ_кВт,
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ЭЭ_Р, 0) КАК ОДН_ЭЭ_Р,
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ВО_М, 0) КАК ОДН_ВО_М,
	        |	ЕСТЬNULL(лб_ОДН_факт.ОДН_ВО_Р, 0) КАК ОДН_ВО_Р,
	        |	лб_ОДН_факт.Адрес КАК Адрес
	        |ПОМЕСТИТЬ ВТ_Факт
	        |ИЗ
	        |	РегистрНакопления.лб_ОДН_факт КАК лб_ОДН_факт
	        |ГДЕ
	        |	НАЧАЛОПЕРИОДА(лб_ОДН_факт.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, -2), МЕСЯЦ)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	лб_НормативыОДНСрезПоследних.Адрес КАК Адрес,
	        |	лб_НормативыОДНСрезПоследних.НормативГВ КАК НормативГВ,
	        |	лб_НормативыОДНСрезПоследних.НормативВО КАК НормативВО,
	        |	лб_НормативыОДНСрезПоследних.НормативЭЭ КАК НормативЭЭ,
	        |	лб_НормативыОДНСрезПоследних.НормативНаПодогрев КАК НормативНаПодогрев,
	        |	лб_НормативыОДНСрезПоследних.МОП КАК МОП,
	        |	лб_НормативыОДНСрезПоследних.Подвал КАК Подвал,
	        |	лб_НормативыОДНСрезПоследних.Чердак КАК Чердак,
	        |	лб_НормативыОДНСрезПоследних.Жилая КАК Жилая,
	        |	лб_НормативыОДНСрезПоследних.Нежилая КАК Нежилая,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВ КАК СтоимостьКубаХВ,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКВтч КАК СтоимостьКВтч,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаВО КАК СтоимостьКубаВО,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьГКалл КАК СтоимостьГКалл,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВнаГВ КАК СтоимостьКубаХВнаГВ,
	        |	лб_НормативыОДНСрезПоследних.НормативХВ КАК НормативХВ
	        |ПОМЕСТИТЬ ВТ_Норматив
	        |ИЗ
	        |	РегистрСведений.лб_НормативыОДН.СрезПоследних(&Период, ) КАК лб_НормативыОДНСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних.Значение КАК СпособРасчетаОДН,
	        |	бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних.ОбъектУчета КАК ОбъектУчета
	        |ПОМЕСТИТЬ ВТ_СпособРасчетаОДН
	        |ИЗ
	        |	РегистрСведений.бит_ЗначенияСвойствОбъектовУчетаПериодические.СрезПоследних(, ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_НастройиПечатиКвитанции)) КАК бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних.Значение КАК РежимПотребления,
	        |	бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних.ОбъектУчета КАК ОбъектУчета
	        |ПОМЕСТИТЬ ВТ_РежимПотребления
	        |ИЗ
	        |	РегистрСведений.бит_ЗначенияСвойствОбъектовУчетаПериодические.СрезПоследних(, ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_ОсновнойРежимПотребления)) КАК бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	лб_Тест_Дома.ADR КАК ЗданиеПредставление,
	        |	бит_ТехническиеУчастки.ВремяРаботыУчастка КАК ВремяРаботыУчастка,
	        |	бит_ТехническиеУчастки.ТелефоныУчастка КАК ТелефоныУчастка,
	        |	бит_ТехническиеУчастки.АдресПаспортиста КАК АдресПаспортиста,
	        |	бит_ТехническиеУчастки.ВремяРаботыПаспортиста КАК ВремяРаботыПаспортиста,
	        |	бит_ТехническиеУчастки.ТелефоныПаспортиста КАК ТелефоныПаспортиста,
	        |	бит_ТехническиеУчастки.АдресУчастка КАК АдресУчастка,
	        |	бит_ТехническиеУчастки.лб_СоцЗащитаТелефоны КАК СоцТелефон,
	        |	бит_ТехническиеУчастки.лб_СоцЗащитаАдрес КАК СоцАдрес,
	        |	бит_СписокЗданий.бит_ИспользуетсяВознаграждениеПредседателюМКД КАК ВознаграждениеПредседателюМКД,
	        |	бит_СписокЗданий.Ссылка КАК ЗданиеСсылка,
	        |	ВТ_СпособРасчетаОДН.СпособРасчетаОДН КАК СпособРасчетаОДН,
	        |	ВТ_РежимПотребления.РежимПотребления КАК РежимПотребления,
	        |	ВТ_Факт.ОДН_ХВ_М КАК ОДН_ХВ_М,
	        |	ВТ_Факт.ОДН_ХВ_Р КАК ОДН_ХВ_Р,
	        |	ВТ_Факт.ОДН_ГВ_М КАК ОДН_ГВ_М,
	        |	ВТ_Факт.ОДН_ГВ_Р КАК ОДН_ГВ_Р,
	        |	ВТ_Факт.ОДН_ЭЭ_кВт КАК ОДН_ЭЭ_кВт,
	        |	ВТ_Факт.ОДН_ЭЭ_Р КАК ОДН_ЭЭ_Р,
	        |	ВТ_Факт.ОДН_ВО_М КАК ОДН_ВО_М,
	        |	ВТ_Факт.ОДН_ВО_Р КАК ОДН_ВО_Р,
	        |	ВТ_Факт.Адрес КАК Адрес,
	        |	ВТ_Норматив.НормативГВ КАК НормативГВ,
	        |	ВТ_Норматив.НормативВО КАК НормативВО,
	        |	ВТ_Норматив.НормативЭЭ КАК НормативЭЭ,
	        |	ВТ_Норматив.НормативНаПодогрев КАК НормативНаПодогрев,
	        |	ВТ_Норматив.МОП КАК МОП,
	        |	ВТ_Норматив.Подвал КАК Подвал,
	        |	ВТ_Норматив.Чердак КАК Чердак,
	        |	ВТ_Норматив.Жилая КАК Жилая,
	        |	ВТ_Норматив.Нежилая КАК Нежилая,
	        |	ВТ_Норматив.СтоимостьКубаХВ КАК СтоимостьКубаХВ,
	        |	ВТ_Норматив.СтоимостьКВтч КАК СтоимостьКВтч,
	        |	ВТ_Норматив.СтоимостьКубаВО КАК СтоимостьКубаВО,
	        |	ВТ_Норматив.СтоимостьГКалл КАК СтоимостьГКалл,
	        |	ВТ_Норматив.СтоимостьКубаХВнаГВ КАК СтоимостьКубаХВнаГВ,
	        |	ВТ_Норматив.НормативХВ КАК НормативХВ,
	        |	ЕСТЬNULL(бит_НадписьКвитанцииСрезПоследних.ОсновнаяНадпись, бит_НадписьКвитанцииСрезПоследнихПустая.ОсновнаяНадпись) КАК ТекстКвитанции
	        |ПОМЕСТИТЬ ВТ_Здания
	        |ИЗ
	        |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ТехническиеУчастки КАК бит_ТехническиеУчастки
	        |		ПО бит_СписокЗданий.Участок = бит_ТехническиеУчастки.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
	        |		ПО бит_СписокЗданий.Ссылка = лб_Тест_Дома.Здание
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособРасчетаОДН КАК ВТ_СпособРасчетаОДН
	        |		ПО бит_СписокЗданий.Ссылка = ВТ_СпособРасчетаОДН.ОбъектУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РежимПотребления КАК ВТ_РежимПотребления
	        |		ПО бит_СписокЗданий.Ссылка = ВТ_РежимПотребления.ОбъектУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Норматив КАК ВТ_Норматив
	        |		ПО бит_СписокЗданий.Ссылка = ВТ_Норматив.Адрес
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	        |		ПО бит_СписокЗданий.Ссылка = ВТ_Факт.Адрес
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НадписьКвитанции.СрезПоследних(&Период, ШаблонКвитанции = &ШаблонКвитанции) КАК бит_НадписьКвитанцииСрезПоследних
	        |		ПО бит_СписокЗданий.Ссылка = бит_НадписьКвитанцииСрезПоследних.Здание,
	        |	РегистрСведений.бит_НадписьКвитанции.СрезПоследних(
	        |			&Период,
	        |			ШаблонКвитанции = &ШаблонКвитанции
	        |				И Здание = ЗНАЧЕНИЕ(Справочник.бит_СписокЗданий.ПустаяСсылка)) КАК бит_НадписьКвитанцииСрезПоследнихПустая
	        |ГДЕ
	        |	ПОДСТРОКА(бит_ТехническиеУчастки.Код, 3, 1) <> """"
	        |	И бит_СписокЗданий.Ссылка В(&СписокЗданий)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Организации.КПП КАК КПП,
	        |	Организации.ИНН КАК ИНН,
	        |	БанковскиеСчета.Ссылка КАК РасчетныйСчетСсылка,
	        |	БанковскиеСчета.НомерСчета КАК рСчет,
	        |	Банки.Код КАК БИК,
	        |	Банки.Наименование КАК Банк,
	        |	Банки.КоррСчет КАК кСчет,
	        |	Организации.НаименованиеСокращенное КАК Организация,
	        |	ВложенныйЗапрос.ТелефоныОрганизация КАК ТелефоныОрганизация
	        |ПОМЕСТИТЬ ВТ_Организация
	        |ИЗ
	        |	Справочник.Организации КАК Организации
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	        |			ПО БанковскиеСчета.Банк = Банки.Ссылка
	        |		ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
	        |			ОрганизацииКонтактнаяИнформация.Представление КАК ТелефоныОрганизация
	        |		ИЗ
	        |			Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	        |		ГДЕ
	        |			ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)) КАК ВложенныйЗапрос
	        |		ПО Организации.Ссылка = ВложенныйЗапрос.Ссылка
	        |ГДЕ
	        |	Организации.Ссылка = &Организация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВТ_ЛицевыеСчета.Здание КАК Здание,
	        |	ВТ_ЛицевыеСчета.Квартира КАК Квартира,
	        |	ВТ_ЛицевыеСчета.НеВыводитьДомофон КАК НеВыводитьДомофон,
	        |	ВТ_ЛицевыеСчета.Ответственный КАК Ответственный,
	        |	ВТ_ЛицевыеСчета.КвартираПредставление КАК КвартираПредставление,
	        |	ВТ_ЛицевыеСчета.ОрганизацияСсылка КАК ОрганизацияСсылка,
	        |	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	        |	ВТ_ЛицевыеСчета.ЛСНомер КАК ЛСНомер,
	        |	ВТ_ЛицевыеСчета.ОбщаяПлощадь КАК ОбщаяПлощадь,
	        |	ВТ_ЛицевыеСчета.ЖилаяПлощадь КАК ЖилаяПлощадь,
	        |	ВТ_ЛицевыеСчета.лб_НеВыводитьСтрокуДомофон КАК лб_НеВыводитьСтрокуДомофон,
	        |	ВТ_ЛицевыеСчета.ТипКвартиры КАК ТипКвартиры,
	        |	ВТ_ЛицевыеСчета.СтатусКвартиры КАК СтатусКвартиры,
	        |	ВТ_ЛицевыеСчета.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
	        |	ВТ_ЛицевыеСчета.ЕЛСГИСЖКХ КАК ЕЛСГИСЖКХ,
	        |	ВТ_ЛицевыеСчета.КоличествоПроживающих КАК КоличествоПроживающих,
	        |	ВТ_Здания.ЗданиеПредставление КАК ЗданиеПредставление,
	        |	ВТ_Здания.ВремяРаботыУчастка КАК ВремяРаботыУчастка,
	        |	ВТ_Здания.ТелефоныУчастка КАК ТелефоныУчастка,
	        |	ВТ_Здания.АдресПаспортиста КАК АдресПаспортиста,
	        |	ВТ_Здания.ВремяРаботыПаспортиста КАК ВремяРаботыПаспортиста,
	        |	ВТ_Здания.ТелефоныПаспортиста КАК ТелефоныПаспортиста,
	        |	ВТ_Здания.АдресУчастка КАК АдресУчастка,
	        |	ВТ_Здания.СоцТелефон КАК СоцТелефон,
	        |	ВТ_Здания.СоцАдрес КАК СоцАдрес,
	        |	ВТ_Здания.ВознаграждениеПредседателюМКД КАК ВознаграждениеПредседателюМКД,
	        |	ВТ_Здания.СпособРасчетаОДН КАК СпособРасчета,
	        |	ВТ_Здания.РежимПотребления КАК РежимПотребления,
	        |	ВТ_Здания.ЗданиеСсылка КАК ЗданиеСсылка,
	        |	ВТ_Здания.ОДН_ХВ_Р КАК ОДН_ХВ_Р,
	        |	ВТ_Здания.ОДН_ГВ_М КАК ОДН_ГВ_М,
	        |	ВТ_Здания.ОДН_ГВ_Р КАК ОДН_ГВ_Р,
	        |	ВТ_Здания.ОДН_ЭЭ_кВт КАК ОДН_ЭЭ_кВт,
	        |	ВТ_Здания.ОДН_ЭЭ_Р КАК ОДН_ЭЭ_Р,
	        |	ВТ_Здания.ОДН_ВО_М КАК ОДН_ВО_М,
	        |	ВТ_Здания.ОДН_ВО_Р КАК ОДН_ВО_Р,
	        |	ВТ_Здания.Адрес КАК Адрес,
	        |	ВТ_Здания.НормативГВ КАК НормативГВ,
	        |	ВТ_Здания.НормативВО КАК НормативВО,
	        |	ВТ_Здания.НормативЭЭ КАК НормативЭЭ,
	        |	ВТ_Здания.НормативНаПодогрев КАК НормативНаПодогрев,
	        |	ВТ_Здания.МОП КАК МОП,
	        |	ВТ_Здания.Подвал КАК Подвал,
	        |	ВТ_Здания.Чердак КАК Чердак,
	        |	ВТ_Здания.Жилая КАК Жилая,
	        |	ВТ_Здания.Нежилая КАК Нежилая,
	        |	ВТ_Здания.СтоимостьКубаХВ КАК СтоимостьКубаХВ,
	        |	ВТ_Здания.СтоимостьКВтч КАК СтоимостьКВтч,
	        |	ВТ_Здания.СтоимостьКубаВО КАК СтоимостьКубаВО,
	        |	ВТ_Здания.СтоимостьГКалл КАК СтоимостьГКалл,
	        |	ВТ_Здания.СтоимостьКубаХВнаГВ КАК СтоимостьКубаХВнаГВ,
	        |	ВТ_Здания.НормативХВ КАК НормативХВ,
	        |	ВТ_Здания.ОДН_ХВ_М КАК ОДН_ХВ_М,
	        |	ВТ_Здания.ТекстКвитанции КАК ТекстКвитанции
	        |ИЗ
	        |	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Здания КАК ВТ_Здания
	        |		ПО ВТ_ЛицевыеСчета.Здание = ВТ_Здания.ЗданиеСсылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Здание,
	        |	Квартира";
			
КонецФункции

Функция ТекстЗапросаДанныеПоЛСДо()
	Возврат "ВЫБРАТЬ
	        |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ХВ
	        |				ТОГДА бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ТарифХВ,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ГВ
	        |				ТОГДА бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ТарифГВ,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ВО
	        |				ТОГДА бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ТарифВО,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &ЭЛ
	        |				ТОГДА бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ТарифЭЛ,
	        |	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления КАК РежимПотребления,
	        |	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета КАК СпособРасчета,
	        |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	        |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	        |	бит_СведенияОКвартиреСрезПоследних.лб_НеВыводитьСтрокуДомофон КАК лб_НеВыводитьСтрокуДомофон,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВ КАК СтоимостьКубаХВ,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКВтч КАК СтоимостьКВтч,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаВО КАК СтоимостьКубаВО,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьГКалл КАК СтоимостьГКалл,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВнаГВ КАК СтоимостьКубаХВнаГВ,
	        |	лб_НормативыОДНСрезПоследних.НормативХВ КАК НормативХВ,
	        |	лб_НормативыОДНСрезПоследних.НормативГВ КАК НормативГВ,
	        |	лб_НормативыОДНСрезПоследних.НормативВО КАК НормативВО,
	        |	лб_НормативыОДНСрезПоследних.НормативЭЭ КАК НормативЭЭ,
	        |	лб_НормативыОДНСрезПоследних.НормативНаПодогрев КАК НормативНаПодогрев,
	        |	ВЫБОР
	        |		КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &УслугаМинВзнос
	        |			ТОГДА бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ТарифМинВзнос
	        |ИЗ
	        |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	        |			&Период,
	        |			ЛицевойСчет = &ЛицевойСчет
	        |				И Услуга В (&Услуга)) КАК бит_СведенияПоУслугамЛССрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&Период, Услуга В (&Услуга)) КАК бит_СтавкиНаУслугиСрезПоследних
	        |		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	        |			И бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	        |			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	        |			И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Период, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних
	        |		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.лб_НормативыОДН.СрезПоследних(&Период, Адрес = &Здание) КАК лб_НормативыОДНСрезПоследних
	        |		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание = лб_НормативыОДНСрезПоследних.Адрес
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	        |	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления,
	        |	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета,
	        |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	        |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	        |	бит_СведенияОКвартиреСрезПоследних.лб_НеВыводитьСтрокуДомофон,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВ,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКВтч,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаВО,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьГКалл,
	        |	лб_НормативыОДНСрезПоследних.СтоимостьКубаХВнаГВ,
	        |	лб_НормативыОДНСрезПоследних.НормативХВ,
	        |	лб_НормативыОДНСрезПоследних.НормативГВ,
	        |	лб_НормативыОДНСрезПоследних.НормативВО,
	        |	лб_НормативыОДНСрезПоследних.НормативЭЭ,
	        |	лб_НормативыОДНСрезПоследних.НормативНаПодогрев,
	        |	ВЫБОР
	        |		КОГДА бит_СтавкиНаУслугиСрезПоследних.Услуга = &УслугаМинВзнос
	        |			ТОГДА бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка
	        |		ИНАЧЕ 0
	        |	КОНЕЦ";
КонецФункции

Функция ТекстЗапросаНачисленияПоЛС()
	
	Возврат "ВЫБРАТЬ
	        |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор,
	        |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.СуммаДокумента КАК РегистраторСуммаДокумента,
	        |	ВЫБОР
	        |		КОГДА бит_ОплатаКУСписокУслуг.Ссылка ЕСТЬ NULL
	        |				ИЛИ бит_ОплатаКУСписокУслуг.Сумма = 0
	        |			ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход
	        |		ИНАЧЕ бит_ОплатаКУСписокУслуг.Сумма
	        |	КОНЕЦ КАК СуммаПриход,
	        |	ВЫБОР
	        |		КОГДА бит_ОплатаКУСписокУслуг.Ссылка ЕСТЬ NULL
	        |				ИЛИ бит_ОплатаКУСписокУслуг.Сумма = 0
	        |			ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход
	        |		ИНАЧЕ бит_ОплатаКУСписокУслуг.Сумма
	        |	КОНЕЦ КАК СуммаРасход,
	        |	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	        |	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	        |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.Дата КАК РегистраторДата,
	        |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор.Номер КАК РегистраторНомер,
	        |	ВЫБОР
	        |		КОГДА бит_ОплатаКУСписокУслуг.Ссылка ЕСТЬ NULL
	        |				ИЛИ бит_ОплатаКУСписокУслуг.Сумма = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ бит_ОплатаКУСписокУслуг.НомерСтроки
	        |	КОНЕЦ КАК НомерСтрокиВОплатаКУ
	        |ПОМЕСТИТЬ ВТ_Начисления_Оплаты
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	        |			&ДатаНачала,
	        |			&ДатаОкончания,
	        |			Регистратор,
	        |			УслугаЖКХ В (&Услуга)
	        |				И ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
	        |		ПО бит_НачисленияПоУслугамЖКХОбороты.Регистратор = бит_ОплатаКУСписокУслуг.Ссылка
	        |			И бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет = бит_ОплатаКУСписокУслуг.ЛицевойСчет
	        |			И бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ = бит_ОплатаКУСписокУслуг.Услуга
	        |			И (бит_ОплатаКУСписокУслуг.Сумма <> 0)
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	        |				ТОГДА ЛОЖЬ
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Начисления_Оплаты.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВТ_Начисления_Оплаты.УслугаЖКХ КАК УслугаЖКХ,
	        |	ВТ_Начисления_Оплаты.Регистратор КАК Регистратор,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Начисления_Оплаты.НомерСтрокиВОплатаКУ) КАК НомерСтрокиВОплатаКУ
	        |ПОМЕСТИТЬ ВТ_КоличествоСтрокВОплатаКУ
	        |ИЗ
	        |	ВТ_Начисления_Оплаты КАК ВТ_Начисления_Оплаты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Начисления_Оплаты.ЛицевойСчет,
	        |	ВТ_Начисления_Оплаты.УслугаЖКХ,
	        |	ВТ_Начисления_Оплаты.Регистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ПериодыОплатыКУ.Регистратор КАК Регистратор,
	        |	бит_ПериодыОплатыКУ.ДокОплаты КАК ДокОплаты,
	        |	бит_ПериодыОплатыКУ.ЛицевойСчет КАК ЛицевойСчет,
	        |	МАКСИМУМ(бит_ПериодыОплатыКУ.ПериодОплаты) КАК ПериодОплаты
	        |ПОМЕСТИТЬ ВТ_ПериодыОплаты
	        |ИЗ
	        |	ВТ_Начисления_Оплаты КАК ВТ_Начисления_Оплаты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПериодыОплатыКУ КАК бит_ПериодыОплатыКУ
	        |		ПО ВТ_Начисления_Оплаты.Регистратор = бит_ПериодыОплатыКУ.ДокОплаты
	        |			И ВТ_Начисления_Оплаты.ЛицевойСчет = бит_ПериодыОплатыКУ.ЛицевойСчет
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_ПериодыОплатыКУ.ДокОплаты,
	        |	бит_ПериодыОплатыКУ.Регистратор,
	        |	бит_ПериодыОплатыКУ.ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СУММА(ВТ_Начисления_Оплаты.СуммаПриход) КАК СуммаНачислено,
	        |	СУММА(ВТ_Начисления_Оплаты.СуммаРасход) КАК СуммаОплачено,
	        |	ВТ_Начисления_Оплаты.УслугаЖКХ КАК УслугаЖКХ,
	        |	ВТ_Начисления_Оплаты.ЛицевойСчет КАК ЛицевойСчет,
	        |	ЕСТЬNULL(ВТ_ПериодыОплаты.ПериодОплаты, НАЧАЛОПЕРИОДА(ВТ_Начисления_Оплаты.Регистратор.Дата, МЕСЯЦ)) КАК ПериодОплаты,
	        |	ВЫБОР
	        |		КОГДА ВТ_Начисления_Оплаты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	        |				И ВТ_Начисления_Оплаты.Регистратор.лб_ВидОплаты = &ВидОплаты
	        |				И ВТ_Начисления_Оплаты.Регистратор.СуммаДокумента = 0
	        |			ТОГДА КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	        |		КОГДА ВТ_Начисления_Оплаты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	        |			ТОГДА &ДатаПроизв
	        |		ИНАЧЕ ВТ_Начисления_Оплаты.Регистратор.Дата
	        |	КОНЕЦ КАК РегистраторДата,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.СуммаОборот, 0) > 0
	        |				ИЛИ ВТ_Начисления_Оплаты.Регистратор.лб_ВидОплаты.Наименование ПОДОБНО ""%Исполнительные листы%""
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ЭтоИсполнительныйЛист,
	        |	ВТ_Начисления_Оплаты.РегистраторНомер КАК РегистраторНомер,
	        |	ВЫБОР
	        |		КОГДА ВТ_КоличествоСтрокВОплатаКУ.НомерСтрокиВОплатаКУ > 1
	        |			ТОГДА ВТ_Начисления_Оплаты.НомерСтрокиВОплатаКУ
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК НомерСтрокиВОплатаКУ,
	        |	ВЫБОР
	        |		КОГДА НЕ ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист ЕСТЬ NULL
	        |			ТОГДА ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист.ПериодОбразованияЗадолженностиОт
	        |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	        |	КОНЕЦ КАК ДатаИсполнительногоЛистаОт,
	        |	ВЫБОР
	        |		КОГДА НЕ ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист ЕСТЬ NULL
	        |			ТОГДА ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист.ПериодОбразованияЗадолженностиПо
	        |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	        |	КОНЕЦ КАК ДатаИсполнительногоЛистаПо
	        |ПОМЕСТИТЬ ВТ1
	        |ИЗ
	        |	ВТ_Начисления_Оплаты КАК ВТ_Начисления_Оплаты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоИсполнительномуПроизводству.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ВзаиморасчетыПоИсполнительномуПроизводствуОбороты
	        |		ПО ВТ_Начисления_Оплаты.Регистратор = ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.Регистратор
	        |			И ВТ_Начисления_Оплаты.УслугаЖКХ = ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.Услуга
	        |			И ВТ_Начисления_Оплаты.ЛицевойСчет = ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыОплаты КАК ВТ_ПериодыОплаты
	        |		ПО ВТ_Начисления_Оплаты.Регистратор = ВТ_ПериодыОплаты.ДокОплаты
	        |			И ВТ_Начисления_Оплаты.ЛицевойСчет = ВТ_ПериодыОплаты.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСтрокВОплатаКУ КАК ВТ_КоличествоСтрокВОплатаКУ
	        |		ПО ВТ_Начисления_Оплаты.Регистратор = ВТ_КоличествоСтрокВОплатаКУ.Регистратор
	        |			И ВТ_Начисления_Оплаты.ЛицевойСчет = ВТ_КоличествоСтрокВОплатаКУ.ЛицевойСчет
	        |			И ВТ_Начисления_Оплаты.УслугаЖКХ = ВТ_КоличествоСтрокВОплатаКУ.УслугаЖКХ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Начисления_Оплаты.УслугаЖКХ,
	        |	ВТ_Начисления_Оплаты.ЛицевойСчет,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.СуммаОборот, 0) > 0
	        |				ИЛИ ВТ_Начисления_Оплаты.Регистратор.лб_ВидОплаты.Наименование ПОДОБНО ""%Исполнительные листы%""
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ВТ_Начисления_Оплаты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	        |				И ВТ_Начисления_Оплаты.Регистратор.лб_ВидОплаты = &ВидОплаты
	        |				И ВТ_Начисления_Оплаты.Регистратор.СуммаДокумента = 0
	        |			ТОГДА КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	        |		КОГДА ВТ_Начисления_Оплаты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	        |			ТОГДА &ДатаПроизв
	        |		ИНАЧЕ ВТ_Начисления_Оплаты.Регистратор.Дата
	        |	КОНЕЦ,
	        |	ЕСТЬNULL(ВТ_ПериодыОплаты.ПериодОплаты, НАЧАЛОПЕРИОДА(ВТ_Начисления_Оплаты.Регистратор.Дата, МЕСЯЦ)),
	        |	ВТ_Начисления_Оплаты.РегистраторНомер,
	        |	ВЫБОР
	        |		КОГДА ВТ_КоличествоСтрокВОплатаКУ.НомерСтрокиВОплатаКУ > 1
	        |			ТОГДА ВТ_Начисления_Оплаты.НомерСтрокиВОплатаКУ
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА НЕ ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист ЕСТЬ NULL
	        |			ТОГДА ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист.ПериодОбразованияЗадолженностиОт
	        |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА НЕ ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист ЕСТЬ NULL
	        |			ТОГДА ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист.ПериодОбразованияЗадолженностиПо
	        |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	        |	КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ1.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВТ1.ПериодОплаты КАК ПериодОплаты,
	        |	СУММА(ВТ1.СуммаНачислено) КАК СуммаНачислено,
	        |	СУММА(ВТ1.СуммаОплачено) КАК СуммаОплачено,
	        |	ВТ1.РегистраторДата КАК ДатаОплаты,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &СодрежаниеРемонт
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СодРемОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &СодрежаниеРемонт
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СодРемНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ХВ
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ХВНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ХВ
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ХВОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ГВ
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ГВНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ГВ
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ГВОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ВО
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ВОНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ВО
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ВООпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ЭЛ
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ЭЛНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &ЭЛ
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ЭЛОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаМинВзнос
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК МинВзносНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаМинВзнос
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК МинВзносОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаДопВзнос
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ДопВзносНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаДопВзнос
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ДопВзносОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаРФКР
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК РФКРНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаРФКР
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК РФКРОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаАверс
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК АверсНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаАверс
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК АверсОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаПрофи
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ПрофиНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаПрофи
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ПрофиОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаДоп
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ДопНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаДоп
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ДопОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаОДПУ
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ОДПУНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаОДПУ
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ОДПУОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаДомофон
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ДомофонНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаДомофон
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ДомофонОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаОргФКР
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ОргФКРНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаОргФКР
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ОргФКРОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаАванс
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК АвансНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаАванс
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК АвансОпл,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаГазоснабжение
	        |				ТОГДА ВТ1.СуммаНачислено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ГазоснабжениеНач,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ1.УслугаЖКХ = &УслугаГазоснабжение
	        |				ТОГДА ВТ1.СуммаОплачено
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ГазоснабжениеОпл,
	        |	ВТ1.ЭтоИсполнительныйЛист КАК ЭтоИсполнительныйЛист,
	        |	ВТ1.РегистраторНомер КАК РегистраторНомер,
	        |	ВТ1.НомерСтрокиВОплатаКУ КАК НомерСтрокиВОплатаКУ,
	        |	ВТ1.ДатаИсполнительногоЛистаОт КАК ДатаИсполнительногоЛистаОт,
	        |	ВТ1.ДатаИсполнительногоЛистаПо КАК ДатаИсполнительногоЛистаПо
	        |ИЗ
	        |	ВТ1 КАК ВТ1
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ1.ЛицевойСчет,
	        |	ВТ1.ПериодОплаты,
	        |	ВТ1.РегистраторДата,
	        |	ВТ1.ЭтоИсполнительныйЛист,
	        |	ВТ1.РегистраторНомер,
	        |	ВТ1.НомерСтрокиВОплатаКУ,
	        |	ВТ1.ДатаИсполнительногоЛистаОт,
	        |	ВТ1.ДатаИсполнительногоЛистаПо
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаОплаты,
	        |	ПериодОплаты,
	        |	СуммаОплачено"
	
		КонецФункции

Функция ПолучитьПустуюТаблицуДанныхПоЛС(ЛицевойСчет)		
			
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ЛицевойСчет");
	Таблица.Колонки.Добавить("ТарифХВ");
	Таблица.Колонки.Добавить("ТарифГВ");
	Таблица.Колонки.Добавить("ТарифВО");
	Таблица.Колонки.Добавить("ТарифЭЛ");
	Таблица.Колонки.Добавить("РежимПотребления");
	Таблица.Колонки.Добавить("СпособРасчета");
	Таблица.Колонки.Добавить("СтатусКвартиры");
	Таблица.Колонки.Добавить("ТипКвартиры");
	Таблица.Колонки.Добавить("ОбщаяПлощадь");
	Таблица.Колонки.Добавить("ЖилаяПлощадь");
	Таблица.Колонки.Добавить("лб_НеВыводитьСтрокуДомофон");
	Таблица.Колонки.Добавить("СтоимостьКубаХВ");
	Таблица.Колонки.Добавить("СтоимостьКВтч");
	Таблица.Колонки.Добавить("СтоимостьКубаВО");
	Таблица.Колонки.Добавить("СтоимостьГКалл");
	Таблица.Колонки.Добавить("СтоимостьКубаХВнаГВ");
	Таблица.Колонки.Добавить("НормативХВ");
	Таблица.Колонки.Добавить("НормативГВ");
	Таблица.Колонки.Добавить("НормативВО");
	Таблица.Колонки.Добавить("НормативЭЭ");
	Таблица.Колонки.Добавить("НормативНаПодогрев");
	Таблица.Колонки.Добавить("ТарифМинВзнос");
	
	СтрокаТаблицы = Таблица.Добавить();
	
	СтрокаТаблицы.ЛицевойСчет = ЛицевойСчет;
	СтрокаТаблицы.ТарифХВ = 0;
	СтрокаТаблицы.ТарифГВ = 0;
	СтрокаТаблицы.ТарифВО = 0;
	СтрокаТаблицы.ТарифЭЛ = 0;
	СтрокаТаблицы.РежимПотребления = Неопределено;
	СтрокаТаблицы.СпособРасчета = Неопределено;
	СтрокаТаблицы.СтатусКвартиры = Неопределено;
	СтрокаТаблицы.ТипКвартиры = Неопределено;
	СтрокаТаблицы.ОбщаяПлощадь = 0;
	СтрокаТаблицы.ЖилаяПлощадь = 0;
	СтрокаТаблицы.лб_НеВыводитьСтрокуДомофон = Неопределено;
	СтрокаТаблицы.СтоимостьКубаХВ = 0;
	СтрокаТаблицы.СтоимостьКВтч = 0;
	СтрокаТаблицы.СтоимостьКубаВО = 0;
	СтрокаТаблицы.СтоимостьГКалл = 0;
	СтрокаТаблицы.СтоимостьКубаХВнаГВ = 0;
	СтрокаТаблицы.НормативХВ = 0;
	СтрокаТаблицы.НормативГВ = 0;
	СтрокаТаблицы.НормативВО = 0;
	СтрокаТаблицы.НормативЭЭ = 0;
	СтрокаТаблицы.НормативНаПодогрев = 0;
	СтрокаТаблицы.ТарифМинВзнос = 0;
	Возврат Таблица;
	
КонецФункции

Процедура УстановитьПараметрыУслуг(Запрос)
	УслугаМинВзнос      = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008");
	УслугаДопВзнос      = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000030");
	УслугаРФКР          = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000022");
	УслугаСодРем        = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001");
	УслугаАверс         = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000013");
	УслугаПрофи         = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000019");
	УслугаДоп           = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000018");
	УслугаОДПУ          = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000014");
	УслугаДомофон       = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000007");
	УслугаОргФКР        = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000009");
	УслугаАванс   	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000002");
	УслугаГазоснабжение = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000017");
	УслугаВО     	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000015");
	УслугаГВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011");
	УслугаХВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012");
	УслугаЭЭ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010");
	УслугаХВВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000023");
	УслугаПени    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000003");
	//СодРем
	Запрос.УстановитьПараметр("СодрежаниеРемонт", УслугаСодРем);
	Запрос.УстановитьПараметр("ХВ", УслугаХВ);
	Запрос.УстановитьПараметр("ГВ", УслугаГВ);
	Запрос.УстановитьПараметр("ВО", УслугаВО);
	Запрос.УстановитьПараметр("ЭЛ", УслугаЭЭ);
	//КарРем
	Запрос.УстановитьПараметр("УслугаМинВзнос", УслугаМинВзнос);
	Запрос.УстановитьПараметр("УслугаДопВзнос", УслугаДопВзнос);
	Запрос.УстановитьПараметр("УслугаРФКР", УслугаРФКР);
	
	Запрос.УстановитьПараметр("УслугаАверс", УслугаАверс);
	Запрос.УстановитьПараметр("УслугаПрофи", УслугаПрофи);
	Запрос.УстановитьПараметр("УслугаДоп", УслугаДоп);
	Запрос.УстановитьПараметр("УслугаОДПУ", УслугаОДПУ);
	Запрос.УстановитьПараметр("УслугаДомофон", УслугаДомофон);
	Запрос.УстановитьПараметр("УслугаОргФКР", УслугаОргФКР);
	Запрос.УстановитьПараметр("УслугаАванс", УслугаАванс);
	Запрос.УстановитьПараметр("УслугаГазоснабжение", УслугаГазоснабжение);

КонецПроцедуры		

Функция ЭтоОДН(Услуга) 
	
	УслугаСодРем        = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001");
	УслугаВО     	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000015");
	УслугаГВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011");
	УслугаХВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012");
	УслугаЭЭ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010");
	
	Если Услуга = УслугаСодРем или Услуга = УслугаВО или Услуга = УслугаГВ или Услуга = УслугаХВ или Услуга = УслугаЭЭ Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Функция ПодвалКвитанции(Выборка, Период)
	
	лб_НастройиПечатиКвитанции = Выборка.СпособРасчетаОДН;
	Структура = Новый Структура;
	Структура.Вставить("ХВС", "");
	Структура.Вставить("ГВС", "");
	Структура.Вставить("ЭЭ", "");
	Структура.Вставить("ВО", "");
	Структура.Вставить("ЧислоХВС", "");
	Структура.Вставить("ЧислоГВС", "");
	Структура.Вставить("ЧислоЭЭ", "");
	Структура.Вставить("ЧислоВО", "");
	Структура.Вставить("ПериодОДН", "");
	Структура.Вставить("НормаФакт", Истина);
	ПериодМесяц = Формат(Период, "ДФ=ММ");
	ПериодГод = Формат(Период, "ДФ=гггг"); 
	ПериодГодПред = Формат(ДобавитьМесяц(Период, -12), "ДФ=гггг");
	Ме = "";
	Если ПериодМесяц = "03" тогда 
		Ме = "январе ";
	ИначеЕсли ПериодМесяц = "04" тогда 
		Ме = "феврале ";
	ИначеЕсли ПериодМесяц = "05" тогда 
		Ме = "марте ";
	ИначеЕсли ПериодМесяц = "06" тогда 
		Ме = "апреле ";
	ИначеЕсли ПериодМесяц = "07" тогда 
		Ме = "мае ";
	ИначеЕсли ПериодМесяц = "08" тогда 
		Ме = "июне ";	
	ИначеЕсли ПериодМесяц = "09" тогда 
		Ме = "июле ";
	ИначеЕсли ПериодМесяц = "10" тогда 
		Ме = "августе ";
	ИначеЕсли ПериодМесяц = "11" тогда 
		Ме = "сентябре ";
	ИначеЕсли ПериодМесяц = "12" тогда 
		Ме = "октябре ";
	ИначеЕсли ПериодМесяц = "01" тогда 
		Ме = "ноябре ";
		ПериодГод = ПериодГодПред;	
	ИначеЕсли ПериодМесяц = "02" тогда 
		Ме = "декабре ";
		ПериодГод = ПериодГодПред;	
	КонецЕсли;
	
	Если (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ХВ = Перечисления.лб_СпособРасчетаСОИ.ПоФакту) И (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ГВ = Перечисления.лб_СпособРасчетаСОИ.ПоФакту) И (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ЭЭ = Перечисления.лб_СпособРасчетаСОИ.ПоФакту)  Тогда
		Структура.Вставить("ПериодОДН", "Фактич. потребление и объемы на КР СОИ в " + Ме + ПериодГод + " г. с уч. коррект. за прошл. периоды");
		Структура.Вставить("НормаФакт", Истина);
	ИначеЕсли (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ХВ = Перечисления.лб_СпособРасчетаСОИ.ПоФакту)  Тогда
		Структура.Вставить("ПериодОДН", "Фактич. потребление и объемы на ХВС в " + Ме + ПериодГод + " г. с уч. коррект. за прошл. периоды. Нормативы и объемы потребления на ГВС, Эл/Эн и ВО, ед.изм./м.кв.общ.имущ.");
		Структура.Вставить("НормаФакт", Истина);
	ИначеЕсли (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ХВ = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу) И (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ГВ = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу) И (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ЭЭ = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу) Тогда
		Структура.Вставить("ПериодОДН", "Нормативы и объемы потребления на КР СОИ по нормативу на МКД, ед.изм./м.кв.общ.имущ.");
		Структура.Вставить("НормаФакт", Ложь);
	ИначеЕсли (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ХВ = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему) И (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ГВ = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему) И (лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ЭЭ = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему) Тогда
		Структура.Вставить("ПериодОДН", "Среднемес. потребление на ОДН за прошлый год ед.изм./м.кв.общ.имущ."); 
		Структура.Вставить("НормаФакт", Ложь);
	КонецЕсли;
	
	Если лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ХВ = Перечисления.лб_СпособРасчетаСОИ.ПоФакту Тогда
		Структура.Вставить("ХВС", "ХВС, м3"); 
		Структура.Вставить("ЧислоХВС", Выборка.ОДН_ХВ_М); 
	ИначеЕсли лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ХВ = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу ИЛИ лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ХВ = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему Тогда
		Структура.Вставить("ХВС", "ХВС, м3/м2");  
		Структура.Вставить("ЧислоХВС", Выборка.НормативХВ); 
	КонецЕсли;
	
	Если лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ГВ = Перечисления.лб_СпособРасчетаСОИ.ПоФакту Тогда
		Структура.Вставить("ГВС", "ГВС, м3");
		Структура.Вставить("ЧислоГВС", Выборка.ОДН_ГВ_М);
	ИначеЕсли  лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ГВ = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу ИЛИ лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ГВ = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему Тогда
		Структура.Вставить("ГВС", "ГВС, м3/м2");
		Структура.Вставить("ЧислоГВС", Выборка.НормативГВ);
	КонецЕсли; 	
	
	Если лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ВО = Перечисления.лб_СпособРасчетаСОИ.ПоФакту Тогда
		//Струткруа.Вставить("Стоки", "ВО, м.куб/м.кв");
		Структура.Вставить("ВО", "ВО, м3"); 
		Структура.Вставить("ЧислоВО", Выборка.ОДН_ВО_М);
	ИначеЕсли  лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ВО = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу ИЛИ лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ВО = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему Тогда
		Структура.Вставить("ВО", "ВО, м3/м2");   
		Структура.Вставить("ЧислоВО", Выборка.НормативВО);
	КонецЕсли;
	
	Если лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ЭЭ = Перечисления.лб_СпособРасчетаСОИ.ПоФакту Тогда
		Структура.Вставить("ЭЭ", "Эл/эн, кВт");    
		Структура.Вставить("ЧислоЭЭ", Выборка.ОДН_ЭЭ_КВТ);    
	ИначеЕсли  лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ЭЭ = Перечисления.лб_СпособРасчетаСОИ.ПоНормативу ИЛИ лб_НастройиПечатиКвитанции.СпособРасчетаСОИ_ЭЭ = Перечисления.лб_СпособРасчетаСОИ.ПоСреднему Тогда
		Структура.Вставить("ЭЭ", "Эл/эн, кВт/м2");
		Структура.Вставить("ЧислоЭЭ", Выборка.НормативЭЭ);    
	КонецЕсли;
	
	Возврат Структура
	
КонецФункции



Функция ТекстЗапросаНачисленияОсновная()

	Возврат "ВЫБРАТЬ
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток КАК Сальдо,
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ
	        |ПОМЕСТИТЬ ВТ_Сальдо
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), , , ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ
	        |ПОМЕСТИТЬ ВТ_Услуги
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), , , ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СУММА(ВЫБОР
	        |			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	        |				ТОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК Разовые,
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ
	        |ПОМЕСТИТЬ ВТ_Разовые
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), Регистратор, , ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_СтавкиНаУслугиСрезПоследних.Услуга КАК Услуга,
	        |	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка КАК ОсновнаяСтавка,
	        |	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета КАК СпособРасчета,
	        |	бит_СтавкиНаУслугиСрезПоследних.Поставщик КАК Поставщик
	        |ПОМЕСТИТЬ ВТ_СтавкиУслуг
	        |ИЗ
	        |	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	        |			&Период,
	        |			РежимПотребления = &РежимПотребления
	        |				И СтатусКвартиры = &СтатусКвартиры
	        |				И ТипКвартиры = &ТипКвартиры) КАК бит_СтавкиНаУслугиСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_СведенияПоУслугамЛССрезПоследних.Период КАК Период,
	        |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	        |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	        |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	        |	бит_СведенияПоУслугамЛССрезПоследних.Использовать КАК Использовать,
	        |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	        |	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	        |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
	        |ПОМЕСТИТЬ ВТ_СведенеияОУслугах
	        |ИЗ
	        |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СведенеияОУслугах.Услуга КАК Услуга,
	        |	ВТ_СтавкиУслуг.ОсновнаяСтавка КАК ОсновнаяСтавка,
	        |	ВТ_СведенеияОУслугах.СпособРасчета КАК СпособРасчета
	        |ПОМЕСТИТЬ ВТ_Ставки
	        |ИЗ
	        |	ВТ_СведенеияОУслугах КАК ВТ_СведенеияОУслугах
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиУслуг КАК ВТ_СтавкиУслуг
	        |		ПО ВТ_СведенеияОУслугах.Услуга = ВТ_СтавкиУслуг.Услуга
	        |			И ВТ_СведенеияОУслугах.СпособРасчета = ВТ_СтавкиУслуг.СпособРасчета
	        |			И ВТ_СведенеияОУслугах.Поставщик = ВТ_СтавкиУслуг.Поставщик
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СУММА(ВЫБОР
	        |			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	        |				ТОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК Начисление,
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ
	        |ПОМЕСТИТЬ ВТ_Начисление
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), Регистратор, , ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ДанныеПоОбъемамЖКУСрезПоследних.Объем КАК Объем,
	        |	бит_ДанныеПоОбъемамЖКУСрезПоследних.Услуга КАК Услуга
	        |ПОМЕСТИТЬ ВТ_Объемы
	        |ИЗ
	        |	РегистрСведений.бит_ДанныеПоОбъемамЖКУ.СрезПоследних(&Период, Здание = &Здание) КАК бит_ДанныеПоОбъемамЖКУСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЕСТЬNULL(ВТ_Начисление.Начисление, 0) КАК Начисления,
	        |	ЕСТЬNULL(ВТ_Сальдо.Сальдо, 0) КАК НачальноеСальдо,
	        |	ЕСТЬNULL(ВТ_Разовые.Разовые, 0) КАК Разовые,
	        |	ВТ_Услуги.УслугаЖКХ КАК УслугаЖКХ,
	        |	ВТ_Ставки.СпособРасчета КАК СпособРасчета,
	        |	ЕСТЬNULL(ВТ_Ставки.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	        |	ЕСТЬNULL(ВТ_Объемы.Объем, 0) КАК Объем
	        |ИЗ
	        |	ВТ_Услуги КАК ВТ_Услуги
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо КАК ВТ_Сальдо
	        |		ПО ВТ_Услуги.УслугаЖКХ = ВТ_Сальдо.УслугаЖКХ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Разовые КАК ВТ_Разовые
	        |		ПО ВТ_Услуги.УслугаЖКХ = ВТ_Разовые.УслугаЖКХ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Начисление КАК ВТ_Начисление
	        |		ПО ВТ_Услуги.УслугаЖКХ = ВТ_Начисление.УслугаЖКХ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ставки КАК ВТ_Ставки
	        |		ПО ВТ_Услуги.УслугаЖКХ = ВТ_Ставки.Услуга
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Объемы КАК ВТ_Объемы
	        |		ПО ВТ_Услуги.УслугаЖКХ = ВТ_Объемы.Услуга";
	
КонецФункции

Процедура ЗаполнениеОБластиУслугиОДНПоТекПериоду(ЭтоУслугаСодРем, СтрокаОплаты, СуммаГВ, ГВНач, ДолгГВ, ОбластьТаблицаПараметрыОплатаТекПериодГВ, ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоПерваяСтрока, ЭтоБухСправка, ПериодОбразованияЗадолженностиПо, ЛС = Неопределено, ДатаОстатка = Неопределено, ДанныеРазовые = Неопределено, Коэфф = 1, ГВТек = 0, ХВТек = 0, ВОТек = 0, ЭЛТек = 0, ДолженПоОДН = Ложь,
	ГВ=0, ХВ=0, ВО=0, ЭЭ=0, ОбластьТаблица = Неопределено);//, ГВНачислено = 0, ХВНачислено = 0, ВОНачислено = 0, ЭЛНачислено = 0)                                            
	
	УслугаСодРем        = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001");
	УслугаВО     	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000015");
	УслугаГВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011");
	УслугаХВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012");
	УслугаЭЭ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010");
	
	Если ЭтоБухСправка Тогда
		
		Если СуммаОплатыТекПериод > 0 или не ДолженПоОДН  Тогда
			ОбластьТаблицаПараметрыОплатаТекПериодГВ	= ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаТекПериодГВ),"", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Формат(СуммаГВ,"ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС ;
			ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ),"", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ)+ Символы.ПС;
		Иначе
			ОбластьТаблицаПараметрыОплатаТекПериодГВ	= ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаТекПериодГВ),"", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Символы.ПС ;
			ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ = ?(ЭтоПерваяСтрока или ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ),"", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ)+ Формат(СуммаГВ,"ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
		КонецЕсли;
		//СуммаОплатыТекПериод = СуммаОплатыТекПериод + СуммаГВ;
	ИначеЕсли Окр(ГВНач,5) >0 Тогда
		ОбластьТаблицаПараметрыОплатаТекПериодГВ	= ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаТекПериодГВ),"", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Формат(СуммаГВ,"ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
		ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ),"", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ) + Символы.ПС;
		СуммаОплатыТекПериод = СуммаОплатыТекПериод + СуммаГВ;
	Иначе  
		//++Анисимова 07.11 1бит  Мешало выводу по Исп листу в текущий период минусовых сумм
		//Если Не ЭтоУслугаСодРем и ДолгГВ > 0 и СуммаГВ <= 0 Тогда
		//	ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ  = ?(ЭтоПерваяСтрока, "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ) + Символы.ПС;
		//	ОбластьТаблицаПараметрыОплатаТекПериодГВ = ?(ЭтоПерваяСтрока, "", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Символы.ПС;
		//	Возврат;
		//КонецЕсли;
		//ДолгГВ = ДолгГВ - (-ГВНач);
		//Если 
		//--Анисимова 07.11 1бит   
		//Правки 13.11 для выпода с периодом оплаты за более ранний месяц в рамках отбора
		Если НЕ ЭтоУслугаСодРем ИЛИ СуммаГВ <= ГВНач Тогда
			//++Анисимова 07.11 1бит
			Если СтрокаОплаты.ПериодОплаты >= ПериодОбразованияЗадолженностиПо Тогда
				ОбластьТаблицаПараметрыОплатаТекПериодГВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаТекПериодГВ), "", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Формат(СуммаГВ, "ЧДЦ=2; ЧРД=,; ЧН=") + Символы.ПС;
				СуммаОплатыТекПериод = СуммаОплатыТекПериод + СуммаГВ;
			Иначе
			
			//--Анисимова 07.11 1бит
				ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ  = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ) + Формат(-ГВНач, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
				ОбластьТаблицаПараметрыОплатаТекПериодГВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаТекПериодГВ), "", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Формат(СуммаГВ + ГВНач, "ЧДЦ=2; ЧРД=,; ЧН=") + Символы.ПС;
				СуммаОплатыТекПериод = СуммаОплатыТекПериод + СуммаГВ + ГВНач;
				СуммаОплатыПрошлыйПериод = СуммаОплатыПрошлыйПериод + (-ГВНач); 
			КонецЕсли;
		ИначеЕсли ЭтоУслугаСодРем Тогда    
			ДолгДоРасчета =ДолгГВ; 
			ДолгГВ = 0;
			//перенос суммы сод рем на другие услуги
			СуммаОплатыТП = ?(СуммаГВ - (-ГВНач + ДолгГВ)<0,0,СуммаГВ - (-ГВНач + ДолгГВ));
			СуммаОплатыПП = 0; 
				Переплата = -ГВНач;
				СуммаОплатыТП = ?(СуммаГВ - (-ГВНач)<0,0,СуммаГВ - (-ГВНач));       

					
				//СуммаОплатыПП = -ГВНач + ДолгГВ; 
				СальдоОДН = ПолучитьНачальноеСальдо(ЛС, ДатаОстатка);
				СтрокаРазовыеХВ = ДанныеРазовые.Найти(УслугаХВ, "УслугаЖКХ");
				СтрокаРазовыеГВ = ДанныеРазовые.Найти(УслугаГВ, "УслугаЖКХ");
				СтрокаРазовыеВО = ДанныеРазовые.Найти(УслугаВО, "УслугаЖКХ");
				СтрокаРазовыеЭЛ = ДанныеРазовые.Найти(УслугаЭЭ, "УслугаЖКХ");
				
				РазовыеХВ = ?(ЗначениеЗаполнено(СтрокаРазовыеХВ), СтрокаРазовыеХВ.СуммаОборот * Коэфф, 0);
				РазовыеГВ = ?(ЗначениеЗаполнено(СтрокаРазовыеГВ), СтрокаРазовыеГВ.СуммаОборот * Коэфф, 0);
				РазовыеВО = ?(ЗначениеЗаполнено(СтрокаРазовыеВО), СтрокаРазовыеВО.СуммаОборот * Коэфф, 0);
				РазовыеЭЛ = ?(ЗначениеЗаполнено(СтрокаРазовыеЭЛ), СтрокаРазовыеЭЛ.СуммаОборот * Коэфф, 0);
				Попытка
					ОстатокГВ = ?(СальдоОДН[0].ГВ + РазовыеГВ > 0, ГВТек, ГВТек +СальдоОДН[0].ГВ + РазовыеГВ);
					ОстатокХВ = ?(СальдоОДН[0].ХВ + РазовыеХВ > 0, ХВТек, ХВТек +СальдоОДН[0].ХВ + РазовыеХВ);
					ОстатокВО = ?(СальдоОДН[0].ВО + РазовыеВО > 0, ВОТек, ВОТек +СальдоОДН[0].ВО + РазовыеВО);
					ОстатокЭЛ = ?(СальдоОДН[0].ЭЭ + РазовыеЭЛ > 0, ЭлТек, ЭлТек +СальдоОДН[0].ЭЭ + РазовыеЭЛ);
					//ДолгОДН = ОстатокГВ + ОстатокХВ + ОстатокВО + ОстатокЭЛ;	 
					//Анисимова  
					ДолгОДН = 0;
					Если ОстатокГВ - СтрокаОплаты.ГВОпл >0  Тогда 
						ДолгОДН = ОстатокГВ;	
					КонецЕсли;   
					Если  ОстатокХВ - СтрокаОплаты.ХВОпл >0 Тогда 
						ДолгОДН = ДолгОДН + ОстатокХВ;	
					КонецЕсли;
					Если ОстатокВО - СтрокаОплаты.ВООпл >0  Тогда 
						ДолгОДН = ДолгОДН + ОстатокВО;	
					КонецЕсли;
					Если ОстатокЭЛ - СтрокаОплаты.ЭЛОпл >0 Тогда 
						ДолгОДН = ДолгОДН + ОстатокЭЛ;	
					КонецЕсли; 
					ДолгОДН = Окр(ДолгОДН,3);
					//Анисимова  					
				Исключение
					ДолгОДН = 0;
				КонецПопытки;
				СуммаОплатыПП = ?((-ГВНач) - ДолгОДН<0,0,(-ГВНач) - ДолгОДН);    
				Переплата = Переплата - СуммаОплатыПП;
				Если СальдоОДН.Количество() > 0 и ДолгОДН > 0 Тогда
					
					Если Переплата >= ДолгОДН Тогда
						Переплата = Переплата - ДолгОДН;
						Делитель = ДолгОДН;
					Иначе
						Делитель = Переплата;
						Переплата = 0;
					КонецЕсли;
					СуммГВ =  ?(ОстатокГВ - СтрокаОплаты.ГВОпл <= 0, 0,(ОстатокГВ / ДолгОДН * Делитель));
					СуммаХВ = ?(ОстатокХВ - СтрокаОплаты.ХВОпл <= 0, 0,(ОстатокХВ / ДолгОДН * Делитель));
					СуммаВО = ?(ОстатокВО - СтрокаОплаты.ВООпл <= 0, 0,(ОстатокВО / ДолгОДН * Делитель));
					СуммаЭЭ = ?(ОстатокЭЛ - СтрокаОплаты.ЭЛОпл <= 0, 0,(ОстатокЭЛ / ДолгОДН * Делитель));
					
					СуммаГВ =  ?(ГВ > 0 И ГВ - СуммГВ < 0, (ГВ- СтрокаОплаты.ГВОпл), СуммГВ);
					СуммаХВ = ?(ХВ > 0 И ХВ - СуммаХВ < 0, (ХВ - СтрокаОплаты.ХВОпл), СуммаХВ);
					СуммаВО = ?(ВО > 0 И ВО -СуммаВО < 0,  (ВО - СтрокаОплаты.ВООпл), СуммаВО);
					СуммаЭЭ = ?(ЭЭ > 0 И ЭЭ - СуммаЭЭ < 0, (ЭЭ - СтрокаОплаты.ЭЛОпл), СуммаЭЭ);  
					
				Иначе
					СуммГВ = 0;//Окр(ГВ / ДолгОДН * Переплата, 2);
					СуммаХВ = 0;//Окр(ХВ / ДолгОДН * Переплата, 2);
					СуммаВО = 0;//Окр(ВО / ДолгОДН * Переплата, 2);
					СуммаЭЭ = 0;//Окр(ЭЭ / ДолгОДН * Переплата, 2);
				КонецЕсли;
				СуммаОплатыТП = СуммаОплатыТП + (Переплата );
				//ГВНачислено = ГВНачислено - СуммаГВ;
				//ХВНачислено = ХВНачислено - СуммаХВ;
				//ВОНачислено = ВОНачислено - СуммаВО;
				//ЭЛНачислено = ЭЛНачислено - СуммаЭЭ;
				
				СтрокаОплаты.ГВОпл = СуммГВ + СтрокаОплаты.ГВОпл;
				СтрокаОплаты.ХВОпл = СуммаХВ + СтрокаОплаты.ХВОпл;
				СтрокаОплаты.ВООпл = СуммаВО + СтрокаОплаты.ВООпл;
				СтрокаОплаты.ЭЛОпл = СуммаЭЭ + СтрокаОплаты.ЭЛОпл;   
				ГВНач = ГВНач -СуммГВ - СуммаХВ-СуммаВО - СуммаЭЭ;
				//КонецЕсли;
				//  
				ДолгГВ = ДолгДоРасчета;
				ЗаполненПрошлыйПериод =Ложь;
				Если ГВНач <> 0 Тогда      
					ДолгГВПослеВычетаПереплаты = ДолгГВ - СуммаОплатыПП; 
					Если ДолгГВПослеВычетаПереплаты >= 0 Тогда    
						//СуммаОплатыПП =(-ГВНач);
						ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ) + Формат(СуммаОплатыПП, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
						ДолгГВ = ДолгДоРасчета - СуммаОплатыПП;//ДолгГВ = ДолгДоРасчета - СуммаОплатыПП; 
						ЗаполненПрошлыйПериод = Истина;
					Иначе
						//++bit_AnisimovaMV_23.10.2023         
						ПереплатаПоСодРем =  -ГВНач;
						ПереплатаПоСодРем = ПеренестиПереплатуНаПрошлыйПериод(СтрокаОплаты, ДолгГВ, -ГВНач, ЭтоПерваяСтрока, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодСодРем, 
						ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодГВ, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодХВ,
						ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодВО, ОбластьТаблица.Параметры.ОплатаЗаПрошлыйПериодЭЛ,
						ГВ, ХВ, ВО, ЭЭ, СуммаОплатыПрошлыйПериод);
						СуммаОплатыПП =0;
						//--bit_AnisimovaMV_23.10.2023
						ЗаполненПрошлыйПериод = Истина;
					КонецЕсли;
					//Иначе 				
					Если ЗначениеЗаполнено(ПереплатаПоСодРем) Тогда 
						СуммаОплатыТП = СуммаОплатыТП +ПереплатаПоСодРем; 
					КонецЕсли;
					
					//КонецЕсли;
					
				КонецЕсли;            
				Если СуммаОплатыПП<0 Тогда
					СуммаОплатыПП = 0;
				КонецЕсли;
			ОбластьТаблицаПараметрыОплатаТекПериодГВ = ?(ЭтоПерваяСтрока, "", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Формат(СуммаОплатыТП, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
			Если Не ЗаполненПрошлыйПериод Тогда
				ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ) + Формат(СуммаОплатыПП, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
			КонецЕсли;	
			СуммаОплатыТекПериод = СуммаОплатыТекПериод + СуммаОплатыТП;
			СуммаОплатыПрошлыйПериод =СуммаОплатыПрошлыйПериод + СуммаОплатыПП;// СуммаОплатыПрошлыйПериод + (-ГВНач + ДолгГВ);
			 Если ГВНач<0 Тогда
					ГВНач = 0;
				КонецЕсли;

			//ДолгГВ = 0; 
			
		КонецЕсли; 
		
		//Иначе// долг по услуге < 0
		//	СуммаТП = СуммаГВ + ГВНач;
		//	СуммаПП = -ГВНач;
		//	Если ЭтоУслугаСодРем Тогда
		//		Если СуммаПП > 0 и ДолгГВ <=0 Тогда //распределяем сумма
		//		////////////////////////////////////////////////////////
		//			Если  ЭтоУслугаСодРем Тогда
		//				Переплата = -ГВНач;
		//				//СуммаОплатыТП = СуммаГВ - (-ГВНач);
		//				//СуммаОплатыПП = -ГВНач + ДолгГВ; 
		//				СальдоОДН = ПолучитьНачальноеСальдо(ЛС, ДатаОстатка);
		//				СтрокаРазовыеХВ = ДанныеРазовые.Найти(УслугаХВ, "УслугаЖКХ");
		//				СтрокаРазовыеГВ = ДанныеРазовые.Найти(УслугаГВ, "УслугаЖКХ");
		//				СтрокаРазовыеВО = ДанныеРазовые.Найти(УслугаВО, "УслугаЖКХ");
		//				СтрокаРазовыеЭЛ = ДанныеРазовые.Найти(УслугаЭЭ, "УслугаЖКХ");
		//				
		//				РазовыеХВ = ?(ЗначениеЗаполнено(СтрокаРазовыеХВ), СтрокаРазовыеХВ.СуммаОборот * Коэфф, 0);
		//				РазовыеГВ = ?(ЗначениеЗаполнено(СтрокаРазовыеГВ), СтрокаРазовыеГВ.СуммаОборот * Коэфф, 0);
		//				РазовыеВО = ?(ЗначениеЗаполнено(СтрокаРазовыеВО), СтрокаРазовыеВО.СуммаОборот * Коэфф, 0);
		//				РазовыеЭЛ = ?(ЗначениеЗаполнено(СтрокаРазовыеЭЛ), СтрокаРазовыеЭЛ.СуммаОборот * Коэфф, 0);
		//				Попытка
		//					ОстатокГВ = ?(СальдоОДН[0].ГВ + РазовыеГВ > 0, ГВТек, 0);
		//					ОстатокХВ = ?(СальдоОДН[0].ХВ + РазовыеХВ > 0, ХВТек, 0);
		//					ОстатокВО = ?(СальдоОДН[0].ВО + РазовыеВО > 0, ВОТек, 0);
		//					ОстатокЭЛ = ?(СальдоОДН[0].ЭЭ + РазовыеЭЛ > 0, ЭлТек, 0);
		//					ДолгОДН = ОстатокГВ + ОстатокХВ + ОстатокВО + ОстатокЭЛ;	
		//				Исключение
		//					ДолгОДН = 0;
		//				КонецПопытки;
		//				
		//				Если СальдоОДН.Количество() > 0 и ДолгОДН > 0 Тогда
		
		//					Если Переплата >= ДолгОДН Тогда
		//						Переплата = Переплата - ДолгОДН;
		//						Делитель = ДолгОДН;
		//					Иначе
		//						Делитель = Переплата;
		//						Переплата = 0;
		//					КонецЕсли;
		//					СуммГВ =  ?(ОстатокГВ <= 0, 0,(ОстатокГВ / ДолгОДН * Делитель));
		//					СуммаХВ = ?(ОстатокХВ <= 0, 0,(ОстатокХВ / ДолгОДН * Делитель));
		//					СуммаВО = ?(ОстатокВО <= 0, 0,(ОстатокВО / ДолгОДН * Делитель));
		//					СуммаЭЭ = ?(ОстатокЭЛ <= 0, 0,(ОстатокЭЛ / ДолгОДН * Делитель));
		//				Иначе
		//					СуммГВ = 0;//Окр(ГВ / ДолгОДН * Переплата, 2);
		//					СуммаХВ = 0;//Окр(ХВ / ДолгОДН * Переплата, 2);
		//					СуммаВО = 0;//Окр(ВО / ДолгОДН * Переплата, 2);
		//					СуммаЭЭ = 0;//Окр(ЭЭ / ДолгОДН * Переплата, 2);
		//				КонецЕсли;
		//				СуммаТП = СуммаТП + (Переплата );
		//				СуммаПП = 0;
		//				//ГВНачислено = ГВНачислено - СуммаГВ;
		//				//ХВНачислено = ХВНачислено - СуммаХВ;
		//				//ВОНачислено = ВОНачислено - СуммаВО;
		//				//ЭЛНачислено = ЭЛНачислено - СуммаЭЭ;
		//				
		//				СтрокаОплаты.ГВОпл = СуммГВ + СтрокаОплаты.ГВОпл;
		//				СтрокаОплаты.ХВОпл = СуммаХВ + СтрокаОплаты.ХВОпл;
		//				СтрокаОплаты.ВООпл = СуммаВО + СтрокаОплаты.ВООпл;
		//				СтрокаОплаты.ЭЛОпл = СуммаЭЭ + СтрокаОплаты.ЭЛОпл;
		//			КонецЕсли;
		//		////////////////////////////////////////////////////////
		//		КонецЕсли;
		//	КонецЕсли;    
		
		//ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ = ?(ЭтоПерваяСтрока,"", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ) + Формат((СуммаПП), "ЧДЦ=2; ЧРД=,; ЧН=") + Символы.ПС;
		//ОбластьТаблицаПараметрыОплатаТекПериодГВ = ?(ЭтоПерваяСтрока,"", ОбластьТаблицаПараметрыОплатаТекПериодГВ) + Формат(СуммаТП, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
		//СуммаОплатыПрошлыйПериод = СуммаОплатыПрошлыйПериод + (СуммаПП);
		//СуммаОплатыТекПериод = СуммаОплатыТекПериод + (СуммаТП);
	КонецЕсли;
//	ГВНач = 0;


КонецПроцедуры

Функция ПеренестиПереплатуНаПрошлыйПериод(СтрокаОплаты, ДолгСодРем, ПереплатаПоСодРем, ЭтоПерваяСтрока, ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем, 
	ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ, ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодХВ,
	ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодВО, ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодЭЭ,
	ГВ = 0, ХВ = 0, ВО = 0, ЭЭ = 0, СуммаОплатыПрошлыйПериод)
	
		//перенос суммы сод рем на другие услуги
		СуммаОплатыППСодРем = ДолгСодРем;     
		Переплата = ПереплатаПоСодРем - ДолгСодРем;    
		ПереплатаПоСодРем = ПереплатаПоСодРем - ДолгСодРем;
		СуммаГВ = 0;
		СуммаХВ = 0;
		СуммаВО = 0;
		СуммаЭЭ = 0;

		ДолгОДН = ГВ +ХВ + ВО + ЭЭ;
		Если ДолгОДН > 0 Тогда
				СуммаГВ = (ГВ / ДолгОДН * Переплата);
				СуммаХВ = (ХВ / ДолгОДН * Переплата);
				СуммаВО = (ВО / ДолгОДН * Переплата);
				СуммаЭЭ = (ЭЭ / ДолгОДН * Переплата);
				ПереплатаПоСодРем = ПереплатаПоСодРем - СуммаГВ-СуммаХВ-СуммаВО	-СуммаЭЭ;			
		КонецЕсли;
		
		Если ДолгСодРем < 0   Тогда 
			СуммаОплатыППСодРем = 0;
		КонецЕсли;  
			ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем) + Формат(СуммаОплатыППСодРем, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;		
			ДолгСодРем = ДолгСодРем - СуммаОплатыППСодРем;
			Если СуммаГВ<>0 Тогда	
				ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодГВ) + Формат(СуммаГВ, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;				
			КонецЕсли;
			Если СуммаХВ<>0 Тогда	
				ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодХВ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодХВ), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодХВ) + Формат(СуммаХВ, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;				
			КонецЕсли;
			Если СуммаВО<>0 Тогда	
				ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодВО = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодВО), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодВО) + Формат(СуммаВО, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;				
			КонецЕсли;
			Если СуммаЭЭ<>0 Тогда	
				ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодЭЭ = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодЭЭ), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодЭЭ) + Формат(СуммаЭЭ, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;				
			КонецЕсли;
		СуммаОплатыПрошлыйПериод = СуммаОплатыПрошлыйПериод + СуммаОплатыППСодРем + СуммаГВ+СуммаХВ+СуммаВО+СуммаЭЭ;    
		Возврат ПереплатаПоСодРем;
КонецФункции



Процедура ЗаполнениеОБластиУслугиОДНПоПрошломуПериоду(ЭтоУслугаСодРем, СтрокаОплаты, ДолгСодРем, СуммаСодРем, ЭтоПерваяСтрока, ОбластьТаблицаПараметрыОплатаТекПериодСодРем, ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем, СуммаОплатыТекПериод, СуммаОплатыПрошлыйПериод, ЭтоБухСправка, БухПоПрошломуПериоду , ГВ = 0, ХВ = 0, ВО = 0, ЭЭ = 0)
	
	Если ДолгСодРем >=0 или (БухПоПрошломуПериоду и ЭтоБухСправка) Тогда
		ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем  = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем) + Формат(СуммаСодРем, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
		ОбластьТаблицаПараметрыОплатаТекПериодСодРем = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем), "", ОбластьТаблицаПараметрыОплатаТекПериодСодРем) + Символы.ПС;
		Если Не ЭтоБухСправка Тогда
			СуммаОплатыПрошлыйПериод = СуммаОплатыПрошлыйПериод + СуммаСодРем;
		КОнецЕсли;
	Иначе     
		
		//перенос суммы сод рем на другие услуги
		СуммаОплатыТП = 0;
		СуммаОплатыПП = СуммаСодРем; 
		Если  ЭтоУслугаСодРем Тогда
			Переплата = -ДолгСодРем; 
			ДолгОДН = 0;
			//++АнисимоваМВ_07.11.2023_1бит    Добавлена проверка на оплату за ОДН, чтобы не распределялась лишняя сумма на ОДН 
			Если ГВ>0  И ГВ - СтрокаОплаты.ГВОпл >0  Тогда 
				ДолгОДН = ГВ - СтрокаОплаты.ГВОпл ;	
			КонецЕсли;   
			Если ХВ>0  И ХВ - СтрокаОплаты.ХВОпл >0 Тогда 
				ДолгОДН = ДолгОДН + ХВ - СтрокаОплаты.ХВОпл;	
			КонецЕсли;
            Если ВО>0 И ВО - СтрокаОплаты.ВООпл >0  Тогда 
				ДолгОДН = ДолгОДН + ХВ - СтрокаОплаты.ХВОпл;	
			КонецЕсли;
            Если ЭЭ>0  И ЭЭ - СтрокаОплаты.ЭЛОпл >0 Тогда 
				ДолгОДН = ДолгОДН + ХВ - СтрокаОплаты.ХВОпл;	
			КонецЕсли;
			//ДолгОДН = ГВ +ХВ + ВО + ЭЭ;
			//--АнисимоваМВ_07.11.2023_1бит
			
			//ДолгОДН = СальдоОДН[0].ГВ +СальдоОДН[0].ХВ + СальдоОДН[0].ВО + СальдоОДН[0].ЭЭ;
			//Если Переплата >= ДолгОДН Тогда
			//	Переплата = Переплата - ДолгОДН;
			//	Делитель = ДолгОДН;
			//Иначе
			//	Делитель = Переплата;
			//	Переплата = 0;
			//КонецЕсли;     
			СуммаГВ = 0 ;     
			СуммаXВ = 0 ;
			СуммаВО = 0 ;
			СуммаЭЭ = 0 ;
			Если ДолгОДН > 0 Тогда   
				Если ГВ > 0 И ГВ - СтрокаОплаты.ГВОпл >0 Тогда
					СуммаГВ = (ГВ- СтрокаОплаты.ГВОпл)  / ДолгОДН * Переплата;   
				КонецЕсли;
				Если ХВ > 0 И ХВ - СтрокаОплаты.ХВОпл >0 Тогда
					СуммаXВ = (ХВ - СтрокаОплаты.ХВОпл) / ДолгОДН * Переплата;   
				КонецЕсли;
				Если ВО > 0 И ВО - СтрокаОплаты.ВООпл >0 Тогда
					СуммаВО = (ВО - СтрокаОплаты.ВООпл) / ДолгОДН * Переплата;   
				КонецЕсли;
				Если ЭЭ > 0 И ЭЭ - СтрокаОплаты.ЭЛОпл >0 Тогда
					СуммаЭЭ = (ЭЭ - СтрокаОплаты.ЭЛОпл) / ДолгОДН * Переплата;   
				КонецЕсли;
				
				//СуммаХВ = ?(ХВ>0,(ХВ / ДолгОДН * Переплата),0);
				//СуммаВО = ?(ВО>0,(ВО / ДолгОДН * Переплата),0);
				//СуммаЭЭ = ?(ЭЭ>0,(ЭЭ / ДолгОДН * Переплата),0);   

				//++АнисимоваМВ_бит__07.11_2023 чтобы переплата после распределения на ОДН переносилась на Сод рем тек периода
				СуммаГВ =  ?(ГВ > 0 И ГВ - СуммаГВ < 0, (ГВ- СтрокаОплаты.ГВОпл), СуммаГВ);
				СуммаХВ = ?(ХВ > 0 И ХВ - СуммаXВ < 0, (ХВ - СтрокаОплаты.ХВОпл), СуммаXВ);
				СуммаВО = ?(ВО > 0 И ВО -СуммаВО < 0,  (ВО - СтрокаОплаты.ВООпл), СуммаВО);
				СуммаЭЭ = ?(ЭЭ > 0 И ЭЭ - СуммаЭЭ < 0, (ЭЭ - СтрокаОплаты.ЭЛОпл), СуммаЭЭ);  
				//--АнисимоваМВ_бит__07.11_2023    
				
				СтрокаОплаты.ГВОпл = ?(ГВ>0,СуммаГВ + СтрокаОплаты.ГВОпл, СтрокаОплаты.ГВОпл);
				СтрокаОплаты.ХВОпл = ?(ХВ>0,СуммаХВ + СтрокаОплаты.ХВОпл, СтрокаОплаты.ХВОпл);
				СтрокаОплаты.ВООпл = ?(ВО>0,СуммаВО + СтрокаОплаты.ВООпл, СтрокаОплаты.ВООпл);
				СтрокаОплаты.ЭЛОпл = ?(ЭЭ>0,СуммаЭЭ + СтрокаОплаты.ЭЛОпл, СтрокаОплаты.ЭЛОпл);   
				
				//++АнисимоваМВ_бит__07.11_2023 чтобы переплата после распределения на ОДН переносилась на Сод рем тек периода
				//СтрокаОплаты.ГВОпл = ?(ГВ > 0 И ГВ - СтрокаОплаты.ГВОпл < 0, ГВ, СтрокаОплаты.ГВОпл);
				//СтрокаОплаты.ХВОпл = ?(ХВ > 0 И ХВ - СтрокаОплаты.ХВОпл < 0, ХВ, СтрокаОплаты.ХВОпл);
				//СтрокаОплаты.ВООпл = ?(ВО > 0 И ВО - СтрокаОплаты.ВООпл < 0, ВО, СтрокаОплаты.ВООпл);
				//СтрокаОплаты.ЭЛОпл = ?(ЭЭ > 0 И ЭЭ - СтрокаОплаты.ЭЛОпл < 0, ЭЭ,СтрокаОплаты.ЭЛОпл);   
				//--АнисимоваМВ_бит__07.11_2023    
				
				СуммаОплатыТП = 0;      
				 //++bit_AnisimovaMV_20.10.2023     
				 Если ДолгСодРем<0 Тогда
				     СуммаОплатыТП =(-ДолгСодРем) - СуммаГВ -СуммаХВ -СуммаВО -СуммаЭЭ;// Анисимова СуммаСодРем;
				 	 СуммаОплатыПП =СуммаСодРем + ДолгСодРем;     				 
				 Иначе
				 
				 	СуммаОплатыПП = СуммаСодРем + ДолгСодРем;
				 
				 КонецЕсли;
				 //СуммаОплатыПП = СуммаСодРем + ДолгСодРем;
				 //--bit_AnisimovaMV_20.10.2023
				
			Иначе
				СуммаОплатыТП = Переплата;
				СуммаОплатыПП = СуммаСодРем + ДолгСодРем
			КонецЕсли;
		КонецЕсли;
		Если ДолгСодРем < 0 И НЕ ЭтоУслугаСодРем Тогда 
			
			СуммаОплатыПП = ?(СуммаСодРем + ДолгСодРем >=0,СуммаСодРем + ДолгСодРем,0);    
			СуммаОплатыТП = СуммаСодРем - СуммаОплатыПП;
		КонецЕсли;
		
		ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем), "", ОбластьТаблицаПараметрыОплатаЗаПрошлыйПериодСодРем) + Формат(СуммаОплатыПП, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
		ОбластьТаблицаПараметрыОплатаТекПериодСодРем = ?(ЭтоПерваяСтрока или не ЗначениеЗаполнено(ОбластьТаблицаПараметрыОплатаТекПериодСодРем), "", ОбластьТаблицаПараметрыОплатаТекПериодСодРем) + Формат(СуммаОплатыТП, "ЧДЦ=2; ЧРД=,; ЧН=")+ Символы.ПС;
		СуммаОплатыТекПериод = СуммаОплатыТекПериод + СуммаОплатыТП;
		СуммаОплатыПрошлыйПериод = СуммаОплатыПрошлыйПериод + (СуммаОплатыПП);
		ДолгСодРем = ДолгСодРем + СуммаСодРем - СуммаОплатыПП;
	КонецЕсли;
КонецПроцедуры

Функция ПериодСтрокой(ПериодОплаты)
	
	Месяц = Месяц(ПериодОплаты);
	Год = Формат(Год(ПериодОплаты),"ЧГ=") + "г.";
	СтрокаПериода = "";
	Если Месяц = 1 Тогда
		СтрокаПериода = "Январь ";
	ИначеЕсли Месяц = 2 Тогда
		СтрокаПериода = "Февраль ";
	ИначеЕсли Месяц = 3 Тогда
		СтрокаПериода = "Март ";
	ИначеЕсли Месяц = 4 Тогда
		СтрокаПериода = "Апрель ";
	ИначеЕсли Месяц = 5 Тогда
		СтрокаПериода = "Май ";
	ИначеЕсли Месяц = 6 Тогда
		СтрокаПериода = "Июнь ";
	ИначеЕсли Месяц = 7 Тогда
		СтрокаПериода = "Июль ";
	ИначеЕсли Месяц = 8 Тогда
		СтрокаПериода = "Август ";
	ИначеЕсли Месяц = 9 Тогда
		СтрокаПериода = "Сентябрь ";
	ИначеЕсли Месяц = 10 Тогда
		СтрокаПериода = "Октябрь ";
	ИначеЕсли Месяц = 11 Тогда
		СтрокаПериода = "Ноябрь ";
	Иначе
		СтрокаПериода = "Декабрь ";
	КонецЕсли;
	
	Возврат СтрокаПериода + Год;	
	
КонецФункции

Процедура ЗаполнитьНачисленияПоУслуге(ОбластьТаблица, ДанныеПоЛС, ДанныеРазовые, СтрокаОплаты, Услуга, Площадь, СуммаПерерасчеты, СуммаНачислено, УслугаНач, Коэфф); 
	
	СтрокаРазовые = НайтиСтрокуРазовые(ДанныеРазовые, ГруппаУслуг(Услуга));
	ОбластьТаблица.Параметры.Перерасчеты = ?(ЗначениеЗаполнено(СтрокаРазовые), Формат(СтрокаРазовые.СуммаОборот * Коэфф, "ЧДЦ=2; ЧН="), 0);
	СуммаПерерасчеты = СуммаПерерасчеты + ?(ЗначениеЗаполнено(СтрокаРазовые), СтрокаРазовые.СуммаОборот * Коэфф, 0);
	
	Если Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000003") Тогда//кап ремм
		ОбластьТаблица.Параметры.Начислено =  Формат(Окр((СтрокаОплаты.МинВзносНач + СтрокаОплаты.ДопВзносНач + СтрокаОплаты.РФКРНач) * Коэфф, 2), "ЧДЦ=2");
		СуммаНачислено = СуммаНачислено + (СтрокаОплаты.МинВзносНач + СтрокаОплаты.ДопВзносНач + СтрокаОплаты.РФКРНач)* Коэфф;
		ОбластьТаблица.Параметры.ЕдИзм = "м2";
		ОбластьТаблица.Параметры.Тариф = Окр(ДанныеПоЛС.ТарифМинВзнос , 4); 
		ОбластьТаблица.Параметры.Объем =  Формат(Окр(Площадь * Коэфф, 4), "ЧДЦ=2");
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000002") Тогда //антена
		ОбластьТаблица.Параметры.Начислено =  Окр((СтрокаОплаты.ПрофиНач) * Коэфф, 2);
		СуммаНачислено = СуммаНачислено + ОбластьТаблица.Параметры.Начислено;
		ОбластьТаблица.Параметры.ЕдИзм = "точка";
		ОбластьТаблица.Параметры.Тариф = 0;
		ОбластьТаблица.Параметры.Объем =  1;
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Домофон") Тогда//антена
		ОбластьТаблица.Параметры.Начислено =  Окр((СтрокаОплаты.ДомофонНач) , 2);
		СуммаНачислено = СуммаНачислено + ОбластьТаблица.Параметры.Начислено;
		ОбластьТаблица.Параметры.ЕдИзм = "точка";
		ОбластьТаблица.Параметры.Тариф = 0;
		ОбластьТаблица.Параметры.Объем =  1;		
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Газоснабжение") Тогда//антена
		ОбластьТаблица.Параметры.Начислено =  Окр((СтрокаОплаты.ГазоснабжениеНач) , 2);
		СуммаНачислено = СуммаНачислено + ОбластьТаблица.Параметры.Начислено;
		ОбластьТаблица.Параметры.ЕдИзм = "м3";
		ОбластьТаблица.Параметры.Тариф = 0;
		ОбластьТаблица.Параметры.Объем =  1;
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Доп.услуга") Тогда//антена
		ОбластьТаблица.Параметры.Начислено =  Окр((СтрокаОплаты.ДопНач) , 2);
		СуммаНачислено = СуммаНачислено + ОбластьТаблица.Параметры.Начислено;
		ОбластьТаблица.Параметры.ЕдИзм = "";
		ОбластьТаблица.Параметры.Тариф = 0;
		ОбластьТаблица.Параметры.Объем =  0;
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Орг.ФКР") Тогда//антена
		ОбластьТаблица.Параметры.Начислено =  Окр((СтрокаОплаты.ОргФКРНач) , 2);
		СуммаНачислено = СуммаНачислено + ОбластьТаблица.Параметры.Начислено;
		ОбластьТаблица.Параметры.ЕдИзм = "";
		ОбластьТаблица.Параметры.Тариф = 0;
		ОбластьТаблица.Параметры.Объем =  0;
	Иначе
		Возврат;
	КонецЕсли;
	
	УслугаНач = ОбластьТаблица.Параметры.Начислено;
	
КонецПроцедуры

Функция ПолучитьСуммуОплатыПоуслуге(СтрокаОплаты, Услуга)
	
	Если Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000003") Тогда//кап ремм
		Возврат (СтрокаОплаты.МинВзносОпл + СтрокаОплаты.ДопВзносОпл + СтрокаОплаты.РФКРОпл);
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоКоду("00-000002") Тогда//антена
		Возврат СтрокаОплаты.ПрофиОпл;
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Домофон") Тогда//антена
		Возврат СтрокаОплаты.ДомофонОпл;
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Газоснабжение") Тогда//антена
		Возврат СтрокаОплаты.ГазоснабжениеОпл;
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Доп.услуга") Тогда//антена
		Возврат СтрокаОплаты.ДопОпл;
	ИначеЕсли Услуга.ГруппаУслуги = Справочники.бит_ГруппыУслуг.НайтиПоНаименованию("Орг.ФКР") Тогда//антена
		Возврат СтрокаОплаты.ОргФКРОпл;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНачальноеСальдо(ЛС, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ = &ГВ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ГВ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ = &ХВ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ХВ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ = &ВО
		|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВО,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ = &ЭЭ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЭЭ
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&Период, ЛицевойСчет = &ЛС) КАК бит_НачисленияПоУслугамЖКХОстатки";
	ВО     	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000015");
	ГВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011");
	ХВ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012");
	ЭЭ    	    = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010");
	
	Запрос.УстановитьПараметр("ВО", ВО);
	Запрос.УстановитьПараметр("ГВ", ГВ);
	Запрос.УстановитьПараметр("ХВ", ХВ);
	Запрос.УстановитьПараметр("ЭЭ", ЭЭ);
	
	Запрос.УстановитьПараметр("ЛС", ЛС);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ВОзврат РезультатЗапроса;
		
КонецФункции

Функция НайтиСтрокуРазовые(ДанныеРазовые, МассивУслуг)
	
	Если не ТипЗнч(МассивУслуг) = Тип("Массив") Тогда
		Возврат  ДанныеРазовые.Найти(МассивУслуг, "УслугаЖКХ"	);
	КонецЕсли;
	
	Для каждого Услуга Из МассивУслуг Цикл
	
		СтрокаРазовые = ДанныеРазовые.Найти(Услуга, "УслугаЖКХ"	);
		Если ЗначениеЗаполнено(СтрокаРазовые) Тогда
			Возврат СтрокаРазовые;
		КонецЕсли;
	
	КонецЦикла;
	
КонецФункции