
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем КлючТекущихНастроек;
	
	КлючОбъекта = Параметры.КлючОбъекта;	
	КлючТекущихНастроек = Параметры.КлючТекущихНастроек;		
	
	// Список предопределённых
	СтандартныеВарианты = Параметры.СтандартныеНастройки; 
	
	ОбновитьТаблицуВариантов(КлючТекущихНастроек);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаСохраненныеВариантыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьВариант();
	
КонецПроцедуры // ТаблицаСохраненныеВариантыВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ВыбратьВариант();
	
КонецПроцедуры // КомандаВыбрать()

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьТаблицуВариантов();
	
КонецПроцедуры // КомандаОбновить()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Клиент

&НаКлиенте
Процедура ВыбратьВариант()
	
	ТекущиеДанные = Элементы.ТаблицаСохраненныеВарианты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Закрыть();
		
	Иначе
		
		ТекКлюч = ТекущиеДанные.КлючВарианта;
		
		ВыборВарианта = Новый ВыборНастроек(ТекКлюч);
		Закрыть(ВыборВарианта);
		
	КонецЕсли; 
	
КонецПроцедуры // ВыбратьВариант()

////////////////////////////////////////////////////////////////////////////////
// Сервер

&НаСервере
Процедура ОбновитьТаблицуВариантов(КлючТекущихНастроек = Неопределено)
	
	ИдТекущейСтроки = Неопределено;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВариантыОтчетов.Ссылка,
	|	бит_ВариантыОтчетов.Наименование,
	|	бит_ВариантыОтчетов.ИспользоватьПриОткрытии,
	|	бит_ВариантыОтчетов.Ответственный,
	|	бит_ВариантыОтчетов.КлючВарианта,
	|	бит_ВариантыОтчетов.ТипВарианта
	|ИЗ
	|	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
	|ГДЕ
	|	бит_ВариантыОтчетов.КлючОбъекта = &КлючОбъекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ВариантыОтчетов.Наименование
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ТаблицаСохраненныеВарианты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		// БИТ_ЖКХ 21.01.2015{{
		Если Выборка.Ответственный = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ВсеПользователи") 
			или	Выборка.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь") Тогда
			
			НоваяСтрока = ТаблицаСохраненныеВарианты.Добавить();
			НоваяСтрока.СохраненныйВариант      = Выборка.Ссылка;
			НоваяСтрока.КлючВарианта            = Выборка.КлючВарианта;
			НоваяСтрока.Ответственный           = Выборка.Ответственный;
			НоваяСтрока.ИспользоватьПриОткрытии = Выборка.ИспользоватьПриОткрытии;
			
			Если Выборка.ТипВарианта = Перечисления.бит_ТипыВариантовОтчетов.Предопределенный Тогда
				НоваяСтрока.ЭтоПредопределенный  = Истина;
				СтандартныйВар = СтандартныеВарианты.НайтиПоЗначению(Выборка.КлючВарианта);
				Если СтандартныйВар <> Неопределено Тогда
					НоваяСтрока.Представление = СтандартныйВар.Представление;
				Иначе 
					НоваяСтрока.Представление =  Выборка.Наименование;
				КонецЕсли; 
			Иначе
				НоваяСтрока.Представление =  Выборка.Наименование;
			КонецЕсли;
			
			Если КлючТекущихНастроек = Выборка.КлючВарианта Тогда
				ИдТекущейСтроки = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		// БИТ_ЖКХ 21.01.2015}}
		
	КонецЦикла;
	
	Если ИдТекущейСтроки <> Неопределено Тогда
		Элементы.ТаблицаСохраненныеВарианты.ТекущаяСтрока = ИдТекущейСтроки;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьТаблицуВариантов()

#КонецОбласти
