&НаКлиенте
Перем КонтекстЭДОКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Параметры.СтандартнаяОбработка;
	
	ПолучитьОтпечаткиСертификатовИзНастроекОрганизацииДляФСС();
	
	Если СертификатыСтрахователя.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	Если СтандартнаяОбработка Тогда
		
		ПродолжитьАвтообмен = Истина;
		
		ИтогиПоСообщениям = Параметры.ИтогиПоСообщениям;
		Если ТипЗнч(ИтогиПоСообщениям) <> Тип("Массив") И ИтогиПоСообщениям.Количество() = 0 Тогда 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ЗаполнитьРеквизитыИНастройки(ИтогиПоСообщениям, Отказ);
		
		ОпределитьКоличествоСообщенийКРасшифровке();
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Параметр = Неопределено ИЛИ ТипЗнч(Параметр) <> Тип("Массив") Тогда 
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ЗаполнитьРеквизитыИНастройки(Неопределено, Отказ);
	Если Отказ Тогда 
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБПКлиент.ПодключениеОбработчикаОжиданияАвтообмена(ПродолжитьАвтообмен);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРасшифровать(Команда)
	
	СписокОткрыт = Ложь;
	
	ИмяФормыСпискаСообщений = "Документ.ИзвещениеФСС.Форма.ФормаСписка";
	
	Окна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из Окна Цикл
		Если ТипЗнч(ОткрытоеОкно) = Тип("ОкноКлиентскогоПриложения") 
			И ОткрытоеОкно.Содержимое.Количество() = 1
			И ОткрытоеОкно.Содержимое[0].ИмяФормы  = ИмяФормыСпискаСообщений Тогда
			
			ОткрытоеОкноСпискаСообщений = ОткрытоеОкно.Содержимое[0];
			Если ОткрытоеОкноСпискаСообщений.Открыта() Тогда
				ОткрытоеОкноСпискаСообщений.Параметры.ЗагрузитьИзвещения = Истина;
				ОткрытоеОкноСпискаСообщений.Открыть();
				СписокОткрыт = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ СписокОткрыт Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗагрузитьИзвещения", Истина);
		ОткрытьФорму("Документ.ИзвещениеФСС.ФормаСписка", ПараметрыФормы);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеПоказывать(Команда)
	
	ПродолжитьАвтообмен = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПозже(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьОтпечаткиСертификатовИзНастроекОрганизацииДляФСС()
	
	ОрганизацииИспользующиеОбменФСС = Новый ФиксированныйМассив(ЭлектронныйДокументооборотСФСС.ОрганизацииИспользующиеОбменФСС());
	Если ОрганизацииИспользующиеОбменФСС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	
	Для Каждого ОрганизацияСсылка Из ОрганизацииИспользующиеОбменФСС Цикл
		ОтпечатокСертификата = КонтекстЭДО.ПолучитьОтпечаткиСертификатовИзНастроекОрганизацииДляФСС(ОрганизацияСсылка);
		Если ОтпечатокСертификата <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(ОтпечатокСертификата.СертификатСтрахователяОтпечаток) Тогда
				НоваяСтрока = СертификатыСтрахователя.Добавить();
				НоваяСтрока.СертификатСтрахователяОтпечаток = ОтпечатокСертификата.СертификатСтрахователяОтпечаток;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыИНастройки(ИтогиПоСообщениям, Отказ)
	
	Если ИтогиПоСообщениям = Неопределено Тогда
		ИтогиПоСообщениям = ПолучитьИОбработатьВходящие(УникальныйИдентификатор);
		Если ИтогиПоСообщениям = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаРасшифровкиПоОрганизациям.Очистить();
	
	Для Каждого СтрокаРезультата Из ИтогиПоСообщениям Цикл
		
		НоваяСтрока = ТаблицаРасшифровкиПоОрганизациям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
		НоваяСтрока.Отметка = Истина;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Отказ = Ложь;
	ЗаполнитьРеквизитыИНастройки(Неопределено, Отказ);
	Если Отказ Тогда 
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьКоличествоСообщенийКРасшифровке()

	КоличествоСообщенийКРасшифровке = ТаблицаРасшифровкиПоОрганизациям.Итог("КоличествоСообщений");
	
	ТекстНадписи = НСтр("ru = 'Получено %1 от СЭДО ФСС.
                         |Расшифровать сообщения сейчас?'");
						 
	ЧислоИПредметИсчисления = ДлительнаяОтправкаКлиентСервер.ЧислоИПредметИсчисления(
		КоличествоСообщенийКРасшифровке,
		"сообщение",
		"сообщения",
		"сообщений",
		"с");
						 
	ТекстНадписи = СтрШаблон(ТекстНадписи, ЧислоИПредметИсчисления);
	Элементы.ТекстНадписи.Заголовок = ТекстНадписи;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
КонецПроцедуры

#Область Автообмен

&НаСервереБезКонтекста
Функция ПолучитьИОбработатьВходящие(ИдентификаторФормы)
	
	// определяем наличие УЗДО для текущего пользователя ИБ
	Если НЕ УчетЗарплаты.ТекущемуПользователюСЭДОФССДоступен() Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДатаТекущегоАвтообменаСКО = ТекущаяДатаСеанса();
	
	Результат = НовыеСообщения();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьИОбработатьВходящиеКлиент() Экспорт
	
	Если СертификатыСтрахователя.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОтпечаток = СертификатыСтрахователя[0];
	ТекущийОтпечаток.Проверен = Истина;
	СертификатСтрахователяОтпечаток = ТекущийОтпечаток.СертификатСтрахователяОтпечаток;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СертификатСтрахователяОтпечаток", СертификатСтрахователяОтпечаток);
	Оповещение = Новый ОписаниеОповещения("НайтиСертификатПоОтпечаткуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	КриптографияЭДКОКлиент.НайтиСертификатПоОтпечатку(Оповещение,
		СертификатСтрахователяОтпечаток,
		,
		,
		Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСертификатПоОтпечаткуЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат.Выполнено
		Или НЕ Результат.СертификатНайден Тогда
		
		МассивНепроверенныхСтрок = СертификатыСтрахователя.НайтиСтроки(Новый Структура("Проверен",Ложь));
		Если МассивНепроверенныхСтрок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ТекущийОтпечаток = МассивНепроверенныхСтрок[0];
		ТекущийОтпечаток.Проверен = Истина;
		СертификатСтрахователяОтпечаток = ТекущийОтпечаток.СертификатСтрахователяОтпечаток;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СертификатСтрахователяОтпечаток", СертификатСтрахователяОтпечаток);
		Оповещение = Новый ОписаниеОповещения("НайтиСертификатПоОтпечаткуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		КриптографияЭДКОКлиент.НайтиСертификатПоОтпечатку(Оповещение,
			СертификатСтрахователяОтпечаток,
			,
			,
			Ложь);
		
	Иначе
		ВходящиеСообщения = ПолучитьИОбработатьВходящие(УникальныйИдентификатор);
		Если ВходящиеСообщения = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// выводим диалог
		Если ВходящиеСообщения.Количество() > 0 Тогда 
			ВыполнитьРасшифровкуПриНеобходимости(ВходящиеСообщения);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ФормаРасшифровкиСообщенийОткрыта()
	
	Окна = ПолучитьОкна();
	
	Если Окна = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФормыСообщенийТребующихРасшифровки = "Документ.ИзвещениеФСС.Форма.ПоказСообщенийТребующихРасшифровки";
	
	// Для формы, открытой в режиме "РежимОткрытияОкнаФормы.БлокироватьОкноВладельца",
	// не выполняется поиск по уникальному идентификатору, поэтому приходится искать самим.
	Для Каждого ОткрытоеОкно Из Окна Цикл
		Если ТипЗнч(ОткрытоеОкно) = Тип("ОкноКлиентскогоПриложения") 
			И ОткрытоеОкно.Содержимое.Количество() = 1
			И ОткрытоеОкно.Содержимое[0].ИмяФормы  = ИмяФормыСообщенийТребующихРасшифровки Тогда
			
			Возврат ОткрытоеОкно.Содержимое[0].Открыта();
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ФормаРасшифровкиРегламентированнойОтчетностиОткрыта()
	
	Окна = ПолучитьОкна();
	
	Если Окна = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПутьКОбъекту = "Обработка.ДокументооборотСКонтролирующимиОрганами";
	
	ИмяФормыСообщенийТребующихРасшифровки = ПутьКОбъекту + ".Форма.ПоказСообщенийТребующихРасшифровки";
	ИмяФормыОшибкиОтправки 		= ПутьКОбъекту + ".Форма.ОшибкиОтправки";
	ИмяФормыРезультатОбмена 	= ПутьКОбъекту + ".Форма.РезультатОбмена";
	ИмяФормыДлительноеДействие 	= ПутьКОбъекту + ".Форма.ДлительноеДействие";
	
	// Для формы, открытой в режиме "РежимОткрытияОкнаФормы.БлокироватьОкноВладельца",
	// не выполняется поиск по уникальному идентификатору, поэтому приходится искать самим.
	Для Каждого ОткрытоеОкно Из Окна Цикл
		Если ТипЗнч(ОткрытоеОкно) = Тип("ОкноКлиентскогоПриложения") 
			И ОткрытоеОкно.Содержимое.Количество() = 1
			И (ОткрытоеОкно.Содержимое[0].ИмяФормы  = ИмяФормыСообщенийТребующихРасшифровки
			ИЛИ ОткрытоеОкно.Содержимое[0].ИмяФормы = ИмяФормыОшибкиОтправки
			ИЛИ ОткрытоеОкно.Содержимое[0].ИмяФормы = ИмяФормыРезультатОбмена
			ИЛИ ОткрытоеОкно.Содержимое[0].ИмяФормы = ИмяФормыДлительноеДействие) Тогда
			
			Возврат ОткрытоеОкно.Содержимое[0].Открыта();
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьРасшифровкуПриНеобходимости(ТребующиеРасшифровки)
	
	Если ФормаРасшифровкиСообщенийОткрыта()                                 // Исключим повторное открытие
		ИЛИ ФормаРасшифровкиРегламентированнойОтчетностиОткрыта()           // Исключим перекрытие форм регл.отчетности
		ИЛИ ДлительнаяОтправкаКлиентСервер.ФормаДлительнойОтправкиОткрыта() // Исключим перекрвтие формы длительной операции
		Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ИтогиПоСообщениям", ТребующиеРасшифровки);
	ПараметрыОперации.Вставить("СтандартнаяОбработка", Истина);
	
	ОткрытьФорму("Документ.ИзвещениеФСС.Форма.ПоказСообщенийТребующихРасшифровки",
		ПараметрыОперации);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыеСообщения()
	
	МассивСообщений = Новый Массив;
	
	МассивОрганизаций = ЭлектронныйДокументооборотСФСС.ОрганизацииИспользующиеОбменФСС();
	Для Каждого ЗаписьМассива ИЗ МассивОрганизаций Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", ЗаписьМассива);
		Отбор.Вставить("Тип",         10);
		ТаблицаДокументов = ЭлектронныйДокументооборотСФСС.НовыеСообщенияСЭДОФСС(Отбор);
		
		КоличествоСообщений = ТаблицаДокументов.Количество();
		Если КоличествоСообщений = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСообщений.Добавить(Новый Структура("Организация, КоличествоСообщений", ЗаписьМассива, КоличествоСообщений));
	КонецЦикла;
	
	Возврат МассивСообщений;
	
КонецФункции

#КонецОбласти

#КонецОбласти