
#Область ЭкспортныеПроцедруыИФункции

// БИТ_ЖКХ 15.12.2010. 
// 
Процедура бит_ОбработкаРасшифровкиОтчета(ОтчетОбъект, ФормаОтчета, Расшифровка, СтандартнаяОбработка) Экспорт
	
	Расшифровки = Истина;
	
КонецПроцедуры

// Процедура заполняет настройки групп СКД.
// Прааметры:
//
// Источник - Структура - Эталон СКД.
//
// Приемник - Структура - Структура групп СКД для настрйоки. 
// 
Процедура НастройкаСтруктурыСКД(Источник, Приемник, КомпановкаНастроек, ДокументыРасчетов = Ложь, ПоследняяГруппировка) Экспорт

	Приемник.Очистить();
	
	Если Источник.Количество() > 0 Тогда
		
		Для каждого ЭлементИсточник Из Источник Цикл
			
			Если ТипЗнч(ЭлементИсточник) = Тип("ГруппировкаКомпоновкиДанных") Тогда
				
				НоваяГруппировка = Приемник.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
				
				Для каждого ПолеГруппировки Из ЭлементИсточник.ПоляГруппировки.Элементы Цикл
					
					ДоступноеПолеГруппировки =  КомпановкаНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ПолеГруппировки.Поле);
					Если ТипЗнч(ДоступноеПолеГруппировки) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
						
						НовоеПолеГрупировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
						НовоеПолеГрупировки.Поле           = ДоступноеПолеГруппировки.Поле;
						НовоеПолеГрупировки.Использование  = ПолеГруппировки.Использование;
						НовоеПолеГрупировки.КонецПериода   = ПолеГруппировки.КонецПериода;
						НовоеПолеГрупировки.НачалоПериода  = ПолеГруппировки.НачалоПериода;
						НовоеПолеГрупировки.ТипГруппировки = ПолеГруппировки.ТипГруппировки;
						НовоеПолеГрупировки.ТипДополнения  = ПолеГруппировки.ТипДополнения;
						
					КонецЕсли; 
				КонецЦикла; 
				
				Если НоваяГруппировка.ПоляГруппировки.Элементы.Количество()> 0 Тогда
					
					ИсточникСтруктура = ЭлементИсточник.Структура;
					ПриемникСтурктура = НоваяГруппировка.Структура;
					
					НастройкаСтруктурыСКД(ИсточникСтруктура, ПриемникСтурктура, КомпановкаНастроек, Истина,ПоследняяГруппировка);
					
				Иначе
					Приемник.Удалить(НоваяГруппировка);
				КонецЕсли; 
				
			ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ТаблицаКомпоновкиДанных") Тогда
				
				НоваяГруппировка = Приемник.Добавить(Тип("ТаблицаКомпоновкиДанных"));
				НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				
				// Заполнение колонок таблицы.
				Для каждого ПолеГруппировкиКолонки Из ЭлементИсточник.Колонки Цикл
					
					НоваяКолонкаГруппировки =  НоваяГруппировка.Колонки.Добавить();
					НоваяКолонкаГруппировки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
					НоваяКолонкаГруппировки.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
					
					Для каждого ПолеГруппировки Из ПолеГруппировкиКолонки.ПоляГруппировки.Элементы Цикл
						
						ДоступноеПолеГруппировки =  КомпановкаНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ПолеГруппировки.Поле);
						Если ТипЗнч(ДоступноеПолеГруппировки) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
							
							НовоеПолеГрупировки = НоваяКолонкаГруппировки.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
							НовоеПолеГрупировки.Поле           = ДоступноеПолеГруппировки.Поле;
							НовоеПолеГрупировки.Использование  = ПолеГруппировки.Использование;
							НовоеПолеГрупировки.КонецПериода   = ПолеГруппировки.КонецПериода;
							НовоеПолеГрупировки.НачалоПериода  = ПолеГруппировки.НачалоПериода;
							НовоеПолеГрупировки.ТипГруппировки = ПолеГруппировки.ТипГруппировки;
							НовоеПолеГрупировки.ТипДополнения  = ПолеГруппировки.ТипДополнения;
							
						КонецЕсли; 
						
					КонецЦикла;
					
					Если НоваяКолонкаГруппировки.ПоляГруппировки.Элементы.Количество()> 0 Тогда
						
						ИсточникСтруктура = ПолеГруппировкиКолонки.Структура;
						ПриемникСтурктура = НоваяКолонкаГруппировки.Структура;
						
						ОбработкаГрупировокТаблицСКД(ИсточникСтруктура, ПриемникСтурктура, КомпановкаНастроек,, ПоследняяГруппировка);
						
					Иначе
						Приемник.Удалить(НоваяКолонкаГруппировки);
					КонецЕсли; 
					
				КонецЦикла; 
				
				// Заполнение строк таблицы.
				Для каждого ПолеГруппировкиСтрока Из ЭлементИсточник.Строки Цикл
					
					НоваяСтрокаГруппировки =  НоваяГруппировка.Строки.Добавить();
					НоваяСтрокаГруппировки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
					НоваяСтрокаГруппировки.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
					
					Для каждого ПолеГруппировки Из ПолеГруппировкиСтрока.ПоляГруппировки.Элементы Цикл
						
						ДоступноеПолеГруппировки =  КомпановкаНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ПолеГруппировки.Поле);
						Если ТипЗнч(ДоступноеПолеГруппировки) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
							
							НовоеПолеГрупировки = НоваяСтрокаГруппировки.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
							НовоеПолеГрупировки.Поле           = ДоступноеПолеГруппировки.Поле;
							НовоеПолеГрупировки.Использование  = ПолеГруппировки.Использование;
							НовоеПолеГрупировки.КонецПериода   = ПолеГруппировки.КонецПериода;
							НовоеПолеГрупировки.НачалоПериода  = ПолеГруппировки.НачалоПериода;
							НовоеПолеГрупировки.ТипГруппировки = ПолеГруппировки.ТипГруппировки;
							НовоеПолеГрупировки.ТипДополнения  = ПолеГруппировки.ТипДополнения;
							
						КонецЕсли; 
						
					КонецЦикла;
					
					Если НоваяСтрокаГруппировки.ПоляГруппировки.Элементы.Количество()> 0 Тогда
						
						ИсточникСтруктура = ПолеГруппировкиСтрока.Структура;
						ПриемникСтурктура = НоваяСтрокаГруппировки.Структура;
						
						ОбработкаГрупировокТаблицСКД(ИсточникСтруктура, ПриемникСтурктура, КомпановкаНастроек, Истина, ПоследняяГруппировка);
						
					Иначе
						Приемник.Удалить(НоваяСтрокаГруппировки);
					КонецЕсли; 
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Иначе
		
		Если ДокументыРасчетов Тогда
			ПолеКомпановки = КомпановкаНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ПоследняяГруппировка));  
			
			Если ТипЗнч(ПолеКомпановки) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
				
				НоваяГруппировка = Приемник.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				
				НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных")); 
				
				НовоеПолеГрупировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				НовоеПолеГрупировки.Поле = ПолеКомпановки.Поле;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

// Процедура отрисовки гурппировок "Таблица".
//
Процедура ОбработкаГрупировокТаблицСКД(Источник, Приемник, КомпановкаНастроек, ЭтоСтроки = Ложь, ПоследняяГруппировка)
	
	Приемник.Очистить();
	
	Если Источник.Количество() > 0 Тогда
		
		Для каждого ЭлементИсточник Из Источник Цикл
			
			Если ТипЗнч(ЭлементИсточник) = Тип("ГруппировкаТаблицыКомпоновкиДанных")  Тогда
				
				НоваяГруппировка = Приемник.Добавить();
				НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
				
				Для каждого ПолеГруппировки Из ЭлементИсточник.ПоляГруппировки.Элементы Цикл
					
					ДоступноеПолеГруппировки =  КомпановкаНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ПолеГруппировки.Поле);
					Если ТипЗнч(ДоступноеПолеГруппировки) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
						
						НовоеПолеГрупировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
						НовоеПолеГрупировки.Поле           = ДоступноеПолеГруппировки.Поле;
						НовоеПолеГрупировки.Использование  = ПолеГруппировки.Использование;
						НовоеПолеГрупировки.КонецПериода   = ПолеГруппировки.КонецПериода;
						НовоеПолеГрупировки.НачалоПериода  = ПолеГруппировки.НачалоПериода;
						НовоеПолеГрупировки.ТипГруппировки = ПолеГруппировки.ТипГруппировки;
						НовоеПолеГрупировки.ТипДополнения  = ПолеГруппировки.ТипДополнения;
						
					КонецЕсли; 
				КонецЦикла; 
				
				Если НоваяГруппировка.ПоляГруппировки.Элементы.Количество()> 0 Тогда
					
					ИсточникСтруктура = ЭлементИсточник.Структура;
					ПриемникСтурктура = НоваяГруппировка.Структура;
					
					ОбработкаГрупировокТаблицСКД(ИсточникСтруктура, ПриемникСтурктура, КомпановкаНастроек, ЭтоСтроки, ПоследняяГруппировка);
					
				Иначе
					Приемник.Удалить(НоваяГруппировка);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		Если ЭтоСтроки Тогда
			ПолеКомпановки = КомпановкаНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ПоследняяГруппировка));  
			
			Если ТипЗнч(ПолеКомпановки) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
				
				НоваяГруппировка = Приемник.Добавить();
				
				НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных")); 
				
				НовоеПолеГрупировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				НовоеПолеГрупировки.Поле = ПолеКомпановки.Поле;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры	

// Функция определения лита значения.
//
Функция ПростойТип(Значение) Экспорт
	
	ОписаниеПростыхТипов = Новый ОписаниеТипов("Дата, Строка, Булево, Число");
	
	Возврат ОписаниеПростыхТипов.СодержитТип(ТипЗнч(Значение));
	
КонецФункции

#КонецОбласти

#Область ГруппировкиИОтборы

// Функция добавляет отбор в СКД.
//
Функция ДобавитьОтбор(ЭлементСтруктуры, Знач Поле, Значение = Неопределено, ВидСравнения = Неопределено, Использование = Истина) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.Использование  = Использование;
	НовыйЭлемент.ЛевоеЗначение  = Поле;
	НовыйЭлемент.ВидСравнения   = ВидСравнения;
	
	Если Значение <> Неопределено Тогда
		НовыйЭлемент.ПравоеЗначение = Значение;
	КонецЕсли; 
	
	Возврат НовыйЭлемент;
	
КонецФункции

Процедура ГруппировкаПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", Форма.СхемаКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", Форма.Подключаемый_ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ПараметрыВыбранногоПоля = Неопределено;

	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ГруппировкаПередНачаломДобавленияЗавершение", бит_Отчеты, Новый Структура("Форма", Форма)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

Процедура ГруппировкаПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Форма = ДополнительныеПараметры.Форма;
    
    
    ПараметрыВыбранногоПоля = Результат;
    
    Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
        НоваяСтрока = Форма.Отчет.Группировка.Добавить();
        НоваяСтрока.Использование = Истина;
        НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
        НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
        
        Если Не ЗначениеЗаполнено(Форма.ИдентификаторЗадания) Тогда
            бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Форма.Элементы.Результат, "НеАктуальность");
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

Процедура ГруппировкаПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	Если Элемент.ТекущийЭлемент = Форма.Элементы.ГруппировкаПредставление Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", Форма.СхемаКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим"          , "Группировка");
		ПараметрыФормы.Вставить("ИсключенныеПоля", Форма.Подключаемый_ПолучитьЗапрещенныеПоля("Группировка"));
		ПараметрыФормы.Вставить("ТекущаяСтрока"  , Элемент.ТекущиеДанные.Поле);
		ПараметрыВыбранногоПоля = Неопределено;

		ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ГруппировкаПередНачаломИзмененияЗавершение", бит_Отчеты, Новый Структура("Форма, Элемент", Форма, Элемент)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ГруппировкаПередНачаломИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Форма = ДополнительныеПараметры.Форма;
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    ПараметрыВыбранногоПоля = Результат;
    
    Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
        НоваяСтрока = Элемент.ТекущиеДанные;
        НоваяСтрока.Использование = Истина;
        НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
        НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
        
        Если Не ЗначениеЗаполнено(Форма.ИдентификаторЗадания) Тогда
            бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Форма.Элементы.Результат, "НеАктуальность");
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоляРесурсовВЗапрещенныеПоля(Форма, СписокПолей) Экспорт
	
	Попытка
		НаборПоказателей = Форма.НаборПоказателей;
	Исключение
		НаборПоказателей = Неопределено;
	КонецПопытки;
	
	Если НаборПоказателей = Неопределено Тогда
		Для Каждого ДоступноеПоле Из Форма.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы Цикл
			Если ДоступноеПоле.Ресурс Тогда
				СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ИмяПоказателя Из Форма.НаборПоказателей Цикл
			Если Форма.Отчет["Показатель" + ИмяПоказателя] Тогда 
				ВидОстатка = "";
				Если Форма.Отчет.Свойство("РазвернутоеСальдо") Тогда
					Если ТипЗнч(Форма.Отчет.РазвернутоеСальдо) = Тип("Булево") Тогда
						Если Форма.Отчет.РазвернутоеСальдо Тогда
							ВидОстатка = "";
						Иначе
							ВидОстатка = "Развернутый";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				СписокПолей.Добавить("СальдоНаНачалоПериода." + ИмяПоказателя + "Начальный" + ВидОстатка + "ОстатокДт");
				СписокПолей.Добавить("СальдоНаНачалоПериода." + ИмяПоказателя + "Начальный" + ВидОстатка + "ОстатокКт");
				СписокПолей.Добавить("СальдоНаКонецПериода." + ИмяПоказателя + "Конечный" + ВидОстатка + "ОстатокДт");
				СписокПолей.Добавить("СальдоНаКонецПериода." + ИмяПоказателя + "Конечный" + ВидОстатка + "ОстатокКт");
			Иначе
				СписокПолей.Добавить("СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокДт");
				СписокПолей.Добавить("СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокКт");
				СписокПолей.Добавить("ОборотыЗаПериод." + ИмяПоказателя + "ОборотДт");
				СписокПолей.Добавить("ОборотыЗаПериод." + ИмяПоказателя + "ОборотКт");
				СписокПолей.Добавить("СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйОстатокДт");
				СписокПолей.Добавить("СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйОстатокКт");
				СписокПолей.Добавить("СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйРазвернутыйОстатокДт");
				СписокПолей.Добавить("СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйРазвернутыйОстатокКт");
				СписокПолей.Добавить("СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйРазвернутыйОстатокДт");
				СписокПолей.Добавить("СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйРазвернутыйОстатокКт");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОтборыПриИзменении(Форма, Элемент) Экспорт
	
	Отчет = Форма.Отчет;
	Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.Использование Тогда
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда				
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда 
					Отчет.Организация = ЭлементОтбора.ПравоеЗначение;	
				Иначе
					Отчет.Организация = Неопределено;	
				КонецЕсли; 
				
				Отчет.ВключатьОбособленныеПодразделения = Ложь;
				
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда 
					Отчет.Подразделение = ЭлементОтбора.ПравоеЗначение;
				Иначе
					Отчет.Подразделение = Неопределено;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтборыПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", Форма.СхемаКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим"                , "Отбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.Подключаемый_ПолучитьЗапрещенныеПоля("Отбор"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"        , Неопределено);
	ПараметрыВыбранногоПоля = Неопределено;

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ОтборыПередНачаломДобавленияЗавершение", бит_Отчеты, Новый Структура("Форма, Элемент", Форма, Элемент)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

Процедура ОтборыПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Форма = ДополнительныеПараметры.Форма;
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    ПараметрыВыбранногоПоля = Результат;
    
    Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
        
        Если Элемент.ТекущаяСтрока = Неопределено Тогда
            ТекущаяСтрока = Неопределено;
        Иначе
            ТекущаяСтрока = Форма.Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
        КонецЕсли;
        
        Если ТипЗнч(ТекущаяСтрока) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
            ЭлементОтбора = ТекущаяСтрока.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ИначеЕсли ТипЗнч(ТекущаяСтрока) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
            Если ТекущаяСтрока.Родитель <> Неопределено Тогда
                ЭлементОтбора = ТекущаяСтрока.Родитель.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
            Иначе
                ЭлементОтбора = Форма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
            КонецЕсли;
        Иначе
            ЭлементОтбора = Форма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        КонецЕсли;
        
        ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
        Если Строка(ПараметрыВыбранногоПоля.Поле) = "Организация"
            И Форма.Отчет.Свойство("Организация") Тогда
            ЭлементОтбора.ПравоеЗначение = Форма.Отчет.Организация;
        ИначеЕсли Строка(ПараметрыВыбранногоПоля.Поле) = "Подразделение"
            И Форма.Отчет.Свойство("Подразделение") Тогда 
            ЭлементОтбора.ПравоеЗначение = Форма.Отчет.Подразделение;
        КонецЕсли;
        ЭлементОтбора.ВидСравнения = ПараметрыВыбранногоПоля.ВидСравнения;
        
        Элемент.ТекущаяСтрока = Форма.Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьИдентификаторПоОбъекту(ЭлементОтбора);
        
    КонецЕсли;

КонецПроцедуры

Процедура ОтборыПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	Если (Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 И ТипЗнч(Элемент.ТекущиеДанные.ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных")) Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", Форма.СхемаКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим"                , "Отбор");
		ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.Подключаемый_ПолучитьЗапрещенныеПоля("Отбор"));
		ПараметрыФормы.Вставить("ТекущаяСтрока"        , Элемент.ТекущиеДанные.ЛевоеЗначение);
		ПараметрыВыбранногоПоля = Неопределено;

		ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ОтборыПередНачаломИзмененияЗавершение", бит_Отчеты, Новый Структура("Форма, Элемент", Форма, Элемент)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОтборыПередНачаломИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Форма = ДополнительныеПараметры.Форма;
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    ПараметрыВыбранногоПоля = Результат;
    
    Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
        
        ТекущаяСтрока = Форма.Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
        
        Если Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 Тогда 
            ТекущаяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Расшифровки

Процедура ОбработкаРасшифровкиСтандартногоОтчета(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторОбъекта = бит_ОтчетыКлиентСервер.ПолучитьИдентификаторОбъекта(ФормаОтчета);
	
	ПараметрыРасшифровки = бит_ОтчетыВызовСервера.ПолучитьПараметрыРасшифровкиОтчета(ФормаОтчета.ДанныеРасшифровки, ИдентификаторОбъекта, Расшифровка);
	
	Если Не ЗначениеЗаполнено(ПараметрыРасшифровки) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Ложь, Истина, Ложь, Истина);
	Если ПараметрыРасшифровки.ОткрытьЗначение Тогда
		ПоказатьЗначение(Новый ОписаниеОповещения("ОбработкаРасшифровкиСтандартногоОтчетаЗавершение1", бит_Отчеты), ПараметрыРасшифровки.Значение);
	Иначе
		СписокПунктовМеню = ПараметрыРасшифровки.СписокПунктовМеню;
		Если СписокПунктовМеню.Количество() = 1 Тогда
			ИДРасшифровки = СписокПунктовМеню[0].Значение;
			ИмяФормы = ПолучитьИмяФормыПоИДРасшифровки(ИДРасшифровки);
			ПараметрыФормы = Новый Структура("ВидРасшифровки, АдресНастроек, СформироватьПриОткрытии, ИДРасшифровки, ЗаполняемыеНастройки",
			                                 1, ФормаОтчета.ДанныеРасшифровки, Истина, ИДРасшифровки, ЗаполняемыеНастройки);
			ОткрытьФорму(ИмяФормы, ПараметрыФормы,, Истина);
		ИначеЕсли СписокПунктовМеню.Количество() > 0 Тогда
			ВыбранноеДействие = ФормаОтчета.ВыбратьИзМеню(СписокПунктовМеню, Элемент);
			Если ВыбранноеДействие <> Неопределено Тогда
				Если ТипЗнч(ВыбранноеДействие.Значение) = Тип("Строка") Тогда
					ИмяФормы = ПолучитьИмяФормыПоИДРасшифровки(ВыбранноеДействие.Значение);
					ПараметрыФормы = Новый Структура("ВидРасшифровки, АдресНастроек, СформироватьПриОткрытии, ИДРасшифровки, ЗаполняемыеНастройки",
			                                 1, ФормаОтчета.ДанныеРасшифровки, Истина, ВыбранноеДействие.Значение, ЗаполняемыеНастройки);
					ОткрытьФорму(ИмяФормы, ПараметрыФормы,, Истина);
				Иначе
					ПоказатьЗначение(Новый ОписаниеОповещения("ОбработкаРасшифровкиСтандартногоОтчетаЗавершение", бит_Отчеты), ВыбранноеДействие.Значение);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаРасшифровкиСтандартногоОтчетаЗавершение1(ДополнительныеПараметры) Экспорт
    
	Завершение = Истина; 

КонецПроцедуры

Процедура ОбработкаРасшифровкиСтандартногоОтчетаЗавершение(ДополнительныеПараметры) Экспорт
    
	Завершение = Истина; 

КонецПроцедуры

Функция ПолучитьИмяФормыПоИДРасшифровки(ИДРасшифровки)
	
	ИмяОбъекта = ИДРасшифровки;
	ШаблонИмениФормы = "Отчет.%ИмяОбъекта%.Форма.ФормаОтчета";
	
	Если ИДРасшифровки = "ОборотыСчетаПоДням" 
		Или ИДРасшифровки = "ОборотыСчетаПоМесяцам" Тогда
		ИмяОбъекта = "ОборотыСчета";
	КонецЕсли;
	
	Возврат СтрЗаменить(ШаблонИмениФормы, "%ИмяОбъекта%", ИмяОбъекта);
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПоля

Процедура ДополнительныеПоляПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", Форма.СхемаКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим"                , "Выбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.Подключаемый_ПолучитьЗапрещенныеПоля("Выбор"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"        , Неопределено);
	ПараметрыВыбранногоПоля = Неопределено;

	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ДополнительныеПоляПередНачаломДобавленияЗавершение", бит_Отчеты, Новый Структура("Форма", Форма)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

Процедура ДополнительныеПоляПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Форма = ДополнительныеПараметры.Форма;
    
    
    ПараметрыВыбранногоПоля = Результат;
    
    Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
        НоваяСтрока = Форма.Отчет.ДополнительныеПоля.Добавить();
        НоваяСтрока.Использование = Истина;
        НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
        НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
        
        Если Не ЗначениеЗаполнено(Форма.ИдентификаторЗадания) Тогда
            бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Форма.Элементы.Результат, "НеАктуальность");
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

Процедура ДополнительныеПоляПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	Если Элемент.ТекущийЭлемент = Форма.Элементы.ДополнительныеПоляПредставление Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", Форма.СхемаКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим"                , "Выбор");
		ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.Подключаемый_ПолучитьЗапрещенныеПоля("Выбор"));
		ПараметрыФормы.Вставить("ТекущаяСтрока"        , Элемент.ТекущиеДанные.Поле);
		ПараметрыВыбранногоПоля = Неопределено;

		ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ДополнительныеПоляПередНачаломИзмененияЗавершение", бит_Отчеты, Новый Структура("Форма, Элемент", Форма, Элемент)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнительныеПоляПередНачаломИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Форма = ДополнительныеПараметры.Форма;
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    ПараметрыВыбранногоПоля = Результат;
    
    Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
        НоваяСтрока = Элемент.ТекущиеДанные;
        НоваяСтрока.Использование = Истина;
        НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
        НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
        
        Если Не ЗначениеЗаполнено(Форма.ИдентификаторЗадания) Тогда
            бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Форма.Элементы.Результат, "НеАктуальность");
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедруыИФункции

// БИТ_ЖКХ 16.01.2015{{
Процедура бит_ОбработкаРасшифровкиСтандартногоОтчета(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторОбъекта = БухгалтерскиеОтчетыКлиентСервер.ПолучитьИдентификаторОбъекта(ФормаОтчета);
	
	ПараметрыРасшифровки = бит_ОтчетыВызовСервера.бит_ПолучитьПараметрыРасшифровкиОтчета(ФормаОтчета.ДанныеРасшифровки, ИдентификаторОбъекта, Расшифровка);
	
	Если Не ЗначениеЗаполнено(ПараметрыРасшифровки) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Ложь, Истина, Ложь, Истина);
	Если ПараметрыРасшифровки.ОткрытьОбъект Тогда
		ПоказатьЗначение( , ПараметрыРасшифровки.Значение);
	Иначе
		СписокПунктовМеню = ПараметрыРасшифровки.СписокПунктовМеню;
		Если СписокПунктовМеню.Количество() = 1 Тогда
		ИначеЕсли СписокПунктовМеню.Количество() > 0 Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ЗаполняемыеНастройки", ЗаполняемыеНастройки);
			ДополнительныеПараметры.Вставить("ФормаОтчета", ФормаОтчета);
			
			// БИТ_ЖКХ 15.01.2015{{
			ДополнительныеПараметры.Вставить("СписокПунктовМеню", СписокПунктовМеню);
			ДополнительныеПараметры.Вставить("СписокПолей", ПараметрыРасшифровки.СписокПолей);
			ДополнительныеПараметры.Вставить("ПоследняяГруппировка", ПараметрыРасшифровки.ПоследняяГруппировка);
			ДополнительныеПараметры.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
			// БИТ_ЖКХ 15.01.2015}}
			
			Оповещение = Новый ОписаниеОповещения("ВыбратьИзМенюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ФормаОтчета.ПоказатьВыборИзМеню(Оповещение, СписокПунктовМеню, Элемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьИзМенюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
			
			СписокПолей = ДополнительныеПараметры.СписокПолей;
			ПоследняяГруппировка = ДополнительныеПараметры.ПоследняяГруппировка;
			
			
			Если ДополнительныеПараметры.ИдентификаторОбъекта = "бит_ВедомостьПоНачислениюПени" Тогда
				ФормаРасшифровка = ОткрытьФорму("Отчет.бит_РасшифровкаПоПене.Форма.ФормаОтчетаУправляемая");
			Иначе
				ФормаРасшифровка = ОткрытьФорму("Отчет.бит_РасшифровкаЛС.Форма.ФормаОтчетаУправляемая");
			КонецЕсли;
			
			ПараметрОрганизация   = ДополнительныеПараметры.ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
			
			Если ПараметрОрганизация  <> Неопределено Тогда
				ПараметрОрганизация.Значение = ДополнительныеПараметры.ФормаОтчета.Отчет.Организация; 
			КонецЕсли;
		
			ФормаРасшифровка.Отчет.НачалоПериода = ДополнительныеПараметры.ФормаОтчета.Отчет.НачалоПериода;
			ФормаРасшифровка.Отчет.КонецПериода = ДополнительныеПараметры.ФормаОтчета.Отчет.КонецПериода;
			
			ОрганизацияФорма          = ДополнительныеПараметры.ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
			
			Если ОрганизацияФорма  <> Неопределено Тогда
				
				ОрганизацияФорма.Значение = ПараметрОрганизация.Значение;
				ОрганизацияФорма.Использование = Истина;
				
			КонецЕсли; 
			
			// Заполнение отборов.
			
			ФормаРасшифровка.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			
			Отбор = ФормаРасшифровка.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
			
			Для каждого строка из ДополнительныеПараметры.СписокПунктовМеню Цикл
				
				Если ТипЗнч(строка.Значение) = Тип("СправочникСсылка.бит_ЛицевыеСчета") Тогда
					ЛицевойСчет = строка.Значение;
				ИначеЕсли ТипЗнч(строка.Значение) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда 
					Здание = строка.Значение;
				ИначеЕсли ТипЗнч(строка.Значение) = Тип("СправочникСсылка.бит_УслугиЖКХ") Тогда 
					Услуга = строка.Значение;
				ИначеЕсли ТипЗнч(строка.Значение) = Тип("СправочникСсылка.бит_ПоставщикиУслуг") Тогда 
					Поставщик = строка.Значение;
				КонецЕсли;
				
			КонецЦикла;	
			
			Если ЛицевойСчет <> Неопределено Тогда
				
				Количество = Отбор.Количество();
				Для Индекс = 1 По Количество Цикл
					
					ЭлементСКонца = Отбор[Количество - Индекс];
					
					Поле = Новый ПолеКомпоновкиДанных("ЛицевойСчет");
					
					Если ЭлементСКонца.ЛевоеЗначение = Поле Тогда
						
						Отбор.Удалить(ЭлементСКонца);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ДобавитьОтбор(ФормаРасшифровка.Отчет.КомпоновщикНастроек, "ЛицевойСчет", ЛицевойСчет, ВидСравненияКомпоновкиДанных.Равно);
				
			КонецЕсли; 
			
			Если Здание <> Неопределено Тогда
				
				Количество = Отбор.Количество();
				Для Индекс = 1 По Количество Цикл
					
					ЭлементСКонца = Отбор[Количество - Индекс];
					
					Поле = Новый ПолеКомпоновкиДанных("Здание");
					
					Если ЭлементСКонца.ЛевоеЗначение = Поле Тогда
						
						Отбор.Удалить(ЭлементСКонца);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ДобавитьОтбор(ФормаРасшифровка.Отчет.КомпоновщикНастроек, "Здание", Здание, ВидСравненияКомпоновкиДанных.Равно);
				
			КонецЕсли; 
			
			Если Услуга <> Неопределено Тогда
				
				Количество = Отбор.Количество();
				Для Индекс = 1 По Количество Цикл
					
					ЭлементСКонца = Отбор[Количество - Индекс];
					
					Поле = Новый ПолеКомпоновкиДанных("Услуга");
					
					Если ЭлементСКонца.ЛевоеЗначение = Поле Тогда
						
						Отбор.Удалить(ЭлементСКонца);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ДобавитьОтбор(ФормаРасшифровка.Отчет.КомпоновщикНастроек, "Услуга", Услуга, ВидСравненияКомпоновкиДанных.Равно);
				
			КонецЕсли; 
			
			Если Поставщик <> Неопределено Тогда
				
				Количество = Отбор.Количество();
				Для Индекс = 1 По Количество Цикл
					
					ЭлементСКонца = Отбор[Количество - Индекс];
					
					Поле = Новый ПолеКомпоновкиДанных("Поставщик");
					
					Если ЭлементСКонца.ЛевоеЗначение = Поле Тогда
						
						Отбор.Удалить(ЭлементСКонца);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ДобавитьОтбор(ФормаРасшифровка.Отчет.КомпоновщикНастроек, "Поставщик", Поставщик, ВидСравненияКомпоновкиДанных.Равно);
				
			КонецЕсли; 
			
			// Заполняем Структуру группировок.
			
			Источник = ДополнительныеПараметры.ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Структура;
			Приемник = ФормаРасшифровка.Отчет.КомпоновщикНастроек.Настройки.Структура;
			
			НастройкаСтруктурыСКД(Источник, Приемник, ФормаРасшифровка.Отчет.КомпоновщикНастроек,,ПоследняяГруппировка);
			
			ДобавитьОтбор(ФормаРасшифровка.Отчет.КомпоновщикНастроек, ПоследняяГруппировка, , ВидСравненияКомпоновкиДанных.НеРавно);
			
			// Заполнение полей выбора.
			
			ПоляВыбора = ФормаРасшифровка.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы;
			ПоляВыбора.Очистить();
			
			Для каждого Элемент Из СписокПолей Цикл
				
				ПолеВыбора = ФормаРасшифровка.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Элемент.Значение));
				Если ПолеВыбора <> Неопределено Тогда
					
					НовоеПолеВыбора = ПоляВыбора.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")); 
					НовоеПолеВыбора.Поле = ПолеВыбора.Поле;
					
					Если ДополнительныеПараметры.ИдентификаторОбъекта <> "бит_ВедомостьПоНачислениюПени" Тогда
					
					ДобавитьОтбор(ФормаРасшифровка.Отчет.КомпоновщикНастроек, Элемент.Значение, 0, ВидСравненияКомпоновкиДанных.НеРавно);
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла;
			Оповестить("Расшифровка");	
			
			бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ДополнительныеПараметры.ФормаОтчета.Элементы.Результат,);
			// БИТ_ЖКХ 15.01.2015}}
			
		Иначе
			ПоказатьЗначение( , Результат.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 16.01.2015}}

#КонецОбласти