
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// БИТ_ЖКХ 15.11.2013 добавил код для управляемой формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Вызов механизма разделения прав доступа.
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ИсточникиФинансирования"));
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,СправочникОбъект,ЭтаФорма);	
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьОтборы();
	
КонецПроцедуры
// БИТ_ЖКХ 15.11.2013 конец

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ЛьготыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛьготыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока тогда	
		Элемент.ТекущиеДанные.ИсточникФинансированияЛьгот = Объект.Ссылка;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения  = Новый Структура; 
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ИсточникиФинансирования"));
	
	КэшированныеЗначения.Вставить("ЭтоНовый"   , ?(Параметры.Ключ.Пустая(), Истина, Ложь));
	
КонецПроцедуры

Процедура УстановитьОтборы()
	
	Эл = Льготы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ИсточникФинансированияЛьгот");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЛьготыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Попытка
			
			Отказ = НЕ ЗаписатьОбъект();
			УстановитьОтборы();
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Элемент справочника записан.");
			
		Исключение
		КонецПопытки;
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИсточникФинансированияЛьгот",Объект.Ссылка);
		
		ОткрытьФорму("РегистрСведений.бит_ИсточникиФинансированияЛьгот.Форма.ФормаЗаписиУправляемая",Новый Структура("ОткрытьИзСправочникаИсточникиФинансирования",ПараметрыФормы),Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура получает объект из данных формы и записывает объект.
//
&НаСервере
Функция ЗаписатьОбъект()
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ИсточникиФинансирования"));
	
	Попытка
		
		СправочникОбъект.Записать();
		
		мКэшЗначений.ЭтоНовый = Ложь;
		Возврат Истина;
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не удалось записать объект """ + СправочникОбъект + """!
		|" + ОписаниеОшибки());
		
		Возврат Ложь;
	КонецПопытки;
	
	ЗначениеВДанныеФормы(СправочникОбъект, Объект);
	
КонецФункции

#КонецОбласти