#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мКолЧел                              Экспорт;  // Хранит количество прописанных человек в семье по ЛС.
Перем мПрефиксУлица                        Экспорт;  // Хранит Префикс улицы.
Перем мПрефиксДом                          Экспорт;  // Хранит Префикс дома.
Перем мПрефиксКорпус                       Экспорт;  // Хранит Префикс корпуса.
Перем мПрефиксКвартира                     Экспорт;  // Хранит Префикс квартиры.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) <> Тип("Структура") И Основание <> Неопределено Тогда
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		#Если Клиент Тогда
			Дата = РабочаяДата;
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли