
#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Результат = Документы.бит_РегистрацияПроживающихПоЛС.ОбновитьПараметрыЖКХ(ДатаЗаведения, ЛицевойСчет.Организация);
	
	Если НЕ Результат.НачислениеСУчетомДнейПроживания Тогда
		
		Реквизит = ПроверяемыеРеквизиты.Найти("Проживающие.ДатаРегистрации");
		
		Если НЕ Реквизит = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Реквизит);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти