
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементыОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементыОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсполнительныйЛист");
	ЭлементыОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементыОтбора.Использование = Истина;
	ЭлементыОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементыОтбора.ПравоеЗначение = Параметры.ИсполнительныйЛист;
КонецПроцедуры
