&НаКлиенте
Процедура ОтборЛСПриИзменении(Элемент)
	
	Если Объект.ОтборЛС = Истина Тогда
		СбросОтбораФильтров();
		Объект.ОтборЛС = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СбросОтбораФильтров()
	Объект.ОтборЛС = Ложь;
	Объект.ОтборУчасток = Ложь;
	Объект.ОтборЗдание = Ложь;
конецПроцедуры

&НаКлиенте
Процедура ОтборУчастокПриИзменении(Элемент)
	
	Если Объект.ОтборУчасток = Истина Тогда
		СбросОтбораФильтров();
		Объект.ОтборУчасток = Истина;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	Если Объект.ОтборЗдание = Истина Тогда
		СбросОтбораФильтров();
		Объект.ОтборЗдание = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура СформироватьСправкуНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Объект.ФормаРезультата.Очистить();
	
	Объект.ФормаРезультата.Вывести(ОбработкаОбъект.СформироватьПечатнуюФорму());
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ФормаРезультата;
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьСправку(Команда)
	СформироватьСправкуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОтборПоПериоду1ПриИзменении(Элемент)
	//
	//Если Объект.ОтборПоПериоду Тогда
	//	Элементы.ГруппаОтборПоПериоду.Видимость = Истина;
	//	Элементы.СтраницаОтбор.Видимость = Ложь;
	//Иначе
	//	Элементы.ГруппаОтборПоПериоду.Видимость = Ложь;
	//	Элементы.СтраницаОтбор.Видимость = Истина;
	//КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЛицевойСчет") Тогда
		 Объект.ЛицевойСчет = Параметры.ЛицевойСчет;
	 КонецЕсли;
	 
	Если Параметры.Свойство("Организация") Тогда
		 Объект.Организация = Параметры.Организация;
	 КонецЕсли;

	 
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
		    
	Если Параметры.Свойство("ЛицевойСчет") Тогда
		 Объект.ЛицевойСчет = Параметры.ЛицевойСчет;
	 КонецЕсли;
	 
	Если Параметры.Свойство("Организация") Тогда
		 Объект.Организация = Параметры.Организация;
	 КонецЕсли;
	 
 КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьВФайлExel(Команда)
	
	Попытка
		Если ЗначениеЗаполнено(Каталог) Тогда
			ПолноеИмяФайла = Строка(Каталог) + "\СправкаУслугЖКХ_" + Формат(ТекущаяДата(), "ДФ=ддММггггЧЧммсс") + ".xlsx" ;
			ФайлНаДиске = Новый Файл(ПолноеИмяФайла);
			Объект.ФормаРезультата.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		Иначе
			Сообщить("Заполните путь к каталогу");
		КонецЕсли;
	Исключение
		Сообщить("Ошибка записи в файл");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог сохранения";
	Диалог.Фильтр = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПутьКаталогаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПутьКаталогаЗавершение(ВыбранныйКаталог, ВходящийКонтекст) Экспорт
	
	Если ТипЗнч(ВыбранныйКаталог) = Тип("Массив") И ВыбранныйКаталог.Количество() > 0 Тогда 
		Каталог = ВыбранныйКаталог[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Каталог) Тогда
		ЗапуститьПриложение(Каталог);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаРезультатаПриИзмененииСодержимогоОбласти(Элемент, Область)
	Если ЗначениеЗаполнено(Объект.ФормаРезультата) Тогда
		Элементы.Каталог.Видимость = ИСТИНА;
		Элементы.ЗаписатьВФайлExel = ИСТИНА;
	ИНАЧЕ
		Элементы.Каталог.Видимость = ЛОЖЬ;
		Элементы.ЗаписатьВФайлExel = ЛОЖЬ;
	КонецЕсли;
КонецПроцедуры




