
#Область ПеременныеМодуля

Перем мСписокПредопределенныхЗваний;
Перем мОбработкаПодбораПоСтроке;
Перем мТекстПодбораПоСтроке;
Перем мПоследнееЗначениеЭлементаПодбораПоСтроке;

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 ПолучитьВоинскиеЗванияНаСервере();
 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Объект.Предопределенный
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбщевойсковоеЗваниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = Ложь;
	
	ФормаВыбора = ОткрытьФорму("Справочник.бит_ЗваниеГражданскогоВоинскогоУчета.Форма.ФормаВыбораУправляемая",,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Предопределенный");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Истина;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ФормаВыбора.Элементы.ОбщевойсковоеЗвание.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ПолучитьВоинскиеЗванияНаСервере()
	
		Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВоинскиеЗвания.Ссылка,
	|	ВоинскиеЗвания.Наименование
	|ИЗ
	|	Справочник.бит_ЗваниеГражданскогоВоинскогоУчета КАК ВоинскиеЗвания
	|ГДЕ
	|	ВоинскиеЗвания.Предопределенный";
	Выборка = Запрос.Выполнить().Выбрать();
	мСписокПредопределенныхЗваний	=	Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		мСписокПредопределенныхЗваний.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
	ЭлементУправленияОбщевойсковогоЗвания = Элементы.ОбщевойсковоеЗвание;
	ЭлементУправленияОбщевойсковогоЗвания.СписокВыбора.ДоступныеЗначения = мСписокПредопределенныхЗваний;
	ЭлементУправленияОбщевойсковогоЗвания.ВысотаСпискаВыбора = мСписокПредопределенныхЗваний.Количество(); 
	ЭлементУправленияОбщевойсковогоЗвания.ШиринаСпискаВыбора = 30; 
КонецПроцедуры

#КонецОбласти