
&НаКлиенте
Процедура Сформировать(Команда)
	// Вставить содержимое обработчика.
	 СформироватьНаСервере(ложь)	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ДляЗависимых=ложь)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ТабДок = ОтчетОбъект.РасшифровкаПоЛицевомуСчету(Отчет.ЛС,ДляЗависимых);
	ЗначениеВРеквизитФормы(ОтчетОбъект,"Отчет");
	
	
	ЭтаФорма.Результат.Очистить();
	ЭтаФорма.Результат.Вывести(ТабДок);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДляЗависимых(Команда)
	// Вставить содержимое обработчика.
	СформироватьНаСервере(истина);
КонецПроцедуры






&НаКлиенте
Процедура ЗаполнитьПериод(Команда)
	ЗаполнитьПериодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНаСервере()
	// Вставить содержимое обработчика.
	Если ЭтаФорма.ЧислоМесяцев = 0 тогда
		Отчет.ДатаКон = КонецМесяца(ТекущаяДата());
		Отчет.ДатаНач = НачалоДвиженийПоЛС(Отчет.ЛС);
	иначе
		Отчет.ДатаКон  = КонецМесяца(ТекущаяДата());
		Отчет.ДатаНач  = НачалоМесяца(ДобавитьМесяц(Отчет.ДатаКон,-ЭтаФорма.ЧислоМесяцев))		
	КонецЕсли;	
	ЭтаФорма.ПериодОтчета.ДатаНачала = Отчет.ДатаНач;
	ЭтаФорма.ПериодОтчета.ДатаОкончания = КонецДня(Отчет.ДатаКон);
КонецПроцедуры

&НаСервере
Функция НачалоДвиженийПоЛС(ЛС)
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ЛС",ЛС);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_НачисленияПоУслугамЖКХ.Период КАК Период
		|ПОМЕСТИТЬ МинУслуг
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ КАК бит_НачисленияПоУслугамЖКХ
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет = &ЛС
		|	И НЕ бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_НачислениеПениПоУслугамЖКХ.Период КАК Период
		|ПОМЕСТИТЬ МинПени
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ КАК бит_НачислениеПениПоУслугамЖКХ
		|ГДЕ
		|	бит_НачислениеПениПоУслугамЖКХ.ЛицевойСчет = &ЛС
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	МинУслуг.Период КАК Период
		|ИЗ
		|	МинУслуг КАК МинУслуг
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	МинПени.Период
		|ИЗ
		|	МинПени КАК МинПени";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		НачПериод = Выборка.Период;
	иначе
		НачПериод = ТекущаяДата();
	КонецЕсли;
	возврат НачалоМесяца(НачПериод);
	
	
	
КонецФункции	

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Отчет.ДатаНач = ПериодОтчета.ДатаНачала;
	Отчет.ДатаКон = ПериодОтчета.ДатаОкончания
КонецПроцедуры
