
#Область ПрограммныйИнтерфейс

// Возвращает серверный общий модуль по имени.
//
Функция СерверныйОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(НСтр("ru = 'Общий модуль ""%1%"" не найден.'"), Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// БИТ_ЖКХ Функция проверяет текущий режим открытия окн приложения
//  
// Возвращаемое значение:
//   Булево - Истина, если текущий режим = Закладки
//
Функция ТекущийРежимЗакладки() Экспорт

	ТекущийРежим = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения").РежимОткрытияФормПриложения;
	
	Возврат ТекущийРежим = РежимОткрытияФормПриложения.Закладки;
	
КонецФункции // ТекущийРежимЗакладки()

#КонецОбласти
