
#Область РаботаСФормами

// Проверяет модифицированность документа перед печатью, и если необходимо записывает его.
// 
// Параметры:
//  Объект - (ДокументОбъект.*, СправочникОбъект.*) - проверяемый документ / справочник.
//  Форма    - форма проверяемого документа / справочника.
//
Функция ПроверитьМодифицированностьВФорме(Объект, Форма) Экспорт

	Результат = Ложь;
	
	Если Форма.Модифицированность Тогда
		// БИТ_ЖКХ добавление кода. 13.11.2013}}
		// Проведен    = Метаданные.Документы.Содержит(Объект.Метаданные()) И Объект.Проведен;.
		Проведен    = Объект.Ссылка.Метаданные.Документы.Содержит(Объект.Метаданные()) И Объект.Проведен;
		// БИТ_ЖКХ добавление кода. 13.11.2013}}
		СтрПроведен = ?(Проведен, " и провести","");
		
		Если Проведен Тогда
			
			Попытка
				
				Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение);
				
			Исключение
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Операция не выполнена!");
				
				Возврат Результат = Истина;
				
			КонецПопытки;
			
		Иначе
			
			Попытка
				
				Форма.ЗаписатьВФорме();
				
			Исключение
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Операция не выполнена!");
				Возврат Результат = Истина;
				
			КонецПопытки;
			
		КонецЕсли;
		
		Результат = Истина;
		
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПроверитьМодифицированность()

// Формирует и устанавливает текст заголовка формы документа.
//
// Параметры:
//  ФормаДокумента 	   - УправляемаяФорма, ФормаОбычная.
//  СтруктураЗаголовка - Структура. Ключи: ЭтоНовый 			- Булево.
//										   ПредставлениеОбъекта - Строка.
//										   СтрокаВидаОперации 	- Строка. Необязательный. По умолчанию "".
//										   ДокументПроведен 	- Булево. Необязательный. По умолчанию Ложь.
//
Процедура УстановитьЗаголовокФормыДокумента(ФормаДокумента, СтруктураЗаголовка) Экспорт

	ФормаДокумента.АвтоЗаголовок = Ложь; // заголовок будем писать сами.
	
	// Получим обязательные параметры.
	флЭтоНовый		   	   = СтруктураЗаголовка.ЭтоНовый;
	ПредставлениеДокумента = СтруктураЗаголовка.ПредставлениеОбъекта;
	
	// Получим необязательные параметры.
	СтрокаВидаОперации = ?(СтруктураЗаголовка.Свойство("СтрокаВидаОперации"), СтруктураЗаголовка.СтрокаВидаОперации, "");
	
	Если СтруктураЗаголовка.Свойство("ДокументПроведен") Тогда
		ДокументПроведен 	= СтруктураЗаголовка.ДокументПроведен;
		ПроведениеРазрешено = Истина;
	Иначе
		ДокументПроведен 	= Ложь;
		ПроведениеРазрешено = Ложь;
	КонецЕсли;
	
	// Получим заголовок формы документа.
	Если ПустаяСтрока(СтрокаВидаОперации) Тогда
		Заголовок = ПредставлениеДокумента + ": ";
	Иначе
		Заголовок = ПредставлениеДокумента + ": " + СтрокаВидаОперации + ". ";
	КонецЕсли;
		
	Если флЭтоНовый Тогда  
		Заголовок = Заголовок + "Новый";
	Иначе
		
		Если ДокументПроведен Тогда
			Заголовок = Заголовок + "Проведен";
		ИначеЕсли ПроведениеРазрешено Тогда
			Заголовок = Заголовок + "Не проведен";
		Иначе
			Заголовок = Заголовок + "Записан";
		КонецЕсли;
		
	КонецЕсли;
	
	// Установим полученный заголовок.
	ФормаДокумента.Заголовок = Заголовок;

КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область РаботаСДеревом

// БИТ_ЖКХ 30.07.2014{{
 //
 // Параметры:
 //  Дерево  - ТаблицаФормы.
 //  СтрокаВерх - ДанныеФормыЭлементДерева.
 //  УровеньДействия - Число - Уровень до которого будет развернуто дерево.
 //  УровеньРекурсии - Число.
 //
Процедура РазвернутьДоУровня(Дерево,СтрокаВерх,УровеньДействия,УровеньРекурсии=0) Экспорт
	 
	ТекКоллекция = СтрокаВерх.ПолучитьЭлементы();
	УровеньТекущий = УровеньРекурсии+1;

	Для каждого СтрокаТекущая Из ТекКоллекция Цикл
	 
	ИдСтроки = СтрокаТекущая.ПолучитьИдентификатор(); 
	 
	Если УровеньТекущий >= УровеньДействия Тогда
		Дерево.Свернуть(ИдСтроки); 			 
	Иначе	
		
		РазвернутьДоУровня(Дерево,СтрокаТекущая,УровеньДействия,УровеньТекущий);		 
		Дерево.Развернуть(ИдСтроки); 		
		
	КонецЕсли; 
	 
	КонецЦикла; 
	 
КонецПроцедуры // РазвернутьДоУровня()
       
Процедура РазвернутьДеревоПолностью(ДеревоДанных, КоллекцияСтрокДерева, РазворачиватьПодчинённые = Истина) Экспорт

	Для каждого СтрокаДерева Из КоллекцияСтрокДерева Цикл
		
		ИдСтроки = СтрокаДерева.ПолучитьИдентификатор();
		ДеревоДанных.Развернуть(ИдСтроки, РазворачиватьПодчинённые);
	
	КонецЦикла;

КонецПроцедуры // РазвернутьДеревоПолностью()
// БИТ_ЖКХ 30.07.2014}}

#КонецОбласти

#Область ПроцедурыОбработкиВыбора

// Процедура осуществляет выбор составного типа из списка в управляемой форме. 
//
// Параметры:
//  ТекущаяФорма  – Форма.
//  ЭлементВладелец - ЭлементУправления.
//  Контейнер     - Объект,СтрокаТабличнойЧасти.
//  ИмяРеквизита  - Строка.
//  СписокВыбора  - Список с типами, которые выбираем.
//  СтандартнаяОбработка - Булево.
//
Процедура НачалоВыбораСоставного(ТекущаяФорма
	                               ,ЭлементВладелец
								   ,Контейнер
								   ,ИмяРеквизита
								   ,СписокВыбора
								   ,СтандартнаяОбработка) Экспорт

	
   Если Контейнер = Неопределено Тогда
	   
	   Возврат;
	   
   КонецЕсли; 
   ТекущееЗначение= Контейнер[ИмяРеквизита];
   ЭлементВладелец.ВыбиратьТип     = Ложь;      
   Если ТекущееЗначение = Неопределено Тогда
	   
	   СтандартнаяОбработка            = Ложь;
	   ЭлементВладелец.ВыбиратьТип     = Истина;   
	   
	   // Выбираем тип из списка.
	   // ВыбранныйЭлемент = ТекущаяФорма.ВыбратьИзСписка(СписокВыбора);.
	   
	   ДополнительныеПараметры = Новый Структура;
	   ДополнительныеПараметры.Вставить("ТекущаяФорма", ТекущаяФорма);
	   ДополнительныеПараметры.Вставить("Контейнер", Контейнер);
	   ДополнительныеПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	   ДополнительныеПараметры.Вставить("ЭлементВладелец", ЭлементВладелец);
	   
	   ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьИзСпискаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	   
	   ТекущаяФорма.ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, ЭлементВладелец);
	   
	   // Возвращаем стандартную обработку в Истину, чтобы автоматически открылась форма выбора.
	   // СтандартнаяОбработка = Истина;.
	   
   КонецЕсли; // Текущее значение неопределено.
   
КонецПроцедуры // НачалоВыбораСоставного()

Процедура ВыбратьИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ТекущаяФорма = ДополнительныеПараметры.ТекущаяФорма;
	Контейнер = ДополнительныеПараметры.Контейнер;
	ИмяРеквизита = ДополнительныеПараметры.ИмяРеквизита;
	ЭлементВладелец = ДополнительныеПараметры.ЭлементВладелец;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		// Устанавливаем выбранный тип.
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ВыбранныйЭлемент.Значение);
		Описание = Новый ОписаниеТипов(МассивТипов);
		 Контейнер[ИмяРеквизита] = Описание.ПривестиЗначение();
		
		ЭлементВладелец.ВыбиратьТип     = Ложь;
		
	Иначе
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедуры

Процедура УстановитьПараметрыОпций(ЭтоИнтПоставка) Экспорт
	
	ТекПользователь = бит_ОбщегоНазначения.ПолучитьТекущегоПользователя();
	// Установим параметры функциональных опций интерфейса для перестроения.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("бит_ПользовательРешения"   , ТекПользователь);
	Если ЭтоИнтПоставка Тогда
		
		СтруктураПараметров.Вставить("бит_ПользовательИнтерфейса", ТекПользователь);		
		
	КонецЕсли; 
	
	УстановитьПараметрыФункциональныхОпцийИнтерфейса(СтруктураПараметров);
	
КонецПроцедуры // УстановитьПараметрыОпций()

// БИТ_ЖКХ 30.07.2014{{
Процедура ОбработатьИзмененияНастроекПользователя(Пользователь, СтруктураНастроек = Неопределено) Экспорт
	
	Если Пользователь <> бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь") Тогда
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры // ОбработатьИзмененияНастроекПользователя()
// БИТ_ЖКХ 30.07.2014}}

#КонецОбласти