	
Процедура ВыгрузитьЗдания(ПараметрыОбмена) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	|	бит_СписокЗданий.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_СписокЗданий.Состояние КАК Состояние,
	|	бит_СписокЗданий.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	бит_СписокЗданий.ФондКапРемонта КАК ФондКапРемонта,
	|	бит_СписокЗданий.КолВоПодземныхЭтажей КАК КолВоПодземныхЭтажей,
	|	бит_СписокЗданий.КолВоЭтажейНаименьшее КАК КолВоЭтажейНаименьшее,
	|	бит_СписокЗданий.ОбъектаКультурногоНаследия КАК ОбъектаКультурногоНаследия,
	|	бит_СписокЗданий.ЧасоваяЗонаПоOlson КАК ЧасоваяЗонаПоOlson,
	|	бит_СписокЗданий.КадастровыйНомер КАК КадастровыйНомер,
	|	бит_СписокЗданий.Серия КАК Серия,
	|	бит_СписокЗданий.НомерДома КАК НомерДома,
	|	бит_СписокЗданий.Корпус КАК Корпус,
	|	бит_СписокЗданий.ПрефиксДома КАК ПрефиксДома,
	|	бит_СписокЗданий.Прочее КАК Прочее
	|ПОМЕСТИТЬ ВТ_Здания
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО ВТ_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|ГДЕ
	|	НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_СписокЗданий.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_СписокЗданий.Ссылка В (&СписокЗданий))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений)
	|				ТОГДА бит_ЗначениеСвойствОбъектовУчета.Значение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьЖилыхПомещений,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|				ТОГДА бит_ЗначениеСвойствОбъектовУчета.Значение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьЖилогоЗдания,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.КоличествоЭтажей)
	|				ТОГДА бит_ЗначениеСвойствОбъектовУчета.Значение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЭтажей
	|ПОМЕСТИТЬ ВТ_ДопСвойства
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета В
	|			(ВЫБРАТЬ
	|				ВТ_Здания.Здание
	|			ИЗ
	|				ВТ_Здания КАК ВТ_Здания)
	|	И (бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилыхПомещений)
	|			ИЛИ бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.ОбщаяПлощадьЖилогоЗдания)
	|			ИЛИ бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.КоличествоЭтажей))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_Квартиры.Ссылка) КАК КолВоКвартир,
	|	бит_Квартиры.Владелец КАК Здание
	|ПОМЕСТИТЬ ВТ_КолВоКвартир
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Здания КАК ВТ_Здания
	|		ПО бит_Квартиры.Владелец = ВТ_Здания.Здание
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_Квартиры.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Здания.Здание КАК Здание,
	|	ВТ_Здания.ПочтовыйАдрес КАК АдресЗдания,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Здания.Состояние) КАК Состояние,
	|	ВЫБОР
	|		КОГДА ВТ_Здания.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ ГОД(ВТ_Здания.ДатаВводаВЭксплуатацию)
	|	КОНЕЦ КАК ГодПостройки,
	|	ВЫБОР
	|		КОГДА ВТ_Здания.ФондКапРемонта = ЗНАЧЕНИЕ(Перечисление.бит_СпособФормированияФондаКапРемонта.ПустаяСсылка)
	|			ТОГДА ""Значение не выбрано""
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ВТ_Здания.ФондКапРемонта)
	|	КОНЕЦ КАК ФондКапРемонта,
	|	ВТ_Здания.КолВоПодземныхЭтажей КАК КоличествоПодземныхЭтажей,
	|	ВТ_Здания.КолВоЭтажейНаименьшее КАК КоличествоЭтажейНаименьшее,
	|	ВТ_Здания.КадастровыйНомер КАК КадастровыйНомерЗдания,
	|	ЕСТЬNULL(ВТ_ДопСвойства.ОбщаяПлощадьЖилыхПомещений, 0) КАК ОбщаяПлощадьЖилыхПомещений,
	|	ЕСТЬNULL(ВТ_ДопСвойства.ОбщаяПлощадьЖилогоЗдания, 0) КАК ОбщаяПлощадьЗдания,
	|	ЕСТЬNULL(ВТ_ДопСвойства.КоличествоЭтажей, 0) КАК КоличествоЭтажей,
	|	ВТ_Здания.Серия КАК Серия,
	|	ВТ_Здания.НомерДома КАК НомерДома,
	|	ВТ_Здания.Корпус КАК Корпус,
	|	ВТ_Здания.ПрефиксДома КАК ПрефиксДома,
	|	ВТ_Здания.Прочее КАК Прочее,
	|	ЕСТЬNULL(ВТ_КолВоКвартир.КолВоКвартир, 0) КАК КолВоКвартир
	|ИЗ
	|	ВТ_Здания КАК ВТ_Здания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопСвойства КАК ВТ_ДопСвойства
	|		ПО ВТ_Здания.Здание = ВТ_ДопСвойства.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолВоКвартир КАК ВТ_КолВоКвартир
	|		ПО ВТ_Здания.Здание = ВТ_КолВоКвартир.Здание";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Создание ОбъектаXDTO с типом СписокЗданий.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокЗданий");
	СписокЗданийXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	
	Пока Выборка.Следующий() Цикл
		
		// Создание ОбъектаXDTO с типом Здание.
		ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "Здание");
		ЗданиеXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
		
		ЗданиеXDTO.Идентификатор		= Строка(Выборка.Здание.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(Выборка.НомерДома) Тогда
			ЗданиеXDTO.Номер = Строка(Выборка.НомерДома) + ?(ЗначениеЗаполнено(Выборка.Корпус), Выборка.Корпус, "") 
			+ ?(ЗначениеЗаполнено(Выборка.ПрефиксДома), Выборка.ПрефиксДома, "");
		КонецЕсли;
		
		ЗданиеXDTO.ГодПостройки			= Выборка.ГодПостройки;
		ЗданиеXDTO.Серия				= Выборка.Серия;
		ЗданиеXDTO.Этажность			= Выборка.КоличествоЭтажей;
		ЗданиеXDTO.КолВоКвартир			= Выборка.КолВоКвартир;
		ЗданиеXDTO.ОбщаяПлощадь			= Выборка.ОбщаяПлощадьЗдания;
		ЗданиеXDTO.ПлощадьЖилыхПомещений= Выборка.ОбщаяПлощадьЖилыхПомещений;
		ЗданиеXDTO.Адрес				= Выборка.АдресЗдания;
		ЗданиеXDTO.Прочее				= Выборка.Прочее;
		
		СписокЗданийXDTO.Здание.Добавить(ЗданиеXDTO);
		
	КонецЦикла;
	
	ЗаписатьФайлВыгрузки(СписокЗданийXDTO, ПараметрыОбмена, "building.xml");
	
КонецПроцедуры

Процедура ВыгрузитьКвартиры(ПараметрыОбмена) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ЛицевыеСчета.Квартира КАК Квартира
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_Квартиры.Наименование КАК Наименование,
	|	бит_СписокЗданий.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_Квартиры.НомерКвартиры КАК НомерКвартиры,
	|	бит_Квартиры.УникальныйНомерГИСЖКХ КАК УникальныйНомерГИСЖКХ,
	|	бит_Квартиры.Подъезд КАК Подъезд,
	|	бит_Квартиры.КадастровыйНомер КАК КадастровыйНомер,
	|	бит_СписокЗданий.Улица КАК Улица,
	|	бит_СписокЗданий.Организация КАК Организация,
	|	бит_СписокЗданий.Ссылка КАК Здание,
	|	бит_Квартиры.ПодтвержденоПоставщиком КАК ПодтвержденоПоставщиком
	|ПОМЕСТИТЬ ВТ_Квартиры
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО ВТ_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО (бит_Квартиры.Владелец = бит_СписокЗданий.Ссылка)
	|ГДЕ
	|	НЕ бит_Квартиры.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_СписокЗданий.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_СписокЗданий.Ссылка В (&СписокЗданий))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.Квартира,
	|	бит_Квартиры.Подъезд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП КАК МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства КАК ТипЗапирающегоУстройства,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилоеПомещениеСпециализированногоЖилищногоФонда КАК ЖилоеПомещениеСпециализированногоЖилищногоФонда
	|ПОМЕСТИТЬ ВТ_ДопСведения
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Квартиры.Квартира
	|				ИЗ
	|					ВТ_Квартиры КАК ВТ_Квартиры)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Квартиры.Квартира КАК Квартира,
	|	ВТ_Квартиры.ПочтовыйАдрес КАК АдресКвартиры,
	|	ВТ_Квартиры.Наименование КАК НомерПомещения,
	|	ВТ_Квартиры.Здание КАК Здание,
	|	ЕСТЬNULL(бит_Подъезды.Наименование, """") КАК НомерПодъезда,
	|	ЕСТЬNULL(бит_Подъезды.УникальныйНомерГИСЖКХ, """") КАК КодПодъезда,
	|	ВТ_Квартиры.КадастровыйНомер КАК КадастровыйНомерКвартиры,
	|	ВТ_ДопСведения.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ВТ_ДопСведения.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	ВТ_ДопСведения.МОП КАК МОП,
	|	ВТ_ДопСведения.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	ВТ_ДопСведения.СовокупнаяПлощадь КАК СовокупнаяПлощадь,
	|	ВТ_ДопСведения.СтатусКвартиры КАК СтатусКвартиры,
	|	ВТ_ДопСведения.ТипПлиты КАК ТипПлиты,
	|	ВТ_ДопСведения.ТипЗапирающегоУстройства КАК ТипЗапирающегоУстройства,
	|	ЕСТЬNULL(ВТ_Квартиры.УникальныйНомерГИСЖКХ, """") КАК КодЖилогоПомещения
	|ИЗ
	|	ВТ_Квартиры КАК ВТ_Квартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопСведения КАК ВТ_ДопСведения
	|		ПО ВТ_Квартиры.Квартира = ВТ_ДопСведения.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Подъезды КАК бит_Подъезды
	|		ПО ВТ_Квартиры.Подъезд = бит_Подъезды.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Создание ОбъектаXDTO с типом СписокКвартир.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокКвартир");
	СписокКвартирXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	
	Пока Выборка.Следующий() Цикл
		
		// Создание ОбъектаXDTO с типом Квартира.
		ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "Квартира");
		КвартираXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
		
		КвартираXDTO.ИдентификаторЗдания= Строка(Выборка.Здание.УникальныйИдентификатор());
		КвартираXDTO.Идентификатор		= Строка(Выборка.Квартира.УникальныйИдентификатор());
		КвартираXDTO.Номер				= Выборка.НомерПомещения;
		
		СписокКвартирXDTO.Квартира.Добавить(КвартираXDTO);
		
	КонецЦикла;
	
	ЗаписатьФайлВыгрузки(СписокКвартирXDTO, ПараметрыОбмена, "apartments.xml");
	
КонецПроцедуры

// выгрузка до 22.07.2019
Процедура ВыгрузитьЛицевыеСчетаСтарая(ПараметрыОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	
	ПериодФормирования = ТекущаяДата();
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПериодФормирования));
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	ЕСТЬNULL(бит_Квартиры.Наименование, """") КАК НомерКвартиры
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК УслугаЖКХ
	|ПОМЕСТИТЬ ВТ_СведенияПоУслугам
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальноеСальдо,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечноеСальдо,
	|	СУММА(0) КАК НачальноеСальдоПени,
	|	СУММА(0) КАК КонечноеСальдоПени
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток)
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(ВТ_Остатки.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(ВТ_Остатки.КонечноеСальдо) КАК КонечноеСальдо,
	|	СУММА(ВТ_Остатки.НачальноеСальдоПени) КАК НачальноеСальдоПени,
	|	СУММА(ВТ_Остатки.КонечноеСальдоПени) КАК КонечноеСальдоПени
	|ПОМЕСТИТЬ ВТ_ГрупОстатки
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНачислений,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОплаты,
	|	СУММА(0) КАК СуммаПени
	|ПОМЕСТИТЬ ВТ_Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачислениеПениПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обороты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(ВТ_Обороты.СуммаНачислений) КАК СуммаНачислений,
	|	СУММА(ВТ_Обороты.СуммаОплаты) КАК СуммаОплаты,
	|	СУММА(ВТ_Обороты.СуммаПени) КАК СуммаПени
	|ПОМЕСТИТЬ ВТ_ГрупОбороты
	|ИЗ
	|	ВТ_Обороты КАК ВТ_Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обороты.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	|	ВТ_ЛицевыеСчета.Квартира КАК Квартира,
	|	ВТ_ЛицевыеСчета.НомерКвартиры КАК НомерКвартиры,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачислений,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОбороты.СуммаОплаты, 0)) КАК СуммаОплаты,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОбороты.СуммаПени, 0)) КАК СуммаПени,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.НачальноеСальдо, 0)) КАК НачальноеСальдо,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдо,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоПени,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.КонечноеСальдоПени, 0)) КАК КонечноеСальдоПени,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ВТ_ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомПени,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.КонечноеСальдоПени, 0) + ЕСТЬNULL(ВТ_ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдоСУчетомПени,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ВТ_ГрупОбороты.СуммаОплаты, 0)) КАК НачальноеСальдоСУчетомОплаты,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ВТ_ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ВТ_ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомОплатыИПени,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ВТ_ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомПени,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ВТ_ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачисленийСУчетомОплаты,
	|	СУММА(ЕСТЬNULL(ВТ_ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ВТ_ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ВТ_ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомОплатыИПени
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрупОстатки КАК ВТ_ГрупОстатки
	|		ПО ВТ_ЛицевыеСчета.ЛицевойСчет = ВТ_ГрупОстатки.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрупОбороты КАК ВТ_ГрупОбороты
	|		ПО ВТ_ЛицевыеСчета.ЛицевойСчет = ВТ_ГрупОбороты.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС,
	|	ВТ_ЛицевыеСчета.Здание,
	|	ВТ_ЛицевыеСчета.Квартира,
	|	ВТ_ЛицевыеСчета.НомерКвартиры";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Создание ОбъектаXDTO с типом СписокЛицевыхСчетов.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокЛицевыхСчетов");
	СписокЛицевыхСчетовXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	
	Пока Выборка.Следующий() Цикл
		
		// Создание ОбъектаXDTO с типом ЛицевойСчет.
		ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "ЛицевойСчет");
		ЛицевойСчетXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
		
		ЛицевойСчетXDTO.Идентификатор			= Строка(Выборка.ЛицевойСчет.УникальныйИдентификатор());
		ЛицевойСчетXDTO.ИдентификаторКвартиры	= ?(ЗначениеЗаполнено(Выборка.Квартира), Строка(Выборка.Квартира.УникальныйИдентификатор()), "");
		ЛицевойСчетXDTO.ИдентификаторЗдания		= ?(ЗначениеЗаполнено(Выборка.Здание), Строка(Выборка.Здание.УникальныйИдентификатор()), "");
		ЛицевойСчетXDTO.Номер					= Выборка.НомерЛС;
		ЛицевойСчетXDTO.НомерКвартиры			= Выборка.НомерКвартиры;
		ЛицевойСчетXDTO.НачальноеСальдо			= Выборка.НачальноеСальдоПени;
		ЛицевойСчетXDTO.СуммаНачислений			= Макс(Выборка.СуммаНачислений, -Выборка.СуммаНачислений);		
		//3.06.2019
		если ПараметрыОбмена.УчитыватьПеня = Истина тогда
			ЛицевойСчетXDTO.СуммаНачислений  = Выборка.СуммаНачисленийСУчетомОплатыИПени; 
		конецесли;  

		ЛицевойСчетXDTO.СуммаОплаты				= Макс(Выборка.СуммаОплаты, -Выборка.СуммаОплаты);
		ЛицевойСчетXDTO.СуммаПени				= Макс(Выборка.СуммаПени, -Выборка.СуммаПени);
		ЛицевойСчетXDTO.КонечноеСальдо			= -ЛицевойСчетXDTO.СуммаНачислений;//22.07.2019Выборка.КонечноеСальдоПени;
		
		СписокЛицевыхСчетовXDTO.ЛицевойСчет.Добавить(ЛицевойСчетXDTO);
		
	КонецЦикла;
	
	ЗаписатьФайлВыгрузки(СписокЛицевыхСчетовXDTO, ПараметрыОбмена, "accounts.xml");
	
КонецПроцедуры

Процедура ВыгрузитьЛицевыеСчета(ПараметрыОбмена, Пеня = ложь) Экспорт
Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	
	
	если ЗначениеЗаполнено(ПараметрыОбмена.ДатаНачалаПериода) = ложь тогда
	  ПараметрыОбмена.ДатаНачалаПериода = НачалоМесяца(ТекущаяДата());	
    конецесли;
  
	если ЗначениеЗаполнено(ПараметрыОбмена.ДатаОкончанияПериода) = ложь тогда
	  ПараметрыОбмена.ДатаОкончанияПериода = КонецМесяца(ТекущаяДата());	
	конецесли;	
	
	ПериодФормирования = ПараметрыОбмена.ДатаОкончанияПериода;//ТекущаяДата();
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПериодФормирования));
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// Подготовка обработки печати.
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	ОбработкаОбъект.СписокЛС.Загрузить(Результат); // Фильтрация по ЛС.
	
	//23.05.2019
	если Пеня = ложь тогда
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32;
    иначе
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокументПеня;
	конецесли; 
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = ПараметрыОбмена.Организация;
	ОбработкаОбъект.РС                    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОбмена.Организация, "ОсновнойБанковскийСчет");
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	ОбработкаОбъект.НеПечататьУслугиБезНачислений = Истина;
	ОбработкаОбъект.Период = КонецМесяца(ПериодФормирования);
	ОбработкаОбъект.ОбновитьНастройкиЖКХ();
	ОбработкаОбъект.ОбновитьКэшОрганизации();
	ОбработкаОбъект.ОбновитьКэшПолучателяПлатежа();
	ОбработкаОбъект.ПолучитьНастройкуМакета();
	
	// Настроййки таб. док. поумолчанию.
	ТабличнйДокумент  = Новый ТабличныйДокумент;
	ТабличнйДокумент.АвтоМасштаб = Истина;
	ТабличнйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	если Пеня = ложь тогда
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32;
    иначе
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокументПеня;
	конецесли;         
	
	// Формирование данных для макета.
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати(Истина);	
	
	// Создание ОбъектаXDTO с типом СписокЛицевыхСчетов.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокЛицевыхСчетов");
	СписокЛицевыхСчетовXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	Для Каждого Стр Из Результат Цикл
		
		Отбор = Новый Структура;
		//Отбор.Вставить("ВладелецЛС", Стр.ЛицевойСчет); // Без иерархии.
		Отбор.Вставить("ЛицевойСчет", Стр.ЛицевойСчет);
		ПоискЛС = ТаблицаДанных.НайтиСтроки(Отбор);
		
		Если ПоискЛС.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

	
		Для каждого СтрокаТаблицы Из ПоискЛС Цикл
			
			ТабличнйДокумент.Очистить();
			//23.05.2019
			ОбработкаОбъект.ВывестиНаПечатьКвитанцию(ТабличнйДокумент, СтрокаТаблицы, Пеня);
			
			ИмяВрФайла = ПолучитьИмяВременногоФайла("pdf");
			ТабличнйДокумент.Записать(ИмяВрФайла,ТипФайлаТабличногоДокумента.PDF);
		    //23.05.2019
//			если ПараметрыОбмена.ВыгружатьОтдельнымиФайлами = истина тогда
			если ПараметрыОбмена.ВидТранспорта = 0 тогда
			 КопироватьФайл(ИмяВрФайла, ПараметрыОбмена.КаталогВыгрузки + "\\Квитанция_" + строка(СтрокаТаблицы.ЛицевойСчет) + ".pdf");
			конецесли; 
			ДД = Новый ДвоичныеДанные(ИмяВрФайла);

			
			// Создание ОбъектаXDTO с типом ЛицевойСчет.
			ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "ЛицевойСчет");
			ЛицевойСчетXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
			
			ЛицевойСчетXDTO.Идентификатор			= Строка(СтрокаТаблицы.ЛицевойСчет.УникальныйИдентификатор());
			ЛицевойСчетXDTO.ИдентификаторКвартиры	= ?(ЗначениеЗаполнено(СтрокаТаблицы.ВладелецЛС.Квартира), Строка(СтрокаТаблицы.ВладелецЛС.Квартира.УникальныйИдентификатор()), "");
			ЛицевойСчетXDTO.ИдентификаторЗдания		= ?(ЗначениеЗаполнено(СтрокаТаблицы.ВладелецЛС.Здание), Строка(СтрокаТаблицы.ВладелецЛС.Здание.УникальныйИдентификатор()), "");
			ЛицевойСчетXDTO.Номер					= СтрокаТаблицы.ВладелецЛС.Наименование;
			ЛицевойСчетXDTO.НомерКвартиры			= СтрокаТаблицы.ВладелецЛС.Квартира.Наименование;
			ЛицевойСчетXDTO.НачальноеСальдо			= СтрокаТаблицы.Значение.СтруктураДанных.НачисленоПениЗаПериод;
			ЛицевойСчетXDTO.СуммаНачислений			= Макс(СтрокаТаблицы.Значение.СтруктураДанных.ИтогоКОплатеСУчетомПредоплаты, -СтрокаТаблицы.Значение.СтруктураДанных.ИтогоКОплатеСУчетомПредоплаты);		
			//3.06.2019
			если ПараметрыОбмена.УчитыватьПеня = Истина тогда
				ЛицевойСчетXDTO.СуммаНачислений  = СтрокаТаблицы.Значение.СтруктураДанных.ИтогоКОплатеСУчетомПени; 
			конецесли;  

			ЛицевойСчетXDTO.СуммаОплаты				= Макс(СтрокаТаблицы.Значение.СтруктураДанных.ИтогоКОплатеСУчетомПредоплаты, -СтрокаТаблицы.Значение.СтруктураДанных.ИтогоКОплатеСУчетомПредоплаты);
			ЛицевойСчетXDTO.СуммаПени				= Макс(СтрокаТаблицы.Значение.СтруктураДанных.ИтогПени, -СтрокаТаблицы.Значение.СтруктураДанных.ИтогПени);
			ЛицевойСчетXDTO.КонечноеСальдо			= -ЛицевойСчетXDTO.СуммаНачислений;//22.07.2019СтрокаТаблицы.КонечноеСальдоПени;
			
			СписокЛицевыхСчетовXDTO.ЛицевойСчет.Добавить(ЛицевойСчетXDTO);
			
		 КонецЦикла;
		
	КонецЦикла;
	
	ЗаписатьФайлВыгрузки(СписокЛицевыхСчетовXDTO, ПараметрыОбмена, "accounts.xml");
	
КонецПроцедуры


Процедура ВыгрузитьУслуги(ПараметрыОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	Запрос.УстановитьПараметр("СписокУслуг"	, ПараметрыОбмена.СписокУслуг);
	
	ПериодФормирования = ТекущаяДата();
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПериодФормирования));
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУслуг) 
		И ПараметрыОбмена.СписокУслуг.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУслуги", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУслуги", Истина);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_Квартиры.Наименование КАК НомерКвартиры
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК УслугаЖКХ,
	|	бит_УслугиЖКХ.Наименование КАК Наименование,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХ.Ссылка
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_УслугиЖКХ.Наименование,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС";
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Создание ОбъектаXDTO с типом СписокУслуг.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокУслуг");
	СписокУслугXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	
	Пока Выборка.Следующий() Цикл
		
		// Создание ОбъектаXDTO с типом Услуга.
		ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "Услуга");
		УслугаXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
		
		УслугаXDTO.Идентификатор	= Строка(Выборка.УслугаЖКХ.УникальныйИдентификатор());
		УслугаXDTO.Название			= Выборка.Наименование;
		УслугаXDTO.ТипУслуги		= Строка(Выборка.ГрафаОтчетаГЦЖС);
		
		СписокУслугXDTO.Услуга.Добавить(УслугаXDTO);
		
	КонецЦикла;
	
	ЗаписатьФайлВыгрузки(СписокУслугXDTO, ПараметрыОбмена, "services.xml");
	
КонецПроцедуры

Процедура ВыгрузитьУслугиПоЛС(ПараметрыОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	Запрос.УстановитьПараметр("СписокУслуг"	, ПараметрыОбмена.СписокУслуг);
	
	ПериодФормирования = ТекущаяДата();
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПериодФормирования));
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУслуг) 
		И ПараметрыОбмена.СписокУслуг.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУслуги", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУслуги", Истина);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_Квартиры.Наименование КАК НомерКвартиры
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК УслугаЖКХ,
	|	бит_УслугиЖКХ.Наименование КАК Наименование,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_ПоставщикиУслуг.Наименование КАК НазваниеПоставщика
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = ВТ_ЛицевыеСчета.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ПоставщикиУслуг КАК бит_ПоставщикиУслуг
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_ПоставщикиУслуг.Ссылка
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_УслугиЖКХ.Наименование,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_ПоставщикиУслуг.Наименование";
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Создание ОбъектаXDTO с типом СписокУслугПОЛС.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокУслугПОЛС");
	СписокУслугПОЛСXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	
	Пока Выборка.Следующий() Цикл
		
		// Создание ОбъектаXDTO с типом УслугаПОЛС.
		ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "УслугаПОЛС");
		УслугаПОЛСXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
		
		УслугаПОЛСXDTO.Идентификатор			= Строка(Выборка.УслугаЖКХ.УникальныйИдентификатор());
		УслугаПОЛСXDTO.Название					= Выборка.Наименование;
		УслугаПОЛСXDTO.ИдентификаторЛС			= ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет), Строка(Выборка.ЛицевойСчет.УникальныйИдентификатор()), "");
		УслугаПОЛСXDTO.НомерЛС					= Выборка.НомерЛС;
		УслугаПОЛСXDTO.ТипУслуги				= Строка(Выборка.ГрафаОтчетаГЦЖС);
		УслугаПОЛСXDTO.ИдентификаторПоставщика	= ?(ЗначениеЗаполнено(Выборка.Поставщик), Строка(Выборка.Поставщик.УникальныйИдентификатор()), "");
		УслугаПОЛСXDTO.НазваниеПоставщика		= ?(ЗначениеЗаполнено(Выборка.НазваниеПоставщика), Выборка.НазваниеПоставщика, "");
		
		СписокУслугПОЛСXDTO.УслугаПОЛС.Добавить(УслугаПОЛСXDTO);
		
	КонецЦикла;
	
	ЗаписатьФайлВыгрузки(СписокУслугПОЛСXDTO, ПараметрыОбмена, "services_on_accounts.xml");
	
КонецПроцедуры

Процедура ВыгрузитьСчетчики(ПараметрыОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	Запрос.УстановитьПараметр("СписокУслуг"	, ПараметрыОбмена.СписокУслуг);
	
	ПериодФормирования = ТекущаяДата();
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("Период"			, ПериодФормирования);
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУслуг) 
		И ПараметрыОбмена.СписокУслуг.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУслуги", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУслуги", Истина);
	КонецЕсли;
	
	// Индивидуальные.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_Квартиры.Наименование КАК НомерКвартиры
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Здание,
	|	Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период КАК Период,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать КАК Использовать,
	|	ВЫБОР
	|		КОГДА бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|			ТОГДА ""Индивидуальный""
	|		КОГДА бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	|			ТОГДА ""Коллективный (общедомовой)""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВидПУ,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения КАК СпособРаспределения,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный КАК Многотарифный,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет КАК Приоритет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьСтавкуПоСчетчику КАК ИспользоватьСтавкуПоСчетчику,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Поставщик КАК Поставщик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга КАК ОсновнаяУслуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределенияУменьшения КАК СпособРаспределенияУменьшения
	|ПОМЕСТИТЬ ВТ_ДанныеУстановкиПУ
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Период,
	|			Объект В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|	И бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Счетчик,
	|	Услуга,
	|	МестоУстановкиСчетчика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПоказанияСчетчиков.Период КАК Период,
	|	бит_ПоказанияСчетчиков.Объект КАК Объект,
	|	бит_ПоказанияСчетчиков.Услуга КАК Услуга,
	|	бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиков.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияИнспектора <> 0
	|			ТОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияИнспектора
	|		КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияНаселения <> 0
	|			ТОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияНаселения
	|		ИНАЧЕ бит_ПоказанияСчетчиков.ПоказанияПодкрутка
	|	КОНЕЦ КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ВсеПоказания
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ
	|		ПО (ВТ_ДанныеУстановкиПУ.Объект = (ВЫРАЗИТЬ(бит_ПоказанияСчетчиков.Объект КАК Справочник.бит_ЛицевыеСчета)))
	|			И (ВТ_ДанныеУстановкиПУ.Услуга = бит_ПоказанияСчетчиков.Услуга)
	|			И (ВТ_ДанныеУстановкиПУ.Счетчик = бит_ПоказанияСчетчиков.Счетчик)
	|ГДЕ
	|	бит_ПоказанияСчетчиков.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|	И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_ВводПоказанийПоСчетчикам
	|			ИЛИ бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_КорректировкаПоказанийСчетчиков)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Объект,
	|	Услуга,
	|	Счетчик,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеПоказания.Период) КАК Период,
	|	ВТ_ВсеПоказания.Объект КАК Объект,
	|	ВТ_ВсеПоказания.Услуга КАК Услуга,
	|	ВТ_ВсеПоказания.Счетчик КАК Счетчик,
	|	ВТ_ВсеПоказания.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДатаПоследнихПоказания
	|ИЗ
	|	ВТ_ВсеПоказания КАК ВТ_ВсеПоказания
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеПоказания.Объект,
	|	ВТ_ВсеПоказания.Услуга,
	|	ВТ_ВсеПоказания.Счетчик,
	|	ВТ_ВсеПоказания.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Объект,
	|	Услуга,
	|	Счетчик,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатаПоследнихПоказания.Период КАК ДатаСнятияПоказания,
	|	ВТ_ДатаПоследнихПоказания.Объект КАК Объект,
	|	ВТ_ДатаПоследнихПоказания.Услуга КАК Услуга,
	|	ВТ_ДатаПоследнихПоказания.Счетчик КАК Счетчик,
	|	ВТ_ДатаПоследнихПоказания.Организация КАК Организация,
	|	ВТ_ВсеПоказания.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_Показания
	|ИЗ
	|	ВТ_ДатаПоследнихПоказания КАК ВТ_ДатаПоследнихПоказания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеПоказания КАК ВТ_ВсеПоказания
	|		ПО ВТ_ДатаПоследнихПоказания.Период = ВТ_ВсеПоказания.Период
	|			И ВТ_ДатаПоследнихПоказания.Объект = ВТ_ВсеПоказания.Объект
	|			И ВТ_ДатаПоследнихПоказания.Услуга = ВТ_ВсеПоказания.Услуга
	|			И ВТ_ДатаПоследнихПоказания.Счетчик = ВТ_ВсеПоказания.Счетчик
	|			И ВТ_ДатаПоследнихПоказания.Организация = ВТ_ВсеПоказания.Организация
	|ГДЕ
	|	ВТ_ВсеПоказания.ПоследниеПоказания <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) КАК ДатаСнятияПоказания,
	|	бит_ПоказанияСчетчиковОстатки.Объект КАК Объект,
	|	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
	|	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиковОстатки.Организация КАК Организация,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ПоказанияОстатки
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|			НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	|			(Объект, Услуга, Счетчик) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ДанныеУстановкиПУ.Объект,
	|					ВТ_ДанныеУстановкиПУ.Услуга,
	|					ВТ_ДанныеУстановкиПУ.Счетчик
	|				ИЗ
	|					ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ)) КАК бит_ПоказанияСчетчиковОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеУстановкиПУ.Объект КАК Объект,
	|	ВТ_ДанныеУстановкиПУ.Счетчик КАК Счетчик,
	|	СУММА(1) КАК КолВоТарифов
	|ПОМЕСТИТЬ ВТ_Многотарифные
	|ИЗ
	|	ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ
	|ГДЕ
	|	ВТ_ДанныеУстановкиПУ.Многотарифный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеУстановкиПУ.Объект,
	|	ВТ_ДанныеУстановкиПУ.Счетчик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки,
	|	бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку КАК СнятНаПоверку
	|ПОМЕСТИТЬ ВТ_Поверка
	|ИЗ
	|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(
	|			&Период,
	|			Счетчик В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ДанныеУстановкиПУ.Счетчик
	|				ИЗ
	|					ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ)) КАК бит_ПоверкаСчетчиковСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеУстановкиПУ.Объект КАК Объект,
	|	ВТ_ДанныеУстановкиПУ.Услуга КАК Услуга,
	|	ВТ_ДанныеУстановкиПУ.Счетчик КАК Счетчик,
	|	ВТ_ДанныеУстановкиПУ.ВидПУ КАК ВидПУ,
	|	бит_Комнаты.УникальныйНомерГИСЖКХ КАК УникальныйНомерКомнаты,
	|	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	ВЫБОР
	|		КОГДА ВТ_Многотарифные.КолВоТарифов ЕСТЬ NULL
	|				ИЛИ ВТ_Многотарифные.КолВоТарифов = 1
	|			ТОГДА ""Однотарифный""
	|		КОГДА ВТ_Многотарифные.КолВоТарифов = 2
	|			ТОГДА ""Двухтарифный""
	|		ИНАЧЕ ""Трехтарифный""
	|	КОНЕЦ КАК ВидПУПоКоличествуТарифов,
	|	ВТ_ДанныеУстановкиПУ.Период КАК ДатаУстановки,
	|	ВТ_ДанныеУстановкиПУ.Период КАК ДатаВводаВЭксплуатацию,
	|	ВТ_Поверка.ДатаПоверки КАК ДатаПоследнейПоверки,
	|	ВЫБОР
	|		КОГДА ВТ_Показания.ДатаСнятияПоказания ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ВТ_ПоказанияОстатки.ДатаСнятияПоказания, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ВТ_Показания.ДатаСнятияПоказания
	|	КОНЕЦ КАК ДатаСнятияПоказания,
	|	ВЫБОР
	|		КОГДА ВТ_Показания.ПоследниеПоказания ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ВТ_ПоказанияОстатки.ПоследниеПоказания, 0)
	|		ИНАЧЕ ВТ_Показания.ПоследниеПоказания
	|	КОНЕЦ КАК ПоследниеПоказания,
	|	бит_УслугиЖКХ.Приоритет КАК Приоритет,
	|	ВТ_ДанныеУстановкиПУ.Многотарифный КАК Многотарифный
	|ПОМЕСТИТЬ ВТ_ВсеСчетчики
	|ИЗ
	|	ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показания КАК ВТ_Показания
	|		ПО ВТ_ДанныеУстановкиПУ.Объект = ВТ_Показания.Объект
	|			И ВТ_ДанныеУстановкиПУ.Услуга = ВТ_Показания.Услуга
	|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Показания.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказанияОстатки КАК ВТ_ПоказанияОстатки
	|		ПО ВТ_ДанныеУстановкиПУ.Объект = ВТ_ПоказанияОстатки.Объект
	|			И ВТ_ДанныеУстановкиПУ.Услуга = ВТ_ПоказанияОстатки.Услуга
	|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_ПоказанияОстатки.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_ДанныеУстановкиПУ.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поверка КАК ВТ_Поверка
	|		ПО ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Поверка.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Комнаты КАК бит_Комнаты
	|		ПО ВТ_ДанныеУстановкиПУ.МестоУстановкиСчетчика = бит_Комнаты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ПО ((ВЫРАЗИТЬ(ВТ_ДанныеУстановкиПУ.Объект КАК Справочник.бит_ЛицевыеСчета)) = ВТ_ЛицевыеСчета.ЛицевойСчет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Многотарифные КАК ВТ_Многотарифные
	|		ПО ВТ_ДанныеУстановкиПУ.Объект = ВТ_Многотарифные.Объект
	|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Многотарифные.Счетчик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Счетчик,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчики.Объект КАК Объект,
	|	ВТ_ВсеСчетчики.Счетчик КАК Счетчик
	|ПОМЕСТИТЬ ВТ_СтокиВсе
	|ИЗ
	|	ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	|ГДЕ
	|	НЕ ВТ_ВсеСчетчики.Многотарифный
	|	И ВТ_ВсеСчетчики.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Водопровод)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ВсеСчетчики.Объект,
	|	ВТ_ВсеСчетчики.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтокиВсе.Объект КАК Объект,
	|	ВТ_СтокиВсе.Счетчик КАК Счетчик,
	|	СУММА(1) КАК КолВо
	|ПОМЕСТИТЬ ВТ_ИсключитьСтоки
	|ИЗ
	|	ВТ_СтокиВсе КАК ВТ_СтокиВсе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	|		ПО ВТ_СтокиВсе.Объект = ВТ_ВсеСчетчики.Объект
	|			И ВТ_СтокиВсе.Счетчик = ВТ_ВсеСчетчики.Счетчик
	|			И (НЕ ВТ_ВсеСчетчики.Многотарифный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтокиВсе.Объект,
	|	ВТ_СтокиВсе.Счетчик
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_СтокиВсе.Объект,
	|	ВТ_СтокиВсе.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчики.Объект КАК Объект,
	|	ВТ_ВсеСчетчики.Услуга КАК Услуга,
	|	ВТ_ВсеСчетчики.Счетчик КАК Счетчик,
	|	ВТ_ВсеСчетчики.ВидПУ КАК ВидПУ,
	|	ВТ_ВсеСчетчики.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	|	ВТ_ВсеСчетчики.НомерЛС КАК НомерЛС,
	|	ВТ_ВсеСчетчики.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	ВТ_ВсеСчетчики.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	|	ВТ_ВсеСчетчики.ДатаУстановки КАК ДатаУстановки,
	|	ВТ_ВсеСчетчики.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВТ_ВсеСчетчики.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	|	ВТ_ВсеСчетчики.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	|	ВТ_ВсеСчетчики.ПоследниеПоказания КАК ПоследниеПоказания,
	|	ВТ_ВсеСчетчики.Приоритет КАК Приоритет,
	|	ВТ_ВсеСчетчики.Многотарифный КАК Многотарифный
	|ПОМЕСТИТЬ ВТ_ВсеСчетчикиИтого
	|ИЗ
	|	ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсключитьСтоки КАК ВТ_ИсключитьСтоки
	|		ПО ВТ_ВсеСчетчики.Объект = ВТ_ИсключитьСтоки.Объект
	|			И ВТ_ВсеСчетчики.Счетчик = ВТ_ИсключитьСтоки.Счетчик
	|ГДЕ
	|	(ВТ_ИсключитьСтоки.Объект ЕСТЬ NULL
	|			ИЛИ ВТ_ВсеСчетчики.ГрафаОтчетаГЦЖС <> ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Водопровод))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчикиИтого.Объект КАК Объект,
	|	ВТ_ВсеСчетчикиИтого.Счетчик КАК Счетчик,
	|	МИНИМУМ(ВТ_ВсеСчетчикиИтого.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетОднотарифный
	|ИЗ
	|	ВТ_ВсеСчетчикиИтого КАК ВТ_ВсеСчетчикиИтого
	|ГДЕ
	|	НЕ ВТ_ВсеСчетчикиИтого.Многотарифный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеСчетчикиИтого.Объект,
	|	ВТ_ВсеСчетчикиИтого.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчикиИтого.Объект КАК Объект,
	|	ВТ_ВсеСчетчикиИтого.Услуга КАК Услуга,
	|	ВТ_ВсеСчетчикиИтого.Счетчик КАК Счетчик,
	|	ВТ_ВсеСчетчикиИтого.ВидПУ КАК ВидПУ,
	|	ВТ_ВсеСчетчикиИтого.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	|	ВТ_ВсеСчетчикиИтого.НомерЛС КАК НомерЛС,
	|	ВТ_ВсеСчетчикиИтого.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	ВТ_ВсеСчетчикиИтого.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	|	ВТ_ВсеСчетчикиИтого.ДатаУстановки КАК ДатаУстановки,
	|	ВТ_ВсеСчетчикиИтого.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВТ_ВсеСчетчикиИтого.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	|	ВТ_ВсеСчетчикиИтого.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	|	ВТ_ВсеСчетчикиИтого.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ИтогОднотарифные
	|ИЗ
	|	ВТ_ПриоритетОднотарифный КАК ВТ_ПриоритетОднотарифный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеСчетчикиИтого КАК ВТ_ВсеСчетчикиИтого
	|		ПО ВТ_ПриоритетОднотарифный.Объект = ВТ_ВсеСчетчикиИтого.Объект
	|			И ВТ_ПриоритетОднотарифный.Счетчик = ВТ_ВсеСчетчикиИтого.Счетчик
	|			И ВТ_ПриоритетОднотарифный.Приоритет = ВТ_ВсеСчетчикиИтого.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчикиИтого.Объект КАК Объект,
	|	ВТ_ВсеСчетчикиИтого.Услуга КАК Услуга,
	|	ВТ_ВсеСчетчикиИтого.Счетчик КАК Счетчик,
	|	ВТ_ВсеСчетчикиИтого.Приоритет КАК Приоритет,
	|	ВТ_ВсеСчетчикиИтого.ВидПУ КАК ВидПУ,
	|	ВТ_ВсеСчетчикиИтого.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	|	ВТ_ВсеСчетчикиИтого.НомерЛС КАК НомерЛС,
	|	ВТ_ВсеСчетчикиИтого.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	ВТ_ВсеСчетчикиИтого.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	|	ВТ_ВсеСчетчикиИтого.ДатаУстановки КАК ДатаУстановки,
	|	ВТ_ВсеСчетчикиИтого.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВТ_ВсеСчетчикиИтого.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	|	ВТ_ВсеСчетчикиИтого.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	|	ВТ_ВсеСчетчикиИтого.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ИтогМноготарифные
	|ИЗ
	|	ВТ_ВсеСчетчикиИтого КАК ВТ_ВсеСчетчикиИтого
	|ГДЕ
	|	ВТ_ВсеСчетчикиИтого.Многотарифный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтогОднотарифные.Объект КАК Объект,
	|	ВТ_ИтогОднотарифные.Услуга КАК Услуга,
	|	ВТ_ИтогОднотарифные.Счетчик КАК Счетчик,
	|	ВТ_ИтогОднотарифные.ВидПУ КАК ВидПУ,
	|	ВТ_ИтогОднотарифные.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	|	ВТ_ИтогОднотарифные.НомерЛС КАК НомерЛС,
	|	ВТ_ИтогОднотарифные.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	ВТ_ИтогОднотарифные.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	|	ВТ_ИтогОднотарифные.ДатаУстановки КАК ДатаУстановки,
	|	ВТ_ИтогОднотарифные.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВТ_ИтогОднотарифные.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	|	ВТ_ИтогОднотарифные.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	|	ВТ_ИтогОднотарифные.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|ИЗ
	|	ВТ_ИтогОднотарифные КАК ВТ_ИтогОднотарифные
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ИтогМноготарифные.Объект,
	|	ВТ_ИтогМноготарифные.Услуга,
	|	ВТ_ИтогМноготарифные.Счетчик,
	|	ВТ_ИтогМноготарифные.ВидПУ,
	|	ВТ_ИтогМноготарифные.УникальныйНомерКомнаты,
	|	ВТ_ИтогМноготарифные.НомерЛС,
	|	ВТ_ИтогМноготарифные.ГрафаОтчетаГЦЖС,
	|	ВТ_ИтогМноготарифные.ВидПУПоКоличествуТарифов,
	|	ВТ_ИтогМноготарифные.ДатаУстановки,
	|	ВТ_ИтогМноготарифные.ДатаВводаВЭксплуатацию,
	|	ВТ_ИтогМноготарифные.ДатаПоследнейПоверки,
	|	ВТ_ИтогМноготарифные.ДатаСнятияПоказания,
	|	ВТ_ИтогМноготарифные.ПоследниеПоказания
	|ИЗ
	|	ВТ_ИтогМноготарифные КАК ВТ_ИтогМноготарифные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТаблица.Объект КАК Объект,
	|	ВТ_ИтоговаяТаблица.НомерЛС КАК НомерЛС,
	|	ВТ_ИтоговаяТаблица.Услуга КАК Услуга,
	|	ВТ_ИтоговаяТаблица.Счетчик КАК Счетчик,
	|	ВТ_ИтоговаяТаблица.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	|	ВТ_ИтоговаяТаблица.ПоследниеПоказания КАК ПоследниеПоказания,
	|	ВТ_ИтоговаяТаблица.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	|	бит_Счетчики.Наименование КАК Наименование
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Счетчики КАК бит_Счетчики
	|		ПО ВТ_ИтоговаяТаблица.Счетчик = бит_Счетчики.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Создание ОбъектаXDTO с типом СписокСчетчиков.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокСчетчиков");
	СписокСчетчиковXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	Пока Выборка.Следующий() Цикл
		
		// Создание ОбъектаXDTO с типом Счетчик.
		ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "Счетчик");
		СчетчикXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
		
		СчетчикXDTO.Идентификатор			= Строка(Выборка.Счетчик.УникальныйИдентификатор());
		СчетчикXDTO.Название				= Выборка.Наименование;
		СчетчикXDTO.ИдентификаторВладельца	= Строка(Выборка.Объект.УникальныйИдентификатор());
		СчетчикXDTO.ИдентификаторУслуги		= ?(ЗначениеЗаполнено(Выборка.Услуга), Строка(Выборка.Услуга.УникальныйИдентификатор()), "");
		СчетчикXDTO.ТипУслуги				= Строка(Выборка.ГрафаОтчетаГЦЖС);
		СчетчикXDTO.ДатаСнятияПоказания		= Формат(Выборка.ДатаСнятияПоказания, "ДФ=дд.ММ.гггг");
		СчетчикXDTO.Показания				= Выборка.ПоследниеПоказания;
		
		СписокСчетчиковXDTO.Счетчик.Добавить(СчетчикXDTO);
		
	КонецЦикла;
	
	//// Групповые.
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	//|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	//|	бит_ЛицевыеСчета.Здание КАК Здание,
	//|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	//|	бит_Квартиры.Наименование КАК НомерКвартиры
	//|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	//|ИЗ
	//|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	//|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	//|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	//|ГДЕ
	//|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	//|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	//|	И НЕ бит_СписокЗданий.ПометкаУдаления
	//|	И (&НеПроверятьЛС
	//|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	//|	И (&НеПроверятьОрганизации
	//|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	//|	И (&НеПроверятьУлицы
	//|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	//|	И (&НеПроверятьЗдания
	//|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ЛицевойСчет,
	//|	Здание,
	//|	Квартира
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период КАК Период,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать КАК Использовать,
	//|	ВЫБОР
	//|		КОГДА бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	//|			ТОГДА ""Индивидуальный""
	//|		КОГДА бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	//|			ТОГДА ""Коллективный (общедомовой)""
	//|		ИНАЧЕ """"
	//|	КОНЕЦ КАК ВидПУ,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета КАК СпособРасчета,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения КАК СпособРаспределения,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный КАК Многотарифный,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет КАК Приоритет,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьСтавкуПоСчетчику КАК ИспользоватьСтавкуПоСчетчику,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Поставщик КАК Поставщик,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.РежимПотребления КАК РежимПотребления,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга КАК ОсновнаяУслуга,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения,
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределенияУменьшения КАК СпособРаспределенияУменьшения
	//|ПОМЕСТИТЬ ВТ_ДанныеУстановкиПУ
	//|ИЗ
	//|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	//|			&Период,
	//|			Объект В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					ВТ_ЛицевыеСчета.Здание
	//|				ИЗ
	//|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	//|ГДЕ
	//|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	//|	И бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Объект,
	//|	Счетчик,
	//|	Услуга,
	//|	МестоУстановкиСчетчика
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	бит_ПоказанияСчетчиков.Период КАК Период,
	//|	бит_ПоказанияСчетчиков.Объект КАК Объект,
	//|	бит_ПоказанияСчетчиков.Услуга КАК Услуга,
	//|	бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
	//|	бит_ПоказанияСчетчиков.Организация КАК Организация,
	//|	ВЫБОР
	//|		КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияИнспектора <> 0
	//|			ТОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияИнспектора
	//|		КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияНаселения <> 0
	//|			ТОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияНаселения
	//|		ИНАЧЕ бит_ПоказанияСчетчиков.ПоказанияПодкрутка
	//|	КОНЕЦ КАК ПоследниеПоказания
	//|ПОМЕСТИТЬ ВТ_ВсеПоказания
	//|ИЗ
	//|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	//|ГДЕ
	//|	бит_ПоказанияСчетчиков.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	//|	И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|	И бит_ПоказанияСчетчиков.Объект ССЫЛКА Справочник.бит_СписокЗданий
	//|	И (бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_ВводПоказанийПоСчетчикам
	//|			ИЛИ бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_КорректировкаПоказанийСчетчиков)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	Объект,
	//|	Услуга,
	//|	Счетчик,
	//|	Организация
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ВТ_ВсеПоказания.Период) КАК Период,
	//|	ВТ_ВсеПоказания.Объект КАК Объект,
	//|	ВТ_ВсеПоказания.Услуга КАК Услуга,
	//|	ВТ_ВсеПоказания.Счетчик КАК Счетчик,
	//|	ВТ_ВсеПоказания.Организация КАК Организация
	//|ПОМЕСТИТЬ ВТ_ДатаПоследнихПоказания
	//|ИЗ
	//|	ВТ_ВсеПоказания КАК ВТ_ВсеПоказания
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ВсеПоказания.Объект,
	//|	ВТ_ВсеПоказания.Услуга,
	//|	ВТ_ВсеПоказания.Счетчик,
	//|	ВТ_ВсеПоказания.Организация
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	Объект,
	//|	Услуга,
	//|	Счетчик,
	//|	Организация
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДатаПоследнихПоказания.Период КАК ДатаСнятияПоказания,
	//|	ВТ_ДатаПоследнихПоказания.Объект КАК Объект,
	//|	ВТ_ДатаПоследнихПоказания.Услуга КАК Услуга,
	//|	ВТ_ДатаПоследнихПоказания.Счетчик КАК Счетчик,
	//|	ВТ_ДатаПоследнихПоказания.Организация КАК Организация,
	//|	ВТ_ВсеПоказания.ПоследниеПоказания КАК ПоследниеПоказания
	//|ПОМЕСТИТЬ ВТ_Показания
	//|ИЗ
	//|	ВТ_ДатаПоследнихПоказания КАК ВТ_ДатаПоследнихПоказания
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеПоказания КАК ВТ_ВсеПоказания
	//|		ПО ВТ_ДатаПоследнихПоказания.Период = ВТ_ВсеПоказания.Период
	//|			И ВТ_ДатаПоследнихПоказания.Объект = ВТ_ВсеПоказания.Объект
	//|			И ВТ_ДатаПоследнихПоказания.Услуга = ВТ_ВсеПоказания.Услуга
	//|			И ВТ_ДатаПоследнихПоказания.Счетчик = ВТ_ВсеПоказания.Счетчик
	//|			И ВТ_ДатаПоследнихПоказания.Организация = ВТ_ВсеПоказания.Организация
	//|ГДЕ
	//|	ВТ_ВсеПоказания.ПоследниеПоказания <> 0
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Объект,
	//|	Услуга,
	//|	Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) КАК ДатаСнятияПоказания,
	//|	бит_ПоказанияСчетчиковОстатки.Объект КАК Объект,
	//|	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
	//|	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
	//|	бит_ПоказанияСчетчиковОстатки.Организация КАК Организация,
	//|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПоследниеПоказания
	//|ПОМЕСТИТЬ ВТ_ПоказанияОстатки
	//|ИЗ
	//|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	//|			НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	//|			(Объект, Счетчик, Услуга) В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					ВТ_ДанныеУстановкиПУ.Объект,
	//|					ВТ_ДанныеУстановкиПУ.Счетчик,
	//|					ВТ_ДанныеУстановкиПУ.Услуга
	//|				ИЗ
	//|					ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ)) КАК бит_ПоказанияСчетчиковОстатки
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Объект,
	//|	Услуга,
	//|	Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДанныеУстановкиПУ.Объект КАК Объект,
	//|	ВТ_ДанныеУстановкиПУ.Счетчик КАК Счетчик,
	//|	СУММА(1) КАК КолВоТарифов
	//|ПОМЕСТИТЬ ВТ_Многотарифные
	//|ИЗ
	//|	ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ
	//|ГДЕ
	//|	ВТ_ДанныеУстановкиПУ.Многотарифный
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ДанныеУстановкиПУ.Объект,
	//|	ВТ_ДанныеУстановкиПУ.Счетчик
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Объект,
	//|	Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
	//|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки,
	//|	бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку КАК СнятНаПоверку
	//|ПОМЕСТИТЬ ВТ_Поверка
	//|ИЗ
	//|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(
	//|			&Период,
	//|			Счетчик В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					ВТ_ДанныеУстановкиПУ.Счетчик
	//|				ИЗ
	//|					ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ)) КАК бит_ПоверкаСчетчиковСрезПоследних
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДанныеУстановкиПУ.Объект КАК Объект,
	//|	ВТ_ДанныеУстановкиПУ.Услуга КАК Услуга,
	//|	ВТ_ДанныеУстановкиПУ.Счетчик КАК Счетчик,
	//|	ВТ_ДанныеУстановкиПУ.ВидПУ КАК ВидПУ,
	//|	бит_Комнаты.УникальныйНомерГИСЖКХ КАК УникальныйНомерКомнаты,
	//|	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	//|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	//|	ВЫБОР
	//|		КОГДА ВТ_Многотарифные.КолВоТарифов ЕСТЬ NULL
	//|				ИЛИ ВТ_Многотарифные.КолВоТарифов = 1
	//|			ТОГДА ""Однотарифный""
	//|		КОГДА ВТ_Многотарифные.КолВоТарифов = 2
	//|			ТОГДА ""Двухтарифный""
	//|		ИНАЧЕ ""Трехтарифный""
	//|	КОНЕЦ КАК ВидПУПоКоличествуТарифов,
	//|	ВТ_ДанныеУстановкиПУ.Период КАК ДатаУстановки,
	//|	ВТ_ДанныеУстановкиПУ.Период КАК ДатаВводаВЭксплуатацию,
	//|	ВТ_Поверка.ДатаПоверки КАК ДатаПоследнейПоверки,
	//|	ВЫБОР
	//|		КОГДА ВТ_Показания.ДатаСнятияПоказания ЕСТЬ NULL
	//|			ТОГДА ЕСТЬNULL(ВТ_ПоказанияОстатки.ДатаСнятияПоказания, ДАТАВРЕМЯ(1, 1, 1))
	//|		ИНАЧЕ ВТ_Показания.ДатаСнятияПоказания
	//|	КОНЕЦ КАК ДатаСнятияПоказания,
	//|	ВЫБОР
	//|		КОГДА ВТ_Показания.ПоследниеПоказания ЕСТЬ NULL
	//|			ТОГДА ЕСТЬNULL(ВТ_ПоказанияОстатки.ПоследниеПоказания, 0)
	//|		ИНАЧЕ ВТ_Показания.ПоследниеПоказания
	//|	КОНЕЦ КАК ПоследниеПоказания,
	//|	бит_УслугиЖКХ.Приоритет КАК Приоритет,
	//|	ВТ_ДанныеУстановкиПУ.Многотарифный КАК Многотарифный
	//|ПОМЕСТИТЬ ВТ_ВсеСчетчики
	//|ИЗ
	//|	ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показания КАК ВТ_Показания
	//|		ПО ВТ_ДанныеУстановкиПУ.Объект = ВТ_Показания.Объект
	//|			И ВТ_ДанныеУстановкиПУ.Услуга = ВТ_Показания.Услуга
	//|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Показания.Счетчик
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказанияОстатки КАК ВТ_ПоказанияОстатки
	//|		ПО ВТ_ДанныеУстановкиПУ.Объект = ВТ_ПоказанияОстатки.Объект
	//|			И ВТ_ДанныеУстановкиПУ.Услуга = ВТ_ПоказанияОстатки.Услуга
	//|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_ПоказанияОстатки.Счетчик
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	//|		ПО ВТ_ДанныеУстановкиПУ.Услуга = бит_УслугиЖКХ.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поверка КАК ВТ_Поверка
	//|		ПО ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Поверка.Счетчик
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Комнаты КАК бит_Комнаты
	//|		ПО ВТ_ДанныеУстановкиПУ.МестоУстановкиСчетчика = бит_Комнаты.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	//|		ПО ((ВЫРАЗИТЬ(ВТ_ДанныеУстановкиПУ.Объект КАК Справочник.бит_ЛицевыеСчета)) = ВТ_ЛицевыеСчета.ЛицевойСчет)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Многотарифные КАК ВТ_Многотарифные
	//|		ПО ВТ_ДанныеУстановкиПУ.Объект = ВТ_Многотарифные.Объект
	//|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Многотарифные.Счетчик
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Объект,
	//|	Счетчик,
	//|	Приоритет
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ВсеСчетчики.Объект КАК Объект,
	//|	ВТ_ВсеСчетчики.Счетчик КАК Счетчик
	//|ПОМЕСТИТЬ ВТ_СтокиВсе
	//|ИЗ
	//|	ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	//|ГДЕ
	//|	НЕ ВТ_ВсеСчетчики.Многотарифный
	//|	И ВТ_ВсеСчетчики.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Водопровод)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ВТ_ВсеСчетчики.Объект,
	//|	ВТ_ВсеСчетчики.Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_СтокиВсе.Объект КАК Объект,
	//|	ВТ_СтокиВсе.Счетчик КАК Счетчик,
	//|	СУММА(1) КАК КолВо
	//|ПОМЕСТИТЬ ВТ_ИсключитьСтоки
	//|ИЗ
	//|	ВТ_СтокиВсе КАК ВТ_СтокиВсе
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	//|		ПО ВТ_СтокиВсе.Объект = ВТ_ВсеСчетчики.Объект
	//|			И ВТ_СтокиВсе.Счетчик = ВТ_ВсеСчетчики.Счетчик
	//|			И (НЕ ВТ_ВсеСчетчики.Многотарифный)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_СтокиВсе.Объект,
	//|	ВТ_СтокиВсе.Счетчик
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(1) > 1
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ВТ_СтокиВсе.Объект,
	//|	ВТ_СтокиВсе.Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ВсеСчетчики.Объект КАК Объект,
	//|	ВТ_ВсеСчетчики.Услуга КАК Услуга,
	//|	ВТ_ВсеСчетчики.Счетчик КАК Счетчик,
	//|	ВТ_ВсеСчетчики.ВидПУ КАК ВидПУ,
	//|	ВТ_ВсеСчетчики.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	//|	ВТ_ВсеСчетчики.НомерЛС КАК НомерЛС,
	//|	ВТ_ВсеСчетчики.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	//|	ВТ_ВсеСчетчики.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	//|	ВТ_ВсеСчетчики.ДатаУстановки КАК ДатаУстановки,
	//|	ВТ_ВсеСчетчики.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	//|	ВТ_ВсеСчетчики.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	//|	ВТ_ВсеСчетчики.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	//|	ВТ_ВсеСчетчики.ПоследниеПоказания КАК ПоследниеПоказания,
	//|	ВТ_ВсеСчетчики.Приоритет КАК Приоритет,
	//|	ВТ_ВсеСчетчики.Многотарифный КАК Многотарифный
	//|ПОМЕСТИТЬ ВТ_ВсеСчетчикиИтого
	//|ИЗ
	//|	ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсключитьСтоки КАК ВТ_ИсключитьСтоки
	//|		ПО ВТ_ВсеСчетчики.Объект = ВТ_ИсключитьСтоки.Объект
	//|			И ВТ_ВсеСчетчики.Счетчик = ВТ_ИсключитьСтоки.Счетчик
	//|ГДЕ
	//|	(ВТ_ИсключитьСтоки.Объект ЕСТЬ NULL
	//|			ИЛИ ВТ_ВсеСчетчики.ГрафаОтчетаГЦЖС <> ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.Водопровод))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ВсеСчетчикиИтого.Объект КАК Объект,
	//|	ВТ_ВсеСчетчикиИтого.Счетчик КАК Счетчик,
	//|	МИНИМУМ(ВТ_ВсеСчетчикиИтого.Приоритет) КАК Приоритет
	//|ПОМЕСТИТЬ ВТ_ПриоритетОднотарифный
	//|ИЗ
	//|	ВТ_ВсеСчетчикиИтого КАК ВТ_ВсеСчетчикиИтого
	//|ГДЕ
	//|	НЕ ВТ_ВсеСчетчикиИтого.Многотарифный
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ВсеСчетчикиИтого.Объект,
	//|	ВТ_ВсеСчетчикиИтого.Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ВсеСчетчикиИтого.Объект КАК Объект,
	//|	ВТ_ВсеСчетчикиИтого.Услуга КАК Услуга,
	//|	ВТ_ВсеСчетчикиИтого.Счетчик КАК Счетчик,
	//|	ВТ_ВсеСчетчикиИтого.ВидПУ КАК ВидПУ,
	//|	ВТ_ВсеСчетчикиИтого.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	//|	ВТ_ВсеСчетчикиИтого.НомерЛС КАК НомерЛС,
	//|	ВТ_ВсеСчетчикиИтого.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	//|	ВТ_ВсеСчетчикиИтого.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	//|	ВТ_ВсеСчетчикиИтого.ДатаУстановки КАК ДатаУстановки,
	//|	ВТ_ВсеСчетчикиИтого.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	//|	ВТ_ВсеСчетчикиИтого.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	//|	ВТ_ВсеСчетчикиИтого.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	//|	ВТ_ВсеСчетчикиИтого.ПоследниеПоказания КАК ПоследниеПоказания
	//|ПОМЕСТИТЬ ВТ_ИтогОднотарифные
	//|ИЗ
	//|	ВТ_ПриоритетОднотарифный КАК ВТ_ПриоритетОднотарифный
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеСчетчикиИтого КАК ВТ_ВсеСчетчикиИтого
	//|		ПО ВТ_ПриоритетОднотарифный.Объект = ВТ_ВсеСчетчикиИтого.Объект
	//|			И ВТ_ПриоритетОднотарифный.Счетчик = ВТ_ВсеСчетчикиИтого.Счетчик
	//|			И ВТ_ПриоритетОднотарифный.Приоритет = ВТ_ВсеСчетчикиИтого.Приоритет
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ВсеСчетчикиИтого.Объект КАК Объект,
	//|	ВТ_ВсеСчетчикиИтого.Услуга КАК Услуга,
	//|	ВТ_ВсеСчетчикиИтого.Счетчик КАК Счетчик,
	//|	ВТ_ВсеСчетчикиИтого.Приоритет КАК Приоритет,
	//|	ВТ_ВсеСчетчикиИтого.ВидПУ КАК ВидПУ,
	//|	ВТ_ВсеСчетчикиИтого.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	//|	ВТ_ВсеСчетчикиИтого.НомерЛС КАК НомерЛС,
	//|	ВТ_ВсеСчетчикиИтого.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	//|	ВТ_ВсеСчетчикиИтого.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	//|	ВТ_ВсеСчетчикиИтого.ДатаУстановки КАК ДатаУстановки,
	//|	ВТ_ВсеСчетчикиИтого.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	//|	ВТ_ВсеСчетчикиИтого.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	//|	ВТ_ВсеСчетчикиИтого.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	//|	ВТ_ВсеСчетчикиИтого.ПоследниеПоказания КАК ПоследниеПоказания
	//|ПОМЕСТИТЬ ВТ_ИтогМноготарифные
	//|ИЗ
	//|	ВТ_ВсеСчетчикиИтого КАК ВТ_ВсеСчетчикиИтого
	//|ГДЕ
	//|	ВТ_ВсеСчетчикиИтого.Многотарифный
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ИтогОднотарифные.Объект КАК Объект,
	//|	ВТ_ИтогОднотарифные.Услуга КАК Услуга,
	//|	ВТ_ИтогОднотарифные.Счетчик КАК Счетчик,
	//|	ВТ_ИтогОднотарифные.ВидПУ КАК ВидПУ,
	//|	ВТ_ИтогОднотарифные.УникальныйНомерКомнаты КАК УникальныйНомерКомнаты,
	//|	ВТ_ИтогОднотарифные.НомерЛС КАК НомерЛС,
	//|	ВТ_ИтогОднотарифные.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	//|	ВТ_ИтогОднотарифные.ВидПУПоКоличествуТарифов КАК ВидПУПоКоличествуТарифов,
	//|	ВТ_ИтогОднотарифные.ДатаУстановки КАК ДатаУстановки,
	//|	ВТ_ИтогОднотарифные.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	//|	ВТ_ИтогОднотарифные.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	//|	ВТ_ИтогОднотарифные.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	//|	ВТ_ИтогОднотарифные.ПоследниеПоказания КАК ПоследниеПоказания
	//|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	//|ИЗ
	//|	ВТ_ИтогОднотарифные КАК ВТ_ИтогОднотарифные
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ИтогМноготарифные.Объект,
	//|	ВТ_ИтогМноготарифные.Услуга,
	//|	ВТ_ИтогМноготарифные.Счетчик,
	//|	ВТ_ИтогМноготарифные.ВидПУ,
	//|	ВТ_ИтогМноготарифные.УникальныйНомерКомнаты,
	//|	ВТ_ИтогМноготарифные.НомерЛС,
	//|	ВТ_ИтогМноготарифные.ГрафаОтчетаГЦЖС,
	//|	ВТ_ИтогМноготарифные.ВидПУПоКоличествуТарифов,
	//|	ВТ_ИтогМноготарифные.ДатаУстановки,
	//|	ВТ_ИтогМноготарифные.ДатаВводаВЭксплуатацию,
	//|	ВТ_ИтогМноготарифные.ДатаПоследнейПоверки,
	//|	ВТ_ИтогМноготарифные.ДатаСнятияПоказания,
	//|	ВТ_ИтогМноготарифные.ПоследниеПоказания
	//|ИЗ
	//|	ВТ_ИтогМноготарифные КАК ВТ_ИтогМноготарифные
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Счетчик
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ИтоговаяТаблица.Объект КАК Объект,
	//|	ВТ_ИтоговаяТаблица.НомерЛС КАК НомерЛС,
	//|	ВТ_ИтоговаяТаблица.Услуга КАК Услуга,
	//|	ВТ_ИтоговаяТаблица.Счетчик КАК Счетчик,
	//|	ВТ_ИтоговаяТаблица.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС,
	//|	ВТ_ИтоговаяТаблица.ПоследниеПоказания КАК ПоследниеПоказания,
	//|	ВТ_ИтоговаяТаблица.ДатаСнятияПоказания КАК ДатаСнятияПоказания,
	//|	бит_Счетчики.Наименование КАК Наименование
	//|ИЗ
	//|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Счетчики КАК бит_Счетчики
	//|		ПО ВТ_ИтоговаяТаблица.Счетчик = бит_Счетчики.Ссылка";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	// Создание ОбъектаXDTO с типом Счетчик.
	//	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "Счетчик");
	//	СчетчикXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	//	
	//	СчетчикXDTO.Идентификатор			= Строка(Выборка.Счетчик.УникальныйИдентификатор());
	//	СчетчикXDTO.Название				= Выборка.Наименование;
	//	СчетчикXDTO.ИдентификаторВладельца	= Строка(Выборка.Объект.УникальныйИдентификатор());
	//	СчетчикXDTO.ТипУслуги				= Строка(Выборка.ГрафаОтчетаГЦЖС);
	//	СчетчикXDTO.ДатаСнятияПоказания		= Формат(Выборка.ДатаСнятияПоказания, "ДФ=дд.ММ.гггг");
	//	СчетчикXDTO.ПоказанияТ1				= Выборка.БазовоеПоказаниеТ1;
	//	СчетчикXDTO.ПоказанияТ2				= Выборка.БазовоеПоказаниеТ2;
	//	СчетчикXDTO.ПоказанияТ3				= Выборка.БазовоеПоказаниеТ3;
	//	
	//	СписокСчетчиковXDTO.Счетчик.Добавить(СчетчикXDTO);
	//	
	//КонецЦикла;
	
	ЗаписатьФайлВыгрузки(СписокСчетчиковXDTO, ПараметрыОбмена, "counters.xml");
	
КонецПроцедуры

Процедура ВыгрузитьОперацииПоЛС(ПараметрыОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.ДатаНачалаПериода)
		И ЗначениеЗаполнено(ПараметрыОбмена.ДатаОкончанияПериода) Тогда
		Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПараметрыОбмена.ДатаНачалаПериода));
		Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПараметрыОбмена.ДатаОкончанияПериода));
	Иначе
		ПериодФормирования = ТекущаяДата();
		Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПериодФормирования));
		Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПериодФормирования));
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	//|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	//|	бит_ЛицевыеСчета.Здание КАК Здание,
	//|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	//|	ЕСТЬNULL(бит_Квартиры.Наименование, """") КАК НомерКвартиры
	//|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	//|ИЗ
	//|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	//|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	//|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	//|ГДЕ
	//|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	//|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	//|	И НЕ бит_СписокЗданий.ПометкаУдаления
	//|	И (&НеПроверятьЛС
	//|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	//|	И (&НеПроверятьОрганизации
	//|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	//|	И (&НеПроверятьУлицы
	//|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	//|	И (&НеПроверятьЗдания
	//|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ЛицевойСчет
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	//|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК УслугаЖКХ
	//|ПОМЕСТИТЬ ВТ_СведенияПоУслугам
	//|ИЗ
	//|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	//|			&КонецПериода,
	//|			ЛицевойСчет В
	//|				(ВЫБРАТЬ
	//|					ВТ_ЛицевыеСчета.ЛицевойСчет
	//|				ИЗ
	//|					ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	//|ГДЕ
	//|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	//|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ЛицевойСчет,
	//|	УслугаЖКХ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	//|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	//|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор,
	//|	бит_НачисленияПоУслугамЖКХОбороты.Период КАК Период,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	//|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаНачислений,
	//|	СУММА(ВЫБОР
	//|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	//|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаОплаты
	//|ПОМЕСТИТЬ ВТ_Обороты
	//|ИЗ
	//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	//|			&НачалоПериода,
	//|			&КонецПериода,
	//|			Регистратор,
	//|			(ЛицевойСчет, УслугаЖКХ) В
	//|				(ВЫБРАТЬ
	//|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	//|					ВТ_СведенияПоУслугам.УслугаЖКХ
	//|				ИЗ
	//|					ВТ_СведенияПоУслугам)) КАК бит_НачисленияПоУслугамЖКХОбороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	//|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	//|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор,
	//|	бит_НачисленияПоУслугамЖКХОбороты.Период
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Обороты.ЛицевойСчет КАК ЛицевойСчет,
	//|	ВТ_Обороты.УслугаЖКХ КАК УслугаЖКХ,
	//|	ВТ_Обороты.Регистратор КАК Регистратор,
	//|	ВТ_Обороты.Период КАК Период,
	//|	СУММА(ВТ_Обороты.СуммаНачислений + ВТ_Обороты.СуммаОплаты) КАК Сумма
	//|ПОМЕСТИТЬ ВТ_ГрОбороты
	//|ИЗ
	//|	ВТ_Обороты КАК ВТ_Обороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Обороты.ЛицевойСчет,
	//|	ВТ_Обороты.УслугаЖКХ,
	//|	ВТ_Обороты.Регистратор,
	//|	ВТ_Обороты.Период
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ВТ_Обороты.СуммаНачислений + ВТ_Обороты.СуммаОплаты) <> 0
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВТ_ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	//|	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	//|	ВТ_ГрОбороты.УслугаЖКХ КАК УслугаЖКХ,
	//|	ВТ_ГрОбороты.Регистратор КАК Регистратор,
	//|	ВТ_ГрОбороты.Период КАК Период,
	//|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	//|	ВТ_ЛицевыеСчета.Квартира КАК Квартира,
	//|	ВТ_ЛицевыеСчета.НомерКвартиры КАК НомерКвартиры,
	//|	СУММА(ВТ_ГрОбороты.Сумма) КАК Сумма
	//|ИЗ
	//|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрОбороты КАК ВТ_ГрОбороты
	//|		ПО ВТ_ЛицевыеСчета.ЛицевойСчет = ВТ_ГрОбороты.ЛицевойСчет
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ЛицевыеСчета.ЛицевойСчет,
	//|	ВТ_ЛицевыеСчета.НомерЛС,
	//|	ВТ_ЛицевыеСчета.Здание,
	//|	ВТ_ЛицевыеСчета.Квартира,
	//|	ВТ_ЛицевыеСчета.НомерКвартиры,
	//|	ВТ_ГрОбороты.Регистратор,
	//|	ВТ_ГрОбороты.Период,
	//|	ВТ_ГрОбороты.УслугаЖКХ";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//// Создание ОбъектаXDTO с типом СписокОперацийПоЛС.
	//ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокОперацийПоЛС");
	//СписокОперацийПоЛСXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	//
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	// Создание ОбъектаXDTO с типом ОперацияПоЛС.
	//	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "ОперацияПоЛС");
	//	ОперацияПоЛСXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	//	
	//	ОперацияПоЛСXDTO.Идентификатор			= Строка(Выборка.ЛицевойСчет.УникальныйИдентификатор());
	//	ОперацияПоЛСXDTO.ИдентификаторКвартиры	= ?(ЗначениеЗаполнено(Выборка.Квартира), Строка(Выборка.Квартира.УникальныйИдентификатор()), "");
	//	ОперацияПоЛСXDTO.ИдентификаторЗдания	= ?(ЗначениеЗаполнено(Выборка.Здание), Строка(Выборка.Здание.УникальныйИдентификатор()), "");
	//	ОперацияПоЛСXDTO.ИдентификаторУслуги	= ?(ЗначениеЗаполнено(Выборка.УслугаЖКХ), Строка(Выборка.УслугаЖКХ.УникальныйИдентификатор()), "");
	//	ОперацияПоЛСXDTO.ИдентификаторДокумента	= ?(ЗначениеЗаполнено(Выборка.Регистратор), Строка(Выборка.Регистратор.УникальныйИдентификатор()), "");
	//	ОперацияПоЛСXDTO.Период					= Выборка.Период;
	//	ОперацияПоЛСXDTO.Номер					= Выборка.НомерЛС;
	//	ОперацияПоЛСXDTO.НомерКвартиры			= Выборка.НомерКвартиры;
	//	ОперацияПоЛСXDTO.ТипОперации			= ?(Выборка.Сумма < 0, "out", "in");
	//	ОперацияПоЛСXDTO.Сумма					= Макс(Выборка.Сумма, -Выборка.Сумма); // По модулю.
	//	
	//	СписокОперацийПоЛСXDTO.ОперацияПоЛС.Добавить(ОперацияПоЛСXDTO);
	//	
	//КонецЦикла;
	
		Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	ЕСТЬNULL(бит_Квартиры.Наименование, """") КАК НомерКвартиры
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК УслугаЖКХ
	|ПОМЕСТИТЬ ВТ_СведенияПоУслугам
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор,
	|	бит_НачисленияПоУслугамЖКХОбороты.Период КАК Период,
	|	СУММА(бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХОбороты.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Период,
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ
	|					ВТ_СведенияПоУслугам.ЛицевойСчет,
	|					ВТ_СведенияПоУслугам.УслугаЖКХ
	|				ИЗ
	|					ВТ_СведенияПоУслугам)) КАК бит_НачислениеПениПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обороты.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Обороты.Регистратор КАК Регистратор,
	|	ВТ_Обороты.Период КАК Период,
	|	СУММА(ВТ_Обороты.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ГрОбороты
	|ИЗ
	|	ВТ_Обороты КАК ВТ_Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обороты.ЛицевойСчет,
	|	ВТ_Обороты.Регистратор,
	|	ВТ_Обороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС КАК НомерЛС,
	|	ВТ_ГрОбороты.Регистратор КАК Регистратор,
	|	ВТ_ГрОбороты.Период КАК Период,
	|	ВТ_ЛицевыеСчета.Здание КАК Здание,
	|	ВТ_ЛицевыеСчета.Квартира КАК Квартира,
	|	ВТ_ЛицевыеСчета.НомерКвартиры КАК НомерКвартиры,
	|	СУММА(ВТ_ГрОбороты.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрОбороты КАК ВТ_ГрОбороты
	|		ПО ВТ_ЛицевыеСчета.ЛицевойСчет = ВТ_ГрОбороты.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЛицевыеСчета.ЛицевойСчет,
	|	ВТ_ЛицевыеСчета.НомерЛС,
	|	ВТ_ЛицевыеСчета.Здание,
	|	ВТ_ЛицевыеСчета.Квартира,
	|	ВТ_ЛицевыеСчета.НомерКвартиры,
	|	ВТ_ГрОбороты.Регистратор,
	|	ВТ_ГрОбороты.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Создание ОбъектаXDTO с типом СписокОперацийПоЛС.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокОперацийПоЛС");
	СписокОперацийПоЛСXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	
	Пока Выборка.Следующий() Цикл
		
		// Создание ОбъектаXDTO с типом ОперацияПоЛС.
		ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "ОперацияПоЛС");
		ОперацияПоЛСXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
		
		ОперацияПоЛСXDTO.Идентификатор			= Строка(Выборка.ЛицевойСчет.УникальныйИдентификатор());
		ОперацияПоЛСXDTO.ИдентификаторКвартиры	= ?(ЗначениеЗаполнено(Выборка.Квартира), Строка(Выборка.Квартира.УникальныйИдентификатор()), "");
		ОперацияПоЛСXDTO.ИдентификаторЗдания	= ?(ЗначениеЗаполнено(Выборка.Здание), Строка(Выборка.Здание.УникальныйИдентификатор()), "");
		ОперацияПоЛСXDTO.ИдентификаторДокумента	= ?(ЗначениеЗаполнено(Выборка.Регистратор), Строка(Выборка.Регистратор.УникальныйИдентификатор()), "");
		ОперацияПоЛСXDTO.Период					= Выборка.Период;
		ОперацияПоЛСXDTO.Номер					= Выборка.НомерЛС;
		ОперацияПоЛСXDTO.НомерКвартиры			= Выборка.НомерКвартиры;
		ОперацияПоЛСXDTO.ТипОперации			= ?(Выборка.Сумма < 0, "out", "in");
		ОперацияПоЛСXDTO.Сумма					= Макс(Выборка.Сумма, -Выборка.Сумма); // По модулю.
		
		СписокОперацийПоЛСXDTO.ОперацияПоЛС.Добавить(ОперацияПоЛСXDTO);
		
	КонецЦикла;

	
	ЗаписатьФайлВыгрузки(СписокОперацийПоЛСXDTO, ПараметрыОбмена, "transactions.xml");
	
КонецПроцедуры

//23.05.2019
Процедура ВыгрузитьЕПД(ПараметрыОбмена, Пеня = ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	, ПараметрыОбмена.Организация);
	Запрос.УстановитьПараметр("СписокУлиц"	, ПараметрыОбмена.СписокУлиц);
	Запрос.УстановитьПараметр("СписокЗданий", ПараметрыОбмена.СписокЗданий);
	Запрос.УстановитьПараметр("СписокЛС"	, ПараметрыОбмена.СписокЛС);
	
	
	если ЗначениеЗаполнено(ПараметрыОбмена.ДатаНачалаПериода) = ложь тогда
	  ПараметрыОбмена.ДатаНачалаПериода = НачалоМесяца(ТекущаяДата());	
    конецесли;
  
	если ЗначениеЗаполнено(ПараметрыОбмена.ДатаОкончанияПериода) = ложь тогда
	  ПараметрыОбмена.ДатаОкончанияПериода = КонецМесяца(ТекущаяДата());	
	конецесли;	
	
	ПериодФормирования = ПараметрыОбмена.ДатаОкончанияПериода;//ТекущаяДата();
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецМесяца(ПериодФормирования));
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.Организация) Тогда
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьОрганизации", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокУлиц)
		И ПараметрыОбмена.СписокУлиц.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьУлицы", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЗданий) 
		И ПараметрыОбмена.СписокЗданий.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЗдания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СписокЛС) 
		И ПараметрыОбмена.СписокЛС.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеПроверятьЛС", Ложь);
	Иначе
		Запрос.УстановитьПараметр("НеПроверятьЛС", Истина);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	|		ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И НЕ бит_СписокЗданий.ПометкаУдаления
	|	И (&НеПроверятьЛС
	|			ИЛИ бит_ЛицевыеСчета.Ссылка В (&СписокЛС))
	|	И (&НеПроверятьОрганизации
	|			ИЛИ бит_ЛицевыеСчета.Организация В (&Организация))
	|	И (&НеПроверятьУлицы
	|			ИЛИ бит_СписокЗданий.Улица В (&СписокУлиц))
	|	И (&НеПроверятьЗдания
	|			ИЛИ бит_ЛицевыеСчета.Здание В (&СписокЗданий))";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// Подготовка обработки печати.
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	ОбработкаОбъект.СписокЛС.Загрузить(Результат); // Фильтрация по ЛС.
	
	//23.05.2019
	если Пеня = ложь тогда
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32;
    иначе
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокументПеня;
	конецесли; 
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = ПараметрыОбмена.Организация;
	ОбработкаОбъект.РС                    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОбмена.Организация, "ОсновнойБанковскийСчет");
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	ОбработкаОбъект.НеПечататьУслугиБезНачислений = Истина;
	ОбработкаОбъект.Период = КонецМесяца(ПериодФормирования);
	ОбработкаОбъект.ОбновитьНастройкиЖКХ();
	ОбработкаОбъект.ОбновитьКэшОрганизации();
	ОбработкаОбъект.ОбновитьКэшПолучателяПлатежа();
	ОбработкаОбъект.ПолучитьНастройкуМакета();
	
	// Настроййки таб. док. поумолчанию.
	ТабличнйДокумент  = Новый ТабличныйДокумент;
	ТабличнйДокумент.АвтоМасштаб = Истина;
	ТабличнйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	если Пеня = ложь тогда
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокумент761_32;
    иначе
	 ОбработкаОбъект.МакетКв               = Справочники.бит_ВариантыСчетовИзвещений.ЕдиныйПлатежныйДокументПеня;
	конецесли;         
	
	// Формирование данных для макета.
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати(Истина);
	
	// Создание ОбъектаXDTO с типом СписокЕПД.
	ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокЕПД");
	СписокЕПДXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
	
	Для Каждого Стр Из Результат Цикл
		
		Отбор = Новый Структура;
		//Отбор.Вставить("ВладелецЛС", Стр.ЛицевойСчет); // Без иерархии.
		Отбор.Вставить("ЛицевойСчет", Стр.ЛицевойСчет);
		ПоискЛС = ТаблицаДанных.НайтиСтроки(Отбор);
		
		Если ПоискЛС.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из ПоискЛС Цикл
			
			ТабличнйДокумент.Очистить();
			//23.05.2019
			ОбработкаОбъект.ВывестиНаПечатьКвитанцию(ТабличнйДокумент, СтрокаТаблицы, Пеня);
			
			ИмяВрФайла = ПолучитьИмяВременногоФайла("pdf");
			ТабличнйДокумент.Записать(ИмяВрФайла,ТипФайлаТабличногоДокумента.PDF);
		    //23.05.2019
//			если ПараметрыОбмена.ВыгружатьОтдельнымиФайлами = истина тогда
			если ПараметрыОбмена.ВидТранспорта = 0 тогда
			 КопироватьФайл(ИмяВрФайла, ПараметрыОбмена.КаталогВыгрузки + "\\Квитанция_" + строка(СтрокаТаблицы.ЛицевойСчет) + ".pdf");
			конецесли; 
			ДД = Новый ДвоичныеДанные(ИмяВрФайла);
			
			// Создание ОбъектаXDTO с типом ЕПД.
			ТипXDTO = ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "ЕПД");
			ЕПДXDTO = ФабрикаXDTO.Создать(ТипXDTO); 
			
			ЕПДXDTO.Номер			= СтрокаТаблицы.Значение.СтруктураДанных.ЗначениеШтрихкода;
			ЕПДXDTO.ИдентификаторЛС	= ?(ЗначениеЗаполнено(Стр.ЛицевойСчет), Строка(Стр.ЛицевойСчет.УникальныйИдентификатор()), "");
			ЕПДXDTO.Период			= КонецМесяца(ПериодФормирования);
			Попытка
				ЕПДXDTO.Сумма		= СтрокаТаблицы.Значение.СтруктураДанных.КОплате + СтрокаТаблицы.Значение.СтруктураДанных.ПроцентОтОплаты;
				
				//3.06.2019
				если ПараметрыОбмена.УчитыватьПеня = Истина тогда
					ЕПДXDTO.Сумма  = ЕПДXDTO.Сумма + СтрокаТаблицы.Значение.СтруктураДанных.ИтогПени; 
				конецесли;

			Исключение
				ЕПДXDTO.Сумма		= 0;
			КонецПопытки;
			ЕПДXDTO.Вложение		= Base64Строка(ДД);
			
			СписокЕПДXDTO.ЕПД.Добавить(ЕПДXDTO);
			
			Попытка
				УдалитьФайлы(ИмяВрФайла);
			Исключение
			КонецПопытки;
			
		КонецЦикла;	

	КонецЦикла;

	ЗаписатьФайлВыгрузки(СписокЕПДXDTO, ПараметрыОбмена, "paydocs.xml");
	
КонецПроцедуры

Процедура Выгрузить(ПараметрыОбмена) Экспорт
	
	ВыгрузитьЗдания(ПараметрыОбмена);
	ВыгрузитьКвартиры(ПараметрыОбмена);
	ВыгрузитьЛицевыеСчета(ПараметрыОбмена);
	ВыгрузитьУслуги(ПараметрыОбмена);
	ВыгрузитьУслугиПОЛС(ПараметрыОбмена);
	ВыгрузитьСчетчики(ПараметрыОбмена);
	ВыгрузитьОперацииПоЛС(ПараметрыОбмена);
	ВыгрузитьЕПД(ПараметрыОбмена);
	
КонецПроцедуры

Процедура ЗагрузитьПоказанияСчетчиков(ПараметрыОбмена) Экспорт
	
	 Если ПараметрыОбмена.ВидТранспорта = 0 Тогда
		 ЗагрузитьПоказанияСчетчиковИзКаталога(ПараметрыОбмена);
	 ИначеЕсли	 ПараметрыОбмена.ВидТранспорта = 1 Тогда
		 ЗагрузитьПоказанияСчетчиковСFTP(ПараметрыОбмена);
	 Иначе
		 Возврат; // Интеграция по http. 
	 КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьПоказанияСчетчиковИзКаталога(ПараметрыОбмена)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыОбмена.КаталогВыгрузки) Тогда
		Возврат; 
	КонецЕсли;
	
	ИмяФайла = ПараметрыОбмена.КаталогВыгрузки + ПолучитьРазделительПути() + ПараметрыОбмена.ИмяФайлаПоказаний;
	
	Ошибка = Ложь;
	ЧтениеПоказанийСчетчиков(ПараметрыОбмена, ИмяФайла, Ошибка);
	
	Если Не Ошибка Тогда
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
			ТекстОшибки = НСтр("ru = 'Не удалось удалить файл обмена: '");
			ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("Обмен с сайтом, ошибка удаления прочитанного файла.", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьПоказанияСчетчиковСFTP(ПараметрыОбмена)
	
	// Подключение к ftp.
	ПараметрыСоединения 					= FTPНастройкиСоединения(30);
	ПараметрыСоединения.Сервер				= ПараметрыОбмена.АдресFTP;
	ПараметрыСоединения.Порт				= ПараметрыОбмена.ПортFTP;
	ПараметрыСоединения.ИмяПользователя		= ПараметрыОбмена.ЛогинFTP;
	ПараметрыСоединения.ПарольПользователя	= ПараметрыОбмена.ПарольFTP;
	ПараметрыСоединения.ПассивноеСоединение  = Истина;
	Если ПараметрыОбмена.ЗащищенноеСоединение Тогда
		ПараметрыСоединения.ЗащищенноеСоединение= Новый ЗащищенноеСоединениеOpenSSL;
	Иначе
		ПараметрыСоединения.ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Попытка
		FTPСоединение = ОбменДаннымиСервер.FTPСоединение(ПараметрыСоединения);
		Если СтрДлина(ПараметрыОбмена.КаталогFTP) > 1 Тогда
			ИмяПапки = ПолучитьИмяПапки(ПараметрыОбмена.КаталогFTP);
			Если НЕ ОбменДаннымиСервер.FTPКаталогСуществует(ПараметрыОбмена.КаталогFTP, ИмяПапки, FTPСоединение) Тогда
				ТекстОшибки	= НСтр("ru = 'Соединение с свервером установлено, но каталог не найден!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтрШаблон(НСтр("ru = '%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	FTPСоединение.УстановитьТекущийКаталог(ПараметрыОбмена.КаталогFTP);
	FTPСоединение.Получить(ПараметрыОбмена.ИмяФайлаПоказаний, ВременныйФайл);
	
	Ошибка = Ложь;
	ЧтениеПоказанийСчетчиков(ПараметрыОбмена, ВременныйФайл, Ошибка);
	
	Если Не Ошибка Тогда
		Попытка
			УдалитьФайлы(ВременныйФайл);
			FTPСоединение.Удалить(ПараметрыОбмена.ИмяФайлаПоказаний);
		Исключение
			ТекстОшибки = НСтр("ru = 'Не удалось удалить файл обмена: '");
			ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("Обмен с сайтом, ошибка удаления прочитанного файла.", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЧтениеПоказанийСчетчиков(ПараметрыОбмена, ИмяФайла, Ошибка)
	
	ЧтениеXML = Новый ЧтениеXML;
	//21.11.2018
	попытка
	 ЧтениеXML.ОткрытьФайл(ИмяФайла,,, ПараметрыОбмена.Кодировка);
    исключение
	 Сообщить("Невозможно открыть файл " + строка(ИмяФайла));
	 возврат;
	конецпопытки; 

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФабрикаXDTO.Тип("http://bit-jkh.ru/functional/" , "СписокСчетчиков"));
	ЧтениеXML.Закрыть();
	
	Если ТипЗнч(ОбъектXDTO.Счетчик) = Тип("СписокXDTO") Тогда
		
		ТаблицаСчетчиков = Новый ТаблицаЗначений;
		ТаблицаСчетчиков.Колонки.Добавить("Счетчик"				, Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
		ТаблицаСчетчиков.Колонки.Добавить("Владелец"			, Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
		ТаблицаСчетчиков.Колонки.Добавить("Услуга"				, Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
		ТаблицаСчетчиков.Колонки.Добавить("Показания"			, ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	
		Для Каждого Счетчик Из ОбъектXDTO.Счетчик Цикл
			
			НСтрСч =ТаблицаСчетчиков.Добавить();	
			НСтрСч.Счетчик				= Справочники.бит_Счетчики.ПолучитьСсылку(Новый УникальныйИдентификатор(Счетчик.Идентификатор));
			НСтрСч.Владелец				= Справочники.бит_ЛицевыеСчета.ПолучитьСсылку(Новый УникальныйИдентификатор(Счетчик.ИдентификаторВладельца));
			НСтрСч.Услуга				= Справочники.бит_УслугиЖКХ.ПолучитьСсылку(Новый УникальныйИдентификатор(Счетчик.ИдентификаторУслуги));
			НСтрСч.Показания			= Счетчик.Показания;
		 
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСчетчиков", ТаблицаСчетчиков);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСчетчиков.Счетчик КАК Счетчик,
	|	ТаблицаСчетчиков.Владелец КАК Владелец,
	|	ТаблицаСчетчиков.Услуга КАК Услуга,
	|	ТаблицаСчетчиков.Показания КАК Показания
	|ПОМЕСТИТЬ ВТ_Счетчики
	|ИЗ
	|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Счетчики.Счетчик КАК Счетчик,
	|	ВТ_Счетчики.Владелец КАК Владелец,
	|	ВТ_Счетчики.Услуга КАК Услуга,
	|	ВТ_Счетчики.Показания КАК Показания,
	|	бит_ЛицевыеСчета.Здание.Улица КАК Улица,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета
	|ИЗ
	|	ВТ_Счетчики КАК ВТ_Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ПО ВТ_Счетчики.Владелец = бит_ЛицевыеСчета.Ссылка
	|ИТОГИ ПО
	|	УлицаЛицевогоСчета";
	
	ВыборкаУлиц = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаУлиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	Пока ВыборкаУлиц.Следующий() Цикл
		
		ПревышениеРазрядности = Ложь;
		
		ДокументВводПоказаний					= Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
		ДокументВводПоказаний.Дата				= ТекДата;
		ДокументВводПоказаний.Организация		= ПараметрыОбмена.Организация;
		ДокументВводПоказаний.ВидОперации		= Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
		ДокументВводПоказаний.ТипСчетчика		= Перечисления.бит_ТипСчетчика.Индивидуальный;
		ДокументВводПоказаний.ПоказанияНаселения= Истина;
		ДокументВводПоказаний.Улица				= ВыборкаУлиц.УлицаЛицевогоСчета;
		ДокументВводПоказаний.Ответственный		= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		ДокументВводПоказаний.Комментарий		= "Документ создан автоматически на основании данных с сайта.";
		ДокументВводПоказаний.ПоказанияПоСчетчикам.Очистить();
		ДокументВводПоказаний.ЗаполнитьТаблицуПоказаний();
		
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаЛС = ВыборкаУлиц.Выбрать();
		Пока ВыборкаЛС.Следующий() Цикл
			
			ОтборСчетчиков	= Новый Структура("ЛицевойСчет, Счетчик, Услуга", ВыборкаЛС.Владелец, ВыборкаЛС.Счетчик, ВыборкаЛС.Услуга); 
			МассивСчетчик	= ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(ОтборСчетчиков);
			
			Если МассивСчетчик.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Элт Из МассивСчетчик Цикл
				
				Элт.ТекущиеПоказания = ВыборкаЛС.Показания;
				
				// Проверка перехода через 0.
				Если Элт.ТекущиеПоказания < Элт.ПредыдущиеПоказания Тогда
					Разность = Элт.Разрядность - Элт.ПредыдущиеПоказания + 1 + Элт.ТекущиеПоказания;
				Иначе
					Разность = Элт.ТекущиеПоказания - Элт.ПредыдущиеПоказания;
				КонецЕсли;	
				
				Элт.КоличествоЕдиницПоСчетчику	= Разность;
				
				Если Элт.ТекущиеПоказания > Элт.Разрядность Тогда
					ПревышениеРазрядности = Истина;	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла; // ВыборкаЛС.
		
		// Удаление счетчиков без показаний жильцов.
		ОтборБезПоказаний	= Новый Структура("ТекущиеПоказания",0);
		СтрокиБезПоказаний	= ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(ОтборБезПоказаний);

		Если СтрокиБезПоказаний.Количество() > 0 Тогда
			Для Каждого Элт Из СтрокиБезПоказаний Цикл
				ДокументВводПоказаний.ПоказанияПоСчетчикам.Удалить(Элт);
			КонецЦикла;
		КонецЕсли;
		
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() = 0 Тогда
			 Продолжить;
		КонецЕсли;
		
		Попытка
			Если ПревышениеРазрядности Тогда
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Запись);
			Иначе
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Ошибка = Ложь;
		Исключение
			Ошибка = Истина;
		КонецПопытки;
		
	КонецЦикла; // ВыборкаУлиц. 
	
КонецПроцедуры

Функция ПолучитьПараметрыОбмена(Ссылка) Экспорт
	
	СтруктуруПараметровОбмена = ПолучитьСтруктуруПараметровОбмена();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_НастройкиОбменаССайтом.Организация КАК Организация,
	|	бит_НастройкиОбменаССайтом.Кодировка КАК Кодировка,
	|	бит_НастройкиОбменаССайтом.КаталогВыгрузки КАК КаталогВыгрузки,
	|	бит_НастройкиОбменаССайтом.АдресСайта КАК АдресСайта,
	|	бит_НастройкиОбменаССайтом.ЛогинСайт КАК ЛогинСайт,
	|	бит_НастройкиОбменаССайтом.ПарольСайт КАК ПарольСайт,
	|	бит_НастройкиОбменаССайтом.АдресFTP КАК АдресFTP,
	|	бит_НастройкиОбменаССайтом.ПортFTP КАК ПортFTP,
	|	бит_НастройкиОбменаССайтом.КаталогFTP КАК КаталогFTP,
	|	бит_НастройкиОбменаССайтом.ЛогинFTP КАК ЛогинFTP,
	|	бит_НастройкиОбменаССайтом.ПарольFTP КАК ПарольFTP,
	|	бит_НастройкиОбменаССайтом.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	|	бит_НастройкиОбменаССайтом.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	бит_НастройкиОбменаССайтом.ДатаОкончанияПериода КАК ДатаОкончанияПериода,
	|	бит_НастройкиОбменаССайтом.ВидТранспорта КАК ВидТранспорта,
	|	бит_НастройкиОбменаССайтом.ИмяФайлаПоказаний КАК ИмяФайлаПоказаний
	|ИЗ
	|	Справочник.бит_НастройкиОбменаССайтом КАК бит_НастройкиОбменаССайтом
	|ГДЕ
	|	НЕ бит_НастройкиОбменаССайтом.ПометкаУдаления
	|	И бит_НастройкиОбменаССайтом.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НастройкиОбменаССайтомСписокУлиц.Улица КАК Улица
	|ИЗ
	|	Справочник.бит_НастройкиОбменаССайтом.СписокУлиц КАК бит_НастройкиОбменаССайтомСписокУлиц
	|ГДЕ
	|	бит_НастройкиОбменаССайтомСписокУлиц.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НастройкиОбменаССайтомСписокЗданий.Здание КАК Здание
	|ИЗ
	|	Справочник.бит_НастройкиОбменаССайтом.СписокЗданий КАК бит_НастройкиОбменаССайтомСписокЗданий
	|ГДЕ
	|	бит_НастройкиОбменаССайтомСписокЗданий.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НастройкиОбменаССайтомСписокЛС.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_НастройкиОбменаССайтом.СписокЛС КАК бит_НастройкиОбменаССайтомСписокЛС
	|ГДЕ
	|	бит_НастройкиОбменаССайтомСписокЛС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НастройкиОбменаССайтомСписокУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.бит_НастройкиОбменаССайтом.СписокУслуг КАК бит_НастройкиОбменаССайтомСписокУслуг
	|ГДЕ
	|	бит_НастройкиОбменаССайтомСписокУслуг.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктуруПараметровОбмена, Выборка);	
	КонецЕсли;
	
	СтруктуруПараметровОбмена.КаталогFTP = ПолучитьИмяКаталога(Выборка.КаталогFTP);
	
	Результат = РезультатЗапроса[1].Выгрузить();
	СтруктуруПараметровОбмена.СписокУлиц = Результат.ВыгрузитьКолонку("Улица");	
	
	Результат = РезультатЗапроса[2].Выгрузить();
	СтруктуруПараметровОбмена.СписокЗданий = Результат.ВыгрузитьКолонку("Здание");	
	
	Результат = РезультатЗапроса[3].Выгрузить();
	СтруктуруПараметровОбмена.СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");	
	
	Результат = РезультатЗапроса[4].Выгрузить();
	СтруктуруПараметровОбмена.СписокУслуг = Результат.ВыгрузитьКолонку("Услуга");	
	
    СтруктуруПараметровОбмена.ВыгружатьОтдельнымиФайлами = Ссылка.ВыгружатьОтдельнымиФайлами;
	СтруктуруПараметровОбмена.УчитыватьПеня =  Ссылка.УчитыватьПеня;
	
	Возврат СтруктуруПараметровОбмена;
	
 КонецФункции
 
Функция ПолучитьСтруктуруПараметровОбмена()
	 
	ПараметрыОбмена = Новый Структура();
	
	ПараметрыОбмена.Вставить("ДатаНачалаПериода"	, Неопределено);
	ПараметрыОбмена.Вставить("ДатаОкончанияПериода"	, Неопределено);
	ПараметрыОбмена.Вставить("Организация"			, Неопределено);
	ПараметрыОбмена.Вставить("Кодировка"			, "windows-1251");
	ПараметрыОбмена.Вставить("ВидТранспорта"		, Неопределено);
	ПараметрыОбмена.Вставить("КаталогВыгрузки"		, Неопределено);
	ПараметрыОбмена.Вставить("ИмяФайлаПоказаний"	, Неопределено);
	ПараметрыОбмена.Вставить("СписокУлиц"			, Неопределено);
	ПараметрыОбмена.Вставить("СписокЗданий"			, Неопределено);
	ПараметрыОбмена.Вставить("СписокЛС"				, Неопределено);
	ПараметрыОбмена.Вставить("СписокУслуг"			, Неопределено);
	
	ПараметрыОбмена.Вставить("АдресСайта"			, Неопределено);
	ПараметрыОбмена.Вставить("ЛогинСайт"			, Неопределено);
	ПараметрыОбмена.Вставить("ПарольСайт"			, Неопределено);
	
	ПараметрыОбмена.Вставить("АдресFTP"				, Неопределено);
	ПараметрыОбмена.Вставить("ПортFTP"				, Неопределено);
	ПараметрыОбмена.Вставить("КаталогFTP"			, Неопределено);
	ПараметрыОбмена.Вставить("ЛогинFTP"				, Неопределено);
	ПараметрыОбмена.Вставить("ПарольFTP"			, Неопределено);
	ПараметрыОбмена.Вставить("ЗащищенноеСоединение"	, Неопределено);
	
	ПараметрыОбмена.Вставить("УчитыватьПеня"    	, ложь);
	ПараметрыОбмена.Вставить("ВыгружатьОтдельнымиФайлами"	, ложь);
	
	Возврат ПараметрыОбмена;
	 
 КонецФункции
 
// Запись в XML файл.
 Процедура ЗаписатьФайлВыгрузки(ОбъектXDTO, ПараметрыОбмена, ИмяФайла)
	 
	 Если ПараметрыОбмена.ВидТранспорта = 0 Тогда
		 ЗаписатьФайлВКаталог(ОбъектXDTO, ПараметрыОбмена, ИмяФайла);
	 ИначеЕсли	 ПараметрыОбмена.ВидТранспорта = 1 Тогда
		 ЗаписатьФайлНаFTP(ОбъектXDTO, ПараметрыОбмена, ИмяФайла);
	 Иначе
		 Возврат; // Интеграция по http. 
	 КонецЕсли;
 
 КонецПроцедуры
 
 Процедура ЗаписатьФайлВКаталог(ОбъектXDTO, ПараметрыОбмена, ИмяФайла)
	 
	 Если НЕ ЗначениеЗаполнено(ПараметрыОбмена.КаталогВыгрузки) Тогда
		 Возврат; 
	 КонецЕсли;
	 
	 ИмяФайла = ПараметрыОбмена.КаталогВыгрузки + ПолучитьРазделительПути() + ИмяФайла;
	 
	 ИспользоватьОтступы= Истина;
	 СимволОтступа		= Символы.Таб;
	 
	 ЗаписьXML = Новый ЗаписьXML;
	 ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML(
								 ПараметрыОбмена.Кодировка,	// Кодировка (по-умолчанию "UTF-8").
								 "1.0",						// Версия XML (по-умолчанию "1.0").
								 ИспользоватьОтступы,		// Отступ.
								 ИспользоватьОтступы,		// Отступ атрибутов.
								 СимволОтступа); 			// Символы отступа.
	 ЗаписьXML.ОткрытьФайл(ИмяФайла, ПараметрыЗаписиXML);
	 ЗаписьXML.ЗаписатьОбъявлениеXML();
	 ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	 ЗаписьXML.Закрыть();
	 
 КонецПроцедуры
 
 Процедура ЗаписатьФайлНаFTP(ОбъектXDTO, ПараметрыОбмена, ИмяФайла)
	 
	// Запись временного файла.
	ИмяВрФайла = ПолучитьИмяВременногоФайла("xml");
	
	ИспользоватьОтступы= Истина;
	СимволОтступа		= Символы.Таб;
	
	ЗаписьXML = Новый ЗаписьXML;
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML(
	ПараметрыОбмена.Кодировка,	// Кодировка (по-умолчанию "UTF-8").
	"1.0",						// Версия XML (по-умолчанию "1.0").
	ИспользоватьОтступы,		// Отступ.
	ИспользоватьОтступы,		// Отступ атрибутов.
	СимволОтступа); 			// Символы отступа.
	ЗаписьXML.ОткрытьФайл(ИмяВрФайла, ПараметрыЗаписиXML);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	ЗаписьXML.Закрыть();
	
	НастройкиFTP = ОбменДаннымиСервер.FTPНастройкиСоединения(10);
	НастройкиFTP.Сервер               = ПараметрыОбмена.АдресFTP;
	НастройкиFTP.Порт                 = ПараметрыОбмена.ПортFTP;
	НастройкиFTP.ИмяПользователя      = ПараметрыОбмена.ЛогинFTP;
	НастройкиFTP.ПарольПользователя   = ПараметрыОбмена.ПарольFTP;
	НастройкиFTP.ПассивноеСоединение  = Истина;
	Если ПараметрыОбмена.ЗащищенноеСоединение Тогда
		НастройкиFTP.ЗащищенноеСоединение= Новый ЗащищенноеСоединениеOpenSSL;
	Иначе
		НастройкиFTP.ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Попытка
		FTPСоединение = ОбменДаннымиСервер.FTPСоединение(НастройкиFTP);
		Если СтрДлина(ПараметрыОбмена.КаталогFTP) > 1 Тогда
			ИмяПапки = ПолучитьИмяПапки(ПараметрыОбмена.КаталогFTP);
			Если НЕ ОбменДаннымиСервер.FTPКаталогСуществует(ПараметрыОбмена.КаталогFTP, ИмяПапки, FTPСоединение) Тогда
				ТекстОшибки	= НСтр("ru = 'Соединение с свервером установлено, но каталог не найден!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтрШаблон(НСтр("ru = '%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	FTPСоединение.УстановитьТекущийКаталог(ПараметрыОбмена.КаталогFTP);
	
	Попытка
		FTPСоединение.Записать(ИмяВрФайла, ИмяФайла);
	Исключение
		Возврат;	  
	КонецПопытки;
	 
 КонецПроцедуры
 
 Функция Абс(Знач ВхЧисло)
Возврат Макс(ВхЧисло, -ВхЧисло);
КонецФункции 

Функция FTPСоединение(Знач Настройки)
	
	Возврат Новый FTPСоединение(
		Настройки.Сервер,
		Настройки.Порт,
		Настройки.ИмяПользователя,
		Настройки.ПарольПользователя,
		Неопределено,
		Настройки.ПассивноеСоединение,
		Настройки.Таймаут,
		Настройки.ЗащищенноеСоединение);
	
КонецФункции

Функция FTPНастройкиСоединения(Знач Таймаут = 180)
	
	Результат = Новый Структура;
	Результат.Вставить("Сервер", "");
	Результат.Вставить("Порт", 21);
	Результат.Вставить("Прокси", Новый ИнтернетПрокси(Ложь));
	Результат.Вставить("ИмяПользователя", "");
	Результат.Вставить("ПарольПользователя", "");
	Результат.Вставить("ПассивноеСоединение", Ложь);
	Результат.Вставить("Таймаут", Таймаут);
	Результат.Вставить("ЗащищенноеСоединение", Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Подготовка пути FTP.
//
// Параметры:
//  Путь - Строка - путь для FTP сервера.
//
Процедура ПодготовитьПутьFTP(Путь) Экспорт
	
	Путь = СтрЗаменить(Путь, "\", "/");
	Если ЗначениеЗаполнено(Путь) Тогда
		Если НЕ Лев(Путь, 1) = "/" Тогда
			Путь = "/" + Путь;
		КонецЕсли;
		Если НЕ Прав(Путь, 1) = "/" Тогда
			Путь = Путь + "/";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИмяПапки(Знач Путь) Экспорт
	
	МассивИмен = СтрРазделить(Путь, "/", Ложь);
	Возврат МассивИмен[МассивИмен.ВГраница()];

КонецФункции

Функция ПолучитьИмяКаталога(Знач ИмяКаталога) Экспорт
	
	ИмяКаталога = СокрЛП(ИмяКаталога);
	
	Если НЕ ПустаяСтрока(ИмяКаталога) Тогда
		
		Если (Прав(ИмяКаталога, 1) = "\") ИЛИ (Прав(ИмяКаталога, 1) = "/") Тогда
			ИмяКаталога = Лев(ИмяКаталога, СтрДлина(ИмяКаталога) - 1);
		КонецЕсли;
		
		Возврат ИмяКаталога;
	Иначе
		Возврат ИмяКаталога;
	КонецЕсли;

КонецФункции