&НаКлиенте
Функция ОткрытьФайл()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Данные из файла";
	ДиалогВыбораФайла.Фильтр    = "dBase (*.dbf)|*.dbf|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".dbf" Тогда
			Возврат ДиалогВыбораФайла.ПолноеИмяФайла
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	Файл = ОткрытьФайл()	
КонецПроцедуры

&НаСервере
Функция ПрочитатьDBF(ИмяФайла)
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл не существует!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	XBase  = Новый XBase;
	XBase.Кодировка = КодировкаXBase.OEM;
	Попытка
		XBase.ОткрытьФайл(ИмяФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка открытия файла!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
    ОписаниеБулево = Новый ОписаниеТипов("Булево");
    ОписаниеДаты = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));

    ТаблицаЗначений = Новый ТаблицаЗначений;
    Для Каждого Поле из XBase.Поля Цикл
        Если Поле.Тип = "L" Тогда
            Тип = ОписаниеБулево;
        ИначеЕсли Поле.Тип = "D" Тогда
            Тип = ОписаниеДаты;
        ИначеЕсли (Поле.Тип = "N") ИЛИ (Поле.Тип = "F") Тогда
            Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Поле.Длина, Поле.Точность));
        Иначе
            Тип = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(Поле.Длина));
        КонецЕсли;
        ТаблицаЗначений.Колонки.Добавить(Поле.Имя, Тип);
    КонецЦикла;
	
	//Проверка файла
	РезультатПроверки = ПроверитьDBF(ТаблицаЗначений.Колонки);
	Если Не РезультатПроверки Тогда
		ТекстСообщения = НСтр("ru = 'Структура файла не соотвествует требованиям!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
	
    Если (ТаблицаЗначений.Колонки.Количество() <> 0) И (XBase.Первая()) Тогда
        Пока Истина Цикл
            СтрокаТаб = ТаблицаЗначений.Добавить();
            Для Каждого Поле из XBase.Поля Цикл
                СтрокаТаб[Поле.Имя] = СокрЛП(XBase[Поле.Имя]);
            КонецЦикла;
			Если Не XBase.Следующая() Тогда 
				Прервать; 
			КонецЕсли;
        КонецЦикла;
    КонецЕсли;
	
    XBase.ЗакрытьФайл();
	
	ВременноеХранилищеDBFФайл = ПоместитьВоВременноеХранилище(ТаблицаЗначений, Новый УникальныйИдентификатор());	
	
    Возврат Истина
		
КонецФункции

&НаСервере
Функция ПроверитьDBF(Колонки)
	
	Массив = Новый Массив;
	Массив.Добавить("LIC");
	Массив.Добавить("TARIF");
	Массив.Добавить("NORM");
	Массив.Добавить("SAL_K");
	Массив.Добавить("S_PENI");
	Массив.Добавить("PENI");
	Массив.Добавить("CH");
	Массив.Добавить("N_SCHET");
	Массив.Добавить("D_POV");
	Массив.Добавить("N_POK");
	
	Для Каждого Колонка из Массив Цикл
		
		Поиск = Колонки.Найти(Колонка);
		
		Если Поиск = Неопределено Тогда
			Возврат Ложь
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;     
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПолеДокументДанныеГорГаза(Коррекция = Ложь)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_ДанныеГорГаза.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.лб_ДанныеГорГаза КАК лб_ДанныеГорГаза
	               |ГДЕ
	               |	лб_ДанныеГорГаза.Дата Между &ДатаН И &ДатаК
	               |	И НЕ лб_ДанныеГорГаза.ПометкаУдаления
	               |	И лб_ДанныеГорГаза.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаК", КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаН", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Если Не Коррекция Тогда
			Объект.ДокументДанныеГоргаза = СоздатьПустойДокументДанныеГорГаза()
		Иначе
			ТекстСообщения = НСтр("ru = 'Данные ГорГаза за выбранный период не были загружены!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат
		КонецЕсли;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Объект.ДокументДанныеГоргаза = Выборка.Ссылка;
		ОбъектДокумент = Объект.ДокументДанныеГоргаза.Ссылка.ПолучитьОбъект();
		ОбъектДокумент.Дата = КонецМесяца(Объект.Период);
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументДанныеГоргаза.ДокументКоррекцииСальдо) и Не Коррекция Тогда
		ОбъектДокумент = Объект.ДокументДанныеГоргаза.Ссылка.ПолучитьОбъект();
		ОбъектДокумент.ДокументКоррекцииСальдо = СоздатьПустойДокументКоррекцииСальдо();
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументДанныеГоргаза.УстановкаИзменениеУслугЛС) и Не Коррекция Тогда
		ОбъектДокумент = Объект.ДокументДанныеГоргаза.Ссылка.ПолучитьОбъект();
		ОбъектДокумент.УстановкаИзменениеУслугЛС = СоздатьПустойДокументУстановкаИзменениеУслугПоЛС();
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Объект.УстановкаИзменениеУслугЛС = Объект.ДокументДанныеГоргаза.УстановкаИзменениеУслугЛС;
	Объект.ДокументКоррекцииСальдо = Объект.ДокументДанныеГоргаза.ДокументКоррекцииСальдо;
	
КонецПроцедуры

Функция СоздатьПустойДокументДанныеГорГаза()

	Документ = Документы.лб_ДанныеГорГаза.СоздатьДокумент();
	Документ.Дата = КонецМесяца(Объект.Период);
	Документ.Организация = Объект.Организация;
	Документ.Услуга = Объект.Услуга;
	Документ.Поставщик = Объект.Поставщик;
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Документ.Ссылка;

КонецФункции // СоздатьПустойДокументДанныеГорГаза()

Функция СоздатьПустойДокументКоррекцииСальдо()

	Документ = Документы.бит_РазовыеПоУслугамЖКХ.СоздатьДокумент();
	Документ.Дата = КонецМесяца(Объект.Период);
	Документ.Организация = Объект.Организация;
	Документ.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое;
	Документ.Комментарий = "Коррекция изменений по данным горгаза!";
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Документ.Ссылка;

КонецФункции // СоздатьПустойДокументКоррекцииСальдо()

Функция СоздатьПустойДокументУстановкаИзменениеУслугПоЛС()

	Документ = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент();
	Документ.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета;
	Документ.Дата = НачалоМесяца(Объект.Период);
	Документ.Услуга = Объект.Услуга;
	Документ.Комментарий = "Коррекция изменений по данным горгаза!";
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Документ.Ссылка;

КонецФункции // СоздатьПустойДокументУстановкаИзменениеУслугПоЛС()

Процедура ЗаполнитьДокументУстановкаИзменениеУслугПоЛС()
	
	Если Не ЗначениеЗаполнено(Объект.УстановкаИзменениеУслугЛС) ИЛИ Не ЗначениеЗаполнено(Объект.Услуга) ИЛИ
		Не ЗначениеЗаполнено(Объект.ДокументДанныеГоргаза) ИЛИ Объект.ДокументДанныеГоргаза.ТЧ = 0 ИЛИ
		Не ЗначениеЗаполнено(Объект.Поставщик) Тогда
		Возврат
	КонецЕсли;
	
	ТЗизТЧ = Объект.ДокументДанныеГоргаза.ТЧ.Выгрузить();
	ДокументОбъект = Объект.УстановкаИзменениеУслугЛС.ПолучитьОбъект();
	ДокументОбъект.ЛицевыеСчета.Очистить();

		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЧ", ТЗизТЧ);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Запрос.УстановитьПараметр("Поставщик", Объект.Поставщик);
	Запрос.УстановитьПараметр("СпособРасчета", Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Период));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	               |	ТЧ.ЛицевойСчет КАК ЛицевойСчет,
	               |	ТЧ.Режим КАК РежимПотребления
	               |ПОМЕСТИТЬ ДанныеГорГаз
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеГорГаз.ЛицевойСчет КАК ЛицевойСчет_ГГ,
	               |	&Услуга КАК Услуга_ГГ,
	               |	&Поставщик КАК Поставщик_ГГ,
	               |	&СпособРасчета КАК СпособРасчета_ГГ,
	               |	ДанныеГорГаз.РежимПотребления КАК РежимПотребления_ГГ,
	               |	ДанныеГорГаз.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления_ГГ
	               |ПОМЕСТИТЬ ДанныеГорГаз2
	               |ИЗ
	               |	ДанныеГорГаз КАК ДанныеГорГаз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления_БД
	               |ПОМЕСТИТЬ ДанныеРегистр
	               |ИЗ
	               |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&НачалоПериода, Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеГорГаз2.ЛицевойСчет_ГГ КАК ЛицевойСчет_ГГ,
	               |	ДанныеГорГаз2.Услуга_ГГ КАК Услуга_ГГ,
	               |	ДанныеГорГаз2.СпособРасчета_ГГ КАК СпособРасчета_ГГ,
	               |	ВЫБОР
	               |		КОГДА ДанныеГорГаз2.Поставщик_ГГ <> ДанныеРегистр.Поставщик_БД
	               |				ИЛИ ДанныеГорГаз2.КоличествоЕдиницПотребления_ГГ <> ДанныеРегистр.КоличествоЕдиницПотребления_БД
	               |				ИЛИ ДанныеГорГаз2.РежимПотребления_ГГ <> ДанныеРегистр.РежимПотребления_БД
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Изменен,
	               |	ДанныеГорГаз2.Поставщик_ГГ КАК Поставщик_ГГ,
	               |	ДанныеГорГаз2.РежимПотребления_ГГ КАК РежимПотребления_ГГ,
	               |	ДанныеГорГаз2.КоличествоЕдиницПотребления_ГГ КАК КоличествоЕдиницПотребления_ГГ
	               |ПОМЕСТИТЬ Финиш
	               |ИЗ
	               |	ДанныеГорГаз2 КАК ДанныеГорГаз2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистр КАК ДанныеРегистр
	               |		ПО ДанныеГорГаз2.ЛицевойСчет_ГГ = ДанныеРегистр.ЛицевойСчет_БД
	               |			И ДанныеГорГаз2.Услуга_ГГ = ДанныеРегистр.Услуга_БД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Финиш.ЛицевойСчет_ГГ КАК ЛицевойСчет,
	               |	Финиш.Услуга_ГГ КАК Услуга,
	               |	Финиш.СпособРасчета_ГГ КАК СпособРасчета,
	               |	Финиш.Поставщик_ГГ КАК Поставщик,
	               |	Финиш.РежимПотребления_ГГ КАК РежимПотребления,
	               |	Финиш.КоличествоЕдиницПотребления_ГГ КАК КоличествоЕдиницПотребления
	               |ИЗ
	               |	Финиш КАК Финиш
	               |ГДЕ
	               |	Финиш.Изменен";
	
	
	ДокументОбъект.ЛицевыеСчета.Загрузить(Запрос.Выполнить().Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ЗагрузитьФайлНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере()
	
	Массив = Новый Массив;
	Массив.Добавить("Период");
	Массив.Добавить("Услуга");
	Массив.Добавить("Поставщик");
	Массив.Добавить("Организация");
	Массив.Добавить("РежимДляСчетчиков");
	Массив.Добавить("РежимДляНормативаПоУмолчанию");
	Массив.Добавить("РежимДляНорматива2");
	Массив.Добавить("РазмерНорматива2");
	Массив.Добавить("РежимДляНорматива3");
	Массив.Добавить("РазмерНорматива3");
	Массив.Добавить("РежимНеНачислять");
	
	Для Каждого Реквизит ИЗ Массив Цикл
		Если Не ЗначениеЗаполнено(Объект[Реквизит]) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Реквизит);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//Возврат
		КонецЕсли;
	КонецЦикла;
	
	РезультатРаботы = ПрочитатьDBF(Файл);
	
	ТаблицаЗначений = Неопределено;
	
	Если РезультатРаботы Тогда
		ТаблицаЗначений = ПолучитьИзВременногоХранилища(ВременноеХранилищеDBFФайл);
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаЗначений) <> Тип("ТаблицаЗначений") Тогда
		Возврат
	КонецЕсли;
	
	Запрос = ДополнитьДанныеГорГаза(ТаблицаЗначений);
	
	ЗаполнитьПолеДокументДанныеГорГаза();
	
	ДокументДанныеГорГаз = Объект.ДокументДанныеГоргаза.ПолучитьОбъект();
	ДокументДанныеГорГаз.ТЧ.Загрузить(Запрос[9].Выгрузить());
	ДокументДанныеГорГаз.Записать(РежимЗаписиДокумента.Запись);
	
	ЗаполнитьДокументУстановкаИзменениеУслугПоЛС();
	
	ВывестиНеНайденныеЛС(Запрос[8].Выгрузить());
	
КонецПроцедуры

Процедура ВывестиНеНайденныеЛС(ТаблицаЗначений)
	
	Если ТаблицаЗначений.Количество() = 0 Тогда
		Возврат
	Иначе
		Для Каждого Строка Из ТаблицаЗначений Цикл
			ТекстСообщения = НСтр("ru = 'Не найден лицевой счет - %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.LIC);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ДополнитьДанныеГорГаза(ТаблицаЗначений)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СтатусПроживания,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВладелецКвартиры,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроживаниеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_1
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ) КАК бит_ПроживающиеПоЛССрезПоследних
	               |		ПО бит_ЛицевыеСчета.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(бит_ПроживающиеПоЛС_1.СтатусПроживания) КАК ЧислаПроживающих,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ВладелецКвартиры) КАК Владелецы,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ПроживаниеВДанныйМомент) КАК ПроживанющиеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_2
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_1 КАК бит_ПроживающиеПоЛС_1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_2.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих > бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих < бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = 0
	               |				И бит_ПроживающиеПоЛС_2.Владелецы = 0
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ПроживанющиеВДанныйМомент
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЧислоЕдиницПотребления
	               |ПОМЕСТИТЬ ПроживающиеПоЛС
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_2 КАК бит_ПроживающиеПоЛС_2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеИзФайла.LIC КАК LIC,
	               |	ДанныеИзФайла.TARIF КАК TARIF,
	               |	ДанныеИзФайла.NORM КАК NORM,
	               |	ДанныеИзФайла.SAL_K КАК SAL_K,
	               |	ДанныеИзФайла.S_PENI КАК S_PENI,
	               |	ДанныеИзФайла.PENI КАК PENI,
	               |	ДанныеИзФайла.CH КАК CH,
	               |	ДанныеИзФайла.N_SCHET КАК N_SCHET,
	               |	ДанныеИзФайла.D_POV КАК D_POV,
	               |	ДанныеИзФайла.N_POK КАК N_POK
	               |ПОМЕСТИТЬ ДанныеИзФайла
	               |ИЗ
	               |	&ДанныеИзФайла КАК ДанныеИзФайла
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеИзФайла.LIC КАК LIC,
	               |	ДанныеИзФайла.TARIF КАК TARIF,
	               |	ДанныеИзФайла.NORM КАК NORM,
	               |	ДанныеИзФайла.SAL_K КАК SAL_K,
	               |	ДанныеИзФайла.CH КАК CH,
	               |	ДанныеИзФайла.N_SCHET КАК N_SCHET,
	               |	ДанныеИзФайла.D_POV КАК D_POV,
	               |	ДанныеИзФайла.N_POK КАК N_POK,
	               |	ВЫБОР
	               |		КОГДА ДанныеИзФайла.TARIF = 0
	               |			ТОГДА &РежимНеНачислять
	               |		КОГДА ДанныеИзФайла.CH = 1
	               |			ТОГДА &РежимПоСчетчикамГорГаз
	               |		КОГДА ДанныеИзФайла.CH = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ПроверятьРежим2
	               |							И ДанныеИзФайла.NORM = &РазмерРежим2
	               |						ТОГДА &РежимПоНормамГорГаз2
	               |					КОГДА &ПроверятьРежим3
	               |							И ДанныеИзФайла.NORM = &РазмерРежим3
	               |						ТОГДА &РежимПоНормамГорГаз3
	               |					ИНАЧЕ &РежимПоНормамГорГаз
	               |				КОНЕЦ
	               |	КОНЕЦ КАК РежимПотребления,
	               |	ВЫБОР
	               |		КОГДА ДанныеИзФайла.CH = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НаличиеСчетчика
	               |ПОМЕСТИТЬ ДанныеИзФайла2
	               |ИЗ
	               |	ДанныеИзФайла КАК ДанныеИзФайла
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	               |	бит_ЛицевыеСчета.Наименование КАК Наименование
	               |ПОМЕСТИТЬ ВсеЛС
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеЛС.Ссылка.Здание КАК Здание,
	               |	ВсеЛС.Ссылка КАК ЛицевойСчет,
	               |	ДанныеИзФайла2.TARIF КАК Тариф,
	               |	ДанныеИзФайла2.NORM КАК Норматив,
	               |	ДанныеИзФайла2.SAL_K КАК Сальдо,
	               |	ДанныеИзФайла2.НаличиеСчетчика КАК НаличиеСчетчика,
	               |	ДанныеИзФайла2.N_SCHET КАК НомерСчетчика,
	               |	ДанныеИзФайла2.D_POV КАК ДатаПоверки,
	               |	ДанныеИзФайла2.N_POK КАК ТекПоказание,
	               |	ДанныеИзФайла2.РежимПотребления КАК Режим,
	               |	ДанныеИзФайла2.LIC КАК LIC
	               |ПОМЕСТИТЬ ДанныеИзФайла3
	               |ИЗ
	               |	ДанныеИзФайла2 КАК ДанныеИзФайла2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеЛС КАК ВсеЛС
	               |		ПО ДанныеИзФайла2.LIC = ВсеЛС.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеИзФайла3.Здание КАК Здание,
	               |	ДанныеИзФайла3.ЛицевойСчет КАК ЛицевойСчет,
	               |	ДанныеИзФайла3.Тариф КАК Тариф,
	               |	ДанныеИзФайла3.Норматив КАК Норматив,
	               |	ДанныеИзФайла3.Сальдо КАК Сальдо,
	               |	ДанныеИзФайла3.НаличиеСчетчика КАК НаличиеСчетчика,
	               |	ДанныеИзФайла3.НомерСчетчика КАК НомерСчетчика,
	               |	ДанныеИзФайла3.ДатаПоверки КАК ДатаПоверки,
	               |	ДанныеИзФайла3.ТекПоказание КАК ТекПоказание,
	               |	ДанныеИзФайла3.Режим КАК Режим,
	               |	ПроживающиеПоЛС.ЧислоЕдиницПотребления КАК ЧислоЕдиницПотребления,
	               |	ДанныеИзФайла3.LIC КАК LIC
	               |ПОМЕСТИТЬ ФинишДляФильтра
	               |ИЗ
	               |	ДанныеИзФайла3 КАК ДанныеИзФайла3
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеПоЛС КАК ПроживающиеПоЛС
	               |		ПО ДанныеИзФайла3.ЛицевойСчет = ПроживающиеПоЛС.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФинишДляФильтра.LIC КАК LIC
	               |ИЗ
	               |	ФинишДляФильтра КАК ФинишДляФильтра
	               |ГДЕ
	               |	ФинишДляФильтра.ЛицевойСчет = ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФинишДляФильтра.Здание КАК Здание,
	               |	ФинишДляФильтра.ЛицевойСчет КАК ЛицевойСчет,
	               |	ФинишДляФильтра.Тариф КАК Тариф,
	               |	ФинишДляФильтра.Норматив КАК Норматив,
	               |	ФинишДляФильтра.Сальдо КАК Сальдо,
	               |	ФинишДляФильтра.НаличиеСчетчика КАК НаличиеСчетчика,
	               |	ФинишДляФильтра.НомерСчетчика КАК НомерСчетчика,
	               |	ФинишДляФильтра.ДатаПоверки КАК ДатаПоверки,
	               |	ФинишДляФильтра.ТекПоказание КАК ТекПоказание,
	               |	ФинишДляФильтра.Режим КАК Режим,
	               |	ФинишДляФильтра.ЧислоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               |ИЗ
	               |	ФинишДляФильтра КАК ФинишДляФильтра
	               |ГДЕ
	               |	ФинишДляФильтра.ЛицевойСчет <> ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)";
				   
	Запрос.УстановитьПараметр("ДанныеИзФайла", ТаблицаЗначений);
	Запрос.УстановитьПараметр("РежимНеНачислять", Объект.РежимНеНачислять);
	Запрос.УстановитьПараметр("РазмерРежим2", Объект.РазмерНорматива2);
	Запрос.УстановитьПараметр("РазмерРежим3", Объект.РазмерНорматива3);
	Запрос.УстановитьПараметр("РежимПоНормамГорГаз2", Объект.РежимДляНорматива2);
	Запрос.УстановитьПараметр("РежимПоНормамГорГаз3", Объект.РежимДляНорматива3);
	Запрос.УстановитьПараметр("РежимПоСчетчикамГорГаз", Объект.РежимДляСчетчиков);
	Запрос.УстановитьПараметр("РежимПоНормамГорГаз", Объект.РежимДляНормативаПоУмолчанию);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Период));
	
	Если ЗначениеЗаполнено(Объект.РежимДляНорматива2) И Объект.РазмерНорматива2 <> 0 Тогда
		Запрос.УстановитьПараметр("ПроверятьРежим2", Истина);
	Иначе
		Запрос.УстановитьПараметр("ПроверятьРежим2", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РежимДляНорматива3) И Объект.РазмерНорматива3 <> 0 Тогда
		Запрос.УстановитьПараметр("ПроверятьРежим3", Истина);
	Иначе
		Запрос.УстановитьПараметр("ПроверятьРежим3", Ложь);
	КонецЕсли;

	Возврат Запрос.ВыполнитьПакет(); 	

КонецФункции

&НаСервере
Процедура ОбновитьНаСервере()
	
	Массив = Новый Массив;
	Массив.Добавить("Период");
	Массив.Добавить("Услуга");
	Массив.Добавить("Поставщик");
	Массив.Добавить("Организация");
	Массив.Добавить("РежимДляСчетчиков");
	Массив.Добавить("РежимДляНормативаПоУмолчанию");
	Массив.Добавить("РежимДляНорматива2");
	Массив.Добавить("РазмерНорматива2");
	Массив.Добавить("РежимДляНорматива3");
	Массив.Добавить("РазмерНорматива3");
	Массив.Добавить("РежимНеНачислять");
	
	Для Каждого Реквизит ИЗ Массив Цикл
		Если Не ЗначениеЗаполнено(Объект[Реквизит]) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Реквизит);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//Возврат
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьПолеДокументДанныеГорГаза();
	
	Если Не ЗначениеЗаполнено(Объект.УстановкаИзменениеУслугЛС) Тогда
		Возврат
	КонецЕсли;
	
	ДокументОбъект = Объект.УстановкаИзменениеУслугЛС.ПолучитьОбъект();
	ДокументОбъект.ЛицевыеСчета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("РежимПотребления", Объект.РежимДляНормативаПоУмолчанию);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СтатусПроживания,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВладелецКвартиры,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроживаниеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_1
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ) КАК бит_ПроживающиеПоЛССрезПоследних
	               |		ПО бит_ЛицевыеСчета.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(бит_ПроживающиеПоЛС_1.СтатусПроживания) КАК ЧислаПроживающих,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ВладелецКвартиры) КАК Владелецы,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ПроживаниеВДанныйМомент) КАК ПроживанющиеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_2
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_1 КАК бит_ПроживающиеПоЛС_1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_2.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих > бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих < бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = 0
	               |				И бит_ПроживающиеПоЛС_2.Владелецы = 0
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ПроживанющиеВДанныйМомент
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЧислоЕдиницПотребления
	               |ПОМЕСТИТЬ ПроживающиеПоЛС
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_2 КАК бит_ПроживающиеПоЛС_2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	               |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	               |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	               |	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               |ПОМЕСТИТЬ ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	               |			,
	               |			РежимПотребления = &РежимПотребления
	               |				И Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеРегистра.ЛицевойСчет КАК ЛицевойСчет,
	               |	ДанныеРегистра.Услуга КАК Услуга,
	               |	ДанныеРегистра.Поставщик КАК Поставщик,
	               |	ДанныеРегистра.СпособРасчета КАК СпособРасчета,
	               |	ДанныеРегистра.РежимПотребления КАК РежимПотребления,
	               |	ВЫБОР
	               |		КОГДА ДанныеРегистра.КоличествоЕдиницПотребления <> ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |			ТОГДА ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |		ИНАЧЕ ДанныеРегистра.КоличествоЕдиницПотребления
	               |	КОНЕЦ КАК КоличествоЕдиницПотребления,
	               |	ВЫБОР
	               |		КОГДА ДанныеРегистра.КоличествоЕдиницПотребления <> ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Изменен
	               |ПОМЕСТИТЬ Финиш
	               |ИЗ
	               |	ДанныеРегистра КАК ДанныеРегистра
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеПоЛС КАК ПроживающиеПоЛС
	               |		ПО ДанныеРегистра.ЛицевойСчет = ПроживающиеПоЛС.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Финиш.ЛицевойСчет КАК ЛицевойСчет,
	               |	Финиш.Услуга КАК Услуга,
	               |	Финиш.Поставщик КАК Поставщик,
	               |	Финиш.СпособРасчета КАК СпособРасчета,
	               |	Финиш.РежимПотребления КАК РежимПотребления,
	               |	Финиш.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               |ИЗ
	               |	Финиш КАК Финиш
	               |ГДЕ
	               |	Финиш.Изменен";
	
	ДокументОбъект.ЛицевыеСчета.Загрузить(Запрос.Выполнить().Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ТекстСообщения = НСтр("ru = 'Обновление успешно произведено!'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период = ТекущаяДата();
	Объект.Организация = Справочники.Организации.НайтиПоНаименованию("Наша организация");
	Объект.Поставщик = Справочники.бит_ПоставщикиУслуг.НайтиПоНаименованию("ГорГаз");
	Объект.Услуга = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("ГорГаз");
	Объект.РежимНеНачислять = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Не начислять");
	Объект.РежимДляСчетчиков = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("По счетчикам (Горгаз)");
	Объект.РежимДляНормативаПоУмолчанию = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("По нормативам (ГорГаз)");
	Объект.РежимДляНорматива2 = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Режим номер 2");
	Объект.РежимДляНорматива3 = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Режим номер 3");
	Объект.РазмерНорматива2 = 5;
	Объект.РазмерНорматива3 = 6;
КонецПроцедуры

///////////////8.2.2//////////////////////

&НаСервере
Процедура КоррекцияСальдоНаСервере()
	
	ЗаполнитьПолеДокументДанныеГорГаза(Истина);
	Результат = "";
	лб_ГорГаз.КоррекцияСальдоГорГаз(Объект.Период, Объект.Организация, Результат);
	
	ТекстСообщения = НСтр("ru = '%1!'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Результат);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 	
	
КонецПроцедуры

&НаКлиенте
Процедура КоррекцияСальдо(Команда)
	КоррекцияСальдоНаСервере();
КонецПроцедуры

///////////////8.2.3//////////////////////

//8.2.3(1)
&НаКлиенте
Процедура НачисленияГорГаз(Команда)
	ФайлНачисленияГорГаза = ОткрытьФайл();
	НачисленияГорГазНаСервере()
КонецПроцедуры

&НаСервере
Процедура НачисленияГорГазНаСервере()
	
	Массив = Новый Массив;
	Массив.Добавить("Период");
	Массив.Добавить("Услуга");
	Массив.Добавить("Поставщик");
	Массив.Добавить("Организация");
	Массив.Добавить("РежимДляСчетчиков");
	
	Для Каждого Реквизит ИЗ Массив Цикл
		Если Не ЗначениеЗаполнено(Объект[Реквизит]) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Реквизит);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьПолеДокументДанныеГорГаза(Истина);
	
	Если Не ЗначениеЗаполнено(Объект.ДокументКоррекцииСальдо) Тогда
		Возврат
	КонецЕсли;

	НовыйДБФ = СоздатьПустойДБФНачисленияГорГаз();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаНачисленияГорГаз();
	Запрос.УстановитьПараметр("Регистратор", Объект.ДокументКоррекцииСальдо);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Запрос.УстановитьПараметр("РежимПоСчетчикамГорГаз", Объект.РежимДляСчетчиков);
	Запрос.УстановитьПараметр("Поставщик", Объект.Поставщик);
	Запрос.УстановитьПараметр("ПериодН", Новый Граница(НачалоМесяца(Объект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодК", Новый Граница(КонецМесяца(Объект.Период), ВидГраницы.Включая));	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Результат Цикл
		НовыйДБФ.Добавить();
		
		ЛС = Строка.Ссылка.Наименование;
		Здание = Строка.Ссылка.Здание;
		Адрес = АдресПоЛС(Строка.Ссылка, Здание);
		
		Попытка
			НовыйДБФ.IND = Лев(ЛС, 3);
			НовыйДБФ.LIC = Сред(ЛС, 4);
		Исключение
			Продолжить
		КонецПопытки;
		НовыйДБФ.FIO = Строка.FIO;
		НовыйДБФ.ADR = Адрес;
		НовыйДБФ.KP = Строка.KP;
		НовыйДБФ.NACHSV = Строка.NACHSV;
		НовыйДБФ.SAL = Строка.SAL;
		НовыйДБФ.PERIOD = Месяц(Объект.Период);
		НовыйДБФ.CH = Строка.CH;
		НовыйДБФ.TARIF = Строка.TARIF;
		
		НовыйДБФ.Записать();
	КонецЦикла;
	
	НовыйДБФ.ЗакрытьФайл();
	
	ПереместитьФайл(ФайлНачисленияГорГазаВр, ФайлНачисленияГорГаза);

КонецПроцедуры

Функция ТекстЗапросаНачисленияГорГаз()
	
	Текст = "ВЫБРАТЬ
	        |	бит_СписокЗданий.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_Здания
	        |ИЗ
	        |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ЛС
	        |ИЗ
	        |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	        |ГДЕ
	        |	бит_ЛицевыеСчета.Здание В
	        |			(ВЫБРАТЬ
	        |				ВТ_Здания.Ссылка
	        |			ИЗ
	        |				ВТ_Здания КАК ВТ_Здания)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК KP
	        |ПОМЕСТИТЬ ВТ_Проживающие
	        |ИЗ
	        |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |			&ПериодК,
	        |			СтатусПроживания В (ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно), ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно))
	        |				И ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЛС.Ссылка
	        |					ИЗ
	        |						ВТ_ЛС КАК ВТ_ЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВЫБОР
	        |		КОГДА бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = &РежимПоСчетчикамГорГаз
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК CH
	        |ПОМЕСТИТЬ ВТ_РежимПотребления
	        |ИЗ
	        |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	        |			&ПериодК,
	        |			Услуга = &Услуга
	        |				И ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЛС.Ссылка
	        |					ИЗ
	        |						ВТ_ЛС КАК ВТ_ЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК SAL
	        |ПОМЕСТИТЬ ВТ_Сальдо
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	        |			,
	        |			&ПериодК,
	        |			Регистратор,
	        |			,
	        |			УслугаЖКХ = &Услуга
	        |				И Организация = &Организация
	        |				И ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЛС.Ссылка
	        |					ИЗ
	        |						ВТ_ЛС КАК ВТ_ЛС)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |ГДЕ
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор <> &Регистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаПриход КАК NACHSV
	        |ПОМЕСТИТЬ ВТ_Начисления
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	        |			&ПериодН,
	        |			&ПериодК,
	        |			Регистратор,
	        |			,
	        |			УслугаЖКХ = &Услуга
	        |				И Организация = &Организация
	        |				И ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЛС.Ссылка
	        |					ИЗ
	        |						ВТ_ЛС КАК ВТ_ЛС)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |ГДЕ
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	        |	бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо КАК FIO
	        |ПОМЕСТИТЬ ВТ_Ответственный
	        |ИЗ
	        |	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(
	        |			&ПериодК,
	        |			ЛицевойСчет В
	        |				(ВЫБРАТЬ
	        |					ВТ_ЛС.Ссылка
	        |				ИЗ
	        |					ВТ_ЛС КАК ВТ_ЛС)) КАК бит_ОтветственныеЛицаПоКУСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры
	        |ПОМЕСТИТЬ ВТ_Тариф_1
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ПериодК, ) КАК бит_СведенияОКвартиреСрезПоследних
	        |		ПО ВТ_ЛС.Ссылка.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Тариф_1.Ссылка КАК Ссылка,
	        |	ВТ_Тариф_1.ТипКвартиры КАК ТипКвартиры,
	        |	ВТ_Тариф_1.СтатусКвартиры КАК СтатусКвартиры,
	        |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	        |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	        |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	        |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета
	        |ПОМЕСТИТЬ ВТ_Тариф_2
	        |ИЗ
	        |	ВТ_Тариф_1 КАК ВТ_Тариф_1
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	        |				&ПериодК,
	        |				Услуга = &Услуга
	        |					И ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
	        |		ПО ВТ_Тариф_1.Ссылка = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Тариф_2.Ссылка КАК ЛицевойСчет,
	        |	бит_СтавкиНаУслугиСрезПоследних.Тариф КАК TARIF
	        |ПОМЕСТИТЬ ВТ_Тариф
	        |ИЗ
	        |	ВТ_Тариф_2 КАК ВТ_Тариф_2
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	        |				&ПериодК,
	        |				Услуга = &Услуга
	        |					И Поставщик = &Поставщик) КАК бит_СтавкиНаУслугиСрезПоследних
	        |		ПО ВТ_Тариф_2.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	        |			И ВТ_Тариф_2.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	        |			И ВТ_Тариф_2.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	        |			И ВТ_Тариф_2.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	        |			И ВТ_Тариф_2.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	        |			И ВТ_Тариф_2.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	ВТ_Тариф.TARIF КАК TARIF,
	        |	ВТ_Начисления.NACHSV КАК NACHSV,
	        |	ВТ_Ответственный.FIO КАК FIO,
	        |	ВТ_РежимПотребления.CH КАК CH,
	        |	ВТ_Сальдо.SAL КАК SAL,
	        |	ВТ_Проживающие.KP КАК KP
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РежимПотребления КАК ВТ_РежимПотребления
	        |		ПО ВТ_ЛС.Ссылка = ВТ_РежимПотребления.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо КАК ВТ_Сальдо
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Сальдо.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Начисления КАК ВТ_Начисления
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Начисления.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Тариф КАК ВТ_Тариф
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Тариф.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ответственный КАК ВТ_Ответственный
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Ответственный.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проживающие КАК ВТ_Проживающие
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Проживающие.ЛицевойСчет";
	
	Возврат Текст;

КонецФункции

Функция АдресПоЛС(ЛС, Здание)
	
	Адрес = "";
	
	Если ЗначениеЗаполнено(Здание.Улица.ТипУлицы) Тогда
		Адрес = Адрес + Строка(Здание.Улица.ТипУлицы)
	КонецЕсли;

	Если ЗначениеЗаполнено(Здание.Улица) Тогда
		Адрес = Адрес + Строка(Здание.Улица) + ", "
	КонецЕсли;
	
	Адрес = Адрес + "д." + Строка(Здание.НомерДома);
	
	Если ЗначениеЗаполнено(Здание.ПрефиксДома) Тогда
		Адрес = Адрес + Здание.ПрефиксДома 	
	КонецЕсли;

	Если ЗначениеЗаполнено(Здание.Корпус) Тогда
		Адрес = Адрес + "кор. " + Здание.Корпус 	
	КонецЕсли;
	
	Адрес = Адрес + ", ";
	
	НомерКвартиры = ЛС.Квартира.Наименование;
	
	НомерПозиции = СтрНайти(НомерКвартиры, "=");
	
	Если НомерПозиции <> 0 Тогда
		НомерКвартиры = Лев(НомерКвартиры, НомерПозиции - 1)
	КонецЕсли;
	
	Адрес = Адрес + НомерКвартиры;
	
	Возврат Адрес;

КонецФункции // АдресПоЛС()

Функция СоздатьПустойДБФНачисленияГорГаз()
	
	//ошибка при превышении длины имени файла
	ФайлНачисленияГорГазаВр = КаталогВременныхФайлов() + "new.dbf";
	
	ДБФ = Новый XBase;
	ДБФ.Кодировка = КодировкаXBase.OEM;
	ДБФ.Поля.Добавить("IND", "N", 4);
	ДБФ.Поля.Добавить("LIC", "F", 7, 0);
	ДБФ.Поля.Добавить("FIO", "S", 35);
	ДБФ.Поля.Добавить("ADR", "S", 40);
	ДБФ.Поля.Добавить("KP", "N", 2);
	ДБФ.Поля.Добавить("KL", "N", 2);
	ДБФ.Поля.Добавить("NACHSV", "F", 8, 2);
	ДБФ.Поля.Добавить("SAL", "F", 8, 2);
	ДБФ.Поля.Добавить("IZM", "F", 8, 2);
	ДБФ.Поля.Добавить("PERIOD", "N", 2);
	ДБФ.Поля.Добавить("LL", "S", 60);
	ДБФ.Поля.Добавить("PR22", "N", 3);
	ДБФ.Поля.Добавить("SOS22", "N", 2);
	ДБФ.Поля.Добавить("CH", "N", 2);
	ДБФ.Поля.Добавить("TARIF", "F", 10, 2);	
	ДБФ.СоздатьФайл(ФайлНачисленияГорГазаВр);
	
	Возврат ДБФ;

КонецФункции

//8.2.3(2)
&НаКлиенте
Процедура ПроживающиеГорГаз(Команда)
	ФайлПроживающиеГорГаза = ОткрытьФайл();
	ПроживающиеГорГазНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроживающиеГорГазНаСервере()
	
	Массив = Новый Массив;
	Массив.Добавить("Период");
	Массив.Добавить("Услуга");
	Массив.Добавить("Поставщик");
	Массив.Добавить("Организация");
	Массив.Добавить("РежимДляНормативаПоУмолчанию");
	
	Для Каждого Реквизит ИЗ Массив Цикл
		Если Не ЗначениеЗаполнено(Объект[Реквизит]) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Реквизит);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат
		КонецЕсли;
	КонецЦикла;
	
	НовыйДБФ = СоздатьПустойДБФПроживающиеГорГаз();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроживающиеГорГаз();
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Запрос.УстановитьПараметр("НормативГорГаз", Объект.РежимДляНормативаПоУмолчанию);
	Запрос.УстановитьПараметр("Поставщик", Объект.Поставщик);
	Запрос.УстановитьПараметр("ПериодН", Новый Граница(НачалоМесяца(Объект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодК", Новый Граница(КонецМесяца(Объект.Период), ВидГраницы.Включая));	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Результат Цикл
		НовыйДБФ.Добавить();
		
		ЛС = Строка.Ссылка.Наименование;
		Здание = Строка.Ссылка.Здание;
		Адрес = АдресПоЛСМассив(Строка.Ссылка, Здание);
		ФИО = ФИО(Строка.ФизЛицо);
		
		НовыйДБФ.LS = Строка.Ссылка.Наименование;
		НовыйДБФ.DOM = Адрес[0];
		НовыйДБФ.N_KVART = Адрес[1];
		НовыйДБФ.TAR = Строка.TAR;
		НовыйДБФ.K_CH = Строка.K_CH;
		НовыйДБФ.K_JIL = Строка.K_JIL;
		НовыйДБФ.K_FAKT = Строка.K_FAKT;
		Если Строка.PR_KV = 1 Тогда
			НовыйДБФ.K_SOB = Строка.K_SOB;
		КонецЕсли;
		НовыйДБФ.S = Строка.S;
		НовыйДБФ.NACH_BI = Строка.NACH_BI;
		НовыйДБФ.NACH_I = Строка.NACH_I;
		НовыйДБФ.S_KM = Строка.S_KM;
		НовыйДБФ.FAM = ФИО.Фамилия;
		НовыйДБФ.IM = ФИО.Имя;
		НовыйДБФ.OTCH = ФИО.Отчество;
		Попытка
			НовыйДБФ.D_ROG = Строка.ФизЛицо.ДатаРождения;
		Исключение
		КонецПопытки;
		НовыйДБФ.DAT_REG = Строка.DAT_REG;
		НовыйДБФ.DAT_UNREG = Строка.DAT_UNREG;
		НовыйДБФ.VID_REG = Строка.VID_REG;
		НовыйДБФ.PR_KV = Строка.PR_KV;
		
		РодОтношение = "";
		Если НЕ Строка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано и НЕ Строка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
			РодОтношение = Строка(Строка.СтепеньРодства);
		КонецЕсли;
		
		Если Строка.K_SOB = 1 и Строка.ВладелецКвартиры = 1 Тогда
			Доля = "Собств., ";
			НовыйДБФ.ROD_OTN = Доля + РодОтношение;
		Иначе
			Доля = "";
			Если Строка.ВладелецКвартиры = 1 И Строка.ДоляПлощади <> 0  Тогда
				Доля = "Собств. " + Дробь(Строка.ДоляПлощади) + ", ";
			КонецЕсли;
			НовыйДБФ.ROD_OTN = Доля + РодОтношение; 
		КонецЕсли;
		НовыйДБФ.PERIOD = Формат(Объект.Период, "ДФ=MM.yyyy");
		
		НовыйДБФ.Записать();
	КонецЦикла;
	
	НовыйДБФ.ЗакрытьФайл();
	
	ПереместитьФайл(ФайлПроживающиеГорГазаВр, ФайлПроживающиеГорГаза);

КонецПроцедуры

Функция СоздатьПустойДБФПроживающиеГорГаз()
	
	//ошибка при превышении длины имени файла
	ФайлПроживающиеГорГазаВр = КаталогВременныхФайлов() + "new.dbf";
	
	ДБФ = Новый XBase;
	ДБФ.Кодировка = КодировкаXBase.OEM;
	ДБФ.Поля.Добавить("LS", "S", 11);
	ДБФ.Поля.Добавить("DOM", "S", 40);
	ДБФ.Поля.Добавить("N_KVART", "S", 10);
	ДБФ.Поля.Добавить("TAR", "F", 8, 2);	
	ДБФ.Поля.Добавить("K_CH", "N", 2);
	ДБФ.Поля.Добавить("K_JIL", "N", 2);
	ДБФ.Поля.Добавить("K_FAKT", "N", 2);
	ДБФ.Поля.Добавить("K_SOB", "N", 3);
	ДБФ.Поля.Добавить("S", "F", 6, 2);
	ДБФ.Поля.Добавить("NACH_BI", "F", 8, 2);
	ДБФ.Поля.Добавить("NACH_I", "F", 8, 2);
	ДБФ.Поля.Добавить("S_KM", "F", 10, 2);
	ДБФ.Поля.Добавить("FAM", "S", 30);
	ДБФ.Поля.Добавить("IM", "S", 15);
	ДБФ.Поля.Добавить("OTCH", "S", 15);
	ДБФ.Поля.Добавить("D_ROG", "D", 8);
	ДБФ.Поля.Добавить("DAT_REG", "D", 8);
	ДБФ.Поля.Добавить("DAT_UNREG", "D", 8);
	ДБФ.Поля.Добавить("VID_REG", "S", 15);
	ДБФ.Поля.Добавить("PR_KV", "S", 1);
	ДБФ.Поля.Добавить("ROD_OTN", "S", 15);
	ДБФ.Поля.Добавить("KOD", "S", 3);
	ДБФ.Поля.Добавить("NAIM", "S", 30);
	ДБФ.Поля.Добавить("DATN_LG", "D", 8);
	ДБФ.Поля.Добавить("DATK_LG", "D", 8);
	ДБФ.Поля.Добавить("PR_NOS", "S", 1);
	ДБФ.Поля.Добавить("NPSS", "S", 11);
	ДБФ.Поля.Добавить("PERIOD", "S", 8);


	ДБФ.СоздатьФайл(ФайлПроживающиеГорГазаВр);
	
	Возврат ДБФ;

КонецФункции

Функция ТекстЗапросаПроживающиеГорГаз()

	Текст = "ВЫБРАТЬ
	        |	бит_СписокЗданий.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_Здания
	        |ИЗ
	        |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ЛС
	        |ИЗ
	        |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	        |ГДЕ
	        |	бит_ЛицевыеСчета.Здание В
	        |			(ВЫБРАТЬ
	        |				ВТ_Здания.Ссылка
	        |			ИЗ
	        |				ВТ_Здания КАК ВТ_Здания)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	        |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры
	        |ПОМЕСТИТЬ ВТ_Тариф_1
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ПериодК, ) КАК бит_СведенияОКвартиреСрезПоследних
	        |		ПО ВТ_ЛС.Ссылка.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Тариф_1.Ссылка КАК Ссылка,
	        |	ВТ_Тариф_1.ТипКвартиры КАК ТипКвартиры,
	        |	ВТ_Тариф_1.СтатусКвартиры КАК СтатусКвартиры,
	        |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	        |	&НормативГорГаз КАК РежимПотребления,
	        |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	        |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета
	        |ПОМЕСТИТЬ ВТ_Тариф_2
	        |ИЗ
	        |	ВТ_Тариф_1 КАК ВТ_Тариф_1
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	        |				&ПериодК,
	        |				Услуга = &Услуга
	        |					И ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
	        |		ПО ВТ_Тариф_1.Ссылка = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Тариф_2.Ссылка КАК ЛицевойСчет,
	        |	бит_СтавкиНаУслугиСрезПоследних.Тариф КАК TARIF
	        |ПОМЕСТИТЬ ВТ_Тариф
	        |ИЗ
	        |	ВТ_Тариф_2 КАК ВТ_Тариф_2
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	        |				&ПериодК,
	        |				Услуга = &Услуга
	        |					И Поставщик = &Поставщик) КАК бит_СтавкиНаУслугиСрезПоследних
	        |		ПО ВТ_Тариф_2.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	        |			И ВТ_Тариф_2.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	        |			И ВТ_Тариф_2.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	        |			И ВТ_Тариф_2.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	        |			И ВТ_Тариф_2.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	        |			И ВТ_Тариф_2.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик) КАК K_CH
	        |ПОМЕСТИТЬ ВТ_Счетчики
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&ПериодК, Использовать = ИСТИНА) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК K_JIL
	        |ПОМЕСТИТЬ ВТ_Зарегистрированные
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |				&ПериодК,
	        |				ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)
	        |					И СтатусФизЛица В (ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ВременнаяРегистрация), ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация))) КАК бит_ПроживающиеПоЛССрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК K_FAKT
	        |ПОМЕСТИТЬ ВТ_Проживающие
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |				&ПериодК,
	        |				ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)
	        |					И СтатусПроживания В (ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно), ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно))) КАК бит_ПроживающиеПоЛССрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК K_SOB
	        |ПОМЕСТИТЬ ВТ_Собственники
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |				&ПериодК,
	        |				ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)
	        |					И ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)) КАК бит_ПроживающиеПоЛССрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК S
	        |ПОМЕСТИТЬ ВТ_ПлощадьКвартиры
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ПериодК, ) КАК бит_СведенияОКвартиреСрезПоследних
	        |		ПО ВТ_ЛС.Ссылка.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	        |	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	        |	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	        |	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	        |	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	        |	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	        |	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры КАК ВладелецКвартиры
	        |ПОМЕСТИТЬ ВТ_ФЛ
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |				&ПериодК,
	        |				ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЛС.Ссылка
	        |					ИЗ
	        |						ВТ_ЛС КАК ВТ_ЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	        |	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК S_KM
	        |ПОМЕСТИТЬ ВТ_Сальдо
	        |ИЗ
	        |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	        |			,
	        |			&ПериодК,
	        |			,
	        |			,
	        |			УслугаЖКХ = &Услуга
	        |				И Организация = &Организация
	        |				И ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЛС.Ссылка
	        |					ИЗ
	        |						ВТ_ЛС КАК ВТ_ЛС)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаПриход) КАК NACH_BI,
	        |	ВТ_ЛС.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_НачисленияБезКорр
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	        |				&ПериодН,
	        |				&ПериодК,
	        |				Регистратор,
	        |				,
	        |				УслугаЖКХ = &Услуга
	        |					И Организация = &Организация
	        |					И ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |		ПО ВТ_ЛС.Ссылка = бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	        |					И бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты)
	        |				ТОГДА ЛОЖЬ
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаПриход) КАК NACH_I,
	        |	ВТ_ЛС.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_НачисленияКорр
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	        |				&ПериодН,
	        |				&ПериодК,
	        |				Регистратор,
	        |				,
	        |				УслугаЖКХ = &Услуга
	        |					И Организация = &Организация
	        |					И ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	        |		ПО ВТ_ЛС.Ссылка = бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	        |					И бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	ВТ_ФЛ.ФизЛицо КАК ФизЛицо,
	        |	ВТ_ФЛ.СтатусПроживания КАК СтатусПроживания,
	        |	ВТ_ФЛ.ДатаРегистрации КАК ДатаРегистрации,
	        |	ВТ_ФЛ.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	        |	ВТ_ФЛ.ДоляПлощади КАК ДоляПлощади,
	        |	ВЫБОР
	        |		КОГДА ВТ_ФЛ.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК PR_KV,
	        |	ВТ_ПлощадьКвартиры.S КАК S,
	        |	ВТ_Проживающие.K_FAKT КАК K_FAKT,
	        |	ВТ_Собственники.K_SOB КАК K_SOB,
	        |	ВТ_Счетчики.K_CH КАК K_CH,
	        |	ВТ_Тариф.TARIF КАК TARIF,
	        |	ВТ_Зарегистрированные.K_JIL КАК K_JIL,
	        |	ВТ_Сальдо.S_KM КАК S_KM,
	        |	ВТ_НачисленияБезКорр.NACH_BI КАК NACH_BI,
	        |	ВТ_НачисленияКорр.NACH_I КАК NACH_I,
	        |	ВТ_ФЛ.СтепеньРодства КАК СтепеньРодства,
	        |	ВТ_ФЛ.ВладелецКвартиры КАК ВладелецКвартиры
	        |ПОМЕСТИТЬ ВТ_Финал
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФЛ КАК ВТ_ФЛ
	        |		ПО ВТ_ЛС.Ссылка = ВТ_ФЛ.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Тариф КАК ВТ_Тариф
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Тариф.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Счетчики КАК ВТ_Счетчики
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Счетчики.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Зарегистрированные КАК ВТ_Зарегистрированные
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Зарегистрированные.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проживающие КАК ВТ_Проживающие
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Проживающие.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Собственники КАК ВТ_Собственники
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Собственники.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадьКвартиры КАК ВТ_ПлощадьКвартиры
	        |		ПО ВТ_ЛС.Ссылка = ВТ_ПлощадьКвартиры.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо КАК ВТ_Сальдо
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Сальдо.ЛицевойСчет
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачисленияБезКорр КАК ВТ_НачисленияБезКорр
	        |		ПО ВТ_ЛС.Ссылка = ВТ_НачисленияБезКорр.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачисленияКорр КАК ВТ_НачисленияКорр
	        |		ПО ВТ_ЛС.Ссылка = ВТ_НачисленияКорр.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Финал.Ссылка КАК Ссылка,
	        |	ВТ_Финал.ФизЛицо КАК ФизЛицо,
	        |	ВТ_Финал.ДоляПлощади КАК ДоляПлощади,
	        |	ВТ_Финал.PR_KV КАК PR_KV,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.PR_KV = 1
	        |			ТОГДА ВТ_Финал.S
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК S,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.PR_KV = 1
	        |			ТОГДА ВТ_Финал.K_FAKT
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК K_FAKT,
	        |	ВТ_Финал.K_SOB КАК K_SOB,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.PR_KV = 1
	        |			ТОГДА ВТ_Финал.K_CH
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК K_CH,
	        |	ВТ_Финал.TARIF КАК TAR,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.PR_KV = 1
	        |			ТОГДА ВТ_Финал.K_JIL
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК K_JIL,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.PR_KV = 1
	        |			ТОГДА ВТ_Финал.S_KM
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК S_KM,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.PR_KV = 1
	        |			ТОГДА ВТ_Финал.NACH_BI
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК NACH_BI,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.PR_KV = 1
	        |			ТОГДА ВТ_Финал.NACH_I
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК NACH_I,
	        |	ВТ_Финал.СтепеньРодства КАК СтепеньРодства,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.ДатаРегистрации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	        |				И ВТ_Финал.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	        |			ТОГДА ""Не прописан""
	        |		КОГДА НЕ ВТ_Финал.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	        |			ТОГДА ""Выписан""
	        |		КОГДА ВТ_Финал.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно)
	        |			ТОГДА ""Постоянно""
	        |		КОГДА ВТ_Финал.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)
	        |			ТОГДА ""Временно""
	        |		ИНАЧЕ ""Не прописан""
	        |	КОНЕЦ КАК VID_REG,
	        |	ВТ_Финал.ДатаРегистрации КАК DAT_REG,
	        |	ВТ_Финал.ДатаСнятияСРегистрации КАК DAT_UNREG,
	        |	ВЫБОР
	        |		КОГДА ВТ_Финал.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ВладелецКвартиры
	        |ИЗ
	        |	ВТ_Финал КАК ВТ_Финал";
	
	Возврат Текст

КонецФункции // ТекстЗапросаПроживающиеГорГаз()

Функция АдресПоЛСМассив(ЛС, Здание)
	
	Результат = Новый Массив;
	
	Адрес = "";
	НомерКвартиры = "";
	
	Если ЗначениеЗаполнено(Здание.Улица.ТипУлицы) Тогда
		Адрес = Адрес + Строка(Здание.Улица.ТипУлицы)
	КонецЕсли;

	Если ЗначениеЗаполнено(Здание.Улица) Тогда
		Адрес = Адрес + Строка(Здание.Улица) + ", "
	КонецЕсли;
	
	Адрес = Адрес + "д." + Строка(Здание.НомерДома);
	
	Если ЗначениеЗаполнено(Здание.ПрефиксДома) Тогда
		Адрес = Адрес + Здание.ПрефиксДома 	
	КонецЕсли;

	Если ЗначениеЗаполнено(Здание.Корпус) Тогда
		Адрес = Адрес + "кор. " + Здание.Корпус 	
	КонецЕсли;
	
	Результат.Добавить(Адрес);
	
	НомерКвартиры = ЛС.Квартира.Наименование;
	
	НомерПозиции = СтрНайти(НомерКвартиры, "=");
	
	Если НомерПозиции <> 0 Тогда
		НомерКвартиры = Лев(НомерКвартиры, НомерПозиции - 1)
	КонецЕсли;
	
	Результат.Добавить(НомерКвартиры);
	
	Возврат Результат;

КонецФункции // АдресПоЛС()

Функция ФИО(Проживающий)
	
	Структура = Новый Структура;
	Структура.Вставить("Фамилия", "");
	Структура.Вставить("Имя", "");
	Структура.Вставить("Отчество", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
	               |	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
	               |	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК бит_ФИОПроживающихСрезПоследних
	               |ГДЕ
	               |	бит_ФИОПроживающихСрезПоследних.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", Проживающий);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	
	Возврат Структура;

КонецФункции

Функция Дробь(Число)
	
	Знаменатель = 10000;
	Числитель = Число * 10000;
	
	Пока Истина Цикл
		
		Попытка
			ЗнаменательВр = Знаменатель/5;
			ЧислительВр = Числитель/5;
		Исключение
			ЗнаменательВр = 0.1;
			ЧислительВр = 0.1;
		КонецПопытки;
		
		ЦелоеЗн = ЗнаменательВр - Цел(ЗнаменательВр);
		ЦелоеЧис = ЧислительВр - Цел(ЧислительВр);
		
		Если ЦелоеЗн = 0  И ЦелоеЧис = 0 Тогда
			
			Знаменатель = ЗнаменательВр;
			Числитель = ЧислительВр;
			Продолжить
			
		КонецЕсли;
		
		
		Попытка
			ЗнаменательВр = Знаменатель/2;
			ЧислительВр = Числитель/2;
		Исключение
			ЗнаменательВр = 0.1;
			ЧислительВр = 0.1;
		КонецПопытки;
		
		ЦелоеЗн = ЗнаменательВр - Цел(ЗнаменательВр);
		ЦелоеЧис = ЧислительВр - Цел(ЧислительВр);
		
		Если ЦелоеЗн = 0  И ЦелоеЧис = 0 Тогда
			
			Знаменатель = ЗнаменательВр;
			Числитель = ЧислительВр;
			Продолжить
			
		КонецЕсли;
		
		Прервать;
			
	КонецЦикла;
	
	
	Результат = Строка(Числитель) + "/" + Строка(Знаменатель);
	
	Возврат Результат;	

КонецФункции 

//8.2.3(3)
&НаКлиенте
Процедура ПроживающиеРегионГаз(Команда)
	ФайлПроживающиеРегионГаз = ОткрытьФайл();
	ПроживающиеРегионГазНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроживающиеРегионГазНаСервере()
		
	Массив = Новый Массив;
	Массив.Добавить("Период");
	Массив.Добавить("Поставщик");
	
	Для Каждого Реквизит ИЗ Массив Цикл
		Если Не ЗначениеЗаполнено(Объект[Реквизит]) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Реквизит);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат
		КонецЕсли;
	КонецЦикла;
		
	НовыйДБФ = СоздатьПустойДБФПроживающиеРегионГаз();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроживающиеРегионГаз();
	Запрос.УстановитьПараметр("ПериодК", Новый Граница(КонецМесяца(Объект.Период), ВидГраницы.Включая));	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Результат Цикл
		НовыйДБФ.Добавить();
		
		ЛС = Строка.Ссылка.Наименование;
		Здание = Строка.Ссылка.Здание;
		Адрес = АдресПоЛСМассивПодробно(Строка.Ссылка, Здание);
		ФИО = ФИО(Строка.ФизЛицо);
		
		НовыйДБФ.LS = Строка.Ссылка.Наименование;
		НовыйДБФ.ULICA = Адрес[0];
		НовыйДБФ.DOM = Адрес[1];
		НовыйДБФ.KORP = Адрес[2];
		НовыйДБФ.KVART = Адрес[3];
		НовыйДБФ.CHLEN = Строка.CHLEN;
		НовыйДБФ.PLOSH = Строка.PLOSH;
		НовыйДБФ.FAM = ФИО.Фамилия;
		НовыйДБФ.IM = ФИО.Имя;
		НовыйДБФ.OTCH = ФИО.Отчество;
		НовыйДБФ.DAT_R = Строка.DAT_R;
		НовыйДБФ.DAT_REG = Строка.DAT_REG;
		НовыйДБФ.DAT_UNREG = Строка.DAT_UNREG;
		НовыйДБФ.VID_REG = Строка.VID_REG;
		
		РодОтношение = "";
		Если НЕ Строка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано и НЕ Строка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
			РодОтношение = Строка(Строка.СтепеньРодства);
		КонецЕсли;
		
		Если Строка.K_SOB = 1 и Строка.ВладелецКвартиры = 1 Тогда
			Доля = "Собств., ";
			НовыйДБФ.ROD_OT = Доля + РодОтношение;
		Иначе
			Доля = "";
			Если Строка.ВладелецКвартиры = 1 И Строка.ДоляПлощади <> 0 Тогда
				Доля = "Собств. " + Дробь(Строка.ДоляПлощади) + ", ";
			КонецЕсли;
			НовыйДБФ.ROD_OT = Доля + РодОтношение; 
		КонецЕсли;
		
		НовыйДБФ.Записать();
	КонецЦикла;
	
	НовыйДБФ.ЗакрытьФайл();
	
	ПереместитьФайл(ФайлПроживающиеРегионГазВр, ФайлПроживающиеРегионГаз);	

КонецПроцедуры

Функция СоздатьПустойДБФПроживающиеРегионГаз()
	
	//ошибка при превышении длины имени файла
	ФайлПроживающиеРегионГазВр = КаталогВременныхФайлов() + "new.dbf";
	
	ДБФ = Новый XBase;
	ДБФ.Кодировка = КодировкаXBase.OEM;
	ДБФ.Поля.Добавить("PRIZ", "S", 1);
	ДБФ.Поля.Добавить("LS", "F", 11, 0);
	ДБФ.Поля.Добавить("ULICA", "S", 30);
	ДБФ.Поля.Добавить("DOM", "S", 5);
	ДБФ.Поля.Добавить("KORP", "S", 4);	
	ДБФ.Поля.Добавить("KVART", "S", 30);
	ДБФ.Поля.Добавить("CHLEN", "N", 2);
	ДБФ.Поля.Добавить("PLOSH", "F", 5, 2);
	ДБФ.Поля.Добавить("LGOT", "N", 2);
	ДБФ.Поля.Добавить("FAM", "S", 30);
	ДБФ.Поля.Добавить("IM", "S", 15);
	ДБФ.Поля.Добавить("OTCH", "S", 15);
	ДБФ.Поля.Добавить("DAT_R", "D", 8);
	ДБФ.Поля.Добавить("DAT_REG", "D", 8);
	ДБФ.Поля.Добавить("DAT_UNREG", "D", 8);
	ДБФ.Поля.Добавить("VID_REG", "S", 15);
	ДБФ.Поля.Добавить("ROD_OT", "S", 15);
	ДБФ.Поля.Добавить("NAIM_LG", "S", 30);
	ДБФ.Поля.Добавить("DAT_REG_LG", "D", 8);
	ДБФ.Поля.Добавить("LGOT_DOC", "S", 50);

	ДБФ.СоздатьФайл(ФайлПроживающиеРегионГазВр);
	
	Возврат ДБФ;

КонецФункции

Функция ТекстЗапросаПроживающиеРегионГаз()

	Текст = "ВЫБРАТЬ
	        |	бит_СписокЗданий.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_Здания
	        |ИЗ
	        |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ЛС
	        |ИЗ
	        |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	        |ГДЕ
	        |	бит_ЛицевыеСчета.Здание В
	        |			(ВЫБРАТЬ
	        |				ВТ_Здания.Ссылка
	        |			ИЗ
	        |				ВТ_Здания КАК ВТ_Здания)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК K_FAKT
	        |ПОМЕСТИТЬ ВТ_Проживающие
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |				&ПериодК,
	        |				ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)
	        |					И СтатусПроживания В (ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно), ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно))) КАК бит_ПроживающиеПоЛССрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК S
	        |ПОМЕСТИТЬ ВТ_ПлощадьКвартиры
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ПериодК, ) КАК бит_СведенияОКвартиреСрезПоследних
	        |		ПО ВТ_ЛС.Ссылка.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	        |	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	        |	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	        |	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	        |	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	        |	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	        |	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры КАК ВладелецКвартиры
	        |ПОМЕСТИТЬ ВТ_ФЛ
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |				&ПериодК,
	        |				ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЛС.Ссылка
	        |					ИЗ
	        |						ВТ_ЛС КАК ВТ_ЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК K_SOB
	        |ПОМЕСТИТЬ ВТ_Собственники
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	        |				&ПериодК,
	        |				ЛицевойСчет В
	        |						(ВЫБРАТЬ
	        |							ВТ_ЛС.Ссылка
	        |						ИЗ
	        |							ВТ_ЛС КАК ВТ_ЛС)
	        |					И ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)) КАК бит_ПроживающиеПоЛССрезПоследних
	        |		ПО ВТ_ЛС.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ЛС.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЛС.Ссылка КАК Ссылка,
	        |	ВТ_ФЛ.ФизЛицо КАК ФизЛицо,
	        |	ВТ_ФЛ.ДатаРегистрации КАК DAT_REG,
	        |	ВТ_ФЛ.ДатаСнятияСРегистрации КАК DAT_UNREG,
	        |	ВТ_ФЛ.ДоляПлощади КАК ДоляПлощади,
	        |	ВЫБОР
	        |		КОГДА ВТ_ФЛ.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК PR_KV,
	        |	ВТ_ПлощадьКвартиры.S КАК PLOSH,
	        |	ВТ_Проживающие.K_FAKT КАК CHLEN,
	        |	ВТ_ФЛ.СтепеньРодства КАК СтепеньРодства,
	        |	ВТ_ФЛ.ФизЛицо.ДатаРождения КАК DAT_R,
	        |	ПРЕДСТАВЛЕНИЕ(ВТ_ЛС.Ссылка.Здание.Улица) КАК Улица,
	        |	ВТ_ЛС.Ссылка.Здание.НомерДома КАК НомерДома,
	        |	ВТ_ЛС.Ссылка.Здание.ПрефиксДома КАК ПрефиксДома,
	        |	ВТ_ЛС.Ссылка.Здание.Корпус КАК KORP,
	        |	ВЫБОР
	        |		КОГДА ВТ_ФЛ.ДатаРегистрации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	        |				И ВТ_ФЛ.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	        |			ТОГДА ""Не прописан""
	        |		КОГДА НЕ ВТ_ФЛ.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	        |			ТОГДА ""Выписан""
	        |		КОГДА ВТ_ФЛ.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно)
	        |			ТОГДА ""Постоянно""
	        |		КОГДА ВТ_ФЛ.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)
	        |			ТОГДА ""Временно""
	        |		ИНАЧЕ ""Не прописан""
	        |	КОНЕЦ КАК VID_REG,
	        |	ВЫБОР
	        |		КОГДА ВТ_ФЛ.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ВладелецКвартиры,
	        |	ВТ_Собственники.K_SOB КАК K_SOB
	        |ИЗ
	        |	ВТ_ЛС КАК ВТ_ЛС
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФЛ КАК ВТ_ФЛ
	        |		ПО ВТ_ЛС.Ссылка = ВТ_ФЛ.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проживающие КАК ВТ_Проживающие
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Проживающие.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадьКвартиры КАК ВТ_ПлощадьКвартиры
	        |		ПО ВТ_ЛС.Ссылка = ВТ_ПлощадьКвартиры.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Собственники КАК ВТ_Собственники
	        |		ПО ВТ_ЛС.Ссылка = ВТ_Собственники.Ссылка";
	
	Возврат Текст;

КонецФункции

Функция АдресПоЛСМассивПодробно(ЛС, Здание)
	
	Результат = Новый Массив;
	
	Улица = "";
	Дом = "";
	Корпус = "";
	Квартира = "";
	
	Если ЗначениеЗаполнено(Здание.Улица.ТипУлицы) Тогда
		Улица = Улица + Строка(Здание.Улица.ТипУлицы)
	КонецЕсли;

	Если ЗначениеЗаполнено(Здание.Улица) Тогда
		Улица = Улица + Строка(Здание.Улица)
	КонецЕсли;
	
	Дом = Дом + "д." + Строка(Здание.НомерДома);
	
	Результат.Добавить(Улица + ", " + Дом);
	
	Если ЗначениеЗаполнено(Здание.ПрефиксДома) Тогда
		Дом = Дом + Здание.ПрефиксДома 	
	КонецЕсли;
	
	Результат.Добавить(Дом);

	Если ЗначениеЗаполнено(Здание.Корпус) Тогда
		Корпус = Корпус + "кор. " + Здание.Корпус 	
	КонецЕсли;
	
	Результат.Добавить(Корпус);
	
	Квартира = ЛС.Квартира.Наименование;
	
	НомерПозиции = СтрНайти(Квартира, "=");
	
	Если НомерПозиции <> 0 Тогда
		НомерКвартиры = Лев(НомерКвартиры, НомерПозиции - 1)
	КонецЕсли;
	
	Результат.Добавить(Квартира);
	
	Возврат Результат;

КонецФункции // АдресПоЛС()


