
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// БИТ_ЖКХ_23012014_начало_изменений
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Ссылка = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	
	Для Каждого Эл Из Список.Отбор.Элементы Цикл
		
		Если Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизЛицо") Тогда
			
			Если Эл.Использование = Истина Тогда
				
				Ссылка = Эл.ПравоеЗначение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "СвидетельствоОСмерти"), Ссылка);
	
КонецПроцедуры
// БИТ_ЖКХ_23012014_окончание_изменений

#КонецОбласти