
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Если Объект.ВводВРучную Тогда
		
		Элементы.СписокУслугСуммаПени.Видимость      = Истина;
		Элементы.СписокУслугУслуга.ТолькоПросмотр    = Ложь;
		Элементы.СписокУслугСумма.ТолькоПросмотр     = Ложь;
		Элементы.СписокУслугСуммаПени.ТолькоПросмотр = Ложь;
		Элементы.СписокУслугДобавить.Доступность     = Истина;
		Элементы.СписокУслугУдалить.Доступность      = Истина;
		Элементы.Группа5.Видимость                   = Истина;
		
	Иначе
		
		Элементы.СписокУслугСуммаПени.Видимость      = Ложь;
		Элементы.СписокУслугУслуга.ТолькоПросмотр    = Истина;
		Элементы.СписокУслугСумма.ТолькоПросмотр     = Истина;
		Элементы.СписокУслугСуммаПени.ТолькоПросмотр = Истина;
		Элементы.СписокУслугДобавить.Доступность     = Ложь;
		Элементы.СписокУслугУдалить.Доступность      = Ложь;
		Элементы.Группа5.Видимость                   = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает видимость колонок табличной части.
//
&НаКлиенте
Процедура УправлениеВидимостьюКолонок(ТекСтрока)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ЛицевойСчет"    , ?(ТекСтрока <> Неопределено, ТекСтрока.ЛицевойСчет    , Неопределено));
	Отбор.Вставить("ШаблонИзвещений", ?(ТекСтрока <> Неопределено, ТекСтрока.ШаблонИзвещений, Неопределено));
	
	МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
	
	Итог = 0;
	
	Для каждого Строка Из МассивСтрок Цикл
		
		Итог = Итог + Строка.СуммаПени;
		
	КонецЦикла;
	
	Элементы.СписокУслугСуммаПени.Видимость = ?(Итог <> 0 ИЛИ Объект.ВводВРучную, Истина, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоШтрихкодом

&НаКлиенте
Процедура СканерШтрихкодаПриИзменении(Элемент)
	
	
	Состояние("Подключается сканер штрихкода...");	
	
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьСканерШКЗавершение", ЭтотОбъект, Новый Структура("Форма", ЭтаФорма));
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьСканерШКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	СканерШтрихкода = РезультатВыполнения.Результат;
	Если СканерШтрихкода Тогда
		Элементы.СканерШтрихкода.ТолькоПросмотр = Истина;
		Состояние("Сканер штрихкода подключен");
	Иначе
		Состояние("Сканер штрихкода не подключен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция бит_ОбработатьСобытиеСШК(Клиент, ШК)
	
	Результат = Неопределено;
	
	Если ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ОплатаКУ") ИЛИ 
		ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ЧекККМ") ИЛИ 
		ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_РазовыеПоУслугамЖКХ") Тогда
	Иначе
		возврат Результат;
	КонецЕсли;
	
	ДлинаШК = СтрДлина(ШК);
	
	ЧекККМ = ПредопределенноеЗначение("Документ.бит_ЧекККМ.ПустаяСсылка");
	
	Если ДлинаШК > 37 Тогда
		
		СтрокаСумма = Лев(ШК,40);
		
		Если ДлинаШК > 43 Тогда
			СтрокаСумма = Сред(ШК,6,40);
		КонецЕсли; 
		
		КонтрольнаяСумма = 0;
		Для Значение = 1 по СтрДлина(СтрокаСумма)-1 Цикл
			КонтрольнаяСумма = КонтрольнаяСумма +  Число(Лев(СтрокаСумма,Значение))*33;
		КонецЦикла;
		КонтрольнаяСумма = КонтрольнаяСумма%1000;
		
		СуммаДляПроверки = Число(Прав(ШК, ДлинаШК- 40));
		Если ДлинаШК > 43 Тогда
			СуммаДляПроверки = Число(Прав(ШК, ДлинаШК- 45));
		КонецЕсли; 
		
		Если СуммаДляПроверки <> КонтрольнаяСумма тогда
			Возврат "Не правильно считан штрихкод!!!";
		КонецЕсли;
		
		РезШК = бит_РазберемШтрихКодИД(ШК);
		НаименованиеЛС	= РезШК.НаименованиеЛС;
		КодШаблона		= РезШК.КодШаблона;
		СуммаЦелых		= РезШК.СуммаЦелых;
		
	ИначеЕсли ДлинаШК = 13 Тогда
		
		ЧекККМ = ЧекККМНаСервере(ШК);
		
	ИначеЕсли ДлинаШК = 37 Тогда
		
		СтрокаСумма = Лев(ШК,34);
		КонтрольнаяСумма = 0;
		Для Значение = 1 по СтрДлина(СтрокаСумма)-1 Цикл
			КонтрольнаяСумма = КонтрольнаяСумма +  Число(Лев(СтрокаСумма,Значение))*33;
		КонецЦикла;
		КонтрольнаяСумма = КонтрольнаяСумма%1000;
		СуммаДляПроверки = Число(Прав(ШК, СтрДлина(ШК)-34));
		Если СуммаДляПроверки <> КонтрольнаяСумма тогда
			Возврат "Не правильно считан штрихкод!!!";
		КонецЕсли;
		
		РезШК = бит_РазберемШтрихКод(ШК);
		НаименованиеЛС	= РезШК.НаименованиеЛС;
		КодШаблона		= РезШК.КодШаблона;
		СуммаЦелых		= РезШК.СуммаЦелых;
		
	Иначе
		
		Возврат "Считанный штрих код не распознан!!!";
		
	КонецЕсли; 
	
	Если ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ОплатаКУ") Тогда
		
		МассивСтрок = Клиент.СписокЛС.НайтиСтроки(новый Структура("ЛицевойСчет",НаименованиеЛС));
		
		Если МассивСтрок.Количество() = 0 тогда	 
			
			мСтруктураСчетовЖКХ  = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Клиент.Организация,КонецМесяца(Клиент.Дата));
			НоваяСтрока = Объект.СписокЛС.добавить();
			НоваяСтрока.ЛицевойСчет = НаименованиеЛС;
			НоваяСтрока.ШаблонИзвещений = КодШаблона;
			НоваяСтрока.Сумма = СуммаЦелых;
			НоваяСтрока.СчетАбонента = мСтруктураСчетовЖКХ.СчетАбонента;
			СтрокаСубконта = НоваяСтрока.СчетАбонента.ВидыСубконто.Найти(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета"), "ВидСубконто");
			Если Не СтрокаСубконта = Неопределено тогда
				НоваяСтрока["Субконто"+СтрокаСубконта.НомерСтроки] = НоваяСтрока.ЛицевойСчет;
			КонецЕсли;	
			НоваяСтрока.СчетКУ = мСтруктураСчетовЖКХ.ТранзитныйСчетОплаты;
			
		КонецЕсли;	 
		
		Возврат Результат;
		
	ИначеЕсли ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_ЧекККМ") Тогда
		
		Клиент.ЛицевойСчет     = НаименованиеЛС;
		Клиент.ШаблонИзвещений = КодШаблона;
		Клиент.СуммаОплаты     = СуммаЦелых;
		Клиент.ШтрихКОд        = ШК;
		
		Возврат Результат;
		
	ИначеЕсли ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_РазовыеПоУслугамЖКХ") Тогда
		
		Клиент.ЧекККМ = ЧекККМ;
		
		Возврат Результат;
		
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ЧекККМНаСервере(ШК)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЧекККМ.Ссылка
	|ИЗ
	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
	|ГДЕ
	|	бит_ЧекККМ.ШтрихКодФР = &ШтрихКодФР";
	Запрос.УстановитьПараметр("ШтрихКодФР", ШК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЧекККМ = Выборка.Ссылка;
		
	КонецЕсли;	
	
	Возврат ЧекККМ;	
	
КонецФункции

// Функция разбора штрих кода.
//
&НаСервере
Функция бит_РазберемШтрихКодИД(ШК)
	
	Рез = Новый Структура("НаименованиеЛС, КодШаблона, СуммаЦелых");
	СтрокаСумма = Лев(ШК,40);
	
	Если СтрДлина(ШК) > 43 Тогда
		
		СтрокаСумма = Сред(ШК,6,40);
		
	КонецЕсли; 
	
	// Код шаблона извещения (9 символов).
	КодШаблона = "";
	// Для к = 11 по 19 Цикл.
	Для Значение = 13 по 21 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		КодШаблона = КодШаблона + СимволСтроки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ШаблоныИзвещений.Ссылка
	|ИЗ
	|	Справочник.бит_ШаблоныИзвещений КАК бит_ШаблоныИзвещений
	|ГДЕ
	|	(бит_ШаблоныИзвещений.Код = &Код
	|			ИЛИ бит_ШаблоныИзвещений.Идентификатор = &Код)";
	Запрос.УстановитьПараметр("Код",КодШаблона);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Рез.КодШаблона = Выборка.Ссылка;	
	Иначе 
		Рез.КодШаблона = Справочники.бит_ШаблоныИзвещений.ПустаяСсылка();	
	КонецЕсли;
	
	ИД = "";
	ПерваяУжеБылаНеНоль = Ложь;
	
	Для Значение = 22 По 27 Цикл
		
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		Если СимволСтроки = "0" тогда	
			Если ПерваяУжеБылаНеНоль тогда
				ИД = ИД + СимволСтроки;
				ПерваяУжеБылаНеНоль =  Истина;
			КонецЕсли;	
		иначе	 
			ИД = ИД + СимволСтроки;
			ПерваяУжеБылаНеНоль =  Истина;
		КонецЕсли;
		
	КонецЦикла; 
	
	ИД = Число(ИД);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор",ИД);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Рез.НаименованиеЛС = Выборка.Ссылка;	
	Иначе 
		Рез.НаименованиеЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();	
	КонецЕсли;
	
	СуммаЦелых = "";
	
	// Целая часть суммы (было 13, сделали 11 символов).
	// Для к = 20 по 32 Цикл.
	Для Значение = 28 по 38 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	СуммаЦелых = СуммаЦелых + ",";
	
	// Дробная часть суммы (два знака после запятой).
	Для Значение = 39 по 40 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	
	Рез.СуммаЦелых = Число(СуммаЦелых);
	
	возврат Рез;
	
КонецФункции

// Разберем штрих код.
&НаКлиенте
Функция бит_РазберемШтрихКод(ШК)
	
	Рез = Новый Структура("НаименованиеЛС, КодШаблона, СуммаЦелых");
	СтрокаСумма = Лев(ШК,34);
	
	НаименованиеЛС = "";
	ПерваяУжеБылаНеНоль = Ложь; 
	
	СтрокаРазбора = СокрЛП(Лев(СтрокаСумма,12));
	ДлинаСтроки = СтрДлина(СтрокаРазбора);
	
	СписокЛС = Новый СписокЗначений;
	
	Для Значение = 1  По 12 Цикл
		
		// ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(СтрокаРазбора, Истина);.
		ЛицевойСчет = НайтиЛС(СтрокаРазбора);
		
		Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
			
			СписокЛС.Добавить(ЛицевойСчет);
			
		КонецЕсли; 
		
		Если Лев(СтрокаРазбора, 1)="0" Тогда
			ДлинаСтроки =  ДлинаСтроки - 1;
			СтрокаРазбора = СокрЛП(Прав(СтрокаРазбора,ДлинаСтроки));
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если СписокЛС.Количество() > 1 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма);
		СписокЛС.ПоказатьВыборЭлемента(Оповещение, "Пожалуйста выберете лицевой счет.");
		
		Рез.НаименованиеЛС = мКэшЗначений.ВыбЗначение;
		
	ИначеЕсли СписокЛС.Количество() > 0 Тогда 
		
		Рез.НаименованиеЛС = СписокЛС[0].Значение;
		
	КонецЕсли; 
	
	// Код шаблона извещения (9 символов).
	КодШаблона = "";
	// Для к = 11 по 19 Цикл.
	Для Значение = 13 по 21 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		КодШаблона = КодШаблона + СимволСтроки;
	КонецЦикла;
	
	Рез.КодШаблона = КодШаблонаНаСервере(КодШаблона);
		
	СуммаЦелых = "";
	
	// Целая часть суммы (было 13, сделали 11 символов).
	// Для к = 20 по 32 Цикл.
	Для Значение = 22 по 32 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	СуммаЦелых = СуммаЦелых + ",";
	
	// Дробная часть суммы (два знака после запятой).
	Для Значение = 33 по 34 Цикл
		СимволСтроки = Прав(Лев(СтрокаСумма,Значение),1);
		СуммаЦелых = СуммаЦелых + СимволСтроки;
	КонецЦикла;
	
	Рез.СуммаЦелых = Число(СуммаЦелых);
	
	возврат Рез;
	
КонецФункции

&НаСервере
Функция КодШаблонаНаСервере(КодШаблона)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ШаблоныИзвещений.Ссылка
	|ИЗ
	|	Справочник.бит_ШаблоныИзвещений КАК бит_ШаблоныИзвещений
	|ГДЕ
	|	(бит_ШаблоныИзвещений.Код = &Код
	|			ИЛИ бит_ШаблоныИзвещений.Идентификатор = &Код)";
	Запрос.УстановитьПараметр("Код",КодШаблона);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		КодШаблона = Выборка.Ссылка;	
	Иначе 
		КодШаблона = Справочники.бит_ШаблоныИзвещений.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат КодШаблона;
	
КонецФункции

&НаКлиенте
Функция ПослеВыбораЭлемента(ВыбЭлемент, Параметры) Экспорт
	Если ВыбЭлемент = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбран лицевой счет.";
		Сообщение.Сообщить();
		
	Иначе
		ВыбЗначение = ВыбЭлемент.Значение;
	КонецЕсли;
	
	мКэшЗначений.ВыбЗначение = ВыбЗначение;
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
	Элементы.ПериодОплаты.Видимость = Объект.ОплатаПоПериоду;
	ПериодОплаты.ДатаНачала	   = Объект.НачалоПериодаОплаты;
	ПериодОплаты.ДатаОкончания = Объект.КонецПериодаОплаты;
	
	//БИТ ЖКХ 08.09.2020
	УстановленнаяРабочаяДата = ОбщегоНазначения.РабочаяДатаПользователя();
	если ЗначениеЗаполнено(УстановленнаяРабочаяДата) = истина тогда
	 Объект.Дата = УстановленнаяРабочаяДата;
	конецесли;
	
	Если Объект.ОплатаПоПериоду Тогда
		НовыйПараметрСальдо = Новый ПараметрВыбора("Отбор.Сальдо", ПредопределенноеЗначение("Перечисление.ДаНет.Нет"));
		НовыйПараметрКредит = Новый ПараметрВыбора("Отбор.Кредит", ПредопределенноеЗначение("Перечисление.ДаНет.Нет"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСальдо);
		НовыйМассив.Добавить(НовыйПараметрКредит);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СписокЛСШаблонИзвещений.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	// Установить доступность формы с учетом даты запрета редактирования.
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	Если мТаблицаНачисленийПени = Неопределено И Объект.СписокЛС.Количество() > 0 Тогда
		
		ПолучитьНачисленияПениНаСервере();
		
	КонецЕсли; 
	
	// Установить доступность формы с учетом даты запрета редактирования.
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	мСтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Объект.Организация,КонецМесяца(Объект.Дата));
	
	мКэшЗначений.Вставить("мСтруктураСчетовЖКХ", мСтруктураСчетовЖКХ);
	
	УправлениеЭлементамиФормы();
	
	ОбновитьДанныеКолонкиАдрес();
	
	ОбновитьДанныеКолонкиОтветственный();
	
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НЕ ИнтерфейсТакси Тогда
		
		Элементы.Группа4.Высота = 0;
		Элементы.Группа4.РастягиватьПоВертикали = Истина; 
		
		Элементы.ГруппаСписокЛС.Высота = 0;
		Элементы.ГруппаСписокЛС.РастягиватьПоВертикали = Истина; 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если Объект.Проведен Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли; 
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая" Тогда
		
		ТаблицаЛСНаСервере(ВыбранноеЗначение.АдресЛСВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.Проведен
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ДокументРассчитан = Ложь
		И мКэшЗначений.мНеРаспределятьОплатуПослеВводаСуммы Тогда
		
		ВыполнитьРасчетНаСервере();
		УдалитьПустыеСтрокиНаСервере();
		ОбновитьДанныеКолонкиАдрес();
		ОбновитьДанныеКолонкиОтветственный();
		Элементы.СписокУслугСуммаПени.Видимость = ?(Объект.СписокУслуг.Итог("СуммаПени") <> 0 ИЛИ Объект.ВводВРучную, Истина, Ложь);
		
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.СписокЛС.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "Штрихкод" Тогда
		
		Попытка
			
			Массив=МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(,,МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
			
			Для Каждого Стр из Массив Цикл
				Если Стр.ТипОборудования=ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СканерШтрихкода") Тогда
					
					Результат = бит_ОбработатьСобытиеСШК(Объект, Данные);
					
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			
		КонецПопытки;
		
		Если НЕ мКэшЗначений.мНеРаспределятьОплатуПослеВводаСуммы Тогда
			ВыполнитьРасчетНаСервере();
		Иначе	
			ДокументРассчитан = Ложь;
		КонецЕсли; 
		
		ЗаполнитьСчетаНаСервере();
		
	КонецЕсли;
	
	ОбновитьДанныеКолонкиАдрес();
	
	ОбновитьДанныеКолонкиОтветственный();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПоПериодуПриИзменении(Элемент)
	
	Элементы.ПериодОплаты.Видимость = Объект.ОплатаПоПериоду;
	ПериодОплаты.ДатаНачала	   = Дата('00010101');
	ПериодОплаты.ДатаОкончания = Дата('00010101');
	Объект.НачалоПериодаОплаты = Дата('00010101');
	Объект.КонецПериодаОплаты  = Дата('00010101');
	
	Если Объект.ОплатаПоПериоду И Объект.СписокУслугПоПериоду.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Выполнить установку шаблона ""По всем за месяц (Период)"" для всех ЛС?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ОплатаПоПериодуЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	Объект.СписокУслуг.Очистить();
	//Объект.СписокУслугПоПериоду.Очистить();
	
	
	// Настрока параметров выбора.
	Если Объект.ОплатаПоПериоду Тогда
		НовыйПараметрСальдо = Новый ПараметрВыбора("Отбор.Сальдо", ПредопределенноеЗначение("Перечисление.ДаНет.Нет"));
		НовыйПараметрКредит = Новый ПараметрВыбора("Отбор.Кредит", ПредопределенноеЗначение("Перечисление.ДаНет.Нет"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСальдо);
		НовыйМассив.Добавить(НовыйПараметрКредит);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СписокЛСШаблонИзвещений.ПараметрыВыбора = НовыеПараметры;
	Иначе
		НовыйМассив = Новый Массив();
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СписокЛСШаблонИзвещений.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПоПериодуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из Объект.СписокЛС Цикл
		Строка.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемЗаМесяц");	
	КонецЦикла; 
	
	Элементы.ПериодОплаты.Видимость = Объект.ОплатаПоПериоду;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если СканерШтрихкода Тогда
		ТипыПО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода");
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ОтключитьСканерШКЗавершение", ЭтотОбъект, Новый Структура("Форма", ЭтаФорма));
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ТипыПО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканерШКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При отключении оборудования произошла ошибка: ""%1"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		СканерШтрихкода = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СканерШтрихкода И ЗавершениеРаботы Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , КонецДня(Объект.Дата));
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	РассчитатьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеПениПоЛицевымСчетам(Команда)
	
	Документ = НайтиДокументНачислениеПениПоЛицевымСчетамНаСервере();

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачислятьПени"                , Ложь);
	СтруктураПараметров.Вставить("НачислятьПениСУчетомПереплаты", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Объект.Дата, Объект.Организация, СтруктураПараметров);
	
	Если Документ <> Неопределено  Тогда
		Если Объект.Проведен = Истина Тогда
			Если СтруктураПараметров.НачислятьПени Тогда
				
				Если Документ = ПредопределенноеЗначение("Документ.бит_НачислениеПениПоЛицевымСчетам.ПустаяСсылка") Тогда
					
					ПараметрыФормы = Новый Структура;
					
					ПараметрыФормы.Вставить("Организация",     Объект.Организация);
					ПараметрыФормы.Вставить("Дата",            Объект.Дата);
					ПараметрыФормы.Вставить("ДокОснование",    Объект.Ссылка);
					ПараметрыФормы.Вставить("ЗакрытиеПериода", Ложь);
					
					ОткрытьФорму("Документ.бит_НачислениеПениПоЛицевымСчетам.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаНачислениеПениПоЛицевымСчетам, Ключ", ПараметрыФормы, Неопределено), ЭтаФорма);
					
				Иначе
					
					ПараметрыФормы = Новый Структура;
					
					ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
					
					ОткрытьФорму("Документ.бит_НачислениеПениПоЛицевымСчетам.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаНачислениеПениПоЛицевымСчетам, Ключ", ПараметрыФормы, Документ), ЭтаФорма);
					
				КонецЕсли;
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В настройках начисление пени для данного периода этой организации отключено!!!";
				Сообщение.Сообщить();
				
			КонецЕсли;
		Иначе
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Проведите документ для создания документа НачислениеПениПоЛицевымСчетам";
			Сообщение.Сообщить();
			
		КонецЕсли;
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Проведите документ для создания документа НачислениеПениПоЛицевымСчетам";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеНаРасчетныйСчет(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ДокументОплаты",          Объект.Ссылка);
	ПараметрыФормы.Вставить("ИсточникОплаты",          Объект.ИсточникОплаты);
	ПараметрыФормы.Вставить("Организация",             Объект.Организация);
	ПараметрыФормы.Вставить("БанковскийСчет",          ЗначениеРеквизитаНаСервере(Объект.Организация, "ОсновнойБанковскийСчет"));
	ПараметрыФормы.Вставить("СуммаДокумента",          Объект.СуммаДокумента);
	ПараметрыФормы.Вставить("РазбиватьПоЛицевымСчетам", Ложь);
	
	ОткрытьФорму("Обработка.бит_ВводПКО.Форма.ФормаУправляемая", Новый Структура("ЗаполнитьИзДокументаПоступлениеНаРасчетныйСчет", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриходныйКассовыйОрдер(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ДокументОплаты",          Объект.Ссылка);
	ПараметрыФормы.Вставить("ИсточникОплаты",          Объект.ИсточникОплаты);
	ПараметрыФормы.Вставить("Организация",             Объект.Организация);
	ПараметрыФормы.Вставить("БанковскийСчет",          ЗначениеРеквизитаНаСервере(Объект.Организация, "ОсновнойБанковскийСчет"));
	ПараметрыФормы.Вставить("СуммаДокумента",          Объект.СуммаДокумента);
	ПараметрыФормы.Вставить("РазбиватьПоЛицевымСчетам", Ложь);
	
	ОткрытьФорму("Обработка.бит_ВводПКО.Форма.ФормаУправляемая", Новый Структура("ЗаполнитьИзДокументаПриходныйКассовыйОрдер", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОплатыПоПоставщикам(Команда)
	
	Документ = НайтиДокументРаспределениеОплатыПоПоставщикамНаСервере();
	
	Если Документ = ПредопределенноеЗначение("Документ.бит_РаспределениеОплатыПоПоставщикам.ПустаяСсылка") Тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Организация"      , Объект.Организация);
		ПараметрыФормы.Вставить("Дата"             , Объект.Дата);
		ПараметрыФормы.Вставить("ДокументОснование", Объект.Ссылка);
		ПараметрыФормы.Вставить("ЗакрытиеПериода"  , Ложь);
		
		ОткрытьФорму("Документ.бит_РаспределениеОплатыПоПоставщикам.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаОплатаКУ", ПараметрыФормы), ЭтаФорма);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ДокументОснование", Объект.Ссылка);
		ПараметрыФормы.Вставить("Организация"      , Объект.Организация);
		ПараметрыФормы.Вставить("Дата"             , Объект.Дата);
		
		ОткрытьФорму("Документ.бит_РаспределениеОплатыПоПоставщикам.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаОплатаКУ, Ключ", ПараметрыФормы, Документ), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьШаблонИзвещений(Команда)
	
	Если Объект.Проведен Тогда
		ТекстСообщения = НСтр("ru = 'Перед выбором шаблона - распроведите документ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ШаблонИзвещенийВыборЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.бит_ШаблоныИзвещений.Форма.ФормаВыбораУправляемая",,ЭтотОбъект,,,,Оповещение);
		
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИзвещенийВыборЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ТекстВопроса = СтрШаблон(
							НСтр("ru = 'Установить текущий шаблон извещений: ""%1"" для всех?'"),
							РезультатВыбора);
		Оповещение = Новый ОписаниеОповещения("ШаблонИзвещенийПроставитьЗавершение", ЭтотОбъект, Новый Структура("РезультатВыбора",РезультатВыбора));					
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не задан Шаблон извещений.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИзвещенийПроставитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Для каждого Строка Из Объект.СписокЛС Цикл
			Строка.ШаблонИзвещений = ДополнительныеПараметры.РезультатВыбора;	
		КонецЦикла; 
	КонецЕсли;
	
	РассчитатьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПлатежнойКартой(Команда)

	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ДокументОплаты",          Объект.Ссылка);
	ПараметрыФормы.Вставить("ИсточникОплаты",          Объект.ИсточникОплаты);
	ПараметрыФормы.Вставить("Организация",             Объект.Организация);
	ПараметрыФормы.Вставить("БанковскийСчет",          ЗначениеРеквизитаНаСервере(Объект.Организация, "ОсновнойБанковскийСчет"));
	ПараметрыФормы.Вставить("СуммаДокумента",          Объект.СуммаДокумента);
	ПараметрыФормы.Вставить("РазбиватьПоЛицевымСчетам", Ложь);
	
	ОткрытьФорму("Обработка.бит_ВводПКО.Форма.ФормаУправляемая", Новый Структура("ЗаполнитьИзДокументаОплатаПлатежнойКартой", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	мКэшЗначений.мТекущаяДатаДокумента = Объект.Дата; // Запомним текущую дату документа для контроля номера документа.
	
КонецПроцедуры

&НаКлиенте
Процедура ВводВРучнуюПриИзменении(Элемент)
	
	Если Объект.Проведен Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед вводом оплаты в ручную - распроведите документ.";
		Сообщение.Сообщить();
		
		Объект.ВводВРучную = мКэшЗначений.мВводВручную;
		
		Модифицированность = Ложь;
		
		Возврат;
		
	КонецЕсли; 
	
	ЗаполнениеТаблицыУслуг();
	УправлениеЭлементамиФормы();
	
	Объект.СписокУслуг.Сортировать("Приоритет Возр");
	
	ОбновитьНадписьНаФорме();
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
	мКэшЗначений.мВводВручную = Объект.ВводВРучную;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.СписокЛС.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ОрганизацияПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Организация = мКэшЗначений.мОрганизация;
		
		Возврат;
		
	КонецЕсли;
	
	Объект.СписокЛС.Очистить();
	Объект.СписокУслуг.Очистить();
	//Объект.СписокУслугПоПериоду.Очистить();
	ОрганизацияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииФрагмент()
	
	мКэшЗначений.мСтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Объект.Организация, КонецМесяца(Объект.Дата));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОплатыПриИзменении(Элемент)
	
	ЗаполнитьСчетаНаСервере();
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокТипов = ПолучитьСписокТиповНаСервере(Элемент.Имя);
	
	ВыбранныйЭлемент = Неопределено;
	
	ЭтаФорма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ИсточникОплатыНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокТипов, Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОплатыНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	ОчиститьСообщения();
	
	Если ВыбранныйЭлемент = Неопределено Тогда // Отказ от выбора.
		
		Возврат;
		
	КонецЕсли;
	
	ВыбранныйТип = ВыбранныйЭлемент.Значение;
	Если ВыбранныйТип  = "бит_КассыККМ" Тогда
		
		ТипСправочника    = ПолучитьТипСправочникаНаСервере(ВыбранныйТип);
		ОстатокТипа       = СокрЛП(Сред(ТипСправочника,20));
		СтрокаСправочника = "Справочник."+ОстатокТипа+".Форма.ФормаВыбораУправляемая";
		Структура = Новый Структура;
		Структура.Вставить("Организация",Объект.Организация);
		ОткрытьФорму(СтрокаСправочника,Новый Структура("ЗаполнитьИзОплатыКУ",Структура) ,Элемент);
		
	Иначе	
		ТипСправочника    = ПолучитьТипСправочникаНаСервере(ВыбранныйТип);
		ОстатокТипа       = СокрЛП(Сред(ТипСправочника,20));
		СтрокаСправочника = "Справочник."+ОстатокТипа+".Форма.ФормаВыбора";
		
		ОткрытьФорму(СтрокаСправочника, ,Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура СписокЛСПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		УстановитьОтборСписокУслуг(ТекСтрока);
		
	КонецЕсли;
	
	УправлениеВидимостьюКолонок(ТекСтрока);
	//+=Анисимова МВ восстановление базы 08.11.2024
	
	Если ТекСтрока <> Неопределено Тогда
		
		мКэшЗначений.мЛицевойСчет     = ТекСтрока.ЛицевойСчет;
		мКэшЗначений.мШаблонИзвещений = ТекСтрока.ШаблонИзвещений;
		мКэшЗначений.мСумма           = ТекСтрока.Сумма;
		//мКэшЗначений.лб_КлючСтроки     = ТекСтрока.лб_КлючСтроки;
	КонецЕсли;
	//--Анисимова МВ восстановление базы 08.11.2024
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Объект.Проведен Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если Объект.ВводВРучную Тогда
		
		Отказ = Копирование;
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		мКэшЗначений.мЛицевойСчет     = ТекДанные.ЛицевойСчет;
		мКэшЗначений.мШаблонИзвещений = ТекДанные.ШаблонИзвещений;
		мКэшЗначений.мСумма           = ТекДанные.Сумма;
		мКэшЗначений.лб_КлючСтроки     = ТекДанные.лб_КлючСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПередУдалением(Элемент, Отказ)
	
	Если Объект.Проведен Тогда
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("ЛицевойСчет"    , ТекСтрока.ЛицевойСчет);
		Отбор.Вставить("ШаблонИзвещений", ТекСтрока.ШаблонИзвещений);
		
		МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
		
		Для каждого Строка Из МассивСтрок Цикл
			
			Объект.СписокУслуг.Удалить(Строка);
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	мКэшЗначений.мТекущийЛицевойСчет = ТекСтрока.ЛицевойСчет;
	
	Если НоваяСтрока 
		И НЕ Копирование 
		И НЕ Объект.ОплатаПоПериоду Тогда
		ТекСтрока.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам");
	ИначеЕсли НоваяСтрока
		И НЕ Копирование 
		И Объект.ОплатаПоПериоду Тогда
		ТекСтрока.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемЗаМесяц");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ТекСтрока = Элемент.ТекущиеДанные;
		
		ПриИзмененииВСтроке(Объект.СписокЛС.Индекс(ТекСтрока));
	Иначе
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СписокЛСПриОкончанииРедактированияЗавершение", ЭтотОбъект), "Разверните окно формы");
		
	КонецЕсли;
	
	Если Объект.ВводВРучную Тогда
		
		Если НЕ ТекСтрока = Неопределено Тогда
			
			ЗаполнитьСписокУслугПоШаблону(ТекСтрока);
			УстановитьОтборСписокУслуг(ТекСтрока);
			ПолучитьНачисленияПени(Объект.Дата, ТекСтрока.ЛицевойСчет);
			
		КонецЕсли; 
		
		Объект.СписокУслуг.Сортировать("Приоритет Возр");
		
	Иначе 
		
		Если НЕ Объект.Проведен Тогда
			
			Если Не мКэшЗначений.мНеРаспределятьОплатуПослеВводаСуммы Тогда
				ВыполнитьРасчетНаСервере();
			Иначе	
				ДокументРассчитан = Ложь;
			КонецЕсли; 
			
			СуммаДокумента = Объект.СписокЛС.Итог("Сумма");
			
			Элементы.СписокУслугСуммаПени.Видимость = ?(Объект.СписокУслуг.Итог("СуммаПени") <> 0 ИЛИ Объект.ВводВРучную, Истина, Ложь);
			
			Если Не Элемент.ТекущиеДанные = Неопределено Тогда  
				
				УстановитьОтборСписокУслуг(Элемент.ТекущиеДанные);
				
			КонецЕсли;
			
			УправлениеВидимостьюКолонок(ТекСтрока);
			УдалитьПустыеСтрокиНаСервере();
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ТекСтрока <> Неопределено И Объект.Проведен Тогда
		
		Если ТекСтрока.ЛицевойСчет <> мКэшЗначений.мЛицевойСчет Тогда
			
			ТекСтрока.ЛицевойСчет = мКэшЗначений.мЛицевойСчет;
			
			ОтменаРедактирования = Истина;
			
		КонецЕсли; 
		
		Если ТекСтрока.ШаблонИзвещений <> мКэшЗначений.мШаблонИзвещений Тогда
			
			ТекСтрока.ШаблонИзвещений = мКэшЗначений.мШаблонИзвещений;
			
			ОтменаРедактирования = Истина;
			
		КонецЕсли; 
		
		Если ТекСтрока.Сумма <> мКэшЗначений.мСумма Тогда
			
			ТекСтрока.Сумма = мКэшЗначений.мСумма;
			
			ОтменаРедактирования = Истина;
			
		КонецЕсли; 
		
		Если ОтменаРедактирования Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриОкончанииРедактированияЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПослеУдаления(Элемент)
	
	Если НЕ мКэшЗначений.мНеРаспределятьОплатуПослеВводаСуммы И Не Объект.ВводВРучную Тогда
		ВыполнитьРасчетНаСервере();
	Иначе
		ДокументРассчитан = Ложь;
	КонецЕсли;
	
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСЛицевойСчетПриИзменении(Элемент)
	
	Если Объект.Проведен Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	ТекСтрока.СальдоНаЛС = ПолучитьСальдоНаЛСНаСервере(Объект.Дата, ТекСтрока.ЛицевойСчет);
	
	ТекСтрока.СальдоПениВХ = ПолучитьСальдоДоПениВХНаСервере(Объект.Дата, ТекСтрока.ЛицевойСчет);
	
	Если Не мКэшЗначений.мНеРаспределятьОплатуПослеВводаСуммы Тогда
		УстановитьОтборСписокУслуг(ТекСтрока);
	Иначе	
		ДокументРассчитан = Ложь;
	КонецЕсли;
	
	УстановитьОтборСписокУслуг(ТекСтрока);
	
	ЗаполнитьСчетаНаСервере();
	
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();		  	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не Объект.Проведен Тогда
		
		ТекДанные = Элементы.СписокЛС.ТекущиеДанные;
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Организация", Объект.Организация);
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор, ТекЭлемент", Отбор, ТекДанные.ЛицевойСчет), Элемент);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВводВРучную Тогда
		
		ПроверитьДублиЛСПриВводеВручную(ВыбранноеЗначение, СтандартнаяОбработка, "ЛицевойСчет");
		
	КонецЕсли;
	
	Если ВыбранноеЗначение = "" или ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка")Тогда
		МожноИспользоватьЭтотЛС = МожноИспользоватьЭтотЛСНаСервере(Элемент.ТекстРедактирования);
	Иначе
		МожноИспользоватьЭтотЛС = МожноИспользоватьЭтотЛСНаСервере(Строка(ВыбранноеЗначение));
	КонецЕсли;
	
	Если МожноИспользоватьЭтотЛС = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Лицевой счет не принадлежит организации документа";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСШаблонИзвещенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВводВРучную Тогда
		
		ПроверитьДублиЛСПриВводеВручную(ВыбранноеЗначение, СтандартнаяОбработка, "ШаблонИзвещений");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССуммаПриИзменении(Элемент)
	
	Элементы.СписокЛС.ЗакончитьРедактированиеСтроки(Ложь);
	
	ОбновитьНадписьНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетАбонентаПриИзменении(Элемент)
	
	СтрокаЭлемент = Элементы.СписокЛС.ТекущийЭлемент;
	СтрокаПлатеж  = Элементы.СписокЛС.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоСписокЛС(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"Субконто1", "Субконто2", "Субконто3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетАбонентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконтоСписокЛС(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.СписокЛС.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоСписокЛС(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "СубконтоКУ%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетКУ);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередУдалением(Элемент, Отказ)
	
	Отказ = Не Объект.ВводВручную;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Не Объект.ВводВручную;
	
	Если Копирование Тогда
		
		Отказ = Истина;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугУслугаПриИзменении(Элемент)
	
	ТекСтрока   = Элементы.СписокЛС.ТекущиеДанные;
	ТекСтрокаУС = Элементы.СписокУслуг.ТекущиеДанные;
	
	Если ТекСтрокаУС <> Неопределено И ТекСтрока <> Неопределено Тогда
		
		ТекСтрокаУС.ЛицевойСчет     = ТекСтрока.ЛицевойСчет;
		ТекСтрокаУС.ШаблонИзвещений = ТекСтрока.ШаблонИзвещений;
		ТекСтрокаУС.Приоритет       = ПолучитьПриоритетУслугиНаСервере(ТекСтрокаУС.Услуга);
		
	КонецЕсли;  
	
	Объект.СписокУслуг.Сортировать("Приоритет Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		
		Элементы.СписокУслуг.ЗакончитьРедактированиеСтроки(Истина);
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекСтрока.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам")
		ИЛИ ТекСтрока.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемЗаМесяц") Тогда
		ПоВсемУслугам = Истина;
	Иначе
		ПоВсемУслугам = Ложь;
	КонецЕсли;
	ШаблонУслуг   = ПолучитьСписокУслуг(ТекСтрока.ЛицевойСчет, ТекСтрока.ШаблонИзвещений, ПоВсемУслугам);	
	
	СписокУС = Новый СписокЗначений;
	
	Для каждого Строка Из ШаблонУслуг Цикл
		
		СписокУС.Добавить(Строка.Услуга);		
		
	КонецЦикла; 
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Ссылка", СписокУС);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("ЛицевойСчет"     , ТекСтрока.ЛицевойСчет);
		Отбор.Вставить("ШаблонИзвещений" , ТекСтрока.ШаблонИзвещений);
		Отбор.Вставить("Услуга"          , ВыбранноеЗначение);
		
		МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0  Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Услуга :"+ВыбранноеЗначение + " занесена в список услуг.";
			Сообщение.Сообщить();
			
			ВыбранноеЗначение = ТекСтрока.Услуга;
			
			Элементы.СписокУслуг.ЗакончитьРедактированиеСтроки(Истина);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСуммаПриИзменении(Элемент)
	
	ОбновитьНадписьНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСуммаПениПриИзменении(Элемент)
	
	ТекСтрокаУС = Элементы.СписокУслуг.ТекущиеДанные;
	
	Если ТекСтрокаУС <> Неопределено Тогда
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("ЛицевойСчет", ТекСтрокаУС.ЛицевойСчет);
		Отбор.Вставить("Услуга"     , ТекСтрокаУС.Услуга);
		
		СтрокаПени = мТаблицаНачисленийПени.НайтиСтроки(Отбор);
		
		Если СтрокаПени.Количество() = 1 Тогда
			
			СальдоПени = СтрокаПени[0].Пени;
			СуммаПени  = ТекСтрокаУС.СуммаПени;
			
			Если СуммаПени > СальдоПени Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Сумма оплаты пени : "+ СуммаПени + " не может превышать сальдо пени: ";
				Сообщение.Сообщить();
				
				ТекСтрокаУС.СуммаПени = СальдоПени;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаПени.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "По услуге: " +  ТекСтрокаУС.Услуга + " сальдо пени равно нулю.";
			Сообщение.Сообщить();
			
			ТекСтрокаУС.СуммаПени = 0;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ОбновитьНадписьНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Функция выполняет поиск лицевойго счета в базе.
//
&НаСервере
Функция НайтиЛС(НаименованиеЛС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",НаименованиеЛС);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ЛС = Выборка.Ссылка;	
	Иначе 
		ЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат ЛС;
	
КонецФункции

// Процедура выполняет установку отбора.
//
&НаКлиенте
Процедура УстановитьОтборСписокУслуг(мТекСтрока)
	
	Если Не мТекСтрока = Неопределено Тогда
		
		ФЛС = Новый ФиксированнаяСтруктура("ЛицевойСчет, ШаблонИзвещений", мТекСтрока.ЛицевойСчет, мТекСтрока.ШаблонИзвещений);
		
		Элементы.СписокУслуг.ОтборСтрок = ФЛС;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет заполнение таблицы услуг при вводе оплаты вручную.
//
&НаКлиенте
Процедура ЗаполнитьСписокУслугПоШаблону(СтрокаТЧ)
	
	Если СтрокаТЧ.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам")
		ИЛИ СтрокаТЧ.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемЗаМесяц") Тогда
		ПоВсемУслугам = Истина;	
	Иначе
		ПоВсемУслугам = Ложь;	
	КонецЕсли;
	ШаблонУслуг   = ПолучитьСписокУслуг(СтрокаТЧ.ЛицевойСчет, СтрокаТЧ.ШаблонИзвещений, ПоВсемУслугам);		
	
	Для каждого СтрокаУслуга Из ШаблонУслуг Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет"     , СтрокаТЧ.ЛицевойСчет);
		Отбор.Вставить("ШаблонИзвещений" , СтрокаТЧ.ШаблонИзвещений);
		Отбор.Вставить("Услуга"          , СтрокаУслуга.Услуга);
		
		МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() = 0 Тогда
			
			НовСтрока = Объект.СписокУслуг.Добавить();
			
			НовСтрока.Услуга          = СтрокаУслуга.Услуга;
			НовСтрока.ЛицевойСчет     = СтрокаТЧ.ЛицевойСчет;
			НовСтрока.ШаблонИзвещений = СтрокаТЧ.ШаблонИзвещений;
			НовСтрока.Приоритет       = ПолучитьПриоритетУслугиНаСервере(СтрокаУслуга.Услуга);
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаКлиенте
Процедура ПриИзмененииВСтроке(Идентификатор)
	
	ТекСтрока = Объект.СписокЛС.Получить(Идентификатор);
	
	Если НЕ ТекСтрока.ЛицевойСчет     = мКэшЗначений.мЛицевойСчет 
		ИЛИ НЕ ТекСтрока.ШаблонИзвещений = мКэшЗначений.мШаблонИзвещений Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет"    , мКэшЗначений.мЛицевойСчет);
		Отбор.Вставить("ШаблонИзвещений", мКэшЗначений.мШаблонИзвещений);
		
		МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
		
		Для каждого Строка Из МассивСтрок Цикл
			
			Объект.СписокУслуг.Удалить(Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

// Процедруа выполняет заполнение таблицы услуг. 
//
&НаКлиенте
Процедура ЗаполнениеТаблицыУслуг()
	
	ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	Если Объект.СписокЛС.Количество() > 0 И НЕ Объект.ВводВРучную Тогда
		
		Объект.СписокУслуг.Очистить();
		//Объект.СписокУслугПоПериоду.Очистить();
		
		Если Не мКэшЗначений.мНеРаспределятьОплатуПослеВводаСуммы Тогда
			ВыполнитьРасчетНаСервере();
		Иначе	
			ДокументРассчитан = Ложь;
		КонецЕсли; 
		
		УправлениеВидимостьюКолонок(ТекСтрока);
		УдалитьПустыеСтрокиНаСервере();
		
	ИначеЕсли Объект.СписокЛС.Количество() > 0 И Объект.ВводВРучную Тогда
		
		Объект.СписокУслуг.Очистить();
		//Объект.СписокУслугПоПериоду.Очистить();
		
		Для каждого Строка Из Объект.СписокЛС Цикл
			
			ЗаполнитьСписокУслугПоШаблону(Строка);
			ПолучитьНачисленияПени(Объект.Дата, Строка.ЛицевойСчет);	
			
		КонецЦикла; 
		
		Элементы.СписокУслугСуммаПени.Видимость = Истина;
		
	КонецЕсли;
	
	УстановитьОтборСписокУслуг(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьНаФорме()
	
	Если Объект.ВводВРучную Тогда
		
		ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
		
		СуммаДокумента = Объект.СписокЛС.Итог("Сумма");
		
		Если ТекСтрока <> Неопределено Тогда
			
			КонтрольнаяСумма = ТекСтрока.Сумма;
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("ЛицевойСчет"    , ТекСтрока.ЛицевойСчет);
			Отбор.Вставить("ШаблонИзвещений", ТекСтрока.ШаблонИзвещений);
			
			МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
			
			ИтогСумма = 0;
			ИтогПени  = 0;
			
			Для каждого ЭлементыМассива Из МассивСтрок Цикл
				
				ИтогСумма = ИтогСумма + ЭлементыМассива.Сумма;
				ИтогПени  = ИтогПени  + ЭлементыМассива.СуммаПени;
				
			КонецЦикла;
			
			Остаток = КонтрольнаяСумма - ИтогСумма - ИтогПени;
			
			Текст = "Оплата услуг :" + ИтогСумма + ", Пени: "+ ИтогПени + 
			?(Остаток > 0, ". 
			|Не распределенная сумма оплаты: "+ Остаток ,".");
			
			Если Остаток < 0 Тогда
				
				Элементы.НадписьИнфо.ЦветТекста = Новый Цвет(255, 0, 0);
				
				Текст = Текст + ". 
				|Распределенная сумма превышает сумму оплаты!"
				
			Иначе
				
				Элементы.НадписьИнфо.ЦветТекста = Новый Цвет(0, 0, 0);
				
			КонецЕсли; 
			
			Элементы.НадписьИнфо.Заголовок = Текст;
			
		КонецЕсли; 
		
		Если ТекСтрока = Неопределено Тогда
			
			Текст = "Сумма по документу :" + СуммаДокумента;
			
		Иначе
			
			Текст ="Сумма по документу :" + СуммаДокумента + ". 
			|Сумма оплаты :" + ТекСтрока.Сумма;
			
		КонецЕсли; 
		
		Элементы.НадписьИнфоОбщ.Заголовок = Текст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДублиЛСПриВводеВручную(ВыбранноеЗначение, СтандартнаяОбработка, ИмяРесурса)
	
	ТекущаяСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	Если НЕ ВыбранноеЗначение = ТекущаяСтрока[ИмяРесурса] ИЛИ ТекущаяСтрока[ИмяРесурса].ПустаяСсылка() Тогда
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("ЛицевойСчет"    , ВыбранноеЗначение);
		Отбор.Вставить("ШаблонИзвещений", ТекущаяСтрока.ШаблонИзвещений);
		
		МассивСтрок = Объект.СписокЛС.НайтиСтроки(Отбор);
		
		Если НЕ МассивСтрок.Количество() = 0 Тогда
			
			ВыбранноеЗначение    = ТекущаяСтрока[ИмяРесурса];
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ТаблицаЛСНаСервере(АдресЛСВХранилище)
	
	Отбор = Новый Структура;
	
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка получения данных из временного хранилища. Выполните подбор заново.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаЛС Цикл
		
		Отбор.Вставить("ЛицевойСчет", СтрокаТаблицы.ЛицевойСчет);
		
		СтрокаТабличнойЧасти = Объект.СписокЛС.НайтиСтроки(Отбор);
		
		Если СтрокаТабличнойЧасти.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.СписокЛС.Добавить();
			
			НоваяСтрока.ЛицевойСчет  = СтрокаТаблицы.ЛицевойСчет;
			НоваяСтрока.СчетАбонента = мКэшЗначений.мСтруктураСчетовЖКХ.СчетАбонента;
			СтрокаСубконта           = НоваяСтрока.СчетАбонента.ВидыСубконто.Найти(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета"), "ВидСубконто");
			
			Если НЕ СтрокаСубконта = Неопределено Тогда
				
				НоваяСтрока["Субконто"+СтрокаСубконта.НомерСтроки] = НоваяСтрока.ЛицевойСчет;
				
			КонецЕсли;
			
			НоваяСтрока.СчетКУ          = мКэшЗначений.мСтруктураСчетовЖКХ.ТранзитныйСчетОплаты;
			НоваяСтрока.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам");
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ЗаполнитьСчетаНаСервере();
	ОбновитьДанныеКолонкиАдрес();
	ОбновитьДанныеКолонкиОтветственный();
КонецПроцедуры

// Процедура получает таблицу начислений по пени.
//
&НаСервере
Процедура ПолучитьНачисленияПени(Знач Дата, Знач ЛицевойСчет)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ КАК Услуга ,
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток) КАК Пени
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ";
	
	Запрос.УстановитьПараметр("Дата"       , Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если мТаблицаНачисленийПени = Неопределено Тогда
		
		мТаблицаНачисленийПени = Запрос.Выполнить().Выгрузить().СкопироватьКолонки();	
		
	КонецЕсли; 
	
	Отбор = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		
		Отбор.Очистить();
		
		Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		Отбор.Вставить("Услуга"     , Выборка.Услуга);
		
		МассивСтрок = мТаблицаНачисленийПени.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Если МассивСтрок[0].Пени <> Выборка.Пени Тогда
				
				МассивСтрок[0].Пени = Выборка.Пени;	
				
			КонецЕсли; 	
			
		Иначе
			
			НоваяСтрока = мТаблицаНачисленийПени.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.ЗапролнитьСчета();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	КэшированныеЗначения.Вставить("мТекущаяДатаДокумента", Объект.Дата);
	КэшированныеЗначения.Вставить("мВидОперации", Объект.ВидОперации);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеРаспределятьОплатуПослеВводаСуммы КАК НеРаспределятьОплатуПослеВводаСуммы
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НеРаспределятьОплатуПослеВводаСуммы = Выборка.НеРаспределятьОплатуПослеВводаСуммы;
	Иначе	
		НеРаспределятьОплатуПослеВводаСуммы = Ложь;
	КонецЕсли;
	
	КэшированныеЗначения.Вставить("мНеРаспределятьОплатуПослеВводаСуммы", НеРаспределятьОплатуПослеВводаСуммы);
	
	КэшированныеЗначения.Вставить("мОрганизация", Объект.Организация);
	КэшированныеЗначения.Вставить("мСтруктураСчетовЖКХ", Неопределено);
	КэшированныеЗначения.Вставить("мТекущийЛицевойСчет", Неопределено);	
	КэшированныеЗначения.Вставить("мЛицевойСчет", Неопределено);
	КэшированныеЗначения.Вставить("мШаблонИзвещений", Неопределено);
	КэшированныеЗначения.Вставить("мСумма", Неопределено);
	КэшированныеЗначения.Вставить("мВводВручную", Объект.ВводВРучную);
	
	КэшированныеЗначения.Вставить("ВыбЗначение", Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСальдоНаЛСНаСервере(Знач Дата, Знач ЛицевойСчет);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки";
	
	Запрос.УстановитьПараметр("Момент", Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СальдоНаЛС = 0;
	
	Если Выборка.Следующий() тогда
		
		СальдоНаЛС = Выборка.Остаток;
		
	КонецЕсли;
	
	Возврат СальдоНаЛС;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСальдоДоПениВХНаСервере(Знач Дата, Знач ЛицевойСчет);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК НачислениеПениПоУслугамЖКХОстатки";
	
	Запрос.УстановитьПараметр("Момент", Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СальдоПениВХ = 0;
	
	Если Выборка.Следующий() Тогда
		
		СальдоПениВХ = Выборка.Остаток;
		
	КонецЕсли;
	
	Возврат СальдоПениВХ;
	
КонецФункции

&НаСервере
Процедура УдалитьПустыеСтрокиНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.УдалитьПустыеСтроки();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетНаСервере()
	
	Если Объект.ОплатаПоПериоду
		И (ПериодОплаты.ДатаНачала > ПериодОплаты.ДатаОкончания	ИЛИ НЕ ЗначениеЗаполнено(ПериодОплаты.ДатаОкончания)) Тогда
		
		ТекстСообщения = НСтр("ru = 'Перед расчетом необходимо заполнить Период оплаты'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ОплатаПоПериоду Тогда
		
		ТекстСообщения = "";
		Для каждого Стр Из Объект.СписокЛС Цикл
			Если Стр.ШаблонИзвещений.Сальдо = ПредопределенноеЗначение("Перечисление.ДаНет.Да") 
				ИЛИ Стр.ШаблонИзвещений.Кредит = ПредопределенноеЗначение("Перечисление.ДаНет.Да") Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон(
													НСтр("ru = 'Необходимо изменить ""Шаблон извещения"" для лицевого счета: ""%1""'"),
													Стр.ЛицевойСчет);
				ТекстСообщения = ТекстСообщения + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.ВыполнитьРасчет();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ДокументРассчитан = Истина;
	
КонецПроцедуры

// Функция возвращает список услуг по шаблону.
//
&НаСервере
Функция ПолучитьСписокУслуг(Знач ЛицевойСчет, Знач ШаблонИзвещений, Знач ПоВсемУслугам)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Запрос.УстановитьПараметр("Дата"        , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ПоВсемУслугам Тогда
		
		МассивШаблонов = бит_ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат);
		
		Возврат МассивШаблонов;	
		
	Иначе
		
		Таблица = Результат.СкопироватьКолонки();
		
		Для каждого Строка Из Результат Цикл
			
			Если ШаблонИзвещений.Услуги.Найти(Строка.Услуга, "Услуга") <> Неопределено Тогда
				
				НоваяСтрока = Таблица.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		МассивШаблонов = бит_ОбщегоНазначения.ТаблицаЗначенийВМассив(Таблица);
		
		Возврат МассивШаблонов;
		
	КонецЕсли;
	
КонецФункции

// Служебная процедура для заполнения колонки "Адрес" табличного поля "СписокЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиАдрес()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",Объект.СписокЛС.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из Объект.СписокЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчет,"ЛицевойСчет") Тогда
			
			Стр.Адрес = Строка(Выборка.УлицаЛицевогоСчета) + ", д. " + Строка(Выборка.Здание) + ?(ПустаяСтрока(Выборка.Корпус),"",", кор. " + Строка(Выборка.Корпус)) + ", кв. " + Строка(Выборка.Квартира);
			
		Иначе
			
			Стр.Адрес = "";
			
		КонецЕсли;
		
		Выборка.Сбросить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконтоСписокЛС(Форма)
	
	СтрокаПлатеж       = Форма.Объект.СписокЛС.НайтиПоИдентификатору(Форма.Элементы.СписокЛС.ТекущаяСтрока);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "СписокЛССубконто%Индекс%", ПараметрыДокумента);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "СписокЛССубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	
	Для Индекс = 1 По 3 Цикл
		
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоСписокЛС(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
	"СписокЛССубконто" + Постфикс + "1", 
	"СписокЛССубконто" + Постфикс + "2", 
	"СписокЛССубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТиповНаСервере(ЭлементИмя)
	
	МассивТипов = Объект.Ссылка.Метаданные().Реквизиты[ЭлементИмя].Тип.Типы();	
	
	СписокТипов = Новый СписокЗначений;
	
	Для каждого ЭлементМассива Из МассивТипов Цикл
		
		ПустоеЗначение           = Новый(ЭлементМассива);
		ОбъектОписанияМетаданных = ПустоеЗначение.Метаданные();
		
		СписокТипов.Добавить(ОбъектОписанияМетаданных.Имя, ОбъектОписанияМетаданных.Представление());
		
	КонецЦикла; 
	
	Возврат СписокТипов;
	
КонецФункции

&НаСервере
Функция ПолучитьТипСправочникаНаСервере(ВыбранныйТип)
	
	Возврат Строка(Справочники[ВыбранныйТип]);
	
КонецФункции

&НаСервере
Процедура ПолучитьНачисленияПениНаСервере()
	
	Для каждого Строка  Из Объект.СписокЛС Цикл
		
		ПолучитьНачисленияПени(Объект.Дата, Строка.ЛицевойСчет);	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПриоритетУслугиНаСервере(Услуга)
	
	Возврат Услуга.Приоритет;
	
КонецФункции

&НаСервере
Функция НайтиДокументНачислениеПениПоЛицевымСчетамНаСервере()
	
	Если Объект.Ссылка.Пустая() = Ложь Тогда
		Документ = Документы.бит_НачислениеПениПоЛицевымСчетам.НайтиПоРеквизиту("ДокОснование", Объект.Ссылка);
	КонецЕсли;
	Возврат Документ;
	
КонецФункции

&НаСервере
Функция НайтиДокументРаспределениеОплатыПоПоставщикамНаСервере()
	
	Документ = Документы.бит_РаспределениеОплатыПоПоставщикам.НайтиПоРеквизиту("ДокументОснование", Объект.Ссылка);
	
	Возврат Документ;
	
КонецФункции

// Служебная процедура для заполнения колонки "Ответственный" табличного поля "ТаблицаЗависимыеЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиОтветственный()
	
	СписокЗначенийЛС = Новый СписокЗначений;	
	
	Для Каждого Эл из Объект.СписокЛС Цикл
		
		СписокЗначенийЛС.Добавить(Эл.ЛицевойСчет);	
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",СписокЗначенийЛС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из Объект.СписокЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчет,"ЛицевойСчет") Тогда
			
			Стр.Ответственный = ОтветственныйНаЛС(Стр.ЛицевойСчет);
			
		Иначе
			
			Стр.Ответственный = "";
			
		КонецЕсли;
		
		Выборка.Сбросить();
		
	КонецЦикла;
	
КонецПроцедуры

// Получение ответственного, на выбранном ЛС.
// Параметры:
//  <ЛицевойСчет> – <Справочник.бит_ЛицевыеСчета> – для получения ответственного по ЛС.
//
// Возвращаемое значение:
//   <ТаблицаЗначений.Строка> – <строка с ответственным по ЛС>.
//
&НаСервере
Функция ОтветственныйНаЛС(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ЛицевыеСчета.Ссылка
	|				ИЗ
	|					Справочник.бит_ЛицевыеСчета КАК ЛицевыеСчета
	|				ГДЕ
	|					ЛицевыеСчета.Ссылка = &ЛицевойСчет)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> &Выписан
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("Момент", 	 ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Выписан", ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()> 0 и Результат.Количество()< 2  Тогда
		
		РезультатФизЛицо = Результат[0].ФизЛицо
	ИначеЕсли Результат.Количество()> 1  Тогда
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ФизЛицо = Выборка.ФизЛицо;
			
		КонецЦикла;
		РезультатФизЛицо = ФизЛицо;
	Иначе
		РезультатФизЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФизЛицо;
	
КонецФункции 

&НаКлиенте
Процедура СписокЛСЛицевойСчетОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	
	Если Не Объект.Проведен Тогда
		
		МожноИспользоватьЭтотЛС = МожноИспользоватьЭтотЛСНаСервере(Текст);
		
		Если МожноИспользоватьЭтотЛС = Неопределено Тогда
			
			СтандартнаяОбработка = Ложь;
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МожноИспользоватьЭтотЛСНаСервере(Текст)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка,
	|	бит_ЛицевыеСчета.Организация
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация = &Организация
	//++АнисимоваМВ 08.11 восстановление базы
	| И бит_ЛицевыеСчета.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);	
	Запрос.УстановитьПараметр("Наименование", Текст);	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Строка(ВыборкаДетальныеЗаписи.Ссылка) = Текст Тогда
			
			Возврат Истина;
		Иначе
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьНаКлиенте()
	
	Если Не Объект.Проведен Тогда
		ВыполнитьРасчетНаСервере();
		УдалитьПустыеСтрокиНаСервере();
		ОбновитьДанныеКолонкиАдрес();
		ОбновитьДанныеКолонкиОтветственный();
		Элементы.СписокУслугСуммаПени.Видимость = ?(Объект.СписокУслуг.Итог("СуммаПени") <> 0 ИЛИ Объект.ВводВРучную, Истина, Ложь);
		
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция	ЗначениеРеквизитаНаСервере(Ссылка, ИмяРеквизита);
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаКлиенте
Процедура ПериодОплатыПриИзменении(Элемент)
	
	Если ПериодОплаты.ДатаНачала > ПериодОплаты.ДатаОкончания 
		ИЛИ НЕ ЗначениеЗаполнено(ПериодОплаты.ДатаОкончания) Тогда
		 ПериодОплаты.ДатаНачала	= Дата('00010101');
		 ПериодОплаты.ДатаОкончания = Дата('00010101');
		 Объект.СписокУслуг.Очистить();
		 //Объект.СписокУслугПоПериоду.Очистить();
		 Возврат;
	 КонецЕсли;
	
	ПериодОплаты.ДатаНачала	   = НачалоМесяца(ПериодОплаты.ДатаНачала);
	ПериодОплаты.ДатаОкончания = КонецМесяца(ПериодОплаты.ДатаОкончания);
	Объект.НачалоПериодаОплаты = НачалоМесяца(ПериодОплаты.ДатаНачала);
	Объект.КонецПериодаОплаты  = КонецМесяца(ПериодОплаты.ДатаОкончания);
	
КонецПроцедуры

//16.04.2019
&НаКлиенте
Процедура РассчитатьСУчетомНачисленийМесяца(Команда)
	РассчитатьСУчетомНачисленийМесяцаНаСервере();
КонецПроцедуры

//16.04.2019
&НаСервере
Процедура РассчитатьСУчетомНачисленийМесяцаНаСервере()
	
	Если Объект.ОплатаПоПериоду
		И (ПериодОплаты.ДатаНачала > ПериодОплаты.ДатаОкончания	ИЛИ НЕ ЗначениеЗаполнено(ПериодОплаты.ДатаОкончания)) Тогда
		
		ТекстСообщения = НСтр("ru = 'Перед расчетом необходимо заполнить Период оплаты'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ОплатаПоПериоду Тогда
		
		ТекстСообщения = "";
		Для каждого Стр Из Объект.СписокЛС Цикл
			Если Стр.ШаблонИзвещений.Сальдо = ПредопределенноеЗначение("Перечисление.ДаНет.Да") 
				ИЛИ Стр.ШаблонИзвещений.Кредит = ПредопределенноеЗначение("Перечисление.ДаНет.Да") Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон(
													НСтр("ru = 'Необходимо изменить ""Шаблон извещения"" для лицевого счета: ""%1""'"),
													Стр.ЛицевойСчет);
				ТекстСообщения = ТекстСообщения + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.ВыполнитьРасчетСУчетомНачисленийМесяца();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ДокументРассчитан = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтрагентамиОтветственныхЛиц(Команда)
	ЗаполнитьКонтрагентамиОтветственныхЛицНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентамиОтветственныхЛицНаСервере()
	
	для каждого стр из Объект.СписокЛС цикл
		
		контрагент = НайтиКонтрагентаПоЛС(стр.ЛицевойСчет, Объект.Дата);

		если контрагент <> неопределено тогда
		 стр.СубконтоКУ1 = контрагент.Контрагент;
		 стр.СубконтоКУ2 = контрагент.ДоговорКонтрагента;
		конецесли; 
		
	конеццикла;	
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
КонецПроцедуры

функция НайтиКонтрагентаПоЛС(ЛицевойСчет, Дата)

  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
  |		бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
  |		бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
  |	ПОМЕСТИТЬ Проживающие
  |	ИЗ
  | 	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = (&ЛицевойСчет)) КАК бит_ПроживающиеПоЛССрезПоследних
  |	ГДЕ
  |		(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
  |				ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
  |		И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
  |		И НЕ бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
  |	;
  |	////////////////////////////////////////////////////////////////////////////////
  |	ВЫБРАТЬ РАЗРЕШЕННЫЕ
  |		бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
  |	// БИТ_ЖКХ_01102013_начало_изменений
  |		бит_ОтветственныеЛицаПоКУСрезПоследних.ДоговорКонтрагента,
  |	// БИТ_ЖКХ_01102013_окончание_изменений
  |		бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент
  |	ИЗ
  |		Проживающие КАК Проживающие
  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Дата, ЛицевойСчет  = (&ЛицевойСчет)) КАК бит_ОтветственныеЛицаПоКУСрезПоследних
  |			ПО Проживающие.ЛицевойСчет = бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
  |				И Проживающие.ФизЛицо = бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
  |	
  |	СГРУППИРОВАТЬ ПО
  |		бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
  |	// БИТ_ЖКХ_01102013_начало_изменений
  |		бит_ОтветственныеЛицаПоКУСрезПоследних.ДоговорКонтрагента,
  |	// БИТ_ЖКХ_01102013_окончание_изменений
  |	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент ;";
  
  запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
  запрос.УстановитьПараметр("Дата", Дата);

  таб = запрос.Выполнить().Выгрузить();
  
  если таб.Количество() > 0 тогда
   структураВозврата = новый Структура();
   структураВозврата.Вставить("Контрагент", таб[0].Контрагент);
   структураВозврата.Вставить("ДоговорКонтрагента", таб[0].ДоговорКонтрагента);
   
   возврат структураВозврата;   
  иначе 
   возврат неопределено;
  конецесли;	  

КонецФункции	

//&НаКлиенте 
//Процедура РаспределитьОплату(Команда)
////не используется. Гаспирович В.В. комментирую перед удалением
//	РаспределитьОплатуС();	
//КонецПроцедуры

//&НаСервере
//Процедура РаспределитьОплатуС()
//	Шаблон = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
//	Массив = Новый Массив;
//	МассивКлючей = Новый Массив;
//	МассивУслуг = ПолучитьМассивУслуг();
//	Для Каждого Стр Из Объект.СписокЛС Цикл
//		Если Стр.ИсполнительныйЛист <> ПредопределенноеЗначение("Документ.бит_ИсполнительныйЛист.ПустаяСсылка") Тогда
//			ПровестиРасчет(Стр,Объект.РасчетныйСчет,Объект.Организация,Массив,МассивУслуг,МассивКлючей);	
//		КонецЕсли;
//	КонецЦикла;
//	Для Каждого Элемент Из МассивКлючей Цикл
//		СтруктураПоиска = Новый Структура("ЛицевойСчет",Элемент);
//		ПовторныеСтроки =  Объект.СписокУслуг.НайтиСтроки(СтруктураПоиска);
//		Для Каждого Строка Из ПовторныеСтроки Цикл 
//			Объект.СписокУслуг.Удалить(Строка);
//		КонецЦикла;
//		ПовторныеСтроки =  Объект.СписокУслугПоПериоду.НайтиСтроки(СтруктураПоиска);
//		Для Каждого Строка Из ПовторныеСтроки Цикл 
//			Объект.СписокУслугПоПериоду.Удалить(Строка);
//		КонецЦикла;
//	КонецЦикла;
//	
//	Для Каждого Элемент Из Массив Цикл
//		СтрГоспошлина = Объект.СписокУслуг.Добавить();
//		СтрГоспошлина.ЛицевойСчет = Элемент[8];
//		СтрГоспошлина.лб_КлючСтроки = Элемент[6];
//		СтрГоспошлина.Услуга = МассивУслуг[2];
//		СтрГоспошлина.Сумма = Элемент[0];
//		СтрГоспошлина.ШаблонИзвещений = Шаблон;
//		СтрГоспошлина.ИсполнительныйЛист = Элемент[7];
//		Если Не Элемент[1] = 0 Тогда 
//			СтрПредставительские = Объект.СписокУслуг.Добавить();	
//			СтрПредставительские.ЛицевойСчет = Элемент[8];
//			СтрПредставительские.лб_КлючСтроки = Элемент[6];
//			СтрПредставительские.Услуга = МассивУслуг[3];
//			СтрПредставительские.Сумма = Элемент[1];
//			СтрПредставительские.ШаблонИзвещений = Шаблон;
//			СтрПредставительские.ИсполнительныйЛист = Элемент[7];
//		КонецЕсли;
//		Если Не Элемент[2] = 0 Тогда
//			СтрУслуга = Объект.СписокУслуг.Добавить();
//			СтрУслуга.ЛицевойСчет = Элемент[8];
//			СтрУслуга.лб_КлючСтроки = Элемент[6];
//			СтрУслуга.Услуга = Элемент[4];
//			СтрУслуга.Сумма = Элемент[2];
//			СтрУслуга.ШаблонИзвещений = Шаблон;
//			Если Не Элемент[3] < 0 Тогда
//				СтрУслуга.ИсполнительныйЛист = Элемент[7];
//			Иначе
//				СтрУслуга.ИсполнительныйЛист = Документы.бит_ИсполнительныйЛист.ПустаяСсылка();
//			КонецЕсли;
//		КонецЕсли;
//		Если Не Элемент[3] = 0 Тогда
//			СтрУслуга = Объект.СписокУслуг.Добавить();
//			СтрУслуга.ЛицевойСчет = Элемент[8];
//			СтрУслуга.лб_КлючСтроки = Элемент[6];
//			СтрУслуга.Услуга = Элемент[4];
//			СтрУслуга.Сумма = Элемент[3];
//			СтрУслуга.ШаблонИзвещений = Шаблон;
//			СтрУслуга.ИсполнительныйЛист = Документы.бит_ИсполнительныйЛист.ПустаяСсылка();
//		КонецЕсли;
//		СтрГоспошлинаПериод = Объект.СписокУслугПоПериоду.Добавить();
//		СтрГоспошлинаПериод.ЛицевойСчет = Элемент[8];
//		СтрГоспошлинаПериод.лб_КлючСтроки = Элемент[6];
//		СтрГоспошлинаПериод.Услуга = МассивУслуг[2];
//		СтрГоспошлинаПериод.Сумма = Элемент[0];
//		СтрГоспошлинаПериод.ПериодВзаиморасчетов = Элемент[7].ДатаИсполнительногоЛиста;
//		
//		СтрПредставительскиеПериод = Объект.СписокУслугПоПериоду.Добавить();	
//		СтрПредставительскиеПериод.ЛицевойСчет = Элемент[8];
//		СтрПредставительскиеПериод.лб_КлючСтроки = Элемент[6];
//		СтрПредставительскиеПериод.Услуга = МассивУслуг[3];
//		СтрПредставительскиеПериод.Сумма = Элемент[1];
//		СтрПредставительскиеПериод.ПериодВзаиморасчетов = Элемент[7].ДатаИсполнительногоЛиста;
//		
//		Если Не Элемент[2] = 0 Тогда
//			СтрУслуга = Объект.СписокУслугПоПериоду.Добавить();
//			СтрУслуга.ЛицевойСчет = Элемент[8];
//			СтрУслуга.лб_КлючСтроки = Элемент[6];
//			СтрУслуга.Услуга = Элемент[4];
//			СтрУслуга.Сумма = Элемент[2];
//			СтрУслуга.ПериодВзаиморасчетов = Элемент[7].ДатаИсполнительногоЛиста;
//		КонецЕсли;
//		
//		Если Не Элемент[3] = 0 И Элемент[5] Тогда
//			СтрУслуга = Объект.СписокУслугПоПериоду.Добавить();
//			СтрУслуга.ЛицевойСчет = Элемент[8];
//			СтрУслуга.лб_КлючСтроки = Элемент[6];
//			СтрУслуга.Услуга = Элемент[4];
//			СтрУслуга.Сумма = Элемент[3];
//			СтрУслуга.ПериодВзаиморасчетов = Элемент[7].ДатаИсполнительногоЛиста;
//		ИначеЕсли Не Элемент[3] = 0 Тогда
//			Остаток = Элемент[3]; 
//			МассивОплат = Новый Массив;
//			Запрос = Новый Запрос;
//			Запрос.Текст = "ВЫБРАТЬ
//			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
//			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток КАК СуммаОстаток
//			|ИЗ
//			|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(
//			|			,
//			|			ЛицевойСчет = &ЛицевойСчет
//			|				И УслугаЖКХ = &УслугаЖКХ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
//			|
//			|УПОРЯДОЧИТЬ ПО
//			|	ПериодВзаиморасчетов";
//			Запрос.УстановитьПараметр("ЛицевойСчет",Элемент[8]);
//			Запрос.УстановитьПараметр("УслугаЖКХ",Элемент[4]);
//			Выборка = Запрос.Выполнить().Выбрать();
//			Пока Выборка.Следующий() Цикл
//				МассивДаты = Новый Массив;
//				Если Остаток > Выборка.СуммаОстаток И НЕ Остаток = 0 Тогда
//					Остаток = Остаток - Выборка.СуммаОстаток;
//					МассивДаты.Добавить(Выборка.СуммаОстаток);
//					МассивДаты.Добавить(Выборка.ПериодВзаиморасчетов);
//				ИначеЕсли Остаток <= Выборка.СуммаОстаток И НЕ Остаток = 0 Тогда
//					МассивДаты.Добавить(Остаток);
//					МассивДаты.Добавить(Выборка.ПериодВзаиморасчетов);
//					Остаток = 0;
//					Прервать;
//				Иначе
//					Прервать;
//				КОнецЕсли;
//				МассивОплат.Добавить(МассивДаты);
//			КонецЦикла;
//			МассивДаты = Новый Массив;
//			МассивДаты.Добавить(Остаток);
//			МассивДаты.Добавить(ТекущаяДата());
//			МассивОплат.Добавить(МассивДаты);
//			Для Каждого Оплата Из МассивОплат Цикл
//				СтрУслуга = Объект.СписокУслугПоПериоду.Добавить();
//				СтрУслуга.ЛицевойСчет = Элемент[8];
//				СтрУслуга.лб_КлючСтроки = Элемент[6];
//				СтрУслуга.Услуга = Элемент[4];
//				СтрУслуга.Сумма = Оплата[0];
//				СтрУслуга.ПериодВзаиморасчетов = НачалоМесяца(Оплата[1]);
//				
//			КонецЦикла;
//			
//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры

&НаСервере
Функция ПолучитьМассивУслуг()
	Массив = Новый Массив;
	Массив.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001")); //Содержание
	Массив.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010")); //Капремонт
	Массив.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012")); //Госпошлина
	Массив.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000013")); //Представительские
	Возврат Массив;
КонецФункции

&НаСервере
Процедура ПровестиРасчет(Стр,Счет,Организация,Массив,МассивУслуг,МассивКлючей)
	//Если Организация.ОсновнойБанковскийСчет = Счет И 	
	Содержание = МассивУслуг[0];// Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001");	
	Сумма = Стр.Сумма;
	Ошибочный = Ложь;
	пМассив = Новый Массив;
	Запрос = Новый Запрос;
	Если Объект.Проведен Тогда
		Доп = "И НЕ ВзаиморасчетыПоИсполнительномуПроизводствуОстаткиИОбороты.Регистратор = &Док";
		Запрос.УстановитьПараметр("Док",Объект.Ссылка);
	Иначе
		Доп = "";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыПоИсполнительномуПроизводствуОстатки.СуммаГоспошлиныОстаток КАК Госпошлина,
	               |	ВзаиморасчетыПоИсполнительномуПроизводствуОстатки.СуммаПредставительскихРасходовОстаток КАК Представительские,
	               |	ВзаиморасчетыПоИсполнительномуПроизводствуОстатки.СуммаОстаток КАК Услуга,
	               |	ВзаиморасчетыПоИсполнительномуПроизводствуОстатки.Услуга КАК УслугаСсылка
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыПоИсполнительномуПроизводству.Остатки(, ИсполнительныйЛист = &Регистратор"+Доп+") КАК ВзаиморасчетыПоИсполнительномуПроизводствуОстатки";
	Запрос.УстановитьПараметр("Регистратор",Стр.ИсполнительныйЛист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.УслугаСсылка = МассивУслуг[1] И Счет = Организация.ОсновнойБанковскийСчет Тогда
			Ошибочный = Истина;
			Если Сумма >= Выборка.Госпошлина Тогда
				Госпошлина = Выборка.Госпошлина;
				Сумма = Сумма - Госпошлина;
				Если Сумма >= Выборка.Представительские Тогда
					Представительские = Выборка.Представительские;
					Сумма = Сумма - Представительские;
					Услуга = Содержание;
					Сторно = -Сумма;
					Стр.ИзменитьСтатусИЛ = Ложь;

				Иначе
					Представительские = Сумма;
					Сумма = 0;
					Услуга = Содержание;
					Сторно = 0;
					Стр.ИзменитьСтатусИЛ = Ложь;

				КонецЕсли;
				
			Иначе
				Госпошлина = Сумма;	
				Представительские = 0;
				Сумма = 0;
				Услуга = Содержание;
				Сторно = 0;
				Стр.ИзменитьСтатусИЛ = Ложь;

			КонецЕсли;
			
		Иначе
			Если Сумма >= Выборка.Госпошлина Тогда
				Госпошлина = Выборка.Госпошлина;
				Сумма = Сумма - Госпошлина;
				Если Сумма >= Выборка.Представительские Тогда
					Представительские = Выборка.Представительские;
					Сумма = Сумма - Представительские;
					Если Сумма >= Выборка.Услуга Тогда
						Сторно = Сумма - Выборка.Услуга;
						Сумма = Выборка.Услуга;
						Стр.ИзменитьСтатусИЛ = Истина;
					Иначе
						Стр.ИзменитьСтатусИЛ = Ложь;
						Сторно = 0;
					КонецЕсли;
				Иначе
					Представительские = Сумма;
					Сумма = 0;
					Сторно = 0;
					Стр.ИзменитьСтатусИЛ = Ложь;

				КонецЕсли;
			Иначе
				Госпошлина = Сумма;	
				Представительские = 0;
				Сумма = 0;
				Сторно = 0;
				Стр.ИзменитьСтатусИЛ = Ложь;

			КонецЕсли;
			Услуга = Выборка.УслугаСсылка;
		КонецЕсли;
		МассивКлючей.Добавить(Стр.ЛицевойСчет);
		Если Сторно < 0 Тогда 
			Стр.Сумма = Стр.Сумма + Сторно;
		КонецЕсли;
		пМассив.Добавить(Госпошлина);	
		пМассив.Добавить(Представительские);	
		пМассив.Добавить(Сумма);	
		пМассив.Добавить(Сторно);	
		пМассив.Добавить(Услуга);
		пМассив.Добавить(Ошибочный);
		пМассив.Добавить(Стр.лб_КлючСтроки);	
		пМассив.Добавить(Стр.ИсполнительныйЛист);
		пМассив.Добавить(Стр.ЛицевойСчет);
		
		Массив.Добавить(пМассив);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСИсполнительныйЛистПриИзменении(Элемент)
	
	ТекущаяСтрока = Объект.СписокЛС.НайтиПоИдентификатору(Элементы.СписокЛС.ТекущаяСтрока);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("лб_КлючСтроки", ТекущаяСтрока.лб_КлючСтроки);
	
	Для каждого стр из Объект.СписокУслуг.НайтиСтроки(ПараметрыОтбора) Цикл
		стр.ИсполнительныйЛист = ТекущаяСтрока.ИсполнительныйЛист;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
