
#Область ПроцедурыОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("НачалоПериода");
	СписокПараметровНаФорме.Добавить("КонецПериода");
	СписокПараметровНаФорме.Добавить("ЛицевойСчет");
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		
		НовыйПараметрКД =  Новый ПараметрКомпоновкиДанных(ИмяПараметра);
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(НовыйПараметрКД);
		
		Если ЗначениеПараметра = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение = ЭтотОбъект[ИмяПараметра];
		
	КонецЦикла;
	 
	// Установим заголовок.
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыВывода.
	НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	
	Ответсвенный = ОтветсвенныйПоЛС();
	
	ЗначениеПараметра.Значение = " Карточка расчетов
	| за период с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy") +"
	| " + ЛицевойСчет.Организация + "
	| по лицевому счету " + ЛицевойСчет + " " + Ответсвенный;
	ЗначениеПараметра.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ОтветсвенныйПоЛС()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)";
	
	Ответсвенный = "";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Ответсвенный = Выборка.ФизЛицо;
		
	КонецЕсли;
	
	Возврат Ответсвенный;
	
КонецФункции // ()

Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	ТабличныйДокумент.Очистить();
	
	Макет = ПолучитьМакет("КарточкаРасчетов");
	
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаСальдо = Макет.ПолучитьОбласть("СтрокаСальдо");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого        = Макет.ПолучитьОбласть("Итого");
	
	Ответсвенный = ОтветсвенныйПоЛС();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК Задолженность,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор КАК Документ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период КАК Дата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начислено,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ТОГДА ""Оплата""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|							ТОГДА ""Скидка по начислению""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|									ТОГДА ""Перерасчет начисления""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|											ТОГДА ""Ввод начальных остатков""
	|										ИНАЧЕ """"
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Операция
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начсиления""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ТОГДА ""Оплата""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|							ТОГДА ""Скидка по начислению""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|									ТОГДА ""Перерасчет начисления""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|											ТОГДА ""Ввод начальных остатков""
	|										ИНАЧЕ """"
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ТОГДА ""Оплата""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|							ТОГДА ""Скидка по начислению""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|									ТОГДА ""Перерасчет начисления""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|											ТОГДА ""Ввод начальных остатков""
	|										ИНАЧЕ """"
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	СУММА(Оплата),
	|	СУММА(Начислено)
	|ПО
	|	ЛицевойСчет";
	
	ОбластьШапка.Параметры.НачалоПериода = Формат(НачалоПериода, "ДФ=dd.MM.yyyy") ;
	ОбластьШапка.Параметры.КонецПериода  = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Организация   = ЛицевойСчет.Организация;
	ОбластьШапка.Параметры.ЛицевойСчет   = ЛицевойСчет;
	ОбластьШапка.Параметры.Ответсвенный  = Ответсвенный;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ОБластьИтого.Параметры.Заполнить(ВыборкаЛС);
		
		Выборка = ВыборкаЛС.Выбрать();
		КоличествоЭлементов = Выборка.Количество();
		
		ТекСтрока = 0;
		Пока Выборка.Следующий() Цикл
			
			Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
			
			ТекСтрока = ТекСтрока + 1;
			
			Если ТекСтрока = 1 Тогда
			
				ОбластьСтрокаСальдо.Параметры.Дата        = Дата;
				ОбластьСтрокаСальдо.Параметры.Задолженность = ?(ЗначениеЗаполнено(Выборка.Документ), 0, Выборка.Задолженность);
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаСальдо);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Документ) Тогда
				
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				ОбластьСтрока.Параметры.Дата = Дата;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
			КонецЕсли;
			
			Если ТекСтрока = КоличествоЭлементов Тогда
				
				ТабличныйДокумент.Вывести(ОБластьИтого);
				
				ОбластьСтрокаСальдо.Параметры.Дата        = Дата;
				ОбластьСтрокаСальдо.Параметры.Задолженность = Выборка.Задолженность;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаСальдо);
				
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти