#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбеспеченияПроведенияДокумента

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам,Отказ, Заголовок)
	
	Если ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаНачальныхПоказаний Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка"  , Ссылка);
		Запрос.УстановитьПараметр("Момент"  , МоментВремени());
		Счетчики = КорректировкаПоказаний.ВыгрузитьКолонку("Счетчик");
		Запрос.УстановитьПараметр("Счетчики", Счетчики);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.НачальныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.КорректировочныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ИсточникПоказаний,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Услуга,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ДатаОтПоказаний
		|ИЗ
		|	Документ.бит_КорректировкаПоказанийСчетчиков.КорректировкаПоказаний КАК бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний
		|ГДЕ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Ссылка = &Ссылка
		|	И бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.НачальныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.КорректировочныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ИсточникПоказаний,
		|	бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Услуга,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ДатаОтПоказаний
		|ИЗ
		|	Документ.бит_КорректировкаПоказанийСчетчиков.КорректировкаПоказаний КАК бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_КорректировкаПоказанийСчетчиков.ТаблицаУслуг КАК бит_КорректировкаПоказанийСчетчиковТаблицаУслуг
		|		ПО бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик = бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Счетчик
		|			И бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет = бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.ЛицевойСчет
		|ГДЕ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Ссылка = &Ссылка
		|	И НЕ бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный
		|	И бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Ссылка = &Ссылка";
		
		ДвижениеСведенийОКорректировке = Движения.бит_СведенияОКорректировкеНачальныхПоказаний;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Движение = ДвижениеСведенийОКорректировке.Добавить();
			
			Движение.Период                    = Дата;
			Движение.ЛицевойСчет               = Выборка.ЛицевойСчет;
			Движение.Счетчик                   = Выборка.Счетчик;
			Движение.Услуга                    = Выборка.Услуга;
			Движение.НачальныеПоказания        = Выборка.НачальныеПоказания;
			Движение.КорректировочныеПоказания = Выборка.КорректировочныеПоказания;
			Движение.ИсточникПоказаний         = Выборка.ИсточникПоказаний;
			Движение.ДатаНачальныхПоказаний    = Выборка.ДатаОтПоказаний;
			
		КонецЦикла; 
		
	Иначе 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Момент", МоментВремени());
		
		Счетчики = КорректировкаПоказаний.ВыгрузитьКолонку("Счетчик");
		
		Запрос.УстановитьПараметр("Счетчики", Счетчики);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.НачальныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.КорректировочныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ИсточникПоказаний,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Услуга
		|ПОМЕСТИТЬ ТаблицаДокумента
		|ИЗ
		|	Документ.бит_КорректировкаПоказанийСчетчиков.КорректировкаПоказаний КАК бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний
		|ГДЕ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Ссылка = &Ссылка
		|	И бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.НачальныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.КорректировочныеПоказания,
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ИсточникПоказаний,
		|	бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Услуга
		|ИЗ
		|	Документ.бит_КорректировкаПоказанийСчетчиков.КорректировкаПоказаний КАК бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_КорректировкаПоказанийСчетчиков.ТаблицаУслуг КАК бит_КорректировкаПоказанийСчетчиковТаблицаУслуг
		|		ПО бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет = бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.ЛицевойСчет
		|			И бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик = бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Счетчик
		|ГДЕ
		|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Ссылка = &Ссылка
		|	И НЕ бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный
		|	И бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПоследниеПоказания,
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) КАК ТекущиеПоказанияИнспектора,
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) КАК ТекущиеПоказанияНаселения,
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) КАК ПоказанияПодкрутка,
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток, 1) КАК Коэффициент,
		|	ТаблицаДокумента.ИсточникПоказаний,
		|	ТаблицаДокумента.КорректировочныеПоказания КАК КорректировочныеПоказания,
		|	ТаблицаДокумента.ЛицевойСчет КАК Объект,
		|	ТаблицаДокумента.Счетчик КАК Счетчик,
		|	ТаблицаДокумента.Услуга КАК Услуга,
		|	ТаблицаДокумента.Счетчик.Разрядность КАК Разрядность,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период,
		|	ЕСТЬNULL(бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать, 1) КАК Использовать
		|ИЗ
		|	ТаблицаДокумента КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Момент, Счетчик В (&Счетчики)) КАК бит_ПоказанияСчетчиковОстатки
		|		ПО ТаблицаДокумента.ЛицевойСчет = бит_ПоказанияСчетчиковОстатки.Объект
		|			И ТаблицаДокумента.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
		|			И ТаблицаДокумента.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(, ) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|		ПО ТаблицаДокумента.Счетчик = бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
		|			И ТаблицаДокумента.Услуга = бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Услуга,
		|	ТаблицаДокумента.ИсточникПоказаний,
		|	ТаблицаДокумента.КорректировочныеПоказания,
		|	ТаблицаДокумента.ЛицевойСчет,
		|	ТаблицаДокумента.Счетчик,
		|	ТаблицаДокумента.Счетчик.Разрядность,
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0),
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0),
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0),
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0),
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток, 1),
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период,
		|	ЕСТЬNULL(бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать, 1)";
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Использовать = Истина Тогда
				
				ЗаписатьДвижения(Организация,Выборка,ВидДвиженияНакопления.Расход, 0);
				ЗаписатьДвижения(Организация,Выборка,ВидДвиженияНакопления.Приход, Выборка.КорректировочныеПоказания);
				
			КонецЕсли;	

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет записи движений по регистрам.
//
Процедура ЗаписатьДвижения(Организация, Выборка, ВидДвижения, ТекущиеПоказания)
	
	ДвижениеРасх = Движения.бит_ПоказанияСчетчиков.Добавить();
	ДвижениеРасх.ВидДвижения = ВидДвижения;
	ДвижениеРасх.Период      = Дата;
	ДвижениеРасх.Объект      = Выборка.Объект;
	ДвижениеРасх.Услуга      = Выборка.Услуга;
	ДвижениеРасх.Счетчик     = Выборка.Счетчик;
	ДвижениеРасх.Коэффициент = Выборка.Коэффициент;
	ДвижениеРасх.Организация   = Организация;
	
	Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
		
		ЭтоПоказанияНаселения = Выборка.ИсточникПоказаний = Перечисления.бит_ИсточникПоказаний.Население;
		
		ДвижениеРасх.ПоследниеПоказания = ТекущиеПоказания;
		
		Если ЭтоПоказанияНаселения Тогда
			ДвижениеРасх.ТекущиеПоказанияНаселения  = ТекущиеПоказания;
			ДвижениеРасх.ТекущиеПоказанияИнспектора = 0;
			ДвижениеРасх.ПоказанияПодкрутка         = 0;
		Иначе
			ДвижениеРасх.ПоказанияПодкрутка         = 0;
			ДвижениеРасх.ТекущиеПоказанияНаселения  = 0;
			ДвижениеРасх.ТекущиеПоказанияИнспектора = ТекущиеПоказания;
		КонецЕсли;
		
	ИначеЕсли  ВидДвижения =  ВидДвиженияНакопления.Расход Тогда
		
		ДвижениеРасх.ПоследниеПоказания         = Выборка.ПоследниеПоказания;
		ДвижениеРасх.ТекущиеПоказанияНаселения  = Выборка.ТекущиеПоказанияНаселения;
		ДвижениеРасх.ТекущиеПоказанияИнспектора = Выборка.ТекущиеПоказанияИнспектора;
		ДвижениеРасх.ПоказанияПодкрутка         = Выборка.ПоказанияПодкрутка;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаТЧ,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	СтруктураПолей = Новый Структура("ЛицевойСчет, Счетчик, ИсточникПоказаний");
	
	Если НЕ ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаПодкрутки Тогда
		СтруктураПолей.Вставить("КорректировочныеПоказания");
	КонецЕсли; 
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "КорректировкаПоказаний", СтруктураПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет дубли строк.
//
Процедура ПроверитьДублиУслуг(ТаблицаПоказаний, Отказ, Заголовок)
	
	ТаблицаДублей = ТаблицаПоказаний.Скопировать();
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1             ,"КоличествоПовторений");
	ТаблицаДублей.Свернуть("ЛицевойСчет,Счетчик,Услуга"  ,"КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке.
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // Повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			МассивСтрок = ТаблицаПоказаний.НайтиСтроки(Новый Структура("ЛицевойСчет,Счетчик", СтрокаТаблицыДублей.ЛицевойСчет,СтрокаТаблицыДублей.Счетчик));
			
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""Лицевой счет"" и ""Счетчик"" указаны одни и те же.";
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
	//6.12.2019       	
	строкаСписка = "";
	для каждого стр из КорректировкаПоказаний цикл
		
	 строкаСписка = строкаСписка + строка(стр.ЛицевойСчет); 	
	 строкаСписка = строкаСписка + ",";
		
    конеццикла;	
	если строкаСписка <> "" тогда
	 попытка	
	  СписокЛицевыхСчетов = Сред(строкаСписка, 0, СтрДлина(строкаСписка) - 1); 
     исключение
	 конецпопытки; 
	конецесли; 

	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"               ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Счетчик"                   ,"Счетчик");
	СтруктураПолей.Вставить("Услуга"                    ,"Услуга");
	СтруктураПолей.Вставить("НачальныеПоказания"        ,"НачальныеПоказания");
	СтруктураПолей.Вставить("ДатаОтПоказаний"           ,"ДатаОтПоказаний");
	СтруктураПолей.Вставить("КорректировочныеПоказания" ,"КорректировочныеПоказания");
	
	РезультатЗапросаПоПоказаниям = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "КорректировкаПоказаний", СтруктураПолей);
	ТаблицаПоказаний          = РезультатЗапросаПоПоказаниям.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоказаний, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	ПроверитьДублиУслуг(ТаблицаПоказаний, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоказаний, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПоказанияНаселения = Истина;
	Ответственный      = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	ВидОперации        = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаОшибочныхПоказаний;
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли