
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.МакетКвитанции,
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Ссылка КАК Настройка
	|ПОМЕСТИТЬ ПредопределенныеНастройки
	|ИЗ
	|	Справочник.бит_НастройкиПечатиМакетовСчетИзвещений КАК бит_НастройкиПечатиМакетовСчетИзвещений
	|ГДЕ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.МакетКвитанции КАК МакетКвитанции,
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.НастройкаМакета
	|ПОМЕСТИТЬ НастройкиПользователя
	|ИЗ
	|	РегистрСведений.бит_ТекущиеНастройкиМакетовСчетИзвещений КАК бит_ТекущиеНастройкиМакетовСчетИзвещений
	|ГДЕ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ВариантыСчетовИзвещений.Ссылка КАК МакетКвитанции,
	|	ВЫБОР
	|		КОГДА НастройкиПользователя.НастройкаМакета ЕСТЬ NULL 
	|			ТОГДА ПредопределенныеНастройки.Настройка
	|		ИНАЧЕ НастройкиПользователя.НастройкаМакета
	|	КОНЕЦ КАК НастройкаМакета,
	|	бит_ВариантыСчетовИзвещений.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ВариантыСчетовИзвещений КАК бит_ВариантыСчетовИзвещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредопределенныеНастройки КАК ПредопределенныеНастройки
	|		ПО (ПредопределенныеНастройки.МакетКвитанции = бит_ВариантыСчетовИзвещений.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиПользователя КАК НастройкиПользователя
	|		ПО бит_ВариантыСчетовИзвещений.Ссылка = НастройкиПользователя.МакетКвитанции
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПредопределенныеНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиПользователя";
	
	Настройки = Запрос.Выполнить().Выбрать();
	
	Пока Настройки.Следующий() Цикл
		
		НоваяСтрока = ТаблицаНастроек.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройки);
		
		Если Настройки.МакетКвитанции = Параметры.ТекущаяСтрока Тогда
			Индекс = ТаблицаНастроек.Индекс(НоваяСтрока);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Элементы.ТаблицаНастроек.ТекущаяСтрока = Индекс;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекНастройкаКвитанцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ТаблицаНастроек.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("МакетКвитанции", ТекущаяСтрока.МакетКвитанции);
	
	ОткрытьФорму("Справочник.бит_НастройкиПечатиМакетовСчетИзвещений.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНастройки();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// Процедура записывает настройки.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаписатьНастройки()
	
	Для каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
		
		Запись = РегистрыСведений.бит_ТекущиеНастройкиМакетовСчетИзвещений.СоздатьМенеджерЗаписи();
		Запись.МакетКвитанции  = СтрокаТаблицы.МакетКвитанции;
		Запись.Пользователь    = ТекущийПользователь;
		Запись.НастройкаМакета = СтрокаТаблицы.НастройкаМакета;
		
		Запись.Записать(Истина);
		
	КонецЦикла; 
	
КонецПроцедуры // () 

#КонецОбласти