
#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ));
	
	КэшированныеЗначения.Вставить("Перечисления", КэшПеречисления);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура РегистрацияПоМестуЖительства(Команда)
	ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации", ВидОперации));
	ОткрытьФорму("Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.Форма.ФормаДокументаУправляемая", СтруктураПараметры, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияПоМестуПребывания(Команда)
	ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации", ВидОперации));
	ОткрытьФорму("Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.Форма.ФормаДокументаУправляемая", СтруктураПараметры, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСРегистрационногоУчета(Команда)
	
	ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации", ВидОперации));
	ОткрытьФорму("Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.Форма.ФормаДокументаУправляемая", СтруктураПараметры, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятиеВСвязиСоСмертью(Команда)
	
	ВидОперации = мКэшЗначений.Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеВСвязиСоСмертью;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации", ВидОперации));
	ОткрытьФорму("Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.Форма.ФормаДокументаУправляемая", СтруктураПараметры, Элементы.Список);
	
КонецПроцедуры

#КонецОбласти