
#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	Документ       = Метаданные.Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ;
	ПравоИзменения = ПравоДоступа("Изменение", Документ);
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_ВидыОпераций"            			, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ));
	КэшПеречисления.Вставить("бит_ВариантыИзмененияМестаПребывания" , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВариантыИзмененияМестаПребывания));
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("ПравоИзменения"      , ПравоИзменения);
	КэшированныеЗначения.Вставить("Перечисления"        , КэшПеречисления);
	
	КэшированныеЗначения.Вставить("ОткудаПрибылПредставление", Неопределено);
	КэшированныеЗначения.Вставить("КудаВыписанПредставление", Неопределено);
	
	ПодчиненныйДокумент = НайтиПодчиненныйДокумент(Объект.Ссылка);
	КэшированныеЗначения.Вставить("ПодчиненныйДокумент", ПодчиненныйДокумент);
	
	ПодчиненныйДокументПроживание = НайтиПодчиненныйДокументПроживание(Объект.Ссылка);
	КэшированныеЗначения.Вставить("ПодчиненныйДокументПроживание", ПодчиненныйДокументПроживание);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	// КЭШ Виды опреации.
	РегистрацияПМЖ = Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства;
	РегистрацияПМП = Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания;
	СнятиеСРег     = Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета;
	СнятиеПоСмерти = Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеВСвязиСоСмертью;
	
	// КЭШ Варианты изменения места пребывания.
	ДругаяПричина         = Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ДругаяПричина;
	ВТомЖеГородеСДрАдреса = Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ВТомЖеГородеСДругогоАдреса;
	СДругогоГорода        = Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СДругогоГорода;
	СменаПаспорта         = Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаПаспорта;
	СменаФамилии          = Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии;
	
	// Управление видимостью элементов.
	Элементы.ДатаРегистрации.Видимость        = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ДатаСнятияСРегистрации.Доступность = СнятиеСРег ИЛИ РегистрацияПМП ИЛИ СнятиеПоСмерти;
	
	Элементы.РегистрируемоеЛицо.Видимость = НЕ СнятиеСРег;
	Элементы.РешениеСуда.Видимость = СнятиеСРег;
	Элементы.ВременнаяРегистрация.Видимость = СнятиеСРег Или СнятиеПоСмерти;
	Элементы.ПравоустанавливающиеДокументы.Видимость = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ОтветственныеЗаРегистрацию.Видимость = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.СнимаемыеСРегУчета.Видимость = СнятиеСРег;
	Элементы.ПринятоеРешение.Видимость   = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ОткудаПрибыл.Видимость      = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.СнимаемыеСРегУчетаПроживающий.КнопкаСоздания = Ложь;
	
	Элементы.ГруппаКудаВыписан.Видимость = СнятиеСРег;
	
	Если  СнятиеСРег  ИЛИ СнятиеПоСмерти Тогда
		Элементы.ОрганФМС.Заголовок = "Орган ФМС выбытия";	
	Иначе
		Элементы.ОрганФМС.Заголовок = "Орган ФМС откуда прибыл";
	КонецЕсли;
	
	// Установка видимости кнопок печати.
	Элементы.ФормаПечатьЗОССРУПМЖ.Видимость = РегистрацияПМЖ;
	
	Элементы.ФормаПечатьЗОССРУПМЖ_2часть.Видимость       = РегистрацияПМЖ ИЛИ СнятиеСРег;
	Элементы.ФормаПечатьАЛП.Видимость             = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ФормаПечатьЛСУП.Видимость            = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ФормаПечатьКР.Видимость              = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ФормаПечатьСОРГ_РФ_ПМЖ.Видимость     = РегистрацияПМЖ;
	Элементы.ФормаПечатьСОРГ_РФ_ПМЖ_Old.Видимость = РегистрацияПМЖ;
	Элементы.ФормаПечатьАЛП_стар.Видимость        = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ФормаПечатьЗОРПМЖ.Видимость          = РегистрацияПМП;
	Элементы.ФормаПечатьАнкета.Видимость          = РегистрацияПМП;
	
	Элементы.ФормаПечатьЗаявлениеРФ1.Видимость  = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ФормаПечатьЗаявлениеРФ2.Видимость  = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ФормаПечатьЗаявлениеСНГ1.Видимость = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	Элементы.ФормаПечатьЗаявлениеСНГ2.Видимость = РегистрацияПМЖ ИЛИ РегистрацияПМП;
	
	Элементы.ФормаПечатьУВОРУ.Видимость    = СнятиеСРег;
	Элементы.ФормаПечатьАЛУ_стар.Видимость = СнятиеСРег;
	Элементы.ФормаПечатьСопроводительноеПисьмо.Видимость = СнятиеСРег;
	Элементы.ФормаПечатьАЛУ.Видимость  = РегистрацияПМЖ ИЛИ СнятиеСРег ИЛИ СнятиеПоСмерти;
	Элементы.ФормаПечатьЛСУВ.Видимость = РегистрацияПМЖ ИЛИ СнятиеСРег;
	
	Элементы.СвидетельствоОСмерти.Видимость  = СнятиеПоСмерти;
	Элементы.СменаФамилииНа.Видимость        = СменаФамилии;
	
	Элементы.ОрганФМСКудаПрибыл.Видимость                   = Не СнятиеПоСмерти;
	//	Элементы.ОтветственныйЗаРегистрацию.Видимость = Не СнятиеПоСмерти;
	
	Элементы.ПодборПроживающих.Видимость     = (РегистрацияПМЖ ИЛИ РегистрацияПМП);
	Элементы.УдостоверениеЛичности.Видимость = СменаПаспорта;
	
	Элементы.КонтактнаяИнформацияПолеОткудаПрибылПредставление.Доступность = НЕ Объект.ОткудаПрибылИзЛС;
	Элементы.КонтактнаяИнформацияПолеКудаВыписанПредставление.Доступность  = НЕ Объект.КудаВыписанИзЛС;
	
	Если мКэшЗначений.ПодчиненныйДокумент = Неопределено Тогда
		Элементы.ФормаСвПоМестуПребывания.Видимость = Ложь;
	Иначе
		Элементы.ФормаСвПоМестуПребывания.Видимость = Истина;
	КонецЕсли;
	
	Если мКэшЗначений.ПодчиненныйДокументПроживание = Неопределено Тогда
		Элементы.ФормаСвПоМестуПроживания.Видимость = Ложь;
	Иначе
		Элементы.ФормаСвПоМестуПроживания.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	РазместитьКонтактнуюИнформацию();
	
	Отбор = Новый Структура();
	
	//Установить видимость реквизитов и заголовков колонок.
	УправлениеЭлементамиФормы();
	Адрес = ПолучитьУлицуЛицевогоСчета(Объект.ЛицевойСчет);
	ЭтаФорма.АдресЛицевойСчет = Адрес;
	
	// БИТ ЖКХ 14.01.2020
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	// СтандартныеПодсистемы.Печать.
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаКнопок3);
	// Конец СтандартныеПодсистемы.Печать.
	
	Элементы.ГруппаКнопок3.Вид = ВидГруппыФормы.ГруппаКнопок;
	
	Массив = Новый Массив();
	Массив.Добавить(Тип("СправочникСсылка.бит_Проживающие"));
	ОписаниеТипаПроживающие = Новый ОписаниеТипов(Массив);
	Элементы.ФизическиеЛицаФизическоеЛицо.ОграничениеТипа = ОписаниеТипаПроживающие;
	
	
	//Автозаполнение ответственных за регистрацию из поля собственник	
	
	Если ПроверитьВозраст(Объект.РегистрируемоеЛицо) ИЛИ Объект.ЗаконныйПредставительВСвязиСНедееспособностью Тогда
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Истина;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Истина;
		
	Иначе
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Ложь;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Ложь;
		
		Объект.СтепеньРодстваЗаконногоПредставителя = Неопределено;
		Объект.ЗаконныйПредставитель = Неопределено;
	КонецЕсли;
	
	Если Объект.ОткудаПрибылИзЛС Тогда 
		ИзменитьОткудаПрибылИзЛС();
	КонецЕсли;
	Если Объект.КудаВыписанИзЛС Тогда
		ИзменитьКудаВыписанИзЛС();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РегистрируемоеЛицо) Тогда
		ЗаполнитьСвидетельствоОСмерти(Объект.РегистрируемоеЛицо);
		УстановитьДатуСнятия(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			Проживающий =  Объект.РегистрируемоеЛицо;
			ДатаРегистрации =  ПолучитьДатуРегистрации(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо); 
			Объект.ДатаРегистрации = ДатаРегистрации;
			
			
			ТЗСнимаемыеСРег = Новый ТаблицаЗначений;
			ТЗСнимаемыеСРег.Колонки.Добавить("Проживающий");
			ТЗСнимаемыеСРег.Колонки.Добавить("ДатаРегистрации");
			
			СтрокаТЗ =  ТЗСнимаемыеСРег.Вставить(0);
			
			СтрокаТЗ.Проживающий = Проживающий;
			СтрокаТЗ.ДатаРегистрации = ДатаРегистрации;
			
			Объект.СнимаемыеСРегУчета.Загрузить(ТЗСнимаемыеСРег);
			Объект.РегистрируемоеЛицо = ТЗСнимаемыеСРег[0].Проживающий;
			
		КонецЕсли;
		
		
	Иначе
		
		Объект.СнимаемыеСРегУчета.Очистить();
		Объект.РегистрируемоеЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОткудаПрибылАдрес = мКэшЗначений.ОткудаПрибылПредставление;
	ТекущийОбъект.КудаВыписанАдрес = мКэшЗначений.КудаВыписанПредставление;
	
	//ТекущийОбъект.ОткудаПрибылАдресЗапятые = ОткудаПрибылПредставлениеЗапятые;
	//
	//Для Каждого Строка из ТекущийОбъект.КонтактнаяИнформация Цикл
	//	
	//	Если Строка.Вид  = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ОткудаПрибылПредставление") Тогда
	//		
	//		Строка.ПредставлениеЗапятые = ОткудаПрибылПредставлениеЗапятые;
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	//
	//ТекущийОбъект.КудаВыписанАдресЗапятые = КудаВыписанПредставлениеЗапятые;
	//
	//Для Каждого Строка из ТекущийОбъект.КонтактнаяИнформация Цикл
	//	
	//	Если Строка.Вид  = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.КудаВыписанПредставление") Тогда
	//		
	//		Строка.ПредставлениеЗапятые = КудаВыписанПредставлениеЗапятые;
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мКэшЗначений.ОткудаПрибылПредставление = Элементы.КонтактнаяИнформацияПолеОткудаПрибылПредставление.ТекстРедактирования;
	мКэшЗначений.КудаВыписанПредставление = Элементы.КонтактнаяИнформацияПолеКудаВыписанПредставление.ТекстРедактирования;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Модифицированность = Ложь;
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
КонецПроцедуры

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Закрытие" Тогда
		
		ПодчиненныйДокумент = НайтиПодчиненныйДокумент(Объект.Ссылка);
		Если ПодчиненныйДокумент = Неопределено Тогда
			
			Элементы.ФормаСвПоМестуПребывания.Видимость = Ложь;
			
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЗакрытиеПроживание" Тогда
		
		ПодчиненныйДокументПроживание = НайтиПодчиненныйДокументПроживание(Объект.Ссылка);
		
		Если ПодчиненныйДокументПроживание = Неопределено Тогда
			
			Элементы.ФормаСвПоМестуПроживания.Видимость = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ДокументЗаписан" Тогда
		
		Элементы.ФормаСвПоМестуПребывания.Видимость = Истина;
		
	ИначеЕсли ИмяСобытия = "ДокументЗаписанПроживание" Тогда
		
		Элементы.ФормаСвПоМестуПроживания.Видимость = Истина;
		
	ИначеЕсли ИмяСобытия = "СменаФамилииПоМЖ" Тогда
		
		Объект.СменаФамилииНа = "" + Параметр.Фамилия + " " + Параметр.Имя + " " + Параметр.Отчество;
		
	ИначеЕсли ИмяСобытия = "СменаУдостоверенияЛичностиПоМЖ" Тогда
		
		Объект.УдостоверениеЛичности = "" + Параметр.ДокументВид + ", серия: " + Параметр.ДокументСерия + ", № " + Параметр.ДокументНомер 
		+ ", выдан: " + Формат(Параметр.ДокументДатаВыдачи,"ДФ='дд ММММ гггг'; ДП='Не указано'") + " года, " 
		+ Параметр.ДокументКемВыдан + ", № подр. " + Параметр.ДокументКодПодразделения 
		+ Символы.Таб + "Дата регистрации по месту жительства: " + Формат(Параметр.ДатаРегистрацииПоМестуЖительства,"ДФ='дд ММММ гггг'; ДП='Не указано'");
		
		Объект.УдостоверениеЛичности = СтрЗаменить(Объект.УдостоверениеЛичности,"Не указано","...");
		
		Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "СнятиеПоСмертиПоМЖ" Тогда
		
		СвидетельствоОСмерти = "а/з " + Параметр.Номер + ", от " + Формат(Параметр.ДатаСоставления,"ДФ='дд ММММ гггг'; ДП='Не указано'")+", " 
		+ Параметр.КемВыдано + ", свидетельство о смерти " + Параметр.СерияСвидетельства
		+ ", №" + Параметр.НомерСвидетельства + ", " + Параметр.КемВыдано 
		+ ", от " + Формат(Параметр.ДатаВыдачи,"ДФ='дд ММММ гггг'; ДП='Не указано'");
		
		СвидетельствоОСмерти = СтрЗаменить(СвидетельствоОСмерти,"Не указано","...");
		
		Если НЕ СвидетельствоОСмерти = Объект.СвидетельствоОСмерти Тогда
			
			Модифицированность          = Истина;
			Объект.СвидетельствоОСмерти = СвидетельствоОСмерти;
			
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура ФормаПечатьЗОССРУПМЖ(Команда)
	
	Результат = Сформировать("ЗОССРУПМЖ");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"ЗОРПМЖ"
	,"Ф6:Заявление о регистрации по месту жительства"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЗОССРУПМЖ_2части(Команда)
	Результат = Сформировать("ЗОССРУПМЖ_2части");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"ЗОССРУПМЖ_New"
	,"Ф6:Заявление о регистрации и снятии по месту жительства"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьАЛП(Команда)
	
	Результат = ПечатьАЛП(Истина);
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"АЛП_стар"
	,"Ф2:Адресный листок прибытия"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьКР(Команда)
	Результат = Сформировать("КР_New");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"КР_New"
	,"Ф9:Карточка регистрации"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЛСУП(Команда)
	Результат = Сформировать("ЛСУП");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"ЛСУП"
	,"Ф12П:Листок статистического учета прибытия"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьСОРГ_РФ_ПМЖ(Команда)
	Результат = Сформировать("СОРГ_РФ_ПМЖ");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"СОРГ_РФ_ПМЖ"
	,"Сведения о регистрации гражданина РФ по месту жительства"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьСОРГ_РФ_ПМЖ_Old(Команда)
	Результат = Сформировать("СОРГ_РФ_ПМЖ_Old");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"СОРГ_РФ_ПМЖ_Old"
	,"Сведения о регистрации гражданина РФ по месту жительства с детьми"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьСОРПМПЖ(Команда)
	Результат = Сформировать("СОРПМПЖ");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"СОРПМПЖ"
	,"Свидетельство о регистрации по месту жительства"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьАЛП_стар(Команда)
	Результат = Сформировать("АЛП_стар");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"АЛП"
	,"Адресный листок прибытия"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьАЛУ(Команда)
	
	Результат = ПечатьАЛУ(Истина);
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"АЛУ"
	,"Адресный листок убытия"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЛСУВ(Команда)
	Результат = Сформировать("ЛСУВ");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"ЛСУВ"
	,"Листок статистического учета выбытия"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЗОРПМЖ(Команда)
	Результат = Сформировать("ЗОРПМЖ");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"ЗОРПМЖ"
	,"Заявление о регистрации по месту пребывания (Ф№1)"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьАнкета(Команда)
	Результат = Сформировать("Анкета");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"Анкета_New"
	,"Анкета"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьСОРПМП(Команда)
	Результат = Сформировать("СОРПМП");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"СОРПМП"
	,"Свидетельство о регистрации по месту жительства"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьУВОРУ(Команда)
	Результат = Сформировать("УВОРУ");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"УВОРУ"
	,"Уведомление в орган регистрационного учета"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьАЛУ_стар(Команда)
	Результат = ПечатьАЛУ();
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"АЛУ"
	,"Адресный листок убытия"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЗаявлениеСНГ1(Команда)
	Результат = Сформировать("ЗаявлениеСНГ1");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"Заявление"
	,"Заявление"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЗаявлениеСНГ2(Команда)
	Результат = Сформировать("ЗаявлениеСНГ2");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"Заявление"
	,"Заявление"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЗаявлениеРФ1(Команда)
	Результат = Сформировать("ЗаявлениеРФ1");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"Заявление"
	,"Заявление"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьЗаявлениеРФ2(Команда)
	Результат = Сформировать("ЗаявлениеРФ2");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"Заявление"
	,"Заявление"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПечатьСопроводительноеПисьмо(Команда)
	
	Результат = Сформировать("СопроводительноеПисьмо");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявлениеОРегистрацииПоМестуПЖ"
	,"СопроводительноеПисьмо"
	,"СопроводительноеПисьмо"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СвПоМестуПроживания(Команда)
	
	ПодчиненныйДокументПроживание = НайтиПодчиненныйДокументПроживание(Объект.Ссылка);
	
	Если ПодчиненныйДокументПроживание <> Неопределено Тогда
		
		ОткрытьФорму("Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания.Форма.ФормаДокументаУправляемая",Новый Структура("Ключ",ПодчиненныйДокументПроживание), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.ФизическиеЛица.Очистить();
	
	Объект.РегистрируемоеЛицо		  = Неопределено;
	Объект.ДолжностноеЛицо			  = Неопределено;
	Объект.ЛицевойСчет		          = Неопределено;
	Объект.ОтветственныйЗаРегистрацию = Неопределено;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая",,Элемент);
	
	ОтборОрганизации = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборОрганизации.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
	ОтборОрганизации.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборОрганизации.ПравоеЗначение = Объект.Организация;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрируемоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеВСвязиСоСмертью") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета") Тогда
		
		ДанныеВыбора = ПолучитьСписокПроживающих(Объект.ЛицевойСчет, Объект.Дата);
		
	Иначе
		
		ФормаВыбора = ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая",Новый Структура("ТекущаяСтрока", Объект.РегистрируемоеЛицо),Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаРегистрациюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткудаПрибылПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.ОткудаПрибыл               = Неопределено;
	Объект.СвидетельствоОСмерти       = "";
	Объект.ОтветственныйЗаРегистрацию = Неопределено;
	Объект.ОрганФМС                   = Неопределено;
	//Объект.ДатаРегистрации            = Неопределено;
	
	//Объект.ДатаСнятияСРегистрации     = Неопределено;
	//Объект.СнимаемыеСРегУчета.Очистить();
	//Объект.ОтветственныеЗаРегистрацию.Очистить();
	//Объект.ПравоустанавливающиеДокументы.Очистить();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция Сформировать(ИмяМакета)
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "ЗОРПМЖ" тогда
		
		ТабДокумент = ПечатьЗОРПМЖ();
		
	ИначеЕсли ИмяМакета = "КР_New" тогда
		
		ТабДокумент = ПечатьКР();
		
	ИначеЕсли ИмяМакета = "ЛСУП" тогда
		
		ТабДокумент = ПечатьЛСУП();
		
	ИначеЕсли ИмяМакета = "ЗОССРУПМЖ" тогда
		
		ТабДокумент = ПечатьЗОССРУПМЖ(Ложь);
		
	ИначеЕсли ИмяМакета = "ЗОССРУПМЖ_2части" тогда
		
		ТабДокумент = ПечатьЗОССРУПМЖ(Истина);
		
	ИначеЕсли ИмяМакета = "АЛУ" тогда
		
		ВидМакета = истина;
		ТабДокумент = ПечатьАЛУ(ВидМакета);
		
	ИначеЕсли ИмяМакета = "АЛУ_стар" тогда
		
		ВидМакета = ложь;
		ТабДокумент = ПечатьАЛУ(ВидМакета);
		
	ИначеЕсли ИмяМакета = "ЛСУВ" тогда
		
		ТабДокумент = ПечатьЛСУВ();
		
	ИначеЕсли ИмяМакета = "УВОРУ" тогда
		
		ТабДокумент = ПечатьУВОРУ();
		
	ИначеЕсли  ИмяМакета = "АЛП" тогда	
		
		ВидМакета = Истина;
		ТабДокумент = ПечатьАЛП(ВидМакета);
		
	ИначеЕсли  ИмяМакета = "АЛП_стар" тогда	
		
		ВидМакета = Ложь;
		ТабДокумент = ПечатьАЛП(ВидМакета);
		
	ИначеЕсли  ИмяМакета = "Анкета" тогда	
		
		ТабДокумент = ПечатьАнкета();
		
	ИначеЕсли  ИмяМакета = "СОРГ_РФ_ПМЖ" тогда	
		
		ТабДокумент = ПечатьСОРГ_РФ_ПМЖ();
		
	ИначеЕсли  ИмяМакета = "СОРГ_РФ_ПМЖ_Old" тогда	
		
		ТабДокумент = ПечатьСОРГ_РФ_ПМЖ(Ложь);
		
	ИначеЕсли ИмяМакета = "СОРПМП" Тогда
		
		ТабДокумент = ПечатьСОРПМП();
		
	ИначеЕсли ИмяМакета = "СОРПМПЖ" Тогда
		
		ТабДокумент = ПечатьСОРПМПЖ();
		
	ИначеЕсли ИмяМакета = "ЗаявлениеСНГ1" Тогда
		
		ТабДокумент = ПечатьЗаявление(Ложь);
		
	ИначеЕсли ИмяМакета = "ЗаявлениеРФ1" Тогда
		
		ТабДокумент = ПечатьЗаявление();
		
	ИначеЕсли ИмяМакета = "ЗаявлениеСНГ2" Тогда
		
		ТабДокумент = ПечатьЗаявление(Ложь, Ложь);
		
	ИначеЕсли ИмяМакета = "ЗаявлениеРФ2" Тогда
		
		ТабДокумент = ПечатьЗаявление(, Ложь);
		
	ИначеЕсли ИмяМакета = "СопроводительноеПисьмо" Тогда
		
		ТабДокумент = ПечатьСопроводительноеПисьмо();
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция ПечатьСопроводительноеПисьмо()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий КАК Проживающий,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОрганФМС КАК ОрганФМС,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.ДатаРождения КАК ПроживающийДатаРождения,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОрганФМСКудаПрибыл КАК ОрганФМСКудаПрибыл,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОткудаПрибылАдрес КАК ОткудаПрибылАдрес,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОрганФМСКудаПрибыл.Руководитель КАК ОрганФМСКудаПрибылРуководитель,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.КудаВыписанАдрес КАК КудаВыписанАдрес,
	               |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартирыЛС
	               |ИЗ
	               |	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.СнимаемыеСРегУчета КАК бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	               |		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	               |ГДЕ
	               |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент", Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ОсновныеРеквизитыЗаполнены = Ложь;
	
	ОрганФМСВыбытия = "";
	ОткудаыПрибылАдрес = "";
	ОрганФМСКудаПрибыл = "";
	
	РегЛицаСтр = "";
	КоличествоПроживающих = 0;
	
	АдрПриб = ЭтаФорма.КонтактнаяИнформацияПолеОткудаПрибылПредставление;
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ОсновныеРеквизитыЗаполнены Тогда
			
			ОрганФМСВыбытия = Выборка.ОрганФМС;			
			ОткудаПрибылАдрес = АдрПриб;
			ОрганФМСКудаПрибыл = Выборка.ОрганФМСКудаПрибыл;	
			
			ОсновныеРеквизитыЗаполнены = Истина;
			
		КонецЕсли;
		
		РегЛицаСтр = РегЛицаСтр + Выборка.Проживающий + " " 
		+ ?(ЗначениеЗаполнено(Выборка.ПроживающийДатаРождения),Формат(Выборка.ПроживающийДатаРождения,"ДФ=dd.MM.yyyy" ) + "г.р", "")
		+ "; ";
		
		КоличествоПроживающих = КоличествоПроживающих + 1;
		
	КонецЦикла;
	
	РегЛицаСтр = УбратьПоследнийСимвол(РегЛицаСтр, ";") + ".";
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("СопроводительноеПисьмо");
	
	ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
	ОбластьРегЛицо = Макет.ПолучитьОбласть("РегЛица");
	ОбластьПодписьРегЛица = Макет.ПолучитьОбласть("ПодписьРегЛица");
	ОбластьАдрес  = Макет.ПолучитьОбласть("Адрес");
	ОбластьАдресДопСтрока = Макет.ПолучитьОбласть("АдресДопСтрока");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Если КоличествоПроживающих > 1 Тогда		
		
		ОбластьАдрес.Параметры.СтрокаФормы = "которые обратились к нам по вопросу регистрации по м/ж в гор. Омске, были зарегистрированы" 	
	Иначе 
		
		ОбластьАдрес.Параметры.СтрокаФормы = "который(а) обратился к нам по вопросу регистрации по м/ж в гор. Омске, был(а) зарегистрирован(а)" 	
	КонецЕсли;
	
	//Орган ФМС Выбытия
	ОФМСВыбытия1 = "";
	ОФМСВыбытия2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки("" + ОрганФМСВыбытия, 42, ОФМСВыбытия1, ОФМСВыбытия2);
	
	ОбластьШапка.Параметры.ОрганФМСВыбытия1  = ОФМСВыбытия1;
	ОбластьШапка.Параметры.ОрганФМСВыбытия2  = ОФМСВыбытия2;
	
	//Лица снятые с регистрации
	РегЛицо1 = "";                          
	РегЛицо2 = "";

// + Мурас Д.А. 16.02.2023 - Задача 6826 - некорректный перенос Фамилии Имени Отчества
// Отключена процедура: бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки по причине 
// необходимости отключить переносы (запрещено переносить имена собственные, русский язык 4 класс)
// Отключен перенос по слогам, изменен перенос по словам в ФИО:

//	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(РегЛицаСтр , 15, РегЛицо1, РегЛицо2);
	
	Длина = 19;
	Если СтрДлина(РегЛицаСтр) <= Длина Тогда
		РегЛицо1 = РегЛицаСтр;
		РегЛицо2 = "";
	Иначе
		КонецСлова = Длина + 1;
		ПоказательДлины = Сред(РегЛицаСтр, КонецСлова, 1);
		Пока ПоказательДлины <> " " И КонецСлова > 0  Цикл
			ПоказательДлины = Сред(РегЛицаСтр, КонецСлова, 1);
			КонецСлова = КонецСлова - 1;
		КонецЦикла;
		РегЛицо1 = Лев(РегЛицаСтр, КонецСлова);
		РегЛицо2 = Прав(РегЛицаСтр, СтрДлина(РегЛицаСтр) - КонецСлова - 1);
	КонецЕсли;
// - Мурас Д.А. 16.02.2023

	ОбластьШапка.Параметры.РегЛицо1 = РегЛицо1;
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	//Цикл
	ДлиннаРегЛица = СтрДлина(РегЛицаСтр);
	ДлиннаТекСтроки = 15;
	ПерваяСтрока = Истина;	
	Пока ДлиннаТекСтроки < ДлиннаРегЛица  Цикл
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(РегЛицо2, 85, РегЛицо1 , РегЛицо2 );
		ОбластьРегЛицо.Параметры.РегЛицо2 = РегЛицо1;
		ДлиннаТекСтроки = ДлиннаТекСтроки + 85;
		ТабДокумент.Вывести(ОбластьРегЛицо);
		Если ПерваяСтрока Тогда
			
			ПерваяСтрока= Ложь;
			ТабДокумент.Вывести(ОбластьПодписьРегЛица);
			
		КонецЕсли;	
		
	КонецЦикла;		
	
	//Адрес регистрации
	ОткудаПрибылАдрес1 = "";
	ОткудаПрибылАдрес2 = "";
	
	ОткудаПрибылАдрес = ОткудаПрибылАдрес +  ?(Не Объект.ОткудаПрибылИзЛС, ", кв. " + Выборка.ПредставлениеКвартирыЛС, "");
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ОткудаПрибылАдрес, 80, ОткудаПрибылАдрес1, ОткудаПрибылАдрес2);
	
	ОбластьАдрес.Параметры.АдресРегистрацииПоМЖ1 = ОткудаПрибылАдрес1;
	ТабДокумент.Вывести(ОбластьАдрес);
	Если НЕ ОткудаПрибылАдрес2 = "" Тогда
		
		ОбластьАдресДопСтрока.Параметры.АдресРегистрацииПоМЖ2 = ОткудаПрибылАдрес2;
		ТабДокумент.Вывести(ОбластьАдресДопСтрока);
		
	КонецЕсли;
	
	//ОрганФМС Куда прибыл
	ОФМС1 = "";
	ОФМС2 = "";
	
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки("" + Выборка.ОрганФМСКудаПрибыл, 45, ОФМС1, ОФМС2);
	ОбластьПодвал.Параметры.ОрганФМС1 = ОФМС1; 
	ОбластьПодвал.Параметры.ОрганФМС2 = ОФМС2;
	ОбластьПодвал.Параметры.ФИОИнициалы = ПолучитьИнициалы(Выборка.ОрганФМСКудаПрибылРуководитель);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ПустаяОбласть = Макет.ПолучитьОбласть("Пустая"); 
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДокумент2 = Новый ТабличныйДокумент;
	Макет2 =	Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("СопроводительноеПисьмо");
	ПустаяОбласть2 = Макет2.ПолучитьОбласть("Пустая");
	МассивОбластей2 = Новый Массив;
	МассивОбластей2.Добавить(ПустаяОбласть2);
	МассивОбластей2.Добавить(ПустаяОбласть2);
	
	Пока ТабДокумент2.ПроверитьВывод(МассивОбластей2) Цикл
		ТабДокумент2.Вывести(ПустаяОбласть2);	
	КонецЦикла;
	
	ВысотаСтраницы = ВысотаОбластиТабДока(ТабДокумент2);
	
	ОбластьОбратнаяСторона = Макет.ПолучитьОбласть("ОбратнаяСторона");
	
	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить(ПустаяОбласть);
	МассивОбластей.Добавить(ОбластьОбратнаяСторона);
	
	ВысотаОбратнойСтороны = ВысотаОбластиТабДока(ОбластьОбратнаяСторона);
	ВысотаПустойОбласти = (ВысотаСтраницы/2)-ВысотаОбратнойСтороны;
	
	ПустаяОбластьТД = ТабДокумент.Вывести(ПустаяОбласть);
	
	ПустаяОбластьТД.ВысотаСтроки = ВысотаПустойОбласти;
	
	ТабДокумент.Вывести(ОбластьОбратнаяСторона);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция вызывает форму печати табличного документа с печатной формой.
// Инвентаризационной описи основных средств.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьЗОРПМЖ()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	// Добавление ФИО ответственного за регистрацию из регистра.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация КАК Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий КАК Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	ВЫБОР
	|		КОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения ЕСТЬ NULL
	|				ИЛИ бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &Момент < бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РАЗНОСТЬДАТ(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, &Момент, ГОД)
	|	КОНЕЦ КАК РегЛицоВозраст,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование КАК ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл КАК ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации КАК ВидОперации,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКодПодразделения КАК ДокументКодПодразделенияПред,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Дата КАК ДатаСвидетельства,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Номер КАК НомерСвидетельства,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК ФамилияПред,
	|	бит_ФИОПроживающихСрезПоследних.Имя КАК ИмяПред,
	|	бит_ФИОПроживающихСрезПоследних.Отчество КАК ОтчествоПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.СтепеньРодства КАК СтепеньРодства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо КАК ДолжностноеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес КАК ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес КАК КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия КАК ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия КАК ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуС КАК ПериодРегистрацииПоПрежнемуАдресуС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуПо КАК ПериодРегистрацииПоПрежнемуАдресуПо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЗаконныйПредставитель КАК ЗаконныйПредставитель,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЗаконныйПредставительВСвязиСНедееспособностью КАК ЗаконныйПредставительВСвязиСНедееспособностью,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.СтепеньРодстваЗаконногоПредставителя КАК СтепеньРодстваЗаконногоПредставителя,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМСКудаПрибыл КАК ПаспортнаяСлужба,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМСКудаПрибыл КАК ОрганФМСКудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.Наименование КАК ПринятоеРешениеНаименование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМСКудаПрибыл.Должность КАК ДолжностьДЛО,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМСКудаПрибыл.Руководитель КАК ОрганФМСКудаПрибылРуководитель,
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартирыЛС
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЗаконныйПредставитель = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	|		ПО (бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование = бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЗаконныйПредставитель = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗапросПравоустанавливающиеДокументы = Новый Запрос;
	ЗапросПравоустанавливающиеДокументы.Текст = "ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы.Документ КАК Документ
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПравоустанавливающиеДокументы КАК бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы.Ссылка.Ссылка = &Ссылка
	|	И бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы.ВыводитьВПФ ";
	ЗапросПравоустанавливающиеДокументы.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ВыборкаПДок = ЗапросПравоустанавливающиеДокументы.Выполнить().Выбрать();
	СтрПДок = "";
	Пока ВыборкаПДок.Следующий() Цикл
		СтрПДок = СтрПДок + ВыборкаПДок.Документ + " № " + ВыборкаПДок.Документ.НомерДокумента + " от " + Формат(ВыборкаПДок.Документ.ДатаДокумента, "ДФ=dd.MM.yy") + ", ";
	КонецЦикла;
	
	СтрПДок = УбратьПоследнийСимвол(СтрПДок, ",");
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
		
		Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("ЗОРПМЖ_New");
		Шапка0Область  = Макет.ПолучитьОбласть("Шапка0");
		ЗаконныйПредставительОбласть = Макет.ПолучитьОбласть("ЗаконныйПредставитель");
		Шапка1Область = Макет.ПолучитьОбласть("Шапка1");
		ОтветственныеСтрокаОбласть = Макет.ПолучитьОбласть("ОтветственныеСтрока");
		ПодвалДоОбласть = Макет.ПолучитьОбласть("ПодвалДо");
		ПодвалПослеОбласть = Макет.ПолучитьОбласть("ПодвалПосле");		
		
		//Орган Учета
		ОрганУчета_1 = "";
		ОрганУчета_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ПаспортнаяСлужба, 60, ОрганУчета_1 , ОрганУчета_2 );
		Шапка0Область.Параметры.ОрганУчета1 = ОрганУчета_1;
		Шапка0Область.Параметры.ОрганУчета2 = ОрганУчета_2;
		
		//ФизЛицо
		Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			ФИОФизЛицо = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
		Иначе
			ФИОФизЛицо = Строка(Выборка.РегистрируемоеЛицо) ;
		КонецЕсли;
		
		// Перевод в родительный падеж.
		ФизЛицо_Склон = "";
		ФизЛицо = ФИОФизЛицо;
		//ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФИОФизЛицо,2,Выборка.РегистрируемоеЛицо.Пол,ФизЛицо_Склон);
		//Если ИсходСклонения Тогда
		//	ФизЛицо = ФизЛицо_Склон;
		//КонецЕсли;	
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
			Шапка0Область.Параметры.ФизЛицо =  ФизЛицо +", "+Строка(Формат (Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'"));
		Иначе
			Шапка0Область.Параметры.ФизЛицо =  ФизЛицо;
		КонецЕсли; 
		
		//АдресПрибытия
		СтрокаАдресПрибытия = ЭтаФорма.КонтактнаяИнформацияПолеОткудаПрибылПредставление;
		
		Если ЗначениеЗаполнено(СтрокаАдресПрибытия) Тогда
			СтрокаАдресПрибытия = СтрокаАдресПрибытия 
			+ ?(ЗначениеЗаполнено(Выборка.ПериодРегистрацииПоПрежнемуАдресуС),", с " + Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ=dd.MM.yyyy"), "") 
			+ ?(ЗначениеЗаполнено(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо)," по " + Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=dd.MM.yyyy"), "");
		КонецЕсли;
		
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		
		Если ЗначениеЗаполнено(СтрокаАдресПрибытия) Тогда
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаАдресПрибытия, 80, АдресПрибытия_1, АдресПрибытия_2);
			Шапка0Область.Параметры.АдресПрибытия = АдресПрибытия_1;
			Шапка0Область.Параметры.АдресПрибытия2 = АдресПрибытия_2;
			
		КонецЕсли; 
		
		Шапка0Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Шапка0Область);
		
		//АдресРегистрации
		//НаборЗаписей = НЕОПРЕДЕЛЕНО;
		//бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
		//
		//ВыборкаПочтАдр = Неопределено;
		//Для каждого СтрокаНабор Из НаборЗаписей  Цикл
		//	Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
		//		И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
		//		Тогда 
		//		ВыборкаПочтАдр = СтрокаНабор;
		//	КонецЕсли;	
		//КонецЦикла;
		//
		//адресДляСправки = "";
		//попытка
		//	если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаПочтАдр.Объект, "КонтактнаяИнформация") = истина И 
		//		ВыборкаПочтАдр.Объект.КонтактнаяИнформация <> неопределено И
		//		ВыборкаПочтАдр.Объект.КонтактнаяИнформация.Количество() > 0 тогда
		//		адресДляСправки = ПолучитьАдресДляСправки (ВыборкаПочтАдр.Объект.КонтактнаяИнформация[0].Значение);
		//	конецесли;           
		//исключение
		//	адресДляСправки = "";
		//конецпопытки;	
		
		АдресДляСправки = ПолучитьМуниципальныйАдресБСП(Объект.ЛицевойСчет);
		//ПодвалДоОбласть.Параметры.НаселенныйПунктРег = адресДляСправки.Представление;
		
		ПодвалДоОбласть.Параметры.НаселенныйПунктРег = "г. Омск";
		ПодвалДоОбласть.Параметры.УлицаРег    			= Выборка.УлицаРег;
		ПодвалДоОбласть.Параметры.ДомРег  				= ПолучитьНомерДома(Выборка.ДомРег);
		ПодвалДоОбласть.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(Выборка.ДомРег);
		ПодвалДоОбласть.Параметры.КвартираРег 			= Выборка.ПредставлениеКвартирыЛС;
		
		//ЗаконныйПредставитель
		Если (НЕ Выборка.РегЛицоВозраст = Неопределено
			И  Выборка.РегЛицоВозраст <= 14) ИЛИ Выборка.ЗаконныйПредставительВСвязиСНедееспособностью Тогда
			
			ЗаконныйПредставитель_1 = "";
			ЗаконныйПредставитель_2 = "";
			
			Если ЗначениеЗаполнено(Выборка.ВидДокументаПред) Тогда
				Если ЗначениеЗаполнено(Выборка.ВидДокументаПред.КодПФР) Тогда
					ВидДокументаПред 		= Выборка.ВидДокументаПред.КодПФР; 
				Иначе	
					ВидДокументаПред 		= Выборка.ВидДокументаПред;
				КонецЕсли;
			КонецЕсли;
			
			ЗаконныйПредставитель = "" + Выборка.ЗаконныйПредставитель
			+?(ЗначениеЗаполнено(Выборка.ЗаконныйПредставитель.ДатаРождения), ", " + Формат(Выборка.ЗаконныйПредставитель.ДатаРождения, "ДФ=dd.MM.yyyy") + " г.р.", "")
			+?(ЗначениеЗаполнено(Выборка.СтепеньРодстваЗаконногоПредставителя),НРег(", " + Строка(Выборка.СтепеньРодстваЗаконногоПредставителя)), "")
			+?(ЗначениеЗаполнено(ВидДокументаПред),", " + Строка(ВидДокументаПред), "") 
			+?(ЗначениеЗаполнено(Выборка.СерияДокументаПред), ", сер. "+Строка(Выборка.СерияДокументаПред), "")
			+?(ЗначениеЗаполнено(Выборка.НомерДокументаПред), ", № "+ Строка(Выборка.НомерДокументаПред), "")
			+?(ЗначениеЗаполнено(Выборка.ДатаВыдачиПред), ", выдан: "+ Формат(Выборка.ДатаВыдачиПред,"ДФ='dd.MM.yyyy ""г.""'"), "")
			+?(ЗначениеЗаполнено(Выборка.ВыданДокументПред)," " + Строка(Выборка.ВыданДокументПред),"")
			+?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделенияПред), ", код: "+ Строка(Выборка.ДокументКодПодразделенияПред),"");
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ЗаконныйПредставитель, 70, ЗаконныйПредставитель_1 , ЗаконныйПредставитель_2 );
			ЗаконныйПредставительОбласть.Параметры.ЗаконныйПредставитель1 = ЗаконныйПредставитель_1;
			ЗаконныйПредставительОбласть.Параметры.ЗаконныйПредставитель2 = ЗаконныйПредставитель_2;
			
			ТабДокумент.Вывести(ЗаконныйПредставительОбласть);
			
		КонецЕсли; 
		
		//ЧислоРег, ЧислоСнят
		Шапка1Область.Параметры.ЧислоРег  = Формат(Выборка.ДатаРегистрации,"ДФ=dd");
		Шапка1Область.Параметры.МесяцРег  = Формат(Выборка.ДатаРегистрации,"ДФ=MM");
		Шапка1Область.Параметры.ГодРег    = Формат(Выборка.ДатаРегистрации,"ДФ=yy");
		
		Шапка1Область.Параметры.ЧислоСнят = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd");
		Шапка1Область.Параметры.МесяцСнят = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=MM");
		Шапка1Область.Параметры.ГодСнят   = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=yy");
		
		//Ответственные
		ЗапросОтветственные = Новый Запрос;
		ЗапросОтветственные.Текст =   "ВЫБРАТЬ
		|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.Ответственный КАК Ответственный,
		|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.СтепеньРодства КАК СтепеньРодства
		|ПОМЕСТИТЬ ОтветственныйСтепеньРодства
		|ИЗ
		|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныеЗаРегистрацию КАК бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию
		|ГДЕ
		|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
		|	ОтветственныйСтепеньРодства.Ответственный КАК Ответственный,
		|	ОтветственныйСтепеньРодства.СтепеньРодства КАК СтепеньРодства,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи
		|ИЗ
		|	ОтветственныйСтепеньРодства КАК ОтветственныйСтепеньРодства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Период, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
		|		ПО ОтветственныйСтепеньРодства.Ответственный = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо";
		ЗапросОтветственные.УстановитьПараметр("Ссылка", Объект.Ссылка);
		ЗапросОтветственные.УстановитьПараметр("Период", КонецДня(Объект.Дата));
		
		ВыборкаОтветственные = ЗапросОтветственные.Выполнить().Выбрать();
		Ответственные = ВыборкаОтветственные;
		СтрокаОтветственные = "";
		мОтветственные = Новый Массив;
		
		ДатаВыдачиДокументаПред		  = "";
		
		Пока ВыборкаОтветственные.Следующий() Цикл
			СтрокаОтветственные = "" +  СтрокаОтветственные + Ответственные.Ответственный 
			+?(ЗначениеЗАполнено(Ответственные.Ответственный.ДатаРождения), ", " + Формат(Ответственные.Ответственный.ДатаРождения,"ДФ=dd.MM.yyyy" ) + " г.р; ", "");
			
			ДатаВыдачиДокументаПред		  = ВыборкаОтветственные.ДокументДатаВыдачи;
			
			СтруктураОтветственные = Новый Структура;
			СтруктураОтветственные.Вставить("ОтветственноеЛицо", ПолучитьИнициалы(ВыборкаОтветственные.Ответственный)); 
			СтруктураОтветственные.Вставить("ДокументВид", ВыборкаОтветственные.ДокументВид);
			СтруктураОтветственные.Вставить("ДокументСерия", ВЫборкаОтветственные.ДокументСерия);
			СтруктураОтветственные.Вставить("ДокументНомер", ВЫборкаОтветственные.ДокументНомер);
			СтруктураОтветственные.Вставить("ДокументКемВыдан", ВыборкаОтветственные.ДокументКемВыдан);
			СтруктураОтветственные.Вставить("ДокументКодПодразделения", ВыборкаОтветственные.ДокументКодПодразделения);
			СтруктураОтветственные.Вставить("ДокументДатаВыдачи", ВыборкаОтветственные.ДокументДатаВыдачи);
			
			мОтветственные.Добавить(СтруктураОтветственные);
			
		КонецЦикла;
		
		СтрокаОтветственные = УбратьПоследнийСимвол(СтрокаОтветственные, ";");
		
		Ответственные1 = "";
		Ответственные2 = "";
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаОтветственные, 60, Ответственные1 , Ответственные2 );
		
		Шапка1Область.Параметры.Ответственные1 =  Ответственные1;
		ТабДокумент.Вывести(Шапка1Область);			
		
		ДлиннаОтветственные = СтрДлина(СтрокаОтветственные);
		ДлиннаТекСтроки = 60;
		
		Пока ДлиннаТекСтроки < ДлиннаОтветственные  Цикл
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Ответственные2, 95, Ответственные1 , Ответственные2 );
			ОтветственныеСтрокаОбласть.Параметры.Ответственные2 = Ответственные1;
			ДлиннаТекСтроки = ДлиннаТекСтроки + 95;
			ТабДокумент.Вывести(ОтветственныеСтрокаОбласть);
			
		КонецЦикла;
		
		//Подвал	
		//Даты
		ПодвалПослеОбласть.Параметры.ЧислоТек = Формат(Выборка.Дата,"ДФ=dd");
		ПодвалПослеОбласть.Параметры.МесяцТек = Формат(Выборка.Дата,"ДФ=MM");
		ПодвалПослеОбласть.Параметры.ГодТек   = Формат(Выборка.Дата,"ДФ=yy");
		
		ПодвалДоОбласть.Параметры.ЧислоВыдачи = Формат(Выборка.ДатаВыдачи ,"ДФ=dd");
		ПодвалДоОбласть.Параметры.МесяцВыдачи = Формат(Выборка.ДатаВыдачи ,"ДФ=MM");
		ПодвалДоОбласть.Параметры.ГодВыдачи   = Формат(Выборка.ДатаВыдачи ,"ДФ=yyyy");
		
		ПодвалДоОбласть.Параметры.ЧислоТек =   Формат(Выборка.Дата,"ДФ=dd");
		ПодвалДоОбласть.Параметры.МесяцТек =  Формат(Выборка.Дата,"ДФ=MM");
		ПодвалДоОбласть.Параметры.ГодТек =   Формат(Выборка.Дата,"ДФ=yy");
		
		//ПаспортныеДанныеРегЛица
		ПодвалДоОбласть.Параметры.ВидДокумента = Выборка.ВидДокумента;
		ПодвалДоОбласть.Параметры.СерияДокумента = Выборка.СерияДокумента;
		ПодвалДоОбласть.Параметры.НомерДокумента = Выборка.НомерДокумента;
		ПодвалДоОбласть.Параметры.ВыданДокумент = Выборка.ВыданДокумент;
		ПодвалДоОбласть.Параметры.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;	
		
		//ДокументОснование		
		ОбластьДокОснование = Макет.ПолучитьОбласть("Основание");
		
		Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
			
			ОбластьДокОснование.Параметры.ДокументОснование1 = Выборка.ДокументОснование;	
			
		КонецЕсли;
		
		ПодвалПослеОбласть.Параметры.ДолжностноеЛицоОрганизации = Выборка.ОрганФМСКудаПрибылРуководитель;
		
		ПравоустанавливающиеДокуемнты1 = "";
		ПравоустанавливающиеДокуемнты2 = "";
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрПДок,60, ПравоустанавливающиеДокуемнты1, ПравоустанавливающиеДокуемнты2);	
		
		ОбластьДокОснование.Параметры.ПравоустанавливающиеДокументы = ПравоустанавливающиеДокуемнты1;
		ТабДокумент.Вывести(ОбластьДокОснование);	
			
		ОбластьПравоустанавливающиеДокументыСтрока = Макет.ПолучитьОбласть("ПравоустанавлиающиеДокументыСтрока");
		
		Пока СтрДлина(ПравоустанавливающиеДокуемнты2) > 0 Цикл
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ПравоустанавливающиеДокуемнты2,90, ПравоустанавливающиеДокуемнты1, ПравоустанавливающиеДокуемнты2);
			
			ОбластьПравоустанавливающиеДокументыСтрока.Параметры.ПравоустанавливающиеДокументы2 = ПравоустанавливающиеДокуемнты1;
			
			ТабДокумент.Вывести(ОбластьПравоустанавливающиеДокументыСтрока);
					
		КонецЦикла;
		
		//ПринятоеРешение
		ПринятоеРешение_1 = "";
		ПринятоеРешение_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ПринятоеРешениеНаименование, 80, ПринятоеРешение_1, ПринятоеРешение_2);
		ПодвалПослеОбласть.Параметры.ПринятоеРешение = ПринятоеРешение_1;
		
		//Адреса
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
		ИскомаяСтрока = Неопределено;
		Для каждого СтрокаНабор Из НаборЗаписей  Цикл
			Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
				И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
				Тогда 
				ИскомаяСтрока = СтрокаНабор;
			КонецЕсли;	
			
		КонецЦикла;
		
		ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
		
		Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
			СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
			
			Если НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
				
				НасПунктАдрес = ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.НаселенныйПункт),"нас.п. "+СтруктураАдресРегистрации.НаселенныйПункт+", ","")
				+ ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.Город),"г. "+СтруктураАдресРегистрации.Город+", ","")
				+ ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.Район),"р-н "+СтруктураАдресРегистрации.Район+", ","")
				+ ?(ЗначениеЗаполнено(СтруктураАдресРегистрации.Регион),"рег. "+СтруктураАдресРегистрации.Регион,"");
				
				//ПодвалДоОбласть.Параметры.НаселенныйПунктРег 	= НасПунктАдрес; 
				ПодвалДоОбласть.Параметры.УлицаРег 			= СтруктураАдресРегистрации.Улица;
				ПодвалДоОбласть.Параметры.ДомРег				= СтруктураАдресРегистрации.Дом;
				ПодвалДоОбласть.Параметры.КорпусРег 			= СтруктураАдресРегистрации.Корпус;
				
			КонецЕсли; 
		КонецЕсли;
		
		ДолжностноеЛицоОрганизации = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Выборка.Организация, Выборка.ДолжностноеЛицо,Выборка.Дата);
		
		ПодвалПослеОбласть.Параметры.ДолжностноеЛицоОрганизации = ДолжностноеЛицоОрганизации;	
		
		//ПодвалПослеОбласть.Параметры.ДолжностьДЛО_1 = Выборка.ДолжностьДЛО;
		ПодвалПослеОбласть.Параметры.ДолжностьДЛО_1 = ?(ЗначениеЗаполнено(Выборка.ОрганФМСКудаПрибыл), "Начальник " + Выборка.ОрганФМСКудаПрибыл, "");
		
		ТабДокумент.Вывести(ПодвалДоОбласть);
		ОбластьПаспортныеДанныеОтветственных = Макет.ПолучитьОбласть("ПаспортныеДанныеОтветственных");
		
		Для Каждого Ответственный Из мОтветственные Цикл
			
			ОбластьПаспортныеДанныеОтветственных.Параметры.ОтветственноеЛицо = Ответственный.ОтветственноеЛицо;
			ОбластьПаспортныеДанныеОтветственных.Параметры.ВидДокументаПред =Ответственный.ДокументВид;
			ОбластьПаспортныеДанныеОтветственных.Параметры.СерияДокументаПред = Ответственный.ДокументСерия;
			ОбластьПаспортныеДанныеОтветственных.Параметры.НомерДокументаПред =  Ответственный.ДокументНомер;
			ОбластьПаспортныеДанныеОтветственных.Параметры.ВыданДокументПред = Ответственный.ДокументКемВыдан;
			ОбластьПаспортныеДанныеОтветственных.Параметры.ДокументКодПодразделенияПред =  Ответственный.ДокументКодПодразделения;
			
			ОбластьПаспортныеДанныеОтветственных.Параметры.ЧислоВыдачиПред = Формат(Ответственный.ДокументДатаВыдачи ,"ДФ=dd");
			ОбластьПаспортныеДанныеОтветственных.Параметры.МесяцВыдачиПред = Формат(Ответственный.ДокументДатаВыдачи ,"ДФ=MM");
			ОбластьПаспортныеДанныеОтветственных.Параметры.ГодВыдачиПред   = Формат(Ответственный.ДокументДатаВыдачи ,"ДФ=yyyy");
			
			ТабДокумент.Вывести(ОбластьПаспортныеДанныеОтветственных);
		КонецЦикла;
		
		
		ПодвалПослеОбласть.Параметры.ДолжностноеЛицо = ПолучитьИнициалы(Выборка.ДолжностноеЛицо);
		ПодвалПослеОбласть.Параметры.ДолжностноеЛицоОрганизации = получитьинициалы(Выборка.ОрганФМСКудаПрибыл.Руководитель);
		ТабДокумент.Вывести(ПодвалПослеОбласть);
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните обязательные поля - Лицевой счет и Регистрируемое лицо и запишите документ";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьКР()
	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий КАК Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование КАК ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл КАК ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации КАК ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес КАК ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес КАК КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия КАК ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия КАК ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдресЗапятые КАК ОткудаПрибылАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдресЗапятые КАК КудаВыписанАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуС КАК ПериодРегистрацииПоПрежнемуАдресуС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуПо КАК ПериодРегистрацииПоПрежнемуАдресуПо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации КАК ДатаРегистрации1,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДанныеОПрибытии.Наименование КАК ДанныеОПрибытииНаименование,
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК КвартираРег
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие КАК бит_Проживающие
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_Проживающие.Ссылка
	|			И бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_Проживающие.Ссылка
	|			И бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЗаконныйПредставитель = бит_Проживающие.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
		
		Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("КР_New");
		
		Шапка1Область  = Макет.ПолучитьОбласть("Шапка1");
		СтрокаПаспорт  = Макет.ПолучитьОбласть("СтрокаПаспорт");
		Шапка2Область  = Макет.ПолучитьОбласть("Шапка2");
		Шапка3Область  = Макет.ПолучитьОбласть("Шапка3");
		Шапка4Область  = Макет.ПолучитьОбласть("Шапка4");
		
		ТаблицаПаспорт = ПолучитьТаблицуДокументов();
		
		СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
		
		Шапка1Область.Параметры.Страна              = СтруктураМестоРождения.Страна;
		Шапка1Область.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
		Шапка1Область.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
		Шапка1Область.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
		Шапка1Область.Параметры.НаселенныйПунктРожд = СтруктураМестоРождения.Село;
		
		Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ОткудаПрибылПредставление);
			Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 И ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) Тогда
				СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
			ИначеЕсли НЕ Строки.количество() = 0 Тогда
				//  15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда					
					
					АдресПрибытияПредставление = Строки[0].Представление;
					СтруктураАдресПрибытия = ПолучитьМуниципальныйАдресБСП(Строки[0].Значение);
					//---
				ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдресЗапятые) Тогда
					СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдресЗапятые);
				ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) Тогда
					Если Объект.ОткудаПрибылИзЛС Тогда
						Если НЕ ПустаяСтрока(Объект.ОткудаПрибылАдрес) Тогда
							ОткудаПрибылПредставление = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(Объект.ОткудаПрибылАдрес);
							ОткудаПрибылКонтактнаяИнформацияНаСервере();	
						КонецЕсли;
						Если ЗначениеЗаполнено(ОткудаПрибылПредставлениеЗапятые) Тогда
							СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ОткудаПрибылПредставлениеЗапятые);
						КонецЕсли; 
					Иначе
						Попытка
							СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Объект.ОткудаПрибылАдрес);
						Исключение
							Сообщение = Новый СообщениеПользователю();
							Сообщение.Текст = "Перезаполните откуда прибыл адрес";
							Сообщение.Сообщить();
							СтруктураАдресПрибытия = Неопределено;
						КонецПопытки;
					КонецЕсли; 
				Иначе
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Заполните откуда прибыл адрес";
					Сообщение.Сообщить();
					СтруктураАдресПрибытия = Неопределено;
				КонецЕсли;
			КонецЕсли;			
		Иначе
			СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
		КонецЕсли;		
		
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		Если Выборка.РегистрируемоеЛицо.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.АдресПрибытияДрРегион);
			Строки = Выборка.РегистрируемоеЛицо.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			
			Если Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.АдресПрибытияДрРегион) Тогда
				
				СтруктураАдресПрибИзДрРегиона = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.РегистрируемоеЛицо.АдресПрибытияДрРегион);
				
			ИначеЕсли НЕ Строки.количество() = 0 Тогда
				
				//  15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда
					
					АдресПрибытияДрРегионПредставление = Строки[0].Представление;
					СтруктураАдресПрибИзДрРегиона = ПолучитьМуниципальныйАдресБСП(Строки[0].Значение);
					//-----
				ИначеЕсли ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.АдресПрибытияДрРегион) Тогда
					
					СтруктураАдресПрибИзДрРегиона = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.РегистрируемоеЛицо.АдресПрибытияДрРегион);
					Если СтруктураАдресПрибИзДрРегиона.Свойство("Регион") = Ложь Тогда
						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перезаполните адрес прибытия из другого региона");
						СтруктураАдресПрибИзДрРегиона = Неопределено;
					КонецЕсли;	
					
				ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.АдресПрибытияДрРегион) Тогда
					
					бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.РегистрируемоеЛицо);
					ИскомаяСтрока = Неопределено;
					Для каждого СтрокаНабор Из НаборЗаписей  Цикл
						Если СтрокаНабор.Тип  = Перечисления.бит_ТипыКонтактнойИнформации.Адрес
							И СтрокаНабор.Вид = Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытияДрРегион
							Тогда 
							ИскомаяСтрока = СтрокаНабор;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
					СтруктураАдресПрибИзДрРегиона = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
					
				Иначе
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перезаполните адрес прибытия из другого региона");
					СтруктураАдресПрибИзДрРегиона = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЕсли;
		
		Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СДругогоГорода Тогда
			
			// Левый блок.
			Если СтруктураАдресПрибытия <> Неопределено Тогда
				
				Шапка1Область.Параметры.РегионПрибДГ		  = СтруктураАдресПрибытия.Регион;
				Шапка1Область.Параметры.РайонПрибДГ           = СтруктураАдресПрибытия.Район;
				Шапка1Область.Параметры.ГородПрибДГ           = СтруктураАдресПрибытия.Город;
				Шапка1Область.Параметры.НаселенныйПунктПрибДГ = СтруктураАдресПрибытия.НаселенныйПункт;
				Шапка1Область.Параметры.УлицаПрибТГ  		  = СтруктураАдресПрибытия.Улица;
				Шапка1Область.Параметры.ДомПрибТГ      		  = СтруктураАдресПрибытия.Дом;
				Шапка1Область.Параметры.КорпусПрибТГ   		  = СтруктураАдресПрибытия.Корпус;
				Шапка1Область.Параметры.КвартираПрибТГ		  = СтруктураАдресПрибытия.Квартира;
				
			ИначеЕсли СтруктураАдресПрибИзДрРегиона <> Неопределено	Тогда
				
				Шапка1Область.Параметры.РегионПрибДГ          = СтруктураАдресПрибИзДрРегиона.Регион;
				Шапка1Область.Параметры.РайонПрибДГ           = СтруктураАдресПрибИзДрРегиона.Район;
				Шапка1Область.Параметры.ГородПрибДГ           = СтруктураАдресПрибИзДрРегиона.Город;
				Шапка1Область.Параметры.НаселенныйПунктПрибДГ = СтруктураАдресПрибИзДрРегиона.НаселенныйПункт;
				Шапка1Область.Параметры.УлицаПрибТГ   		  = СтруктураАдресПрибытия.Улица;
				Шапка1Область.Параметры.ДомПрибТГ      = СтруктураАдресПрибытия.Дом;
				Шапка1Область.Параметры.КорпусПрибТГ   = СтруктураАдресПрибытия.Корпус;
				Шапка1Область.Параметры.КвартираПрибТГ = СтруктураАдресПрибытия.Квартира;
				
			КонецЕсли;
			
			Шапка1Область.Параметры.ДеньПрибТГ     = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ=dd");
			ДатаМесяц							   = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд.MMMM'");
			Шапка1Область.Параметры.МесяцПрибТГ    = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			Шапка1Область.Параметры.ГодПрибТГ      = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ=yyyy");
			Шапка1Область.Параметры.ДеньСнятия     = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=dd");
			ДатаМесяц							   = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ='дд.MMMM'");
			Шапка1Область.Параметры.МесяцСнятия    = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			Шапка1Область.Параметры.ГодСнятия      = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=yyyy");

		ИначеЕсли Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ВТомЖеГородеСДругогоАдреса Тогда
			
			// Правй блок.
			Если СтруктураАдресПрибытия <> Неопределено Тогда
				//10.12.2018
				//Шапка1Область.Параметры.РайонПрибТГ	   = СтруктураАдресПрибытия.Внутриграйон;
				
				//Шапка1Область.Параметры.ГородПрибДГ    = СтруктураАдресПрибИзДрРегиона.Город;
				//Шапка1Область.Параметры.РайонПрибТГ	   = СтруктураАдресПрибытия.Район;
				//Шапка1Область.Параметры.РегионПрибДГ   = СтруктураАдресПрибИзДрРегиона.Регион;
				Шапка1Область.Параметры.УлицаПрибТГ    = СтруктураАдресПрибытия.Улица;
				Шапка1Область.Параметры.ДомПрибТГ      = СтруктураАдресПрибытия.Дом;
				Шапка1Область.Параметры.КорпусПрибТГ   = СтруктураАдресПрибытия.Корпус;
				Шапка1Область.Параметры.КвартираПрибТГ = СтруктураАдресПрибытия.Квартира;
				
				Шапка1Область.Параметры.ДеньПрибТГ     = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ=dd");
				ДатаМесяц							   = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд.MMMM'");
				Шапка1Область.Параметры.МесяцПрибТГ    = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				Шапка1Область.Параметры.ГодПрибТГ      = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ=yyyy");
				
				Шапка1Область.Параметры.ДеньСнятия     = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=dd");
				ДатаМесяц							   = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ='дд.MMMM'");
				Шапка1Область.Параметры.МесяцСнятия    = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				Шапка1Область.Параметры.ГодСнятия      = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=yyyy");
				
			КонецЕсли;
			
			// Левый блок.
			Если СтруктураАдресПрибИзДрРегиона <> Неопределено Тогда
				Шапка1Область.Параметры.РегионПрибДГ          = СтруктураАдресПрибИзДрРегиона.Регион;
				Шапка1Область.Параметры.РайонПрибДГ           = СтруктураАдресПрибИзДрРегиона.Район;
				Шапка1Область.Параметры.ГородПрибДГ           = СтруктураАдресПрибИзДрРегиона.Город;
				Шапка1Область.Параметры.НаселенныйПунктПрибДГ = СтруктураАдресПрибИзДрРегиона.НаселенныйПункт;
				
				//Шапка1Область.Параметры.ДеньПриб     = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=dd");
				//ДатаМесяц							   = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ='дд.MMMM'");
				//Шапка1Область.Параметры.МесяцПриб    = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				//Шапка1Область.Параметры.ГодПриб     = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=yyyy");
				
			КонецЕсли;
			
		Иначе
			
			// Левый блок.
			Если СтруктураАдресПрибИзДрРегиона <> Неопределено Тогда
				Шапка1Область.Параметры.РегионПрибДГ          = СтруктураАдресПрибИзДрРегиона.Регион;
				Шапка1Область.Параметры.РайонПрибДГ           = СтруктураАдресПрибИзДрРегиона.Район;
				Шапка1Область.Параметры.ГородПрибДГ           = СтруктураАдресПрибИзДрРегиона.Город;
				Шапка1Область.Параметры.НаселенныйПунктПрибДГ = СтруктураАдресПрибИзДрРегиона.НаселенныйПункт;
				//
				//Шапка1Область.Параметры.ДеньПриб     = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=dd");
				//ДатаМесяц							   = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ='дд.MMMM'");
				//Шапка1Область.Параметры.МесяцПриб    = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				//Шапка1Область.Параметры.ГодПриб      = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо,"ДФ=yyyy");	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда 
			
			Шапка1Область.Параметры.ДеньРожд  	= Формат(Выборка.ДатаРождения,"ДФ=dd");
			ДатаМесяц							= Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
			Шапка1Область.Параметры.МесяцРожд 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			Шапка1Область.Параметры.ГодРожд   	= Формат(Выборка.ДатаРождения,"ДФ=yyyy");
			
		КонецЕсли;
		
		//Шапка1Область.Параметры.ПроживалС = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ=dd.MM.yyyy" );
		Шапка1Область.Параметры.Заполнить(Выборка);
		
		//ТабДокумент.Вывести(Шапка1Область);
		
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		
		Если Выборка.ДомРег.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
			
			Строки = Выборка.ДомРег.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			Если Строки.количество() = 0 Тогда
				
				бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
				
				
				ВыборкаПочтАдр = Неопределено;
				Для каждого СтрокаНабор Из НаборЗаписей  Цикл
					Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
						И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
						Тогда 
						ВыборкаПочтАдр = СтрокаНабор;
					КонецЕсли;	
				КонецЦикла;
				
				ПочтовыйАдресСтрока = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
				СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
				
				
			Иначе
				
				
				//  15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда					
					
					ВыборкаПочтАдр = Строки[0].Значение;
					СтруктураПочтовыйАдрес = ПолучитьАдресБСП(ВыборкаПочтАдр)
					
				конецесли;	
				//-----			
			КонецЕсли;		
			
		Иначе
			
			бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
			
			
			ВыборкаПочтАдр = Неопределено;
			Для каждого СтрокаНабор Из НаборЗаписей  Цикл
				Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
					И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
					Тогда 
					ВыборкаПочтАдр = СтрокаНабор;
				КонецЕсли;	
			КонецЦикла;
			
			ПочтовыйАдресСтрока = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
			СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
			
		КонецЕсли;
		
		Если СтруктураПочтовыйАдрес <> Неопределено И НЕ СтруктураПочтовыйАдрес.Свойство("ЗаПределамиРФ") Тогда
			Если ЗначениеЗаполнено(СтруктураПочтовыйАдрес.Город) Тогда
				Шапка2Область.Параметры.НаселенныйПунктРег = СтруктураПочтовыйАдрес.Город ;
				//Шапка1Область.Параметры.НаселенныйПунктРег = СтруктураПочтовыйАдрес.Город ;
				
			ИначеЕсли ЗначениеЗаполнено(СтруктураПочтовыйАдрес.НаселенныйПункт) Тогда
				Шапка2Область.Параметры.НаселенныйПунктРег = СтруктураПочтовыйАдрес.НаселенныйПункт;
				//Шапка1Область.Параметры.НаселенныйПунктРег = СтруктураПочтовыйАдрес.НаселенныйПункт;
				
			КонецЕсли;
			Шапка1Область.Параметры.Заполнить(Выборка);
			
			Шапка2Область.Параметры.УлицаРег 	= СтруктураПочтовыйАдрес.Улица;	
			//Шапка1Область.Параметры.УлицаРег 	= СтруктураПочтовыйАдрес.Улица;	
			//Шапка1Область.Параметры.ДомРег 	= СтруктураПочтовыйАдрес.Дом;	
			//Шапка1Область.Параметры.КорпусРег 	= СтруктураПочтовыйАдрес.Корпус;	
			//Шапка1Область.Параметры.КвартираРег 	= СтруктураПочтовыйАдрес.Квартира;	
			
		КонецЕсли; 
		ДанныеОПрибытииНаименование = Выборка.ДанныеОПрибытииНаименование;
		Шапка1Область.Параметры.ДанныеОПрибытии = ДанныеОПрибытииНаименование;
		
		
		
		ТабДокумент.Вывести(Шапка1Область);
		
		Для каждого Строка Из ТаблицаПаспорт Цикл
			
			СтрокаПаспорт.Параметры.Заполнить(Строка);
			
			Если ЗначениеЗаполнено(Строка.ДокументВид) Тогда
				Если ЗначениеЗаполнено(Строка.ДокументВид.КодПФР) Тогда
					ВидДокумент 		= Строка.ДокументВид.КодПФР; 
				Иначе	
					ВидДокумент 		= Строка.ДокументВид;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВидДокумент) Тогда
				СтрокаПаспорт.Параметры.ВидДокумента = ВидДокумент;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.ВыданДокумент) Тогда
				СтрокаПаспорт.Параметры.ДатаВыдачиДок = ",  выд. " + Формат(Строка.ДатаВыдачиДокумента,"ДЛФ=Д")+ "г.";
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Строка.КодПодразделенияДокумента) Тогда
				СтрокаПаспорт.Параметры.КодПодразделения = Строка.КодПодразделенияДокумента;	
			КонецЕсли;
			
		КонецЦикла; 
		ТабДокумент.Вывести(СтрокаПаспорт);
		КолПараметров = СтрокаПаспорт.Параметры.Количество();
		НомерТекПараметра = 0;
		
		Пока КолПараметров <> 0 Цикл
			
			СтрокаПаспорт.Параметры.Установить(НомерТекПараметра,"");
			КолПараметров = КолПараметров - 1;
			НомерТекПараметра = НомерТекПараметра + 1;
			
		КонецЦикла; 
		
		КоличествоСтрокНаВывод = 1 - ТаблицаПаспорт.Количество();
		ТабДокумент.Вывести(Шапка4Область); 
		
		//Если КоличествоСтрокНаВывод > 0 Тогда
		//	Пока КоличествоСтрокНаВывод <> 0  Цикл
		//		КоличествоСтрокНаВывод = КоличествоСтрокНаВывод - 1;
		//		ТабДокумент.Вывести(СтрокаПаспорт);
		//	КонецЦикла; 
		//КонецЕсли; 
		
		Шапка2Область.Параметры.Заполнить(Выборка);
		
		Шапка2Область.Параметры.ДомРег = ПолучитьНомерДома(Выборка.ДомРег);
		Шапка2Область.Параметры.КорпусРег = ПолучитьНомерКорпуса(Выборка.ДомРег);
		//Шапка3Область.Параметры.КвартираРег = ПолучитьНомерКвартиры(Выборка.ДомРег);
		//ТабДокумент.Вывести(СтрокаПаспорт);
		//ТабДокумент.Вывести(Шапка2Область);
		
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните обязательные поля - Лицевой счет и Регистрируемое лицо и запишите документ";
		Сообщение.Сообщить();
		
	КонецЕсли;
	ТабДокумент.Вывести(Шапка2Область); 
	Дети =   Макет.ПолучитьОбласть("Дети");
	
	СтрокаДети = Макет.ПолучитьОбласть("СтрокаДети");
	
	// Заполнение таблицы
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	бит_Проживающиебит_Дети.Проживающий.Наименование КАК ПроживающийНаименование,
	|	бит_Проживающиебит_Дети.Проживающий.ДатаРождения КАК ПроживающийДатаРождения
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.бит_Дети КАК бит_Проживающиебит_Дети
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_Проживающиебит_Дети.Ссылка
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроживающийДатаРождения";
	
	РезультатЗапроса = Запрос.Выполнить();   
	ВыборкаДети = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДети.Следующий() Цикл
		СтрокаДети.Параметры.ПроживающийНаименование = ВыборкаДети.ПроживающийНаименование;
		Если   ЗначениеЗаполнено(ВыборкаДети.ПроживающийДатаРождения)тогда
		
		СтрокаДети.Параметры.ПроживающийДатаРождения = ", " + Формат (ВыборкаДети.ПроживающийДатаРождения,"ДЛФ=DD");
		КонецЕсли;
		ТабДокумент.Вывести(СтрокаДети);
	КонецЦикла;   
	
	
	ТабДокумент.Вывести(Дети);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	//Запрос.УстановитьПараметр("ФизЛицо" ,Перечисления.бит_ВоинскийУчет.ФизЛицо);
	Запрос.Текст =
	
	//"ВЫБРАТЬ
	//|МАКСИМУМ(бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности) КАК ОтношениеКВоинскойОбязанности,
	//|бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	//|бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо
	//|ИЗ
	//|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ВоинскийУчет.СрезПоследних КАК бит_ВоинскийУчетСрезПоследних
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка
	//
	//|СГРУППИРОВАТЬ ПО
	//|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	//|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо";
	//
	
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	//|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности КАК ОтношениеКВоинскойОбязанности,
	//|	бит_ВоинскийУчетСрезПоследних.Период КАК Период
	//|ИЗ
	//|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ВоинскийУчет.СрезПоследних КАК бит_ВоинскийУчетСрезПоследних
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Период";
	
	
	
	 "ВЫБРАТЬ
	 |	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности КАК ОтношениеКВоинскойОбязанности,
	 |	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо
	 |ИЗ
	 |	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ВоинскийУчет.СрезПоследних КАК бит_ВоинскийУчетСрезПоследних
	 |		ПО бит_ВоинскийУчетСрезПоследних.ФизЛицо = бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо
	 |ГДЕ
	 |	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка"; 
	
	
	
	
	//Запрос.Выполнить().Выбрать();
	//РезультатЗапроса.Следующий(); 	
	РезультатыЗапроса = Запрос.Выполнить();   
	ВыборкаВО = РезультатыЗапроса.Выбрать();
	ВыборкаВО.Следующий();
	
	ВоинскийУчет = ВыборкаВО.ОтношениеКВоинскойОбязанности;
	Шапка3Область.Параметры.ВоинскийУчет = ВоинскийУчет;
	
	ДатаРегистрации = Выборка.ДатаРегистрации;
	Шапка3Область.Параметры.Регистрация  =   Формат(ДатаРегистрации, "ДФ=dd.MM.yyyy; ДЛФ=DD" );
	
	ТабДокумент.Вывести(Шапка3Область);
	//ТабличныйДокумент.РазмерСтраницы = "A5";
	////ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабличныйДокумент.ПолеСлева=10;
	//ТабличныйДокумент.ПолеСправа=10;
	//ТабличныйДокумент.ПолеСверху=10;
	//ТабличныйДокумент.ПолеСнизу=10;
	//ТабличныйДокумент.АвтоМасштаб=Истина;
	
		
	Возврат ТабДокумент;
	
	// Шапка2Область.Параметры.ВоинскийУчет   =
	//
	//
	//ТабДокумент.Вывести(Шапка2Область);    
	
	
	
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьЛСУП()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОписаниеДругойПричины,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдресЗапятые
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("ЛСУП");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
		
		СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
		ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
		ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
		ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
		ШапкаОбласть.Параметры.СтранаРожд          = СтруктураМестоРождения.Страна;
		ШапкаОбласть.Параметры.НаселенныйПунктРожд = СтруктураМестоРождения.Село;
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.Пол) Тогда
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				
				ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				
				ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			КонецЕсли;
		КонецЕсли;
		
		ШапкаОбласть.Параметры.Заполнить(Выборка);
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
			
			ШапкаОбласть.Параметры.ДеньРожд  	= Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=dd");
			ДатаМесяц 							= Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРожд 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			МесяцРожд                         	= Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=MM");
			ШапкаОбласть.Параметры.МесяцРожд1 	= Сред(МесяцРожд,1,1);
			ШапкаОбласть.Параметры.МесяцРожд2 	= Сред(МесяцРожд,2,1);
			ГодРожд                           	= Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=yyyy");
			ШапкаОбласть.Параметры.ГодРожд1   	= Сред(ГодРожд,1,1);
			ШапкаОбласть.Параметры.ГодРожд2   	= Сред(ГодРожд,2,1);
			ШапкаОбласть.Параметры.ГодРожд3   	= Сред(ГодРожд,3,1);
			ШапкаОбласть.Параметры.ГодРожд4   	= Сред(ГодРожд,4,1);
			
		КонецЕсли;
		
		
		Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ОткудаПрибылПредставление);
			
			Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			
			Если Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) Тогда
				
				СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
				
			ИначеЕсли НЕ Строки.количество() = 0 Тогда
				
				//  15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда					
					
					АдресПрибытияПредставление = Строки[0].Представление;
					СтруктураАдресПрибытия = ПолучитьАдресБСП(Строки[0].Значение);
					//---
				ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдресЗапятые) Тогда
					
					СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдресЗапятые);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) Тогда
					
					Если Объект.ОткудаПрибылИзЛС Тогда
						
						
						Если НЕ ПустаяСтрока(Объект.ОткудаПрибылАдрес) Тогда
							ОткудаПрибылПредставление = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(Объект.ОткудаПрибылАдрес);
							
							ОткудаПрибылКонтактнаяИнформацияНаСервере();	
							
						КонецЕсли;
						
						
						Если ЗначениеЗаполнено(ОткудаПрибылПредставлениеЗапятые) Тогда
							
							СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ОткудаПрибылПредставлениеЗапятые);
							
						КонецЕсли; 
					Иначе
						
						Попытка
							СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
							
						Исключение
							
							бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перезаполните откуда прибыл адрес");
							
							СтруктураАдресПрибытия = Неопределено;
						КонецПопытки;
						
					КонецЕсли; 
					
				Иначе
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните откуда прибыл адрес");
					
					СтруктураАдресПрибытия = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;			
			
		Иначе
			
			СтруктураАдресПрибытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
			
		КонецЕсли;		
		
		
		Если НЕ СтруктураАдресПрибытия = Неопределено Тогда
			
			ШапкаОбласть.Параметры.ГосударствоПриб     = СтруктураАдресПрибытия.Страна;
			ШапкаОбласть.Параметры.РегионПриб          = СтруктураАдресПрибытия.Регион;
			ШапкаОбласть.Параметры.РайонПриб           = СтруктураАдресПрибытия.Район ;
			ШапкаОбласть.Параметры.ГородПриб           = СтруктураАдресПрибытия.Город ;
			
			ШапкаОбласть.Параметры.НаселенныйПунктПриб = ?(ПустаяСтрока(СтруктураАдресПрибытия.НаселенныйПункт)
			,СтруктураАдресПрибытия.Улица 
			+ ", д." + СтруктураАдресПрибытия.Дом 
			+?(ЗначениеЗаполнено(СтруктураАдресПрибытия.корпус),", корп. " + СтруктураАдресПрибытия.корпус,"") 
			+ ", кв." + СтруктураАдресПрибытия.Квартира
			, СтруктураАдресПрибытия.НаселенныйПункт);
			
		КонецЕсли;
		
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
		ИскомаяСтрока = Неопределено;
		Для каждого СтрокаНабор Из НаборЗаписей  Цикл
			
			Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
				И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
				Тогда 
				ИскомаяСтрока = СтрокаНабор;
			КонецЕсли;	
			
		КонецЦикла;
		
		Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.КудаВыписанПредставление);
			
			Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			
			Если Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.КудаВыписанАдрес) Тогда
				
				СтруктураАдресУбытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.КудаВыписанАдрес);
				
			ИначеЕсли НЕ Строки.количество() = 0 Тогда
				
				// 15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда					
					
					АдресУбытияПредставление = Строки[0].Представление;
					СтруктураАдресУбытия = ПолучитьАдресБСП(Строки[0].Значение);
					//---	
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.КудаВыписанАдресЗапятые) Тогда
					
					СтруктураАдресУбытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.КудаВыписанАдресЗапятые);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.КудаВыписанАдрес) Тогда
					
					// Почтовый адрес здания.
					НаборЗаписей = НЕОПРЕДЕЛЕНО;
					бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
					ВыборкаПочтАдр = Неопределено;
					Для каждого СтрокаНабор Из НаборЗаписей  Цикл
						Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
							И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
							Тогда 
							ВыборкаПочтАдр = СтрокаНабор;
						КонецЕсли;	
					КонецЦикла;
					
					ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
					СтруктураАдресУбытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
				Иначе
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Перезаполните куда убыл адрес";
					Сообщение.Сообщить();
					
					Возврат Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;			
			
		Иначе
			
			СтруктураАдресУбытия = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.КудаВыписанАдрес);
			
		КонецЕсли;		
		
		Если НЕ СтруктураАдресУбытия = Неопределено Тогда
			
			ШапкаОбласть.Параметры.РегионРег          = СтруктураАдресУбытия.Регион;
			ШапкаОбласть.Параметры.РайонРег           = СтруктураАдресУбытия.Район ;
			ШапкаОбласть.Параметры.ГородРег           = СтруктураАдресУбытия.Город ;
			ШапкаОбласть.Параметры.НаселенныйПунктРег = ?(ПустаяСтрока(СтруктураАдресУбытия.НаселенныйПункт)
			,СтруктураАдресУбытия.Улица 
			+ ", д." + СтруктураАдресУбытия.Дом 
			+?(ЗначениеЗаполнено(СтруктураАдресУбытия.корпус),", корп. " + СтруктураАдресУбытия.корпус,"") 
			+ ", кв." + СтруктураАдресУбытия.Квартира
			, СтруктураАдресУбытия.НаселенныйПункт);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ДолжностноеЛицоОрганизации = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Выборка.Организация, Выборка.ДолжностноеЛицо, Выборка.Дата);
	ШапкаОбласть.Параметры.ДолжностноеЛицоОрганизации = ДолжностноеЛицоОрганизации;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция вызывает форму печати табличного документа с печатной формой.
// Инвентаризационной описи основных средств.
//
// Параметры:
//  ПечатьДвухЧастей - булево, печатать обе части заявления (Истина) или только верхнюю (Ложь).
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьЗОССРУПМЖ(ПечатьДвухЧастей)
	
	ДлиннаСтрокиПФ = 95; //Для разбиения на строки, значение было изменено с 75 Дорошенко А.Ю 28.01.2023
	ДлиннаПолнойСтрокиПФ = 95;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	
	// Добавление регистра сведений с ФИО ответственного за регистрацию.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация КАК Организация,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения ЕСТЬ NULL
	|				ИЛИ бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &Момент < бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РАЗНОСТЬДАТ(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, &Момент, ГОД)
	|	КОНЕЦ КАК РегЛицоВозраст,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий КАК Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл КАК ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации КАК ВидОперации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид.КодПФР, """") КАК ДокументКодПФР,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид.КодПФР, """") КАК ДокументПредКодПФР,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКодПодразделения КАК ДокументКодПодразделенияПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМС КАК ОрганФМСПрибытия,
	|	бит_ФИОПроживающихСрезПоследних1.Фамилия КАК ФамилияПред,
	|	бит_ФИОПроживающихСрезПоследних1.Имя КАК ИмяПред,
	|	бит_ФИОПроживающихСрезПоследних1.Отчество КАК ОтчествоПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо КАК ДолжностноеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.СтепеньРодства КАК СтепеньРодства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес КАК ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес КАК КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия КАК ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия КАК ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЗаконныйПредставитель КАК ЗаконныйПредставитель,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.СтепеньРодстваЗаконногоПредставителя КАК СтепеньРодстваЗаконногоПредставителя,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуС КАК ПериодРегистрацииПоПрежнемуАдресуС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуПо КАК ПериодРегистрацииПоПрежнемуАдресуПо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМСКудаПрибыл КАК ОрганФМСКудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДанныеОПрибытии КАК ДанныеОПрибытии,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование КАК ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.Наименование КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВременнаяРегистрация КАК ВременнаяРегистрация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ответственный КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылИзЛС КАК ОткудаПрибылИзЛС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанИзЛС КАК КудаВыписанИзЛС,
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартирыЛС
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ФИОПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.ЗаконныйПредставитель) Тогда
		
		ЗапросПаспортныеДанныеЗаконногоПредставителя = Новый Запрос;
		ЗапросПаспортныеДанныеЗаконногоПредставителя.Текст = "ВЫБРАТЬ
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК КодПодразделенияДокумента
		|ИЗ
		|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Период, ФизЛицо = &ЗаконныйПредставитель) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних ";
		
		
		ЗапросПаспортныеДанныеЗаконногоПредставителя.УстановитьПараметр("ЗаконныйПредставитель", Выборка.ЗаконныйПредставитель);
		ЗапросПаспортныеДанныеЗаконногоПредставителя.УстановитьПараметр("Период", Объект.Дата);
		ПаспортныеДанныеЗП = ЗапросПаспортныеДанныеЗаконногоПредставителя.Выполнить().Выбрать();
		ПаспортныеДанныеЗП.Следующий();
		
	КонецЕсли;
	
	ЗапросПравоустанавливающиеДокументы = Новый Запрос;
	ЗапросПравоустанавливающиеДокументы.Текст = "ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы.Документ КАК Документ
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПравоустанавливающиеДокументы КАК бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы.Ссылка.Ссылка = &Ссылка
	|	И бит_ЗаявлениеОРегистрацииПоМестуПЖПравоустанавливающиеДокументы.ВыводитьВПФ = &ВыводитьВПФ";
	
	ЗапросПравоустанавливающиеДокументы.УстановитьПараметр("Ссылка", Объект.Ссылка);										  
	ЗапросПравоустанавливающиеДокументы.УстановитьПараметр("ВыводитьВПФ", ИСТИНА);
	
	ВыборкаПДок = ЗапросПравоустанавливающиеДокументы.Выполнить().Выбрать();
	
	ПравоустанавливающиеДокументы = Новый Массив;
	
	Пока ВыборкаПДок.Следующий() Цикл
		ДокументСсылка = ВыборкаПДок.Документ;
		ПравоустанавливающиеДокументы.Добавить(ДокументСсылка.ПолучитьОбъект());
	КонецЦикла;
	
	ЗапросОтветственныеЗаРегистрацию = Новый Запрос;
	ЗапросОтветственныеЗаРегистрацию.Текст = "ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.Ответственный КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.СтепеньРодства КАК СтепеньРодства
	|ПОМЕСТИТЬ Ответственные
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныеЗаРегистрацию КАК бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.Ссылка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	Ответственные.Ответственный КАК Ответственный,
	|	Ответственные.СтепеньРодства КАК СтепеньРодства
	|ИЗ
	|	Ответственные КАК Ответственные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Период, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО Ответственные.Ответственный = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо" ;
	
	ЗапросОтветственныеЗаРегистрацию.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ЗапросОтветственныеЗаРегистрацию.УстановитьПараметр("Период", КонецДня(Объект.Дата));
	
	ВыборкаОтветственные = ЗапросОтветственныеЗаРегистрацию.Выполнить().Выбрать();
	
	мОтветственные = Новый Массив;
	
	Пока ВыборкаОтветственные.Следующий() Цикл
		
		ОтветственныйСтепеньРодства = Новый Структура;
		
		Если ЗначениеЗаполнено(ВыборкаОтветственные.Ответственный) Тогда
			ОтветственныйСтепеньРодства.Вставить("Ответственный",  ВыборкаОтветственные.Ответственный);
			ОтветственныйСтепеньРодства.Вставить("СтепеньРодства", ВыборкаОтветственные.СтепеньРодства);
			ОтветственныйСтепеньРодства.Вставить("ВидДокумента",   ВыборкаОтветственные.ДокументВид);
			ОтветственныйСтепеньРодства.Вставить("СерияДокумента", ВыборкаОтветственные.ДокументСерия);
			ОтветственныйСтепеньРодства.Вставить("НомерДокумента", ВыборкаОтветственные.ДокументНомер);
			ОтветственныйСтепеньРодства.Вставить("ДатаВыдачиДокумента", ВыборкаОтветственные.ДокументДатаВыдачи);
			ОтветственныйСтепеньРодства.Вставить("ДокументКемВыдан", ВыборкаОтветственные.ДокументКемВыдан);
			ОтветственныйСтепеньРодства.Вставить("КодПодразделенияДокумента",ВыборкаОтветственные.ДокументКодПодразделения);
			мОтветственные.Добавить(ОтветственныйСтепеньРодства);	
		КонецЕсли;
		
		
	КонецЦикла;											  
	
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
		
		Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("ЗОССРУПМЖ_New");
		
		ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
		ОбластьПередОснованиями = Макет.ПолучитьОбласть("ПередОтветственными");
		ОбластьПослеОснований = Макет.ПолучитьОбласть("ПослеОснований");
		ОбластьПодписиОтветственных = Макет.ПолучитьОбласть("ПодписиОтветственных");
		ОбластьПодписьЗаявителя = Макет.ПолучитьОбласть("ПодписьЗаявителя");
		
		ЗаявлениеОСнятии = Макет.ПолучитьОбласть("Шапка1");
		// Таблица значений с данными  Проживающие, вкладка Адреса и телефоны.
		ИскомаяСтрока 	= ПолучитьКИ(Выборка.РегистрируемоеЛицо,Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие); 
		
		
		Если Выборка.ВременнаяРегистрация Тогда
			ЗаявлениеОСнятии.Параметры.ЖительстваПребывания = "ПРЕБЫВАНИЯ";	
			ЗаявлениеОСнятии.Параметры.ЖительстваПребывания2 = "пребывания";
		Иначе
			ЗаявлениеОСнятии.Параметры.ЖительстваПребывания = "ЖИТЕЛЬСТВА";
			ЗаявлениеОСнятии.Параметры.ЖительстваПребывания2 = "жительства";
		КонецЕсли;
		
		// Адрес по прописке.		
		ПолеКИ1           = ПолучитьДанныеИзКонтактнойИнформации("Адрес"                , "АдресПоПрописке");
		
		АдрПриб = ЭтаФорма.КонтактнаяИнформацияПолеОткудаПрибылПредставление; 
		АдрУб = ЭтаФорма.КонтактнаяИнформацияПолеКудаВыписанПредставление;
		
		Если Объект.РегистрируемоеЛицо.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресПроживающего);
			
			Строки = Объект.РегистрируемоеЛицо.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			Если Строки.количество() = 0 Тогда
				
				ВыборкаАдр 		= ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего, "Вид");
				
			Иначе
				
				ВыборкаАдр = Строки[0].Представление;
				
			КонецЕсли;		
			
		Иначе
			
			ВыборкаАдр 		= ИскомаяСтрока.Найти(Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего, "Вид");
			
		КонецЕсли;
		
		// Адрес по убытия.
		СтрокаАдрУбыт = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(Выборка.КудаВыписанАдрес);
		
		ДолжностьДЛО = Выборка.ОрганФМСКудаПрибыл.Должность;
		ДолжностноеЛицоОрганизации = ПолучитьИнициалы(Выборка.ОрганФМСКудаПрибыл.Руководитель.Наименование);
		
		ДолжностноеЛицо = ПолучитьИнициалы(Выборка.ДолжностноеЛицо.Наименование);
		
		// Почтовый адрес здания.
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
		
		ВыборкаПочтАдр = Неопределено;
		Для каждого СтрокаНабор Из НаборЗаписей  Цикл
			Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
				И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
				Тогда 
				ВыборкаПочтАдр = СтрокаНабор;
			КонецЕсли;	
		КонецЦикла;
		ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
		СтруктураПочтАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
		
		// БИТ ЖКХ 28.01.2021
		адресДляСправки = "";
		попытка
			если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаПочтАдр.Объект, "КонтактнаяИнформация") = истина И 
				ВыборкаПочтАдр.Объект.КонтактнаяИнформация <> неопределено И
				ВыборкаПочтАдр.Объект.КонтактнаяИнформация.Количество() > 0 тогда
				адресДляСправки = ПолучитьАдресДляСправки (ВыборкаПочтАдр.Объект.КонтактнаяИнформация[0].Значение);
			конецесли;           
		исключение
			адресДляСправки = "";
		конецпопытки;	
		
		ВидДокумента_1 = "";           
		ВидДокумента_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ВидДокумента, 25, ВидДокумента_1 , ВидДокумента_2 );
		
		ВидДокумента_Пред = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ВидДокументаПред, 25, ВидДокумента_Пред , ВидДокумента_2 );
		
		ПочтовыйАдресСтрока = Неопределено;
		Если Выборка.ДомРег.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
			
			Строки = Выборка.ДомРег.КонтактнаяИнформация.НайтиСтроки(Отбор);
			//ПочтовыйАдресПредставление = бит_УправлениеКонтактнойИнформациейНовый.КонтактнаяИнформацияОбъекта(Выборка.ДомРег, Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ПочтовыйАдресЗдания);
			ПочтовыйАдресПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Выборка.ДомРег, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
			
			Если ЗначениеЗаполнено(ПочтовыйАдресПредставление) Тогда
				
				ПочтовыйАдресСтрока = ПочтовыйАдресПредставление;
				ПочтовыйАдресСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
				
			ИначеЕсли Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.ДомРег.ПочтовыйАдрес) Тогда
				
				ПочтовыйАдресСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ДомРег.ПочтовыйАдрес);
				
			ИначеЕсли НЕ Строки.количество() = 0 Тогда
				
				//  15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда
					
					ПочтовыйАдресПредставление = Строки[0].Представление;
					ПочтовыйАдресСтруктура = ПолучитьАдресБСП(Строки[0].Значение);
					
					//---
				ИначеЕсли ЗначениеЗаполнено(Выборка.ДомРег.ПочтовыйАдресЗапятые) Тогда
					
					ПочтовыйАдресСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ДомРег.ПочтовыйАдресЗапятые);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.ДомРег.ПочтовыйАдрес) Тогда
					
					бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
					
					ВыборкаПочтАдр = Неопределено;
					Для каждого СтрокаНабор Из НаборЗаписей  Цикл
						Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
							И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
							Тогда 
							ВыборкаПочтАдр = СтрокаНабор;
						КонецЕсли;	
					КонецЦикла;
					
					ПочтовыйАдресСтрока = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
					ПочтовыйАдресСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
					
				Иначе
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перезаполните поле откуда прибыл адрес");
					
					Возврат Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;			
			
		Иначе
		
			бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
			
			ВыборкаПочтАдр = Неопределено;
			Для каждого СтрокаНабор Из НаборЗаписей  Цикл
				Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
					И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
					Тогда 
					ВыборкаПочтАдр = СтрокаНабор;
				КонецЕсли;	
			КонецЦикла;
			
			ПочтовыйАдресСтрока = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
			ПочтовыйАдресСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
			
		КонецЕсли;
		
		Если ТипЗнч(ПочтовыйАдресСтруктура) = Тип("Структура") и ПочтовыйАдресСтруктура.Свойство("Регион") Тогда
			ПочтовыйАдресСтрока = ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Регион),"рег. "+ ПочтовыйАдресСтруктура.Регион+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Район),"р-н "+ ПочтовыйАдресСтруктура.Район+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Город),"г. "+ ПочтовыйАдресСтруктура.Город+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.НаселенныйПункт),"нас.п. "+ ПочтовыйАдресСтруктура.НаселенныйПункт+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Улица),"ул. "+ ПочтовыйАдресСтруктура.Улица+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Дом),Строка(ПочтовыйАдресСтруктура.ТипДома)+" "+ ПочтовыйАдресСтруктура.Дом+ ", ","")
			+ ?(ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Корпус),Строка(ПочтовыйАдресСтруктура.ТипКорпуса)+" " + ПочтовыйАдресСтруктура.Корпус+ ", ","");
			
			ПочтовыйАдрес = Строка(ПочтовыйАдресСтрока) + ?(ЗначениеЗаполнено(Выборка.ПредставлениеКвартирыЛС)," кв. "+Строка(Выборка.ПредставлениеКвартирыЛС), "");
		ИначеЕсли ЗначениеЗаполнено(ПочтовыйАдресСтрока) И ПочтовыйАдресСтруктура.Свойство("ЗаПределамиРФ") Тогда
			ПочтовыйАдрес = ПочтовыйАдресСтрока + ", " + ?(ЗначениеЗаполнено(Выборка.ПредставлениеКвартирыЛС)," кв. "+Строка(Выборка.ПредставлениеКвартирыЛС), "") 
		Иначе
			
			ПочтовыйАдресСтрока = "";
			ПочтовыйАдрес = "";
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перезаполните почтовый адрес здания");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			ФИОФизЛицо = Строка(Выборка.Фамилия) + " " + Строка(Выборка.Имя) + " " + Строка(Выборка.Отчество); 
		Иначе
			ФИОФизЛицо = Строка(Выборка.РегистрируемоеЛицо);	
		КонецЕсли;	
		
		ФизЛицоСтр = ФИОФизЛицо;
		
		Если СнятиеСРегистрации(Объект.ВидОперации) или ПечатьДвухЧастей Тогда
			
			АдресРегистрации_1 = "";
			АдресРегистрации_2 = "";
			
			ЗаявлениеОСнятии.Параметры.Заполнить(Выборка);           
			
			// Заполнение места рождения регистрируемого лица.
			Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.МестоРождения) Тогда
				
				МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
				
			КонецЕсли;
			
			// Заполнение пола регистрируемого лица.
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				
				ЗаявлениеОСнятии.Параметры.ж 				  = "ж";   
				
			Иначе
				
				ЗаявлениеОСнятии.Параметры.м 				  = "м";   
				
			КонецЕсли;	
			
			// Добавлен в новый макет вывод и разбиение СНИЛС.
			Попытка
				ЗначениеНеЧисло = Ложь;
				СНИЛС = "";
				Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР) Тогда
					
					Для Значение = 1 по	СтрДлина(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР) Цикл
						
						Если ЗначениеНеЧисло = Ложь Тогда
							Если ЗначениеЗаполнено(СНИЛС) Тогда
								
								ПредСНИЛС = Прав(СНИЛС,СтрДлина(СНИЛС)- 5);
								
								СНИЛС = Строка("СНИЛС" + (Число(ПредСНИЛС) +1));
							Иначе
								СНИЛС = Строка("СНИЛС" + 1);
								
							КонецЕсли;	
							
						КонецЕсли;
						
						Если Значение = 1 Тогда
							
							ЗаявлениеОСнятии.Параметры[СНИЛС] = Лев(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР,Значение);	
						Иначе
							
							Если Найти("0123456789",Прав(Лев(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР,Значение),1))>0 тогда
								
								ЗаявлениеОСнятии.Параметры[СНИЛС] = Прав(Лев(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР,Значение),1);	
								
								ЗначениеНеЧисло = Ложь;
							Иначе
								
								ЗначениеНеЧисло = Истина;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;	
					
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ПочтовыйАдрес, 45, АдресРегистрации_1 , АдресРегистрации_2 );
			ЗаявлениеОСнятии.Параметры.АдресРегистрации_1 =  АдресРегистрации_1;
			ЗаявлениеОСнятии.Параметры.АдресРегистрации_2 =  АдресРегистрации_2;
			
			ФизЛицоМР1 = "";
			ФизЛицоМР2 = "";
			
			ФизЛицоСтр = ФизЛицоСтр +?(ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения), " " + Формат(Выборка.РегистрируемоеЛицо.ДатаРождения, "ДФ=dd.MM.yyyy") + " г.р. ", "")  
			+ ?(ЗначениеЗаполнено(МестоРождения), " Место рождения:" + ПолучитьАдресБезПодписей(МестоРождения), "");
						
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФизЛицоСтр, ДлиннаПолнойСтрокиПФ, ФизЛицоМР1 , ФизЛицоМР2 );
			
			ЗаявлениеОснятии.Параметры.ФизЛицо1 = ФизЛицоМР1;
			ЗаявлениеОСнятии.Параметры.ФизЛицо2 = ФизЛицоМР2;
			АдрПрибГрупп = "";
			Если ЗначениеЗаполнено(АдрПриб) Тогда
				
				АдресПрибытия_2_1 = "";
				АдресПрибытия_2_2 = "";
				
				Если НЕ Выборка.ОткудаПрибылИЗЛС И ЗначениеЗаполнено(ПолучитьСтруктуруАдресаПоЗначению(КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1].Значение).Улица) Тогда 
					АдрПриб = АдрПриб + ", кв " +  Выборка.ПредставлениеКвартирыЛС;	
				КонецЕсли;
								
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдрПриб, 25, АдресПрибытия_2_1 , АдресПрибытия_2_2 );
				АдрПрибГрупп = АдрПриб;
				
				Если Выборка.ВременнаяРегистрация И Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
					
					ДатаРегистрации = ПолучитьДатуРегистрации(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
					АдрПриб = АдрПриб 
					+?(ЗначениеЗаполнено(ДатаРегистрации),  " с " + Формат(ДатаРегистрации, "ДФ=dd.MM.yyyy"), "")
					+?(ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации), " по " + Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy"), "");	
					
				КонецЕсли;
				
				ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_1 = АдресПрибытия_2_1;
				ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_2 = АдресПрибытия_2_2;
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(АдрУб)  Тогда
				Если НЕ Выборка.КудаВыписанИзЛС И ЗначениеЗаполнено(ПолучитьСтруктуруАдресаПоЗначению(КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].Значение).Улица) Тогда
					АдрУб = АдрУб + ", кв " + Выборка.ПредставлениеКвартирыЛС;	
				КонецЕсли;
			КонецЕсли;
			
			ЗаявлениеОСнятии.Параметры.ОрганУчета 			= Выборка.ОрганФМСПрибытия;
			ЗаявлениеОСнятии.Параметры.ОрганУчетаПрописки 	= ?(ЗначениеЗаполнено(Выборка.ОрганФМСКудаПрибыл), Строка(Выборка.ОрганФМСКудаПрибыл), "");
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдрПриб, 25, АдресРегистрации_1 , АдресРегистрации_2 );
			ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_1 	= АдресРегистрации_1;
			ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_2 	= АдресРегистрации_2;
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдрУб, 45, АдресРегистрации_1 , АдресРегистрации_2 );
			ЗаявлениеОСнятии.Параметры.АдресРегистрации_1 =  АдресРегистрации_1;
			ЗаявлениеОСнятии.Параметры.АдресРегистрации_2 =  АдресРегистрации_2;			
			
			ЗаявлениеОСнятии.Параметры.ВыданДокумент_1 	= Строка(Выборка.ВыданДокумент);
			
			ЗаявлениеОСнятии.Параметры.ЧислоТек    = Формат(Выборка.Дата,"ДФ=dd");
			ДатаМесяц 							= Формат(Выборка.Дата,"ДФ='дд.ММММ  yyyy '");
			ЗаявлениеОСнятии.Параметры.МесяцГодТек = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			
			Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда
				ЗаявлениеОСнятии.Параметры.ДатаВыдачиДокумента  	= День(Выборка.ДатаВыдачиДокумента);
				ДатаМесяц 										= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
				ЗаявлениеОСнятии.Параметры.МесяцВыдачиДокумента 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ЗаявлениеОСнятии.Параметры.ГодВыдачиДокумента   	= Формат(Выборка.ДатаВыдачиДокумента,"ДФ=yyyy");
				
				Если ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
					Если ЗначениеЗаполнено(Выборка.ДокументКодПФР) Тогда
						ЗаявлениеОСнятии.Параметры.ВидДокумента_1 = Выборка.ДокументКодПФР; 
					Иначе	
						ЗаявлениеОСнятии.Параметры.ВидДокумента_1 = ВидДокумента_1; 
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(Выборка.ЗаконныйПредставитель) И (ПроверитьВозраст(Объект.РегистрируемоеЛицо) ИЛИ Объект.ЗаконныйПредставительВСвязиСНедееспособностью)  Тогда
				
				ЗаконныйПредставительСтрока = "" +?(ЗначениеЗаполнено(Выборка.СтепеньРодстваЗаконногоПредставителя), " " + Выборка.СтепеньРодстваЗаконногоПредставителя + " ", "")
				+ Выборка.ЗаконныйПредставитель.Наименование                                                                                                          
				+?(ЗначениеЗаполнено(Выборка.ЗаконныйПредставитель.ДатаРождения),  " " + Формат(Выборка.ЗаконныйПредставитель.ДатаРождения,"ДФ=dd.MM.yyyy" )+ " г.р.", "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.ВидДокумента), ", " + ПаспортныеДанныеЗП.ВидДокумента, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.СерияДокумента), ", сер." + ПаспортныеДанныеЗП.СерияДокумента, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.НомерДокумента), ", № " + ПаспортныеДанныеЗП.НомерДокумента, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.ДатаВыдачиДокумента), ", выдан: " + Формат(ПаспортныеДанныеЗП.ДатаВыдачиДокумента, "ДФ=dd.MM.yyyy"), "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.ДокументКемВыдан), " " + ПаспортныеДанныеЗП.ДокументКемВыдан, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.КодПодразделенияДокумента), ", код: " + ПаспортныеДанныеЗП.КодПодразделенияДокумента, "");	
				
				ЗаконныйПредставительСтрока= СокрЛП(ЗаконныйПредставительСтрока);
				ЗаконныйПредставитель1 = "";
				ЗаконныйПредставитель2 = "";
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ЗаконныйПредставительСтрока, ДлиннаПолнойСтрокиПФ, ЗаконныйПредставитель1,ЗаконныйПредставитель2);
				
				ЗаявлениеОСнятии.Параметры.ЗаконныйПредставитель_1 =  ЗаконныйПредставитель1;
				ЗаявлениеОСнятии.Параметры.ЗаконныйПредставитель_2 =  ЗаконныйПредставитель2;
				
			КонецЕсли;		
			
			ЗаявлениеОСнятии.Параметры.ОтветственныйП = ПолучитьИнициалы(Выборка.Ответственный);
			
			ТабДокумент.Вывести(ЗаявлениеОСнятии);
			
			Если СнятиеСРегистрации(Объект.ВидОперации) И Объект.СнимаемыеСРегУчета.Количество() > 1 Тогда
				ЗапросСН = Новый Запрос;
				ЗапросСН.Текст = "ВЫБРАТЬ
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий КАК Проживающий,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.МестоРождения КАК ПроживающийМестоРождения,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.ДатаРождения КАК ПроживающийДатаРождения,
				                 |	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Страна,
				                 |	МАКСИМУМ(бит_ГражданствоПроживающихСрезПоследних.Период) КАК Период,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации1,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.СтраховойНомерПФР КАК ПроживающийСтраховойНомерПФР,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ВременнаяРегистрация КАК ВременнаяРегистрация,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.Ответственный КАК Ответственный,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОткудаПрибылИзЛС КАК ОткудаПрибылИзЛС,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.КудаВыписанИзЛС КАК КудаВыписанИзЛС,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ЛицевойСчет.Квартира КАК КвартираРег
				                 |ПОМЕСТИТЬ ВТ_Гражданство
				                 |ИЗ
				                 |	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.СнимаемыеСРегУчета КАК бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
				                 |		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
				                 |ГДЕ
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка = &Ссылка
				                 |	И НЕ бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий = бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.РегистрируемоеЛицо
				                 |
				                 |СГРУППИРОВАТЬ ПО
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.МестоРождения,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.ДатаРождения,
				                 |	бит_ГражданствоПроживающихСрезПоследних.Страна,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.СтраховойНомерПФР,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ВременнаяРегистрация,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.Ответственный,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ДатаСнятияСРегистрации,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОткудаПрибылИзЛС,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.КудаВыписанИзЛС,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ЛицевойСчет.Квартира,
				                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации
				                 |;
				                 |
				                 |////////////////////////////////////////////////////////////////////////////////
				                 |ВЫБРАТЬ
				                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
				                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100)) КАК ДокументКемВыдан,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
				                 |	МАКСИМУМ(бит_ПаспортныеДанныеПроживающихСрезПоследних.Период) КАК Период
				                 |ПОМЕСТИТЬ ВТ_Документы
				                 |ИЗ
				                 |	ВТ_Гражданство КАК ВТ_Гражданство
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
				                 |		ПО ВТ_Гражданство.Проживающий = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
				                 |
				                 |СГРУППИРОВАТЬ ПО
				                 |	ВТ_Гражданство.Проживающий,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
				                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100))
				                 |;
				                 |
				                 |////////////////////////////////////////////////////////////////////////////////
				                 |ВЫБРАТЬ
				                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
				                 |	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
				                 |	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
				                 |	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
				                 |	МАКСИМУМ(бит_ФИОПроживающихСрезПоследних.Период) КАК Период
				                 |ПОМЕСТИТЬ ВТ_ФИО
				                 |ИЗ
				                 |	ВТ_Гражданство КАК ВТ_Гражданство
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
				                 |		ПО ВТ_Гражданство.Проживающий = бит_ФИОПроживающихСрезПоследних.ФизЛицо
				                 |
				                 |СГРУППИРОВАТЬ ПО
				                 |	ВТ_Гражданство.Проживающий,
				                 |	бит_ФИОПроживающихСрезПоследних.Фамилия,
				                 |	бит_ФИОПроживающихСрезПоследних.Имя,
				                 |	бит_ФИОПроживающихСрезПоследних.Отчество
				                 |;
				                 |
				                 |////////////////////////////////////////////////////////////////////////////////
				                 |ВЫБРАТЬ
				                 |	бит_ПроживающиеКонтактнаяИнформация.Представление КАК ОткудаПрибыл,
				                 |	ВТ_Гражданство.Проживающий КАК Проживающий
				                 |ПОМЕСТИТЬ ВТ_ОткудаПрибыл
				                 |ИЗ
				                 |	ВТ_Гражданство КАК ВТ_Гражданство
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
				                 |		ПО ВТ_Гражданство.Проживающий = бит_ПроживающиеКонтактнаяИнформация.Ссылка
				                 |ГДЕ
				                 |	бит_ПроживающиеКонтактнаяИнформация.Вид = &ВидОткудаПрибыл
				                 |;
				                 |
				                 |////////////////////////////////////////////////////////////////////////////////
				                 |ВЫБРАТЬ
				                 |	бит_ПроживающиеКонтактнаяИнформация.Представление КАК КудаУбыл,
				                 |	ВТ_Гражданство.Проживающий КАК Проживающий
				                 |ПОМЕСТИТЬ ВТ_КудаУбыл
				                 |ИЗ
				                 |	ВТ_Гражданство КАК ВТ_Гражданство
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
				                 |		ПО ВТ_Гражданство.Проживающий = бит_ПроживающиеКонтактнаяИнформация.Ссылка
				                 |ГДЕ
				                 |	бит_ПроживающиеКонтактнаяИнформация.Вид = &ВидКудаУбыл
				                 |;
				                 |
				                 |////////////////////////////////////////////////////////////////////////////////
				                 |ВЫБРАТЬ
				                 |	бит_Проживающиебит_ЗаконныеПредставители.Проживающий КАК ЗаконныйПредставитель,
				                 |	бит_Проживающиебит_ЗаконныеПредставители.Ссылка КАК Проживающий,
				                 |	бит_Проживающиебит_ЗаконныеПредставители.СтепеньРодства КАК СтепеньРодства,
				                 |	бит_Проживающиебит_ЗаконныеПредставители.ДокументОснование КАК ДокументОснование,
				                 |	бит_Проживающиебит_ЗаконныеПредставители.НомерСтроки КАК НомерСтроки
				                 |ПОМЕСТИТЬ ВТ_ЗаконныйПредставитель
				                 |ИЗ
				                 |	ВТ_Гражданство КАК ВТ_Гражданство
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.бит_ЗаконныеПредставители КАК бит_Проживающиебит_ЗаконныеПредставители
				                 |		ПО ВТ_Гражданство.Проживающий = бит_Проживающиебит_ЗаконныеПредставители.Ссылка
				                 |ГДЕ
				                 |	бит_Проживающиебит_ЗаконныеПредставители.НомерСтроки = 1
				                 |;
				                 |
				                 |////////////////////////////////////////////////////////////////////////////////
				                 |ВЫБРАТЬ
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ЗПДВид,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ЗПДСерия,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ЗПДНомер,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ЗПДДатаВыдачи,
				                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100)) КАК ЗПДКемВыдан,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ЗПДКодПодразделения,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ЗПДДатаРегистрацииПоМЖ,
				                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументПричинаЗамены КАК СТРОКА(100)) КАК ЗПДПричинаЗамены,
				                 |	МАКСИМУМ(бит_ПаспортныеДанныеПроживающихСрезПоследних.Период) КАК Период,
				                 |	ВТ_ЗаконныйПредставитель.Проживающий КАК Проживающий
				                 |ПОМЕСТИТЬ ВТ_ПДЗП
				                 |ИЗ
				                 |	ВТ_ЗаконныйПредставитель КАК ВТ_ЗаконныйПредставитель
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
				                 |		ПО ВТ_ЗаконныйПредставитель.ЗаконныйПредставитель = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
				                 |
				                 |СГРУППИРОВАТЬ ПО
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
				                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
				                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100)),
				                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументПричинаЗамены КАК СТРОКА(100)),
				                 |	ВТ_ЗаконныйПредставитель.Проживающий
				                 |;
				                 |
				                 |////////////////////////////////////////////////////////////////////////////////
				                 |ВЫБРАТЬ
				                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
				                 |	ВТ_ФИО.Фамилия КАК Фамилия,
				                 |	ВТ_ФИО.Имя КАК Имя,
				                 |	ВТ_ФИО.Отчество КАК Отчество,
				                 |	ВТ_Документы.ДокументВид КАК ВидДокумента,
				                 |	ВТ_Документы.ДокументСерия КАК СерияДокумента,
				                 |	ВТ_Документы.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
				                 |	ВТ_Документы.ДокументКемВыдан КАК ВыданДокумент,
				                 |	ВТ_Документы.ДокументКодПодразделения КАК ДокументКодПодразделения,
				                 |	ВТ_Документы.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
				                 |	ВТ_Гражданство.ДатаРегистрации КАК ДатаРегистрации,
				                 |	ВТ_Гражданство.ПроживающийМестоРождения КАК ПроживающийМестоРождения,
				                 |	ВТ_Гражданство.ПроживающийДатаРождения КАК ПроживающийДатаРождения,
				                 |	ВТ_Гражданство.Страна КАК Гражданство,
				                 |	ВТ_Гражданство.Проживающий.Пол КАК ПроживающийПол,
				                 |	ВТ_Документы.ДокументНомер КАК НомерДокумента,
				                 |	ВТ_ОткудаПрибыл.ОткудаПрибыл КАК ОткудаПрибыл,
				                 |	ВТ_КудаУбыл.КудаУбыл КАК КудаВыбыл,
				                 |	ВТ_Гражданство.ПроживающийСтраховойНомерПФР КАК ПроживающийСтраховойНомерПФР,
				                 |	ВТ_Гражданство.ВременнаяРегистрация КАК ВременнаяРегистрация,
				                 |	ВТ_Гражданство.Ответственный КАК Ответственный,
				                 |	ВТ_ПДЗП.ЗПДВид КАК ЗПДВид,
				                 |	ВТ_ПДЗП.ЗПДСерия КАК ЗПДСерия,
				                 |	ВТ_ПДЗП.ЗПДНомер КАК ЗПДНомер,
				                 |	ВТ_ПДЗП.ЗПДДатаВыдачи КАК ЗПДДатаВыдачи,
				                 |	ВТ_ПДЗП.ЗПДКемВыдан КАК ЗПДВыдан,
				                 |	ВТ_ПДЗП.ЗПДКодПодразделения КАК ЗПДКодПодразделения,
				                 |	ВТ_ПДЗП.ЗПДДатаРегистрацииПоМЖ КАК ЗПДДатаРегистрацииПоМЖ,
				                 |	ВТ_ПДЗП.ЗПДПричинаЗамены КАК ЗПДПричинаЗамены,
				                 |	ВТ_Гражданство.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
				                 |	ВТ_ОткудаПрибыл.Проживающий КАК Проживающий1,
				                 |	ВТ_Гражданство.ОткудаПрибылИзЛС КАК ОткудаПрибылИзЛС,
				                 |	ВТ_Гражданство.КудаВыписанИзЛС КАК КудаВыписанИзЛС,
				                 |	ВТ_Гражданство.КвартираРег КАК КвартираРег,
				                 |	ВТ_ЗаконныйПредставитель.ЗаконныйПредставитель КАК ЗаконныйПредставитель,
				                 |	ВТ_ЗаконныйПредставитель.СтепеньРодства КАК СтепеньРодстваЗаконногоПредставителя
				                 |ИЗ
				                 |	ВТ_Гражданство КАК ВТ_Гражданство
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
				                 |		ПО ВТ_Гражданство.Проживающий = ВТ_Документы.Проживающий
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИО КАК ВТ_ФИО
				                 |		ПО (ВТ_ФИО.Проживающий = ВТ_Документы.Проживающий)
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОткудаПрибыл КАК ВТ_ОткудаПрибыл
				                 |		ПО ВТ_Гражданство.Проживающий = ВТ_ОткудаПрибыл.Проживающий
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КудаУбыл КАК ВТ_КудаУбыл
				                 |		ПО ВТ_Гражданство.Проживающий = ВТ_КудаУбыл.Проживающий
				                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаконныйПредставитель КАК ВТ_ЗаконныйПредставитель
				                 |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПДЗП КАК ВТ_ПДЗП
				                 |			ПО ВТ_ЗаконныйПредставитель.Проживающий = ВТ_ПДЗП.Проживающий
				                 |		ПО ВТ_Гражданство.Проживающий = ВТ_ЗаконныйПредставитель.Проживающий";
				ЗапросСН.УстановитьПараметр("Ссылка", Объект.Ссылка);
				ЗапросСН.УстановитьПараметр("Момент", Объект.Дата);
				ЗапросСН.УстановитьПараметр("ВидОткудаПрибыл", 	Справочники.ВидыКонтактнойИнформации.АдресПрибытия);
				ЗапросСН.УстановитьПараметр("ВидКудаУбыл", 		Справочники.ВидыКонтактнойИнформации.АдресУбытия);
				
				ВыборкаСН = ЗапросСН.Выполнить().Выбрать();
				
				Пока ВыборкаСН.Следующий() Цикл	
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					ЗаявлениеОСнятии.Параметры.Физлицо1       =  "";
					ЗаявлениеОСнятии.Параметры.Физлицо2 	  =  "";			
					ЗаявлениеОСнятии.Параметры.ВидДокумента_1 =  "";
					ЗаявлениеОСнятии.Параметры.СерияДокумента =  "";
					ЗаявлениеОСнятии.Параметры.НомерДокумента =  "";
					ЗаявлениеОСнятии.Параметры.ВыданДокумент_1 = "";
					ЗаявлениеОСнятии.Параметры.ДокументКодПодразделения = "";
					ЗаявлениеОСнятии.Параметры.ДатаВыдачиДокумента  = "";
					ЗаявлениеОСнятии.Параметры.МесяцВыдачиДокумента = "";
					ЗаявлениеОСнятии.Параметры.ГодВыдачиДокумента   = "";
					ЗаявлениеОСнятии.Параметры.ЗаконныйПредставитель_1 =""; 
					ЗаявлениеОСнятии.Параметры.ЗаконныйПредставитель_2 ="";
					
					Если Объект.КудаВыписанИЗЛС Тогда
						
						ЗаявлениеОСнятии.Параметры.АдресРегистрации_1 =""; 
						ЗаявлениеОСнятии.Параметры.АдресРегистрации_2 =""; 
						
					Конецесли;
					
					Если Объект.ОткудаПрибылИЗЛС Тогда
						
						ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_1 = "";
						ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_2 = "";
						
					КонецЕсли;
					
					ЗаявлениеОСнятии.Параметры.СНИЛС1 =""; 
					ЗаявлениеОСнятии.Параметры.СНИЛС2 =""; 
					ЗаявлениеОСнятии.Параметры.СНИЛС3 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС4 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС5 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС6 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС7 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС8 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС9 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС10 ="";
					ЗаявлениеОСнятии.Параметры.СНИЛС11 ="";
					
					СНИЛС = "";
					
					ЗаявлениеОСнятии.Параметры.ж 				  = "";
					ЗаявлениеОСнятии.Параметры.м 				  = ""; 
					
					Если ЗначениеЗаполнено(ВыборкаСН.ПроживающийСтраховойНомерПФР) Тогда
						
						Для Значение = 1 по	СтрДлина(ВыборкаСН.ПроживающийСтраховойНомерПФР) Цикл
							
							Если ЗначениеНеЧисло = Ложь Тогда
								Если ЗначениеЗаполнено(СНИЛС) Тогда
									
									ПредСНИЛС = Прав(СНИЛС,СтрДлина(СНИЛС)- 5);
									
									СНИЛС = Строка("СНИЛС" + (Число(ПредСНИЛС) +1));
								Иначе
									СНИЛС = Строка("СНИЛС" + 1);
									
									
								КонецЕсли;	
								
							КонецЕсли;
							
							Если Значение = 1 Тогда
								
								ЗаявлениеОСнятии.Параметры[СНИЛС] = Лев(ВыборкаСН.ПроживающийСтраховойНомерПФР,Значение);	
							Иначе
								
								Если Найти("0123456789",Прав(Лев(ВыборкаСН.ПроживающийСтраховойНомерПФР,Значение),1))>0 тогда
									
									ЗаявлениеОСнятии.Параметры[СНИЛС] = Прав(Лев(ВыборкаСН.ПроживающийСтраховойНомерПФР,Значение),1);	
									
									ЗначениеНеЧисло = Ложь;
								Иначе
									
									ЗначениеНеЧисло = Истина;
									
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;	
						
					КонецЕсли;
					
					
					МестоРождения = "";
					// Заполнение места рождения регистрируемого лица.
					Если ЗначениеЗаполнено(ВыборкаСН.ПроживающийМестоРождения) Тогда
				
						МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(ВыборкаСН.ПроживающийМестоРождения);
					
					КонецЕсли;
	
					СтрокаФизЛицо = "" + ВыборкаСН.Проживающий
					+?(ЗначениеЗаполнено(ВыборкаСН.ПроживающийДатаРождения), " " + Формат(ВыборкаСН.ПроживающийДатаРождения, "ДФ=dd.MM.yyyy") + " г.р. ", "") 
					+?(ЗначениеЗаполнено(МестоРождения), " Место рождения:" + ПолучитьАдресБезПодписей(МестоРождения) + "", "");
					
					ФизЛицо_1 = "";
					ФизЛицо_2 = "";
					
					бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаФизЛицо,ДлиннаСтрокиПФ ,ФизЛицо_1, ФизЛицо_2);
					
					ЗаявлениеОСнятии.Параметры.ФизЛицо1 = ФизЛицо_1;
					ЗаявлениеОСнятии.Параметры.Физлицо2 = ФизЛицо_2;
					
					Если ЗначениеЗаполнено(ВыборкаСН.ВидДокумента) Тогда
						
						ЗаявлениеОСнятии.Параметры.ВидДокумента_1 =  ВыборкаСН.ВидДокумента;
						ЗаявлениеОСнятии.Параметры.СерияДокумента =  ВыборкаСН.СерияДокумента;
						ЗаявлениеОСнятии.Параметры.НомерДокумента =  ВыборкаСН.НомерДокумента;
						ЗаявлениеОСнятии.Параметры.ВыданДокумент_1 =  ВыборкаСН.ВыданДокумент;
						
						ЗаявлениеОСнятии.Параметры.ДокументКодПодразделения = ВыборкаСН.ДокументКодПодразделения;
						
						ЗаявлениеОСнятии.Параметры.ДатаВыдачиДокумента  = Формат(ВыборкаСН.ДатаВыдачиДокумента,"ДФ='дд'");
						ДатаМесяц 									    = Формат(ВыборкаСН.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
						ЗаявлениеОСнятии.Параметры.МесяцВыдачиДокумента = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
						ЗаявлениеОСнятии.Параметры.ГодВыдачиДокумента   = Формат(ВыборкаСН.ДатаВыдачиДокумента,"ДФ='yyyy'");	
						
					КонецЕсли;	
					//ВыборкаСН.Проживающий
					Если ЗначениеЗаполнено(ВыборкаСН.ЗаконныйПредставитель) И (ПроверитьВозраст(Объект.РегистрируемоеЛицо) ИЛИ Объект.ЗаконныйПредставительВСвязиСНедееспособностью)  Тогда
						
						ЗаконныйПредставительСтрока = "" +?(ЗначениеЗаполнено(ВыборкаСН.СтепеньРодстваЗаконногоПредставителя), " " + ВыборкаСН.СтепеньРодстваЗаконногоПредставителя + " ", "")
						+ ВыборкаСН.ЗаконныйПредставитель 
						+?(ЗначениеЗаполнено(ВыборкаСН.ЗаконныйПредставитель.ДатаРождения),  " " + Формат(ВыборкаСН.ЗаконныйПредставитель.ДатаРождения,"ДФ=dd.MM.yyyy" )+ " г.р.", "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ЗПДВид), ", " + ВыборкаСН.ЗПДВид, "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ЗПДСерия), ", сер." + ВыборкаСН.ЗПДСерия, "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ЗПДНомер), ", № " + ВыборкаСН.ЗПДНомер, "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ЗПДДатаВыдачи), ", выдан: " + Формат(ВыборкаСН.ЗПДДатаВыдачи, "ДФ=dd.MM.yyyy"), "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ЗПДВыдан), " " + ВыборкаСН.ЗПДВыдан, "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ЗПДКодПодразделения), ", код: " + ВыборкаСН.ЗПДКодПодразделения, "");	
						
						ЗаконныйПредставительСтрока= СокрЛП(ЗаконныйПредставительСтрока);
						
						бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ЗаконныйПредставительСтрока, ДлиннаСтрокиПФ, ЗаконныйПредставитель1,ЗаконныйПредставитель2);
						
						ЗаявлениеОСнятии.Параметры.ЗаконныйПредставитель_1 =  ЗаконныйПредставитель1;
						ЗаявлениеОСнятии.Параметры.ЗаконныйПредставитель_2 =  ЗаконныйПредставитель2;
						
					КонецЕсли;		
					
					АдресРегистрации_1 = "";
					АдресРегистрации_2 = "";
					
					АдресРегистрацииСтр = "";
					
					Если ВыборкаСН.КудаВыписанИЗЛС ТОгда 
						
						АдресРегистрацииСтр = ВыборкаСН.КудаВыбыл;
						
						бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресРегистрацииСтр, 45, АдресРегистрации_1, АдресРегистрации_2);
						ЗаявлениеОСнятии.Параметры.АдресРегистрации_1 = АдресРегистрации_1;
						ЗаявлениеОСнятии.Параметры.АдресРегистрации_2 = АдресРегистрации_2;
						
					КонецЕсли;
				
					АдресПрибытия_1 = "";
					АдресПрибытия_2 = "";
					
					Если ВыборкаСН.ОткудаПрибылИЗЛС Тогда
						СтрокаАдресПриб = ВыборкаСН.ОткудаПрибыл;
						
						Если ВыборкаСН.ВременнаяРегистрация Тогда
						
						СтрокаАдресПриб = "" + СтрокаАдресПриб
						+?(ЗначениеЗаполнено(ВыборкаСН.ДатаРегистрации), " с " + Формат(ВыборкаСН.ДатаРегистрации, "ДФ=dd.MM.yyyy"), "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ДатаСнятияСРегистрации), " по " + Формат(ВыборкаСН.ДатаСнятияСРегистрации, "ДФ=dd.MM.yyyy"), "");
						КонецЕсли;
					Иначе
						СтрокаАдресПриб = АдрПрибГрупп +?(ЗначениеЗаполнено(ВыборкаСН.ДатаРегистрации), " с " + Формат(ВыборкаСН.ДатаРегистрации, "ДФ=dd.MM.yyyy"), "")
						+?(ЗначениеЗаполнено(ВыборкаСН.ДатаСнятияСРегистрации), " по " + Формат(ВыборкаСН.ДатаСнятияСРегистрации, "ДФ=dd.MM.yyyy"), "");
				        
					КонецЕсли;					
					бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаАдресПриб, 25, АдресПрибытия_1, АдресПрибытия_2);
					
					ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_1 = АдресПрибытия_1;
					ЗаявлениеОСнятии.Параметры.АдресПрибытия_2_2 = АдресПрибытия_2;
					
					Если ВыборкаСН.Проживающий.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				
						ЗаявлениеОСнятии.Параметры.ж 				  = "ж";   
				
					Иначе
				
						ЗаявлениеОСнятии.Параметры.м 				  = "м";   
				
					КонецЕсли;
					
					ТабДокумент.Вывести(ЗаявлениеОСнятии);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Выборка.ВидОперации <> Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета И НЕ ПечатьДвухЧастей Тогда
			ДокОснование 	= Выборка.ДокументОснование;
			
			ДокументОснование_1 = "";
			ДокументОснование_2 = "";				
			
			ОбластьПередОснованиями.Параметры.Заполнить(Выборка);
			ОбластьПослеОснований.Параметры.Заполнить(Выборка);
			
			ОрганУчета_1 = "";
			ОрганУчета_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ОрганФМСКудаПрибыл, 70, ОрганУчета_1 , ОрганУчета_2);
			ОбластьПередОснованиями.Параметры.ОрганУчета_1			= ОрганУчета_1;
			ОбластьПередОснованиями.Параметры.ОрганУчета_2			= ОрганУчета_2;
			
			ФизЛицо = "" + Выборка.РегистрируемоеЛицо + 
			?(ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения), " " + Формат(Выборка.РегистрируемоеЛицо.ДатаРождения, "ЧЦ=; ДФ=dd.MM.yyyy"), ""); 
			 
			ФизЛицоМР = "" + ФизЛицо +  " " + бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
			ФЛМР1 = "";
			ФЛМР2 = "";
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФизЛицоМР, ДлиннаПолнойСтрокиПФ, ФЛМР1 , ФЛМР2);
			
			ОбластьПередОснованиями.Параметры.ФизЛицоМестоРождения1 = ФЛМР1;   
			ОбластьПередОснованиями.Параметры.ФизЛицоМестоРождения2 = ФЛМР2;
			
			// Заполнение пола регистрируемого лица.
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				ОбластьПередОснованиями.Параметры.ж 				  = "ж";   
			Иначе
				ОбластьПередОснованиями.Параметры.м 				  = "м";   	
			КонецЕсли;
			
			ДатаПрибытия = Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуС, "ДФ=dd.MM.yyyy");
			ДатаУбытия =  Формат(Выборка.ПериодРегистрацииПоПрежнемуАдресуПо, "ДФ=dd.MM.yyyy");
			АдресПрибытия = "";
			
			Если ЗначениеЗаполнено(АдрПриб) Тогда
				АдресПрибытия = АдрПриб 
				+?(ЗначениеЗаполнено(ДатаПрибытия), ", с " + ДатаПрибытия, "")
				+?(ЗначениеЗаполнено(ДатаУбытия)," по "+ ДатаУбытия, "");
			КонецЕсли;
			
			АдресПрибытия = АдресПрибытия + ",	" + Выборка.ДанныеОПрибытии;
			
			АдресПрибытия_1 = "";
			АдресПрибытия_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, ДлиннаСтрокиПФ, АдресПрибытия_1, АдресПрибытия_2);
			
			ОбластьПередОснованиями.Параметры.АдресПрибытия1     	  = АдресПрибытия_1;
			
			
			ТабДокумент.Вывести(ОбластьПередОснованиями);
			
			ОбластьАдресПрибытияСтрока = Макет.ПолучитьОбласть("АдресПрибытияСтрока");
			
			АдресПрибытияДлинна = СтрДлина(АдресПрибытия);
			АдресПрибытияВыведено = ДлиннаСтрокиПФ;
			
			Пока  АдресПрибытияВыведено <АдресПрибытияДлинна  Цикл			
				
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия_2, ДлиннаПолнойСтрокиПФ, АдресПрибытия_1, АдресПрибытия_2);
				
				ОбластьАдресПрибытияСтрока.Параметры.АдресПрибытия2 = АдресПрибытия_1;
				
				АдресПрибытияВыведено = АдресПрибытияВыведено + ДлиннаПолнойСтрокиПФ;
				
				ТабДокумент.Вывести(ОбластьАдресПрибытияСтрока);
				
			КонецЦикла;
			
			//Законный представитель
			Если ЗначениеЗаполнено(Выборка.ЗаконныйПредставитель) Тогда
				ОбластьЗаконныйПредставительШапка = Макет.ПолучитьОбласть("ЗаконныйПредставительШапка");
				ОбластьЗаконныйПредставительСтрока = Макет.ПолучитьОБласть("ЗаконныйПредставительСтрока");
				ЗаконныйПредставительСтрока = "" + Выборка.ЗаконныйПредставитель.Наименование 
				+?(ЗначениеЗаполнено(Выборка.ЗаконныйПредставитель.ДатаРождения),  " " + Формат(Выборка.ЗаконныйПредставитель.ДатаРождения,"ДФ=dd.MM.yyyy" )+ " г.р.", "")
				//+?(ЗначениеЗаполнено(Выборка.СтепеньРодстваЗаконногоПредставителя), " " + Выборка.СтепеньРодстваЗаконногоПредставителя, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.ВидДокумента), ", " + ПаспортныеДанныеЗП.ВидДокумента, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.СерияДокумента), ", сер." + ПаспортныеДанныеЗП.СерияДокумента, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.НомерДокумента), ", № " + ПаспортныеДанныеЗП.НомерДокумента, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.ДатаВыдачиДокумента), ", выдан: " + Формат(ПаспортныеДанныеЗП.ДатаВыдачиДокумента, "ДФ=dd.MM.yyyy"), "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.ДокументКемВыдан), " " + ПаспортныеДанныеЗП.ДокументКемВыдан, "")
				+?(ЗначениеЗаполнено(ПаспортныеДанныеЗП.КодПодразделенияДокумента), ", код: " + ПаспортныеДанныеЗП.КодПодразделенияДокумента, "");	
				
				ЗаконныйПредставительСтрока= СокрЛП(ЗаконныйПредставительСтрока);
				ЗаконныйПредставитель1 = "";
				ЗаконныйПредставитель2 = "";
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ЗаконныйПредставительСтрока, ДлиннаСтрокиПФ, ЗаконныйПредставитель1,ЗаконныйПредставитель2);
				
				ОбластьЗаконныйПредставительШапка.Параметры.ЗаконныйПредставитель_1 = ?(ЗначениеЗаполнено(Выборка.СтепеньРодстваЗаконногоПредставителя), " " + Выборка.СтепеньРодстваЗаконногоПредставителя, "") + " " + ЗаконныйПредставитель1;
				ТабДокумент.Вывести(ОбластьЗаконныйПредставительШапка);
				
				ДлиннаНужнойСтрокиЗП = СтрДлина(ЗаконныйПредставительСтрока);
				ВыведеноЗП = ДлиннаСтрокиПФ;
				
				Пока ВыведеноЗП < ДлиннаНужнойСтрокиЗП Цикл
					
					бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ЗаконныйПредставитель2, ДлиннаПолнойСтрокиПФ, ЗаконныйПредставитель1,ЗаконныйПредставитель2);
					
					ОбластьЗаконныйПредставительСтрока.Параметры.ЗаконныйПредставитель_2 = ЗаконныйПредставитель1;
					
					ВыведеноЗП = ВыведеноЗП + ДлиннаПолнойСтрокиПФ;
					
					ТабДокумент.Вывести(ОбластьЗаконныйПредставительСтрока);
				КонецЦикла;
				
			КонецЕсли;		
			
			//ОтветственныеЗаРегистрацию
			ОбластьОтветственныеШапка = Макет.ПолучитьОбласть("ОтветственныеШапка");
			ОбластьОтветственныеСтрока = Макет.ПолучитьОбласть("ОтветственныеСтрока");			
			
			СтрокаОтветственные = "";
			
			ПервыйОтветственный = Истина;
			МассивПодписиОтветственных = Новый Массив;
			Для Каждого Строка из мОтветственные Цикл 
				СтрокаОтветственные = "" + СтрокаОтветственные + Строка.Ответственный.Наименование 
				+?(ЗначениеЗаполнено(Строка.Ответственный.ДатаРождения)," " + Формат(Строка.Ответственный.ДатаРождения, "ДФ=dd.MM.yyyy") + " г.р", "");
				
				СтруктураПодписиОтветственных = Новый Структура;
				
				СтруктураПодписиОтветственных.Вставить("ФИО", ПолучитьИнициалы(Строка.Ответственный.Наименование));
				СтруктураПодписиОтветственных.Вставить("ВидДокумента", Строка.ВидДокумента);
				СтруктураПодписиОтветственных.Вставить("СерияДокумента", Строка.СерияДокумента);
				СтруктураПодписиОтветственных.Вставить("НомерДокумента", Строка.НомерДокумента);
				СтруктураПодписиОтветственных.Вставить("ДокументКемВыдан", Строка.ДокументКемВыдан);
				СтруктураПодписиОтветственных.Вставить("КодПодразделенияДокумента", Строка.КодПодразделенияДокумента);
				СтруктураПодписиОтветственных.Вставить("ДатаВыдачиДокументаПред", Формат(Строка.ДатаВыдачиДокумента ,"ДФ=dd"));
				СтруктураПодписиОтветственных.Вставить("МесяцВыдачиДокументаПред",Формат(Строка.ДатаВыдачиДокумента ,"ДФ=MM")); 
				СтруктураПодписиОтветственных.Вставить("ГодВыдачиДокументаПред", Формат(Строка.ДатаВыдачиДокумента ,"ДФ=yyyy"));
				
				МассивПодписиОтветственных.Добавить(СтруктураПодписиОтветственных);
				
				СтрокаОтветственные = СтрокаОтветственные + "; ";
				
			КонецЦикла;	
			
			СтрокаОтветственные = УбратьПоследнийСимвол(СтрокаОтветственные,  ",");
			Ответственные1 = "";
			Ответственные2 = "";
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаОтветственные, ДлиннаСтрокиПФ, Ответственные1,Ответственные2);
			
			ОбластьОтветственныеШапка.Параметры.ОтветственныеШапка =  Ответственные1;
			ТабДокумент.Вывести(ОбластьОтветственныеШапка);
			
			ДлиннаВыведеноОтветственные = ДлиннаСтрокиПФ;
			ДлиннаОтветственные = СтрДлина(СтрокаОтветственные);
			
			Пока ДлиннаВыведеноОтветственные < ДлиннаОтветственные Цикл
				
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Ответственные2, ДлиннаПолнойСтрокиПФ, Ответственные1,Ответственные2);
				
				Если ЗначениеЗаполнено(Ответственные1) Тогда
					ОбластьОтветственныеСтрока.Параметры.ОтветственныеСтрока =  Ответственные1;				
					ТабДокумент.Вывести(ОбластьОтветственныеСтрока);
				КонецЕсли;
				
				ДлиннаВыведеноОтветственные = ДлиннаВыведеноОтветственные + ДлиннаПолнойСтрокиПФ;
				
			КонецЦикла;
			
			
			//Документ Основание
			ОбластьДокОснШапка = Макет.ПолучитьОбласть("ДокОснШапка");
			ДокументОснование = Выборка.ДокументОснование;
			
			ДокументОснование1 = "";
			ДокументОснование2 = "";
						
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ДокументОснование, 25, ДокументОснование1,ДокументОснование2);
			
			ОбластьДокОснШапка.Параметры.ДокументОснование1 = ДокументОснование1;
						
			//Правоустанавливающие документы
			ОбластьПравоустанавливающиеДокументыСтрока = Макет.ПолучитьОбласть("ПравоустанавливающиеДокументыСтрока");
			
			СтрокаПравоустанавливающиеДокументы = "";
			ПравоустанавливающиеДокументы1 = "";
			ПравоустанавливающиеДокументы2 = "";
			
			Для Каждого Документ Из ПравоустанавливающиеДокументы Цикл
				СтрокаПравоустанавливающиеДокументы = СтрокаПравоустанавливающиеДокументы + Документ.Наименование + " №" + Документ.НомерДокумента + " от " + Формат(Документ.ДатаДокумента, "ДФ=dd.MM.yyyy")+", ";	
			КонецЦикла;
			
			СтрокаПравоустанавливающиеДокументы = УбратьПоследнийСимвол(СтрокаПравоустанавливающиеДокументы, ",");
			ДлиннаПдок = СтрДлина(СтрокаПравоустанавливающиеДокументы);
			
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаПравоустанавливающиеДокументы, ДлиннаСтрокиПФ-25, ПравоустанавливающиеДокументы1,ПравоустанавливающиеДокументы2);
			ОбластьДокОснШапка.Параметры.ПравоустанавливающийДокумент1 = ПравоустанавливающиеДокументы1;
			ТабДокумент.Вывести(ОбластьДокОснШапка);
			
			Пока СтрДлина(ПравоустанавливающиеДокументы2) > 0 Цикл
				
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ПравоустанавливающиеДокументы2, ДлиннаПолнойСтрокиПФ, ПравоустанавливающиеДокументы1,ПравоустанавливающиеДокументы2);
				Если ЗначениеЗаполнено(ПравоустанавливающиеДокументы1) Тогда
					ОбластьПравоустанавливающиеДокументыСтрока.Параметры.ПравоустанавливающийДокумент2 = ПравоустанавливающиеДокументы1;
					ТабДокумент.Вывести(ОбластьПравоустанавливающиеДокументыСтрока);
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьПослеОснований.Параметры.ВыданДокумент_1 		= Строка(Выборка.ВыданДокумент);
			
			ОбластьПослеОснований.Параметры.ЧислоТек    	= Формат(Выборка.Дата,"ДФ=dd");
			ДатаМесяц 							= Формат(Выборка.Дата,"ДФ='дд.MMMM'");
			ОбластьПослеОснований.Параметры.МесяцТек    	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ОбластьПослеОснований.Параметры.ГодТек      	= Формат(Выборка.Дата,"ДФ=yy");
			
			//ДатаВыдачиДокумента
			Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда
				ОбластьПослеОснований.Параметры.ДатаВыдачиДокумента  = День(Выборка.ДатаВыдачиДокумента);
				ДатаМесяц 									= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
				ОбластьПослеОснований.Параметры.МесяцВыдачиДокумента = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ОбластьПослеОснований.Параметры.ГодВыдачиДокумента   = Формат(Выборка.ДатаВыдачиДокумента,"ДФ=yyyy");
			КонецЕсли;
			
			//Адреса
			Если ТипЗнч(ВыборкаАдр) = Тип("Строка") Тогда
				ВыборкаАдр = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ВыборкаАдр);
				
				//10.12.2018
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаАдр, "НаселенныйПункт") = истина и ЗначениеЗаполнено(ВыборкаАдр) Тогда
					
					//Если ЗначениеЗаполнено(ВыборкаАдр.НаселенныйПункт) Тогда
					//	
					//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ВыборкаАдр.НаселенныйПункт;
					//	
					//КонецЕсли; 
					
					//// БИТ ЖКХ 26.01.2021
					//ОбластьПослеОснований.Параметры.НаселенныйПунктРег = адресДляСправки;
					//
					
					ОбластьПослеОснований.Параметры.УлицаРег    			= ВыборкаАдр.Улица;
					
					ОбластьПослеОснований.Параметры.ДомРег  				= ПолучитьНомерДома(ВыборкаАдр.Дом);
					ОбластьПослеОснований.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(ВыборкаАдр.Корпус);
					
					//ОбластьПослеОснований.Параметры.КвартираРег 			= ВыборкаАдр.Квартира;
					
				Иначе
					
					Если СтруктураПочтАдрес <> Неопределено И НЕ СтруктураПочтАдрес.Свойство("ЗаПределамиРФ") Тогда
						//Если ЗначениеЗаполнено(СтруктураПочтАдрес.НаселенныйПункт) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.НаселенныйПункт;
						//ИначеЕсли ЗначениеЗаполнено(СтруктураПочтАдрес.Город) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.Город;
						//ИначеЕсли ЗначениеЗаполнено(СтруктураПочтАдрес.Регион) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.Регион;
						//КонецЕсли;
						
						ОбластьПослеОснований.Параметры.УлицаРег    			= СтруктураПочтАдрес.Улица;
						ОбластьПослеОснований.Параметры.ДомРег  				= ПолучитьНомерДома(Выборка.ДомРег);
						ОбластьПослеОснований.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(Выборка.ДомРег);
						//ОбластьПослеОснований.Параметры.КвартираРег 			= Выборка.КвартираРег;
						
					Иначе
						
						ОбластьПослеОснований.Параметры.УлицаРег    			= Выборка.УлицаРег;
						ОбластьПослеОснований.Параметры.ДомРег  				= ПолучитьНомерДома(Выборка.ДомРег);
						ОбластьПослеОснований.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(Выборка.ДомРег);
						//ОбластьПослеОснований.Параметры.КвартираРег 			= Выборка.КвартираРег;
						
					КонецЕсли;
					
					// БИТ ЖКХ 26.01.2021
					//ОбластьПослеОснований.Параметры.НаселенныйПунктРег = адресДляСправки;
					
					
				КонецЕсли; 				
				
			Иначе
				
				
				Если ЗначениеЗаполнено(ВыборкаАдр.Представление) Тогда
					
					//Если ЗначениеЗаполнено(ВыборкаАдр.Поле5) Тогда
					//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле5;
					//ИначеЕсли ЗначениеЗаполнено(ВыборкаАдр.Поле4) Тогда
					//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле4;
					//ИначеЕсли ЗначениеЗаполнено(ВыборкаАдр.Поле3) Тогда
					//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле3;
					//ИначеЕсли ЗначениеЗаполнено(ВыборкаАдр.Поле2) Тогда
					//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ВыборкаАдр.Поле2;
					//КонецЕсли; 
					//
					//// БИТ ЖКХ 26.01.2021
					//ОбластьПослеОснований.Параметры.НаселенныйПунктРег = адресДляСправки;
					
					
					ОбластьПослеОснований.Параметры.УлицаРег    			= ВыборкаАдр.Поле6;
					ОбластьПослеОснований.Параметры.ДомРег  				= ПолучитьНомерДома(ВыборкаАдр.Поле7);
					ОбластьПослеОснований.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(ВыборкаАдр.Поле8);
					//ОбластьПослеОснований.Параметры.КвартираРег 			= ВыборкаАдр.Поле9;
					
				Иначе
					
					Если ПочтовыйАдресСтруктура <> Неопределено И НЕ ПочтовыйАдресСтруктура.Свойство("ЗаПределамиРФ") Тогда
						//Если ЗначениеЗаполнено(ПочтовыйАдресСтруктура.НаселенныйПункт) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ПочтовыйАдресСтруктура.НаселенныйПункт;
						//ИначеЕсли ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Город) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ПочтовыйАдресСтруктура.Город;
						//ИначеЕсли ЗначениеЗаполнено(ПочтовыйАдресСтруктура.Регион) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = ПочтовыйАдресСтруктура.Регион;
						//КонецЕсли;
						//
						//// БИТ ЖКХ 26.01.2021
						//ОбластьПослеОснований.Параметры.НаселенныйПунктРег = адресДляСправки;
						//
						
						ОбластьПослеОснований.Параметры.УлицаРег    			= ПочтовыйАдресСтруктура.Улица;
						ОбластьПослеОснований.Параметры.ДомРег  				= ПолучитьНомерДома(ПочтовыйАдресСтруктура.Дом);
						ОбластьПослеОснований.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(ПочтовыйАдресСтруктура.Корпус);
						//ОбластьПослеОснований.Параметры.КвартираРег 			= Выборка.КвартираРег;
						
					ИначеЕсли СтруктураПочтАдрес <> Неопределено И НЕ СтруктураПочтАдрес.Свойство("ЗаПределамиРФ") Тогда
						//Если ЗначениеЗаполнено(СтруктураПочтАдрес.НаселенныйПункт) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.НаселенныйПункт;
						//ИначеЕсли ЗначениеЗаполнено(СтруктураПочтАдрес.Город) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.Город;
						//ИначеЕсли ЗначениеЗаполнено(СтруктураПочтАдрес.Регион) Тогда
						//	ОбластьПослеОснований.Параметры.НаселенныйПунктРег = СтруктураПочтАдрес.Регион;
						//КонецЕсли;						
						//
						//// БИТ ЖКХ 26.01.2021
						//ОбластьПослеОснований.Параметры.НаселенныйПунктРег = адресДляСправки;
						
						ОбластьПослеОснований.Параметры.УлицаРег    			= СтруктураПочтАдрес.Улица;
						ОбластьПослеОснований.Параметры.ДомРег  				= ПолучитьНомерДома(СтруктураПочтАдрес.Дом);
						ОбластьПослеОснований.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(СтруктураПочтАдрес.Корпус);
						//ОбластьПослеОснований.Параметры.КвартираРег 			= Выборка.КвартираРег;
						
					Иначе
						
						ОбластьПослеОснований.Параметры.УлицаРег    			= Выборка.УлицаРег;
						ОбластьПослеОснований.Параметры.ДомРег  				= ПолучитьНомерДома(Выборка.ДомРег);
						ОбластьПослеОснований.Параметры.КорпусРег   			= ПолучитьНомерКорпуса(Выборка.КорпусРег);
						//ОбластьПослеОснований.Параметры.КвартираРег 			= Выборка.КвартираРег;
						
					КонецЕсли;
				КонецЕсли; 
				
			КонецЕсли;
			
			ОбластьПослеОснований.Параметры.НаселенныйПунктРег = "г. Омск";
			ОбластьПослеОснований.Параметры.КвартираРег = Выборка.ПредставлениеКвартирыЛС;
			
			Если ЗначениеЗаполнено(Выборка.ДатаВыдачиПред) Тогда
				ОбластьПослеОснований.Параметры.ДатаВыдачиДокументаПред  	= День(Выборка.ДатаВыдачиПред);
				ДатаМесяцПред 										    = Формат(Выборка.ДатаВыдачиПред,"ДФ='дд.MMMM'");
				ОбластьПослеОснований.Параметры.МесяцВыдачиДокументаПред 	= Сред(ДатаМесяцПред, 4, СтрДлина(ДатаМесяц));
				ОбластьПослеОснований.Параметры.ГодВыдачиДокументаПред   	= Формат(Выборка.ДатаВыдачиПред,"ДФ=yyyy");
				
				Если ЗначениеЗаполнено(Выборка.ВидДокументаПред) Тогда
					Если ЗначениеЗаполнено(Выборка.ДокументПредКодПФР) Тогда
						ОбластьПослеОснований.Параметры.ВидДокумента_Пред = Выборка.ДокументПредКодПФР; 
					Иначе	
						ОбластьПослеОснований.Параметры.ВидДокумента_Пред = ВидДокумента_Пред; 
					КонецЕсли;
				КонецЕсли;
				
				ОбластьПослеОснований.Параметры.ДокументКодПодразделенияПред = Выборка.ДокументКодПодразделенияПред; 
				ОбластьПослеОснований.Параметры.СерияДокументаПред 			= Выборка.СерияДокументаПред; 
				ОбластьПослеОснований.Параметры.НомерДокументаПред 			= Выборка.НомерДокументаПред; 
				ОбластьПослеОснований.Параметры.ВыданДокумент_Пред 			= Выборка.ВыданДокументПред; 
				
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
				Если ЗначениеЗаполнено(Выборка.ДокументКодПФР) Тогда
					ОбластьПослеОснований.Параметры.ВидДокумента_1 		= Выборка.ДокументКодПФР; 
				Иначе	
					ОбластьПослеОснований.Параметры.ВидДокумента_1 		= ВидДокумента_1; 
				КонецЕсли;
			КонецЕсли;
			
			// Добавлен в новый макет вывод и разбиение СНИЛС.
			Попытка
				ЗначениеНеЧисло = Ложь;
				СНИЛС = "";
				Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР) Тогда
					
					Для Значение = 1 по	СтрДлина(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР) Цикл
						
						Если ЗначениеНеЧисло = Ложь Тогда
							Если ЗначениеЗаполнено(СНИЛС) Тогда
								
								ПредСНИЛС = Прав(СНИЛС,СтрДлина(СНИЛС)- 5);
								
								СНИЛС = Строка("СНИЛС" + (Число(ПредСНИЛС) +1));
							Иначе
								СНИЛС = Строка("СНИЛС" + 1);
								
							КонецЕсли;	
							
						КонецЕсли;
						
						Если Значение = 1 Тогда
							
							ОбластьПослеОснований.Параметры[СНИЛС] = Лев(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР,Значение);	
						Иначе
							
							Если Найти("0123456789",Прав(Лев(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР,Значение),1))>0 тогда
								
								ОбластьПослеОснований.Параметры[СНИЛС] = Прав(Лев(Выборка.РегистрируемоеЛицо.СтраховойНомерПФР,Значение),1);	
								
								ЗначениеНеЧисло = Ложь;
							Иначе
								
								ЗначениеНеЧисло = Истина;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;	
					
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			
			ТабДокумент.Вывести(ОбластьПослеОснований);
			
			Для Каждого Ответственный Из МассивПодписиОтветственных  Цикл
				
				ФИОИнициалы = ПолучитьИнициалы(Ответственный.ФИО);	
				
				ОбластьПодписиОтветственных.Параметры.ФИООтветственного = ФИОИнициалы;
				ОбластьПодписиОтветственных.Параметры.ВидДокументаПред 			  = Ответственный.ВидДокумента;
				ОбластьПодписиОтветственных.Параметры.СерияДокументаПред			  = Ответственный.СерияДокумента;
				ОбластьПодписиОтветственных.Параметры.НомерДокументаПред			  = Ответственный.НомерДокумента;
				ОбластьПодписиОтветственных.Параметры.ВыданДокументПред 		  	  = Ответственный.ДокументКемВыдан;
				ОбластьПодписиОтветственных.Параметры.ДокументКодПодразделенияПред  = Ответственный.КодПодразделенияДокумента;
				
				ОбластьПодписиОтветственных.Параметры.ДатаВыдачиДокументаПред = Ответственный.ДатаВыдачиДокументаПред;
				ОбластьПодписиОтветственных.Параметры.МесяцВыдачиДокументаПред = Ответственный.МесяцВыдачиДокументаПред;
				ОбластьПодписиОтветственных.Параметры.ГодВыдачиДокументаПред   = Ответственный.ГодВыдачиДокументаПред;
				
				ТабДокумент.Вывести(ОбластьПодписиОтветственных);
			КонецЦикла;
			
			ОбластьПодписьЗаявителя.Параметры.ЧислоТек = 	Формат(Выборка.Дата,"ДФ=dd");
			ДатаМесяц 						= Формат(Выборка.Дата,"ДФ=dd.MM.yyyy");
			ОбластьПодписьЗаявителя.Параметры.МесяцТек = Сред(ДатаМесяц, 4, 2);
			ОбластьПодписьЗаявителя.Параметры.ГодТек   = Прав(Формат(Выборка.Дата,"ДФ=yyyy"), 2);
			
			ОбластьПодписьЗаявителя.Параметры.ДолжностноеЛицо = ДолжностноеЛицо;
			
			ТабДокумент.Вывести(ОбластьПодписьЗаявителя);
			
			ОбластьПринятоеРешениеШапка = Макет.ПолучитьОбласть("ПринятоеРешениеШапка");
			ОбластьПринятоеРешениеСтрока = Макет.ПолучитьОбласть("ПринятоеРешениеСтрока");
			ОбластьПринятоеРешениеПодвал = Макет.ПолучитьОбласть("ПринятоеРешениеПодвал");
			
			
			ПринятоеРешение_1 = "";
			ПринятоеРешение_2 = "";
			
			ПринятоеРешениеСтр = Выборка.ПринятоеРешение;
			ПринятоеРешениеСтр = СтрЗаменить(ПринятоеРешениеСтр, Символы.ПС, " ");
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ПринятоеРешениеСтр, 90, ПринятоеРешение_1 , ПринятоеРешение_2 );
			
			//Принятое решение
			ОбластьПринятоеРешениеШапка.Параметры.ПринятоеРешение_1     = ПринятоеРешение_1;
			ТабДокумент.Вывести(ОбластьПринятоеРешениеШапка);
			
			ДлиннаНужнойСтрокиПринятоеРешение = СтрДлина(Выборка.ПринятоеРешение);
			ПринятоеРешениеВыведено = 90;
			
			Пока ПринятоеРешениеВыведено < ДлиннаНужнойСтрокиПринятоеРешение Цикл
				
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ПринятоеРешение_2, 115, ПринятоеРешение_1 , ПринятоеРешение_2 );
				
				ОбластьПринятоеРешениеСтрока.Параметры.ПринятоеРешение_2     = ПринятоеРешение_1;
				ТабДокумент.Вывести(ОбластьПринятоеРешениеСтрока);
				
				ПринятоеРешениеВыведено = ПринятоеРешениеВыведено + 115;
				
			КонецЦикла;					
			
			ОбластьПринятоеРешениеПодвал.Параметры.ЧислоРеш    	= Формат(Выборка.ДатаРегистрации,"ДФ=dd");
			ДатаМесяцРеш 						= Формат(Выборка.ДатаРегистрации,"ДФ=dd.MM.yy");
			ОбластьПринятоеРешениеПодвал.Параметры.МесяцРеш    	= Сред(ДатаМесяцРеш, 4, 2);
			ОбластьПринятоеРешениеПодвал.Параметры.ГодРеш4     	= Формат(Выборка.ДатаРегистрации,"ДФ=yyyy");
			ОбластьПринятоеРешениеПодвал.Параметры.ДолжностноеЛицоОрганизации  = ДолжностноеЛицоОрганизации;				
			
			ОбластьПринятоеРешениеПодвал.Параметры.ДолжностьДЛО1 = ?(ЗначениеЗаполнено(ДолжностьДЛО), "Начальник " + ДолжностьДЛО, "");
			
			
			ТабДокумент.Вывести(ОбластьПринятоеРешениеПодвал);
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните обязательные поля - Лицевой счет и Регистрируемое лицо и запишите документ";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресБезПодписей(Адрес)
	
	СтрокаРезультат = СтрЗаменить(Адрес, "страна:", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "область:", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "район:", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "село (дер.):", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "Населенный пункт:", "");
	
	Возврат СтрокаРезультат;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой адресный листок прибытия.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьАЛП(МакетНовогоОбразца = Ложь)  
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация КАК Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий КАК Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование КАК ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл КАК ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации КАК ВидОперации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо КАК ДолжностноеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрацииПроживающего,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Страна,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрацииДокумент,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес КАК ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес КАК КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.Пол КАК Пол,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия КАК ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия КАК ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылИзЛС КАК ОткудаПрибылИзЛС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанИзЛС КАК КудаВыписанИзЛС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдресЗапятые КАК ОткудаПрибылАдресЗапятые,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдресЗапятые КАК ПочтовыйАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуС КАК ПериодРегистрацииПоПрежнемуАдресуС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуПо КАК ПериодРегистрацииПоПрежнемуАдресуПо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДанныеОПрибытии КАК ДанныеОПрибытии,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМС КАК ПаспортнаяСлужба,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ответственный КАК ОтветственныйПользователь,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМСКудаПрибыл КАК ОрганФМСПрибытия,
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартирыЛС
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
		
	ВыборкаТЗ = Запрос.Выполнить().Выгрузить();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСверху = 3;
	ТабДокумент.ПолеСлева = 3;
	ТабДокумент.ПолеСнизу = 3;
	ТабДокумент.ПолеСправа = 3;
	
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	
	Если МакетНовогоОбразца Тогда
		Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("АЛП_New");
	Иначе 	
		Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("АЛП");
	КонецЕсли;
	
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если ВыборкаТЗ.Количество()= 0 Тогда
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ВыборкаИсходник = ВыборкаТЗ[0];
	                     
	ДанныеПечати = Новый Структура;
	
	Для Каждого Колонка Из ВыборкаТЗ.Колонки Цикл
		ДанныеПечати.Вставить(Колонка.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ДанныеПечати, ВыборкаИсходник);
	
	// При переводе к верхнему регистру типы данных приведены к строке.
	ДанныеПечати.ДокументОснование         = ВРег(Строка(ВыборкаИсходник.ДокументОснование));
	ДанныеПечати.ПринятоеРешение           = ВРег(Строка(ВыборкаИсходник.ПринятоеРешение));
	ДанныеПечати.ОткудаПрибыл              = ВРег(Строка(ВыборкаИсходник.ОткудаПрибыл));
	ДанныеПечати.УлицаРег                  = ВРег(Строка(ВыборкаИсходник.УлицаРег));
	ДанныеПечати.ДомРег                    = ПолучитьНомерДома(ВРег(Строка(ВыборкаИсходник.ДомРег)));
	ДанныеПечати.КвартираРег               = ВРег(Строка(ВыборкаИсходник.КвартираРег));
	ДанныеПечати.КорпусРег                 = ПолучитьНомерКорпуса(ВРег(Строка(ВыборкаИсходник.КорпусРег)));
	ДанныеПечати.ПочтовыйАдрес             = ВРег(ВыборкаИсходник.ПочтовыйАдрес);
	
	Если ЗначениеЗаполнено(ВыборкаИсходник.ВидДокумента) Тогда
		Если ЗначениеЗаполнено(ВыборкаИсходник.ВидДокумента.КодПФР) Тогда
			ДанныеПечати.ВидДокумента 		   = ВыборкаИсходник.ВидДокумента.КодПФР; 
		Иначе	
			ДанныеПечати.ВидДокумента          = ВРег(Строка(ВыборкаИсходник.ВидДокумента));
		КонецЕсли;
	КонецЕсли;
	
	ДанныеПечати.СерияДокумента            = ВРег(ВыборкаИсходник.СерияДокумента);
	ДанныеПечати.НомерДокумента            = ВРег(ВыборкаИсходник.НомерДокумента);
	ДанныеПечати.ВыданДокумент             = ВРег(ВыборкаИсходник.ВыданДокумент);
	ДанныеПечати.ДокументКодПодразделения  = ВРег(ВыборкаИсходник.ДокументКодПодразделения);
	
	Если ЗначениеЗаполнено(ВыборкаИсходник.ВидДокументаПред) Тогда
		Если ЗначениеЗаполнено(ВыборкаИсходник.ВидДокументаПред.КодПФР) Тогда
			ДанныеПечати.ВидДокументаПред 		   = ВыборкаИсходник.ВидДокументаПред.КодПФР; 
		Иначе	
			ДанныеПечати.ВидДокументаПред          = ВРег(Строка(ВыборкаИсходник.ВидДокументаПред));
		КонецЕсли;
	КонецЕсли;
	
	ДанныеПечати.СерияДокументаПред        = ВРег(ВыборкаИсходник.СерияДокументаПред);
	ДанныеПечати.НомерДокументаПред        = ВРег(ВыборкаИсходник.НомерДокументаПред);
	ДанныеПечати.ВыданДокументПред         = ВРег(ВыборкаИсходник.ВыданДокументПред);
	ДанныеПечати.Страна                    = ВРег(Строка(ВыборкаИсходник.Страна));
	ДанныеПечати.Фамилия                   = ВРег(ВыборкаИсходник.Фамилия);
	ДанныеПечати.Имя                       = ВРег(ВыборкаИсходник.Имя);
	ДанныеПечати.Отчество                  = ВРег(ВыборкаИсходник.Отчество);
	
	ВыданДокумент_1 = "";
	ВыданДокумент_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ДанныеПечати.ВыданДокумент, 42, ВыданДокумент_1 , ВыданДокумент_2 );
	ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
	ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
	
	СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(ДанныеПечати.МестоРождения);
	ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
	ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
	ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
	ШапкаОбласть.Параметры.НаселенныйПунктРожд = СтруктураМестоРождения.Село;
	
	Если МакетНовогоОбразца Тогда
		ШапкаОбласть.Параметры.СтранаРожд = СтруктураМестоРождения.Страна;
	КонецЕсли;
	
	Если ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ИначеЕсли  ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.Гражданство = ДанныеПечати.Страна;
	
	ШапкаОбласть.Параметры.Заполнить(ДанныеПечати);
	
	Если 
		
		Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаПаспорта Тогда
		
		ШапкаОбласть.Параметры.ВидДокумента             = "";
		ШапкаОбласть.Параметры.НомерДокумента           = "";
		
		// 10.10.2018
		Если МакетНовогоОбразца Тогда
			ШапкаОбласть.Параметры.ДеньВыдачиДокумента      = "";
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента     = "";
			ШапкаОбласть.Параметры.ГодВыдачиДокумента       = "";
			ШапкаОбласть.Параметры.ДокументКодПодразделения = "";

		иначе
			ШапкаОбласть.Параметры.ДатаВыдачиДокумента      = "";
		конецесли; 
		
		ШапкаОбласть.Параметры.СерияДокумента           = "";
		ШапкаОбласть.Параметры.ВыданДокумент_1          = "";
		ШапкаОбласть.Параметры.ВыданДокумент_2          = "";
		
		
	КонецЕсли; 
	
	Если МакетНовогоОбразца Тогда
		
		ШапкаОбласть.Параметры.ПериодРегистрацииС =  Формат(ВыборкаИсходник.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ=dd.MM.yyyy" );
		ШапкаОбласть.Параметры.ПериодРегистрацииПо = Формат(ВыборкаИсходник.ПериодРегистрацииПоПрежнемуАдресуПо, "ДФ=dd.MM.yyyy");
		
		ПаспортнаяСлужба_1 = "";
		ПаспортнаяСлужба_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВРег(Строка(ДанныеПечати.ОрганФМСПрибытия)), 40, ПаспортнаяСлужба_1 , ПаспортнаяСлужба_2 );
		
		ШапкаОбласть.Параметры.ПаспортнаяСлужба_1 = ВРег(ПаспортнаяСлужба_1);
		ШапкаОбласть.Параметры.ПаспортнаяСлужба_2 = ВРег(ПаспортнаяСлужба_2);
		
		ШапкаОбласть.Параметры.КодПаспортнойСлужбы = ДанныеПечати.ОрганФМСПрибытия.КодПодразделения;
		
		ШапкаОбласть.Параметры.КвартираРег = ВыборкаИсходник.ПредставлениеКвартирыЛС;
	Иначе
		ШапкаОбласть.Параметры.ПаспортнаяСлужба = ВРег(Строка(ДанныеПечати.ПаспортнаяСлужба));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПечати.ДатаРождения) Тогда
		
		Если МакетНовогоОбразца Тогда
			
			ШапкаОбласть.Параметры.ДеньРождения  = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд'");
			ДатаМесяц				 			 = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРождения = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРождения   = Формат(ДанныеПечати.ДатаРождения,"ДФ='yyyy'");
			
		Иначе
			ШапкаОбласть.Параметры.ДатаРождения		= Формат(ДанныеПечати.ДатаРождения,"ДЛФ=DD");
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ВыборкаИсходник.ДатаРегистрации) Тогда
		
		Если ДанныеПечати.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства Тогда
			
			ЗачеркнутыйШрифт = Новый Шрифт(Макет.Область("ТекстПребывания").Шрифт,,,,,,Истина);
			ШапкаОбласть.Область("ТекстПребывания").Шрифт = ЗачеркнутыйШрифт;
			
		ИначеЕсли ДанныеПечати.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания    Тогда
			
			ЗачеркнутыйШрифт = Новый Шрифт(Макет.Область("ТекстЖительство").Шрифт,,,,,,Истина);
			ШапкаОбласть.Область("ТекстЖительство").Шрифт = ЗачеркнутыйШрифт;
			
		КонецЕсли; 
				
	КонецЕсли;
	
	ЗаполнятьКвартиру = Ложь;
	РегЛицо = ВыборкаИсходник.РегистрируемоеЛицо;
	Отбор = Новый Структура();
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресПроживающего);
	Строки = РегЛицо.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресПроживающего);

		Строки = РегЛицо.КонтактнаяИнформация.НайтиСтроки(Отбор);
	КонецЕсли;
	
	Если Строки.Количество() > 0 Тогда
		АдресФактПроживания = Строки[0].Значение;
		АдресФактПроживания = ПолучитьМуниципальныйАдресБСП(АдресФактПроживания);
	Иначе
		АдресФактПроживания = ПолучитьМуниципальныйАдресБСП(ДанныеПечати.ЛицевойСчет);
		ЗаполнятьКвартиру = Истина;
	КонецЕсли;
	
	СтруктураАдресРегистрации = АдресФактПроживания;
	
		Если ЗначениеЗаполнено(СтруктураАдресРегистрации)  Тогда
			
			Если НЕ СтруктураАдресРегистрации.Свойство("ЗаПределамиРФ") Тогда
				
				ШапкаОбласть.Параметры.РегионРег 			= ВРег(СтруктураАдресРегистрации.Регион);
				ШапкаОбласть.Параметры.РайонРег 			= ВРег(СтруктураАдресРегистрации.Район);
				ШапкаОбласть.Параметры.ГородРег 			= ВРег(СтруктураАдресРегистрации.Город);
				ШапкаОбласть.Параметры.НаселенныйПунктРег 	= ВРег(СтруктураАдресРегистрации.НаселенныйПункт);
				ШапкаОбласть.Параметры.УлицаРег 			= ВРег(СтруктураАдресРегистрации.Улица);
				ШапкаОбласть.Параметры.КорпусРег 			= ВРег(СтруктураАдресРегистрации.Корпус);
				ШапкаОбласть.Параметры.ДомРег	 			= ВРег(СтруктураАдресРегистрации.Дом);
				ШапкаОбласть.Параметры.КвартираРег			= ВРег(СтруктураАдресРегистрации.Квартира);
					
				//+bit_semenov.v_03.02.2022
				//Если берем адрес из ЛС, то в СтруктураАдресРегистрации квартиры нет, берем прямо из ЛС 
				Если ДанныеПечати.ВидОперации 				= Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания И ЗаполнятьКвартиру Тогда
					ШапкаОбласть.Параметры.КвартираРег	 	= Строка(ВыборкаИсходник.ПредставлениеКвартирыЛС);
				ИначеЕсли ДанныеПечати.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства Тогда
					ШапкаОбласть.Параметры.КвартираРег	 	= Строка(СтруктураАдресРегистрации.Квартира);	
				КонецЕсли;
				//-bit_semenov.v_03.02.2022
				
			КонецЕсли;
			
		КонецЕсли;

	
	Если МакетНовогоОбразца Тогда
		
			ШапкаОбласть.Параметры.ДеньРегистрации  = Формат(ВыборкаИсходник.ДатаРегистрации,"ДФ='дд'");
			ДатаМесяц				 				= Формат(ВыборкаИсходник.ДатаРегистрации,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРегистрации = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРегистрации   = Формат(ВыборкаИсходник.ДатаРегистрации,"ДФ='yyyy'");
			
			Если Не (Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства 
				ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания)
				И ЗначениеЗаполнено(Объект.ПериодРегистрацииПоПрежнемуАдресуС) И Не ЗначениеЗаполнено(Объект.ПериодРегистрацииПоПрежнемуАдресуПо) Тогда
				ШапкаОбласть.Параметры.ДеньРегистрации  = Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд'");
				ДатаМесяц				 				= Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцРегистрации = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодРегистрации   = Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='yyyy'");
			КонецЕсли;
						
			Если ЗначениеЗаполнено(ВыборкаИсходник.ДатаСнятияСРегистрацииДокумент) Тогда
				ШапкаОбласть.Параметры.ДеньСнятияСРегистрации  = Формат(ВыборкаИсходник.ДатаСнятияСРегистрацииДокумент,"ДФ='дд'");
				ДатаМесяц				 					   = Формат(ВыборкаИсходник.ДатаСнятияСРегистрацииДокумент,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцСнятияСРегистрации = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодСнятияСРегистрации   = Формат(ВыборкаИсходник.ДатаСнятияСРегистрацииДокумент,"ДФ='yyyy'");
			КонецЕсли;
		
	КонецЕсли;

	
	Если ЗначениеЗаполнено(ДанныеПечати.ДатаВыдачиДокумента) Тогда
		
		Если МакетНовогоОбразца Тогда
						
				ШапкаОбласть.Параметры.ДеньВыдачиДокумента    = Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДФ='дд'");
				ДатаМесяц				 					  = Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцВыдачиДокумента   = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодВыдачиДокумента     = Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДФ='yyyy'");
						
		Иначе
			
			ШапкаОбласть.Параметры.ДатаВыдачиДокумента    = Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДЛФ=DD");
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ МакетНовогоОбразца Тогда
		
		ШапкаОбласть.Параметры.ДатаСоставления        = Формат(ДанныеПечати.Дата,"ДЛФ=DD");
		
	КонецЕсли;

	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	
	Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии ИЛИ Объект.ОткудаПрибыл = перечисления.бит_ВариантыИзмененияМестаПребывания.СменаПаспорта Тогда
		
		СтруктураАдресПрибИзДрРегиона = СтруктураАдресРегистрации;
			
	Иначе
		СтруктураАдресПрибИзДрРегиона = ПолучитьМуниципальныйАдресБСП(КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1].Значение);
		//Если НЕ ЗначениеЗаполнено(СтруктураАдресПрибИзДрРегиона.Улица) И ЗначениеЗаполнено(СтруктураАдресПрибИзДрРегиона.Район) Тогда
		//	СтруктураАдресПрибИЗДрРегиона.Квартира = ДанныеПечати.ПредставлениеКвартирыЛС;
		//КонецЕсли;                                            

	КонецЕсли;
	
	Если НЕ ДанныеПечати.ОткудаПрибылИЗЛС Тогда
		Если СтруктураАдресПрибИзДрРегиона <> Неопределено И ЗначениеЗаполнено(СтруктураАдресПрибИзДрРегиона.Улица) Тогда
			
			СтруктураАдресПрибИзДрРегиона.Квартира = ДанныеПечати.ПредставлениеКвартирыЛС;
			СтруктураАдресПрибИзДрРегиона.Корпус = ДанныеПечати.КорпусРег;
			СтруктураАдресПрибИзДрРегиона.Улица = ДанныеПечати.УлицаРег;
			СтруктураАдресПрибИзДрРегиона.Дом = ДанныеПечати.ДомРег;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураАдресПрибИзДрРегиона) И НЕ СтруктураАдресПрибИзДрРегиона.Свойство("ЗаПределамиРФ") Тогда
		Если МакетНовогоОбразца Тогда
			ШапкаОбласть.Параметры.СтранаПрибДГ = СтруктураАдресПрибИзДрРегиона.Страна;
		КонецЕсли;
		
		Попытка
			ШапкаОбласть.Параметры.СтранаПрибДГ          = ВРег(СтруктураАдресПрибИзДрРегиона.Страна);
		Исключение
		КонецПопытки; 	 
		
		ШапкаОбласть.Параметры.РегионПрибДГ = ВРег(СтруктураАдресПрибИзДрРегиона.Регион);			
		
		Если МакетНовогоОбразца Тогда
			
			ШапкаОбласть.Параметры.ДанныеОПрибытии0 = ВыборкаИсходник.ДанныеОПрибытии;
			
		КонецЕсли;
		
		ШапкаОбласть.Параметры.РайонПрибДГ           = ВРег(СтруктураАдресПрибИзДрРегиона.Район) ;
		ШапкаОбласть.Параметры.ГородПрибДГ           = ВРег(СтруктураАдресПрибИзДрРегиона.Город) ;
		ШапкаОбласть.Параметры.НаселенныйПунктПрибДГ = ВРег(СтруктураАдресПрибИзДрРегиона.НаселенныйПункт) ;
		ШапкаОбласть.Параметры.УлицаПрибДГ           = ВРег(СтруктураАдресПрибИзДрРегиона.Улица) ;
		ШапкаОбласть.Параметры.ДомПрибДГ             = ВРег(СтруктураАдресПрибИзДрРегиона.Дом) ;
		ШапкаОбласть.Параметры.КорпусПрибДГ          = ВРег(СтруктураАдресПрибИзДрРегиона.Корпус) ;
		ШапкаОбласть.Параметры.КвартираПрибДГ        = ВРег(СтруктураАдресПрибИзДрРегиона.Квартира) ;
		
	КонецЕсли;
			
	Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
		
		// Поиск предыдущих ФИО при смене ФИО.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	бит_ФИОПроживающих.Фамилия,
		|	бит_ФИОПроживающих.Имя,
		|	бит_ФИОПроживающих.Отчество
		|ИЗ
		|	РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
		|ГДЕ
		|	бит_ФИОПроживающих.Период <= &Момент
		|	И бит_ФИОПроживающих.ФизЛицо = &ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ФИОПроживающих.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Момент" , НачалоДня(ДанныеПечати.Дата));
		Запрос.УстановитьПараметр("ФизЛицо", ДанныеПечати.РегистрируемоеЛицо);
		
		ТаблицаФИО = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаФИО.Количество() = 2 Тогда
			ШапкаОбласть.Параметры.ФамилияСмена  = ВРег(ТаблицаФИО[1].Фамилия);
			ШапкаОбласть.Параметры.ИмяСмена      = ВРег(ТаблицаФИО[1].Имя);
			ШапкаОбласть.Параметры.ОтчествоСмена = ВРег(ТаблицаФИО[1].Отчество);
		КонецЕсли;
		
		Если МакетНовогоОбразца Тогда			
			     			
			Если ЗначениеЗаполнено(ДанныеПечати.ДатаРождения) Тогда
				
				ШапкаОбласть.Параметры.ДеньРожденияСмена  = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд'");
				ДатаМесяц 							 	  = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцРожденияСмена = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодРожденияСмена   = Формат(ДанныеПечати.ДатаРождения,"ДФ='yyyy'");
				
			КонецЕсли;
			
			Если ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				ШапкаОбласть.Область("ПолМуж1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
			ИначеЕсли  ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				ШапкаОбласть.Область("ПолЖен1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
			КонецЕсли; 
			
		Иначе
			
			Если ЗначениеЗаполнено(ДанныеПечати.ДатаРождения) Тогда
				ШапкаОбласть.Параметры.ГодРожденияСмена = Формат(ДанныеПечати.ДатаРождения,"ДФ='yyyy'");
			КонецЕсли; 
			
		КонецЕсли; 		
		
	КонецЕсли; 
	
	Если МакетНовогоОбразца Тогда
		
		ШапкаОбласть.Параметры.ДокументСоставил = ПолучитьИнициалы(ВыборкаИсходник.ОтветственныйПользователь);
		ШапкаОбласть.Параметры.ДеньСоставил =    Формат(ВыборкаИсходник.Дата,"ДФ='дд'");
		ДатаМесяц  = Формат(ВыборкаИсходник.Дата,"ДФ=dd.MM.yy");
		ШапкаОбласть.Параметры.МесяцСоставил   = Сред(ДатаМесяц, 4, 2);
		ШапкаОбласть.Параметры.ГодСоставил  = Формат(ВыборкаИсходник.Дата,"ДФ=yyyy");
		
		Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
			
			ШапкаОбласть.Параметры.ДеньЗарегистрировал =    Формат(ВыборкаИсходник.ДатаРегистрации,"ДФ='дд'");
			ДатаМесяц  = Формат(ВыборкаИсходник.ДатаРегистрации,"ДФ=dd.MM.yy");
			ШапкаОбласть.Параметры.МесяцЗарегистрировал   = Сред(ДатаМесяц, 4, 2);
			ШапкаОбласть.Параметры.ГодЗарегистрировал  = Формат(ВыборкаИсходник.ДатаРегистрации,"ДФ=yyyy");

		Иначе
			
			ШапкаОбласть.Параметры.ДеньЗарегистрировал =    Формат(ВыборкаИсходник.Дата,"ДФ='дд'");
			ДатаМесяц  = Формат(ВыборкаИсходник.Дата,"ДФ=dd.MM.yy");
			ШапкаОбласть.Параметры.МесяцЗарегистрировал   = Сред(ДатаМесяц, 4, 2);
			ШапкаОбласть.Параметры.ГодЗарегистрировал  = Формат(ВыборкаИсходник.Дата,"ДФ=yyyy");

		КонецЕсли;
		
		
	КонецЕсли;
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьЛСУВ()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"  ,Объект.Ссылка);
	Запрос.УстановитьПараметр("ФизЛицо" ,Объект.РегистрируемоеЛицо);
	Запрос.УстановитьПараметр("Момент"  ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОписаниеДругойПричины,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылИзЛС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанИзЛС,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ПроживающиеДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдресЗапятые
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ФизЛицо = &ФизЛицо) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|			И бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	
	Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("ЛСУВ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	// Фалг вида оперции регистрации по месту жительства.
	РегистрацияПМЖ = (Выборка.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства);
	
	Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ОткудаПрибылПредставление);
		
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) и Объект.ОткудаПрибылИзЛС Тогда
			
			ОткудаПрибылКонтактнаяИнформацияНаСервере();
			
			Если НЕ ЗначениеЗаполнено(ОткудаПрибылПредставлениеЗапятые) Тогда
				
				НаборЗаписей = НЕОПРЕДЕЛЕНО;
				
				
				бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ЛицевойСчет.Здание);
				
				Для Каждого СтрокаНабора Из НаборЗаписей Цикл
					Если СтрокаНабора.Вид = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания Тогда
						ИскомаяСтрока = СтрокаНабора;
					КонецЕсли;
				КонецЦикла;
				
				ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
				
				СтруктураОткудаПрибыл = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
			Иначе 
				
				СтруктураОткудаПрибыл = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ОткудаПрибылПредставлениеЗапятые);
				
			КонецЕсли;
			
		ИначеЕсли Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) Тогда
			
			СтруктураОткудаПрибыл = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
			
		ИначеЕсли НЕ Строки.количество() = 0 Тогда
			
			//  15.10.2018
			Если ЗначениеЗаполнено(Строки[0].Значение) Тогда
				
				ОткудаПрибыл = Строки[0].Представление;
				СтруктураОткудаПрибыл = ПолучитьАдресБСП(Строки[0].Значение);
				
				//---				
			ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдресЗапятые) Тогда
				
				СтруктураОткудаПрибыл = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдресЗапятые);
				
				
			ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) и Объект.ОткудаПрибылИзЛС = Ложь Тогда
				
				СтруктураОткудаПрибыл = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
				
			Иначе
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перезаполните поле откуда прибыл адрес");
				
				СтруктураОткудаПрибыл = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Отбор = Новый Структура();
		Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.КудаВыписанПредставление);
		
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.КудаВыписанАдрес) Тогда
			
			СтруктураКудаВыписан = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.КудаВыписанАдрес);
			
		ИначеЕсли НЕ Строки.количество() = 0 Тогда
			
			//  15.10.2018
			Если ЗначениеЗаполнено(Строки[0].Значение) Тогда
				
				КудаВыписан = Строки[0].Представление;
				СтруктураКудаВыписан = ПолучитьАдресБСП(Строки[0].Значение);
				
				//---				
			ИначеЕсли ЗначениеЗаполнено(Выборка.КудаВыписанАдресЗапятые) Тогда
				
				СтруктураКудаВыписан = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.КудаВыписанАдресЗапятые);
				
			ИначеЕсли ЗначениеЗаполнено(Выборка.КудаВыписанАдрес) Тогда
				
				Если Объект.КудаВыписанИзЛС Тогда
					
					КудаВыписанКонтактнаяИнформацияНаСервере();
					
					Если НЕ ЗначениеЗаполнено(КудаВыписанПредставлениеЗапятые) Тогда
						
						НаборЗаписей = НЕОПРЕДЕЛЕНО;
						
						
						бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ЛицевойСчет.Здание);
						
						Для Каждого СтрокаНабора Из НаборЗаписей Цикл
							Если СтрокаНабора.Вид = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания Тогда
								ИскомаяСтрока = СтрокаНабора;
							КонецЕсли;
						КонецЦикла;
						
						ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
						
						СтруктураКудаВыписан = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
					Иначе 
						
						СтруктураКудаВыписан = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(КудаВыписанПредставлениеЗапятые);
						
					КонецЕсли;
					
					
				Иначе
					СтруктураКудаВыписан = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.КудаВыписанАдрес);
				КонецЕсли;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Перезаполните поле куда выписан адрес";
				Сообщение.Сообщить();
				
				СтруктураОткудаПрибыл = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	Иначе
		
		СтруктураОткудаПрибыл = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
		СтруктураКудаВыписан = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.КудаВыписанАдрес);
		
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
		
		Если НЕ СтруктураОткудаПрибыл = Неопределено Тогда
			
			ШапкаОбласть.Параметры.РегионПриб          = СтруктураОткудаПрибыл.Регион; 
			ШапкаОбласть.Параметры.ГородПриб           = СтруктураОткудаПрибыл.Город;
			ШапкаОбласть.Параметры.РайонПриб           = СтруктураОткудаПрибыл.Район;
			ШапкаОбласть.Параметры.СтранаПриб          = СтруктураОткудаПрибыл.Страна;
			
			ШапкаОбласть.Параметры.НаселенныйПунктПриб 	= ?(ПустаяСтрока(СтруктураОткудаПрибыл.НаселенныйПункт)
			,СтруктураОткудаПрибыл.Улица 
			+ ", д." + СтруктураОткудаПрибыл.Дом 
			+?(ЗначениеЗаполнено(СтруктураОткудаПрибыл.корпус),", корп. " + СтруктураОткудаПрибыл.корпус,"") 
			+ ", кв." +СтруктураОткудаПрибыл.Квартира
			,СтруктураОткудаПрибыл.НаселенныйПункт);
			
		КонецЕсли;
		
		Если НЕ СтруктураКудаВыписан = Неопределено Тогда
			
			ШапкаОбласть.Параметры.РегионРег          = СтруктураКудаВыписан.Регион; 
			ШапкаОбласть.Параметры.РайонРег           = СтруктураКудаВыписан.Район;
			ШапкаОбласть.Параметры.ГородРег           = СтруктураКудаВыписан.Город; 
			ШапкаОбласть.Параметры.СтранаРег          = СтруктураКудаВыписан.Страна;
			
			ШапкаОбласть.Параметры.НаселенныйПунктРег = ?(ПустаяСтрока(СтруктураКудаВыписан.НаселенныйПункт)
			,СтруктураКудаВыписан.Улица 
			+ ", д." + СтруктураКудаВыписан.Дом 
			+?(ЗначениеЗаполнено(СтруктураКудаВыписан.корпус),", корп. " + СтруктураКудаВыписан.корпус,"") 
			+ ", кв." +СтруктураКудаВыписан.Квартира
			,СтруктураКудаВыписан.НаселенныйПункт);
			
		КонецЕсли;
		
		ГодРегистрации = Формат(Выборка.ПроживающиеДатаРегистрации, "ДФ=yyyy");
		   
		Если НЕ ПустаяСтрока(ГодРегистрации) Тогда
			
			ШапкаОбласть.Параметры.ГодРегПредМесто1 = Сред(ГодРегистрации,1,1);
			ШапкаОбласть.Параметры.ГодРегПредМесто2 = Сред(ГодРегистрации,2,1);
			ШапкаОбласть.Параметры.ГодРегПредМесто3 = Сред(ГодРегистрации,3,1);
			ШапкаОбласть.Параметры.ГодРегПредМесто4 = Сред(ГодРегистрации,4,1);
			
		КонецЕсли; 
		
		Если НЕ РегистрацияПМЖ Тогда
			ШапкаОбласть.Параметры.ЧислоТек = Формат(Выборка.Дата,"ДФ=dd");
			ДатаМесяц 						= Формат(Выборка.Дата,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцТек = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодТек   = Формат(Выборка.Дата,"ДФ=yyyy");
			
			ДолжностноеЛицоОрганизации = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Выборка.Организация,Выборка.ДолжностноеЛицо, Выборка.Дата); 
			
			ШапкаОбласть.Параметры.ДолжностноеЛицоОрганизации  = ДолжностноеЛицоОрганизации;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.МестоРождения) Тогда
			
			СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
			ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
			ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
			ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
			ШапкаОбласть.Параметры.СтранаРожд          = СтруктураМестоРождения.Страна;
			ШапкаОбласть.Параметры.НаселенныйПунктРожд = СтруктураМестоРождения.Село;
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В справочнике ""Проживающие"" заполните место рождения регистрируемого лица!";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.Пол) Тогда
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			КонецЕсли;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В справочнике ""Проживающие"" ФИО регистрируемого лица!";
			Сообщение.Сообщить();
		КонецЕсли; 
		
		ШапкаОбласть.Параметры.Заполнить(Выборка);
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
			ШапкаОбласть.Параметры.ДеньРожд   = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=dd");
			ДатаМесяц 						  = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРожд  = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			МесяцРожд                         = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=MM");
			ШапкаОбласть.Параметры.МесяцРожд1 = Сред(МесяцРожд,1,1);
			ШапкаОбласть.Параметры.МесяцРожд2 = Сред(МесяцРожд,2,1);
			ГодРожд                           = Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ=yyyy");
			ШапкаОбласть.Параметры.ГодРожд1   = Сред(ГодРожд,1,1);
			ШапкаОбласть.Параметры.ГодРожд2   = Сред(ГодРожд,2,1);
			ШапкаОбласть.Параметры.ГодРожд3   = Сред(ГодРожд,3,1);
			ШапкаОбласть.Параметры.ГодРожд4   = Сред(ГодРожд,4,1);
		Иначе 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В справочнике ""Проживающие"" заполните дату рождения регистрируемого лица!";
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЕсли; 
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой приказа о проведении.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьУВОРУ()
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация КАК Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий КАК Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование КАК ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл КАК ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации КАК ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ФИОПроживающихСрезПоследних.ФизЛицо.МестоРождения КАК ФизЛицоМестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ЛицевойСчетЗданиеПаспортнаяСлужба,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо КАК ДолжностноеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМСКудаПрибыл КАК ОрганФМСКудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМС КАК ОрганФМС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМС.Руководитель КАК ОрганФМСДолжностноеЛицо,
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартиры
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗапросСнимаемыеСРег = Новый Запрос;
	ЗапросСнимаемыеСРег.Текст = "ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий КАК Проживающий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.ДатаРождения КАК ПроживающийДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации, 
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОрганФМС КАК ОрганФМСВыбытия
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.СнимаемыеСРегУчета КАК бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка = &Ссылка";
	
	ЗапросСнимаемыеСРег.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаСнимаемыеСРег = ЗапросСнимаемыеСРег.Выполнить().Выбрать();
	
	РегЛицаСтр = "";
	Пока ВыборкаСнимаемыеСРег.Следующий() Цикл
		
		РегЛицаСтр = РегЛицаСтр 
		+?(ЗначениеЗаполнено(ВыборкаСнимаемыеСРег.Проживающий)," "+ Строка(ВыборкаСнимаемыеСРег.Проживающий),"")
		+?(ЗначениеЗаполнено(ВыборкаСнимаемыеСРег.ПроживающийДатаРождения), ", "+Формат(ВыборкаСнимаемыеСРег.ПроживающийДатаРождения,"ДФ='yyyy ""г.р;""'"), "");
		
	КонецЦикла;
	РегЛицаСтр = УбратьПоследнийСимвол(РегЛицаСтр, ";") + ".";
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	ТабДокумент.РазмерСтраницы = "A5";
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСправа = 5;
	ТабДокумент.ПолеСнизу = 5;
	
	Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("УВОРУ");
	
	ШапкаОбласть   = Макет.ПолучитьОбласть("Шапка");
	РегЛицаОбласть = Макет.ПолучитьОбласть("РегЛица");	
	АдресЛицСчетОбласть = Макет.ПолучитьОбласть("АдресЛицСчет");
	АдресЛицСчетДопСтрока = Макет.ПолучитьОбласть("АдресЛицСчетДопСтрока");
	ОформленоСнятиеОбласть  = Макет.ПолучитьОбласть("ОформленоСнятие");
	НаименованиеОрганизцаииОбласть = Макет.ПолучитьОбласть("НаименованиеОрганизации");
	ПодвалОбласть  = Макет.ПолучитьОбласть("Подвал");
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	//ШапкаОбласть.Параметры.ЧислоТек = Формат(Выборка.Дата,"ДФ=dd");
	//ДатаМесяц 						= Формат(Выборка.Дата,"ДФ='дд.MMMM'");
	//ШапкаОбласть.Параметры.МесяцТек = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	//ШапкаОбласть.Параметры.ГодТек   = Формат(Выборка.Дата,"ДФ=yy");
	
	ШапкаОбласть.Параметры.ОрганУчета = Объект.ОрганФМСКудаПрибыл;
	
	АдресОрганаФМС = бит_ПаспортныйСтолСервер.ПолучитьАдресИзКонтактнойИнформации(Объект.ОрганФМС, "Фактический");
	
	ОрганУчетаАдрес_1 = "";
	ОрганУчетаАдрес_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресОрганаФМС, 40, ОрганУчетаАдрес_1 , ОрганУчетаАдрес_2 );
	ШапкаОбласть.Параметры.ОрганУчетаАдрес_1 = ОрганУчетаАдрес_1;
	ШапкаОбласть.Параметры.ОрганУчетаАдрес_2 = ОрганУчетаАдрес_2;
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
		
		ФизЛицо_1 = "";
		ФизЛицо_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(РегЛицаСтр, 70, ФизЛицо_1 , ФизЛицо_2 );
		ШапкаОбласть.Параметры.ФизЛицо_1 = ФизЛицо_1;
		ТабДокумент.Вывести(ШапкаОбласть);
		
		ДлиннаРегЛица = СтрДлина(РегЛицаСтр);
		ДлиннаТекСтроки = 70;
		
		Пока ДлиннаТекСтроки < ДлиннаРегЛица  Цикл
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФизЛицо_2, 75, ФизЛицо_1 , ФизЛицо_2 );
			РегЛицаОбласть.Параметры.ФизЛицо_2 = ФизЛицо_1;
			ДлиннаТекСтроки = ДлиннаТекСтроки + 75;
			ТабДокумент.Вывести(РегЛицаОбласть);
			
		КонецЦикла;
		
	КонецЕсли; 	
	
	ОформленоСнятиеОбласть.Параметры.ЧислоСнят = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd");
	ДатаМесяц 						= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
	ОформленоСнятиеОбласть.Параметры.МесяцСнят = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ОформленоСнятиеОбласть.Параметры.ГодСнят   = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=yy");
	
	ПредставлениеРег_1 = "";
	ПредставлениеРег_2 = "";
	
	Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда
		СтрокаАдресРегистрации = Выборка.ПочтовыйАдрес + ", кв." + Строка(Выборка.ПредставлениеКвартиры);
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(СтрокаАдресРегистрации, 75, ПредставлениеРег_1 , ПредставлениеРег_2 );
	КонецЕсли; 
	
	АдресЛицСчетОбласть.Параметры.ПредставлениеРег_1 = ПредставлениеРег_1;
	ТабДокумент.Вывести(АдресЛицСчетОбласть);
	
	Если ЗначениеЗаполнено(ПредставлениеРег_2) Тогда 
		АдресЛицСчетДопСтрока.Параметры.ПредставлениеРег_2 = ПредставлениеРег_2;
		ТабДокумент.Вывести(АдресЛицСчетДопСтрока);
	КонецЕсли;
	
	НаименованиеОрганизации_1 = "";
	НаименованиеОрганизации_2 = "";
	
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ОрганФМС, 39, НаименованиеОрганизации_1 , НаименованиеОрганизации_2 );
	
	ОформленоСнятиеОбласть.Параметры.НаименованиеОрганизации = НаименованиеОрганизации_1;
	ТабДокумент.Вывести(ОформленоСнятиеОбласть);
	
	Пока ЗначениеЗаполнено(НаименованиеОрганизации_2) Цикл
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(НаименованиеОрганизации_2, 39, НаименованиеОрганизации_1, НаименованиеОрганизации_2);
		НаименованиеОрганизцаииОбласть.Параметры.НаименованиеОрганизации_2 = НаименованиеОрганизации_1;
		ТабДокумент.Вывести(НаименованиеОрганизцаииОбласть);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Выборка.ОрганФМСДолжностноеЛицо) Тогда
		ПодвалОбласть.Параметры.ДолжностноеЛицо = ПолучитьИнициалы(Выборка.ОрганФМСДолжностноеЛицо);	
	КонецЕсли;
	
	ТабДокумент.Вывести(ПодвалОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьАЛУ(МакетНовогоОбразца = Ложь)
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	ТабДокумент.Автомасштаб = Истина;	
	ТабДокумент.ПолеСверху = 3;
	ТабДокумент.ПолеСлева = 3;
	ТабДокумент.ПолеСнизу = 3;
	ТабДокумент.ПолеСправа = 3;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация КАК Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ответственный КАК ОтветственныйПользователь,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий КАК Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование КАК ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации КАК ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМС КАК ОрганФМСВыбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	бит_КонтактнаяИнформация.Представление КАК ОткудаПрибыл,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
	|	ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОписаниеДругойПричины КАК ОписаниеДругойПричины,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес КАК ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес КАК КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.Пол КАК Пол,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия КАК ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия КАК ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.СвидетельствоОСмерти КАК СвидетельствоОСмерти,
	|	ВЫБОР
	|		КОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба ССЫЛКА Справочник.Контрагенты
	|			ТОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПоОКПО
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба ССЫЛКА Справочник.бит_ОрганыФМС
	|					ТОГДА бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК КодПаспортнойСлужбы,
	|	бит_СвидетельстваОСмерти.Номер КАК УМРНомер,
	|	бит_СвидетельстваОСмерти.ДатаСоставления КАК УМРДатаСоставления,
	|	бит_СвидетельстваОСмерти.КемВыдано КАК УМРКемВыдано,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдресЗапятые КАК ОткудаПрибылАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдресЗапятые КАК КудаВыписанАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВременнаяРегистрация КАК ВременнаяРегистрация,
	|	бит_СвидетельстваОСмерти.СерияСвидетельства КАК УМРСерия,
	|	бит_СвидетельстваОСмерти.ДатаСмерти КАК УМРДатаСмерти,
	|	бит_СвидетельстваОСмерти.ДатаВыдачи КАК УМРДатаВыдачи,
	|	бит_СвидетельстваОСмерти.НомерСвидетельства КАК УМРНомерСвидетельства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РешениеСуда.Наименование КАК РешениеСуда,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РешениеСуда.ДатаРешения КАК РешениеСудаДатаРешения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РешениеСуда.КемВыдано КАК РешениеСудаКемВыдано,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РешениеСуда.ДатаВступленияВЗаконнуюСилу КАК РешениеСудаДатаВступленияВЗаконнуюСилу,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОрганФМС.КодПодразделения КАК ОрганФМСКодПодразделения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РешениеСуда.ДелоНомер КАК РешениеСудаНомер,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылИзЛС КАК ОткудаПрибылИзЛС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанИзЛС КАК КудаВыписанИзЛС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуС КАК ПериодРегистрацииПоПрежнемуАдресуС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПериодРегистрацииПоПрежнемуАдресуПо КАК ПериодРегистрацииПоПрежнемуАдресуПо,
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартирыЛС,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДанныеОПрибытии КАК ДанныеОПрибытии
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|			И бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_КонтактнаяИнформация.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СвидетельстваОСмерти КАК бит_СвидетельстваОСмерти
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_СвидетельстваОСмерти.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат ТабДокумент;
	КонецЕсли; 	
	
	ДанныеПечати = Новый Структура;
	
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		
		ДанныеПечати.Вставить(Колонка.Имя);
		
	КонецЦикла;
	
	СтруктураПрошлыеПД = Новый Структура;
	Если Объект.ОткудаПРибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
		ЗапросПрошлыеПД = Новый Запрос;
		ЗАпросПрошлыеПД.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
		                        |	бит_ПаспортныеДанныеПроживающих.Период КАК Период,
		                        |	бит_ПаспортныеДанныеПроживающих.ФизЛицо КАК ФизЛицо,
		                        |	бит_ПаспортныеДанныеПроживающих.ДокументВид КАК ДокументВид,
		                        |	бит_ПаспортныеДанныеПроживающих.ДокументСерия КАК ДокументСерия,
		                        |	бит_ПаспортныеДанныеПроживающих.ДокументНомер КАК ДокументНомер,
		                        |	бит_ПаспортныеДанныеПроживающих.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		                        |	бит_ПаспортныеДанныеПроживающих.ДокументКемВыдан КАК ДокументКемВыдан,
		                        |	бит_ПаспортныеДанныеПроживающих.ДокументКодПодразделения КАК ДокументКодПодразделения,
		                        |	бит_ПаспортныеДанныеПроживающих.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
		                        |	бит_ПаспортныеДанныеПроживающих.ДокументПричинаЗамены КАК ДокументПричинаЗамены
		                        |ИЗ
		                        |	РегистрСведений.бит_ПаспортныеДанныеПроживающих КАК бит_ПаспортныеДанныеПроживающих
		                        |ГДЕ
		                        |	бит_ПаспортныеДанныеПроживающих.ФизЛицо = &ФизЛицо
		                        |
		                        |УПОРЯДОЧИТЬ ПО
		                        |	Период УБЫВ";
		ЗапросПрошлыеПД.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
		ЗапросПрошлыеПД.УстановитьПараметр("ФизЛицо",  Объект.РегистрируемоеЛицо);
		
		Выборка = ЗапросПрошлыеПД.Выполнить().Выбрать();
		Выборка.Следующий();//Пропускаем текущие паспортные данные
		Если Выборка.Следующий() Тогда
			   
			СтруктураПрошлыеПД.Вставить("Вид", Выборка.ДокументВид);
			СтруктураПрошлыеПД.Вставить("Серия", Выборка.ДокументСерия);
			СтруктураПрошлыеПД.Вставить("Номер", Выборка.ДокументНомер);
			СтруктураПрошлыеПД.Вставить("ДатаВыдачи", Выборка.ДокументДатаВыдачи);
			СтруктураПрошлыеПД.Вставить("КемВыдан", Выборка.ДокументКемВыдан);
			СтруктураПрошлыеПД.Вставить("КодПодразделения", Выборка.ДокументКодПодразделения);
			СтруктураПрошлыеПД.Вставить("ДатаРегистрацииПоМЖ", Выборка.ДатаРегистрацииПоМестуЖительства);
			СтруктураПрошлыеПД.Вставить("ПричинаЗамены", Выборка.ДокументПричинаЗамены);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если МакетНовогоОбразца Тогда
		Макет = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("АЛУ_New");
	Иначе
		Макет = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("АЛУ");
	КонецЕсли; 
	
	Источник = РезультатЗапроса[0];
	
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	// Перевод текста параметров к верхнему регистру.
	// И к типу "строка" всех данных, имеющих другие типы.
	ЗаполнитьЗначенияСвойств(ДанныеПечати, Источник);
	ДанныеПечати.ДанныеОПрибытии = Строка(Источник.ДанныеОПрибытии);
	ДанныеПечати.ДокументОснование         = ВРег(Строка(Источник.ДокументОснование));
	ДанныеПечати.ПринятоеРешение           = ВРег(Строка(Источник.ПринятоеРешение));
	ДанныеПечати.ОткудаПрибыл              = ВРег(Источник.ОткудаПрибыл);
	ДанныеПечати.УлицаРег                  = ВРег(Строка(Источник.УлицаРег));
	ДанныеПечати.ДомРег                    = ВРег(Строка(Источник.ДомРег));
	ДанныеПечати.КвартираРег               = ВРег(Строка(Источник.КвартираРег));
	ДанныеПечати.ПредставлениеКвартирыЛС   = Строка(Источник.ПредставлениеКвартирыЛС);
	ДанныеПечати.КорпусРег                 = ВРег(Строка(Источник.КорпусРег));
	ДанныеПечати.ПочтовыйАдрес             = ВРег(Источник.ПочтовыйАдрес);
	ДанныеПечати.МестоРождения             = Источник.МестоРождения;
	ДанныеПечати.Пол                       = Источник.Пол;
	
	Если ЗначениеЗаполнено(Источник.ВидДокумента) Тогда
		Если ЗначениеЗаполнено(Источник.ВидДокумента.КодПФР) Тогда
			ДанныеПечати.ВидДокумента 		   = ВРег(Строка(Источник.ВидДокумента.КодПФР)); 
		Иначе	
			ДанныеПечати.ВидДокумента              = ВРег(Строка(Источник.ВидДокумента));
		КонецЕсли;
	КонецЕсли;
	
	ДанныеПечати.СерияДокумента            = ВРег(Строка(Источник.СерияДокумента));
	ДанныеПечати.НомерДокумента            = ВРег(Строка(Источник.НомерДокумента));
	ДанныеПечати.ВыданДокумент             = ВРег(Строка(Источник.ВыданДокумент));
	ДанныеПечати.ДокументКодПодразделения  = ВРег(Строка(Источник.ДокументКодПодразделения));
	
	Если ЗначениеЗаполнено(Источник.ВидДокументаПред) Тогда
		Если ЗначениеЗаполнено(Источник.ВидДокументаПред.КодПФР) Тогда
			ДанныеПечати.ВидДокументаПред 		   = ВРег(Строка(Источник.ВидДокументаПред.КодПФР)); 
		Иначе	
			ДанныеПечати.ВидДокументаПред          = ВРег(Строка(Источник.ВидДокументаПред));
		КонецЕсли;
	КонецЕсли;
	
	ДанныеПечати.СерияДокументаПред        = ВРег(Строка(Источник.СерияДокументаПред));
	ДанныеПечати.НомерДокументаПред        = ВРег(Строка(Источник.НомерДокументаПред));
	ДанныеПечати.ВыданДокументПред         = ВРег(Строка(Источник.ВыданДокументПред));
	ДанныеПечати.Фамилия                   = ВРег(Источник.Фамилия);
	ДанныеПечати.Имя                       = ВРег(Источник.Имя);
	ДанныеПечати.Отчество                  = ВРег(Источник.Отчество);
	
	Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	бит_ФИОПроживающих.Период КАК Период,
		|	бит_ФИОПроживающих.ФизЛицо,
		|	бит_ФИОПроживающих.Фамилия,
		|	бит_ФИОПроживающих.Имя,
		|	бит_ФИОПроживающих.Отчество
		|ИЗ
		|	РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
		|ГДЕ
		|	бит_ФИОПроживающих.ФизЛицо = &ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("ФизЛицо", Объект.РегистрируемоеЛицо);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 1 Тогда
			
			ДанныеПечати.Фамилия  = ВРег(РезультатЗапроса[1].Фамилия);
			ДанныеПечати.Имя      = ВРег(РезультатЗапроса[1].Имя);
			ДанныеПечати.Отчество = ВРег(РезультатЗапроса[1].Отчество);
			
			ДанныеПечати.Вставить("ФамилияСмена" , ВРег(РезультатЗапроса[0].Фамилия));
			ДанныеПечати.Вставить("ИмяСмена"     , ВРег(РезультатЗапроса[0].Имя));
			ДанныеПечати.Вставить("ОтчествоСмена", ВРег(РезультатЗапроса[0].Отчество));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
		ЗапросДатаСнятияГрупповоеСнятие = Новый Запрос;
		ЗапросДатаСнятияГрупповоеСнятие.Текст = "ВЫБРАТЬ
	                            |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий КАК Проживающий,
	                            |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации
	                            |ИЗ
	                            |	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.СнимаемыеСРегУчета КАК бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета
	                            |ГДЕ
	                            |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий = &РегЛицо";
		ЗапросДатаСнятияГрупповоеСнятие.УстановитьПараметр("РегЛицо", Объект.РегистрируемоеЛицо);
	
		ВыборкаДатаРегистрации = ЗапросДатаСнятияГрупповоеСнятие.Выполнить().Выбрать();
	
		Если ВыборкаДатаРегистрации.Следующий() Тогда
			ДанныеПечати.ДатаРегистрации = ВыборкаДатаРегистрации.ДатаРегистрации;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросДатаСнятияГрупповоеСнятие = Новый Запрос;
	ЗапросДатаСнятияГрупповоеСнятие.Текст = "ВЫБРАТЬ
	                            |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий КАК Проживающий,
	                            |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации
	                            |ИЗ
	                            |	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.СнимаемыеСРегУчета КАК бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета
	                            |ГДЕ
	                            |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий = &РегЛицо";
	ЗапросДатаСнятияГрупповоеСнятие.УстановитьПараметр("РегЛицо", Объект.РегистрируемоеЛицо);
	
	ВыборкаДатаРегистрации = ЗапросДатаСнятияГрупповоеСнятие.Выполнить().Выбрать();
	
	Если ВыборкаДатаРегистрации.Следующий() Тогда
		ДатаРегистрации = ВыборкаДатаРегистрации.ДатаРегистрации;
	КонецЕсли;

	
	
	ВыданДокумент_1 = "";
	ВыданДокумент_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ДанныеПечати.ВыданДокумент, 42, ВыданДокумент_1 , ВыданДокумент_2 );
	ДанныеПечати.Вставить("ВыданДокумент_1", ВРЕГ(ВыданДокумент_1));
	ДанныеПечати.Вставить("ВыданДокумент_2", ВРЕГ(ВыданДокумент_2));
	
	СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(ДанныеПечати.МестоРождения);
	
	
	ДанныеПечати.Вставить("СтранаРожд"         , СтруктураМестоРождения.Страна); 
	ДанныеПечати.Вставить("РегионРожд"         , СтруктураМестоРождения.Область); 
	ДанныеПечати.Вставить("ГородРожд"          , СтруктураМестоРождения.НаселенныйПункт);
	ДанныеПечати.Вставить("РайонРожд"          , СтруктураМестоРождения.Район);
	ДанныеПечати.Вставить("НаселенныйПунктРожд", СтруктураМестоРождения.Село);
	
	Если ЗначениеЗаполнено(ДанныеПечати.Пол) Тогда
		
		Если ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		ИначеЕсли ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		КонецЕсли; 
		
	КонецЕсли; 
	
	ПаспортнаяСлужба_1 = ""; 
	ПаспортнаяСлужба_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Строка(ДанныеПечати.ОрганФМСВыбытия), 40, ПаспортнаяСлужба_1 , ПаспортнаяСлужба_2 );
	ДанныеПечати.Вставить("ПаспортнаяСлужба_1", ВРЕГ(ПаспортнаяСлужба_1));
	ДанныеПечати.Вставить("ПаспортнаяСлужба_2", ВРЕГ(ПаспортнаяСлужба_2));
	
	ШапкаОбласть.Параметры.Заполнить(ДанныеПечати); 
	
	Если Не ЗначениеЗаполнено(ДанныеПечати.Фамилия) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните поле ФИО в справочнике ""Проживающие""");
		
	КонецЕсли; 
	
	// Дата Выдачи документа.
	Если ЗначениеЗаполнено(ДанныеПечати.ДатаВыдачиДокумента) Тогда
		
		Если МакетНовогоОбразца Тогда
			ШапкаОбласть.Параметры.ДеньВыдачиДокумента  = Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДФ='дд'");
			ДатаМесяц									= Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодВыдачиДокумента   = Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДФ='yyyy'");
		Иначе
			ШапкаОбласть.Параметры.ДатаВыдачиДокумента  = Формат(ДанныеПечати.ДатаВыдачиДокумента,"ДФ=dd.MM.yy");
		КонецЕсли; 
		
	КонецЕсли;
	
	// Пункт 10 не заполняется при смене паспорта.
	Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаПаспорта Тогда
		
		ШапкаОбласть.Параметры.ВидДокумента             = "";
		ШапкаОбласть.Параметры.НомерДокумента           = "";
		ШапкаОбласть.Параметры.ДеньВыдачиДокумента      = "";
		ШапкаОбласть.Параметры.МесяцВыдачиДокумента     = "";
		ШапкаОбласть.Параметры.ГодВыдачиДокумента       = "";
		ШапкаОбласть.Параметры.СерияДокумента           = "";
		ШапкаОбласть.Параметры.ВыданДокумент_1          = "";
		ШапкаОбласть.Параметры.ВыданДокумент_2          = "";
		ШапкаОбласть.Параметры.ДокументКодПодразделения = "";
		
	ИначеЕсли Объект.ОткудаПРибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
		
		Если ЗначениеЗаполнено(СтруктураПрошлыеПД) Тогда
			ШапкаОбласть.Параметры.ВидДокумента = СтруктураПрошлыеПД.Вид;
			ШапкаОбласть.Параметры.НомерДокумента = СТруктураПрошлыеПД.Номер;
			
			ДатаВыдачи = СтруктураПрошлыеПД.ДатаВыдачи;
			
			ШАпкаОбласть.Параметры.ДеньВыдачиДокумента = Формат(ДатаВыдачи,"ДФ=dd" );
			ДатаМесяц =  Формат(ДатаВыдачи, "ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента =  Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОБласть.Параметры.ГодВыдачиДОкумента =    Формат(ДатаВыдачи,"ДФ=yyyy" );
			
			ШапкаОбласть.Параметры.СерияДОкумента =   СтруктураПрошлыеПД.Серия;
			
			ВыданДокумент_1 = "";
			ВыданДокумент_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Строка(СтруктураПрошлыеПД.КемВыдан), 40, ВыданДокумент_1 , ВыданДокумент_2 );
			ШапкаОБласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
			ШАпкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2; 
			
			ШапкаОбласть.Параметры.ДокументКодПодразделения = СтруктураПрошлыеПД.КодПодразделения;
		Иначе
			
			ШапкаОбласть.Параметры.ВидДокумента             = "";
			ШапкаОбласть.Параметры.НомерДокумента           = "";
			ШапкаОбласть.Параметры.ДеньВыдачиДокумента      = "";
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента     = "";
			ШапкаОбласть.Параметры.ГодВыдачиДокумента       = "";
			ШапкаОбласть.Параметры.СерияДокумента           = "";
			ШапкаОбласть.Параметры.ВыданДокумент_1          = "";
			ШапкаОбласть.Параметры.ВыданДокумент_2          = "";
			ШапкаОбласть.Параметры.ДокументКодПодразделения = "";

		КонецЕсли;
		
		
	КонецЕсли; 
	
	// Пункт 8 Заполняется из почтового адреса здания лицевого счета + квартира ЛС. АЛУ_New.
	СтруктураОткудаПрибыл = ПолучитьМуниципальныйАдресБСП(Объект.ЛицевойСчет);

	Если НЕ ДанныеПечати.ОткудаПрибылИзЛС И НЕ ЗначениеЗаполнено(СтруктураОткудаПрибыл.Улица)Тогда
		
		ШапкаОбласть.Параметры.УлицаРег =  ДанныеПечати.УлицаРег;
		ШапкаОбласть.Параметры.ДомРег =  ПолучитьНомерДома(ДанныеПечати.ДомРег);
		ШапкаОбласть.Параметры.КорпусРег =  ПолучитьНомерКорпуса(ДанныеПечати.ДомРег);
		ШапкаОбласть.Параметры.КвартираРег =  ДанныеПечати.ПредставлениеКвартирыЛС;
		
	Иначе
		
		ШапкаОбласть.Параметры.УлицаРег = СтруктураОткудаПрибыл.Улица;
		ШапкаОбласть.Параметры.ДомРег = СтруктураОткудаПрибыл.Дом;
		ШапкаОбласть.Параметры.КорпусРег = СтруктураОткудаПрибыл.Корпус;
		ШапкаОБласть.Параметры.КвартираРег = СтруктураОткудаПрибыл.Квартира;
		
	КонецЕсли;

	// Пунк 11 заполняет из адреса в документе,
	// При вводе на соновании документа "Регистрация проживающих адрес пойдет в историю. АЛУ_New.	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеВСвязиСоСмертью Тогда
		
		Если ЗначениеЗаполнено(ДанныеПечати.УМРДатаСоставления) Тогда
			ШапкаОбласть.Параметры.СтранаВыб = "Выписан по смерти " + Формат(ДанныеПечати.УМРДатаСмерти,"ДФ='дд ММММ гггг'; ДП='Не указано'");
			ШапкаОбласть.Параметры.РегионВыб = "Свидетельство серия " + Прав(ДанныеПечати.УМРСерия, 5)  + " № " +  Прав(ДанныеПечати.УМРНомерСвидетельства, 6);
			ШапкаОбласть.Параметры.РайонВыб  = "а/з №" + ДанныеПечати.УМРНомер + ", от " 
			+ Формат(ДанныеПечати.УМРДатаСоставления,"ДФ='дд ММММ гггг'; ДП='Не указано'");
			ШапкаОбласть.Параметры.ГородВыб = "Выдано " + ДанныеПечати.УМРКемВыдано + " " + Формат(ДанныеПечати.УМРДатаВыдачи, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	Иначе
		
		//П11
		Улица = Неопределено;
		Если ЗначениеЗаполнено(ДанныеПечати.КудаВыписанАдрес) Тогда
			
			СтруктураКудаВыбыл = ПолучитьМуниципальныйАдресБСП(ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].Значение);	
			Улица = СтруктураКудаВыбыл.Улица;
			
		КонецЕсли;
		
		Если НЕ Источник.КудаВыписанИЗЛС И ЗначениеЗаполнено(Улица)Тогда
				СтруктураКудаВыбыл.Квартира = Источник.ПредставлениеКвартирыЛС;	
		КонецЕсли;

		Если ЗначениеЗаполнено(ДанныеПечати.РешениеСуда) Тогда
			
			ШапкаОбласть.Параметры.СтранаВыб = "" + ДанныеПечати.РешениеСуда;
			ШапкаОбласть.Параметры.РегионВыб = "Дело № " + ДанныеПечати.РешениеСудаНомер + " от " + Формат(ДанныеПечати.РешениеСудаДатаРешения,"ДФ=dd.MM.yyyy" );
			ШапкаОбласть.Параметры.РайонВыб =  "Выдано "  + ДанныеПечати.РешениеСудаКемВыдано;
			ШапкаОбласть.Параметры.ГородВыб =  "Дата вступления в законную силу: " + Формат(ДанныеПечати.РешениеСудаДатаВступленияВЗаконнуюСилу, "ДФ=dd.MM.yyyy");
			
		ИначеЕсли НЕ СтруктураКудаВыбыл = Неопределено Тогда
			
			ШапкаОбласть.Параметры.СтранаВыб          = СтруктураКудаВыбыл.Страна;
			ШапкаОбласть.Параметры.РегионВыб          = СтруктураКудаВыбыл.Регион;
			ШапкаОбласть.Параметры.РайонВыб           = СтруктураКудаВыбыл.Район;
			ШапкаОбласть.Параметры.ГородВыб           = СтруктураКудаВыбыл.Город;
			ШапкаОбласть.Параметры.НаселенныйПунктВыб = СтруктураКудаВыбыл.НаселенныйПункт;
			ШапкаОбласть.Параметры.УлицаВыб           = СтруктураКудаВыбыл.Улица;	
			ШапкаОбласть.Параметры.ДомВыб             = СтруктураКудаВыбыл.Дом;	
			ШапкаОбласть.Параметры.КорпусВыб          = СтруктураКудаВыбыл.Корпус;
			ШапкаОбласть.Параметры.КвартираВыб        = СтруктураКудаВыбыл.Квартира;
			
		КонецЕсли;
		
				
		
	КонецЕсли;
	
	// Пункт 13 заполняется как пункт 8. АЛУ_New.
	Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.ВТомЖеГородеСДругогоАдреса Тогда
		
		ШапкаОбласть.Параметры.УлицаВыбТГ    = ВРег(ДанныеПечати.УлицаРег);
		ШапкаОбласть.Параметры.ДомВыбТГ      = ВРег(ДанныеПечати.ДомРег);
		ШапкаОбласть.Параметры.КорпусВыбТГ   = ВРег(ДанныеПечати.КорпусРег);
		ШапкаОбласть.Параметры.КвартираВыбТГ = ВРег(ДанныеПечати.КвартираРег);
		
	КонецЕсли;
	
	// Дата Рождения.
	Если ЗначениеЗаполнено(ДанныеПечати.ДатаРождения) Тогда
		Если МакетНовогоОбразца Тогда
			ШапкаОбласть.Параметры.ДеньРождения  = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд'");
			ДатаМесяц 							 = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРождения = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРождения   = Формат(ДанныеПечати.ДатаРождения,"ДФ='yyyy'");
		Иначе
			ШапкаОбласть.Параметры.ДатаРождения     = Формат(ДанныеПечати.ДатаРождения,"ДЛФ=DD");
		КонецЕсли; 
	КонецЕсли;
	
	// Дата Регистрации. 
	ДатаРегистрации = ДанныеПечати.ДатаРегистрации;
	
	Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
		ШапкаОбласть.Параметры.ДеньРегистрации = Формат(ДатаРегистрации, "ДФ=dd");
		ДатаМесяц							   = Формат(ДатаРегистрации, "ДФ=дд.ММММ");
		ШапкаОбласть.Параметры.МесяцРегистрации = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодРегистрации = Формат(ДатаРегистрации, "ДФ=yyyy");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ПериодРегистрацииПоПрежнемуАдресуС) И Не ЗначениеЗаполнено(Объект.ПериодРегистрацииПоПрежнемуАдресуПо) Тогда
		ШапкаОбласть.Параметры.ДеньРегистрации  = Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд'");
		ДатаМесяц				 				= Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцРегистрации = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодРегистрации   = Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='yyyy'");
	КонецЕсли;

	
	// ДатаСоставления. 
	Если МакетНовогоОбразца  Тогда
		ШапкаОбласть.Параметры.ДеньСоставил  = Формат(ДанныеПечати.Дата,"ДФ='дд'");
		ДатаМесяц							 = Формат(ДанныеПечати.Дата,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцСоставил = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодСоставил   = Формат(ДанныеПечати.Дата,"ДФ='yyyy'");
		
		ШапкаОбласть.Параметры.ДанныеОПрибытии0 = ДанныеПечати.ДанныеОПрибытии;
		Если ЗначениеЗаполнено(ДанныеПечати.ДатаСнятияСРегистрации) Тогда
			
			ШапкаОбласть.Параметры.ДеньОформил = Формат(ДанныеПечати.ДатаСнятияСРегистрации,"ДФ='дд'");
			ДатаМесяц =       Формат(ДанныеПечати.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцОформил = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодОформил =  Формат(ДанныеПечати.ДатаСнятияСРегистрации,"ДФ='yyyy'");
			
	КонецЕсли;
		
	Иначе
		ШапкаОбласть.Параметры.ДатаСоставления  = Формат(ДанныеПечати.Дата,"ДЛФ=DD");
	КонецЕсли; 
	
	//П8 
	//СтруктураОткудаПрибыл = ПолучитьСтруктуруАдресаПоЗначению( ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1].Значение);
	СтруктураОткудаПрибыл = ПолучитьМуниципальныйАдресБСП(ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1].Значение);
	
	Если НЕ Источник.ОткудаПрибылИЗЛС И ЗначениеЗаполнено(СтруктураОткудаПрибыл.Улица) Тогда
		 СтруктураОткудаПрибыл.Квартира = Источник.ПредставлениеКвартирыЛС;
	КонецЕсли;
	
	Если НЕ СтруктураОткудаПрибыл = Неопределено Тогда
		
		ШапкаОбласть.Параметры.РегионРег		  =   СтруктураОткудаПрибыл.Регион;
		ШапкаОбласть.Параметры.ГородРег			  =   СтруктураОткудаПрибыл.Город;
		ШапкаОбласть.Параметры.РайонРег 		  =   СтруктураОткудаПрибыл.Район;	
		ШапкаОбласть.Параметры.НаселенныйПунктРег =  СтруктураОткудаПрибыл.НаселенныйПункт;				
		ШАпкаОбласть.Параметры.УлицаРег 	      =    СтруктураОткудаПрибыл.Улица;
		ШапкаОбласть.Параметры.ДомРег 			  = 	 СтруктураОткудаПрибыл.Дом;
		ШапкаОБласть.Параметры.Корпусрег 		  = 	 СтруктураОткудаПрибыл.Корпус;
		ШапкаОбласть.Параметры.КвартираРег	      = СтруктураОткудаПрибыл.Квартира;
		
	КонецЕсли;
	
	// Смена фамилии.
	Если Объект.ОткудаПрибыл = Перечисления.бит_ВариантыИзмененияМестаПребывания.СменаФамилии Тогда
		
		Если МакетНовогоОбразца Тогда
			
			ШапкаОбласть.Параметры.ФамилияСмена       = ДанныеПечати.ФамилияСмена;
			ШапкаОбласть.Параметры.ИмяСмена           = ДанныеПечати.ИмяСмена;
			ШапкаОбласть.Параметры.ОтчествоСмена      = ДанныеПечати.ОтчествоСмена;
			ШапкаОбласть.Параметры.ДеньРожденияСмена  = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд'");
			ДатаМесяц							 	  = Формат(ДанныеПечати.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРожденияСмена = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРожденияСмена   = Формат(ДанныеПечати.ДатаРождения,"ДФ='yyyy'");
			
			ШапкаОбласть.Параметры.РегионВыб          = ШапкаОбласть.Параметры.РегионРег;
			ШапкаОбласть.Параметры.РайонВыб           = ШапкаОбласть.Параметры.РайонРег;
			ШапкаОбласть.Параметры.ГородВыб           = ШапкаОбласть.Параметры.ГородРег;
			ШапкаОбласть.Параметры.НаселенныйПунктВыб = ШапкаОбласть.Параметры.НаселенныйПунктРег;
			ШапкаОбласть.Параметры.УлицаВыб           = ШапкаОбласть.Параметры.УлицаРег;	
			ШапкаОбласть.Параметры.ДомВыб             = ШапкаОбласть.Параметры.ДомРег;	
			ШапкаОбласть.Параметры.КорпусВыб          = ШапкаОбласть.Параметры.КорпусРег;
			ШапкаОбласть.Параметры.КвартираВыб        = ШапкаОбласть.Параметры.КвартираРег;
			
	
		КонецЕсли;
		
		Если МакетНовогоОбразца И ЗначениеЗаполнено(ДанныеПечати.Пол) Тогда
			
			Если ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				ШапкаОбласть.Область("ПолМуж1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			ИначеЕсли ДанныеПечати.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				ШапкаОбласть.Область("ПолЖен1").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если МакетНовогоОбразца Тогда
		
		ШапкаОбласть.Параметры.Гражданство = ДанныеПечати.Гражданство;
		
		ЗачеркнутыйШрифт = Новый Шрифт("Times New Roman" ,7 , Ложь, Ложь, Ложь, Истина,  );
		
		Если ДанныеПечати.ВременнаяРегистрация Тогда
			ШапкаОбласть.Область("ЖительстваС").Шрифт = ЗачеркнутыйШрифт;
		Иначе
			ШапкаОбласть.Область("ПребыванияДо").Шрифт = ЗачеркнутыйШрифт;
		КонецЕсли;
		
		//Дата Снятия С Регистрации	
		ДатаСнятияСРегистрации = ДанныеПечати.ПериодРегистрацииПоПрежнемуАдресуПо; 	
		Если ЗначениеЗаполнено(ДатаСнятияСРегистрации) Тогда	
			ШапкаОбласть.Параметры.ДатаСнятияСРегистрации = "по " + Формат(ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy" );	  
		Иначе
			ШапкаОбласть.Параметры.ДатаСнятияСРегистрации  = "по " + Формат(ДанныеПечати.ДатаСнятияСРегистрации , "ДФ=dd.MM.yyyy");
		КонецЕсли;
	

		ШапкаОбласть.Параметры.Ответственный = ПолучитьИнициалы(ДанныеПечати.ОтветственныйПользователь);
		ШапкаОбласть.Параметры.КодПаспортнойСлужбы = ДанныеПечати.ОрганФМСКодПодразделения;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	//Запрос и выборка для множественной печати	
	Если СнятиеСРегистрации(Объект.ВидОперации) И Объект.СнимаемыеСРегУчета.Количество() > 1 Тогда
		ЗапросСН = Новый Запрос;
		ЗапросСН.Текст = "ВЫБРАТЬ
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий КАК Проживающий,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.МестоРождения КАК ПроживающийМестоРождения,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.ДатаРождения КАК ПроживающийДатаРождения,
		                 |	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Страна,
		                 |	МАКСИМУМ(бит_ГражданствоПроживающихСрезПоследних.Период) КАК Период,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации КАК ДатаРегистрации1,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.СтраховойНомерПФР КАК ПроживающийСтраховойНомерПФР,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ВременнаяРегистрация КАК ВременнаяРегистрация,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.Ответственный КАК Ответственный,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОткудаПрибылИзЛС КАК ОткудаПрибылИзЛС,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.КудаВыписанИзЛС КАК КудаВыписанИзЛС,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ЛицевойСчет.Квартира КАК КвартираРег
		                 |ПОМЕСТИТЬ ВТ_Гражданство
		                 |ИЗ
		                 |	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.СнимаемыеСРегУчета КАК бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
		                 |		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
		                 |ГДЕ
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка = &Ссылка
		                 |	И НЕ бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий = бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.РегистрируемоеЛицо
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.МестоРождения,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.ДатаРождения,
		                 |	бит_ГражданствоПроживающихСрезПоследних.Страна,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Проживающий.СтраховойНомерПФР,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ВременнаяРегистрация,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.Ответственный,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ДатаСнятияСРегистрации,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ОткудаПрибылИзЛС,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.КудаВыписанИзЛС,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.Ссылка.ЛицевойСчет.Квартира,
		                 |	бит_ЗаявлениеОРегистрацииПоМестуПЖСнимаемыеСРегУчета.ДатаРегистрации
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100)) КАК ДокументКемВыдан,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
		                 |	МАКСИМУМ(бит_ПаспортныеДанныеПроживающихСрезПоследних.Период) КАК Период
		                 |ПОМЕСТИТЬ ВТ_Документы
		                 |ИЗ
		                 |	ВТ_Гражданство КАК ВТ_Гражданство
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
		                 |		ПО ВТ_Гражданство.Проживающий = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ВТ_Гражданство.Проживающий,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100))
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
		                 |	бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
		                 |	бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
		                 |	бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
		                 |	МАКСИМУМ(бит_ФИОПроживающихСрезПоследних.Период) КАК Период
		                 |ПОМЕСТИТЬ ВТ_ФИО
		                 |ИЗ
		                 |	ВТ_Гражданство КАК ВТ_Гражданство
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
		                 |		ПО ВТ_Гражданство.Проживающий = бит_ФИОПроживающихСрезПоследних.ФизЛицо
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ВТ_Гражданство.Проживающий,
		                 |	бит_ФИОПроживающихСрезПоследних.Фамилия,
		                 |	бит_ФИОПроживающихСрезПоследних.Имя,
		                 |	бит_ФИОПроживающихСрезПоследних.Отчество
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	бит_ПроживающиеКонтактнаяИнформация.Представление КАК ОткудаПрибыл,
		                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
		                 |	бит_ПроживающиеКонтактнаяИнформация.Значение КАК ОткудаПрибылЗначение
		                 |ПОМЕСТИТЬ ВТ_ОткудаПрибыл
		                 |ИЗ
		                 |	ВТ_Гражданство КАК ВТ_Гражданство
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
		                 |		ПО ВТ_Гражданство.Проживающий = бит_ПроживающиеКонтактнаяИнформация.Ссылка
		                 |ГДЕ
		                 |	бит_ПроживающиеКонтактнаяИнформация.Вид = &ВидОткудаПрибыл
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	бит_ПроживающиеКонтактнаяИнформация.Представление КАК КудаУбыл,
		                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
		                 |	бит_ПроживающиеКонтактнаяИнформация.Значение КАК КудаУбылЗначение
		                 |ПОМЕСТИТЬ ВТ_КудаУбыл
		                 |ИЗ
		                 |	ВТ_Гражданство КАК ВТ_Гражданство
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
		                 |		ПО ВТ_Гражданство.Проживающий = бит_ПроживающиеКонтактнаяИнформация.Ссылка
		                 |ГДЕ
		                 |	бит_ПроживающиеКонтактнаяИнформация.Вид = &ВидКудаУбыл
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	бит_Проживающиебит_ЗаконныеПредставители.Проживающий КАК ЗаконныйПредставитель,
		                 |	бит_Проживающиебит_ЗаконныеПредставители.Ссылка КАК Проживающий,
		                 |	бит_Проживающиебит_ЗаконныеПредставители.СтепеньРодства КАК СтепеньРодства,
		                 |	бит_Проживающиебит_ЗаконныеПредставители.ДокументОснование КАК ДокументОснование,
		                 |	бит_Проживающиебит_ЗаконныеПредставители.НомерСтроки КАК НомерСтроки
		                 |ПОМЕСТИТЬ ВТ_ЗаконныйПредставитель
		                 |ИЗ
		                 |	ВТ_Гражданство КАК ВТ_Гражданство
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Проживающие.бит_ЗаконныеПредставители КАК бит_Проживающиебит_ЗаконныеПредставители
		                 |		ПО ВТ_Гражданство.Проживающий = бит_Проживающиебит_ЗаконныеПредставители.Ссылка
		                 |ГДЕ
		                 |	бит_Проживающиебит_ЗаконныеПредставители.НомерСтроки = 1
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ЗПДВид,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ЗПДСерия,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ЗПДНомер,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ЗПДДатаВыдачи,
		                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100)) КАК ЗПДКемВыдан,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ЗПДКодПодразделения,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ЗПДДатаРегистрацииПоМЖ,
		                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументПричинаЗамены КАК СТРОКА(100)) КАК ЗПДПричинаЗамены,
		                 |	МАКСИМУМ(бит_ПаспортныеДанныеПроживающихСрезПоследних.Период) КАК Период,
		                 |	ВТ_ЗаконныйПредставитель.Проживающий КАК Проживающий
		                 |ПОМЕСТИТЬ ВТ_ПДЗП
		                 |ИЗ
		                 |	ВТ_ЗаконныйПредставитель КАК ВТ_ЗаконныйПредставитель
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
		                 |		ПО ВТ_ЗаконныйПредставитель.ЗаконныйПредставитель = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
		                 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК СТРОКА(100)),
		                 |	ВЫРАЗИТЬ(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументПричинаЗамены КАК СТРОКА(100)),
		                 |	ВТ_ЗаконныйПредставитель.Проживающий
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ВТ_Гражданство.Проживающий КАК Проживающий,
		                 |	ВТ_ФИО.Фамилия КАК Фамилия,
		                 |	ВТ_ФИО.Имя КАК Имя,
		                 |	ВТ_ФИО.Отчество КАК Отчество,
		                 |	ВТ_Документы.ДокументВид КАК ВидДокумента,
		                 |	ВТ_Документы.ДокументСерия КАК СерияДокумента,
		                 |	ВТ_Документы.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
		                 |	ВТ_Документы.ДокументКемВыдан КАК ВыданДокумент,
		                 |	ВТ_Документы.ДокументКодПодразделения КАК ДокументКодПодразделения,
		                 |	ВТ_Документы.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
		                 |	ВТ_Гражданство.ДатаРегистрации КАК ДатаРегистрации,
		                 |	ВТ_Гражданство.ПроживающийМестоРождения КАК ПроживающийМестоРождения,
		                 |	ВТ_Гражданство.ПроживающийДатаРождения КАК ПроживающийДатаРождения,
		                 |	ВТ_Гражданство.Страна КАК Гражданство,
		                 |	ВТ_Гражданство.Проживающий.Пол КАК ПроживающийПол,
		                 |	ВТ_Документы.ДокументНомер КАК НомерДокумента,
		                 |	ВТ_ОткудаПрибыл.ОткудаПрибыл КАК ОткудаПрибыл,
		                 |	ВТ_КудаУбыл.КудаУбыл КАК КудаВыбыл,
		                 |	ВТ_Гражданство.ПроживающийСтраховойНомерПФР КАК ПроживающийСтраховойНомерПФР,
		                 |	ВТ_Гражданство.ВременнаяРегистрация КАК ВременнаяРегистрация,
		                 |	ВТ_Гражданство.Ответственный КАК Ответственный,
		                 |	ВТ_ПДЗП.ЗПДВид КАК ЗПДВид,
		                 |	ВТ_ПДЗП.ЗПДСерия КАК ЗПДСерия,
		                 |	ВТ_ПДЗП.ЗПДНомер КАК ЗПДНомер,
		                 |	ВТ_ПДЗП.ЗПДДатаВыдачи КАК ЗПДДатаВыдачи,
		                 |	ВТ_ПДЗП.ЗПДКемВыдан КАК ЗПДВыдан,
		                 |	ВТ_ПДЗП.ЗПДКодПодразделения КАК ЗПДКодПодразделения,
		                 |	ВТ_ПДЗП.ЗПДДатаРегистрацииПоМЖ КАК ЗПДДатаРегистрацииПоМЖ,
		                 |	ВТ_ПДЗП.ЗПДПричинаЗамены КАК ЗПДПричинаЗамены,
		                 |	ВТ_Гражданство.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
		                 |	ВТ_ОткудаПрибыл.Проживающий КАК Проживающий1,
		                 |	ВТ_Гражданство.ОткудаПрибылИзЛС КАК ОткудаПрибылИзЛС,
		                 |	ВТ_Гражданство.КудаВыписанИзЛС КАК КудаВыписанИзЛС,
		                 |	ВТ_Гражданство.КвартираРег КАК КвартираРег,
		                 |	ВТ_ЗаконныйПредставитель.ЗаконныйПредставитель КАК ЗаконныйПредставитель,
		                 |	ВТ_ЗаконныйПредставитель.СтепеньРодства КАК СтепеньРодстваЗаконногоПредставителя,
		                 |	ВТ_ОткудаПрибыл.ОткудаПрибылЗначение КАК ОткудаПрибылЗначение,
		                 |	ВТ_КудаУбыл.КудаУбылЗначение КАК КудаУбылЗначение
		                 |ИЗ
		                 |	ВТ_Гражданство КАК ВТ_Гражданство
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
		                 |		ПО ВТ_Гражданство.Проживающий = ВТ_Документы.Проживающий
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИО КАК ВТ_ФИО
		                 |		ПО (ВТ_ФИО.Проживающий = ВТ_Документы.Проживающий)
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОткудаПрибыл КАК ВТ_ОткудаПрибыл
		                 |		ПО ВТ_Гражданство.Проживающий = ВТ_ОткудаПрибыл.Проживающий
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КудаУбыл КАК ВТ_КудаУбыл
		                 |		ПО ВТ_Гражданство.Проживающий = ВТ_КудаУбыл.Проживающий
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаконныйПредставитель КАК ВТ_ЗаконныйПредставитель
		                 |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПДЗП КАК ВТ_ПДЗП
		                 |			ПО ВТ_ЗаконныйПредставитель.ЗаконныйПредставитель = ВТ_ПДЗП.Проживающий
		                 |		ПО ВТ_Гражданство.Проживающий = ВТ_ЗаконныйПредставитель.Проживающий";
		ЗапросСН.УстановитьПараметр("Ссылка", Объект.Ссылка);
		ЗапросСН.УстановитьПараметр("Момент", Объект.Дата);
		ЗапросСН.УстановитьПараметр("ВидОткудаПрибыл", Справочники.ВидыКонтактнойИнформации.АдресПрибытия);
		ЗапросСН.УстановитьПараметр("ВидКудаУбыл", Справочники.ВидыКонтактнойИнформации.АдресУбытия);
		
		ВыборкаСН = ЗапросСН.Выполнить().Выбрать();
		//-ЗапросИВыборкаДляМножественнойПечати	
		
		Пока ВыборкаСН.Следующий() И МакетНовогоОбразца Цикл
			
			ШапкаОбласть.Параметры.Имя 					="";
			ШапкаОбласть.Параметры.Фамилия  			="";
			ШапкаОбласть.Параметры.Отчество 			="";
			
			ШапкаОбласть.Параметры.ДеньРождения  		="";
			ШапкаОбласть.Параметры.МесяцРождения 		="";
			ШапкаОбласть.Параметры.ГодРождения   		="";
			
			ШапкаОбласть.Параметры.СтранаРожд 			="";
			ШапкаОбласть.Параметры.РегионРожд 			="";
			ШапкаОбласть.Параметры.РайонРожд 			="";
			ШапкаОбласть.Параметры.ГородРожд 			="";
			ШапкаОбласть.Параметры.НаселенныйПунктРожд	="";
			
			ШапкаОбласть.Параметры.Гражданство 		  	="";
			
			Если Объект.ОткудаПрибылИзЛС Тогда
				ШапкаОбласть.Параметры.РегионРег		  	="";
				ШапкаОбласть.Параметры.ГородРег			  	="";
				ШапкаОбласть.Параметры.РайонРег 		  	="";
				ШапкаОбласть.Параметры.НаселенныйПунктРег 	="";
				ШапкаОбласть.Параметры.УлицаРег = "";
				ШапкаОбласть.Параметры.ДомРег = "";
				ШапкаОбласть.Параметры.КвартираРег = "";
				ШапкаОбласть.Параметры.КорпусРег  = "";
			КонецЕсли;		
			
			Если Объект.КудаВыписанИзЛС Тогда
				
				ШапкаОбласть.Параметры.РегионВыб =         "";
				ШапкаОбласть.Параметры.ГородВыб =          "";
				ШапкаОбласть.Параметры.РайонВыб =          "";
				ШапкаОбласть.Параметры.НаселенныйПунктВыб ="";
				ШапкаОбласть.Параметры.СтранаВыб =  	   "";
				ШапкаОбласть.Параметры.УлицаВыб =   	   "";
				ШапкаОбласть.Параметры.ДомВыб =   		   "";
				ШапкаОбласть.Параметры.КорпусВыб =		   ""; 
				ШапкаОбласть.Параметры.КвартираВыб = 	   "";
				
			КонецЕсли;
			
			ШапкаОбласть.Параметры.ДеньВыдачиДокумента  = "";
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента = "";
			ШапкаОбласть.Параметры.ГодВыдачиДокумента   = "";					
			ШапкаОбласть.Параметры.ВидДокумента =  "";
			ШапкаОбласть.Параметры.СерияДокумента =   "";
			ШапкаОбласть.Параметры.НомерДокумента = 	"";						
			ШапкаОбласть.Параметры.ВыданДокумент_1 =  "";
			ШапкаОбласть.Параметры.ВыданДокумент_2 =  "";	
			ШапкаОбласть.Параметры.ДокументКодПодразделения =   "";
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ШапкаОбласть.Параметры.Имя =   ВРЕГ(ВыборкаСН.Имя);
			ШапкаОбласть.Параметры.Фамилия = ВРег(ВыборкаСН.Фамилия);
			ШапкаОбласть.Параметры.Отчество =  ВРег(ВыборкаСН.Отчество);
			
			ШапкаОбласть.Параметры.ДеньРождения  = Формат(ВыборкаСН.ПроживающийДатаРождения,"ДФ='дд'");
			ДатаМесяц 							 = Формат(ВыборкаСН.ПроживающийДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцРождения = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодРождения   = Формат(ВыборкаСН.ПроживающийДатаРождения,"ДФ='yyyy'");
			
			СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(ВыборкаСН.ПроживающийМестоРождения);
			
			Если ЗначениеЗаполнено(СтруктураМестоРождения) Тогда
				
				ШапкаОбласть.Параметры.СтранаРожд = СтруктураМестоРождения.Страна; 
				
				ШапкаОбласть.Параметры.РегионРожд =  СтруктураМестоРождения.Область;	
				
				ШапкаОбласть.Параметры.РайонРожд =  СтруктураМестоРождения.Район;
				
				ШапкаОбласть.Параметры.ГородРожд =   СтруктураМестоРождения.НаселенныйПункт;
				
				ШапкаОбласть.Параметры.НаселенныйПунктРожд =  СтруктураМестоРождения.Село;
				
			КонецЕсли;
			
			ШапкаОбласть.Параметры.Гражданство = ВыборкаСН.Гражданство;
			
			Если ЗначениеЗаполнено(ВыборкаСН.ДатаРегистрации) Тогда
				ШапкаОбласть.Параметры.ДеньРегистрации  = Формат(ВыборкаСН.ДатаРегистрации,"ДФ='дд'");
				ДатаМесяц 							    = Формат(ВыборкаСН.ДатаРегистрации,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцРегистрации = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодРегистрации   = Формат(ВыборкаСН.ДатаРегистрации,"ДФ='yyyy'");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ПериодРегистрацииПоПрежнемуАдресуС) И Не ЗначениеЗаполнено(Объект.ПериодРегистрацииПоПрежнемуАдресуПо) Тогда
				ШапкаОбласть.Параметры.ДеньРегистрации  = Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд'");
				ДатаМесяц				 				= Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='дд.MMMM'");
				ШапкаОбласть.Параметры.МесяцРегистрации = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
				ШапкаОбласть.Параметры.ГодРегистрации   = Формат(Объект.ПериодРегистрацииПоПрежнемуАдресуС,"ДФ='yyyy'");
			КонецЕсли;

			
			Если ЗначениеЗаполнено(ВыборкаСН.ПроживающийПол) Тогда
				
				Если ВыборкаСН.ПроживающийПол = Перечисления.ПолФизическогоЛица.Мужской Тогда
					ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
					ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, );	
				ИначеЕсли ВыборкаСН.ПроживающийПол = Перечисления.ПолФизическогоЛица.Женский Тогда
					ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, );
					ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если Объект.ОткудаПрибылИзЛС Тогда
				
				СтруктураОткудаПрибыл = ПолучитьМуниципальныйАдресБСП(ВыборкаСН.ОткудаПрибылЗначение); 
								
				Если НЕ СтруктураОткудаПрибыл = Неопределено Тогда
					
					ШапкаОбласть.Параметры.РегионРег		  = СтруктураОткудаПрибыл.Регион;
					ШапкаОбласть.Параметры.ГородРег			  = СтруктураОткудаПрибыл.Город;
					ШапкаОбласть.Параметры.РайонРег 		  = СтруктураОткудаПрибыл.Район;					
					ШапкаОбласть.Параметры.НаселенныйПунктРег = СтруктураОткудаПрибыл.НаселенныйПункт;
					ШапкаОбласть.Параметры.УлицаРег 		  = СтруктураОткудаПрибыл.Улица;				
					ШапкаОбласть.Параметры.ДомРег			  = СтруктураОткудаПрибыл.Дом;
					ШапкаОбласть.Параметры.КорпусРег 		  = СтруктураОткудаПрибыл.Корпус;
					ШапкаОбласть.Параметры.КвартираРег 		  = СтруктураОткудаПрибыл.Квартира;
					
				КонецЕсли;  
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДанныеПечати.РешениеСуда) Тогда
				Если Объект.КудаВыписанИзЛС Тогда
					СтруктураКудаВыбыл = ПолучитьМуниципальныйАдресБСП(ВыборкаСН.КудаУбылЗначение);					
					
					Если НЕ СтруктураКудаВыбыл = Неопределено Тогда
						
						ШапкаОбласть.Параметры.РегионВыб		  = СтруктураКудаВыбыл.Регион;
						ШапкаОбласть.Параметры.ГородВыб			  = СтруктураКудаВыбыл.Город;
						ШапкаОбласть.Параметры.РайонВыб 		  = СтруктураКудаВыбыл.Район;
						ШапкаОбласть.Параметры.НаселенныйПунктВыб = СтруктураКудаВыбыл.НаселенныйПункт;
						ШапкаОбласть.Параметры.УлицаВыб           = СтруктураКудаВыбыл.Улица;	
						ШапкаОбласть.Параметры.ДомВыб             = СтруктураКудаВыбыл.Дом;
						ШапкаОбласть.Параметры.КорпусВыб          = СтруктураКудаВыбыл.Корпус;
						ШапкаОбласть.Параметры.КвартираВыб        = СтруктураКудаВыбыл.Квартира;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			ШапкаОбласть.Параметры.ВидДокумента =  ВыборкаСН.ВидДокумента;
			ШапкаОбласть.Параметры.СерияДокумента =    ВыборкаСН.СерияДокумента;
			ШапкаОбласть.Параметры.НомерДокумента = 	ВыборкаСН.НомерДокумента;
			
			ШапкаОбласть.Параметры.ДеньВыдачиДокумента  = Формат(ВыборкаСН.ДатаВыдачиДокумента,"ДФ='дд'");
			ДатаМесяц 							 = Формат(ВыборкаСН.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.МесяцВыдачиДокумента = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГодВыдачиДокумента   = Формат(ВыборкаСН.ДатаВыдачиДокумента,"ДФ='yyyy'");
			
			
			ВыданДокумент_1 = "";
			ВыданДокумент_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВыборкаСН.ВыданДокумент, 50, ВыданДокумент_1 , ВыданДокумент_2 );
			
			ШапкаОбласть.Параметры.ВыданДокумент_1 =  ВыданДокумент_1;
			ШапкаОбласть.Параметры.ВыданДокумент_2 =  ВыданДокумент_2;
			
			ШапкаОбласть.Параметры.ДокументКодПодразделения =   ВыборкаСН.ДокументКодПодразделения;
			
			
			ТабДокумент.Вывести(ШапкаОбласть);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой анкета.
// Инвентаризации.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьАнкета()  
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(&Момент, ) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
		
		Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("Анкета_New");
		
		ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураМестоРождения = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
		ШапкаОбласть.Параметры.СтранаРожд          = СтруктураМестоРождения.Страна; 
		
		ШапкаОбласть.Параметры.РегионРожд          = СтруктураМестоРождения.Область; 
		ШапкаОбласть.Параметры.ГородРожд           = СтруктураМестоРождения.НаселенныйПункт;
		ШапкаОбласть.Параметры.РайонРожд           = СтруктураМестоРождения.Район;
		ШапкаОбласть.Параметры.НаселенныйПунктРожд = СтруктураМестоРождения.Село;
		
		ШапкаОбласть.Параметры.ДеньРожд  = Формат(Выборка.ДатаРождения,"ДФ=dd");
		ДатаМесяц						 = Формат(Выборка.ДатаРождения,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцРожд = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодРожд   = Формат(Выборка.ДатаРождения,"ДФ=yyyy");
		
		ШапкаОбласть.Параметры.ЧислоВыдачи 	= Формат(Выборка.ДатаВыдачиДокумента ,"ДФ=dd");
		ДатаМесяц						 	= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцВыдачи 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодВыдачи   	= Формат(Выборка.ДатаВыдачиДокумента ,"ДФ=yyyy");
		
		ДатаМесяц 							= Формат(Выборка.ДатаРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.ДатаРегистрацииМесяц = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ДатаМесяц 							= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.ДатаСнятияСРегистрацииМесяц = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ДатаМесяц 							= Формат(Выборка.Дата,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.ДатаМесяц = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		
		ШапкаОбласть.Параметры.Заполнить(Выборка);
		
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				
				ШапкаОбласть.Область("ПолМуж").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				
				ШапкаОбласть.Область("ПолЖен").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				
			КонецЕсли;
		КонецЕсли; 
		
		АдресЖительства = ПодробныйАдрес();
		Если АдресЖительства.Следующий() Тогда
			Если ЗначениеЗаполнено(АдресЖительства.Страна) Тогда
				ШапкаОбласть.Параметры.Республика 	= АдресЖительства.Страна;
			Иначе
				ШапкаОбласть.Параметры.Республика 	= "";	
			КонецЕсли; 
			ШапкаОбласть.Параметры.Регион 		= АдресЖительства.Регион;
			ШапкаОбласть.Параметры.Район 		= АдресЖительства.Район;
			ШапкаОбласть.Параметры.НасПункт 	= АдресЖительства.НасПункт;
			ШапкаОбласть.Параметры.Улица 		= АдресЖительства.Улица;
			ШапкаОбласть.Параметры.Дом 			= АдресЖительства.Дом;
			ШапкаОбласть.Параметры.Корпус 		= АдресЖительства.Корпус;
			ШапкаОбласть.Параметры.Квартира 	= АдресЖительства.Квартира;
		КонецЕсли; 
		
		ШапкаОбласть.Параметры.Дата = Выборка.Дата;
		КИОрганизации = ПолучитьКИ(Выборка.Организация,
		
		// Перечисления.ВидыОбъектовКонтактнойИнформации.Организации);.
		Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Организации);
		
		Адрес   = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
		
		Если Адрес <> Неопределено Тогда
			ШапкаОбласть.Параметры.АдресОрганизации = Адрес.Представление;
		КонецЕсли;
		
		ВыданДокумент_1 = "";
		ВыданДокумент_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.ВыданДокумент, 40, ВыданДокумент_1 , ВыданДокумент_2 );
		ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
		ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
		
		ТабДокумент.Вывести(ШапкаОбласть);
		
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните обязательные поля - Лицевой счет и Регистрируемое лицо и запишите документ";
		Сообщение.Сообщить();
	КонецЕсли; 
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция вызывает форму печати табличного документа с печатной формой.
// Инвентаризационной описи основных средств.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьСОРГ_РФ_ПМЖ(ВерсияМакета = Истина)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПринятоеРешение.ПринятоеРешение КАК ПринятоеРешение,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.Пол КАК Пол,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаПрибытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаУбытия,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибылАдресЗапятые,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.КудаВыписанАдресЗапятые
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "СведенияОРегистрацииГражданинаРоссийскойФедерацииПоМестуЖительства";
		
		Если ВерсияМакета Тогда
			
			Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("СОРГ_РФ_ПМЖ");
			ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
			
		Иначе
			
			Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("СОРГ_РФ_ПМЖ_Old");
			ШапкаОбласть  	= Макет.ПолучитьОбласть("Шапка");
			СтрокаОбласть = Макет.ПолучитьОбласть("СтрокаТЧ");
			ПодвалОбласть	= Макет.ПолучитьОбласть("Подвал");
			
		КонецЕсли; 
		
		КИОрганизации = ПолучитьКИ(Выборка.Организация, 
		Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Организации);
		
		Адрес   = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
		Телефон = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации, "Вид"); 
		АдресПочтовый = КИОрганизации.Найти(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации, "Вид");
		
		НазваниеОрганизации_1	= "";
		НазваниеОрганизации_2	= "";
		НазваниеОрганизации		= "";
		Если ЗначениеЗаполнено(Выборка.ЛицевойСчет)Тогда 
			
			Если ТипЗнч(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
				
				НазваниеОрганизации = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба.НаименованиеПолное;
				
			Иначе
				НазваниеОрганизации = Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба;
			КонецЕсли;
			
			// ИНН.
			ИНН = Объект.Организация.ИНН;
			ДлинаИНН = СтрДлина(Инн);
			
			Индекс = 0;
			Пока Индекс <> ДлинаИнн И Индекс < 10  Цикл
				
				Индекс = Индекс + 1;
				ИННИндекс = "ИНН" + Индекс;
				ШапкаОбласть.Параметры[ИННИндекс] = Сред(ИНН,Индекс,1);
				
			КонецЦикла;
			
			// КПП.
			КПП = Объект.Организация.КПП;
			ДлинаИНН = СтрДлина(КПП);
			
			Индекс = 0;
			Пока Индекс <> ДлинаИнн Цикл
				
				Индекс = Индекс + 1;
				КППИндекс = "КПП" + Индекс;
				ШапкаОбласть.Параметры[КППИндекс] = Сред(КПП,Индекс,1);
				
			КонецЦикла;
			
			// ОГРН.
			ОГРН = Объект.Организация.ОГРН;
			ДлинаИНН = СтрДлина(ОГРН);
			
			Индекс = 0;
			Пока Индекс <> ДлинаИнн Цикл
				
				Индекс = Индекс + 1;
				ОГРНИндекс = "ОГРН" + Индекс;
				ШапкаОбласть.Параметры[ОГРНИндекс] = Сред(ОГРН,Индекс,1);
				
			КонецЦикла;
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(НазваниеОрганизации, 35, НазваниеОрганизации_1 , НазваниеОрганизации_2 );
		КонецЕсли; 
		
		ШапкаОбласть.Параметры.НазваниеОрганизации_1 = НазваниеОрганизации_1;
		ШапкаОбласть.Параметры.НазваниеОрганизации_2 = НазваниеОрганизации_2;
		
		// ИМНС.
		НалоговыйОрган_1 = "";
		НалоговыйОрган_2 = "";
		НалоговыйОрган_3 = "";
		
		Если ЭтаФорма.Объект.Ссылка.Пустая() Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Сначала запишите документ";
			Сообщение.Сообщить();
			Возврат Неопределено;
			
		КонецЕсли;
		
		Попытка
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.Организация.НаименованиеИМНС, 35, НалоговыйОрган_1 , НалоговыйОрган_2 );
		Исключение
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выборка.Организация.НаименованиеНалоговогоОргана, 35, НалоговыйОрган_1 , НалоговыйОрган_2 );
		КонецПопытки;
		
		ШапкаОбласть.Параметры.НалоговыйОрган_1 = НалоговыйОрган_1;
		ШапкаОбласть.Параметры.НалоговыйОрган_2 = НалоговыйОрган_2;
		
		Попытка
			ИМНС = Выборка.Организация.КодИМНС;
		Исключение
			ИМНС = Выборка.Организация.КодНалоговогоОргана;
		КонецПопытки;
		
		ДлинаИНН = СтрДлина(ИМНС);
		
		Индекс = 0;
		Пока Индекс <> ДлинаИнн Цикл
			
			Индекс = Индекс + 1;
			ИМНСИндекс = "ГНИ" + Индекс;
			ШапкаОбласть.Параметры[ИМНСИндекс] = Сред(ИМНС,Индекс,1);
			
		КонецЦикла;
		
		// Сведения о физ лице.
		ШапкаОбласть.Параметры.Фамилия  = Выборка.Фамилия;
		ШапкаОбласть.Параметры.Имя      = Выборка.Имя;
		ШапкаОбласть.Параметры.Отчество = Выборка.Отчество;
		
		Если ЗначениеЗаполнено(Выборка.Пол) Тогда
			
			Если Выборка.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				
				ШапкаОбласть.Параметры.ПолМ  = "V";
				
			ИначеЕсли Выборка.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				
				ШапкаОбласть.Параметры.ПолЖ  = "V";
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		ШапкаОбласть.Параметры.ДатаРождения  = Формат(Выборка.ДатаРождения, "ДЛФ=DD");
		
		МестоРожденияСтруктура = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.МестоРождения);
		МестоРождения = "";
		Если ЗначениеЗаполнено(МестоРожденияСтруктура.НаселенныйПункт) Тогда
			МестоРождения = МестоРождения + МестоРожденияСтруктура.НаселенныйПункт;
		КонецЕсли; 
		Если ЗначениеЗаполнено(МестоРожденияСтруктура.Село) Тогда	
			МестоРождения = МестоРождения +", "+ МестоРожденияСтруктура.Село + " село";
		КонецЕсли;
		Если ЗначениеЗаполнено(МестоРожденияСтруктура.Район) Тогда	
			МестоРождения = МестоРождения +", "+ МестоРожденияСтруктура.Район + " р-на";
		КонецЕсли;  
		Если ЗначениеЗаполнено(МестоРожденияСтруктура.Область) Тогда	
			МестоРождения = МестоРождения +", "+ МестоРожденияСтруктура.Область + " обл.";
		КонецЕсли;  
		Если ЗначениеЗаполнено(МестоРожденияСтруктура.Страна) Тогда	
			МестоРождения = МестоРождения +", "+ МестоРожденияСтруктура.Страна;
		КонецЕсли; 
		ШапкаОбласть.Параметры.МестоРождения = МестоРождения;
		
		// ШапкаОбласть.Параметры.ВидДокумента  = Выборка.ВидДокумента;.
		Если ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
			Если ЗначениеЗаполнено(Выборка.ВидДокумента.КодПФР) Тогда
				ШапкаОбласть.Параметры.ВидДокумента 		= Выборка.ВидДокумента.КодПФР; 
			Иначе	
				ШапкаОбласть.Параметры.ВидДокумента 		= Выборка.ВидДокумента;
			КонецЕсли;
		КонецЕсли;
		
		ШапкаОбласть.Параметры.Серия         = Выборка.СерияДокумента;
		ШапкаОбласть.Параметры.Номер         = Выборка.НомерДокумента;
		
		КемВыдан_1 = "";
		КемВыдан_2 = "";
		Если ЗначениеЗаполнено(Выборка.ВыданДокумент) Тогда
			КемВыдан = Строка(Выборка.ВыданДокумент) + ", код " + Строка(Выборка.ДокументКодПодразделения);
		ИначеЕсли ЗначениеЗаполнено(Выборка.ДокументКодПодразделения) Тогда
			КемВыдан = Строка(Выборка.ДокументКодПодразделения);
		КонецЕсли; 
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(КемВыдан, 25, КемВыдан_1, КемВыдан_2 );
		ШапкаОбласть.Параметры.КемВыдан_1 = КемВыдан_1;
		ШапкаОбласть.Параметры.КемВыдан_2 = КемВыдан_2;
		
		Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда
			ШапкаОбласть.Параметры.ДатаВыдачиДокумента = Формат(Выборка.ДатаВыдачиДокумента, "ДФ='dd.MM.yyyy ""г.""'");
		КонецЕсли; 
		
		// Сведения о постановке на учет.
		КИФизЛица = ПолучитьКИ(Выборка.РегистрируемоеЛицо, Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие);
		
		НаборЗаписей = НЕОПРЕДЕЛЕНО;
		
		Если Выборка.ДомРег.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
			
			Строки = Выборка.ДомРег.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			
			Если Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.ДомРег.ПочтовыйАдрес) Тогда
				
				СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ДомРег.ПочтовыйАдрес);
				
			ИначеЕсли НЕ Строки.количество() = 0 Тогда
				
				//15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда
					
					ПочтовыйАдресПредставление = Строки[0].Представление;
					СтруктураПочтовыйАдрес = ПолучитьАдресБСП(Строки[0].Значение);
					
					//---	
				ИначеЕсли ЗначениеЗаполнено(Выборка.ДомРег.ПочтовыйАдресЗапятые) Тогда
					
					СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ДомРег.ПочтовыйАдресЗапятые);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.ДомРег.ПочтовыйАдрес) Тогда
					
					бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
					
					
					ВыборкаПочтАдр = Неопределено;
					Для каждого СтрокаНабор Из НаборЗаписей  Цикл
						Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
							И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
							Тогда 
							ВыборкаПочтАдр = СтрокаНабор;
						КонецЕсли;	
					КонецЦикла;
					
					ПочтовыйАдресСтрока = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
					СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
					
				Иначе
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Перезаполните поле откуда прибыл адрес";
					Сообщение.Сообщить();
					Возврат Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;			
			
		Иначе
			
			бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей,Выборка.ДомРег);
			
			ВыборкаПочтАдр = Неопределено;
			Для каждого СтрокаНабор Из НаборЗаписей  Цикл
				Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
					И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
					Тогда 
					ВыборкаПочтАдр = СтрокаНабор;
				КонецЕсли;	
			КонецЦикла;
			
			СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ВыборкаПочтАдр);
			СтруктураПочтовыйАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПочтовыйАдресСтрока);
			
		КонецЕсли;
		
		Если СтруктураПочтовыйАдрес <> Неопределено И НЕ СтруктураПочтовыйАдрес.Свойство("ЗаПределамиРФ") Тогда
			
			Если ЗначениеЗаполнено(СтруктураПочтовыйАдрес.Страна) Тогда
				ШапкаОбласть.Параметры.Республика = СтруктураПочтовыйАдрес.Страна;
			ИначеЕсли ЗначениеЗаполнено(СтруктураПочтовыйАдрес.Регион) Тогда
				ШапкаОбласть.Параметры.Республика = СтруктураПочтовыйАдрес.Регион;
			КонецЕсли; 
			ШапкаОбласть.Параметры.Район      = СтруктураПочтовыйАдрес.Район;
			//12.12.2018
			если Найти(НРег(СтруктураПочтовыйАдрес.Регион), "москва") <> 0 тогда
				ШапкаОбласть.Параметры.Город      = СтруктураПочтовыйАдрес.Регион;
			иначе	
				ШапкаОбласть.Параметры.Город      = СтруктураПочтовыйАдрес.Город;
			конецесли; 
			
			ШапкаОбласть.Параметры.Село       = СтруктураПочтовыйАдрес.НаселенныйПункт;
			ШапкаОбласть.Параметры.Улица      = СтруктураПочтовыйАдрес.Улица;
			ШапкаОбласть.Параметры.Дом        = СтруктураПочтовыйАдрес.Дом;
			ШапкаОбласть.Параметры.Корпус     = СтруктураПочтовыйАдрес.Корпус;
			
		Иначе
			ШапкаОбласть.Параметры.Улица      = Выборка.УлицаРег;
			ШапкаОбласть.Параметры.Дом        = Выборка.ДомРег;
			ШапкаОбласть.Параметры.Корпус     = Выборка.КорпусРег;
			
		КонецЕсли; 
		ШапкаОбласть.Параметры.Квартира   = Выборка.КвартираРег;
		
		// Предыдущее место пребывания.
		Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ОткудаПрибылПредставление);
			
			Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
			
			
			Если Строки.количество() = 0 и ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) Тогда
				
				АдресИнформированияСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
				
			ИначеЕсли НЕ Строки.количество() = 0 Тогда
				
				//15.10.2018
				Если ЗначениеЗаполнено(Строки[0].Значение) Тогда
					
					АдресПрибытияПредставление = Строки[0].Представление;
					АдресИнформированияСтруктура = ПолучитьАдресБСП(Строки[0].Значение);
					
					//---
				ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдресЗапятые) Тогда
					
					АдресИнформированияСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдресЗапятые);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.ОткудаПрибылАдрес) Тогда
					
					Если Объект.ОткудаПрибылИзЛС Тогда
						
						
						Если НЕ ПустаяСтрока(Объект.ОткудаПрибылАдрес) Тогда
							
							ОткудаПрибылПредставление = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(Объект.ОткудаПрибылАдрес);
							ОткудаПрибылКонтактнаяИнформацияНаСервере();	
							
						КонецЕсли;
						
						
						Если ЗначениеЗаполнено(ОткудаПрибылПредставлениеЗапятые) Тогда
							
							АдресИнформированияСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ОткудаПрибылПредставлениеЗапятые);
							
						КонецЕсли; 
						
					Иначе
						
						Попытка
							АдресИнформированияСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Объект.ОткудаПрибылАдрес);
							
						Исключение
							Сообщение = Новый СообщениеПользователю();
							Сообщение.Текст = "Перезаполните откуда прибыл адрес";
							Сообщение.Сообщить();
							АдресИнформированияСтруктура = Неопределено;
						КонецПопытки;
						
					КонецЕсли; 
					
				Иначе
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Заполните откуда прибыл адрес";
					Сообщение.Сообщить();
					АдресИнформированияСтруктура = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;			
			
		Иначе
			
			АдресИнформированияСтруктура = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Выборка.ОткудаПрибылАдрес);
			
		КонецЕсли;		
		
		Если АдресИнформированияСтруктура <> Неопределено И НЕ АдресИнформированияСтруктура.Свойство("ЗаПределамиРФ") Тогда
			
			ШапкаОбласть.Параметры.ПредРеспублика = АдресИнформированияСтруктура.Страна;
			ШапкаОбласть.Параметры.ПредРайон      = АдресИнформированияСтруктура.Район;
			//12.12.2018
			если Найти(НРег(АдресИнформированияСтруктура.Регион), "москва") <> 0 тогда
				ШапкаОбласть.Параметры.ПредГород      = АдресИнформированияСтруктура.Регион;
			иначе	
				ШапкаОбласть.Параметры.ПредГород      = АдресИнформированияСтруктура.Город;
			конецесли; 
			ШапкаОбласть.Параметры.ПредСело       = АдресИнформированияСтруктура.НаселенныйПункт;
			ШапкаОбласть.Параметры.ПредУлица      = АдресИнформированияСтруктура.Улица;
			ШапкаОбласть.Параметры.ПредДом        = АдресИнформированияСтруктура.Дом;
			ШапкаОбласть.Параметры.ПредКорпус     = АдресИнформированияСтруктура.Корпус;
			ШапкаОбласть.Параметры.ПредКвартира   = АдресИнформированияСтруктура.Квартира;
			
		КонецЕсли; 
		
		ШапкаОбласть.Параметры.стДатаПостановки       = Формат(Выборка.ДатаРегистрации, "ДФ='dd.MM.yyyy ""г""'");
		ШапкаОбласть.Параметры.ДатаСнятияСрегистрации = Формат(Выборка.ДатаСнятияСРегистрации, "ДФ='dd.MM.yyyy ""г.""'");
		
		Если ВерсияМакета Тогда
			ШапкаОбласть.Параметры.ДатаДокумента          = Формат(Выборка.Дата, "ДФ='dd.MM.yyyy ""г.""'");
			
			ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Выборка.Организация, Выборка.ДолжностноеЛицо, Выборка.Дата, Ложь);
			Если ТипЗнч(ДолжностноеЛицоФИО) = Тип("Структура") Тогда
				ШапкаОбласть.Параметры.ДолжностноеЛицо 	= ДолжностноеЛицоФИО.ДолжностноеЛицо;
				ШапкаОбласть.Параметры.Должность 		= ДолжностноеЛицоФИО.Должность;
			КонецЕсли;
			
		КонецЕсли;
		ТабДокумент.Вывести(ШапкаОбласть);
		
		// Выбран макет с данными детей до 14 лет. 
		Если НЕ ВерсияМакета Тогда                                 
			
			СписокДетей = Объект.ФизическиеЛица.Выгрузить();
			МассивДляУдаления = Новый Массив;
			Для каждого ДанныеРебенка Из СписокДетей Цикл
				
				ДатаРождения = ДанныеРебенка.ФизическоеЛицо.ДатаРождения;
				
				ЧислоЛет = бит_ПаспортныйСтолКлиетСервер.КолвоПолныхЛет(ДатаРождения,Выборка.ДатаРегистрации);
				
				Если ЧислоЛет > 14 Тогда
					
					МассивДляУдаления.Добавить(ДанныеРебенка);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого СтрокаМассива Из МассивДляУдаления  Цикл
				
				СписокДетей.Удалить(СтрокаМассива);
				
			КонецЦикла; 
			
			Если СписокДетей.Количество()>0 Тогда
				
				Для каждого СтрокаТЧ Из СписокДетей Цикл
					
					если СтрокаТЧ.ФизическоеЛицо = неопределено тогда
						продолжить
					конецесли; 
					
					ФИОФизЛица      = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(СтрокаТЧ.ФизическоеЛицо,Выборка.Дата, Ложь);
					
					Если ЗначениеЗаполнено(ФИОФизЛица) Тогда
						СтрокаОбласть.Параметры.ФизЛицо = ФИОФизЛица;
					Иначе
						СтрокаОбласть.Параметры.ФизЛицо = СтрокаТЧ.ФизическоеЛицо.Наименование;
					КонецЕсли;
					
					Если СтрокаТЧ.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
						
						СтрокаОбласть.Параметры.Пол = "жен";
						
					ИначеЕсли СтрокаТЧ.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
						
						СтрокаОбласть.Параметры.Пол = "муж";
						
					КонецЕсли;
					
					СтрокаОбласть.Параметры.ДатаРождения = Формат(СтрокаТЧ.ФизическоеЛицо.ДатаРождения,"ДФ=dd.MM.yyyy");
					
					Если ЗначениеЗаполнено(СтрокаТЧ.ФизическоеЛицо.МестоРождения) Тогда
						
						МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(СтрокаТЧ.ФизическоеЛицо.МестоРождения);
						СтрокаОбласть.Параметры.МестоРождения = МестоРождения;
						
					КонецЕсли; 
					
					ДокументФизЛица = бит_ПаспортныйСтолСервер.ПолучитьДанныеДокументаФизЛица(СтрокаТЧ.ФизическоеЛицо,Выборка.Дата);
					
					СтрокаОбласть.Параметры.СерияДок 	= ДокументФизЛица.ДокументСерия;
					СтрокаОбласть.Параметры.НомерДок 	= ДокументФизЛица.ДокументНомер;
					СтрокаОбласть.Параметры.ДатаДок  	= Формат(ДокументФизЛица.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy" );
					СтрокаОбласть.Параметры.КемВыданДок = ДокументФизЛица.ДокументКемВыдан + ?(ЗначениеЗаполнено(ДокументФизЛица.ДокументКодПодразделения),"код " + ДокументФизЛица.ДокументКодПодразделения,"");
					
					ТабДокумент.Вывести(СтрокаОбласть);
				КонецЦикла; 
				
			КонецЕсли;
			
			ПодвалОбласть.Параметры.ДатаДокумента = Выборка.Дата;
			
			ТабДокумент.Вывести(ПодвалОбласть);
			
		КонецЕсли;
		
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните обязательные поля - Лицевой счет и Регистрируемое лицо и запишите документ";
		Сообщение.Сообщить();
	КонецЕсли; 
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСОРПМП()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПОДСТРОКА(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения, 3, 200) КАК МестоРождения,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("СОРПМП");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если Выборка.ПочтовыйАдрес <> Неопределено И Выборка.ПочтовыйАдрес <> NULL Тогда
		АдресПрибытия = Строка(Выборка.ПочтовыйАдрес)+", кв."+Строка(Выборка.КвартираРег);
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 60, АдресПрибытия_1, АдресПрибытия_2);
		ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	Если Выборка.РегистрируемоеЛицо <> Неопределено Тогда
		
		МестоРождения_1 = "";
		МестоРождения_2 = "";
		
		МестоРожденияСтруктура = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
		Если ЗначениеЗаполнено(МестоРожденияСтруктура) Тогда
			МестоРожденияСтрока = ?(ЗначениеЗаполнено(МестоРожденияСтруктура.НаселенныйПункт),МестоРожденияСтруктура.НаселенныйПункт +", ","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Село),", село (дер.): " + СокрЛП(МестоРожденияСтруктура.Село), "")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Район),МестоРожденияСтруктура.Район + " р-н, ","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Область),МестоРожденияСтруктура.Область + " обл.,","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Страна)," страна "+МестоРожденияСтруктура.Страна,"");
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРожденияСтрока, 60, МестоРождения_1, МестоРождения_2);
			ШапкаОбласть.Параметры.МестоРождения_1 = МестоРождения_1;
			ШапкаОбласть.Параметры.МестоРождения_2 = МестоРождения_2;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
		ФИОФизЛицо = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
	Иначе
		ФИОФизЛицо = Строка(Выборка.РегистрируемоеЛицо);
	КонецЕсли; 
	
	// Перевод в родительный падеж.
	//ФизЛицо_Склон = "";
	//ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФИОФизЛицо,3,Выборка.РегистрируемоеЛицо.Пол,ФизЛицо_Склон);
	//Если ИсходСклонения Тогда
	//	ФизЛицо = ФизЛицо_Склон;
	//КонецЕсли;	
	
	ФизЛицо = ФИОФизЛицо + ", "+Строка(Формат(Выборка.ДатаРождения,"ДФ='yyyy ""г.р.""'"));
	ШапкаОбласть.Параметры.ФизЛицо = ФизЛицо;
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ШапкаОбласть.Параметры.ОрганУчета = Выборка.ДомРег.ПаспортнаяСлужба;				
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоРег    	= День(Выборка.ДатаРегистрации);
		ДатаМесяц 							= Формат(Выборка.ДатаРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцРег 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодРег     	= Формат(Выборка.ДатаРегистрации,"ДФ=yy");
	КонецЕсли;
	Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоСнят    = День(Выборка.ДатаСнятияСРегистрации);
		ДатаМесяц 							= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцСнят 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодСнят     	= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='yy'");
	КонецЕсли;
	ШапкаОбласть.Параметры.ЧислоТек    	= Выборка.Дата;
	ДатаМесяц 							= Формат(Выборка.Дата,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцТек 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодТек     	= Выборка.Дата;
	
	ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Выборка.Организация, Выборка.ДолжностноеЛицо, Выборка.Дата, Ложь);
	Если ТипЗнч(ДолжностноеЛицоФИО) = Тип("Структура") Тогда
		ШапкаОбласть.Параметры.ДолжностноеЛицо = ДолжностноеЛицоФИО.ДолжностноеЛицо;
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСОРПМПЖ()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию КАК Ответственный,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Комментарий,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	ПОДСТРОКА(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.МестоРождения, 3, 200) КАК МестоРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание КАК ДомРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Квартира КАК КвартираРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ЕСТЬNULL(бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДолжностноеЛицо
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("СОРПМПЖ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда
		АдресПрибытия = Строка(Выборка.ПочтовыйАдрес)+", кв."+Строка(Выборка.КвартираРег);
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 74, АдресПрибытия_1, АдресПрибытия_2);
		ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	Если Выборка.РегистрируемоеЛицо <> Неопределено Тогда
		МестоРождения_1 = "";
		МестоРождения_2 = "";
		МестоРожденияСтруктура = бит_ПаспортныйСтолКлиетСервер.РазложитьМестоРождения(Выборка.РегистрируемоеЛицо.МестоРождения);
		Если ЗначениеЗаполнено(МестоРожденияСтруктура) Тогда
			МестоРожденияСтрока = ?(ЗначениеЗаполнено(МестоРожденияСтруктура.НаселенныйПункт),МестоРожденияСтруктура.НаселенныйПункт +", ","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Село),", село (дер.): " + СокрЛП(МестоРожденияСтруктура.Село), "")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Район),МестоРожденияСтруктура.Район + " р-н, ","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Область),МестоРожденияСтруктура.Область + " обл.,","")+
			?(ЗначениеЗаполнено(МестоРожденияСтруктура.Страна)," страна "+МестоРожденияСтруктура.Страна,"");
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРожденияСтрока, 60, МестоРождения_1, МестоРождения_2);
			ШапкаОбласть.Параметры.МестоРождения_1 = МестоРождения_1;
			ШапкаОбласть.Параметры.МестоРождения_2 = МестоРождения_2;
		КонецЕсли; 
	КонецЕсли; 
	
	ШапкаОбласть.Параметры.ЧислоТек = Формат(Выборка.Дата,"ДФ=dd");
	ДатаМесяц 						= Формат(Выборка.Дата,"ДФ='дд.MMMM'");
	ШапкаОбласть.Параметры.МесяцТек	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ШапкаОбласть.Параметры.ГодТек	= Формат(Выборка.Дата,"ДФ=yy");
	
	Если ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента) Тогда 
		ШапкаОбласть.Параметры.ДеньДатаВыдачиДокумента  = Формат(Выборка.ДатаВыдачиДокумента,"ДФ=dd");
		ДатаМесяц 										= Формат(Выборка.ДатаВыдачиДокумента,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцДатаВыдачиДокумента	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодДатаВыдачиДокумента	= Формат(Выборка.ДатаВыдачиДокумента,"ДФ=yy");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
		ФизЛицо = Строка(Выборка.Фамилия) + " " + Строка(Выборка.Имя) + " " + Строка(Выборка.Отчество);
	Иначе
		ФизЛицо = Строка(Выборка.РегистрируемоеЛицо);
	КонецЕсли;
	ФизЛицо = ФизЛицо + ", "+ Строка(Формат(Выборка.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'"));
	ШапкаОбласть.Параметры.ФизЛицо = ФизЛицо;
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ОрганУчета = Строка(Выборка.ДомРег.ПаспортнаяСлужба);
		ОрганУчета_1 = "";
		ОрганУчета_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ОрганУчета, 30, ОрганУчета_1, ОрганУчета_2);
		ШапкаОбласть.Параметры.ОрганУчета_1 = ОрганУчета_1;
		ШапкаОбласть.Параметры.ОрганУчета_2 = ОрганУчета_2;
		
	КонецЕсли;
	
	ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьОтветственногоОрганизации(Выборка.Организация,Выборка.ДолжностноеЛицо, Выборка.Дата, Ложь);
	Если ТипЗнч(ДолжностноеЛицоФИО) = Тип("Структура") Тогда
		ШапкаОбласть.Параметры.ДолжностноеЛицо = ДолжностноеЛицоФИО.ДолжностноеЛицо;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ. 
// С макетом заявления.
// Параметры:
//  ВидЗаявления - логический, формирует шаблон в макете.
//  ТипМакета - логический, выбирает версии макета (версия 1 = Истина). 
// Возвращаемое значение:
//  Табличный документ - печатная форма заявления.
//
Функция ПечатьЗаявление(ВидЗаявления = Истина, ТипМакета = Истина)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Организация,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныйЗаРегистрацию,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.СтепеньРодства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДокументОснование
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних1
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних1.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) И ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
		
		ТабДокумент  = Новый ТабличныйДокумент;
		
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеСНГиРФ";
		Макет         = Документы.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПолучитьМакет("Заявление");                       
		ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
		
		Если ТипМакета Тогда
			
			ШапкаТекст		  = Макет.ПолучитьОбласть("Текст1");
			СтрокаОбласть	  = Макет.ПолучитьОбласть("СтрокаЖильцов");
			ПодвалОбласть	  = Макет.ПолучитьОбласть("Подвал1");
			
			Если ВидЗаявления Тогда
				ВидМеста = "пребывания";
			Иначе
				ВидМеста = "проживания";
			КонецЕсли;
			
		Иначе
			
			ШапкаТекст		  = Макет.ПолучитьОбласть("Текст2");
			ПодвалОбласть	  = Макет.ПолучитьОбласть("Подвал2");
			
			Если ВидЗаявления Тогда
				ВидМеста = "пребывания";
			Иначе
				ВидМеста = "жительства";
			КонецЕсли;
			
			ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
			
		КонецЕсли;
		
		Кому = "";
		ОтКого = "";
		
		РегистрируемоеЛицо_1 = "";
		РегистрируемоеЛицо_2 = "";
		
		СрокРегистрации 	= Неопределено;
		АдресПрибытия 		= Неопределено;
		
		Если Выборка.ВидОперации <> Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
			Если ЗначениеЗаполнено(Выборка.ЛицевойСчет)И ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание) И ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба) Тогда
				РуководительУФМС = "";
				Если ТипЗнч(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
					КонтактЛицо = Строка(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба.ОсновноеКонтактноеЛицо);
					Если ЗначениеЗаполнено(КонтактЛицо) Тогда
						РуководительУФМС_1 = "";
						РуководительУФМС = КонтактЛицо;
						ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(КонтактЛицо,3,,РуководительУФМС_1);
						РуководительУФМС = ВРег(РуководительУФМС_1);
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаПаспортСлужба = Строка(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба);  
				ПервыйПробел = Найти(СтрокаПаспортСлужба, " "); 
				
				Если ПервыйПробел > 0 Тогда
					ПервоеСлово = Сред(СтрокаПаспортСлужба,1,ПервыйПробел-1);
					ПервоеСловоВерхРег = ВРег(ПервоеСлово);
					
					Если ПервоеСловоВерхРег <> ПервоеСлово  Тогда
						
						СтрокаПаспортСлужба = СтрЗаменить(СтрокаПаспортСлужба,ПервоеСлово,"");
						ПервоеСловоСклон = "";
						ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ПервоеСлово,2,,ПервоеСловоСклон);
						
						Если ИсходСклонения Тогда
							СтрокаПаспортСлужба = ПервоеСловоСклон + СтрокаПаспортСлужба;
						Иначе
							СтрокаПаспортСлужба = Строка(Выборка.ЛицевойСчет.Здание.ПаспортнаяСлужба);
						КонецЕсли;
						
					КонецЕсли; 
					
					Кому = "Начальнику " + СтрокаПаспортСлужба;
					
				Иначе 
					
					Кому = "Начальнику ";
					
				КонецЕсли;
				
				Кому = Кому + " " + Символ(13) + РуководительУФМС;
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.ОтветственныйЗаРегистрацию) Тогда
				ШапкаОбласть.Параметры.Заполнить(Объект);
				// Перевод в родительный падеж.
				ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(Выборка.ОтветственныйЗаРегистрацию),2,Выборка.ОтветственныйЗаРегистрацию.Пол,ОтКого);
				
				ДанныеПаспорта = бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокой(Выборка.ОтветственныйЗаРегистрацию, Выборка.Дата, Ложь);
				Если ЗначениеЗаполнено(ДанныеПаспорта) Тогда
					ДанныеПаспорта = "";
				КонецЕсли;
				
				Если НЕ ИсходСклонения Тогда
					ОтКого = Строка(Выборка.ОтветственныйЗаРегистрацию);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ОтветственныйЗаРегистрацию.ДатаРождения) Тогда
					
					ДатаРождения = Формат(Выборка.ОтветственныйЗаРегистрацию.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'");
					ОтКого  = "от " + ОтКого + " "+ ДатаРождения + Символ(13) + ДанныеПаспорта;
					
				Иначе
					
					ОтКого  = "от " + ОтКого + Символ(13) + ДанныеПаспорта;
				КонецЕсли;
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
				
				РегистрируемоеЛицоЛС = "";
				
				ФИОРегЛица = "";
				ФИОРегЛица = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Выборка.РегистрируемоеЛицо, Выборка.Дата, Ложь);
				Если ФИОРегЛица = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ФИОРегЛица) Тогда
					ФИОРегЛица = Строка(Выборка.РегистрируемоеЛицо);
				КонецЕсли;
				
				//Если ТипМакета Тогда
				//	ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФИОРегЛица,4,Выборка.РегистрируемоеЛицо.Пол,РегистрируемоеЛицоЛС);
				//	// ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФИОРегЛица,2,ПолРегЛица,РегистрируемоеЛицоЛС);.
				//Иначе
				//	ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(ФИОРегЛица,3,Выборка.РегистрируемоеЛицо.Пол,РегистрируемоеЛицоЛС);
				//КонецЕсли;
				
				//Если ИсходСклонения Тогда
				//	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(РегистрируемоеЛицоЛС, 70, РегистрируемоеЛицо_1, РегистрируемоеЛицо_2);
				//	РегЛицо = РегистрируемоеЛицоЛС;
				//Иначе
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Строка(Выборка.РегистрируемоеЛицо), 70, РегистрируемоеЛицо_1, РегистрируемоеЛицо_2);
				РегЛицо = Строка(Выборка.РегистрируемоеЛицо);
				//КонецЕсли; 
				
			КонецЕсли; 
			
			АдресЛС = "";
			Если ЗначениеЗаполнено(Выборка.ОтветственныйЗаРегистрацию) Тогда
				АдресПоПрописке = бит_ПаспортныйСтолСервер.ПолучитьАдресИзКонтактнойИнформации(Выборка.ОтветственныйЗаРегистрацию, "Юридический");
				Если НЕ ПустаяСтрока(АдресПоПрописке) Тогда
					АдресЛС = АдресПоПрописке;
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
					
					Если ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
						
						АдресЛС = Строка(Выборка.ЛицевойСчет.Здание.ПочтовыйАдрес)+ ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Квартира), ", кв." + Строка(Выборка.ЛицевойСчет.Квартира),"");
						
					Иначе
						УлицаАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.УлицаЛицевогоСчета),"ул. " + Строка(Выборка.ЛицевойСчет.УлицаЛицевогоСчета),"");
						ДомАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание),", д. " + Строка(Выборка.ЛицевойСчет.Здание),"");
						КорпусАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание.Корпус),", корп. " + Строка(Выборка.ЛицевойСчет.Здание.Корпус),"");
						КвартираАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Квартира),", кв. " + Строка(Выборка.ЛицевойСчет.Квартира),"");
						
						АдресЛС =  УлицаАдреса + ДомАдреса + КорпусАдреса + КвартираАдреса;  
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Формирования срока прописки прописью.
			Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) и ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
				
				СрокРегистрации = бит_ПаспортныйСтолКлиетСервер.ПериодПрописью(Выборка.ДатаРегистрации,Выборка.ДатаСнятияСРегистрации);
				
			КонецЕсли;
			
			АдресПрибытия = "";
			Если ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
				
				Если ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
					
					АдресПрибытия = Строка(Выборка.ЛицевойСчет.Здание.ПочтовыйАдрес)+ ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Квартира), ", кв." + Строка(Выборка.ЛицевойСчет.Квартира),"");
					
				Иначе
					УлицаАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.УлицаЛицевогоСчета),"ул. " + Строка(Выборка.ЛицевойСчет.УлицаЛицевогоСчета),"");
					ДомАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание),", д. " + Строка(Выборка.ЛицевойСчет.Здание),"");
					КорпусАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Здание.Корпус),", корп. " + Строка(Выборка.ЛицевойСчет.Здание.Корпус),"");
					КвартираАдреса = ?(ЗначениеЗаполнено(Выборка.ЛицевойСчет.Квартира),", кв. " + Строка(Выборка.ЛицевойСчет.Квартира),"");
					
					АдресПрибытия =  УлицаАдреса + ДомАдреса + КорпусАдреса + КвартираАдреса;  
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураДляМакета = Новый Структура("Кому,ОтКого,РегЛицо, РегистрируемоеЛицо_1,РегистрируемоеЛицо_2,АдресЛС,ВидМеста,СрокРегистрации,АдресПрибытия,ОтветственныйЗаРегистрацию"
		,Кому,ОтКого,РегЛицо, РегистрируемоеЛицо_1,РегистрируемоеЛицо_2,АдресЛС,ВидМеста,СрокРегистрации,АдресПрибытия,Строка(Выборка.ОтветственныйЗаРегистрацию));
		
		ШапкаОбласть.Параметры.Заполнить(СтруктураДляМакета);
		ТабДокумент.Вывести(ШапкаОбласть);
		
		ШапкаТекст.Параметры.Заполнить(СтруктураДляМакета);
		Если НЕ ТипМакета тогда
			
			ДокументОсн = Выборка.ДокументОснование;
			ШапкаТекст.Параметры.ДокументОснование = ДокументОсн.Наименование + ?(ЗначениеЗаполнено(ДокументОсн.НомерДокумента)," №" + ДокументОсн.НомерДокумента,"")
			+ ?(ЗначениеЗаполнено(ДокументОсн.ДатаДокумента)," от " + Формат(ДокументОсн.ДатаДокумента,"ДЛФ=DD"),"");
			
			СтепеньРодстваИтог = "";
			Если Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				СтепеньРодстваИтог = "моему ";
			ИначеЕсли Выборка.РегистрируемоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				СтепеньРодстваИтог = "моей ";
			КонецЕсли;
			
			СтепеньРодстваЛС = "";
			//ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(Выборка.СтепеньРодства),3,,СтепеньРодстваЛС);
			//Если ИсходСклонения Тогда
			//	СтепеньРодстваИтог = СтепеньРодстваИтог + СтепеньРодстваЛС;
			//Иначе
			СтепеньРодстваИтог = СтепеньРодстваИтог + Строка(Выборка.СтепеньРодства);
			//КонецЕсли; 
			ШапкаТекст.Параметры.СтепеньРодства = СтепеньРодстваИтог;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ШапкаТекст);
		
		Если ТипМакета Тогда
			// Вывод строк с проживающими по ЛС.
			Если Выборка.ВидОперации <> Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
				
				// Формирование списка совершеннолетних, заполненных в таб части формы на вкладке "Доп. данные".
				СписокПроживающих = Объект.ФизическиеЛица.Выгрузить();
				МассивДляУдаления = Новый Массив;
				Для каждого ДанныеПроживающего Из СписокПроживающих Цикл
					
					ДатаРождения = ДанныеПроживающего.ФизическоеЛицо.ДатаРождения;
					
					ЧислоЛет = бит_ПаспортныйСтолКлиетСервер.КолвоПолныхЛет(ДатаРождения,Выборка.ДатаРегистрации);
					
					Если ЧислоЛет < 18 Тогда
						МассивДляУдаления.Добавить(ДанныеПроживающего);
					КонецЕсли;
					
				КонецЦикла;
				
				Для каждого СтрокаМассива Из МассивДляУдаления  Цикл
					
					СписокПроживающих.Удалить(СтрокаМассива);
					
				КонецЦикла; 
				Если СписокПроживающих.Количество()>0 Тогда
					
					Для каждого СтрокаТЧ Из СписокПроживающих Цикл
						
						ФИОФизЛица = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(СтрокаТЧ.ФизическоеЛицо,Выборка.Дата, Ложь);
						
						Если ЗначениеЗаполнено(ФИОФизЛица) Тогда
							СтрокаОбласть.Параметры.ЖилецЛС = ФИОФизЛица;
						Иначе
							СтрокаОбласть.Параметры.ЖилецЛС = СтрокаТЧ.ФизическоеЛицо.Наименование;
						КонецЕсли;
						ТабДокумент.Вывести(СтрокаОбласть);
					КонецЦикла;
					
				Иначе 
					
					КолвоСтрок = 3;
					Для Счетчик = 1 По КолвоСтрок Цикл
						ТабДокумент.Вывести(СтрокаОбласть);
					КонецЦикла; 
					
				КонецЕсли;		
			Иначе
				
				КолвоСтрок = 3;
				Для Счетчик = 1 По КолвоСтрок Цикл
					ТабДокумент.Вывести(СтрокаОбласть);
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли;     
		
		Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) тогда
			ДатаЗаявления = Выборка.ДатаРегистрации;
		ИначеЕсли ЗначениеЗаполнено(Выборка.Дата) Тогда
			ДатаЗаявления = Выборка.Дата;
		Иначе 
			ДатаЗаявления = ТекущаяДата();
		КонецЕсли;
		
		Если ТипМакета Тогда
			
			ПодвалОбласть.Параметры.День 	= Формат(ДатаЗаявления ,"ДФ=dd");
			ПодвалОбласть.Параметры.Месяц 	= Формат(ДатаЗаявления ,"ДФ=MM");
			ПодвалОбласть.Параметры.Год 	= Формат(ДатаЗаявления ,"ДФ='yyyy ""г.""'");
		Иначе
			ПодвалОбласть.Параметры.ДатаРегистрации = Формат(ДатаЗаявления, "ДЛФ=DD");
			КолвоСтрок = 3;
			Для Счетчик = 1 По КолвоСтрок Цикл
				ТабДокумент.Вывести(ОбластьПустаяСтрока);
			КонецЦикла; 
			
		КонецЕсли;	
		
		ТабДокумент.Вывести(ПодвалОбласть);
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните обязательные поля - Лицевой счет и Регистрируемое лицо и запишите документ");
		
	КонецЕсли; 
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Параметры:
//  Объект      - СправочникСсылка - Физ лицо/Контрагент/Организация,
//  ВидОбъекта  - ПеречислениеСсылка - Вид объекта контактной информации.
//
// Возвращаемое значение:
//   Таблица значений   - содержит контактную информацию.
//
Функция ПолучитьКИ(Объект, ВидОбъекта)
	
	Запрос = Новый Запрос;
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Вид КАК Вид,
	|	ВложенныйЗапрос.Тип КАК Тип,
	|	ВложенныйЗапрос.Объект КАК Объект,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле1) КАК Поле1,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле2) КАК Поле2,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле3) КАК Поле3,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле4) КАК Поле4,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле5) КАК Поле5,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле6) КАК Поле6,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле7) КАК Поле7,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле8) КАК Поле8,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле9) КАК Поле9,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле10) КАК Поле10,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипДома) КАК ТипДома,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипКорпуса) КАК ТипКорпуса,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипКвартиры) КАК ТипКвартиры,
	|	МАКСИМУМ(ВложенныйЗапрос.Представление) КАК Представление,
	|	МАКСИМУМ(ВложенныйЗапрос.Комментарий) КАК Комментарий,
	|	МАКСИМУМ(ВложенныйЗапрос.ЗначениеПоУмолчанию) КАК ЗначениеПоУмолчанию
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Объект КАК Объект,
	|		ВидыКонтактнойИнформации.Тип КАК Тип,
	|		ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|		"""" КАК Представление,
	|		"""" КАК Поле1,
	|		"""" КАК Поле2,
	|		"""" КАК Поле3,
	|		"""" КАК Поле4,
	|		"""" КАК Поле5,
	|		"""" КАК Поле6,
	|		"""" КАК Поле7,
	|		"""" КАК Поле8,
	|		"""" КАК Поле9,
	|		"""" КАК Поле10,
	|		"""" КАК ТипДома,
	|		"""" КАК ТипКорпуса,
	|		"""" КАК ТипКвартиры,
	|		"""" КАК Комментарий,
	|		"""" КАК ЗначениеПоУмолчанию
	|	ИЗ
	|		"+?(ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие"),"Справочник.бит_ВидыКонтактнойИнформации", "Справочник.бит_ВидыКонтактнойИнформации")+" КАК ВидыКонтактнойИнформации
	|	ГДЕ
	|		(НЕ ВидыКонтактнойИнформации.ПометкаУдаления)
	|		И ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		РегистрСведенийКонтактнаяИнформация.Объект,
	|		РегистрСведенийКонтактнаяИнформация.Тип,
	|		РегистрСведенийКонтактнаяИнформация.Вид,
	|		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Представление КАК СТРОКА(1000)),
	|		РегистрСведенийКонтактнаяИнформация.Поле1,
	|		РегистрСведенийКонтактнаяИнформация.Поле2,
	|		РегистрСведенийКонтактнаяИнформация.Поле3,
	|		РегистрСведенийКонтактнаяИнформация.Поле4,
	|		РегистрСведенийКонтактнаяИнформация.Поле5,
	|		РегистрСведенийКонтактнаяИнформация.Поле6,
	|		РегистрСведенийКонтактнаяИнформация.Поле7,
	|		РегистрСведенийКонтактнаяИнформация.Поле8,
	|		РегистрСведенийКонтактнаяИнформация.Поле9,
	|		РегистрСведенийКонтактнаяИнформация.Поле10,
	|		РегистрСведенийКонтактнаяИнформация.ТипДома,
	|		РегистрСведенийКонтактнаяИнформация.ТипКорпуса,
	|		РегистрСведенийКонтактнаяИнформация.ТипКвартиры,
	|		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Комментарий КАК СТРОКА(1000)),
	|		РегистрСведенийКонтактнаяИнформация.ЗначениеПоУмолчанию
	|	ИЗ
	|		"+?(ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие"),"РегистрСведений.бит_КонтактнаяИнформация", "РегистрСведений.бит_КонтактнаяИнформация")+" КАК РегистрСведенийКонтактнаяИнформация
	|	ГДЕ
	|		РегистрСведенийКонтактнаяИнформация.Объект = &Объект) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Вид,
	|	ВложенныйЗапрос.Тип,
	|	ВложенныйЗапрос.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление УБЫВ,
	|	ВложенныйЗапрос.Тип.Порядок,
	|	Вид";
	
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъекта);
	Запрос.УстановитьПараметр("Объект", Объект);
	
	ТабЗн = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабЗн;
	
КонецФункции

&НаСервере
Функция ПодробныйАдрес()
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	ЗапросАдрес = Новый Запрос;
	ЗапросАдрес.УстановитьПараметр("Объект" , Объект.РегистрируемоеЛицо);
	ЗапросАдрес.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1 КАК Индекс,
	|	КонтактнаяИнформация.Поле2 КАК Регион,
	|	КонтактнаяИнформация.Поле3 КАК Район,
	|	КонтактнаяИнформация.Поле4 КАК Город,
	|	КонтактнаяИнформация.Поле5 КАК НасПункт,
	|	КонтактнаяИнформация.Поле6 КАК Улица,
	|	КонтактнаяИнформация.Поле7 КАК Дом,
	|	КонтактнаяИнформация.Поле8 КАК Корпус,
	|	КонтактнаяИнформация.Поле9 КАК Квартира,
	|	КонтактнаяИнформация.Поле10 КАК Страна,
	|	КонтактнаяИнформация.Комментарий,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтактнаяИнформация.ТипДома,
	|	КонтактнаяИнформация.ТипКорпуса,
	|	КонтактнаяИнформация.ТипКвартиры,
	|	КонтактнаяИнформация.ПользовательЛичногоКонтакта
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего)";
	
	Выборка = ЗапросАдрес.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

&НаСервере
// Функция возвращает паспортные данные проживающих.
//
Функция ПолучитьТаблицуДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	//"ВЫБРАТЬ ПЕРВЫЕ 4
	//|	ПаспортныеДанныеФизЛиц.ФизЛицо,
	//|	ПаспортныеДанныеФизЛиц.ДокументВид КАК ВидДокумента,
	//|	ПаспортныеДанныеФизЛиц.ДокументСерия КАК СерияДокумента,
	//|	ПаспортныеДанныеФизЛиц.ДокументНомер КАК НомерДокумента,
	//|	ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	//|	ПаспортныеДанныеФизЛиц.ДокументКемВыдан КАК ВыданДокумент,
	//|	ПаспортныеДанныеФизЛиц.ДокументКодПодразделения КАК КодПодразделенияДокумента,
	//|	ПаспортныеДанныеФизЛиц.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	//|	бит_ПаспортныеДанныеПроживающих.ДокументВид
	//|ИЗ
	//|	РегистрСведений.бит_ПаспортныеДанныеПроживающих КАК ПаспортныеДанныеФизЛиц,
	//|	РегистрСведений.бит_ПаспортныеДанныеПроживающих КАК бит_ПаспортныеДанныеПроживающих
	//|ГДЕ
	//|	ПаспортныеДанныеФизЛиц.ФизЛицо = &ФизЛицо
	//|	И бит_ПаспортныеДанныеПроживающих.ФизЛицо = &ФизЛицо
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаВыдачиДокумента УБЫВ";
	
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо КАК ФизЛицо,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ВидДокумента,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК СерияДокумента,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК НомерДокумента,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК КодПодразделенияДокумента,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	 |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид
	 |ИЗ
	 |	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&ДатаСреза, ФизЛицо = &ФизЛицо) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", Объект.РегистрируемоеЛицо);
	Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции


&НаКлиенте
Процедура ОткудаПрибылАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением значения реквизита формы запишите документ, пожалуйста!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КудаВыписанАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением значения реквизита формы запишите документ, пожалуйста!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СменаФамилииНаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РедактированиеИзДокумента", Истина);
	
	СтруктураКлючЗаписи = Новый Структура;
	СтруктураКлючЗаписи.Вставить("ФизЛицо", Объект.РегистрируемоеЛицо);
	СтруктураКлючЗаписи.Вставить("Период" , Объект.Дата);
	
	ДобавитьКлючЗаписи(ПараметрыФормы, СтруктураКлючЗаписи, "бит_ФИОПроживающих");
	
	ОткрытьФорму("РегистрСведений.бит_ФИОПроживающих.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,
	ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПроживающих(Команда)
	
	СписокПроживающих = ПолучитьСписокПроживающих(Объект.ЛицевойСчет, Объект.Дата);
	
	Если СписокПроживающих.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма);
		СписокПроживающих.ПоказатьВыборЭлемента(Оповещение, "Проживающие по : " + ПолучитьНименованиеЛицевогоСчета(Объект.ЛицевойСчет));
		
	Иначе
		ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая",,Элементы.РегистрируемоеЛицо);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, Параметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбран проживающий!");
	Иначе
		Объект.РегистрируемоеЛицо = ВыбранныйЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры

//Возвращает список значений физ лиц
&НаСервереБезКонтекста
Функция ПолучитьСписокПроживающих(Знач ЛицевойСчет, Знач Дата)
	
	Результат = Новый СписокЗначений;
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("Момент"     ,КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Результат.ЗагрузитьЗначения(ТаблицаФизЛиц.ВыгрузитьКолонку("ФизЛицо"));
	
	Возврат Результат;
	
КонецФункции

//Возвращает массив ссылок на физ лица
&НаСервереБезКонтекста
Функция ПолучитьПроживающихПоЛССДолей(Знач ЛицевойСчет, Знач Дата)
	
	Результат = Новый Массив;
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	
	// +ДОРАБОТКА ЗАПРОС ОТ ИЮ
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ Различные
	//|	ПроживающиеПоЛССрезПоследних.ФизЛицо.Ссылка КАК ФизЛицоСсылка
	//|ИЗ
	//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	//|ГДЕ
	//|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	//|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	//|	И ПроживающиеПоЛССрезПоследних.ДоляПлощади > 0";
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо.Ссылка КАК ФизЛицоСсылка
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних";
	// -ДОРАБОТКА ЗАПРОС ОТ ИЮ
	
	Запрос.УстановитьПараметр("Момент"     ,КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Для Каждого ФизЛицо из ТаблицаФизЛиц Цикл
		Результат.Добавить(ФизЛицо.ФизЛицоСсылка);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруАдресаПоЗначению(АдресXML)
	СтруктураРезультат = Новый Структура;
	
	СтруктураРезультат.Вставить("Страна", "");
	СтруктураРезультат.Вставить("Индекс", "");
	СтруктураРезультат.Вставить("Регион", "");
	СтруктураРезультат.Вставить("Район", "");
	СтруктураРезультат.Вставить("Город", "");
	СтруктураРезультат.Вставить("Улица", "");
	СтруктураРезультат.Вставить("Поселение", "");
	СтруктураРезультат.Вставить("Территория", "");
	СтруктураРезультат.Вставить("Населенный", "");
	СтруктураРезультат.Вставить("Пункт", "");
	СтруктураРезультат.Вставить("ДомНомер", "");
	СтруктураРезультат.Вставить("КорпусНомер", "");
	СтруктураРезультат.Вставить("КвартираНомер", "");
	
	Страна = СтрНайти(АдресXML, "country"":");	
	Индекс = СтрНайти(АдресXML,"ZIPCode"":"); 
	Регион =  СтрНайти(АдресXML,"area"":");
	Район = СтрНайти(АдресXML, "district"":");
	Город = СтрНайти(АдресXML,"city"":");
	Улица = СтрНайти(АдресXML,"street"":");
	Поселение = СтрНайти(АдресXML,"settlement"":");
	Территория = СтрНайти(АдресXML,"territory"":");
	Населенный = СтрНайти(АдресXML,"locality"":");
	Пункт = СтрНайти(АдресXML,"localityType"":");
	ДомНомер = СтрНайти(АдресXML,"houseNumber"":");
	
	КорпусНомер = СтрНайти(АдресXML,"buildings"":");
	КвартираНомер = СтрНайти(АдресXML,"apartments"":");
	
	Если Район Тогда
		Начало = Район + 12;
		Конец =   СтрНайти(АдресXML, """,",,  Начало,);
		
		СтруктураРезультат.Район = Сред(АдресXML, Начало, Конец-Начало);
		
	КонецЕсли;
	
	Если КорпусНомер Тогда
		Начало = КорпусНомер + 48;
		Конец = СтрНайти(АдресXML, "}", ,Начало, )-3;
		
		СтруктураРезультат.КорпусНомер = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	Если КвартираНомер Тогда
		Начало = КвартираНомер + 51;
		Конец = СтрНайти(АдресXML, "}", ,Начало, )-3;
		
		СтруктураРезультат.КвартираНомер = Сред(АдресXML, Начало, Конец-Начало);
		
		Если СтрНайти(СтруктураРезультат.КвартираНомер, "]") Тогда
			Начало = КвартираНомер + 44;
			Конец = СтрНайти(АдресXML, "}", ,Начало, )-3;
			
			СтруктураРезультат.КвартираНомер = Сред(АдресXML, Начало, Конец-Начало);
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если Страна Тогда
		Начало = Страна+11;
		Конец = СтрНайти(АдресXML, """,", ,Начало,);
		
		СтруктураРезультат.Страна = Сред(АдресXML, Начало, Конец-Начало);
		
	КонецЕсли;
	
	Если Индекс Тогда
		Начало = Индекс+11;
		Конец = СтрНайти(АдресXML, """,", ,Начало,);
		
		СтруктураРезультат.Индекс = Сред(АдресXML, Начало, Конец-Начало);
		
	КонецЕсли;
	
	Если Регион Тогда
		Начало = Регион +8;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.Регион = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	
	Если Город Тогда
		Начало = Город +8;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.Город = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;	
	
	Если Улица Тогда
		Начало = Улица +10;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.Улица = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	
	Если Поселение Тогда
		Начало = Поселение +14;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.Поселение = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	
	Если Территория Тогда
		Начало = Территория +13;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.Территория = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	
	Если Населенный Тогда
		Начало = Населенный +12;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.Населенный = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	
	Если Пункт Тогда
		Начало = Пункт +16;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.Пункт = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	
	Если ДомНомер Тогда
		Начало = ДомНомер +15;
		Конец = СтрНайти(АдресXML, """,", , Начало, );
		
		СтруктураРезультат.ДомНомер = Сред(АдресXML, Начало, Конец-Начало);
	КонецЕсли;
	
	
	
	Возврат СтруктураРезультат;							
	
	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущихПроживающихПоЛС(Знач ЛицевойСчет, Знач Дата)
	Результат = Новый Массив;
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо.Ссылка КАК ФизЛицоСсылка
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"     ,КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Для Каждого ФизЛицо из ТаблицаФизЛиц Цикл
		Результат.Добавить(ФизЛицо.ФизЛицоСсылка);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВсехПроживающихПоЛС(Знач ЛицевойСчет)
	ПроживающиеПоЛС = Новый Массив;
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо.Ссылка КАК Проживающий,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка из ТаблицаФизЛиц Цикл
		СтруктураРез = Новый Структура;
		СтруктураРез.Вставить("Проживающий", Строка.Проживающий);
		СтруктураРез.Вставить("ДатаРегистрации", Строка.ДатаРегистрации); 
		
		ПроживающиеПоЛС.Добавить(СтруктураРез);	
	КонецЦикла;
	
	Возврат ПроживающиеПоЛС;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроживающихСнятыхСРегистрацииПоЛС(Знач ЛицевойСчет, Знач Дата)
	
	Результат = Новый Массив;
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо.Ссылка КАК ФизЛицоСсылка
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации < &Момент
	|			И НЕ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"     ,КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Для Каждого ФизЛицо из ТаблицаФизЛиц Цикл
		Результат.Добавить(ФизЛицо.ФизЛицоСсылка);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьАдресБСП(объектЛицевойСчет = неопределено)
	
	если ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_ЛицевыеСчета") тогда 	
		если объектЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 тогда 	
			АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет.Здание.КонтактнаяИнформация[0].Значение); 					
		конецесли; 
	конецесли; 
	
	если ТипЗнч(объектЛицевойСчет) = Тип("Строка") тогда 
		АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет);
	конецесли; 
	
	если ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_СписокЗданий") тогда 
		АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет.КонтактнаяИнформация[0].Значение);
	конецесли;	 
	
	
	СтруктураАдресРегистрации = Новый Структура;	
	СтруктураАдресРегистрации.Вставить("Страна", СокрЛП(АдресРезультат.Страна));
	СтруктураАдресРегистрации.Вставить("Представление", АдресРезультат.Представление);	
	СтруктураАдресРегистрации.Вставить("Регион", СокрЛП(АдресРезультат.Регион));
	СтруктураАдресРегистрации.Вставить("Район", СокрЛП(АдресРезультат.Район+ " " + строка(АдресРезультат.РайонСокращение)));   
	СтруктураАдресРегистрации.Вставить("Город", СокрЛП(АдресРезультат.Город + " " + строка(АдресРезультат.ГородСокращение)));
	СтруктураАдресРегистрации.Вставить("НаселенныйПункт", СокрЛП(строка(АдресРезультат.НаселенныйПункт) + " " + строка(АдресРезультат.НаселенныйПунктСокращение)));
	СтруктураАдресРегистрации.Вставить("Улица", СокрЛП(АдресРезультат.Улица + " " + строка(АдресРезультат.УлицаСокращение)));
	СтруктураАдресРегистрации.Вставить("Дом", СокрЛП(АдресРезультат.Здание.Номер));	
	СтруктураАдресРегистрации.Вставить("корпус", ?(ЗначениеЗаполнено(АдресРезультат.Корпуса), СокрЛП(АдресРезультат.Корпуса[0].Номер),""));   
	СтруктураАдресРегистрации.Вставить("Квартира", ?(ЗначениеЗаполнено(АдресРезультат.Помещения), СокрЛП(АдресРезультат.Помещения[0].Номер),"")); 
	
	если объектЛицевойСчет <> неопределено и ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_ЛицевыеСчета") тогда
		
		если СокрЛП(СтруктураАдресРегистрации.корпус) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.корпус = объектЛицевойСчет.Здание.Корпус;
		конецесли; 	
		если СокрЛП(СтруктураАдресРегистрации.Улица) = "" тогда
			СтруктураАдресРегистрации.Улица = СокрЛП(объектЛицевойСчет.УлицаЛицевогоСчета);
		конецесли;	
		если СокрЛП(СтруктураАдресРегистрации.Дом) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.Дом = объектЛицевойСчет.Здание.Наименование;
		конецесли;	
		если СокрЛП(СтруктураАдресРегистрации.Дом) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.Квартира = объектЛицевойСчет.Квартира.Наименование;
		конецесли;	
		
	конецесли;	  
	
	возврат СтруктураАдресРегистрации; 
	
КонецФункции // ПолучитьАдресБСП()

Функция ПолучитьКоличествоЭлементовСтруктуры(Структура)
	Счетчик = 0;
	Если ЗначениеЗаполнено(Структура) Тогда
		Для Каждого Колонка Из Структура Цикл
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;
	Возврат Счетчик;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерДома(Строка)
	
	ИсхДанные     = СокрЛП(Строка);
	
	ВхождениеДома = СтрНайти(ВРЕГ(ИсхДанные), "Д." );
	
	Если ВхождениеДома > 0 Тогда
		
		КоличествоСимволов = (СтрДлина(ИсхДанные) - ВхождениеДома - 1);
		Дом = Прав(ИсхДанные, КоличествоСимволов);
		
		ВхождениеКорпуса = СтрНайти(ВРЕГ(Дом), "КОРП.");
		
		Если ВхождениеКорпуса > 0 Тогда
			
			ДомБезКорпуса = Лев(Дом, ВхождениеКорпуса - 1);
			Возврат ДомБезКорпуса; 
			
		КонецЕсли;
		
		
		Возврат Дом;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерКорпуса(Строка)
	
	ИсхДанные     = СокрЛП(Строка);
	
	ВхождениеКорпуса = СтрНайти(ВРЕГ(ИсхДанные), "КОРП.");
	
	Если ВхождениеКорпуса = 0 Тогда 
		ВхождениеКорпуса = СтрНайти(ВРЕГ(ИсхДанные), "К.");
	КонецЕсли;
	
	
	Если ВхождениеКорпуса > 0 Тогда
		КоличествоСимволов = (СтрДлина(ИсхДанные) - ВхождениеКорпуса - 4);
		Корпус = Прав(ИсхДанные, КоличествоСимволов);
		Возврат Корпус;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерКвартиры(Строка)
	
	ИсхДанные     = СокрЛП(Строка);
	
	ВхождениеКвартиры = СтрНайти(ВРЕГ(ИсхДанные), "КВ.");
	
	Если ВхождениеКвартиры > 0 Тогда
		КоличествоСимволов = (СтрДлина(ИсхДанные) - ВхождениеКвартиры - 4);
		Квартира = Прав(ИсхДанные, КоличествоСимволов);
		Возврат Квартира;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьСнимаемыхСРегистрации()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры КАК ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения КАК СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних";
	Запрос.УстановитьПараметр("Момент", ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Рез = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		Стр = Новый Структура;
		Стр.Вставить("Проживающий", Выборка.ФизЛицо);
		Стр.Вставить("ДатаРегистрации", Выборка.ДатаРегистрации );
		
		Рез.Добавить(Стр);
		
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

&НаСервере
Функция СнятиеСРегистрации(ВидОперации)
	
	Возврат	ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета;
	
КонецФункции

&НаКлиенте
Процедура УдостоверениеЛичностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.РегистрируемоеЛицо) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не указанно регистрируемо лицо");
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РедактированиеИзДокумента", Истина);
	
	СтруктураКлючЗаписи = Новый Структура;
	СтруктураКлючЗаписи.Вставить("ФизЛицо", Объект.РегистрируемоеЛицо);
	СтруктураКлючЗаписи.Вставить("Период" , Объект.Дата);
	
	ДобавитьКлючЗаписи(ПараметрыФормы, СтруктураКлючЗаписи, "бит_ПаспортныеДанныеПроживающих");
	
	ОткрытьФорму("РегистрСведений.бит_ПаспортныеДанныеПроживающих.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,
	ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СвидетельствоОСмертиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.РегистрируемоеЛицо.Пустая() Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указанно регистрируемо лицо";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РедактированиеИзДокумента", Истина);
	
	СтруктураКлючЗаписи = Новый Структура;
	СтруктураКлючЗаписи.Вставить("ФизЛицо", Объект.РегистрируемоеЛицо);
	
	ДобавитьКлючЗаписи(ПараметрыФормы, СтруктураКлючЗаписи, "бит_СвидетельстваОСмерти");
	
	ОткрытьФорму("РегистрСведений.бит_СвидетельстваОСмерти.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,
	ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьКлючЗаписи(ПараметрыФормы, СтруктураКлючЗаписи, ИмяРегистра)
	
	МенеджерРегистра = РегистрыСведений[ИмяРегистра];
	Запись           = МенеджерРегистра.СоздатьМенеджерЗаписи();
	
	Для каждого Измерение Из СтруктураКлючЗаписи Цикл
		Запись[Измерение.Ключ] = Измерение.Значение;
	КонецЦикла; 
	
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		КлючЗаписи = МенеджерРегистра.СоздатьКлючЗаписи(СтруктураКлючЗаписи);
		
		ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
		
	Иначе
		Для каждого Измерение Из СтруктураКлючЗаписи Цикл
			ПараметрыФормы.Вставить(Измерение.Ключ, Измерение.Значение);
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура РегистрируемоеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ Объект.РегистрируемоеЛицо = ВыбранноеЗначение Тогда
		
		Объект.СвидетельствоОСмерти  = Неопределено;
		Объект.СменаФамилииНа        = Неопределено;
		Объект.УдостоверениеЛичности = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткудаПрибылИзЛСПриИзменении(Элемент) 
	
	ИзменитьОткудаПрибылИзЛС();	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОткудаПрибылИзЛС()
	
	Если Объект.ОткудаПрибылИзЛС  Тогда
		
		ОткудаПрибылАдресПред = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0];
		ЗаполнитьОткудаПрибылАдресИзКарточкиПроживающего(ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0], Объект.РегистрируемоеЛицо);
		КонтактнаяИнформацияПолеОткудаПрибылПредставление = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1].Представление);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		АдресЛицСчет = Объект.ЛицевойСчет.Ссылка.Здание.КонтактнаяИнформация[0];	
		ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].Значение = АдресЛицСчет.Значение;
		Представление = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(АдресЛицСчет.Представление);
		КонтактнаяИнформацияПолеОткудаПрибылПредставление = Представление;
		Объект.ОткудаПрибылАдрес = Представление;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КудаВыписанИзЛСПриИзменении(Элемент)
	
	ИзменитьКудаВыписанИзЛС();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьКудаВыписанИзЛС()
	
	
	Если Объект.КудаВыписанИзЛС Тогда
		
		КудаВЫписанАдресПред = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1];
		
		ЗаполнитьКудаВыписанАдресИзКарточкиПроживающего(ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1], Объект.РегистрируемоеЛицо);
		
		КонтактнаяИнформацияПолеКудаВыписанПредставление = бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].Представление);
	ИначеЕсли ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		АдресЛицСчет = Объект.ЛицевойСчет.Ссылка.Здание.КонтактнаяИнформация[0];	
		ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[1].Значение = АдресЛицСчет.Значение;
		Представление =  бит_УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(АдресЛицСчет.Представление);
		КонтактнаяИнформацияПолеКудаВыписанПредставление = Представление;
		Объект.КудаВыписанАдрес = Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьРегПМЖ()
	Возврат Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства;	
КонецФункции

Функция ПроверитьРегПМП()
	Возврат Объект.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуПребывания;	
КонецФункции

&НаСервере
Процедура КудаВыписанКонтактнаяИнформацияНаСервере()
	
	Если Объект.ЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
		
		Строки = Объект.ЛицевойСчет.Здание.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если Строки.количество() = 0 Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для п.8: перезаполните почтовый адрес в справочнике ""Список зданий"".");
			
		Иначе
			
			КонтактнаяИнформацияПолеКудаВыписанПредставление = Строки[0].Представление + ", квартира " + Объект.ЛицевойСчет.Квартира;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОткудаПрибылКонтактнаяИнформацияНаСервере()
	
	Если Объект.ЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
		
		Строки = Объект.ЛицевойСчет.Здание.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если Строки.количество() = 0 Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для п.8: перезаполните почтовый адрес в справочнике ""Список зданий"".");
			
		Иначе
			
			КонтактнаяИнформацияПолеОткудаПрибылПредставление = Строки[0].Представление + ", квартира " + Объект.ЛицевойСчет.Квартира;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&наСервереБезКонтекста
Процедура ЗаполнитьАдресИзЛицевогоСчета(Приемник, ЛицевойСчет)
	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	
	бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей, ЛицевойСчет.Здание);
	
	НаборЗаписей.Отбор.Тип.Установить(Перечисления.бит_ТипыКонтактнойИнформации.Адрес, Истина);
	НаборЗаписей.Отбор.Вид.Установить(Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания, Истина);
	
	НаборЗаписей.Прочитать();
	
	Попытка
		ЗаписьАдрес = НаборЗаписей[0];
	Исключение
		ЗаписьАдрес = Неопределено;
		
	КонецПопытки;
	
	Приемник = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ЗаписьАдрес);
	
	Приемник = Приемник + Строка(ЛицевойСчет.Квартира);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьОткудаПрибылАдресИзКарточкиПроживающего(Приемник, Проживающий)
	
	Адрес = ПолучитьАдресОткудаПрибыл(Проживающий);
	
	Если Адрес <> Неопределено Тогда
		Приемник.Значение = Адрес[0].Значение;
		Приемник.Представление = Адрес[0].Представление;	
	Иначе 
		Приемник.Значение = "";
		Приемник.Представление = "";
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаполнитьКудаВыписанАдресИзКарточкиПроживающего(Приемник, Проживающий)
	
	Адрес = ПолучитьАдресКудаВыписан(Проживающий);
	Если Адрес <> Неопределено Тогда
		Приемник.Значение = Адрес[0].Значение;
		Приемник.Представление = Адрес[0].Представление;
	Иначе 
		Приемник.Значение = "";
		Приемник.Представление = "";
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста 
Функция ПолучитьАдресОткудаПрибыл(Проживающий)
	
	ЗапросАдрес = Новый Запрос;
	
	ЗапросАдрес.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеКонтактнаяИнформация.Значение КАК Значение,
	|	бит_ПроживающиеКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
	|ГДЕ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка.Ссылка = &Ссылка
	|	И бит_ПроживающиеКонтактнаяИнформация.Вид = &Вид";
	
	ЗапросАдрес.УстановитьПараметр("Ссылка", Проживающий);
	ЗапросАдрес.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресПрибытия);
	Результат = ЗапросАдрес.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАдресКудаВыписан(Проживающий)
	
	ЗапросАдрес = Новый Запрос;
	
	ЗапросАдрес.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеКонтактнаяИнформация.Представление КАК Представление,
	|	бит_ПроживающиеКонтактнаяИнформация.Значение КАК Значение
	|ИЗ
	|	Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
	|ГДЕ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка.Ссылка = &Ссылка
	|	И бит_ПроживающиеКонтактнаяИнформация.Вид = &Вид";
	
	ЗапросАдрес.УстановитьПараметр("Ссылка", Проживающий);
	ЗапросАдрес.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресУбытия);
	
	Результат = ЗапросАдрес.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьНименованиеЛицевогоСчета(Знач ЛицевойСчет)
	
	Возврат ЛицевойСчет.Наименование;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДокументыПоЛицевомуСчету(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПравоустанавливающиеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ПравоустанавливающиеДокументы.бит_ЛицевойСчет = &бит_ЛицевойСчет";
	
	Запрос.УстановитьПараметр("бит_ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ЛицевойСчетПриИзмененииНаСервере();
	ОбновитьПравоустанавливающиеДокументы();
	//Обновляется табличная часть СнимаемыеСРег и Регистрируемое лицо документа	
	Если СнятиеСРегистрации(Объект.ВидОперации) Тогда
		ОбновитьСнимаемыхСРегистрации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	//Ограничение списка выбора правоустанавливающих документов по Лицевому счету	
	Если Не Объект.ЛицевойСчет.Пустая() Тогда				
		
		ПроживающиеПоЛС = ПолучитьПроживающихПоЛССДолей(Объект.ЛицевойСчет, Объект.Дата);
		
		Если ПроживающиеПоЛС.Количество()>0 Тогда
			Элементы.ОтветственныеЗаРегистрациюОтветственный.РежимВыбораИзСписка = Истина;
			Элементы.ОтветственныеЗаРегистрациюОтветственный.СписокВыбора.ЗагрузитьЗначения(ПроживающиеПоЛС);
		Иначе
			Элементы.ОтветственныеЗаРегистрациюОтветственный.РежимВыбораИзСписка = Ложь;
			Элементы.ОтветственныеЗаРегистрациюОтветственный.СписокВыбора.Очистить();
		КонецЕсли;
		
		мСобственники = ПолучитьВладельцаКвартирыПоЛС(Объект.ЛицевойСчет, КонецДня(Объект.Дата));
		
		//Автозаполнение ответственного по собственнику
		ТЗСобственники = Новый ТаблицаЗначений;
		ТЗСобственники.Колонки.Добавить("НомерСтроки");
		ТЗСобственники.Колонки.Добавить("Ответственный");
		
		Индекс = 0;
		
		Для Каждого Собственник Из мСобственники Цикл
			
			СтрокаТЗ = ТЗСобственники.Вставить(Индекс);
			СтрокаТЗ.НомерСтроки = Индекс;
			СтрокаТЗ.Ответственный = Собственник;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		Объект.ОтветственныеЗаРегистрацию.Загрузить(ТЗСобственники);
		
		//Установка адерса лицевого счета
		ЭтаФорма.АдресЛицевойСчет = ПолучитьУлицуЛицевогоСчета(Объект.ЛицевойСчет);
		
		//Заполнение орган ФМС Куда Прибыл
		Объект.ОрганФМСКудаПрибыл = Объект.ЛицевойСчет.Здание.ПаспортнаяСлужба;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ПроцедурыПодсистемыКонтактнаяИнформация

//СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) экспорт
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры

&НаСервере
Процедура РазместитьКонтактнуюИнформацию()
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИсключаемыеВиды = Новый Массив;
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.КудаВыписанПредставление);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ОткудаПрибылПредставление);
	
	ДополнительныеПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметрыКонтактнойИнформации.ОтложеннаяИнициализация = Ложь;
	ДополнительныеПараметрыКонтактнойИнформации.ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ДополнительныеПараметрыКонтактнойИнформации.ИсключаемыеВиды = ИсключаемыеВиды;
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметрыКонтактнойИнформации);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация	
КонецПроцедуры

&НаКлиенте
Процедура ОткудаПрибылПредставлениеПриИзменении(Элемент)
	
	РазместитьКонтактнуюИнформацию();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткудаПрибылПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	РазместитьКонтактнуюИнформацию();	
	
КонецПроцедуры

&НаКлиенте
Процедура КудаВыписанПредставлениеПриИзменении(Элемент)
	
	РазместитьКонтактнуюИнформацию();	
	
КонецПроцедуры

&НаКлиенте
Процедура СвПоМестуПребывания(Команда)
	
	ПодчиненныйДокумент = НайтиПодчиненныйДокумент(Объект.Ссылка);
	
	Если ПодчиненныйДокумент <> Неопределено Тогда
		
		ОткрытьФорму("Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания.Форма.ФормаДокументаУправляемая",Новый Структура("Ключ",ПодчиненныйДокумент), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиПодчиненныйДокумент(Основание)
	
	Перем ПодчиненныйДокумент;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Ссылка КАК ПодчиненныйДокумент
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	|ГДЕ
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование = &ДокументОснование
	|	И НЕ бит_СвидетельствоОРегистрацииПоМестуПребывания.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПодчиненныйДокумент = Выборка.ПодчиненныйДокумент;
	КонецЕсли;
	
	Возврат ПодчиненныйДокумент;
	
КонецФункции

&НаСервере
Функция НайтиПодчиненныйДокументПроживание(Основание)
	
	Перем ПодчиненныйДокумент;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_СвидетельствоОРегистрацииПоМестуПроживания.Ссылка КАК ПодчиненныйДокумент
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК бит_СвидетельствоОРегистрацииПоМестуПроживания
	|ГДЕ
	|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование = &ДокументОснование
	|	И НЕ бит_СвидетельствоОРегистрацииПоМестуПроживания.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПодчиненныйДокумент = Выборка.ПодчиненныйДокумент;
	КонецЕсли;
	
	Возврат ПодчиненныйДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеИзКонтактнойИнформации(Тип, Вид)
	
	ТипВЗапросе = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;;
	ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего;;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|ГДЕ
	|	бит_КонтактнаяИнформация.Объект = &Объект
	|	И бит_КонтактнаяИнформация.Тип = &Тип
	|	И бит_КонтактнаяИнформация.Вид = &Вид");
	
	Запрос.УстановитьПараметр("Объект", Объект.РегистрируемоеЛицо.Ссылка);
	Запрос.УстановитьПараметр("Тип"   , ТипВЗапросе);
	Запрос.УстановитьПараметр("Вид"   , ВидВЗапросе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредставлениеАдреса = "";
	
	Если Выборка.Следующий() Тогда
		
		ПредставлениеАдреса = Выборка.Представление;
		
	КонецЕсли;
	
	Возврат ПредставлениеАдреса;
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

Функция ПолучитьАдресДляСправки (стрАдреса)
	
	строкаАдреса = "";
	
	попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(стрАдреса);
		address = ПрочитатьJSON(ЧтениеJSON, ложь);	
		ЧтениеJSON.Закрыть();
	исключение
		возврат ""; 
	конецпопытки; 
	
	если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "area") = истина тогда
		строкаАдреса = строкаАдреса + строка(address.area);  	  
	конецесли;
	
	если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "areaType") = истина тогда
		строкаАдреса = строкаАдреса + " " + строка(address.areaType);  	  
	конецесли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "munDistrict") = Истина Тогда
		строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса) + " " + строка(address.munDistrict);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "district") = истина тогда
		строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса) + " " + строка(address.district); 	
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "munDistrictType") = Истина Тогда
		строкаАдреса = строкаАдреса + " " + строка(address.munDistrictType);		
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "districtType") = истина тогда
		строкаАдреса = строкаАдреса + " " + строка(address.districtType); 
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "district") = истина тогда
			строкаАдреса = строкаАдреса + " р-н"; 
	КонецЕсли;
	
	если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "city") = истина тогда
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "districtType") = истина тогда
			строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса);  
		конецесли;       	  
		строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса) + " " + строка(address.city);  	  
	конецесли;
	
	если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "cityType") = истина тогда
		строкаАдреса = строкаАдреса + " " + строка(address.cityType);  	  
	конецесли;
	
	если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(address, "locality") = истина тогда
		строкаАдреса = строкаАдреса + ДобавитьРазделитель(строкаАдреса) + " " + строка(address.locality);  	  
	конецесли;
	
	возврат строкаАдреса;	
	
конецфункции	

// БИТ ЖКХ 27.01.2021
функция ДобавитьРазделитель(ЗначениеИзСтроки)
	
	если ЗначениеЗаполнено(ЗначениеИзСтроки) = истина тогда
		возврат ",";
	конецесли;
	
конецфункции

Функция ПолучитьВладельцаКвартирыПоЛС(Знач ЛицевойСчет,Знач Дата)
	ЗапросСобственник = Новый Запрос;
	ЗапросСобственник.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры КАК ВладелецКвартиры,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Ссылка КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&ДатаСреза, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет" ;
	
	ЗапросСобственник.УстановитьПараметр("ДатаСреза", Дата);
	ЗапросСобственник.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	ВыборкаСобственник = ЗапросСобственник.Выполнить().Выбрать();
	
	Собственники = Новый Массив;
	
	Пока ВыборкаСобственник.Следующий() Цикл
		Собственники.Добавить(ВыборкаСобственник.ФизЛицо);	
	КонецЦикла;
	
	Возврат Собственники;	
	
КонецФункции

&НаКлиенте
Процедура ЗаконныйПредставительВСвязиСНедееспособностьюПриИзменении(Элемент)
	
	Если Объект.ЗаконныйПредставительВСвязиСНедееспособностью тогда
		
		ЗаконныйПредставительЗаполнить(Объект.РегистрируемоеЛицо);
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Истина;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Истина;
		
	ИначеЕсли НЕ ПроверитьВозраст(Объект.РегистрируемоеЛицо) тогда
		
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Ложь;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Ложь;
		
		Объект.ЗаконныйПредставитель = Неопределено;   
		Объект.СтепеньРодстваЗаконногоПредставителя = Неопределено;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегистрируемоеЛицоПриИзменении(Элемент)
	
	Если ПроверитьВозраст(Объект.РегистрируемоеЛицо) Тогда
		
		ЗаконныйПредставительЗаполнить(Объект.РегистрируемоеЛицо);
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Истина;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Истина;
		
	ИначеЕсли НЕ Объект.ЗаконныйПредставительВСвязиСНедееспособностью Тогда
		
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Ложь;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Ложь;
		
		Объект.СтепеньРодстваЗаконногоПредставителя = Неопределено;
		Объект.ЗаконныйПредставитель = Неопределено;
		
	КонецЕсли;
	
	УстановитьДатуСнятия(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
	УстановитьДатуРегистрации(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
	ЗаполнитьСвидетельствоОСмерти(Объект.РегистрируемоеЛицо);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвидетельствоОСмерти(Проживающий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_СвидетельстваОСмерти.ФизЛицо КАК ФизЛицо,
	|	бит_СвидетельстваОСмерти.ДатаВыдачи КАК ДатаВыдачи,
	|	бит_СвидетельстваОСмерти.ДатаСмерти КАК ДатаСмерти,
	|	бит_СвидетельстваОСмерти.ДатаСоставления КАК ДатаСоставления,
	|	бит_СвидетельстваОСмерти.УдалитьКемВыдано КАК УдалитьКемВыдано,
	|	бит_СвидетельстваОСмерти.Номер КАК Номер,
	|	бит_СвидетельстваОСмерти.СерияСвидетельства КАК СерияСвидетельства,
	|	бит_СвидетельстваОСмерти.НомерСвидетельства КАК НомерСвидетельства,
	|	бит_СвидетельстваОСмерти.КемВыдано КАК КемВыдано
	|ИЗ
	|	РегистрСведений.бит_СвидетельстваОСмерти КАК бит_СвидетельстваОСмерти
	|ГДЕ
	|	бит_СвидетельстваОСмерти.ФизЛицо = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо", Проживающий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Объект.СвидетельствоОСмерти = "а/з " + Выборка.Номер + ", от " + Формат(Выборка.ДатаСоставления,"ДФ='дд ММММ гггг'; ДП='Не указано'")+", " 
		+ Выборка.КемВыдано + ", свидетельство о смерти " + Выборка.СерияСвидетельства
		+ ", №" + Выборка.НомерСвидетельства + ", " + Выборка.КемВыдано 
		+ ", от " + Формат(Выборка.ДатаВыдачи,"ДФ='дд ММММ гггг'; ДП='Не указано'");
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуСнятия(Знач ЛицевойСчет, Знач Проживающий)
	
	ДатаСнятия =  ПолучитьДатуСнятияСРегистрации(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
	Объект.ДатаСнятияСРегистрации =  ДатаСнятия;
	Объект.ДатаУбытия = ДатаСнятия;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьДатуРегистрации(Знач ЛицевойСчет, Знач Проживающий)
	
	ДатаРегистрации =  ПолучитьДатуРегистрации(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
	Объект.ДатаРегистрации =  ДатаРегистрации;
	Объект.ДатаПрибытия = ДатаРегистрации;

	
КонецПроцедуры


&НаСервере
Функция ПроверитьВозраст(РегистрируемоеЛицо)
	ЗапросВозраст = Новый Запрос;
	ЗапросВозраст.Текст = "ВЫБРАТЬ
	|	бит_Проживающие.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.бит_Проживающие КАК бит_Проживающие
	|ГДЕ
	|	бит_Проживающие.Ссылка = &Ссылка";
	ЗапросВозраст.УстановитьПараметр("Ссылка", РегистрируемоеЛицо);
	
	Выборка = ЗапросВозраст.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		
		ДатаРождения = Выборка.ДатаРождения;
		
		Возраст = Год(Объект.Дата) - Год(ДатаРождения);	
		
		ДеньДокумент = День(Текущаядата());
		МесяцДокумент = Месяц(ТекущаяДата());
		
		ДеньРождения = День(ДатаРождения);
		МесяцРождения = Месяц(ДатаРождения);
		
		Если МесяцРождения < МесяцДокумент ИЛИ (МесяцРождения = МесяцДокумент И ДеньРождения > ДеньДокумент) Тогда
			
			Возраст = Возраст - 1;
			
		КонецЕсли;
		
		Возврат (Возраст < 14);
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьВозрастПоДате(ДатаРождения)
				
		Возраст = Год(Объект.Дата) - Год(ДатаРождения);	
		
		ДеньДокумент = День(Текущаядата());
		МесяцДокумент = Месяц(ТекущаяДата());
		
		ДеньРождения = День(ДатаРождения);
		МесяцРождения = Месяц(ДатаРождения);
		
		Если МесяцРождения < МесяцДокумент ИЛИ (МесяцРождения = МесяцДокумент И ДеньРождения > ДеньДокумент) Тогда
			
			Возраст = Возраст - 1;
			
		КонецЕсли;
		
		Возврат (Возраст < 14);
	
КонецФункции

&НаСервере
Процедура ЗаконныйПредставительЗаполнить(РегистрируемоеЛицо)
	
	ЗапросЗаконныйПредставитель = Новый Запрос;
	ЗапросЗаконныйПредставитель.Текст = " ВЫБРАТЬ
	|	бит_Проживающиебит_ЗаконныеПредставители.Проживающий КАК Проживающий,
	|	бит_Проживающиебит_ЗаконныеПредставители.СтепеньРодства КАК СтепеньРодства
	|ИЗ
	|	Справочник.бит_Проживающие.бит_ЗаконныеПредставители КАК бит_Проживающиебит_ЗаконныеПредставители
	|ГДЕ
	|	бит_Проживающиебит_ЗаконныеПредставители.Ссылка.Ссылка = &Ссылка
	|	И бит_Проживающиебит_ЗаконныеПредставители.НомерСтроки = 1";
	
	ЗапросЗаконныйПредставитель.УстановитьПараметр("Ссылка", РегистрируемоеЛицо);
	
	ВыборкаЗаконныйПредставитель = ЗапросЗаконныйПредставитель.Выполнить().Выбрать();
	
	Если ВыборкаЗаконныйПредставитель.Следующий() тогда 
		Объект.ЗаконныйПредставитель = ВыборкаЗаконныйПредставитель.Проживающий;
		Объект.СтепеньРодстваЗаконногоПредставителя = ВыборкаЗаконныйПредставитель.СтепеньРодства;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаРегистрациюОтветственныйПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элементы.ОтветственныеЗаРегистрацию.ТекущиеДанные.СтепеньРодства) Тогда
		Элементы.ОтветственныеЗаРегистрацию.ТекущиеДанные.СтепеньРодства = ПолучитьСтепеньРодства(Элементы.ОтветственныеЗаРегистрацию.ТекущиеДанные.Ответственный);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПравоустанавливающиеДокументы()
	
	мОтветственные = Новый Массив;	
	
	Для Каждого Ответственный Из Объект.ОтветственныеЗаРегистрацию Цикл		
		мОтветственные.Добавить(Ответственный.Ответственный);	
	КонецЦикла;
	
	ЗапросДокиНаЛицевом = Новый Запрос;
	ЗАпросДокиНаЛицевом.Текст = "ВЫБРАТЬ
	|	бит_ПравоустанавливающиеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ПравоустанавливающиеДокументы.бит_Проживающий В(&Ответственные)
	|	И бит_ПравоустанавливающиеДокументы.бит_ЛицевойСчет = &ЛицевойСчет";
	ЗапросДокиНаЛицевом.УстановитьПараметр("Ответственные", мОтветственные);
	ЗапросДокиНаЛицевом.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	ВыборкаДокументыНаЛицевом = ЗапросДокиНаЛицевом.Выполнить().Выбрать();
	
	ПДокиПоЛицСчету = Новый Массив;
	
	Пока ВыборкаДокументыНаЛицевом.Следующий() Цикл
		
		ПДокиПоЛицСчету.Добавить(ВыборкаДокументыНаЛицевом.Ссылка);
		
	КонецЦикла;
	
	
	ДокументыВТЧ = Новый Массив;
	
	СтруктураДокументыВТЧ = Новый Структура;
	СтруктураДокументыВТЧ.Вставить("Документ");
	СтруктураДокументыВТЧ.Вставить("НомерСтроки");
	
	Для Каждого Строка Из Объект.ПравоустанавливающиеДокументы Цикл
		СтруктураДокументыВТЧ.Документ = Строка.Документ;
		СтруктураДокументыВТЧ.НомерСтроки = Строка.НомерСтроки;
		ДокументыВТЧ.Добавить(СтруктураДокументыВТЧ);	
	КонецЦикла;
	
	Индекс = 0;
	
	ТЗДокументы = Новый ТаблицаЗначений;
	ТЗДокументы.Колонки.Добавить("Документ");
	ТЗДокументы.Колонки.Добавить("Проживающий");
	
	Для Каждого Документ Из  ПДокиПоЛицСчету Цикл
		
		СтрокаТЗ =  ТЗДокументы.Вставить(Индекс);
		СтрокаТЗ.Документ = Документ;
		СтрокаТЗ.Проживающий = Документ.бит_Проживающий;
		
		Индекс = Индекс + 1;	
		
	КонецЦикла;
	
	Объект.ПравоустанавливающиеДокументы.Загрузить(ТЗДокументы);
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСнимаемыхСРегистрации()
	
	мСнимаемыеСРег = Новый Массив;
	мСнимаемыеСРег = ПолучитьВсехПроживающихПоЛС(Объект.ЛицевойСчет);
	
	ТЗСнимаемыеСРег = Новый ТаблицаЗначений;
	ТЗСнимаемыеСРег.Колонки.Добавить("Проживающий");
	ТЗСнимаемыеСРег.Колонки.Добавить("ДатаРегистрации");
	
	Индекс = 0;
	
	Если мСнимаемыеСРег.Количество() > 0 Тогда
		
		Для Каждого Элемент Из  мСнимаемыеСРег Цикл
			
			СтрокаТЗ =  ТЗСнимаемыеСРег.Вставить(Индекс);
			
			СтрокаТЗ.Проживающий = Элемент.Проживающий;
			СтрокаТЗ.ДатаРегистрации = Элемент.ДатаРегистрации;
			
			Индекс = Индекс + 1;	
			
		КонецЦикла;
		
		Объект.СнимаемыеСРегУчета.Загрузить(ТЗСнимаемыеСРег);
		Объект.РегистрируемоеЛицо = ТЗСнимаемыеСРег[0].Проживающий;
		УстановитьДатуСнятия(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
		
	Иначе
		Объект.СнимаемыеСРегУчета.Очистить();
		Объект.РегистрируемоеЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ДобавитьПравоустанавливающиеДокументыПоОтветсвтенному(Ответственный)               
	
	мДокументы = ПолучитьДокументыПоОтветственному(Ответственный, Объект.ЛицевойСчет);
	
	ТЗДокументы = Новый ТаблицаЗначений;
	ТЗДокументы.Колонки.Добавить("Документ");
	ТЗДокументы.Колонки.Добавить("Проживающий");
	
	Индекс = ?(Объект.ПравоустанавливающиеДокументы.Количество()>0,  Объект.ПравоустанавливающиеДокументы.Количество(), 0);
	
	Для Каждого Строка Из мДокументы Цикл
		
		СтрокаТЗ =  Объект.ПравоустанавливающиеДокументы.Вставить(Индекс);
		СтрокаТЗ.Документ = Строка;
		СтрокаТЗ.Проживающий = Строка.бит_Проживающий;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДокументыПоОтветственному(Ответственный, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  " ВЫБРАТЬ
	|	бит_ПравоустанавливающиеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ПравоустанавливающиеДокументы.бит_ЛицевойСчет = &ЛицевойСчет
	|	И бит_ПравоустанавливающиеДокументы.бит_Проживающий = &Проживающий" ;
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Проживающий", Ответственный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСтепеньРодства(ОтветственныйЗаРегистрацию)
	//Должен быть запрос
	
	Возврат Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
	
	
КонецФункции

Функция ПолучитьУлицуЛицевогоСчета(ЛицевойСчет)
	
	ЗапросАдрес = Новый Запрос;
	ЗапросАдрес.Текст = "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
	
	ЗапросАдрес.УстановитьПараметр("Ссылка", ЛицевойСчет);
	ВыборкаАдрес = ЗапросАдрес.Выполнить().Выбрать();
	
	Если ВыборкаАдрес.Следующий() Тогда
		Возврат ВыборкаАдрес.УлицаЛицевогоСчета;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста                                              
Функция УбратьПоследнийСимвол(Строка, Символ)
	ПосЗапятая = СтрНайти(Строка, Символ, НаправлениеПоиска.СКонца);
	Если ПосЗапятая>0 Тогда
		Возврат Лев(Строка, ПосЗапятая-1);
	КонецЕсли;
	
	Возврат Строка;
КонецФункции

&НаКлиенте
Процедура ПравоустанавливающиеДокументыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ПравоустанавливающиеДокументыДокумент.СписокВыбора.Очистить();
	
	ПравоустанавливающиеДокументыПоОтветственным = ПолучитьДокументыПоОтветственным(Объект.Ссылка);	
	
	Если ПравоустанавливающиеДокументыПоОтветственным.Количество() > 0 Тогда	
		Для Каждого Стр Из ПравоустанавливающиеДокументыПоОтветственным Цикл
			Элементы.ПравоустанавливающиеДокументыДокумент.СписокВыбора.Добавить(Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДокументыПоОтветственным(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Различные
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ Ответственные
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОтветственныеЗаРегистрацию КАК бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖОтветственныеЗаРегистрацию.Ссылка.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПравоустанавливающиеДокументы.Ссылка КАК Документ,
	|	Ответственные.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ответственные КАК Ответственные
	|		ПО бит_ПравоустанавливающиеДокументы.бит_Проживающий = Ответственные.Ответственный
	|ГДЕ
	|	бит_ПравоустанавливающиеДокументы.бит_Проживающий = Ответственные.Ответственный";
	Запрос.УстановитьПараметр("Документ", Документ);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока ВыборкаДокументов.Следующий() Цикл
		Результат.Добавить(ВыборкаДокументов.Документ);	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПравоустанавливающиеДокументыДокументПриИзмененииНаСервере(Документ, _Проживающий)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПравоустанавливающиеДокументы.бит_Проживающий КАК Проживающий
	|ИЗ
	|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ПравоустанавливающиеДокументы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		_Проживающий = Выборка.Проживающий;
	КонецЕсли ;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПравоустанавливающиеДокументыДокументПриИзменении(Элемент)	
	ПравоустанавливающиеДокументыДокументПриИзмененииНаСервере(ЭтаФорма.Элементы.ПравоустанавливающиеДокументы.ТекущиеДанные.Документ, ЭтаФорма.Элементы.ПравоустанавливающиеДокументы.ТекущиеДанные.Проживающий);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаРегистрациюОтветственныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ОтветственныеЗаРегистрациюОтветственный.СписокВыбора.Очистить();
	
	Если Объект.ЗаконныйПредставительВСвязиСНедееспособностью ИЛИ ПроверитьВозраст(Объект.РегистрируемоеЛицо) Тогда
		ПроживающиеПоЛС = ПолучитьТекущихПроживающихПоЛС(Объект.ЛицевойСчет, Объект.Дата);
	Иначе	
		ПроживающиеПоЛС = ПолучитьПроживающихПоЛССДолей(Объект.ЛицевойСчет, Объект.Дата);
	КонецЕсли;	
	
	
	Если ПроживающиеПоЛС.Количество() = 0 Тогда 
		Сообщить("Не найдено проживающих с долей жилья закрепленных за лицевым счетом");
	Иначе
		Для каждого Стр Из ПроживающиеПоЛС Цикл
			Элементы.ОтветственныеЗаРегистрациюОтветственный.СписокВыбора.Добавить(Стр);		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ПолучитьИнициалы(Строка)
	
		//Если НЕ ПустаяСтрока(Строка) Тогда
		//	
		//	Если СтрНайти(Строка, ".") Тогда
		//		Возврат Строка;
		//	КонецЕсли;
		//	
		//	ФИО = СтрРазделить(Строка, " ", Ложь);
		//	
		//	Фамилия = "";
		//	
		//	Фамилия = ФИО[0];
		//	
		//	ФамилияИнициалы = Фамилия;
		//	
		//	Для Каждого Слово ИЗ ФИО Цикл
		//		
		//		Если Слово = Фамилия ИЛИ ВРег(Слово) = "ОГЛЫ" ИЛИ ВРег(Слово) = "КЫЗЫ"Тогда 
		//			Продолжить;
		//		Иначе
		//			ФамилияИнициалы = ФамилияИнициалы + " " + Лев(Слово, 1) + ".";
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//	
		//	Возврат ФамилияИнициалы;
		//КонецЕсли;
		
		Возврат  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(Строка));
								
КонецФункции

&НаКлиенте
Процедура ОтветственныеЗаРегистрациюПриИзменении(Элемент)
	ОбновитьПравоустанавливающиеДокументы();
КонецПроцедуры

&НаКлиенте
Процедура РегистрируемоеЛицоОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ПроверитьВозраст(Объект.РегистрируемоеЛицо) Тогда
		
		ЗаконныйПредставительЗаполнить(Объект.РегистрируемоеЛицо);
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Истина;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Истина;
		
	ИначеЕсли НЕ Объект.ЗаконныйПредставительВСвязиСНедееспособностью Тогда
		
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Ложь;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Ложь;
		
		Объект.СтепеньРодстваЗаконногоПредставителя = Неопределено;
		Объект.ЗаконныйПредставитель = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнимаемыеСРегУчетаПроживающийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СнимаемыеСРегистрации = ПолучитьВсехПроживающихПоЛС(Объект.ЛицевойСчет);
	
	Если СнимаемыеСРегистрации.Количество() > 0 Тогда 
		Элементы.СнимаемыеСРегУчетаПроживающий.СписокВыбора.Очистить();
		Для каждого Стр Из СнимаемыеСРегистрации Цикл
			Элементы.СнимаемыеСРегУчетаПроживающий.СписокВыбора.Добавить(Стр.Проживающий);		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнимаемыеСРегУчетаПриИзменении(Элемент)
	
	СнимаемыеСРегУчетаПриИзмененииНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура СнимаемыеСРегУчетаПриИзмененииНаСервере()
	
	Если Объект.СнимаемыеСРегУчета.Количество() > 0 Тогда 
		Объект.РегистрируемоеЛицо = Объект.СнимаемыеСРегУчета[0].Проживающий;
		УстановитьДатуСнятия(Объект.ЛицевойСчет, Объект.РегистрируемоеЛицо);
		
		Если Объект.ЗаконныйПредставительВСвязиСНедееспособностью ИЛИ ПроверитьВозраст(Объект.РегистрируемоеЛицо) тогда
		
			ЗаконныйПредставительЗаполнить(Объект.РегистрируемоеЛицо);
			ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Истина;
			ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Истина;
		
		Иначе 
			
			Объект.ЗаконныйПредставитель = Справочники.бит_Проживающие.ПустаяСсылка();
			ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Ложь;
			ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Истина;
		
		КонецЕсли;
	
	Иначе
		Объект.РегистрируемоеЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
		
		Объект.ЗаконныйПредставитель = Справочники.бит_Проживающие.ПустаяСсылка();
		ЭтаФорма.Элементы.ЗаконныйПредставитель.Доступность = Ложь;
		ЭтаФорма.Элементы.СтепеньРодстваЗаконногоПредставителя.Доступность = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнимаемыеСРегУчетаПроживающийПриИзменении(Элемент)
	
	Элементы.СнимаемыеСРегУчета.ТекущиеДанные.ДатаРегистрации = ПолучитьДатуРегистрации(Объект.ЛицевойСчет, Элементы.СнимаемыеСРегУчета.ТекущиеДанные.Проживающий);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуРегистрации(Знач ЛицевойСчет, Знач ФизЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И ФизЛицо = &ФизЛицо) КАК бит_ПроживающиеПоЛССрезПоследних ";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаРегистрации;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСнятияСРегистрации(Знач ЛицевойСчет, Знач ФизЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И ФизЛицо = &ФизЛицо) КАК бит_ПроживающиеПоЛССрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаСнятияСРегистрации;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

&НаСервере
Процедура РешениеСудаСозданиеНаСервере()
	
	
	ЛицевойСчет = Объект.ЛицевойСчет;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ЛицевойСчет", Объект.ЛицевойСчет);
	
	РешениеСуда = Справочники.бит_РешенияСудаОСнятииСРегУчета.СоздатьЭлемент();
	РешениеСуда.ЛицевойСчет = Объект.ЛицевойСчет;
	РешениеСуда.Наименование = "Создано из Заявления";
	РешениеСуда.Записать();
	
	Объект.РешениеСуда = РешениеСуда.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура РешениеСудаСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РешениеСудаСозданиеНаСервере();
	
	ОткрытьЗначение(Объект.РешениеСуда);
	
КонецПроцедуры

Функция ПолучитьМуниципальныйАдресБСП(объектЛицевойСчет = неопределено)
	
		СтруктураАдресРегистрации = Новый Структура;	
		СтруктураАдресРегистрации.Вставить("Страна", "");
		СтруктураАдресРегистрации.Вставить("Представление", "");
		СтруктураАдресРегистрации.Вставить("Регион", "");
		СтруктураАдресРегистрации.Вставить("Район", "");
		СтруктураАдресРегистрации.Вставить("Город", "");
		СтруктураАдресРегистрации.Вставить("НаселенныйПункт", "");
		СтруктураАдресРегистрации.Вставить("Улица", "");
		СтруктураАдресРегистрации.Вставить("Дом", "");
		СтруктураАдресРегистрации.Вставить("Корпус", "");
		СтруктураАдресРегистрации.Вставить("Квартира", "");

	если ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_ЛицевыеСчета") тогда 	
		если объектЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 тогда 	
			АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет.Здание.КонтактнаяИнформация[0].Значение); 					
		конецесли; 
	конецесли; 
	
	если ТипЗнч(объектЛицевойСчет) = Тип("Строка") тогда 
		АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет);
	конецесли; 
	
	если ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_СписокЗданий") тогда 
		АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет.КонтактнаяИнформация[0].Значение);
	конецесли;	 
	
	Если АдресРезультат = Неопределено Тогда
		
		Возврат СтруктураАдресРегистрации;	
		
	КонецЕсли;
	
	СтруктураАдресРегистрации.Страна = СокрЛП(АдресРезультат.Страна);
	СтруктураАдресРегистрации.Представление = АдресРезультат.Представление;	
	СтруктураАдресРегистрации.Регион = СокрЛП(АдресРезультат.Регион);
	Если ЗначениеЗаполнено(АдресРезультат.МуниципальныйРайон) Тогда
		
		СтруктураАдресРегистрации.Район = СокрЛП(АдресРезультат.МуниципальныйРайон+ " " + строка(АдресРезультат.МуниципальныйРайонСокращение));   
		
	ИначеЕсли ЗначениеЗаполнено(АдресРезультат.Район) Тогда 
		
		СтруктураАдресРегистрации.Район = СокрЛП(АдресРезультат.Район+ " " + строка(АдресРезультат.РайонСокращение));   
		
	КонецЕсли;
	
	
	СтруктураАдресРегистрации.Город = СокрЛП(АдресРезультат.Город + " " + строка(АдресРезультат.ГородСокращение));
	СтруктураАдресРегистрации.НаселенныйПункт = СокрЛП(строка(АдресРезультат.НаселенныйПункт) + " " + строка(АдресРезультат.НаселенныйПунктСокращение));
	СтруктураАдресРегистрации.Улица = СокрЛП(АдресРезультат.Улица + " " + строка(АдресРезультат.УлицаСокращение));
	СтруктураАдресРегистрации.Дом = СокрЛП(АдресРезультат.Здание.Номер);	
	СтруктураАдресРегистрации.Корпус = ?(ЗначениеЗаполнено(АдресРезультат.Корпуса), СокрЛП(АдресРезультат.Корпуса[0].Номер),"");   
	СтруктураАдресРегистрации.Квартира = ?(ЗначениеЗаполнено(АдресРезультат.Помещения), СокрЛП(АдресРезультат.Помещения[0].Номер),""); 
	
	если объектЛицевойСчет <> неопределено и ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_ЛицевыеСчета") тогда
		
		если СокрЛП(СтруктураАдресРегистрации.корпус) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.корпус = объектЛицевойСчет.Здание.Корпус;
		конецесли; 	
		если СокрЛП(СтруктураАдресРегистрации.Улица) = "" тогда
			СтруктураАдресРегистрации.Улица = СокрЛП(объектЛицевойСчет.УлицаЛицевогоСчета);
		конецесли;	
		если СокрЛП(СтруктураАдресРегистрации.Дом) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.Дом = объектЛицевойСчет.Здание.Наименование;
		конецесли;	
		если СокрЛП(СтруктураАдресРегистрации.Дом) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.Квартира = объектЛицевойСчет.Квартира.Наименование;
		конецесли;	
		
	конецесли;	  
	
	возврат СтруктураАдресРегистрации; 
	
КонецФункции // ПолучитьАдресБСП()

Функция ВысотаОбластиТабДока(ИзмеряемыйТабДок)
    МассивТабДоков = Новый Массив;
    МассивТабДоков.Добавить(ИзмеряемыйТабДок);
    
    ТабДок = Новый ТабличныйДокумент;
    ТекВысота = 512;
    ДобавВысота = 0;
    
    Пока Истина Цикл
        СтрТабДока = ТабДок.ПолучитьОбласть(,,1);
        СтрТабДока.ТекущаяОбласть.ВысотаСтроки = ТекВысота;
        МассивТабДоков.Добавить(СтрТабДока);
        
        Если ТабДок.ПроверитьВывод(МассивТабДоков) Тогда
            ДобавВысота = ДобавВысота + ТекВысота;
        Иначе    
            Если ТекВысота > 1 Тогда
                МассивТабДоков.Удалить(МассивТабДоков.ВГраница());
                ТекВысота = ТекВысота / 2;
            Иначе
                Прервать;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    ОбщВысота = 785;//вычислена ранее этой же функцией: ВысотаОбластиТабДока(Новый ТабличныйДокумент)
    Возврат ОбщВысота - ДобавВысота;
КонецФункции

#КонецОбласти