
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , "");
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаРаботы") Тогда
		
		Объект.Работа           = Параметры.ЗаполнитьИзСправочникаРаботы.Работа;
		Объект.ЕдиницаИзмерения = Параметры.ЗаполнитьИзСправочникаРаботы.ЕдиницаИзмерения;
		
		Элементы.Работа.ТолькоПросмотр = Истина;
		
	ИначеЕсли Параметры.Ключ.Проведен = Истина Тогда

		Элементы.Работа.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// вызов механизма разделения прав доступа
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ, СтандартнаяОбработка, ДокументОбъект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормыДокумента();
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("Подразделение, Работа, ЕдиницаИзмерения, ВидОбъекта");
	
	АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов);
	
	// Установить доступность формы с учетом даты запрета редактирования	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мСписокЕдиницИзмерения = ПолучитьСписокЕдиницИзмеренияНаСервере();
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Ссылка", мСписокЕдиницИзмерения);
	
	ОткрытьФорму("Документ.бит_УстановкаСоставаРаботы.Форма.ФормаВыбораСправочникаКлассификаторЕдиницИзмерения", Новый Структура("ОткрытьИзДокументаУстановкаСоставаРаботы", ПараметрыФормы), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		МассивЕдиницИзмерений = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЕдиницИзмеренийВХранилище);
		
		Если МассивЕдиницИзмерений.Количество() > 0 Тогда
			
			// БИТ_ЖКХ 17.09.2014
			//Объект.ЕдиницаИзмерения = МассивЕдиницИзмерений[0].Ссылка;		
			Объект.ЕдиницаИзмерения = МассивЕдиницИзмерений[0];		
			// БИТ_ЖКХ 17.09.2014
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мСписокПодразделений = ПолучитьСписокПодразделенийНаСервере();
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Ссылка", мСписокПодразделений);
	
	ОткрытьФорму("Справочник.бит_ПодразделенияОрганизаций.Форма.ФормаВыбораУправляемая", Новый Структура("ОткрытьИзДокументаУстановкаСоставаРаботы", ПараметрыФормы), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		МассивПодразделений = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодразделенийВХранилище);
		
		Если МассивПодразделений.Количество() > 0 Тогда
			
			Объект.Подразделение = МассивПодразделений[0].Ссылка;		
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаПриИзменении(Элемент)
	
	мКэшЗначений.мСписокЕдиницИзмерения = ПолучитьСписокЕдиницИзмеренияНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта"  , Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Дата"                  , Объект.Дата);
	КэшированныеЗначения.Вставить("мСписокЕдиницИзмерения", ПолучитьСписокЕдиницИзмеренияНаСервере());
	КэшированныеЗначения.Вставить("мСписокЕдиницИзмерения", ПолучитьСписокПодразделенийНаСервере());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(ДокументОбъект, ЭтаФорма, СтруктураРеквизитов);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЕдиницИзмеренияНаСервере()
	
	мСписокЕдиницИзмерения = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Объект.Работа) Тогда
		
		Для Каждого ТекСтрока Из Объект.Работа.ЕдиницыИзмерения Цикл
			
			мСписокЕдиницИзмерения.Добавить(ТекСтрока.ЕдиницаИзмерения);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат мСписокЕдиницИзмерения;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПодразделенийНаСервере()
	
	мСписокПодразделений = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Объект.Работа) Тогда
		
		Для Каждого ТекСтрока Из Объект.Работа.Подразделения Цикл
			
			мСписокПодразделений.Добавить(ТекСтрока.Подразделение);
			
		КонецЦикла;	
		
	КонецЕсли; 
	
	Возврат мСписокПодразделений;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

#КонецОбласти