#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Наименование) Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено наименование участка. Элемент не может быть записан!",Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен административный округ. Элемент не может быть записан!",Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли