#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФунции

Функция ОбновитьКэшДокумента(Объект) Экспорт
	
	мКэшЗначений = Новый Структура;
	мКэшЗначений.Вставить("Разрядность"                  , 0);
	мКэшЗначений.Вставить("ДатаПоверки"                  , Дата("00010101000000"));
	мКэшЗначений.Вставить("МестоУстановкиСчетчика"       , Справочники.бит_Комнаты.ПустаяСсылка());
	мКэшЗначений.Вставить("ИспользоватьСтавкуПоСчетчику" , Ложь);
	мКэшЗначений.Вставить("СчетчикСЗависимымиУслугами"   , Ложь);
	мКэшЗначений.Вставить("ИспользоватьПравилоУменьшения", Ложь);
	мКэшЗначений.Вставить("ТипСчетчика"                  , Перечисления.бит_ТипСчетчика.ПустаяСсылка());
	мКэшЗначений.Вставить("Квартира"                     , Справочники.бит_Квартиры.ПустаяСсылка());
	мКэшЗначений.Вставить("Улица"                        , Справочники.бит_СписокУлиц.ПустаяСсылка());
	мКэшЗначений.Вставить("Приоритет"                    , 0);
	мКэшЗначений.Вставить("СписокЛС"                     , Новый СписокЗначений);
	мКэшЗначений.Вставить("СписокУС"                     , Новый СписокЗначений);
	мКэшЗначений.Вставить("СписокЗданий"                 , Новый СписокЗначений);
	мКэшЗначений.Вставить("ТаблицаУслуг"                 , Новый ТаблицаЗначений);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"   , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Объект" , Объект.Объект);
	Запрос.УстановитьПараметр("Счетчик", Объект.Счетчик);
	
	СписокЛС     = Новый СписокЗначений;
	СписокУС     = Новый СписокЗначений;
	СписокЗданий = Новый СписокЗначений;
	
	Индивидуальный      = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
	КэшированиеЗначений = (НЕ Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки,
	|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик,
	|	бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку
	|ИЗ
	|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_ПоверкаСчетчиковСрезПоследних
	|ГДЕ
	|	(НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если КэшированиеЗначений Тогда
			мКэшЗначений.ДатаПоверки = Выборка.ДатаПоверки;
		ИНаче
			Объект.ДатаПоверки = Выборка.ДатаПоверки;
		КонецЕсли; 
	Иначе
		Объект.ДатаПоверки = Дата("00010101000000");
	КонецЕсли;
	
	Если Индивидуальный Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга,
		|	МАКСИМУМ(ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)) КАК НачальныеПоказания,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
		|				ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
		|			ИНАЧЕ ВЫБОР
		|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|					ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|				КОНЕЦ
		|		КОНЕЦ) КАК КонечныеПоказания
		|ПОМЕСТИТЬ Показания
		|ИЗ
		|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
		|			&Дата,
		|			Объект = &Объект
		|				И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|			&Дата,
		|			Объект = &Объект
		|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Счетчики.Счетчик КАК Счетчик,
		|	Счетчики.Услуга,
		|	Счетчики.СпособРасчета КАК СпособРасчета,
		|	Счетчики.СпособРаспределения КАК СпособРаспределения,
		|	Показания.НачальныеПоказания КАК НачальныеПоказания,
		|	Показания.КонечныеПоказания КАК КонечныеПоказания,
		|	Счетчики.Многотарифный КАК Многотарифный,
		|	Счетчики.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
		|	Счетчики.Приоритет КАК Приоритет
		|ИЗ
		|	Счетчики КАК Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ Показания КАК Показания
		|		ПО Счетчики.Счетчик = Показания.Счетчик
		|			И Счетчики.Услуга = Показания.Услуга
		|ИТОГИ
		|	МАКСИМУМ(СпособРасчета),
		|	МАКСИМУМ(СпособРаспределения),
		|	МАКСИМУМ(НачальныеПоказания),
		|	МАКСИМУМ(КонечныеПоказания),
		|	МАКСИМУМ(Многотарифный),
		|	МАКСИМУМ(МестоУстановкиСчетчика),
		|	МАКСИМУМ(Приоритет)
		|ПО
		|	Счетчик";
		
		ВыборкаСчетчики = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСчетчики.Следующий() Цикл
			
			Объект.СпособРасчета = ВыборкаСчетчики.СпособРасчета;
			Объект.Многотарифный = ВыборкаСчетчики.Многотарифный;
			
			Если НЕ ВыборкаСчетчики.Многотарифный Тогда
				Объект.НачальныеПоказания =  ВыборкаСчетчики.НачальныеПоказания;
				Объект.КонечныеПоказания  =  ВыборкаСчетчики.КонечныеПоказания;
			КонецЕсли;
			
			Объект.МестоУстановкиСчетчика = ВыборкаСчетчики.МестоУстановкиСчетчика;
			Объект.Приоритет              = ВыборкаСчетчики.МестоУстановкиСчетчика;
			
			Выборка = ВыборкаСчетчики.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если КэшированиеЗначений Тогда
					СписокУС.Добавить(Выборка.Услуга);
				Иначе
					НоваяСтрока = Объект.Услуги.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла;
		
	Иначе
		
		//Условие = "";
		//Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика Тогда
		//
		//	Условие = "И Объект = &Объект";
		//
		//КонецЕсли; 
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга,
		|	МАКСИМУМ(ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)) КАК НачальныеПоказания,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
		|				ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
		|			ИНАЧЕ ВЫБОР
		|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|					ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|				КОНЕЦ
		|		КОНЕЦ) КАК КонечныеПоказания,
		|	бит_ПоказанияСчетчиковОстатки.Объект
		|ПОМЕСТИТЬ Показания
		|ИЗ
		|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга,
		|	бит_ПоказанияСчетчиковОстатки.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ОтвЛица
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	ОтвЛица.ФизЛицо КАК ФизЛицо,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК ГрупповойСчетчик,
		|	бит_ГрупповыеСчетчикиСрезПоследних.Услуга КАК Услуга,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
		|ПОМЕСТИТЬ ЛицевыеСчета
		|ИЗ
		|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Дата, ГрупповойСчетчик = &Счетчик) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвЛица КАК ОтвЛица
		|		ПО бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет = ОтвЛица.ЛицевойСчет
		|ГДЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	ОтвЛица.ФизЛицо,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик,
		|	бит_ГрупповыеСчетчикиСрезПоследних.Услуга,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьСтавкуПоСчетчику,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Поставщик,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СтатусКвартиры,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипКвартиры,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьПравилоУменьшения,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчетаУменьшения
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Счетчики.Счетчик КАК Счетчик,
		|	Счетчики.Услуга КАК Услуга,
		|	Счетчики.Объект КАК Объект,
		|	ЛицевыйСчета.ЛицевойСчет,
		|	ЛицевыйСчета.ФизЛицо КАК ОтветственноеЛицо,
		|	Счетчики.СпособРасчета КАК СпособРасчета,
		|	Счетчики.СпособРаспределения КАК СпособРаспределения,
		|	ЛицевыйСчета.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование,
		|	Показания.НачальныеПоказания КАК НачальныеПоказания,
		|	Показания.КонечныеПоказания КАК КонечныеПоказания,
		|	Счетчики.Многотарифный КАК Многотарифный,
		|	Счетчики.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
		|	Счетчики.Приоритет КАК Приоритет,
		|	Счетчики.ИспользоватьСтавкуПоСчетчику КАК ИспользоватьСтавкуПоСчетчику,
		|	Счетчики.Поставщик КАК Поставщик,
		|	Счетчики.СтатусКвартиры КАК СтатусКвартиры,
		|	Счетчики.ТипКвартиры КАК ТипКвартиры,
		|	Счетчики.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
		|	Счетчики.ОсновнаяУслуга КАК ОсновнаяУслуга,
		|	Счетчики.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
		|	Счетчики.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения
		|ИЗ
		|	Счетчики КАК Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЛицевыеСчета КАК ЛицевыйСчета
		|		ПО Счетчики.Счетчик = ЛицевыйСчета.ГрупповойСчетчик
		|			И Счетчики.Услуга = ЛицевыйСчета.Услуга
		|			И Счетчики.Объект = ЛицевыйСчета.Здание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Показания КАК Показания
		|		ПО Счетчики.Услуга = Показания.Услуга
		|			И Счетчики.Счетчик = Показания.Счетчик
		|			И Счетчики.Объект = Показания.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчетНаименование
		|ИТОГИ
		|	МАКСИМУМ(СпособРасчета),
		|	МАКСИМУМ(СпособРаспределения),
		|	МАКСИМУМ(НачальныеПоказания),
		|	МАКСИМУМ(КонечныеПоказания),
		|	МАКСИМУМ(Многотарифный),
		|	МАКСИМУМ(МестоУстановкиСчетчика),
		|	МАКСИМУМ(Приоритет),
		|	МАКСИМУМ(ИспользоватьСтавкуПоСчетчику),
		|	МАКСИМУМ(Поставщик),
		|	МАКСИМУМ(СтатусКвартиры),
		|	МАКСИМУМ(ТипКвартиры),
		|	МАКСИМУМ(СчетчикСЗависимымиУслугами),
		|	МАКСИМУМ(ОсновнаяУслуга),
		|	МАКСИМУМ(ИспользоватьПравилоУменьшения),
		|	МАКСИМУМ(СпособРасчетаУменьшения)
		|ПО
		|	Счетчик,
		|	Услуга,
		|	Объект";
		
		Результат = Запрос.Выполнить();
		ВыборкаСчетчики = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСчетчики.Следующий() Цикл
			
			Объект.СпособРасчета = ВыборкаСчетчики.СпособРасчета;
			Объект.Многотарифный = ВыборкаСчетчики.Многотарифный;
			
			Если НЕ ВыборкаСчетчики.Многотарифный Тогда
				// БИТ_ЖКХ 22.01.2015{{
				Если НЕ ВыборкаСчетчики.НачальныеПоказания = Null Тогда
					Объект.НачальныеПоказания =  ВыборкаСчетчики.НачальныеПоказания;
				КонецЕсли;
				Если НЕ ВыборкаСчетчики.КонечныеПоказания = Null Тогда
					Объект.КонечныеПоказания  =  ВыборкаСчетчики.КонечныеПоказания;
				КонецЕсли;
				// БИТ_ЖКХ 22.01.2015}}
			КонецЕсли;
			
			Если КэшированиеЗначений Тогда
				
				мКэшЗначений.МестоУстановкиСчетчика = ВыборкаСчетчики.МестоУстановкиСчетчика;
				мКэшЗначений.Приоритет              = ВыборкаСчетчики.Приоритет;
				
				мКэшЗначений.ИспользоватьСтавкуПоСчетчику = ВыборкаСчетчики.ИспользоватьСтавкуПоСчетчику;
				мКэшЗначений.СчетчикСЗависимымиУслугами   = ВыборкаСчетчики.СчетчикСЗависимымиУслугами;
				
				мКэшЗначений.ИспользоватьПравилоУменьшения = ВыборкаСчетчики.ИспользоватьПравилоУменьшения;
				
			Иначе
				
				мКэшЗначений.МестоУстановкиСчетчика = ВыборкаСчетчики.МестоУстановкиСчетчика;
				мКэшЗначений.Приоритет              = ВыборкаСчетчики.Приоритет;
				
				мКэшЗначений.ИспользоватьСтавкуПоСчетчику = ВыборкаСчетчики.ИспользоватьСтавкуПоСчетчику;
				мКэшЗначений.СчетчикСЗависимымиУслугами   = ВыборкаСчетчики.СчетчикСЗависимымиУслугами;
				
				мКэшЗначений.ИспользоватьПравилоУменьшения = ВыборкаСчетчики.ИспользоватьПравилоУменьшения;
				
			КонецЕсли; 
			
			ВыборкаУслуга = ВыборкаСчетчики.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаУслуга.Следующий() Цикл
				
				Если КэшированиеЗначений Тогда
					НоваяСтрока = мКэшЗначений.ТаблицаУслуг.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаУслуга);
					СписокУС.Добавить(ВыборкаУслуга.Услуга);
				Иначе
					НоваяСтрока = Объект.Услуги.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаУслуга);
				КонецЕсли;
				
				ВыборкаОбъект = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаОбъект.Следующий() Цикл
					
					СписокЗданий.Добавить(ВыборкаОбъект.Объект, Строка(ВыборкаОбъект.Объект.Улица) + ", " + Строка(ВыборкаОбъект.Объект));
					
					Выборка = ВыборкаОбъект.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						Если КэшированиеЗначений Тогда
							Если СписокЛС.НайтиПоЗначению(Выборка.ЛицевойСчет) = Неопределено Тогда
								СписокЛС.Добавить(Выборка.ЛицевойСчет);
							КонецЕсли; 
						Иначе
							НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
							НоваяСтрока.Адрес  = Строка(НоваяСтрока.ЛицевойСчет.УлицаЛицевогоСчета) + ", " + Строка(НоваяСтрока.ЛицевойСчет.Здание);
							НоваяСтрока.Здание = НоваяСтрока.ЛицевойСчет.Здание;
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЦикла; 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	мКэшЗначений.СписокЛС     = СписокЛС;
	мКэшЗначений.СписокУС     = СписокУС;
	мКэшЗначений.СписокЗданий = СписокЗданий;
	
	Возврат мКэшЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли