
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл для загрузки";
	Текст = "ru = ""Текст""; en = ""Text""";
	Фильтр = "(*.xls)(*.xlsx)|*.xls;*.xlsx";
	ДиалогВыбора.Фильтр = Фильтр;
	Если ДиалогВыбора.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
		//Элементы.ПутьНадпись.Заголовок = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить()
	
	Объект.ЛСНеИзменен.Очистить();
	Объект.ЛСНеНайден.Очистить();
	
	Excel = Новый COMОбъект("Excel.Application");
	Book = Excel.WorkBooks.Open(ПутьКФайлу);
	Sheet = Book.WorkSheets(1);
	КоличествоСтрок = Sheet.usedrange.Rows.Count;
	МассивСтрок = Новый Массив;
	//Сч = 2;
	//Индикатор = 0;
	Для Сч = 2 По КоличествоСтрок Цикл
		МассивСтроки = Новый Массив;
		МассивСтроки.Добавить(Sheet.Cells(Сч,1).Value);		
		МассивСтроки.Добавить(Sheet.Cells(Сч,2).Value);		
		МассивСтроки.Добавить(Sheet.Cells(Сч,3).Value);		
		МассивСтроки.Добавить(Sheet.Cells(Сч,4).Value);		
		МассивСтроки.Добавить(Sheet.Cells(Сч,5).Value);	
		МассивСтрок.Добавить(МассивСтроки);
		//Индикатор = (сч-1) / (КоличествоСтрок-1)*100;
	КонецЦикла; 
	//Сообщить(КоличествоСтрок);
	//а=0;
	Excel.DisplayAlerts = 0;
	Book.Close();
	Excel.Quit();
	Excel.DisplayAlerts = 1;
	
	ИзменитьЛС(МассивСтрок);
	Если Объект.ЛСНеИзменен.Количество() > 0 Тогда
		Элементы.Группа3.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ЛСНеНайден.Количество() > 0 Тогда
		Элементы.НеНайденЛС.Видимость = Истина;
	КонецЕсли;
	
	Сообщить("Данные загружены!");
КонецПроцедуры

&НаСервере
Процедура ИзменитьЛС(Массив)
	
	Для Каждого Строка Из Массив Цикл
		
		ЛС = НайтиЛС(Строка[0]);
		Если НЕ ЗначениеЗаполнено(ЛС) Тогда
			нСтрока = Объект.ЛСНеНайден.Добавить();
			нСтрока.ЛицевойСчет 		= Строка[0];
			нСтрока.НомерЕЛС 			= Строка[1];
			нСтрока.ИдентификаторЖКУ 	= Строка[2];
			Продолжить;
		КонецЕсли;
		
		Если Объект.Режим Тогда
			Если ЛС.КапРемЕЛСГИСЖКХ = Строка[1] И ЛС.КапРемИдентификаторЖКУ = Строка[2] И (ЗначениеЗаполнено(ЛС.Квартира) И ЛС.Квартира.УникальныйНомерГИСЖКХ = Строка[3]) Тогда
				нСтрока = Объект.ЛСНеИзменен.Добавить();
				нСтрока.ЛицевойСчет 		= Строка[0];
				нСтрока.НомерЕЛС 			= Строка[1];
				нСтрока.ИдентификаторЖКУ 	= Строка[2];
				нСтрока.УникальныйНомер 	= Строка[3];
				Продолжить;
			КонецЕсли;
			ЛСОбъект 								= ЛС.ПолучитьОбъект();
			ЛСОбъект.КапРемЕЛСГИСЖКХ 				= Строка[1];
			ЛСОбъект.КапРемИдентификаторЖКУ 		= Строка[2];
			Если ЗначениеЗаполнено(ЛС.Квартира) Тогда
				ЛСКвартираОбъект = ЛС.Квартира.ПолучитьОбъект();
				ЛСКвартираОбъект.УникальныйНомерГИСЖКХ = Строка[3];
				ЛСКвартираОбъект.Записать();
			КонецЕсли;
			ЛСОбъект.Записать();
		Иначе	
			Если ЛС.ЕЛСГИСЖКХ = Строка[1] И ЛС.ИдентификаторЖКУ = Строка[2] И (ЗначениеЗаполнено(ЛС.Квартира) И ЛС.Квартира.УникальныйНомерГИСЖКХ = Строка[3]) Тогда
				нСтрока = Объект.ЛСНеИзменен.Добавить();
				нСтрока.ЛицевойСчет 		= Строка[0];
				нСтрока.НомерЕЛС 			= Строка[1];
				нСтрока.ИдентификаторЖКУ 	= Строка[2];
				нСтрока.УникальныйНомер 	= Строка[3];
				Продолжить;
			КонецЕсли;
			ЛСОбъект 							= ЛС.ПолучитьОбъект();
			ЛСОбъект.ЕЛСГИСЖКХ 					= Строка[1];
			ЛСОбъект.ИдентификаторЖКУ 			= Строка[2];
			Если ЗначениеЗаполнено(ЛС.Квартира) Тогда
				ЛСКвартираОбъект = ЛС.Квартира.ПолучитьОбъект();
				ЛСКвартираОбъект.УникальныйНомерГИСЖКХ = Строка[3];
				ЛСКвартираОбъект.Записать();
			КонецЕсли;
			
			ЛСОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиЛС(ЛССтрока)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Наименование ПОДОБНО &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЛССтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Режим = Ложь;
	ЭтаФорма.Элементы.Группа3.Видимость = Ложь;
	ЭтаФорма.Элементы.НеНайденЛС.Видимость = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуОЖФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл для загрузки";
	Текст = "ru = ""Текст""; en = ""Text""";
	Фильтр = "(*.xls)(*.xlsx)|*.xls;*.xlsx";
	ДиалогВыбора.Фильтр = Фильтр;
	Если ДиалогВыбора.Выбрать() Тогда
		//Если ЗначениеЗаполнено(АдресФайла) Тогда
		//	УдалитьИзВременногоХранилища(АдресФайла);
		//КонецЕсли;
		ПутьКФайлуОЖФ = ДиалогВыбора.ПолноеИмяФайла; 
		//ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуОЖФ);
		//Файл = Новый Файл(ПутьКФайлуОЖФ); 
		//АдресФайла = ПоместитьВоВременноеХранилище(Файл);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОЖФНаСервере(Адрес) Экспорт
	ВремяНачала = ТекущаяДата();
	
	
	Файл = ПолучитьИзВременногоХранилища(Адрес);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Файл, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область());//передаем ТЗ
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();
	ТабличноеПоле = ПЗ.Результат.Выгрузить();
	
	Для Каждого Стр Из ТабличноеПоле Цикл
		Если Стр.УникальныйНомерПомещения = "" Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("УникальныйНомерГИСЖКХ", Стр.УникальныйНомерДома);
			Запрос.Текст = "ВЫБРАТЬ
			|	бит_СписокЗданий.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
			|ГДЕ
			|	бит_СписокЗданий.УникальныйНомерГИСЖКХ ПОДОБНО ""%"" + &УникальныйНомерГИСЖКХ + ""%""";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Здание = Выборка.Ссылка.ПолучитьОбъект();
				Здание.КадастровыйНомер = Стр.КадастровыйНомер;
				//Здание.КодФИАС = Стр.ГлобальныйУникальныйИдентификаторОбъектаЖилищногоФонда;
				Здание.Записать();
			КонецЕсли;
		Иначе
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("УникальныйНомерГИСЖКХ", Стр.УникальныйНомерПомещения);
			Запрос.Текст = "ВЫБРАТЬ
			|	бит_Квартиры.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.бит_Квартиры КАК бит_Квартиры
			|ГДЕ
			|	бит_Квартиры.УникальныйНомерГИСЖКХ ПОДОБНО ""%"" + &УникальныйНомерГИСЖКХ + ""%""";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Квартира = Выборка.Ссылка.ПолучитьОбъект();
				Квартира.КадастровыйНомер = Стр.КадастровыйНомер;
				//Здание.КодФИАС = Стр.;
				Квартира.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОЖФ(Команда)
	//Excel = Новый COMОбъект("Excel.Application");
	//Book = Excel.WorkBooks.Open(ПутьКФайлуОЖФ);
	//Sheet = Book.WorkSheets(1);
	//КоличествоСтрок = Sheet.usedrange.Rows.Count;
	//МассивСтрок = Новый Массив;
	////Сч = 2;
	////Индикатор = 0;
	//Для Сч = 2 По КоличествоСтрок Цикл
	//	МассивСтроки = Новый Массив;
	//	МассивСтроки.Добавить(Sheet.Cells(Сч,19).Value);		
	//	МассивСтроки.Добавить(Sheet.Cells(Сч,20).Value);		
	//	МассивСтроки.Добавить(Sheet.Cells(Сч,22).Value);		
	//	МассивСтроки.Добавить(Sheet.Cells(Сч,23).Value);		
	//	//МассивСтроки.Добавить(Sheet.Cells(Сч,5).Value);	
	//	МассивСтрок.Добавить(МассивСтроки);
	//	//Индикатор = (сч-1) / (КоличествоСтрок-1)*100;
	//КонецЦикла; 
	////Сообщить(КоличествоСтрок);
	////а=0;
	//Excel.DisplayAlerts = 0;
	//Book.Close();
	//Excel.Quit();
	//Описание = Новый ОписаниеОповещения("ЗагрузитьОЖФНаСервере", ЭтаФорма);
	//НачатьПомещениеФайлаНаСервер(Описание, , , АдресФайла, ПутьКФайлуОЖФ, ); 
	//ФАйл = Новый ФАйл(ПутьКФайлуОЖФ);
	//Файл
	АдресВоВХ = ПоместитьВоВременноеХранилище(ПутьКФайлуОЖФ, ЭтаФорма.УникальныйИдентификатор);
	ЗагрузитьОЖФНаСервере(АдресВоВХ);
	//ЗагрузитьОЖФНаСервере(МассивСтрок);
	
	//ИзменитьЛС(МассивСтрок);
	//Если Объект.ЛСНеИзменен.Количество() > 0 Тогда
	//	Элементы.Группа3.Видимость = Истина;
	//КонецЕсли;
	//
	//Если Объект.ЛСНеНайден.Количество() > 0 Тогда
	//	Элементы.НеНайденЛС.Видимость = Истина;
	//КонецЕсли;
	
	//Сообщить("Данные загружены!");
КонецПроцедуры

&НаСервере
Процедура ОчититьДанныеСодержаниеНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЛС = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЛС.ЕЛСГИСЖКХ 			= "";
		ЛС.ИдентификаторЖКУ 	= "";
		ЛСКвартираОбъект = ЛС.Квартира.ПолучитьОбъект();
		ЛСКвартираОбъект.УникальныйНомерГИСЖКХ = "";
		ЛСКвартираОбъект.Записать();
		ЛС.Записать();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура ОчититьДанныеСодержание(Команда)
	ОчититьДанныеСодержаниеНаСервере();
	Сообщить("Очистка завершена");
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеКапРемонтНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЛС = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЛС.КапРемЕЛСГИСЖКХ 			= "";
		ЛС.КапРемИдентификаторЖКУ 	= "";
		ЛСКвартираОбъект = ЛС.Квартира.ПолучитьОбъект();
		ЛСКвартираОбъект.УникальныйНомерГИСЖКХ = "";
		ЛСКвартираОбъект.Записать();
		ЛС.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеКапРемонт(Команда)
	ОчиститьДанныеКапРемонтНаСервере();
	Сообщить("Очистка завершена");
КонецПроцедуры

&НаСервере
Процедура ОчиститьВсеДанныеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.ЕЛСГИСЖКХ <> """"
		|	ИЛИ бит_ЛицевыеСчета.ИдентификаторЖКУ <> """"
		|	ИЛИ бит_ЛицевыеСчета.КапРемЕЛСГИСЖКХ <> """"
		|	ИЛИ бит_ЛицевыеСчета.КапРемИдентификаторЖКУ <> """"
		|	ИЛИ бит_ЛицевыеСчета.Квартира.УникальныйНомерГИСЖКХ <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЛС = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЛС.КапРемЕЛСГИСЖКХ 			= "";
		ЛС.КапРемИдентификаторЖКУ 	= "";
		ЛС.ЕЛСГИСЖКХ 				= "";
		ЛС.ИдентификаторЖКУ 		= "";
		ЛСКвартираОбъект = ЛС.Квартира.ПолучитьОбъект();
		ЛСКвартираОбъект.УникальныйНомерГИСЖКХ = "";
		ЛСКвартираОбъект.Записать();
		ЛС.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеДанные(Команда)
	ОчиститьВсеДанныеНаСервере();
	Сообщить("Очистка завершена");
КонецПроцедуры
