#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПодготовкаПараметровПроведенияДокумента

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ЗаявлениеТСЖ.Ссылка КАК Регистратор,
	|	бит_ЗаявлениеТСЖ.Дата КАК Период,
	|	бит_ЗаявлениеТСЖ.ВидОперации,
	|	бит_ЗаявлениеТСЖ.ТСЖ
	|ИЗ
	|	Документ.бит_ЗаявлениеТСЖ КАК бит_ЗаявлениеТСЖ
	|ГДЕ
	|	бит_ЗаявлениеТСЖ.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТестЗапросаСписокЧленовТСЖ(НомераТаблиц)
	
	НомераТаблиц.Вставить("СписокЧленовТСЖ", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Регистратор,
	|	Док.Ссылка.Дата КАК Период,
	|	Док.Ссылка.ТСЖ,
	|	Док.НомерСтроки КАК НомерСтроки,
	|	Док.ЛицевойСчет,
	|	Док.Проживающий,
	|	Док.ДатаВступления,
	|	Док.ДатаВыхода,
	|	Док.КоличествоГолосов
	|ИЗ
	|	Документ.бит_ЗаявлениеТСЖ.СписокЧленовТСЖ КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	НомераТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
		+ ТестЗапросаСписокЧленовТСЖ(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Процедура СформироватьДвижения_ЧленыТСЖ(ПараметрыПроведения, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	СписокЧленовТСЖ = ПараметрыПроведения.СписокЧленовТСЖ;
	
	Если СписокЧленовТСЖ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейДвижения = Движения.бит_ЧленыТСЖ;
	
	Для Каждого СтрокаТаблицы Из СписокЧленовТСЖ Цикл
		НоваяСтрока = НаборЗаписейДвижения.Добавить();
		НоваяСтрока.Период            = СтрокаТаблицы.Период;
		НоваяСтрока.ТСЖ               = СтрокаТаблицы.ТСЖ;
		НоваяСтрока.ЛицевойСчет       = СтрокаТаблицы.ЛицевойСчет;
		НоваяСтрока.ФизЛицо           = СтрокаТаблицы.Проживающий;
		НоваяСтрока.ДатаВступления    = СтрокаТаблицы.ДатаВступления;
		НоваяСтрока.ДатаВыхода        = СтрокаТаблицы.ДатаВыхода;
		НоваяСтрока.КоличествоГолосов = СтрокаТаблицы.КоличествоГолосов;
	КонецЦикла;
	
	НаборЗаписейДвижения.УстановитьАктивность(Истина);
	НаборЗаписейДвижения.Записывать = Истина;
	
КонецПроцедуры

Функция ПечатьДокумента(МассивОбъектов)Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка КАК Документ,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка.ТСЖ,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка.ВидОперации,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка.Дата КАК Период,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.ЛицевойСчет,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Проживающий,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.ЛицевойСчет.Квартира КАК Квартира
	|ИЗ
	|	Документ.бит_ЗаявлениеТСЖ.СписокЧленовТСЖ КАК бит_ЗаявлениеТСЖСписокЧленовТСЖ
	|ГДЕ
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Документ";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПечачи = Новый Структура("Период, ТСЖ, Проживающий, Квартира, ЛицевойСчет");
		ЗаполнитьЗначенияСвойств(ПараметрыПечачи, Выборка);
		
		Если Выборка.ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВступлениеВТСЖ Тогда
			ТабличныйДокумент.Вывести(ПечатьЗаявленияНаВступление(ПараметрыПечачи));
		ИначеЕсли Выборка.ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВыходИзТСЖ Тогда
			ТабличныйДокумент.Вывести(ПечатьЗаявленияНаВвыход(ПараметрыПечачи));
		КонецЕсли;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла; 
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьЗаявленияНаВступление(ПараметрыПечачи)
	
	Макет = ПолучитьМакет("МакетЗаявлениеНаВступление");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , ПараметрыПечачи.Период);
	Запрос.УстановитьПараметр("ЛицевойСчет", ПараметрыПечачи.ЛицевойСчет);
	Запрос.УстановитьПараметр("Проживающий", ПараметрыПечачи.Проживающий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы КАК ПД,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.Наименование КАК ПДНазваниеДокумента,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.НомерДокумента КАК ПДНомерДокумента,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.ДатаДокумента КАК ПДДатаДокумента
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Период,
	|			ФизЛицо = &Проживающий
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Период, ФизЛицо = &Проживающий) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ФИО = СокрЛП("" + СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + " " + СокрЛП(Выборка.Отчество));
	
	Если ПустаяСтрока(ФИО) Тогда
		ФИО = Строка(ПараметрыПечачи.Проживающий);
	КонецЕсли; 
	
	ФИОПроживающий = "";
	
	Попытка
		ИсходСклонения = бит_ПаспортныйСтолСервер.Просклонять(ФИО,2,ПараметрыПечачи.Проживающий.Пол,ФИОПроживающий);
	Исключение
		ИсходСклонения = Ложь;
	КонецПопытки;
	
	Если НЕ ИсходСклонения Тогда
		ФИОПроживающий = ФИО;
	КонецЕсли;
	
	ПДНаименование = "";
	
	Попытка
		ИсходСклонения = бит_ПаспортныйСтолСервер.Просклонять(Выборка.ПДНазваниеДокумента,2,,ПДНаименование);
	Исключение
		ИсходСклонения = Ложь;
	КонецПопытки;
	
	Если НЕ ИсходСклонения Тогда
		ПДНаименование = Выборка.ПДНазваниеДокумента;
	КонецЕсли;
	
	ПравоустанавливающиеДокументы = "" 
									+ ПДНаименование 
									+ ?(ЗначениеЗаполнено(Выборка.ПДНомерДокумента), " №" + Выборка.ПДНомерДокумента, "")
									+ ?(ЗначениеЗаполнено(Выборка.ПДДатаДокумента) , " от " + Формат(Выборка.ПДДатаДокумента, "ДФ=dd.MM.yyyy"), "");
	
	ОбластьШапка.Параметры.ТСЖ                            = ПараметрыПечачи.ТСЖ;
	ОбластьШапка.Параметры.Проживающий                    = ФИОПроживающий;
	ОбластьШапка.Параметры.Квартира                       = ПараметрыПечачи.Квартира;
	ОбластьШапка.Параметры.ПравоустанавливающиеДокументы  = ПравоустанавливающиеДокументы;
	ОбластьШапка.Параметры.Период                         = Формат(ПараметрыПечачи.Период, "ДФ='dd.MM.yyyy'") + " года."; 
	ОбластьШапка.Параметры.Подпись                        = ФИО + "_______________";
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьЗаявленияНаВвыход(ПараметрыПечачи)
	
	Макет = ПолучитьМакет("МакетЗаявлениеНаВыход");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , ПараметрыПечачи.Период);
	Запрос.УстановитьПараметр("Проживающий", ПараметрыПечачи.Проживающий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Период, ФизЛицо = &Проживающий) КАК бит_ФИОПроживающихСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ФИО = СокрЛП("" + СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + " " + СокрЛП(Выборка.Отчество));
	
	Если ПустаяСтрока(ФИО) Тогда
		ФИО = Строка(ПараметрыПечачи.Проживающий);
	КонецЕсли; 
	
	ФИОПроживающий = "";
	
	Попытка
		ИсходСклонения = бит_ПаспортныйСтолСервер.Просклонять(ФИО,2,ПараметрыПечачи.Проживающий.Пол,ФИОПроживающий);
	Исключение
		ИсходСклонения = Ложь;
	КонецПопытки;
	
	Если НЕ ИсходСклонения Тогда
		ФИОПроживающий = ФИО;
	КонецЕсли; 
	
	ОбластьШапка.Параметры.ТСЖ                            = ПараметрыПечачи.ТСЖ;
	ОбластьШапка.Параметры.Проживающий                    = ФИОПроживающий;
	ОбластьШапка.Параметры.Период                         = Формат(ПараметрыПечачи.Период, "ДФ='dd.MM.yyyy'") + " года."; 
	ОбластьШапка.Параметры.Подпись                        = Строка(ФИО) + "_______________";
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли