#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НайденыДубли = Ложь;
	
	бит_ОбщегоНазначения.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "СписокЧленовТСЖ", 
	Новый Структура("ЛицевойСчет, Проживающий"), НайденыДубли);
	
	Если НайденыДубли Тогда
		Отказ = Истина;
	КонецЕсли; 
	
	ДатаСоздания = Дата("00010101");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТСЖ"        , ТСЖ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(бит_ИнформацияТСЖСрезПоследних.ДатаСоздания) КАК ДатаСоздания,
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ТСЖ = &ТСЖ) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|	И бит_ИнформацияТСЖСрезПоследних.Здание.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСоздания = Выборка.ДатаСоздания;
	КонецЕсли; 
	
	ДатаУказанаНеВерно = Ложь;
	
	ТекстСообщения = "";
	
	НомераСтрок = "";
	
	Если ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВступлениеВТСЖ Тогда
		
		Для каждого СтрокаТаблицы Из СписокЧленовТСЖ Цикл
			
			Если СтрокаТаблицы.ДатаВступления < ДатаСоздания Тогда
				
				ДатаУказанаНеВерно = Истина;
				
				НомераСтрок = НомераСтрок + ", " + Формат(СтрокаТаблицы.НомерСтроки, "ЧГ=");
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если ДатаУказанаНеВерно Тогда
		
		НомераСтрок = Сред(НомераСтрок, 3);
		
		ШаблонСообщенияОбОшибке = НСтр("ru = 'В строках %1 дата вступления раньше даты создания ТСЖ : %2.'");
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщенияОбОшибке, НомераСтрок, Формат(ДатаСоздания, "ДФ=dd.MM.yyyy"));
		
		ТекстСообщения = НСтр("ru = 'Значение даты вступления не должно быть меньше даты создания ТСЖ.'")
		+ ТекстСообщения;
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТекстСообщения("СПИСОК", "КОРРЕКТНОСТЬ", , ,
		"Список членов ТСЖ", ТекстСообщения);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Список членов ТСЖ");
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_ЗаявлениеТСЖ.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Документы.бит_ЗаявлениеТСЖ.СформироватьДвижения_ЧленыТСЖ(
	ПараметрыПроведения, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли