#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив задач по налогам, для которых порядок уплаты авансов 
// настраивается по регионам (см. КодыНалоговПорядокКоторыхНастраиваетсяПоРегионам())
// 
// Возвращаемое значение:
//  Массив - массив элементов СправочникСсылка.ЗадачиБухгалтера
//
Функция НалогиПорядокКоторыхНастраиваетсяПоРегионам() Экспорт
	
	Налоги = КодыНалоговПорядокКоторыхНастраиваетсяПоРегионам();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Налоги", Налоги);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиБухгалтера.Ссылка
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Код В(&Налоги)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Возвращает дату начала использования текущего регистра настроек
// 
// Возвращаемое значение:
//  Дата
//
Функция НачалоИспользованияНастроек() Экспорт 
	
	Возврат '20210101';
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодыНалоговПорядокКоторыхНастраиваетсяПоРегионам()
	
	Налоги = Новый Массив;
	Налоги.Добавить("ТранспортныйНалог");
	
	Возврат Налоги;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления
	
// Процедура - обработчик обновления. Заполняет текущий регистр данными
// из регистра сведений ПорядокУплатыНалоговНаМестах.
//
// Параметры:
//  Параметры - Структура - см. документацию БСП для отложенных обработчиков обновления
//
Процедура ЗаполнитьДаннымиПрежнегоРегистра(Параметры) Экспорт
	
	// Заполним новый регистр на дату начала его использования. Для этого выбираем нужные 
	// данные из прежнего регистра. 
	// Переносим данные одной порцией, т.к. ожидается, что записей получится немного
	// (максимум по 86 на каждую организацию).
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", НачалоИспользованияНастроек());
	Запрос.УстановитьПараметр("РегиональныеНалоги", НалогиПорядокКоторыхНастраиваетсяПоРегионам());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Организация КАК Организация,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Налог КАК Налог,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане.КодРегиона КАК КодРегиона,
	|	МАКСИМУМ(ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы) КАК УплачиваютсяАвансы
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(&Период, Налог В (&РегиональныеНалоги)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|ГДЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане.КодРегиона <> """"
	|	И ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Организация,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Налог,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане.КодРегиона";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		// Нет настроек для переноса
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;					
	КонецЕсли; 
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	// На момент заполнения регистр пустой
	НаборЗаписей.Загрузить(Результат.Выгрузить());
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ""РегистрСведений.ПорядокУплатыНалоговПоРегионам.ЗаполнитьДаннымиПрежнегоРегистра""
			|не удалось перенести данные из прежнего регистра по причине:
			|%1'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
		
	Параметры.ОбработкаЗавершена = Истина;
		
КонецПроцедуры

Функция ВыполненоНачальноеЗаполнение(Параметры) Экспорт 
	
	// Здесь нет смысла анализировать отдельные записи: 
	// обработчик обновления (см. ЗаполнитьДаннымиПрежнегоРегистра()) 
	// либо выполнится и одним действием заполнит новый регистр настроек (в таком случае данная проверка вообще не вызывается),
	// либо не выполнится, и тогда полностью блокируем работу с новыми настройками (возвращаем Ложь).
	Возврат Ложь;
		
КонецФункции
 
#КонецОбласти

#КонецЕсли
