
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоРеквизиты = Параметры.ТолькоРеквизиты;
	Таблица         = Параметры.Таблица;
	
	Если ТипЗнч(Параметры.КоллекцияРеквизитов) = Тип("Структура") Тогда
		ЗаполнитьДеревоРеквизитов(Параметры.КоллекцияРеквизитов);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьВыполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура Форматирование(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоРеквизитов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено И НЕ ЗначениеЗаполнено(Результат) И ТекущаяСтрока.Тип = "Поле" Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогФорматаСтроки = Ложь;
	ДоступныеТипы       = "";
	
	Если ТекущаяСтрока.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
		ДиалогФорматаСтроки = Истина;
		ДоступныеТипы       = ДоступныеТипы + ", Строка";
	КонецЕсли;
	Если ТекущаяСтрока.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
		ДиалогФорматаСтроки = Истина;
		ДоступныеТипы       = ДоступныеТипы + ", Дата";
	КонецЕсли;
	Если ТекущаяСтрока.ТипЗначения.СодержитТип(Тип("Число")) Тогда
		ДиалогФорматаСтроки = Истина;
		ДоступныеТипы       = ДоступныеТипы + ", Число";
	КонецЕсли;
	Если ТекущаяСтрока.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
		ДиалогФорматаСтроки = Истина;
		ДоступныеТипы       = ДоступныеТипы + ", Булево";
	КонецЕсли;
	
	Если ДиалогФорматаСтроки Тогда
		
		ДоступныеТипы = Сред(ДоступныеТипы, 3);
		
		Конструктор = Новый КонструкторФорматнойСтроки;
		Конструктор.ДоступныеТипы = Новый ОписаниеТипов(ДоступныеТипы);
		Конструктор.Показать(Новый ОписаниеОповещения("ФорматированиеЗавершение", ЭтотОбъект, Новый Структура("Конструктор", Конструктор))); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированиеЗавершение(Текст, ДополнительныеПараметры) Экспорт
    
    Конструктор = ДополнительныеПараметры.Конструктор;
    
    
    Если Текст Тогда
        Если ЗначениеЗаполнено(Конструктор.Текст) Тогда
            ШаблонВыражения = "Формат(%1, ""%2"")";
            Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВыражения, Результат, Конструктор.Текст);
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляДеревоРеквизитов

&НаКлиенте
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьВыполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДеревоРеквизитов.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено
		И ТекДанные.Тип = "Поле" Тогда
		
		ИмяПоля = ТекДанные.Имя;
		
		ИмяРеквизита = ИмяПоля;
		
		Результат = "#Р." + ИмяПоля;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьДеревоРеквизитов(Знач КоллекцияРеквизитов, Знач Родитель = Неопределено)
	
	Для каждого КлючЗначение Из КоллекцияРеквизитов Цикл
		
		ОбъектыМетаданных = КлючЗначение.Значение;
		ОбъектыМетаданных.Родитель = ?(Родитель = Неопределено ,ДеревоРеквизитов, Родитель);
		
		Если ТолькоРеквизиты И ОбъектыМетаданных.Тип = "ТаблицаЗначений" Тогда
			Продолжить;
		ИначеЕсли НЕ ТолькоРеквизиты И ОбъектыМетаданных.Тип = "Поле"  Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Таблица) И ОбъектыМетаданных.Тип = "ТаблицаЗначений" Тогда
		
			Если НЕ ОбъектыМетаданных.Имя = Таблица Тогда
				Продолжить;
			КонецЕсли; 
		
		КонецЕсли; 
		
		СтрокаОбъекта = НоваяСтрокаДерева(ОбъектыМетаданных);
		
		Если ОбъектыМетаданных.Реквизиты.Количество() > 0 Тогда
			
			ЗаполнитьДеревоРеквизитов(ОбъектыМетаданных.Реквизиты, СтрокаОбъекта);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // () 

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ВыбратьВыполнить()
	
	ТекДанные = Элементы.ДеревоРеквизитов.ТекущиеДанные;
	Если ТекДанные <> Неопределено
		И ТекДанные.Тип = "Поле" Тогда
		
		ВыбранноеЗначение = Новый Структура("Имя, ИмяРеквизита");
		ВыбранноеЗначение.Имя          = Результат;
		ВыбранноеЗначение.ИмяРеквизита = ИмяРеквизита;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ОповеститьОВыборе(ВыбранноеЗначение);
	
КонецПроцедуры // () 

&НаСервере
Функция НоваяСтрокаДерева(ПараметрыСтроки)
	
	Коллекция = ПараметрыСтроки.Родитель.ПолучитьЭлементы();
	НоваяСтрока = Коллекция.Добавить();
	НоваяСтрока.Имя                 = ПараметрыСтроки.Имя;
	НоваяСтрока.Представление       = ?(ЗначениеЗаполнено(ПараметрыСтроки.Представление), ПараметрыСтроки.Представление, ПараметрыСтроки.Имя);
	НоваяСтрока.Картинка            = ПараметрыСтроки.Картинка;
	НоваяСтрока.ТипЗначения         = ПараметрыСтроки.ТипЗначения;
	НоваяСтрока.Тип                 = ПараметрыСтроки.Тип;
	
	Возврат НоваяСтрока;
	
КонецФункции

#КонецОбласти
