
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		Отбор = Список.Отбор.Элементы;
		
		УсловиеОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ответственный");
		УсловиеОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		
		// УсловиеОтбора.ПравоеЗначение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");.
		УсловиеОтбора.ПравоеЗначение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		// БИТ_ЖКХ 07.02.2014
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
