
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Ссылка = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		Ссылка = Элементы.Список.ТекущиеДанные.ФизЛицо;
		
	КонецЕсли;
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "Гражданство"), Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Ссылка = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	
	Для Каждого Эл Из Список.Отбор.Элементы Цикл
		
		Если Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизЛицо") Тогда
			
			Если Эл.Использование = Истина Тогда
				
				Ссылка = Эл.ПравоеЗначение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Гражданство"), Ссылка);

КонецПроцедуры

#КонецОбласти