
#Область ОбработчикиСобытийКонтактнойИнформацииНАФормах

Процедура ГиперссылкаНажатие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
	
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент);
	Если (ДанныеСтроки = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Представление = Форма[ДанныеСтроки.ИмяРеквизита];
	// БИТ_ЖКХ 17.03.2016 18:23:18 Начало правки... 
	//Если Представление = УправлениеКонтактнойИнформациейКлиентСерверБП.ПредставлениеПустойГиперссылки() Тогда
	Если Представление = ПредставлениеПустойГиперссылки() Тогда
	// БИТ_ЖКХ 17.03.2016 18:23:20 Конец правки. 
		Представление = "";
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ДанныеСтроки.Вид);
	ПараметрыОткрытия.Вставить("ЗначенияПолей", ДанныеСтроки.ЗначенияПолей);
	ПараметрыОткрытия.Вставить("Представление", ДанныеСтроки.Представление);
	ПараметрыОткрытия.Вставить("Комментарий", ДанныеСтроки.Комментарий);
	ПараметрыОткрытия.Вставить("РедактированиеТолькоВДиалоге", Истина);
	ПараметрыОткрытия.Вставить("АдресТолькоРоссийский", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ГиперссылкаНажатиеЗавершение", бит_УправлениеКонтактнойИнформациейБП, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             Форма);
	
	бит_УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Форма, , , Оповещение);
	
КонецПроцедуры

// Завершение немодальных диалогов.
Процедура ГиперссылкаНажатиеЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Результат        = ДополнительныеПараметры.Результат;
	ДанныеСтроки     = ДополнительныеПараметры.ДанныеСтроки;
	Элемент          = ДополнительныеПараметры.Элемент;
	Форма            = ДополнительныеПараметры.Форма;
	
	Результат.Вставить("ЗначенияПолейДоИзменения", ДанныеСтроки.ЗначенияПолей);
	Результат.Вставить("ПредставлениеДоИзменения", ДанныеСтроки.Представление);
	Результат.Вставить("ЗначениеПоляДоИзменения", Форма[ДанныеСтроки.ИмяРеквизита]);
	
	// БИТ_ЖКХ 17.03.2016 18:22:59 Начало правки... 
	//Форма[ДанныеСтроки.ИмяРеквизита]	= ?(ПустаяСтрока(РезультатЗакрытия.Представление), УправлениеКонтактнойИнформациейКлиентСерверБП.ПредставлениеПустойГиперссылки(), РезультатЗакрытия.Представление);
	Форма[ДанныеСтроки.ИмяРеквизита]	= ?(ПустаяСтрока(РезультатЗакрытия.Представление), ПредставлениеПустойГиперссылки(), РезультатЗакрытия.Представление);
	// БИТ_ЖКХ 17.03.2016 18:23:01 Конец правки. 
	ДанныеСтроки.ЗначенияПолей			= РезультатЗакрытия.КонтактнаяИнформация;
	ДанныеСтроки.Представление			= РезультатЗакрытия.Представление;
	ДанныеСтроки.Комментарий			= РезультатЗакрытия.Комментарий;
	Форма.Модифицированность = Истина;
	
	Форма.ОбновитьКонтактнуюИнформацию(Результат);
	
КонецПроцедуры

// БИТ_ЖКХ 17.03.2016 18:22:44 Начало правки...
Функция ПредставлениеПустойГиперссылки()

	Возврат НСтр("ru='Заполнить'");

КонецФункции
// БИТ_ЖКХ 17.03.2016 18:22:44 Конец правки.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент)
	
	Отбор = Новый Структура("ИмяРеквизита", Элемент.Имя);
	Строки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	
	Возврат ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	
КонецФункции

#КонецОбласти