
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		// Вариант автоматического подключения к сервису недоступен.
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтоАвтономноеРабочееМесто = ОбщегоНазначения.ЭтоАвтономноеРабочееМесто();
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПубликацияРасчетныхЛистков", "Видимость",
			КабинетСотрудника.ДоступнаПубликацияРасчетныхЛистков());
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастроитьПравилаОбработкиЗаявокСотрудников", "Видимость",
			БизнесПроцессыЗаявокСотрудников.ДоступнаНастройкаПравилОбработкиЗаявок());
		
	ПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИзменитьДанныеСервиса", "Видимость",
			ПолноправныйПользователь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИзменитьПривязкуАбонента", "Видимость",
			ПолноправныйПользователь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ОтключениеСервиса", "Видимость",
			ПолноправныйПользователь);
		
	ЦветСтиляПоясняющийОшибкуТекст 	= ЦветаСтиля.ПоясняющийОшибкуТекст;
	ЦветСтиляТекстаПоля 			= ЦветаСтиля.ЦветТекстаПоля;
	ЦветСтиляПоясняющийТекст 		= ЦветаСтиля.ПоясняющийТекст;
	ЦветСтиляИнформационнойНадписи  = ЦветаСтиля.ТекстИнформационнойНадписи;
	
	ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТребуетсяОбновитьИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ПодключениеВыполняется Тогда
		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = НСтр("ru = 'Подключение к сервису не завершено.
				|Если программа будет закрыта, подключение к сервису не будет выполнено.'");
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ФизическиеЛица" И Источник = Ответственный Тогда
		ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол, ОтветственныйНаименование);
		ОбновитьЭУОтветственный(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяДоменаПриИзменении(Элемент)
	
	ПроверитьИмяДомена();
	Если ИмяДоменаСоответствуетПравилам И Не ПустаяСтрока(ИмяДомена) Тогда
		ИмяДоменаЗарезервировано = Ложь;
		Элементы.ДекорацияИмяДоменаПояснение.Заголовок  = НСтр("ru = 'Выполняется проверка уникальности адреса. Пожалуйста подождите ...'");
		НачатьРезервированиеИмениДомена();
		ПриНачалеЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяДоменаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПроверитьИмяДомена(Текст);
КонецПроцедуры

&НаКлиенте
Процедура АбонентИнтернетПоддержкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка 		= Ложь;
	ИдентификаторИП = ВыбранноеЗначение;
	АбонентИнтернетПоддержки 	= Элементы.АбонентИнтернетПоддержки.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол, ОтветственныйНаименование);
	ОбновитьЭУОтветственный(ЭтаФорма);
	ОбновитьСообщениеОПубликации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЛокальноПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол, ОтветственныйНаименование);
	ОбновитьЭУОтветственный(ЭтаФорма);
	
КонецПроцедуры


#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура МесяцПубликацииПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой", Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой", Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодробноОСервисе(Команда)
	
	КабинетСотрудникаКлиент.ОткрытьНавигационнуюСсылкуПодробноОСервисе();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Команда)
	
	ПодключитьИнтернетПоддержкуПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключить(Команда)
	
	Если ИмяДоменаЗарезервировано И ДанныеОтветственногоЗаполнены Тогда
		НачатьПодключениеКСервису();
		ПриНачалеЗадания();
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Для подключения к сервису заполните данные в форме'");
		ПоказатьПредупреждение( ,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПубликации(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьИнформациюПодключения", ЭтотОбъект);
	ПараметрыНастроекПубликации = Новый Структура("РежимПодключения", Не СервисПодключен);
	Если СервисПодключен Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкаПубликацииКабинетСотрудника",
			ПараметрыНастроекПубликации,ЭтаФорма,,,,ОповещениеОЗакрытии);
	Иначе
		ОткрытьФорму("ОбщаяФорма.НастройкаПубликацииКабинетСотрудника",
			ПараметрыНастроекПубликации,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееОДоступеКДанным(Команда)
	
	КабинетСотрудникаКлиент.ОткрытьНавигационнуюСсылкуОписаниеДоступаКДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееОПоддерживаемыхБраузерах(Команда)
	
	КабинетСотрудникаКлиент.ОткрытьНавигационнуюСсылкуПоддерживаемыеБраузеры();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанныеСервиса(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьДанныеСервисаЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("СервисКабинетСотрудникаВЛокальнойСети", СервисКабинетСотрудникаВЛокальнойСети);
	ОткрытьФорму("ОбщаяФорма.ИзменитьНастройкиСервиса",
		ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьРасчетныеЛистки(Команда)
	
	РезультатПубликации = ОпубликоватьРасчетныеЛисткиНаСервере();
	Если ЗначениеЗаполнено(РезультатПубликации) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Выгрузка прошла успешно.'");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьНаКлиентеПубликациюРасчетныхЛистков", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатПубликации, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПубликацииРасчетныхЛистков(Команда)
	
	ОткрытьФорму("Обработка.ПубликацияРасчетныхЛистковКабинетСотрудника.Форма.ПубликацияРасчетныхЛистков",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПривязкуАбонента(Команда)
	
	ИнтернетПоддержкаПодключена = ИнтернетПоддержкаПодключена();
	Если Не ИнтернетПоддержкаПодключена Тогда
		ПодключитьИнтернетПоддержкуПользователей();
	Иначе
		ИзменитьАбонентаСервиса()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуПользователей()

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект);
		Модуль.ПодключитьИнтернетПоддержкуПользователей(ОповещениеОЗакрытии, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАбонентаСервиса()

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьПривязкуАбонентаЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("ТекущийИдентификаторПользователяИП,ТекущийИдентификаторАбонентаИП,РазделениеВключено",
		ТекущийИдентификаторПользователяИП, ТекущийИдентификаторАбонентаИП, РазделениеВключено);
	ОткрытьФорму("ОбщаяФорма.ИзменитьАбонентаСервиса",
		ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСервис(Команда)
	
	Если ВариантОтключенияСервиса = 0 Тогда
		ШаблонТекстаВопроса = НСтр("ru = 'Отключить сервис 1С:Кабинет сотрудника по адресу %1, данные сервиса не будут удалены?'");
	Иначе
		ШаблонТекстаВопроса = НСтр("ru = 'Отключить сервис 1С:Кабинет сотрудника по адресу %1 и удалить все его данные?'");
	КонецЕсли;
	ТекстВопроса = СтрШаблон(ШаблонТекстаВопроса, АдресПриложения);
	
	ОбработчикРезультата = Новый ОписаниеОповещения("ПриОтветеНаВопросОтключитьСервис", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикРезультата, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЗаполнения(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьИнформациюПодключения", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТолькоОшибкиЗаполнения", Истина);
	ОткрытьФорму("РегистрСведений.ФизическиеЛицаКабинетСотрудника.ФормаСписка",
		ПараметрыФормы,ЭтаФорма,ЭтаФорма,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОшибокПубликации(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", "ОшибкиПубликации");
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.ОшибкиПубликацииКабинетСотрудника.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовоеПодключение(Команда)
	
	ПерейтиКНовомуПодключению();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияОбОплате(Команда)
	
	НачатьОбновлениеСведенийОбОплате();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = НСтр("ru='Выберите файл с настройками подключения к сервису'");
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Файл с настройками (*.json)|*.json'");
	ОбработчикЗавершения = Новый ОписаниеОповещения("ФайлНастроекПослеВыбора", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОбработчикЗавершения, ДиалогВыбораФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЛокальнуюВерсию(Команда)
	
	Если ЗначениеЗаполнено(АдресПриложенияЛокально) 
		И ЗначениеЗаполнено(КлючИдентификаторКлиента)
		И ЗначениеЗаполнено(КлючСекретКлиента)
		И ДанныеОтветственногоЗаполнены Тогда
		НачатьПодключениеКСервисуЛокально();
		ПриНачалеЗадания();
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Для подключения к сервису заполните данные в форме'");
		ПоказатьПредупреждение( ,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравилаОбработкиЗаявокСотрудников(Команда)
	ОткрытьФорму("Обработка.НастройкаПравилОбработкиЗаявокСотрудников.Форма");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиПолученияДанных

&НаСервере
Процедура ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода = Неопределено, КлючФоновогоЗадания = "")
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	Если ЗначениеЗаполнено(КлючФоновогоЗадания) Тогда
		ПараметрыВыполненияВФоне.КлючФоновогоЗадания = КлючФоновогоЗадания;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			ИмяДекорации,
			"Видимость",
			Истина);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыМетода, ПараметрыВыполненияВФоне);
	
	НовоеЗадание = Новый Структура("Имя,ДлительнаяОперация,ИмяДекорации");
	НовоеЗадание.Имя = ИмяЗадания;
	НовоеЗадание.ДлительнаяОперация = РезультатВыполнения;
	НовоеЗадание.ИмяДекорации = ИмяДекорации;
	
	АктивноеЗадание = Новый ФиксированнаяСтруктура(НовоеЗадание);
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриНачалеЗадания()
	
	Если ЗначениеЗаполнено(АктивноеЗадание) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			АктивноеЗадание.ДлительнаяОперация,
			Новый ОписаниеОповещения("ПриЗавершенииЗадания", ЭтотОбъект, АктивноеЗадание.Имя),
			ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииЗадания(Результат, ИмяЗадания) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			АктивноеЗадание.ИмяДекорации,
			"Видимость",
			Ложь);
	
	АктивноеЗадание = Неопределено;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении фонового задания возникла ошибка:'") + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
	Если ИмяЗадания = "ПолучениеАбонентов" Тогда
		ПолучениеАбонентовЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ЗарезервироватьИмяДомена" Тогда
		РезервированиеИмениДоменаЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "НовоеПриложение" Тогда
		НовоеПриложениеЗавершение(Результат.АдресРезультата);
		Если ОтложенноеПодключениеКСервису Тогда
			Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаОтложенноеПодключение;
			ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
		ИначеЕсли НачатоСозданиеПриложения Тогда
			ПодключитьОбработчикОжидания("ПроверкаСозданияПриложения", 10, Ложь);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ПроверкаСозданияПриложения" Тогда
		ПроверкаСозданияПриложенияЗавершение(Результат.АдресРезультата);
		Если ПриложениеСоздано Тогда
			// отключаем обработчик ожидания проверки создания приложения
			ОтключитьОбработчикОжидания("ПроверкаСозданияПриложения");
			// Создаем информационную систему
			НачатьСозданиеИнформационнойСистемы();
			ПриНачалеЗадания();
		ИначеЕсли ПриложениеНеСоздано Тогда
			// Приложение не удалось создать.
			// Отключаем обработчик проверки создания приложения.
			ОтключитьОбработчикОжидания("ПроверкаСозданияПриложения");	
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "СозданиеИнформационнойСистемы" Тогда
		СозданиеИнформационнойСистемыЗавершение(Результат.АдресРезультата);
		Если ИнформационнаяСистемаСоздана Тогда
			ПодключитьОбработчикОжидания("ОпубликоватьОтветственноеЛицо", 10, Истина);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ПубликацияОтветственногоЛица" Тогда
		ПубликацияОтветственногоЛицаЗавершение(Результат.АдресРезультата);
		Если ОтветственноеЛицоОпубликовано Тогда
			ПодключитьОбработчикОжидания("СоздатьАдминистратораСервиса", 10, Истина);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "СозданиеАдминистратораСервиса" Тогда
		СозданиеАдминистратораСервисаЗавершение(Результат.АдресРезультата);
		Если ПодключениеВыполнено Тогда
			ПриНачалеЗадания();
			НачатьПубликациюДанных();
			ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ПолучениеИнформацииОСервисе" Тогда
		ПолучениеИнформацииОСервисеЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ОбновлениеСвойствПриложения" Тогда
		ОбновлениеСвойствПриложенияЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ИзменениеАбонентаИнтернетПоддержки" Тогда
		ИзменениеАбонентаИнтернетПоддержкиЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ОтключениеСервиса" Тогда
		ОтключениеСервисаЗавершение(Результат.АдресРезультата);
		СервисОтключенСообщитьПользователю();
		ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
	ИначеЕсли ИмяЗадания = "ОбновлениеСведенийОбОплате" Тогда
		ОбновлениеСведенийОбОплатеЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ПодключениеКСервисуЛокально" Тогда
		ПодключениеКСервисуЛокальноЗавершение(Результат.АдресРезультата);
		Если ПодключениеВыполнено Тогда
			ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
			ПриНачалеЗадания();
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ОбновлениеОтветственного" Тогда
		ОбновлениеОтветственногоЗавершение(Результат.АдресРезультата);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьПолучениеАбонентов()
	
	ИмяЗадания 		= "ПолучениеАбонентов";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ПолучитьАбонентовИнтернетПоддержкиФоновоеЗадание";
	ИмяДекорации 	= "";
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации);
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеАбонентовЗавершение(АдресРезультата)
	
	Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключение;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	// Результат проверки доступности сервиса интернет-поддержки.
	Если Результат.ИнтернетПоддержкаДоступна Или РазделениеВключено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИнтернетПоддержка", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИнтернетПоддержка", "Видимость", Истина);
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При получении данных для подключения к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		Если РазделениеВключено И Не Результат.ИнтернетПоддержкаДоступна Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС 
				+ НСтр("ru = 'Интернет-поддержка пользователей недоступна, обратитесь к администратору приложения.'");
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастройкиПодключения", "Доступность", Истина);
	
	Элементы.АбонентИнтернетПоддержки.СписокВыбора.Очистить();
	АбонентИнтернетПоддержки 	= "";
	ИдентификаторИП = "";
	
	// Результат.АбонентыИП - массив структур, возвращаемое значение метода
	// КабинетСотрудникаМенеджерСервиса.АбонентыИППользователяИП.
	Для каждого ЭлементМассива Из Результат.АбонентыИП Цикл
		Элементы.АбонентИнтернетПоддержки.СписокВыбора.Добавить(ЭлементМассива.Идентификатор, ЭлементМассива.Наименование);
	КонецЦикла;
	
	Если Элементы.АбонентИнтернетПоддержки.СписокВыбора.Количество() > 0 Тогда
		АбонентИнтернетПоддержки 	= Элементы.АбонентИнтернетПоддержки.СписокВыбора[0];
		ИдентификаторИП = Элементы.АбонентИнтернетПоддержки.СписокВыбора[0].Значение;
	КонецЕсли;
	
	Если Элементы.АбонентИнтернетПоддержки.СписокВыбора.Количество() > 1 Тогда
		Элементы.АбонентИнтернетПоддержки.КнопкаВыпадающегоСписка = Истина;
		Элементы.ВыборАбонента.Видимость = Истина;
	Иначе
		Элементы.ВыборАбонента.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьИмяПриложения();
	ЗаполнитьОтветственного();
	
КонецПроцедуры

&НаСервере
Процедура НачатьРезервированиеИмениДомена()

	ИмяЗадания 		= "ЗарезервироватьИмяДомена";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ЗарезервироватьИмяДоменаФоновоеЗадание";
	ИмяДекорации 	= "ИндикаторДлительнойОперацииРезервированиеИмениДомена";
	
	ПараметрыМетода = Новый Структура("ИмяДомена,ИдентификаторВладельца", ИмяДомена, ИдентификаторИП);
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура РезервированиеИмениДоменаЗавершение(АдресРезультата)
	
	// Результат - структура, возвращаемое значение метода
	// КабинетСотрудникаМенеджерСервиса.ЗарезервироватьИмяДомена.
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При проверке уникальности адреса сервиса возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИмяДоменаЗарезервировано = Результат.Зарезервировано;
	
	Если ИмяДоменаЗарезервировано Тогда
		ЦветТекстаЭУ 		= ЦветСтиляТекстаПоля;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийТекст;
		СообщениеПроверки = СтрШаблон(
				НСтр("ru = 'адрес ""%1"" зарезервирован для вашего сервиса'"),
				СтрокаАдресПриложения());
	Иначе	
		ЦветТекстаЭУ 		= ЦветСтиляПоясняющийОшибкуТекст;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийОшибкуТекст;
		СообщениеПроверки = СтрШаблон(
				НСтр("ru = 'К сожалению, адрес ""%1"" уже занят. Придумайте другой адрес'"),
				СтрокаАдресПриложения());
	КонецЕсли;
	
	Элементы.ДекорацияИмяДоменаПояснение.Заголовок  = СообщениеПроверки;
	Элементы.ДекорацияИмяДоменаПояснение.ЦветТекста = ЦветТекстаСообщения;
	Элементы.ИмяДомена.ЦветТекста = ЦветТекстаЭУ;
	
	
КонецПроцедуры

&НаСервере
Процедура НачатьПодключениеКСервису()
	
	ПодключениеВыполняется = Истина;
	
	Элементы.Подключить.Доступность 		= Ложь;
	Элементы.Ответственный.ТолькоПросмотр 	= Истина;
	Элементы.ИмяДомена.ТолькоПросмотр 		= Истина;
	Элементы.ИмяПриложения.ТолькоПросмотр 	= Истина;
	Элементы.НастройкиПубликации.Доступность = Ложь;
	
	ИмяЗадания 		= "НовоеПриложение";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.СоздатьНовоеПриложениеФоновоеЗадание";
	ИмяДекорации 	= "ГруппаИндикацияДлительнойОперацииПодключение";
	
	ОписаниеПриложения = КабинетСотрудникаМенеджерСервиса.НовоеОписаниеПриложения();
	ОписаниеПриложения.Наименование = СОКРЛП(ИмяПриложения);
	ОписаниеПриложения.ИмяДомена 	= СОКРЛП(ИмяДомена);
	
	ПараметрыМетода = Новый Структура("ИдентификаторИП,ОписаниеПриложения");
	ПараметрыМетода.ИдентификаторИП = ИдентификаторИП;
	ПараметрыМетода.ОписаниеПриложения 			= ОписаниеПриложения;
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура НовоеПриложениеЗавершение(АдресРезультата)
	
	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		КабинетСотрудникаМенеджерСервиса.ОчиститьДанныеПриОтключенииСервиса();
		ТекстСообщения = НСтр("ru = 'При подключении к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИдентификаторПриложения = Результат.ОписаниеПриложения.Идентификатор;
	НачатоСозданиеПриложения = Истина;
	
	ОтложенноеПодключениеКСервису = Результат.ОтложенноеПодключениеКСервису;
	Если ОтложенноеПодключениеКСервису Тогда
		ПараметрыПодключения = КабинетСотрудникаМенеджерСервиса.НовыеПараметрыПодключенияКСервису();
		ПараметрыПодключения.ИдентификаторПриложения 	= ИдентификаторПриложения;
		ПараметрыПодключения.НаименованиеПриложения 	= СОКРЛП(ИмяПриложения);
		ПараметрыПодключения.Ответственный 				= Ответственный;
		ПараметрыПодключения.ПериодыРасчетныхЛистков 	= ПериодыРасчетныхЛистков;
		КабинетСотрудникаМенеджерСервиса.НачатьПодключениеКСервисуВОтложенномРежиме(ПараметрыПодключения);
	Иначе
		ПодключениеВыполняется = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаИндикацияДлительнойОперацииПодключение",
			"Видимость",
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьПроверкуСозданияПриложения()

	ИмяЗадания 		= "ПроверкаСозданияПриложения";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ПроверкаСозданияПриложенияФоновоеЗадание";
	ИмяДекорации 	= "ГруппаИндикацияДлительнойОперацииПодключение";
	
	ПараметрыМетода = Новый Структура("ИдентификаторПриложения");
	ПараметрыМетода.ИдентификаторПриложения = ИдентификаторПриложения;
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура ПроверкаСозданияПриложенияЗавершение(АдресРезультата)
	
	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		ПриложениеНеСоздано = Истина;
		Возврат;
	КонецЕсли;
	
	Если Результат.ОписаниеПриложения <> Неопределено Тогда
		
		СтатусПриложения = Результат.ОписаниеПриложения.Статус;
		Если СтатусПриложения = "working" Тогда
			ПодключениеВыполняется = Истина;
			ОписаниеСозданногоПриложения = Новый ФиксированнаяСтруктура(Результат.ОписаниеПриложения);
			ПриложениеСоздано = Истина;
			КабинетСотрудникаМенеджерСервиса.СохранитьНастройкиПодключенияПриложения(ОписаниеСозданногоПриложения);
		ИначеЕсли СтатусПриложения = "booked" Тогда
			ПодключениеВыполняется = Истина;
			// продолжаем ожидание создания приложения
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаИндикацияДлительнойОперацииПодключение",
				"Видимость",
				Истина);
		Иначе
			// Ошибка создания нового приложения: stopped, error, deleted.
			КабинетСотрудникаМенеджерСервиса.ОчиститьДанныеПриОтключенииСервиса();
			ПриложениеНеСоздано = Истина;
			ТекстСообщения = НСтр("ru = 'При подключении к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	ИначеЕсли Результат.СообщениеОбОшибке <> Неопределено Тогда
		ПриложениеНеСоздано = Истина;
		ТекстСообщения = НСтр("ru = 'При подключении к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьСозданиеИнформационнойСистемы()

	ИмяЗадания 		= "СозданиеИнформационнойСистемы";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.СоздатьИнформационнуюСистемуФоновоеЗадание";
	ИмяДекорации 	= "ГруппаИндикацияДлительнойОперацииПодключение";
	
	ПараметрыМетода = Новый Структура("ОписаниеПриложения,ОписаниеАдминистратора,Ответственный");
	ПараметрыМетода.ОписаниеПриложения = ОписаниеСозданногоПриложения;
	ПараметрыМетода.Ответственный = Ответственный;
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура СозданиеИнформационнойСистемыЗавершение(АдресРезультата)
	
	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		КабинетСотрудникаМенеджерСервиса.ОчиститьДанныеПриОтключенииСервиса();
		ТекстСообщения = НСтр("ru = 'При подключении к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПодключениеВыполняется = Истина;
	ОписаниеИнформационнойСистемы = Результат.ОписаниеИнформационнойСистемы;
	ОписаниеИнформационнойСистемы = Новый ФиксированнаяСтруктура(Результат.ОписаниеИнформационнойСистемы);
	ИнформационнаяСистемаСоздана  = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаИндикацияДлительнойОперацииПодключение",
				"Видимость",
				Истина);
	
КонецПроцедуры

&НаСервере
Процедура НачатьПубликациюОтветственногоЛица()

	ИмяЗадания 		= "ПубликацияОтветственногоЛица";
	ИмяМетода 		= "КабинетСотрудника.ОпубликоватьОтветственноеЛицоФоновоеЗадание";
	ИмяДекорации 	= "ГруппаИндикацияДлительнойОперацииПодключение";
	
	ПараметрыМетода = Новый Структура("Ответственный");
	ПараметрыМетода.Ответственный = Ответственный;
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура ПубликацияОтветственногоЛицаЗавершение(АдресРезультата)
	
	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		КабинетСотрудникаМенеджерСервиса.ОчиститьДанныеПриОтключенииСервиса();
		ТекстСообщения = НСтр("ru = 'При подключении к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПодключениеВыполняется = Истина;
	ОтветственноеЛицоОпубликовано = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаИндикацияДлительнойОперацииПодключение",
				"Видимость",
				Истина);

КонецПроцедуры

&НаСервере
Процедура НачатьСозданиеАдминистратораСервиса()

	ИмяЗадания 		= "СозданиеАдминистратораСервиса";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.СоздатьНовогоАдминистратораПриложенияФоновоеЗадание";
	ИмяДекорации 	= "ГруппаИндикацияДлительнойОперацииПодключение";
	
	ОписаниеАдминистратора = КабинетСотрудникаМенеджерСервиса.НовоеОписаниеАдминистратора();
	ОписаниеАдминистратора.ФизическоеЛицо			= Строка(Ответственный.УникальныйИдентификатор()); 
	ОписаниеАдминистратора.Логин 					= Логин;
	ОписаниеАдминистратора.Телефон 					= МобильныйТелефон;
	ОписаниеАдминистратора.АдресЭлектроннойПочты  	= ЭлектроннаяПочта;
	
	ПараметрыМетода = Новый Структура("ОписаниеАдминистратора,ОписаниеПриложения,Ответственный");
	ПараметрыМетода.ОписаниеАдминистратора 	= ОписаниеАдминистратора;
	ПараметрыМетода.Ответственный 			= Ответственный;
	ПараметрыМетода.ОписаниеПриложения 		= ОписаниеСозданногоПриложения;
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура СозданиеАдминистратораСервисаЗавершение(АдресРезультата)
	
	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		КабинетСотрудникаМенеджерСервиса.ОчиститьДанныеПриОтключенииСервиса();
		ТекстСообщения = НСтр("ru = 'При подключении к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СсылкаДляАдминистратора = Результат.СсылкаДляАдминистратора;
	ПодключениеВыполнено = Истина;
	
	Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	Настройки.Идентификатор = ОписаниеИнформационнойСистемы.Идентификатор;
	Настройки.Наименование  = ОписаниеИнформационнойСистемы.Наименование;
	Настройки.Ответственный = Ответственный;
	Настройки.АбонентСервисаИнициализирован = Истина;
	
	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ИмяДомена", "ТолькоПросмотр", ПодключениеВыполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ИмяПриложения", "ТолькоПросмотр", ПодключениеВыполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"Ответственный", "ТолькоПросмотр", ПодключениеВыполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"НастройкиПубликации", "Доступность", Не ПодключениеВыполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"Подключить", "Доступность", Не ПодключениеВыполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"Этап5", "Видимость", ПодключениеВыполнено);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ВыборАбонента", "ТолькоПросмотр", ПодключениеВыполнено);
		
	УстановитьЗаголовокДекорацияПереходДляАдминистратора();
	КабинетСотрудника.ВключитьНастройкиПрограммыПослеПодключенияСервиса();
	ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры

&НаСервере
Процедура НачатьПолучениеИнформацииОСервисе()
	
	Если МенеджерСервисаДоступен Тогда
		ИмяЗадания 		= "ПолучениеИнформацииОСервисе";
		ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ИнформацияОСервисеФоновоеЗадание";
		ИмяДекорации 	= "";
		ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучениеИнформацииОСервисеЗавершение(АдресРезультата)

	Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаИнформацияОСервисе;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При получении информации о сервисе возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИмяПриложения 		= Результат.ОписаниеПриложения.Наименование;
	СтатусПриложения 	= Результат.ОписаниеПриложения.Статус;
	ОбновитьРеквизитыПоОписаниюАдминистратора(Результат.ОписаниеПриложения.Администратор);
	
	// идентификаторы из абонента сервиса
	ТекущийИдентификаторПользователяИП 	= Результат.Абонент.ИдентификаторПользователяИП;
	ТекущийИдентификаторАбонентаИП 		= Результат.Абонент.ИдентификаторАбонентаИП;
	Если Не ЗначениеЗаполнено(ТекущийИдентификаторПользователяИП) Тогда
		Элементы.ГруппаИзменитьПривязкуАбонента.Видимость = Ложь;
	КонецЕсли;
	ОбновитьРеквизитыОплаты(Результат.Абонент, Результат.СервисЗаблокирован);
		
	Элементы.ИзменитьПривязкуАбонента.Доступность = Истина;
	Элементы.ИзменитьДанныеСервиса.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НачатьОбновлениеСвойствПриложения(НовыеДанныеПриложения)

	ИмяЗадания 		= "ОбновлениеСвойствПриложения";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ОбновитьСвойстваПриложенияФоновоеЗадание";
	ИмяДекорации 	= "ИндикаторДлительнойОперацииОбновлениеПриложения";
	
	ПараметрыМетода = Новый Структура("Идентификатор,ОписаниеПриложения,ОписаниеАдминистратора,Ответственный");
	ПараметрыМетода.Идентификатор = ИдентификаторПриложения;
	
	Если Не ПустаяСтрока(НовыеДанныеПриложения.ИмяПриложения) Тогда
		ОписаниеПриложения = КабинетСотрудникаМенеджерСервиса.НовоеОписаниеПриложения();
		ОписаниеПриложения.Наименование = СОКРЛП(НовыеДанныеПриложения.ИмяПриложения);
		ПараметрыМетода.ОписаниеПриложения = ОписаниеПриложения;
	КонецЕсли;
	Если ЗначениеЗаполнено(НовыеДанныеПриложения.Ответственный) Тогда
		ОписаниеАдминистратора = КабинетСотрудникаМенеджерСервиса.НовоеОписаниеАдминистратора();
		ОписаниеАдминистратора.Логин 					= НовыеДанныеПриложения.Логин;
		ОписаниеАдминистратора.Телефон 					= НовыеДанныеПриложения.МобильныйТелефон;
		ОписаниеАдминистратора.АдресЭлектроннойПочты 	= НовыеДанныеПриложения.ЭлектроннаяПочта;
		ОписаниеАдминистратора.ФизическоеЛицо 			= Строка(НовыеДанныеПриложения.Ответственный.УникальныйИдентификатор());
		ПараметрыМетода.ОписаниеАдминистратора = ОписаниеАдминистратора;
		ПараметрыМетода.Ответственный = НовыеДанныеПриложения.Ответственный;
	КонецЕсли;
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура ОбновлениеСвойствПриложенияЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ОписаниеПриложения) Тогда
		ИмяПриложения 		= Результат.ОписаниеПриложения.Наименование;
		СтатусПриложения 	= Результат.ОписаниеПриложения.Статус;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ОписаниеАдминистратора) Тогда
		ОбновитьРеквизитыПоОписаниюАдминистратора(Результат.ОписаниеАдминистратора);
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При изменении данных возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьИзменениеАбонентаИнтернетПоддержки()

	ИмяЗадания 		= "ИзменениеАбонентаИнтернетПоддержки";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ИзменитьАбонентаИнтернетПоддержкиФоновоеЗадание";
	ИмяДекорации 	= "ИндикаторДлительнойОперацииИзменениеАбонента";
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации);

КонецПроцедуры

&НаСервере
Процедура ИзменениеАбонентаИнтернетПоддержкиЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При изменении данных возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// идентификаторы из абонента сервиса
	ТекущийИдентификаторПользователяИП 	= Результат.Абонент.ИдентификаторПользователяИП;
	ТекущийИдентификаторАбонентаИП 		= Результат.Абонент.ИдентификаторАбонентаИП;
	ОбновитьРеквизитыОплаты(Результат.Абонент, Результат.СервисЗаблокирован);
	
КонецПроцедуры

&НаСервере
Процедура НачатьПубликациюДанных()
	
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ПериодыРасчетныхЛистков);
	ФоновыеЗадания.Выполнить("КабинетСотрудника.ВыполнитьПубликациюПослеПодключенияКСервисуВФоне",
				ПараметрыМетода,
				КабинетСотрудника.КлючФоновогоЗаданияПубликации());
	
КонецПроцедуры

&НаСервере
Процедура НачатьОтключениеСервиса()

	ИмяЗадания 		= "ОтключениеСервиса";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ОтключениеСервисаФоновоеЗадание";
	ИмяДекорации 	= "ГруппаДекорацияОтключениеСервиса";
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации);

КонецПроцедуры

&НаСервере
Процедура ОтключениеСервисаЗавершение(АдресРезультата)

	КабинетСотрудникаМенеджерСервиса.ОчиститьДанныеПриОтключенииСервиса();

КонецПроцедуры

&НаСервере
Процедура НачатьОбновлениеСведенийОбОплате()
	
	ИмяЗадания 		= "ОбновлениеСведенийОбОплате";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ОбновлениеСведенийОбОплатеФоновоеЗадание";
	ИмяДекорации 	= "ИндикаторДлительнойОперацииОбновлениеОплаты";
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации);
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеСведенийОбОплатеЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При обновлении сведений об оплате возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОбновитьРеквизитыОплаты(Результат.Абонент, Результат.СервисЗаблокирован);
	
КонецПроцедуры

&НаСервере
Процедура НачатьПодключениеКСервисуЛокально()
	
	ПодключениеВыполняется = Истина;
	
	ИмяЗадания 		= "ПодключениеКСервисуЛокально";
	ИмяМетода 		= "КабинетСотрудника.ПодключениеКСервисуЛокальноФоновоеЗадание";
	ИмяДекорации 	= "ГруппаИндикацияДлительнойОперацииПодключениеЛокально";
	
	ОписаниеАдминистратора = КабинетСотрудникаМенеджерСервиса.НовоеОписаниеАдминистратора();
	ОписаниеАдминистратора.ФизическоеЛицо			= Строка(Ответственный.УникальныйИдентификатор()); 
	ОписаниеАдминистратора.Логин 					= Логин;
	ОписаниеАдминистратора.Телефон 					= МобильныйТелефон;
	ОписаниеАдминистратора.АдресЭлектроннойПочты  	= ЭлектроннаяПочта;
	
	ПараметрыМетода = Новый Структура("Ответственный,ОписаниеАдминистратора,АдресПриложения,ИдентификаторКлиента,СекретКлиента");
	ПараметрыМетода.АдресПриложения 		= АдресПриложенияЛокально;
	ПараметрыМетода.ИдентификаторКлиента 	= КлючИдентификаторКлиента;
	ПараметрыМетода.СекретКлиента 			= КлючСекретКлиента;
	ПараметрыМетода.Ответственный 			= Ответственный;
	ПараметрыМетода.ОписаниеАдминистратора 	= ОписаниеАдминистратора;
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура ПодключениеКСервисуЛокальноЗавершение(АдресРезультата)

	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(Результат.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	СсылкаДляАдминистратора = Результат.СсылкаДляАдминистратора;
	ПодключениеВыполнено = Истина;
	
	УстановитьЗаголовокДекорацияПереходДляАдминистратора();
	КабинетСотрудника.ВключитьНастройкиПрограммыПослеПодключенияСервиса();
	ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры

&НаСервере
Процедура НачатьОбновлениеОтветственного(НовыеДанные)

	ИмяЗадания 		= "ОбновлениеОтветственного";
	ИмяМетода 		= "КабинетСотрудника.ОбновлениеОтветственногоФоновоеЗадание";
	ИмяДекорации 	= "ИндикаторДлительнойОперацииОбновлениеПриложения";
	
	ОписаниеАдминистратора = КабинетСотрудникаМенеджерСервиса.НовоеОписаниеАдминистратора();
	ОписаниеАдминистратора.ФизическоеЛицо			= Строка(НовыеДанные.Ответственный.УникальныйИдентификатор()); 
	ОписаниеАдминистратора.Логин 					= НовыеДанные.Логин;
	ОписаниеАдминистратора.Телефон 					= НовыеДанные.МобильныйТелефон;
	ОписаниеАдминистратора.АдресЭлектроннойПочты  	= НовыеДанные.ЭлектроннаяПочта;
	
	ПараметрыМетода = Новый Структура("Ответственный,ОписаниеАдминистратора", НовыеДанные.Ответственный, ОписаниеАдминистратора);
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации, ПараметрыМетода);

КонецПроцедуры

&НаСервере
Процедура ОбновлениеОтветственногоЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При изменении данных возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.НовыйОтветственный) Тогда
		Ответственный = Результат.НовыйОтветственный;
		ОбновитьРеквизитыОтветственныйЗаСервис();
		ОбновитьЗаголовокЛичныеКабинеты();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСценарийОтложенногоПодключения()

	ИмяЗадания 		= "ЗавершитьСценарийОтложенногоПодключения";
	ИмяМетода 		= "КабинетСотрудникаМенеджерСервиса.ЗавершитьСценарийОтложенногоПодключенияФоновоеЗадание";
	ИмяДекорации 	= "";
	
	ЗапуститьФоновоеЗадание(ИмяМетода, ИмяЗадания, ИмяДекорации);

КонецПроцедуры


#КонецОбласти

#Область ОбслуживаниеПроверкиИмениДомена

&НаСервере
Процедура ЗаполнитьДанныеДляПроверкиИмениДомена()
	
	СтрокаСимволы = "abcdefghijklmnopqrstuvwxyz0123456789-";
	РазрешенныеСимволы = Новый Соответствие;
	Для Позиция = 1 По СтрДлина(СтрокаСимволы) Цикл
		РазрешенныеСимволы.Вставить(Сред(СтрокаСимволы,Позиция,1), Истина);
	КонецЦикла;
	РазрешенныеСимволыИмениДомена = Новый ФиксированноеСоответствие(РазрешенныеСимволы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИмяДомена(Текст = Неопределено)
	
	ПроверятьОкончание = Истина;
	Если Текст <> Неопределено Тогда
		ПроверяемаяСтрока = Текст;
		ПроверятьОкончание = Ложь;
	Иначе
		ПроверяемаяСтрока = ИмяДомена;
	КонецЕсли;
	КоличествоСимволов = СтрДлина(ПроверяемаяСтрока);
	
	СообщенияПроверки = "";
	Если СтрНачинаетсяС(ПроверяемаяСтрока, "-") Тогда
		СообщенияПроверки = НСтр("ru = 'Адрес может начинаться только с буквы или цифры'");
	ИначеЕсли ПроверятьОкончание И СтрЗаканчиваетсяНа(ПроверяемаяСтрока, "-") Тогда
		СообщенияПроверки = НСтр("ru = 'Адрес должен заканчиваться буквой или цифрой'");
	ИначеЕсли СтрНайти(ПроверяемаяСтрока, "--") > 0 Тогда
		СообщенияПроверки = НСтр("ru = 'Адрес не может содержать два дефиса подряд'");
	Иначе
		ПроверяемаяСтрока = НРег(ПроверяемаяСтрока);
		ЗапрещенныеСимволы = "";
		Для Позиция = 1 По КоличествоСимволов Цикл
			СимволИмени = Сред(ПроверяемаяСтрока, Позиция, 1);
			Если РазрешенныеСимволыИмениДомена.Получить(СимволИмени) = Неопределено Тогда
				ЗапрещенныеСимволы = ЗапрещенныеСимволы + ?(ПустаяСтрока(ЗапрещенныеСимволы),"",",") + """" +СимволИмени + """";
			КонецЕсли;
		КонецЦикла;
		Если Не ПустаяСтрока(ЗапрещенныеСимволы) Тогда
			СообщенияПроверки = НСтр("ru = 'В адресе используются неразрешенные символы:'") + " ";
			СообщенияПроверки = СтрШаблон("%1 %2", СообщенияПроверки, ЗапрещенныеСимволы);
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(СообщенияПроверки) Тогда
		Если ПроверятьОкончание И КоличествоСимволов < 3 Тогда
			СообщенияПроверки = НСтр("ru = 'Длина адреса должна быть от 3 до 63 символов'");
		ИначеЕсли КоличествоСимволов > 63 Тогда
			СообщенияПроверки = НСтр("ru = 'Длина адреса должна быть от 3 до 63 символов'");
		КонецЕсли;
	КонецЕсли;
	
	СообщениеПроверкиИмениДомена = СообщенияПроверки;
	
	Если ПустаяСтрока(СообщенияПроверки) Тогда
		ЦветТекста 			= ЦветСтиляТекстаПоля;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийТекст;
	Иначе
		ЦветТекста 			= ЦветСтиляПоясняющийОшибкуТекст;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийОшибкуТекст;
	КонецЕсли;
	
	Элементы.ИмяДомена.ЦветТекста 					= ЦветТекста;
	Элементы.ДекорацияИмяДоменаПояснение.Заголовок  = СообщениеПроверкиИмениДомена;
	Элементы.ДекорацияИмяДоменаПояснение.ЦветТекста = ЦветТекстаСообщения;
	
	Если ПроверятьОкончание Тогда
		ИмяДоменаСоответствуетПравилам = ПустаяСтрока(СообщенияПроверки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтветственноеЛицо

&НаСервере
Процедура ЗаполнитьОтветственного()

	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ФизическоеЛицо");
		ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол, ОтветственныйНаименование);
	КонецЕсли;
	ОбновитьЭУОтветственный(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол, ОтветственныйНаименование)
	
	Логин 			 = "";
	ЭлектроннаяПочта = "";
	МобильныйТелефон = "";
	Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РеквизитыОбъекта =  ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ответственный, "Фамилия,ФИО,Инициалы,Пол");
	УстановитьПривилегированныйРежим(Ложь);
	Пол = РеквизитыОбъекта["Пол"];
	Инициалы = СтрЗаменить(РеквизитыОбъекта["Инициалы"],".","");
	Инициалы = СтрЗаменить(Инициалы," ","");
	Логин = СтрШаблон("%1%2", РеквизитыОбъекта["Фамилия"], Инициалы);
	ОтветственныйНаименование = РеквизитыОбъекта["ФИО"];
	
	ВидыКонтактнойИнформации = Новый Массив;
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	
	УстановитьПривилегированныйРежим(Истина);
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
								ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответственный),,ВидыКонтактнойИнформации);
	УстановитьПривилегированныйРежим(Ложь);
	Для каждого СтрокаТЗ Из КонтактнаяИнформация Цикл
		Если СтрокаТЗ.Вид = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица Тогда
			ЭлектроннаяПочта = СтрокаТЗ.Представление;
		ИначеЕсли СтрокаТЗ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица Тогда
			МобильныйТелефон = СтрокаТЗ.Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУОтветственный(Форма)
	
	Элементы = Форма.Элементы;
	Форма.ДанныеОтветственногоЗаполнены = Ложь;
	
	Если Форма.СервисКабинетСотрудникаВЛокальнойСети Тогда
		ДекорацияТелефонПочтаОтветственного 		= Элементы.ДекорацияТелефонПочтаОтветственногоЛокально;
		ДекорацияРеквизитыОтветственногоПояснение 	= Элементы.ДекорацияРеквизитыОтветственногоПояснениеЛокально;
	Иначе
		ДекорацияТелефонПочтаОтветственного 		= Элементы.ДекорацияТелефонПочтаОтветственного;
		ДекорацияРеквизитыОтветственногоПояснение 	= Элементы.ДекорацияРеквизитыОтветственногоПояснение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.Ответственный) Тогда
		ДекорацияТелефонПочтаОтветственного.Заголовок = НСтр("ru = 'Укажите ответственное лицо'");
		ДекорацияРеквизитыОтветственногоПояснение.Заголовок = НСтр("ru = 'Убедитесь в том, что у ответственного лица задан действующий мобильный телефон и адрес электронной почты'");
		ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляИнформационнойНадписи;
	Иначе
		
		ТелефонУказан = Ложь;
		ТелефонСоответствуетТребованиям = Ложь;
		Если ЗначениеЗаполнено(Форма.МобильныйТелефон) Тогда
			СтрокаТелефон = СокрЛП(Форма.МобильныйТелефон);
			ТелефонУказан = Истина;
			ТелефонСоответствуетТребованиям = (Лев(СтрокаТелефон,1) = "+") И СтрНайти("123456789", Сред(СтрокаТелефон, 2, 1)) <> 0;
		Иначе
			СтрокаТелефон = НСтр("ru = '<телефон не указан>'");
		КонецЕсли;
		
		ПочтаУказана = Ложь;
		ПочтаСоответствуетТребованиям = Ложь;
		Если ЗначениеЗаполнено(Форма.ЭлектроннаяПочта) Тогда
			СтрокаПочта = СОКРЛП(Форма.ЭлектроннаяПочта);
			ПочтаУказана = Истина;
			ПочтаСоответствуетТребованиям = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Форма.ЭлектроннаяПочта);
		Иначе
			СтрокаПочта = НСтр("ru = '<Email не указан>'");
		КонецЕсли;
		
		СтрокаТелефонПочта = СтрШаблон(НСтр("ru = 'Мобильный телефон и почта: %1, %2'"), СтрокаТелефон, СтрокаПочта);
		ДекорацияТелефонПочтаОтветственного.Заголовок = СтрокаТелефонПочта;
		
		Если ТелефонУказан И ТелефонСоответствуетТребованиям И ПочтаУказана И ПочтаСоответствуетТребованиям И ЗначениеЗаполнено(Форма.Пол) Тогда
			ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляИнформационнойНадписи;
			ДекорацияРеквизитыОтветственногоПояснение.Заголовок = НСтр("ru = 'Убедитесь в том, что у ответственного лица задан действующий мобильный телефон и адрес электронной почты'");
			Форма.ДанныеОтветственногоЗаполнены = Истина;
		Иначе
			
			Если ТелефонУказан И ТелефонСоответствуетТребованиям И ПочтаУказана И ПочтаСоответствуетТребованиям Тогда
				СообщениеОбОшибке =НСтр("ru = 'Заполните, пожалуйста, пол ответственного'");
			Иначе
				
				СообщениеНеУказанПол = "";
				Если Не ЗначениеЗаполнено(Форма.Пол) Тогда
					СообщениеНеУказанПол = НСтр("ru = ', не указан пол'");
				КонецЕсли;
				
				СообщениеПочтаСоответствуетТребованиям = "";
				Если ПочтаУказана И Не ПочтаСоответствуетТребованиям Тогда
					СообщениеПочтаСоответствуетТребованиям = НСтр("ru = ', адрес электронной почты указан некорректно'");
				КонецЕсли;
				
				СообщениеТелефонСоответствуетТребованиям = "";
				Если ТелефонУказан И Не ТелефонСоответствуетТребованиям Тогда
					Если (Лев(СтрокаТелефон,1) <> "+") Тогда
						СообщениеТелефонСоответствуетТребованиям = НСтр("ru = ', номер телефон должен начинаться с символа ""+""'");
					Иначе
						СообщениеТелефонСоответствуетТребованиям = НСтр("ru = ', код страны в мобильном телефоне указан некорректно'");
					КонецЕсли;
				КонецЕсли;
				
				СообщениеОбОшибке = СтрШаблон(
					НСтр("ru = 'Заполните, пожалуйста, контактные данные ответственного%1%2%3'"),
					СообщениеТелефонСоответствуетТребованиям,
					СообщениеПочтаСоответствуетТребованиям,
					СообщениеНеУказанПол);
				
			КонецЕсли;
			
			ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляПоясняющийОшибкуТекст;
			ДекорацияРеквизитыОтветственногоПояснение.Заголовок = СообщениеОбОшибке;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОжидания

&НаКлиенте
Процедура ПроверкаСозданияПриложения()
	
	Если АктивноеЗадание <> Неопределено И АктивноеЗадание.Имя = "ПроверкаСозданияПриложения" Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПроверкуСозданияПриложения();
	ПриНачалеЗадания();

КонецПроцедуры

&НаКлиенте
Процедура ОтложенноеОбновлениеИнтерфейса()

	ОбновитьИнтерфейс();

КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьОтветственноеЛицо()

	НачатьПубликациюОтветственногоЛица();
	ПриНачалеЗадания();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьАдминистратораСервиса()

	НачатьСозданиеАдминистратораСервиса();
	ПриНачалеЗадания();	

КонецПроцедуры

&НаКлиенте
Процедура ФайлНастроекПослеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АдресПриложенияЛокально 	= "";
	КлючИдентификаторКлиента 	= "";
	КлючСекретКлиента 			= "";
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВыбранныеФайлы[0]), УникальныйИдентификатор);
	Результат = НастройкиИзФайлаНаСервере(АдресФайла);
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ПоказатьПредупреждение(,Результат.СообщениеОбОшибке);
	Иначе
		АдресПриложенияЛокально 	= Результат.Настройки["url"];
		КлючИдентификаторКлиента 	= Результат.Настройки["clientID"];
		КлючСекретКлиента 			= Результат.Настройки["clientSecret"];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещения

&НаКлиенте
Процедура ОбновитьИнформациюПодключения(Результат, Параметры) Экспорт

	ОбновитьИнформациюПодключенияНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюПодключенияНаСервере()
	
	Если СервисПодключен Тогда
		ОбновитьЗаголовокЛичныеКабинеты();
	Иначе	
		ОбновитьСообщениеОПубликации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанныеСервисаЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.ИмяПриложения) И Не ЗначениеЗаполнено(Результат.Ответственный) Тогда
		Возврат;
	КонецЕсли;
	
	Если СервисКабинетСотрудникаВЛокальнойСети Тогда
		НачатьОбновлениеОтветственного(Результат);
	Иначе
		НачатьОбновлениеСвойствПриложения(Результат);
	КонецЕсли;
	ПриНачалеЗадания();
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПривязкуАбонентаЗавершение(Результат, Параметры) Экспорт

	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	НачатьИзменениеАбонентаИнтернетПоддержки();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьНаКлиентеПубликациюРасчетныхЛистков(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		Если ДлительнаяОперация.Статус = "Ошибка" Тогда
			ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
			Возврат;
		Иначе
			ТекстСообщения = НСтр("ru = 'Публикация расчетных листков выполнена.'");
			ПоказатьПредупреждение(, ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, Параметры) Экспорт

	Если Результат <> Неопределено Тогда
		Если ФормаВРежимеПодключения Тогда
			НачатьПолучениеАбонентов();
			ПриНачалеЗадания();
		Иначе
			ИзменитьАбонентаСервиса();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОтключитьСервис(КодВозврата, ДополнительныеПараметры) Экспорт

	Если КодВозврата <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЛичныеКабинеты.Доступность 				= Ложь;
	Элементы.РасчетныеЛистки.Доступность 				= Ложь;
	Элементы.ДополнительнаяИнформацияСервис.Доступность = Ложь;
	Элементы.ВариантОтключенияСервиса.Доступность 		= Ложь;
	Элементы.ОтключитьСервис.Доступность 				= Ложь;
	Элементы.ДекорацияОтключениеСервиса.Доступность 	= Ложь;
	
	Если ВариантОтключенияСервиса = 0 Тогда
		ОчиститьДанныеПриОтключенииСервиса();
		СервисОтключенСообщитьПользователю();
		ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
	Иначе
		НачатьОтключениеСервиса();
		ПриНачалеЗадания();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СервисОтключенСообщитьПользователю()
	
	ТекстСообщения = НСтр("ru = 'Сервис отключен.'");
	ПоказатьПредупреждение(,ТекстСообщения);

КонецПроцедуры


#КонецОбласти

&НаСервере
Процедура ОбновитьРеквизитыПоОписаниюАдминистратора(ОписаниеАдминистратора)
	
	Логин 				= ОписаниеАдминистратора.Логин;
	МобильныйТелефон 	= СОКРЛП(ОписаниеАдминистратора.Телефон);
	ЭлектроннаяПочта 	= СОКРЛП(ОписаниеАдминистратора.АдресЭлектроннойПочты);
	СсылкаСтрока 		= ОписаниеАдминистратора.ФизическоеЛицо;
	Если Не ПустаяСтрока(СсылкаСтрока) Тогда
		ОтветственныйСсылка = Неопределено;
		Попытка
			ОтветственныйСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(СсылкаСтрока));
		Исключение
			ОтветственныйСсылка = Неопределено;
		КонецПопытки;
		Если ЗначениеЗаполнено(ОтветственныйСсылка) И ОбщегоНазначения.СсылкаСуществует(ОтветственныйСсылка) Тогда
			Ответственный = ОтветственныйСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответственный) Тогда
		Элементы.ОтветственныйЗаСервис.Видимость = Истина;
		Элементы.Логин.Видимость = Ложь;
	Иначе
		Элементы.ОтветственныйЗаСервис.Видимость = Ложь;
		Элементы.Логин.Видимость = Истина;
	КонецЕсли;
	
	СтрокаТелефонПочта = СтрШаблон(НСтр("ru = 'Мобильный телефон и почта, указанные в сервисе: %1, %2'"), МобильныйТелефон, ЭлектроннаяПочта);
	Элементы.ДекорацияТелефонПочтаОтветственногоЗаСервис.Заголовок = СтрокаТелефонПочта;
	
	ОбновитьЗаголовокЛичныеКабинеты();

КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыОплаты(АбонентСервиса, СервисЗаблокирован)

	ИспользуетсяПробныйПериод 			= АбонентСервиса.ИспользуетсяПробныйПериод;
	ОплаченоКабинетов 					= АбонентСервиса.ОплаченоКабинетов;
	НаименованиеАбонента 				= АбонентСервиса.Наименование;
	КоличествоАктивированныхКабинетов 	= АбонентСервиса.КоличествоАктивированныхКабинетов;
	
	Если ЗначениеЗаполнено(АбонентСервиса.ДатаОкончанияПробногоПериода) Тогда
		ДатаОкончанияПробногоПериода = АбонентСервиса.ДатаОкончанияПробногоПериода;
	КонецЕсли;
	Если ЗначениеЗаполнено(АбонентСервиса.ДатаОкончанияОплаченногоПериода) Тогда
		ДатаОкончанияОплаченногоПериода = АбонентСервиса.ДатаОкончанияОплаченногоПериода;
	КонецЕсли;
	
	Строка1 = "";
	Если ИспользуетсяПробныйПериод И ЗначениеЗаполнено(ДатаОкончанияПробногоПериода) Тогда
		ШаблонСтроки = НСтр("ru = 'Используется пробный период по: %1'");
		Строка1 = СтрШаблон(ШаблонСтроки, Формат(ДатаОкончанияПробногоПериода, "ДЛФ=D"));
	КонецЕсли;
	Строка2 = "";
	Если ОплаченоКабинетов > 0 Тогда
		ШаблонСтроки = НСтр("ru = 'Оплачено кабинетов: %1 по %2'");
		Строка2 = СтрШаблон(ШаблонСтроки, ОплаченоКабинетов, Формат(ДатаОкончанияОплаченногоПериода, "ДЛФ=D"));
	Иначе
		Строка2 = НСтр("ru = 'Нет оплаченных кабинетов'");
	КонецЕсли;
	Строка3 = "";
	Если КоличествоАктивированныхКабинетов <> Неопределено Тогда
		Если КоличествоАктивированныхКабинетов > 0 Тогда
			ШаблонСтроки = НСтр("ru = 'Создано кабинетов: %1'");
			Строка3 = СтрШаблон(ШаблонСтроки, КоличествоАктивированныхКабинетов);
		Иначе
			Строка3 = НСтр("ru = 'Нет созданных кабинетов'");
		КонецЕсли;
	КонецЕсли;
	ПереводСтроки = Символы.ПС;
	СтрокаСостояниеОплаты = СтрШаблон("%1%2%3%4%5", Строка1, ?(ПустаяСтрока(Строка1),"",ПереводСтроки), Строка2, ?(ПустаяСтрока(Строка2),"",ПереводСтроки), Строка3);
	Элементы.ДекорацияСостояниеОплаты.Заголовок = СтрокаСостояниеОплаты;
	
	ЗаголовокСервисЗаблокирован = "";
	Если СервисЗаблокирован <> Неопределено Тогда
		РегистрыСведений.НастройкиСервисаКабинетСотрудника.УстановитьСостояниеБлокировкиСервиса(СервисЗаблокирован);
		Если СервисЗаблокирован Тогда
			Если ОплаченоКабинетов = 0 Тогда
				ЗаголовокСервисЗаблокирован = НСтр("ru = 'Доступ к сервису ограничен: закончился оплаченный (тестовый) период'");
			Иначе
				ЗаголовокСервисЗаблокирован = НСтр("ru = 'Доступ к сервису ограничен: превышен оплаченный лимит на создание личных кабинетов'");
			КонецЕсли;
		КонецЕсли;
		Элементы.ДекорацияБлокировкаСервиса.Заголовок = ЗаголовокСервисЗаблокирован;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияБлокировкаСервиса", "Видимость", Не ПустаяСтрока(ЗаголовокСервисЗаблокирован));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИмяПриложения()
	
	УстановитьПривилегированныйРежим(Истина);
	ИмяПриложения = Константы.ЗаголовокСистемы.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПустаяСтрока(ИмяПриложения) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации";
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
		УстановитьПривилегированныйРежим(Ложь);
		Если РезультатЗапроса.Количество() = 1 Тогда
			ИмяПриложения = РезультатЗапроса[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтрокаАдресПриложения()
	
	ИмяДоменаВАдрес = ?(ПустаяСтрока(ИмяДомена),"<"+НСтр("ru = 'ваш сервис'")+">",СОКРЛП(ИмяДомена));
	Возврат СтрШаблон("%1%2",ИмяДоменаВАдрес,".1c-cabinet.ru");

КонецФункции

&НаСервере
Процедура ОбновитьСообщениеОПубликации()
	
	АдресПриложения = СтрокаАдресПриложения();
	Если ПериодыРасчетныхЛистков.Количество() = 0  Тогда
		ПредставлениеПериода = "";
	Иначе
		Дата2 = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(ПериодыРасчетныхЛистков[0]);
		Дата1 = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(ПериодыРасчетныхЛистков[1]);
		ПредставлениеПериода = СтрШаблон("%1 - %2", Дата1, Дата2);
	КонецЕсли;
	ПредставлениеПериода = "";
	
	СтрокаШаблон = НСтр("ru = 'При нажатии кнопки Подключить по адресу ""%1"" будут опубликованы данные ответственного лица'");
	СтрокаСообщения = СтрШаблон(СтрокаШаблон, АдресПриложения);
	ДопСтрокаСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОшибкиЗаполнения.ЕстьОшибки КАК ЕстьОшибки
	|ИЗ
	|	РегистрСведений.ПубликуемыеОбъектыКабинетСотрудника КАК ПубликуемыеОбъектыКабинетСотрудника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ПубликуемыеОбъектыКабинетСотрудника.ОбъектПубликации = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника КАК ОшибкиЗаполнения
	|		ПО (Сотрудники.ФизическоеЛицо = ОшибкиЗаполнения.ОбъектПубликации)";
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеКабинеты = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	Если ПубликуемыеКабинеты.Количество() > 0 Тогда
		
		КоличествоКабинетов = ПубликуемыеКабинеты.Количество();
		НайденныеСтроки = ПубликуемыеКабинеты.НайтиСтроки(Новый Структура("ЕстьОшибки", Истина));
		КоличествоОшибок = НайденныеСтроки.Количество();
		ПубликуемыхКабинетов = КоличествоКабинетов - КоличествоОшибок;
		
		НайденныеСтроки = ПубликуемыеКабинеты.НайтиСтроки(Новый Структура("ФизическоеЛицо", Ответственный));
		ОтветственныйПубликуется = (НайденныеСтроки.Количество() > 0);
		
		Если Не ОтветственныйПубликуется Тогда
			
			Если ПубликуемыхКабинетов = 1 Тогда
				Если ПустаяСтрока(ПредставлениеПериода) Тогда
					СтрСообщение = НСтр("ru = 'и данные 1 сотрудника'");
					ДопСтрокаСообщения = СтрШаблон(" %1", СтрСообщение);
				Иначе
					СтрСообщение = НСтр("ru = 'данные 1 сотрудника и его расчетные листки за'");
					ДопСтрокаСообщения = СтрШаблон(", %1 %2", СтрСообщение, ПредставлениеПериода);
				КонецЕсли;
			ИначеЕсли ПубликуемыхКабинетов > 1 Тогда
				Если ПустаяСтрока(ПредставлениеПериода) Тогда
					СтрСообщение = НСтр("ru = 'и данные %1 сотрудников'");
					СтрСообщение = СтрШаблон(СтрСообщение, ПубликуемыхКабинетов);
					ДопСтрокаСообщения = СтрШаблон(" %1", СтрСообщение);
				Иначе
					СтрСообщение = НСтр("ru = 'данные %1 сотрудников и их расчетные листки за'");
					СтрСообщение = СтрШаблон(СтрСообщение, ПубликуемыхКабинетов);
					ДопСтрокаСообщения = СтрШаблон(", %1 %2", СтрСообщение, ПредставлениеПериода);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Если ПубликуемыхКабинетов = 1 Тогда
				Если Не ПустаяСтрока(ПредставлениеПериода) Тогда
					СтрСообщение = НСтр("ru = 'и его расчетные листки за'");
					ДопСтрокаСообщения = СтрШаблон(" %1 %2", СтрСообщение, ПредставлениеПериода);
				КонецЕсли;
			ИначеЕсли ПубликуемыхКабинетов > 1 Тогда
				ПериодРасчетныхЛистков = "";
				Если Не ПустаяСтрока(ПредставлениеПериода) Тогда
					СтрокаШаблон = НСтр("ru = 'и их расчетные листки за %1'");
					ПериодРасчетныхЛистков = СтрШаблон(СтрокаШаблон, ПредставлениеПериода);
				КонецЕсли;
				СтрокаШаблон = НСтр("ru = 'При нажатии кнопки Подключить по адресу ""%1"" будут опубликованы данные %2 сотрудников %3'");
				Строка1 = СтрШаблон(СтрокаШаблон, АдресПриложения, ПубликуемыхКабинетов, ПериодРасчетныхЛистков);
				Строка2 = НСтр("ru = 'Эти данные будут доступны только сотрудникам и их руководителям.'");
				СтрокаСообщения = СтрШаблон("%1" + Символы.ПС + "%2", Строка1, Строка2);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	СтрокаСообщения = СтрШаблон("%1%2", СтрокаСообщения, ДопСтрокаСообщения);
	Элементы.ДекорацияПодключениеОписание.Заголовок = СтрокаСообщения;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПериодРасчетныхЛистков()

	ПериодРасчетныхЛистков = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачислениеЗарплаты.МесяцНачисления КАК МесяцНачисления
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцНачисления УБЫВ";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Периоды = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Периоды.Добавить(Выборка.МесяцНачисления);
		Периоды.Добавить(ДобавитьМесяц(Выборка.МесяцНачисления,-1));
	КонецЕсли;
	 
	ПериодыРасчетныхЛистков = Новый ФиксированныйМассив(Периоды);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокДекорацияПереходДляАдминистратора()
	
	ШаблонЗаголовка = НСтр("ru = '<body>Сервис 1С:Кабинет сотрудника подключен.
	|Если вы - %1, тогда <a href=""%2"">%3</a> для авторизации в сервисе.</body>'");
	
	СтрокаЗаголовка = СтрШаблон(ШаблонЗаголовка, Строка(Ответственный), СсылкаДляАдминистратора, НСтр("ru = 'перейдите сюда'"));
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML("<html>" + СтрокаЗаголовка + "</html>", Новый Структура);
	Элементы.ДекорацияПереходДляАдминистратора.Заголовок =ФорматированныйДокумент.ПолучитьФорматированнуюСтроку();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОСервисеИзНастроекПрограммы()

	СтруктураНастроек = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	АдресПриложения 		= СтруктураНастроек.АдресПриложения;
	ИдентификаторПриложения = СтруктураНастроек.ИдентификаторПриложения;
	ИмяПриложения 			= СтруктураНастроек.НаименованиеПриложения;
	Ответственный           = СтруктураНастроек.Ответственный;
	
	ШаблонЗаголовка = НСтр("ru = '<body>Адрес приложения: <a href=""%1"">%2</a></body>'");
	СтрокаЗаголовка = СтрШаблон(ШаблонЗаголовка, АдресПриложения, АдресПриложения);
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML("<html>" + СтрокаЗаголовка + "</html>", Новый Структура);
	Элементы.ДекорацияАдресПриложения.Заголовок = ФорматированныйДокумент.ПолучитьФорматированнуюСтроку();
	
	ВариантОтключенияСервиса = 0;
	Элементы.ВариантОтключенияСервиса.Видимость = Не СервисКабинетСотрудникаВЛокальнойСети;
	
	ШаблонЗаголовка = НСтр("ru = 'При отключении будет удален сервис по адресу %1 и все его данные.
		|Для повторного подключения к сервису необходимо будет заново создать все кабинеты сотрудников и разослать приглашения.'");
	ЗаголовокУдалениеСервиса = СтрШаблон(ШаблонЗаголовка, АдресПриложения);
	ШаблонЗаголовка = НСтр("ru = 'При отключении данные больше не будут публиковаться в сервисе, будут удалены все настройки подключения.
		|Сервис по адресу %1 не будет удален.'");
	ЗаголовокОтключениеСервиса = СтрШаблон(ШаблонЗаголовка, АдресПриложения);
	
	УстановитьЗаголовокДекорацияОтключениеСервиса(ЭтаФорма);
	
	ОбновитьРеквизитыОтветственныйЗаСервис();
	ОбновитьЗаголовокЛичныеКабинеты();
	
	СтрокаШаблон = НСтр("ru = 'Последние опубликованные расчетные листки:'");
	УстановитьПривилегированныйРежим(Истина);
	МесяцПубликацииПоследней = РегистрыСведений.РасчетныеЛисткиКабинетСотрудника.МесяцПубликацииРасчетныхЛистков();
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(МесяцПубликацииПоследней) Тогда
		МесяцПубликации = ДобавитьМесяц(МесяцПубликацииПоследней, 1);
		МесяцПубликацииРасчетныхЛистков = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(МесяцПубликацииПоследней);
	Иначе
		МесяцПубликации = НачалоМесяца(ТекущаяДатаСеанса());
		МесяцПубликацииРасчетныхЛистков = НСтр("ru = 'Публикация не выполнялась'");
	КонецЕсли;
	Элементы.ДекорацияРасчетныеЛисткиПубликация.Заголовок = СтрШаблон("%1 %2", СтрокаШаблон, МесяцПубликацииРасчетныхЛистков);
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой");
	
	СтрокаСостояниеОплаты = НСтр("ru = 'Информация об оплаченных кабинетах отсутствует'");
	Элементы.ДекорацияСостояниеОплаты.Заголовок = СтрокаСостояниеОплаты;
	
	Элементы.ДекорацияТребуетсяПодключениеИП.Видимость = Не ИнтернетПоддержкаПодключена;
	Элементы.ГруппаАбонентСервиса.Видимость 	= Не СервисКабинетСотрудникаВЛокальнойСети;
	Элементы.ГруппаНазваниеСервиса.Видимость 	= Не СервисКабинетСотрудникаВЛокальнойСети;
	
	МенеджерСервисаДоступен = КабинетСотрудникаМенеджерСервиса.МенеджерСервисаДоступен();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокДекорацияОтключениеСервиса(Форма)

	Если Форма.ВариантОтключенияСервиса = 0 Тогда
		Форма.Элементы.ДекорацияОтключениеСервиса.Заголовок = Форма.ЗаголовокОтключениеСервиса;
	Иначе
		Форма.Элементы.ДекорацияОтключениеСервиса.Заголовок = Форма.ЗаголовокУдалениеСервиса;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокЛичныеКабинеты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ФизическиеЛица.ФизическоеЛицо) КАК Количество,
	|	КОЛИЧЕСТВО(ОшибкиЗаполнения.ЕстьОшибки) КАК КоличествоСОшибками
	|ИЗ
	|	РегистрСведений.ФизическиеЛицаКабинетСотрудника КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника КАК ОшибкиЗаполнения
	|		ПО ФизическиеЛица.ФизическоеЛицо = ОшибкиЗаполнения.ОбъектПубликации";
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	ПубликуемыхКабинетов = 0;
	КоличествоКабинетовСОшибками = 0;
	Если Выборка.Следующий() Тогда
		ПубликуемыхКабинетов = Выборка.Количество - Выборка.КоличествоСОшибками;
		КоличествоКабинетовСОшибками = Выборка.КоличествоСОшибками;
	КонецЕсли;
	
	СтрокаШаблон =  НСтр("ru = 'Сейчас в сервисе публикуются данные для %1'");
	Если ПубликуемыхКабинетов = 1 Тогда
		СтрокаПодстановки = НСтр("ru = '1 сотрудника'");
	Иначе
		СтрокаПодстановки = СтрШаблон(НСтр("ru = '%1 сотрудников'"), ПубликуемыхКабинетов);
	КонецЕсли;
	ТекстСообщения = СтрШаблон(СтрокаШаблон, СтрокаПодстановки);
	Элементы.ДекорацияЛичныеКабинеты.Заголовок = ТекстСообщения;
	
	ЕстьОшибкиЗаполнения = (КоличествоКабинетовСОшибками > 0);
	Элементы.ОшибкиЗаполнения.Видимость = ЕстьОшибкиЗаполнения;
	Элементы.ДекорацияЛичныеКабинетыОшибки.Видимость = ЕстьОшибкиЗаполнения;
	Если ЕстьОшибкиЗаполнения Тогда
		СтрокаШаблон =  НСтр("ru = 'Не публикуются данные из-за ошибок заполнения для %1'");
		Если КоличествоКабинетовСОшибками = 1 Тогда
			СтрокаПодстановки = НСтр("ru = '1 сотрудника'");
		Иначе
			СтрокаПодстановки = СтрШаблон(НСтр("ru = '%1 сотрудников'"), КоличествоКабинетовСОшибками);
		КонецЕсли;
		ТекстСообщенияНеПубликуется = СтрШаблон(СтрокаШаблон, СтрокаПодстановки);
		Элементы.ДекорацияЛичныеКабинетыОшибки.Заголовок = ТекстСообщенияНеПубликуется;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОпубликоватьРасчетныеЛисткиНаСервере()
	
	ДлительнаяОперация = Неопределено;
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания",
		СтрШаблон(НСтр("ru = 'Выгрузка расчетных листов в 1С:Кабинет сотрудника'")));
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"КабинетСотрудника.ОпубликоватьРасчетныеЛистыЗаМесяцВФоне",
		Новый Структура("Месяц", МесяцПубликации),
		ПараметрыВыполненияВФоне);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Процедура ПерейтиКНовомуПодключению()

	РегистрыСведений.СостояниеОтложенногоПодключенияКСервису.СоздатьНаборЗаписей().Записать();
	ВыполнитьНачальноеЗаполнение();

КонецПроцедуры

&НаСервере
Процедура ВыполнитьНачальноеЗаполнение()

	НачатьСценарийПодключения 						= Ложь;
	НачатьПолучениеИнформацииОСервисе 				= Ложь;
	ОтложенноеПодключениеКСервису 					= Ложь;
	ЗавершитьСценарийОтложенногоПодключения 		= Ложь;
	Элементы.СоздатьНовоеПодключение.Видимость 		= Ложь;
	
	СтрокаЗаголовок = НСтр("ru = '1С:Кабинет сотрудника. Подключение'");
	
	СервисКабинетСотрудникаВЛокальнойСети = Константы.СервисКабинетСотрудникаВЛокальнойСети.Получить();
	СервисПодключен = Константы.ИспользуетсяСервисКабинетСотрудника.Получить();
	СостояниеПодключения = РегистрыСведений.СостояниеОтложенногоПодключенияКСервису.СостояниеПодключенияКСервису();
	Если ЗначениеЗаполнено(СостояниеПодключения.Состояние) Тогда
		// Используется отложенное подключение к сервису.
		Если СостояниеПодключения.Состояние = Перечисления.СостоянияПодключенияКабинетСотрудника.Создано Тогда
			// подключение выполнено
			Если Не СервисПодключен Тогда
				СервисПодключен = Истина;
				ТребуетсяОбновитьИнтерфейс = Истина;
				ЗавершитьСценарийОтложенногоПодключения = Истина;
				УстановитьПривилегированныйРежим(Истина);
				Константы.ИспользуетсяСервисКабинетСотрудника.Установить(Истина);
				// удаляем сведения отложенного подключения
				РегистрыСведений.СостояниеОтложенногоПодключенияКСервису.СоздатьНаборЗаписей().Записать();
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		Иначе
			ИдентификаторПриложения = СостояниеПодключения.ИдентификаторПриложения;
			ОтложенноеПодключениеКСервису = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если СервисПодключен Тогда
		
		СтрокаЗаголовок = НСтр("ru = '1С:Кабинет сотрудника'");
		Элементы.СостояниеСервиса.Видимость = Истина;
		
		// Выключаем страницы, чтобы не было полосы прокрутки.
		Элементы.ПодключениеКСервису.Видимость = Ложь;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииОбновлениеПриложения", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииИзменениеАбонента", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДекорацияОтключениеСервиса", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииОбновлениеОплаты", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаПодключениеВыполнено", "Видимость", ФормаВРежимеПодключения);
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СостояниеСервиса;
		Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаИнформацияОСервисе;
		
		Если ЭтоАвтономноеРабочееМесто Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"СостояниеСервиса", "ТолькоПросмотр", Истина);
		Иначе
			
			Если Не СервисКабинетСотрудникаВЛокальнойСети Тогда
				
				НачатьПолучениеИнформацииОСервисе = Истина;
				
				Если РазделениеВключено Тогда
					ИнтернетПоддержкаПодключена = Истина;
					Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
					Если Не Настройки.АбонентСервисаИнициализирован Тогда
						КабинетСотрудникаМенеджерСервиса.ИнициализироватьАбонентаСервиса();
					КонецЕсли;
				Иначе
					ИнтернетПоддержкаПодключена = ИнтернетПоддержкаПодключена();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьИнформациюОСервисеИзНастроекПрограммы();
		
	ИначеЕсли ОтложенноеПодключениеКСервису Тогда
		
		ИдентификаторПриложения = СостояниеПодключения.ИдентификаторПриложения;
		
		ФормаВРежимеПодключения = Истина;
		Элементы.ПодключениеКСервису.Видимость = Истина;
		
		// Выключаем страницу, чтобы не было полосы прокрутки.
		Элементы.СостояниеСервиса.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ПодключениеКСервису;
		Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаОтложенноеПодключение;
		ОшибкаСоздания = СостояниеПодключения.Состояние = Перечисления.СостоянияПодключенияКабинетСотрудника.ОшибкаСоздания;
		Элементы.СоздатьНовоеПодключение.Видимость = ОшибкаСоздания И ПолноправныйПользователь;
		Если ОшибкаСоздания Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				"ДекорацияОтложенноеПодключение",
				"Заголовок",
				НСтр("ru = 'При подключении к сервису возникли ошибки. Подробности в журнале регистрации.
					|Обратитесь в отдел технической поддержки сервиса по адресу support@1c-cabinet.ru'"));
			КонецЕсли;
			
	ИначеЕсли ПолноправныйПользователь Тогда
		
		// сервис не подключен, полноправный пользователь
		
		ФормаВРежимеПодключения = Истина;
		Элементы.ПодключениеКСервису.Видимость = Истина;
		
		// Выключаем страницу, чтобы не было полосы прокрутки.
		Элементы.СостояниеСервиса.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ПодключениеКСервису;
		Если СервисКабинетСотрудникаВЛокальнойСети Тогда
			
			Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключениеЛокально;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаИндикацияДлительнойОперацииПодключениеЛокально", "Видимость", Ложь);
			ОбновитьЭУОтветственный(ЭтаФорма);
			
		Иначе
			
			Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключение;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ИнтернетПоддержка", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ВыборАбонента", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ИндикаторДлительнойОперацииРезервированиеИмениДомена", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаИндикацияДлительнойОперацииПодключение", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"НастройкиПодключения", "Доступность", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"Этап5", "Видимость", Ложь);
			
			ЗаполнитьДанныеДляПроверкиИмениДомена();
			Элементы.ДекорацияИмяДоменаПояснение.Заголовок = НСтр("ru = 'В адресе можно использовать только латинские буквы, цифры и дефис (""-"")'");
			
			ОбновитьЭУОтветственный(ЭтаФорма);
			
			РассчитатьПериодРасчетныхЛистков();
			ОбновитьСообщениеОПубликации();
			
			Если Не ЭтоАвтономноеРабочееМесто Тогда
				Если РазделениеВключено Тогда
					НачатьСценарийПодключения = Истина;
				Иначе
					ИнтернетПоддержкаПодключена = ИнтернетПоддержкаПодключена();
					Если ИнтернетПоддержкаПодключена Тогда
						НачатьСценарийПодключения = Истина;
					Иначе
						ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
							"ИнтернетПоддержка", "Видимость", Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		// Сервис не подключен, у пользователя нет права на подключение к сервису,
		// но есть право на настройку сервиса.
		Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключениеНедоступно;
		
	КонецЕсли;
	
	Заголовок = СтрокаЗаголовок;
	
	Если НачатьСценарийПодключения Тогда
		Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
		НачатьПолучениеАбонентов();
	ИначеЕсли НачатьПолучениеИнформацииОСервисе И МенеджерСервисаДоступен Тогда
		Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаСостояниеДлительнаяОперация;
		НачатьПолучениеИнформацииОСервисе();
	ИначеЕсли ЗавершитьСценарийОтложенногоПодключения Тогда
		ЗавершитьСценарийОтложенногоПодключения();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнтернетПоддержкаПодключена()

	МодульИПП = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
	Возврат МодульИПП.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();	

КонецФункции 

&НаКлиенте
Процедура ВариантОтключенияСервисаПриИзменении(Элемент)
	УстановитьЗаголовокДекорацияОтключениеСервиса(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеПриОтключенииСервиса()

	КабинетСотрудникаМенеджерСервиса.ЗаписатьСобытиеОтключениеСервиса(Ложь);
	КабинетСотрудникаМенеджерСервиса.ОчиститьДанныеПриОтключенииСервиса();

КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиИзФайлаНаСервере(АдресФайла)
	
	Результат = Новый Структура("Настройки,СообщениеОбОшибке");
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресФайла);
	
	НетНастроек = Ложь;
	ЧтениеJSON = Новый ЧтениеJSON;
	Попытка
		ЧтениеJSON.ОткрытьФайл(ИмяВременногоФайла);
		Настройки = ПрочитатьJSON(ЧтениеJSON, Истина);
		Если Не ЗначениеЗаполнено(Настройки["url"]) Или Не ЗначениеЗаполнено(Настройки["clientID"]) Или Не ЗначениеЗаполнено(Настройки["clientSecret"]) Тогда
			НетНастроек = Истина;
		Иначе
			Результат.Настройки = Настройки;
		КонецЕсли;
	Исключение
		НетНастроек = Истина;
	КонецПопытки;
	
	Если НетНастроек Тогда
		СообщениеОбОшибке = НСтр("ru='Выбранный файл не содержит настроек подключения к сервису.'");
		Результат.СообщениеОбОшибке = СообщениеОбОшибке;
	КонецЕсли;
	
	ЧтениеJSON.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ОбновитьРеквизитыОтветственныйЗаСервис()
	
	СтрокаТелефонПочта = "";
	ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол, ОтветственныйНаименование);
	
	СтрокаТелефонПочта = СтрШаблон(НСтр("ru = 'Мобильный телефон и почта, указанные в сервисе: %1, %2'"), МобильныйТелефон, ЭлектроннаяПочта);
	Элементы.ДекорацияТелефонПочтаОтветственногоЗаСервис.Заголовок = СтрокаТелефонПочта;

КонецПроцедуры

#КонецОбласти
































