
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр лб_ОстаткиПоКР Приход
	Движения.лб_ОстаткиПоКР.Записывать = Истина;
	Для Каждого ТекСтрокаОстаткиНачисления Из ОстаткиНачисления Цикл
		Движение = Движения.лб_ОстаткиПоКР.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Здание = ТекСтрокаОстаткиНачисления.Здание;
		Движение.Начислено = ТекСтрокаОстаткиНачисления.Начисления;
		Движение.Оплачено = ТекСтрокаОстаткиНачисления.Оплаты;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
