
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ") Тогда
		
		Эл = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ.мСписокЗначений;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРегистрацияЛьготПоЛС") Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРегистрацияЛьготПоЛС.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		Элементы.Список.Отображение          = ОтображениеТаблицы.Список;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРегистрацияЛьготПоЛСПодбор") Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРегистрацияЛьготПоЛСПодбор.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		Элементы.Список.Отображение          = ОтображениеТаблицы.Список;
		
		ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаРегистрацияПроживающихПоЛСПодбор") Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаРегистрацияПроживающихПоЛСПодбор.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		Элементы.Список.Отображение          = ОтображениеТаблицы.Список;
		
		ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаИсковоеЗаявление") Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = Параметры.ЗаполнитьИзДокументаИсковоеЗаявление.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		Элементы.Список.Отображение          = ОтображениеТаблицы.Список;
		
		ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ТекЭлемент") Тогда
		
		Элементы.Список.ТекущаяСтрока = Параметры.ТекЭлемент;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЛицевойСчет") Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		Эл.ПравоеЗначение   = ПолучитьМассивПроживающихПоЛС(Параметры.ЛицевойСчет);
		Эл.Использование    = Истина;
		//Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		Элементы.Список.Отображение          = ОтображениеТаблицы.Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекЭл = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаОбщаяКомандабит_ОткрытьСвойстваИзСписка");
	
	Параметр = бит_РаботаСДиалогамиСервер.ПолучитьОписаниеЗначенийСвойствОбъекта(Элементы.Список.ТекущаяСтрока);
	
	Если Параметр = "" ИЛИ Параметр = "Дополнительные реквизиты" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеЗначенийСвойств" И Источник = Элементы.Список.ТекущаяСтрока Тогда
		
		ТекЭл = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаОбщаяКомандабит_ОткрытьСвойстваИзСписка");
		
		Если Параметр = "" ИЛИ Параметр = "Дополнительные реквизиты" Тогда
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекЭл = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаОбщаяКомандабит_ОткрытьСвойстваИзСписка");
	
	Параметр = бит_РаботаСДиалогамиСервер.ПолучитьОписаниеЗначенийСвойствОбъекта(Элементы.Список.ТекущаяСтрока);
	
	Если Параметр = "" ИЛИ Параметр = "Дополнительные реквизиты" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьМассивПроживающихПоЛС(ЛицевойСчет)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка.ВыгрузитьКолонку("ФизЛицо");
	
КонецФункции 
 