
#Область ПроцедурыИФункцииОбщегоНазначения

Функция ЕстьРеквизитФормы(Форма, ИмяРеквизита) 
	
	Для Каждого РеквизитФормы Из Форма.ПолучитьРеквизиты() Цикл
		Если ВРег(РеквизитФормы.Имя) = ВРег(ИмяРеквизита) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьЭлементФормы(Форма, ИмяЭлемента)
	
	Возврат Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено;
	
КонецФункции

Процедура ПриСохраненииПользовательскихНастроекНаСервере(ФормаОтчета, Настройки, СохранятьТолькоРеквизиты = Ложь) Экспорт
	
	ОтчетОбъект = ФормаОтчета.РеквизитФормыВЗначение("Отчет");
	
	ОтчетМетаданные = ОтчетОбъект.Метаданные();
	
	Если НЕ СохранятьТолькоРеквизиты Тогда
		ТекущиеНастройки = ОтчетОбъект.КомпоновщикНастроек.Настройки;
		
		// Очистка пользовательских настроек.
		ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки              = "";
		ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки            = "";
		ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
		
		// Установка пользовательских настроек.
		ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки              = "Отбор";
		ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки            = "Порядок";
		ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
	КонецЕсли;
	
	// Сохранение реквизитов отчета.
	ДополнительныеСвойства = Новый Структура;
	Для Каждого Реквизит Из ОтчетМетаданные.Реквизиты Цикл
		Если Реквизит.Имя <> "РежимРасшифровки" Тогда
			ДополнительныеСвойства.Вставить(Реквизит.Имя, ОтчетОбъект[Реквизит.Имя]);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Реквизит Из ОтчетМетаданные.ТабличныеЧасти Цикл
		ДополнительныеСвойства.Вставить(Реквизит.Имя, ОтчетОбъект[Реквизит.Имя].Выгрузить());
	КонецЦикла;
	
	РеквизитыФормы = ФормаОтчета.ПолучитьРеквизиты();
	// Сохранение реквизитов формы.
	Если ЕстьРеквизитФормы(ФормаОтчета, "ВыводитьЗаголовок") Тогда
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ФормаОтчета.ВыводитьЗаголовок);
	КонецЕсли;
	Если ЕстьРеквизитФормы(ФормаОтчета, "ВыводитьПодвал") Тогда
		ДополнительныеСвойства.Вставить("ВыводитьПодвал", ФормаОтчета.ВыводитьПодвал);
	КонецЕсли;
	Если ЕстьРеквизитФормы(ФормаОтчета, "ВыводитьЕдиницуИзмерения") Тогда
		ДополнительныеСвойства.Вставить("ВыводитьЕдиницуИзмерения", ФормаОтчета.ВыводитьЕдиницуИзмерения);
	КонецЕсли;
	Если ЕстьРеквизитФормы(ФормаОтчета, "МакетОформления") Тогда
		ДополнительныеСвойства.Вставить("МакетОформления", ФормаОтчета.МакетОформления);
	КонецЕсли;
	
	Если ЕстьРеквизитФормы(ФормаОтчета, "СкрыватьНастройкиПриФормированииОтчета") Тогда
		ДополнительныеСвойства.Вставить("СкрыватьНастройкиПриФормированииОтчета", ФормаОтчета.СкрыватьНастройкиПриФормированииОтчета);
	КонецЕсли;
	
	Если ЕстьЭлементФормы(ФормаОтчета, "ГруппаПанельНастроек") Тогда
		Если Настройки.ДополнительныеСвойства.Свойство("ПанельНастроекСкрытаАвтоматически")
			И Настройки.ДополнительныеСвойства.ПанельНастроекСкрытаАвтоматически = Истина Тогда
			ДополнительныеСвойства.Вставить("ВидимостьПанелиНастроек", Истина);
		Иначе
			ДополнительныеСвойства.Вставить("ВидимостьПанелиНастроек", ФормаОтчета.Элементы.ГруппаПанельНастроек.Видимость);
		КонецЕсли;
	КонецЕсли;
	
	Настройки.ДополнительныеСвойства.Вставить("ДанныеОтчета", Новый ХранилищеЗначения(ДополнительныеСвойства));
	
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(ФормаОтчета, Настройки, ЗагружатьТолькоРеквизиты = Ложь) Экспорт
	
	Если Настройки = Неопределено Тогда
		// Установка настроек по умолчанию.
		УстановитьНастройкиПоУмолчанию(ФормаОтчета);		
	Иначе 
		// Восстановление сохраненных настроек.
		Если Настройки.ДополнительныеСвойства.Свойство("ДанныеОтчета") Тогда
			ДополнительныеСвойства = Настройки.ДополнительныеСвойства.ДанныеОтчета.Получить();
			Для Каждого ЭлементСтруктуры Из ДополнительныеСвойства Цикл
				// Восстановление реквизитов отчета.
				Если ФормаОтчета.Отчет.Свойство(ЭлементСтруктуры.Ключ) Тогда
					Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
						ФормаОтчета.Отчет[ЭлементСтруктуры.Ключ].Загрузить(ЭлементСтруктуры.Значение);
					ИначеЕсли ЭлементСтруктуры.Ключ = "Подразделение"
						И Не ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям") Тогда
						Продолжить;
					ИначеЕсли ЭлементСтруктуры.Ключ <> "РежимРасшифровки" Тогда
						ФормаОтчета.Отчет[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
					КонецЕсли;
				КонецЕсли;
				
				// Восстановление реквизитов формы.
				Если ЭлементСтруктуры.Ключ = "ВыводитьЗаголовок" И ЕстьРеквизитФормы(ФормаОтчета, "ВыводитьЗаголовок") Тогда
					ФормаОтчета.ВыводитьЗаголовок = ЭлементСтруктуры.Значение;
				ИначеЕсли ЭлементСтруктуры.Ключ = "ВыводитьПодвал" И ЕстьРеквизитФормы(ФормаОтчета, "ВыводитьПодвал") Тогда
					ФормаОтчета.ВыводитьПодвал = ЭлементСтруктуры.Значение;
				ИначеЕсли ЭлементСтруктуры.Ключ = "ВыводитьЕдиницуИзмерения" И ЕстьРеквизитФормы(ФормаОтчета, "ВыводитьЕдиницуИзмерения") Тогда
					ФормаОтчета.ВыводитьЕдиницуИзмерения = ЭлементСтруктуры.Значение;
				ИначеЕсли ЭлементСтруктуры.Ключ = "МакетОформления" И ЕстьРеквизитФормы(ФормаОтчета, "МакетОформления") Тогда
					ФормаОтчета.МакетОформления = ЭлементСтруктуры.Значение;
					бит_ОтчетыКлиентСервер.УстановитьПараметрВывода(
					ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки, 
					"МакетОформления", ФормаОтчета.МакетОформления);
				КонецЕсли;
				Если ЭлементСтруктуры.Ключ = "СкрыватьНастройкиПриФормированииОтчета" Тогда
					ФормаОтчета.СкрыватьНастройкиПриФормированииОтчета = ЭлементСтруктуры.Значение;		
				КонецЕсли;
				Если ЭлементСтруктуры.Ключ = "ВидимостьПанелиНастроек" Тогда
					Если ЕстьЭлементФормы(ФормаОтчета, "ПанельНастроек") Тогда

					КонецЕсли;
					Если ЕстьЭлементФормы(ФормаОтчета, "ГруппаПанельНастроек") Тогда
						ФормаОтчета.Элементы.ГруппаПанельНастроек.Видимость = ДополнительныеСвойства.ВидимостьПанелиНастроек;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Не ЗагружатьТолькоРеквизиты Тогда
			ТекущиеНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки;
			
			// Установка пользовательских настроек.
			ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки              = "Отбор";
			ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки            = "Порядок";
			ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
			
			// Очистка текущих настроек.
			
			// Перенос пользовательских настроек в основные.
			ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
			ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ФормаОтчета.Отчет.КомпоновщикНастроек.ПолучитьНастройки());
			
			// Очистка пользовательских настроек.
			ТекущиеНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки;
			ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки              = "";
			ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки            = "";
			ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
		КонецЕсли;		
	КонецЕсли;
	
	Если ЕстьРеквизитФормы(ФормаОтчета, "МинимальныйВидПериода") Тогда
		МинимальныйВидПериода = ФормаОтчета.МинимальныйВидПериода;
	Иначе
		МинимальныйВидПериода = Неопределено;
	КонецЕсли;
	
	Если ЕстьРеквизитФормы(ФормаОтчета, "ПолеОрганизация") Тогда
		Ключ = СтрЗаменить(Строка(ФормаОтчета.Отчет.ВключатьОбособленныеПодразделения) + ФормаОтчета.Отчет.Организация.УникальныйИдентификатор(), "-", "");
		ФормаОтчета.ПолеОрганизация = Ключ;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНастройкиПоУмолчанию(ФормаОтчета) Экспорт
	
	Отчет = ФормаОтчета.Отчет;
	
	Если Отчет.Свойство("НачалоПериода") Тогда
		Отчет.НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Отчет.Свойство("КонецПериода") Тогда
		Отчет.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Отчет.Свойство("Организация") Тогда
		
		Отчет.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
		
	КонецЕсли;
	
	Если Отчет.Свойство("Период") Тогда
		Отчет.Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Отчет.Свойство("Периодичность") Тогда
		Отчет.Периодичность = 9;
	КонецЕсли;
	
	Если ЕстьРеквизитФормы(ФормаОтчета, "ВыводитьЗаголовок") Тогда
		ФормаОтчета.ВыводитьЗаголовок = Истина;
	КонецЕсли;
	
	Если Отчет.Свойство("РазмещениеДополнительныхПолей") Тогда
		Отчет.РазмещениеДополнительныхПолей = ПолучитьРазмещениеДополнительныхПолей(Отчет.КомпоновщикНастроек);
	КонецЕсли;
	
	Если Отчет.Свойство("Группировка") И Отчет.Свойство("ДополнительныеПоля") Тогда
		ЗаполнитьДополнительныеПоляИзНастроек(Отчет.КомпоновщикНастроек, Отчет.ДополнительныеПоля, Отчет.Группировка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Структура, Группировка)
	
	Если Структура.ПоляГруппировки.Элементы.Количество() > 0 Тогда
		Поле = Строка(Структура.ПоляГруппировки.Элементы[0].Поле);
		Если НРег(Поле) <> "подразделение" ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям") Тогда
			НоваяСтрока = Группировка.Добавить();
			
			НоваяСтрока.Использование  = Структура.Использование;
			НоваяСтрока.Поле           = Поле;
			НоваяСтрока.Представление  = бит_ОтчетыКлиентСервер.ПолучитьСвойствоПоля(КомпоновщикНастроек, НоваяСтрока.Поле);
			ТипГруппировки = Структура.ПоляГруппировки.Элементы[0].ТипГруппировки;
			Если ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
				НоваяСтрока.ТипГруппировки = 1;
			ИначеЕсли ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
				НоваяСтрока.ТипГруппировки = 2;
			Иначе
				НоваяСтрока.ТипГруппировки = 0;
			КонецЕсли;
		КонецЕсли;
		Если Структура.Структура.Количество() > 0 Тогда
			ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Структура.Структура[0], Группировка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРазмещениеДополнительныхПолей(КомпоновщикНастроек) 
	
	РасположениеРеквизитов = бит_ОтчетыКлиентСервер.ПолучитьПараметрВывода(КомпоновщикНастроек, "РасположениеРеквизитов");	
	
	Если РасположениеРеквизитов.Использование = Истина
		И РасположениеРеквизитов.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно Тогда
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьДополнительныеПоляИзНастроек(КомпоновщикНастроек, ДополнительныеПоля, Группировка)
	
	Если Группировка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПоля.Очистить();
	Для Каждого ВыбранноеПоле Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		Если ТипЗнч(ВыбранноеПоле) = Тип("ВыбранноеПолеКомпоновкиДанных") 
			И Найти(Строка(ВыбранноеПоле.Поле), ".") > 0 Тогда
			Поле = Строка(ВыбранноеПоле.Поле);
			МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Поле, ".");
			
			Если Группировка.НайтиСтроки(Новый Структура("Поле", МассивПолей[0])).Количество() > 0 Тогда
				НоваяСтрока = ДополнительныеПоля.Добавить();
				НоваяСтрока.Использование = ВыбранноеПоле.Использование;
				НоваяСтрока.Поле          = Поле;
				НоваяСтрока.Представление = бит_ОтчетыКлиентСервер.ПолучитьСвойствоПоля(КомпоновщикНастроек, НоваяСтрока.Поле);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Отчет     = Форма.Отчет;
	Параметры = Форма.Параметры;
	
	ПараметрМакетОформления = бит_ОтчетыКлиентСервер.ПолучитьПараметрВывода(Отчет.КомпоновщикНастроек.Настройки, "МакетОформления");
	СписокМакетовОформления = ПолучитьСписокМакетовОформления();
	Для Каждого ЭлементСписка Из СписокМакетовОформления Цикл
		Если ЕстьЭлементФормы(Форма, "МакетОформления") Тогда
			Форма.Элементы.МакетОформления.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЕсли;
	КонецЦикла;
	Если ПараметрМакетОформления.Использование И Не ПустаяСтрока(ПараметрМакетОформления.Значение) Тогда
		Если ЕстьРеквизитФормы(Форма, "МакетОформления") Тогда
			Форма.МакетОформления = ПараметрМакетОформления.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если Отчет.РежимРасшифровки Тогда
		СтандартнаяОбработка = Ложь;

		Форма.Подключаемый_СформироватьОтчетНаСервере();
	Иначе
		УстановитьНастройкиПоУмолчанию(Форма);
	КонецЕсли;
	
	ОтчетОбъект = Форма.РеквизитФормыВЗначение("Отчет");
	Если Не ЗначениеЗаполнено(Форма.СхемаКомпоновкиДанных) Тогда
		Форма.СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, Форма.УникальныйИдентификатор);
	КонецЕсли;
	Форма.ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Форма.ДанныеРасшифровки, Форма.УникальныйИдентификатор);
	
	Если ЕстьЭлементФормы(Форма, "ВидПериода") Тогда
		бит_ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
		ПредопределенноеЗначение("Перечисление.бит_ДоступныеПериодыОтчета.День"),
		Форма.Элементы.ВидПериода.СписокВыбора, Форма.ВидПериода);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьГруппировки(ПараметрыОтчета, КомпоновщикНастроек) Экспорт
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		СтруктураНастроек = КомпоновщикНастроек.Настройки.Структура;
	Иначе
		СтруктураНастроек = КомпоновщикНастроек;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураНастроек Цикл
		Группировка = ЭлементСтруктуры;
		Если Группировка.Имя = "Группировка" Тогда // Заполнить все поля группировки
			
			Если ТипЗнч(Группировка) = Тип("ГруппировкаКомпоновкиДанных") Тогда
				Родитель = Группировка.Родитель;
				ПерваяГруппировка = Истина;
				Индекс = Родитель.Структура.Индекс(Группировка);
				Родитель.Структура.Удалить(Группировка);
				Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл 
					Если ПолеВыбраннойГруппировки.Использование Тогда
						Если ПерваяГруппировка Тогда
							Группировка = Родитель.Структура.Вставить(Индекс, Тип("ГруппировкаКомпоновкиДанных"));
							ПерваяГруппировка = Ложь;
						Иначе
							Группировка = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
						КонецЕсли;
						
						ПолеГруппировки = Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
						ПолеГруппировки.Использование  = Истина;
						ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
						Если ПолеВыбраннойГруппировки.ТипГруппировки = 1 Тогда
							ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
						ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = 2 Тогда
							ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
						Иначе
							ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
						КонецЕсли;
						Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
						Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеПоля(ПараметрыОтчета, КомпоновщикНастроек) Экспорт
	
	Если ПараметрыОтчета.РазмещениеДополнительныхПолей = 0 Тогда
		РасположениеРеквизитов = РасположениеРеквизитовКомпоновкиДанных.ВместеСВладельцем;
	ИначеЕсли ПараметрыОтчета.РазмещениеДополнительныхПолей = 1 Тогда
		РасположениеРеквизитов = РасположениеРеквизитовКомпоновкиДанных.Отдельно;
	КонецЕсли;
	
	бит_ОтчетыКлиентСервер.УстановитьПараметрВывода(КомпоновщикНастроек, "РасположениеРеквизитов", РасположениеРеквизитов); 
	
	Для Каждого ПолеГруппировки Из ПараметрыОтчета.ДополнительныеПоля Цикл 
		Если ПолеГруппировки.Использование Тогда
			бит_ОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек, ПолеГруппировки.Поле);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища) Экспорт
	
	ВыводитьПолностью = Истина;
	
	Отказ = Ложь;
	ДанныеРасшифровкиОбъект = Неопределено;
	ПараметрыИсполненияОтчета = Неопределено;
	
	МенеджерОтчета = Отчеты[ПараметрыОтчета.ИдентификаторОтчета];
	
	Попытка
		ПараметрыИсполненияОтчета = МенеджерОтчета.ПолучитьПараметрыИсполненияОтчета();
	Исключение
		// Запись в журнал регистрации не требуется.
	КонецПопытки;
	
	ИспользоватьВнешниеНаборыДанных            = Ложь;
	ИспользоватьПриВыводеЗаголовка             = Ложь;
	ИспользоватьПриВыводеПодвала               = Ложь;
	ИспользоватьПередКомпоновкойМакета         = Ложь;
	ИспользоватьПослеКомпоновкиМакета          = Ложь;
	ИспользоватьПередВыводомЭлементаРезультата = Ложь;
	ИспользоватьПослеВыводаРезультата          = Ложь;
	ИспользоватьДанныеРасшифровки              = Истина;
	
	
	Если ПараметрыИсполненияОтчета <> Неопределено Тогда
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьВнешниеНаборыДанных") Тогда
			ИспользоватьВнешниеНаборыДанных = ПараметрыИсполненияОтчета.ИспользоватьВнешниеНаборыДанных;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПриВыводеЗаголовка") Тогда
			ИспользоватьПриВыводеЗаголовка = ПараметрыИсполненияОтчета.ИспользоватьПриВыводеЗаголовка;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПриВыводеПодвала") Тогда
			ИспользоватьПриВыводеПодвала = ПараметрыИсполненияОтчета.ИспользоватьПриВыводеПодвала;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПередКомпоновкойМакета") Тогда
			ИспользоватьПередКомпоновкойМакета = ПараметрыИсполненияОтчета.ИспользоватьПередКомпоновкойМакета;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПослеКомпоновкиМакета") Тогда
			ИспользоватьПослеКомпоновкиМакета = ПараметрыИсполненияОтчета.ИспользоватьПослеКомпоновкиМакета;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПередВыводомЭлементаРезультата") Тогда
			ИспользоватьПередВыводомЭлементаРезультата = ПараметрыИсполненияОтчета.ИспользоватьПередВыводомЭлементаРезультата;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПослеВыводаРезультата") Тогда
			ИспользоватьПослеВыводаРезультата = ПараметрыИсполненияОтчета.ИспользоватьПослеВыводаРезультата;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьДанныеРасшифровки") Тогда
			ИспользоватьДанныеРасшифровки = ПараметрыИсполненияОтчета.ИспользоватьДанныеРасшифровки;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыОтчета.СхемаКомпоновкиДанных) = Тип("Строка") Тогда
		Если ЭтоАдресВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных) Тогда
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных);
		КонецЕсли;
	Иначе
		СхемаКомпоновкиДанных = ПараметрыОтчета.СхемаКомпоновкиДанных;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(ПараметрыОтчета.НастройкиКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	ВыводитьЕдиницуИзмерения = Ложь;
	
	Результат = Новый ТабличныйДокумент;
	
	Если ВыводитьПолностью Тогда
		Если ИспользоватьПередКомпоновкойМакета Тогда
			МенеджерОтчета.ПередКомпоновкойМакета(ПараметрыОтчета, СхемаКомпоновкиДанных, КомпоновщикНастроек);
		КонецЕсли;
		КомпоновщикНастроек.Восстановить();
		
		НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
		
		// Сгенерируем макет компоновки данных при помощи компоновщика макета.
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		Попытка
			
			// В качестве схемы компоновки будет выступать схема самого отчета.
			// В качестве настроек отчета - текущие настройки отчета.
			// Данные расшифровки будем помещать в ДанныеРасшифровки.
			Если ИспользоватьДанныеРасшифровки Тогда 
				МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета, ДанныеРасшифровкиОбъект);
			Иначе
				МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета);
			КонецЕсли;
			
			// Вызываем событие отчета.
			
			Если ИспользоватьВнешниеНаборыДанных Тогда
				ВнешниеНаборыДанных = МенеджерОтчета.ПолучитьВнешниеНаборыДанных(ПараметрыОтчета, МакетКомпоновки);
			КонецЕсли;
			
			// Создадим и инициализируем процессор компоновки.
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			Если ВнешниеНаборыДанных = Неопределено Тогда
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровкиОбъект, Истина);
			Иначе
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровкиОбъект, Истина);
			КонецЕсли;	
			
			ДанныеДляРасшифровки = Новый Структура("Объект, ДанныеРасшифровки", ПараметрыОтчета, ДанныеРасшифровкиОбъект); 
			ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеДляРасшифровки, ПараметрыОтчета.ДанныеРасшифровки);
			
			// Создадим и инициализируем процессор вывода результата.
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(Результат);
			
			// БИТ_ЖКХ 11.03.2016 16:55:16 Начало правки...
			ВыводЗаголовкаТиповогоОтчета(ПараметрыОтчета, Результат, КомпоновщикНастроек);
			// БИТ_ЖКХ 11.03.2016 16:55:16 Конец правки.
			
			// Обозначим начало вывода.
			ПроцессорВывода.НачатьВывод();
			
			Если ИспользоватьПередВыводомЭлементаРезультата Тогда
				// Основной цикл вывода отчета.
				Пока Истина Цикл
					
					// Получим следующий элемент результата компоновки.
					ЭлементРезультата = ПроцессорКомпоновки.Следующий();
					
					Если ЭлементРезультата = Неопределено Тогда
						// Следующий элемент не получен - заканчиваем цикл вывода.
						Прервать;
					Иначе
						
						Отказ = Ложь;
						
						МенеджерОтчета.ПередВыводомЭлементаРезультата(ПараметрыОтчета, МакетКомпоновки, ДанныеРасшифровкиОбъект, ЭлементРезультата, Отказ);
						
						Если Не Отказ Тогда
							// Элемент получен - выведем его при помощи процессора вывода.
							ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
				
				// Завершение вывода отчета.
				ПроцессорВывода.ЗакончитьВывод();
			Иначе
				ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
			КонецЕсли;
			
		Исключение
			// Запись в журнал регистрации не требуется.
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
				ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
			КонецЦикла;
			ТекстСообщения = НСтр("ru = 'Отчет не сформирован!'") + Символы.ПС + ИнформацияОбОшибке.Описание;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Если ИспользоватьПослеВыводаРезультата Тогда
			МенеджерОтчета.ПослеВыводаРезультата(ПараметрыОтчета, Результат);
		Иначе
			ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
		КонецЕсли;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Новый Структура("Результат,ДанныеРасшифровки", Результат, ДанныеРасшифровки), АдресХранилища);
	
КонецПроцедуры


// БИТ_ЖКХ 11.03.2016 16:57:09 Начало правки...
// Выводит заголовок типового отчета в табличный документ
Процедура ВыводЗаголовкаТиповогоОтчета(ПараметрыОтчета, Результат, КомпоновщикНастроек)
	
	НастройкиКомпоновкиДанных = ПараметрыОтчета.НастройкиКомпоновкиДанных;
	ПараметрыВыводаКомпоновкиДанных = НастройкиКомпоновкиДанных.ПараметрыВывода;
	ВыводитьЗаголовок = ПараметрыОтчета.НастройкиКомпоновкиДанных.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"));
	
	Если ВыводитьЗаголовок = Неопределено ИЛИ ВыводитьЗаголовок = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	МакетЗаголовок = ПолучитьОбщийМакет("бит_ЗаголовокТиповогоОтчета");
	ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
	ЗначениеПараметра = ПараметрыОтчета.НастройкиКомпоновкиДанных.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	ЗаголовокОтчета = ЗначениеПараметра.Значение;
	
	//Если ПустаяСтрока(ЗаголовокОтчета) Тогда
	//	ЗаголовокОтчета = ПолучитьЗаголовокОтчета(ОтчетОбъект);
	//КонецЕсли;
	
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ЗаголовокОтчета;
	Если ПараметрыОтчета.Свойство("Организация") Тогда
		ОтборОрганизация = "Организация: " + Строка(ПараметрыОтчета.Организация);
	Иначе	
		ОтборОрганизация = "";
	КонецЕсли;
	ОбластьЗаголовок.Параметры.ОписаниеНастроекОтчета = ПолучитьОписаниеНастроекОтчета(КомпоновщикНастроек) + ОтборОрганизация;
	Результат.Вывести(ОбластьЗаголовок);
	
КонецПроцедуры

Функция ПолучитьОписаниеНастроекОтчета(КомпоновщикНастроек)
	
	Если КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Период
	ЗначениеПараметраПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ЗначениеПараметраКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	
	Если ЗначениеПараметраНачалоПериода <> Неопределено 
		И ЗначениеПараметраКонецПериода <> Неопределено Тогда
		
		НачалоПериода = ?(ТипЗнч(ЗначениеПараметраНачалоПериода.Значение) = Тип("СтандартнаяДатаНачала") или ТипЗнч(ЗначениеПараметраНачалоПериода.Значение) = Тип("Дата"), Дата(ЗначениеПараметраНачалоПериода.Значение), '00010101');
		КонецПериода = ?(ТипЗнч(ЗначениеПараметраКонецПериода.Значение) = Тип("СтандартнаяДатаНачала") или ТипЗнч(ЗначениеПараметраКонецПериода.Значение) = Тип("Дата"), Дата(ЗначениеПараметраКонецПериода.Значение), '00010101');
		Если НачалоПериода = '00010101' И КонецПериода = '00010101' Тогда
			ОписаниеПериода = НСтр("ru='Период не установлен'");
		ИначеЕсли НачалоПериода = '00010101' ИЛИ КонецПериода = '00010101' Тогда
			ОписаниеПериода = Формат(НачалоПериода, "ДФ = дд.ММ.гггг; ДП = ...") + " - " + Формат(КонецПериода, "ДФ = дд.ММ.гггг; ДП = ...");
		ИначеЕсли НачалоПериода <= КонецПериода Тогда
			ОписаниеПериода = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		Иначе
			ОписаниеПериода = НСтр("ru='Неправильно задан период!'");
		КонецЕсли;
	ИначеЕсли ЗначениеПараметраПериод <> Неопределено Тогда
		Период = ?(ТипЗнч(ЗначениеПараметраПериод.Значение) = Тип("СтандартнаяДатаНачала") или ТипЗнч(ЗначениеПараметраПериод.Значение) = Тип("Дата"), Дата(ЗначениеПараметраПериод.Значение), '00010101');
		Если Период = '00010101' или Период = Неопределено Тогда
			ОписаниеПериода = НСтр("ru='на '") + Формат(ТекущаяДата(), "ДП = ...");
		Иначе
			ОписаниеПериода = ?(Период = КонецДня(Период), НСтр("ru='на конец дня '"), "") + Формат(Период, "ДФ = дд.ММ.гггг; ДП = ...");
		КонецЕсли;
	Иначе
		ОписаниеПериода = "";
	КонецЕсли;
	Если Не ПустаяСтрока(ОПисаниеПериода) Тогда
		ОписаниеПериода = "Период: " + ОписаниеПериода + Символы.ПС;
	КонецЕсли;
	
	СтрокаОтбор = Строка(КомпоновщикНастроек.Настройки.Отбор);
	ОписаниеНастроекОтчета = 
	ОписаниеПериода;
	// + ?(ПустаяСтрока(СтрокаОтбор) , "", "Отбор: " + СтрокаОтбор);
	
	Возврат ОписаниеНастроекОтчета;		
	
КонецФункции
// БИТ_ЖКХ 11.03.2016 16:57:09 Конец правки.



Процедура ОбработкаРезультатаОтчета(ИдентификаторОтчета, Результат) Экспорт
	
	// Выводим надписи вертикально, если количество точек диаграмм больше 9.
	Для Каждого Рисунок Из Результат.Рисунки Цикл
		Попытка
			Если ТипЗнч(Рисунок.Объект) = Тип("Диаграмма") Тогда
				Рисунок.Объект.ОбластьПостроения.ВертикальныеМетки  = (Рисунок.Объект.Точки.Количество() > 9);
				Рисунок.Объект.ОбластьПостроения.ФорматШкалыЗначений = "ЧГ=3,0";
				Рисунок.Объект.ОбластьЛегенды.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 1);
				
				Рисунок.Объект.ПоложениеПодписейШкалыЗначенийИзмерительнойДиаграммы = ПоложениеПодписейШкалыЗначенийИзмерительнойДиаграммы.НаШкале;
				Рисунок.Объект.ПодписиШкалыЗначенийИзмерительнойДиаграммыВдольШкалы = Истина;
				Рисунок.Объект.ТолщинаШкалыИзмерительнойДиаграммы                   = 3;
				Рисунок.Объект.ФорматЗначенийВПодписях                              = "ЧДЦ=2; ЧГ=3,0";
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Удалим строки с высотой равной 1.
	Индекс = Результат.ВысотаТаблицы;
	Пока Индекс > 0 Цикл
		ИндексСтроки = "R" + Формат(Индекс, "ЧГ=0");
		Если Результат.Область(ИндексСтроки).ВысотаСтроки = 1 Тогда
			Результат.УдалитьОбласть(Результат.Область(ИндексСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Результат.АвтоМасштаб = Истина;
	Результат.ПолеСлева   = 5;
	Результат.ПолеСправа  = 5;
	
	Результат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ИдентификаторОтчета;		
	
КонецПроцедуры

Процедура ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек, ВПользовательскиеНастройки = Истина) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Организация) Тогда
		НовыйОтбор = бит_ОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "Организация", ПараметрыОтчета.Организация,,, ВПользовательскиеНастройки);
		НовыйОтбор.Представление = "###ОтборПоОрганизации###"; 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокМакетовОформления() Экспорт
	
	СписокМакетовОформления = Новый СписокЗначений;
	Для Каждого ОбщийМакет Из Метаданные.ОбщиеМакеты Цикл
		Если ОбщийМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.МакетОформленияКомпоновкиДанных Тогда
			СписокМакетовОформления.Добавить(ОбщийМакет.Имя, ОбщийМакет.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	СписокМакетовОформления.Добавить("Основной");
	СписокМакетовОформления.Добавить("Яркий");
	СписокМакетовОформления.Добавить("Море");
	СписокМакетовОформления.Добавить("Арктика");
	СписокМакетовОформления.Добавить("Зеленый");
	СписокМакетовОформления.Добавить("Античный");
	
	Возврат СписокМакетовОформления;
	
КонецФункции

Функция ПолучитьПараметрыРасшифровкиОтчета(Адрес, ИдентификаторОбъекта, Расшифровка) Экспорт
	
	ПараметрыРасшифровки = Новый Структура;
	
	ПараметрыИсполненияОтчета = Отчеты[ИдентификаторОбъекта].ПолучитьПараметрыИсполненияОтчета();
	Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьРасширенныеПараметрыРасшифровки") 
		И ПараметрыИсполненияОтчета.ИспользоватьРасширенныеПараметрыРасшифровки Тогда
		Отчеты[ИдентификаторОбъекта].ЗаполнитьПараметрыРасшифровкиОтчета(Адрес, Расшифровка, ПараметрыРасшифровки);
		
		Возврат ПараметрыРасшифровки;
	КонецЕсли;
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(Адрес);
	
	ОтчетОбъект       = ДанныеОбъекта.Объект;
	ДанныеРасшифровки = ДанныеОбъекта.ДанныеРасшифровки;
	
	ПараметрыРасшифровки.Вставить("ОткрытьЗначение", Истина);
	ПараметрыРасшифровки.Вставить("Значение"       , ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение);
	
	Возврат ПараметрыРасшифровки;
	
КонецФункции

// БИТ_ЖКХ 04.03.2014
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт
	
	ПараметрыЖКХ = бит_ОтчетыКлиентСервер.ОбновитьНастройкиЖКХ(ПараметрыОтчета);
	
	мЛьготаПерсонифицированная           = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	мВыводитьЛьготыНаСчетИзвещение       = ПараметрыЖКХ.ВыводитьЛьготыНаСчетИзвещение;
	мРасчетСУчетомДолейВладения          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мУменьшениеНормыЛьготыВПределахФакта = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	мНачислениеСУчетомДнейПроживания     = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	мНеПечататьУлица                     = ПараметрыЖКХ.НеПечататьУлица;
	мНеПечататьДом                       = ПараметрыЖКХ.НеПечататьДом;
	мНеПечататьКорпус                    = ПараметрыЖКХ.НеПечататьКорпус;
	мНеПечататьКвартира                  = ПараметрыЖКХ.НеПечататьКвартира;
	мНеПечататьРайон                     = ПараметрыЖКХ.НеПечататьРайон;
	мПрефиксУлица                        = ПараметрыЖКХ.ПрефиксУлица;
	мПрефиксДом                          = ПараметрыЖКХ.ПрефиксДом;
	мПрефиксКорпус                       = ПараметрыЖКХ.ПрефиксКорпус;
	мПрефиксКвартира                     = ПараметрыЖКХ.ПрефиксКвартира;
	мПрефиксРайон                        = ПараметрыЖКХ.ПрефиксРайон;
	мНомерПолучателяПоБанку              = ПараметрыЖКХ.НомерПолучателяПоБанку;
	мИспользоватьНомерПолучателяВШК      = ПараметрыЖКХ.ИспользоватьНомерПолучателяВШК;
	
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = ПараметрыЖКХ.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	
	// БИТ_ЖКХ_04102013_начало_изменений
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	// БИТ_ЖКХ_04102013_начало_изменений
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	// БИТ_ЖКХ_17012014_начало_изменений
	|	бит_СведенияОКвартиреСрезПоследних.ЖилоеПомещениеСпециализированногоЖилищногоФонда,
	// БИТ_ЖКХ_17012014_начало_изменений
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("Момент"   ,ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("Квартира" ,ПараметрыОтчета.ЛицевойСчет.Квартира);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ТипКвартиры              = Выборка.ТипКвартиры;
		СтатусКвартиры           = Выборка.СтатусКвартиры;
		ОбщаяПлощадь             = Выборка.ОбщаяПлощадь;
		ЖилаяПлощадь             = Выборка.ЖилаяПлощадь;
		МОП                      = Выборка.МОП;  
		ОтапливаемаяПлощадь      = Выборка.ОтапливаемаяПлощадь;
		СовокупнаяПлощадь        = Выборка.СовокупнаяПлощадь;
		ТипПлиты                 = Выборка.ТипПлиты;
		ТипЗапирающегоУстройства = Выборка.ТипЗапирающегоУстройства;
		// БИТ_ЖКХ_17012014_начало_изменений
		ЖилоеПомещениеСпециализированногоЖилищногоФонда = Выборка.ЖилоеПомещениеСпециализированногоЖилищногоФонда;
		// БИТ_ЖКХ_17012014_начало_изменений
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"		, КонецДня(ПараметрыОтчета.КонецПериода));
	
	Запрос.УстановитьПараметр("ЛицевойСчет"	, ПараметрыОтчета.ЛицевойСчет);
	
	ТаблицаПроживающих = Запрос.Выполнить().Выгрузить();
	
	мКоличествоПроживающих = 0;
	мКоличествоПоНорме       = 0;
	Постоянно                = 0;
	Времменно                = 0;
	
	мКоличествоПроживающихЛьгота = 0;
	мКоличествоПоНормеЛьгота       = 0;
	
	Для Каждого СтрокаТЗ Из ТаблицаПроживающих Цикл
		
		Если СтрокаТЗ.СтатусФизЛица.ПроживаниеВДанныйМомент тогда
			
			мКоличествоПроживающих = мКоличествоПроживающих + 1; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ВсегоПроживающих = мКоличествоПроживающих;
	
	ТаблицаПроживающихСкоп = ТаблицаПроживающих.Скопировать(Новый Структура("СтепеньРодства",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо));
	
	Если ТаблицаПроживающих.Количество() = 0 Тогда
		ВладелецЛицевогоСчета = "";
	Иначе
		ВладелецЛицевогоСчета = ТаблицаПроживающихСкоп[0].ФизЛица;
	КонецЕсли;

	Телефон               = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(ВладелецЛицевогоСчета);		
	
	Адрес = "" + мПрефиксУлица + " " + ПараметрыОтчета.ЛицевойСчет.УлицаЛицевогоСчета + ", " + мПрефиксДом + " " + ПараметрыОтчета.ЛицевойСчет.Здание +?(ЗначениеЗаполнено(ПараметрыОтчета.ЛицевойСчет.Здание.Корпус),", "+ мПрефиксКорпус + " "+ ПараметрыОтчета.ЛицевойСчет.Здание.Корпус, "") +", " + ПараметрыОтчета.ЛицевойСчет.Квартира;
	АдресПрожитвания = ?(ЗначениеЗаполнено(ПараметрыОтчета.ЛицевойСчет.Здание.ПочтовыйАдрес),Строка(ПараметрыОтчета.ЛицевойСчет.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(ПараметрыОтчета.ЛицевойСчет.Квартира), ", кв." + Строка(ПараметрыОтчета.ЛицевойСчет.Квартира),""),Адрес);
	
	ТекстЗаголовка = "История начислений за период с " + Формат(ПараметрыОтчета.НачалоПериода,"ДФ=dd.MM.yyyy") + " по " + Формат(ПараметрыОтчета.КонецПериода,"ДФ=dd.MM.yyyy");
	ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + "АДРЕС "+АдресПрожитвания+"     ФИО "+ВладелецЛицевогоСчета+"     ФЛС "+ПараметрыОтчета.ЛицевойСчет+"     КОД ПЛАТЕЛЬЩИКА "+ПараметрыОтчета.ЛицевойСчет;
	ТекстЗаголовка = ТекстЗаголовка + Символы.ПС +"Вид собственности: "+СтатусКвартиры+"     Площадь общая: "+ОбщаяПлощадь+"     Отапливаемая: "+ОтапливаемаяПлощадь+"     Жилая: "+ЖилаяПлощадь+"     Зарегистрировано: "+ВсегоПроживающих;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

// БИТ_ЖКХ 04.03.2014

// БИТ_ЖКХ 16.01.2015{{
Функция бит_ПолучитьПараметрыРасшифровкиОтчета(Адрес, ИдентификаторОбъекта, Расшифровка) Экспорт
	
	ПараметрыРасшифровки = Новый Структура;
	
	ПараметрыИсполненияОтчета = Отчеты[ИдентификаторОбъекта].ПолучитьПараметрыИсполненияОтчета();
	Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьРасширенныеПараметрыРасшифровки") 
		И ПараметрыИсполненияОтчета.ИспользоватьРасширенныеПараметрыРасшифровки Тогда
		Отчеты[ИдентификаторОбъекта].ЗаполнитьПараметрыРасшифровкиОтчета(Адрес, Расшифровка, ПараметрыРасшифровки);
		
		Возврат ПараметрыРасшифровки;
	КонецЕсли;
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ИдентификаторОбъекта = "ГлавнаяКнига" Тогда 
		ОтчетОбъект       = ДанныеОбъекта;
		ДанныеРасшифровки = ДанныеОбъекта.ДанныеРасшифровки;
	Иначе 		
		ОтчетОбъект       = ДанныеОбъекта.Объект;
		ДанныеРасшифровки = ДанныеОбъекта.ДанныеРасшифровки;
	КонецЕсли;
	
	Если ИдентификаторОбъекта = "АнализСубконто"
		ИЛИ ИдентификаторОбъекта = "АнализСчета"
		ИЛИ ИдентификаторОбъекта = "ОборотноСальдоваяВедомость"
		ИЛИ ИдентификаторОбъекта = "ОборотноСальдоваяВедомостьПоСчету"
		ИЛИ ИдентификаторОбъекта = "ОборотыМеждуСубконто"
		ИЛИ ИдентификаторОбъекта = "ОборотыСчета"
		ИЛИ ИдентификаторОбъекта = "СводныеПроводки" 
		ИЛИ ИдентификаторОбъекта = "ГлавнаяКнига"
		
		// БИТ_ЖКХ 14.01.2015{{
		ИЛИ ИдентификаторОбъекта = "бит_ОборотнаяВедомостьПоПоставщикамУслуг"
		ИЛИ ИдентификаторОбъекта = "бит_ОборотнаяВедомостьПоУслугам" 
		ИЛИ ИдентификаторОбъекта = "бит_ВедомостьПоНачислениюПени" 
		
		// БИТ_ЖКХ 14.01.2015}}	
		
		ИЛИ ИдентификаторОбъекта = "ШахматнаяВедомость" Тогда
		ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Ложь);
		
		ЕстьПоказатель  = Ложь;
		ЕстьКорЗначение = Ложь;
		ЕстьСчет        = Истина;
		Счет            = Неопределено;
		ПервыйЭлемент   = Неопределено;
		
		Если ИдентификаторОбъекта = "ГлавнаяКнига" Тогда
			Если ТипЗнч(Расшифровка) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
				ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Истина);
				ПараметрыРасшифровки.Вставить("Значение"       , Расшифровка);
			Иначе 
				МассивПолей = Расшифровка;
				
				ЕстьПоказатель = Истина;
				ПервыйЭлемент = Истина;
				Для Каждого ЭлементСписка Из Расшифровка Цикл
					Для Каждого ЭлементСоответствия Из ЭлементСписка.Значение Цикл
						Если ЭлементСоответствия.Ключ = "КорСчет" Тогда
							ЕстьКорЗначение = Истина;
						КонецЕсли;
						Если ЭлементСоответствия.Ключ = "Счет" Тогда
							Счет = ЭлементСоответствия.Значение;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		Иначе
			КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроек.ЗагрузитьНастройки(ДанныеРасшифровки.Настройки);
			КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ДанныеОбъекта.Объект.СхемаКомпоновкиДанных));
			
			МассивПолей = ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровки, КомпоновщикНастроек, Истина);
			
			Для Каждого Элемент Из МассивПолей Цикл
				Если ТипЗнч(Элемент) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
					Если ПервыйЭлемент = Неопределено И Элемент.Поле <> "Показатель" Тогда 
						ПервыйЭлемент = Элемент;
					КонецЕсли;
					Если Элемент.Поле = "Показатель" Тогда
						ЕстьПоказатель = Истина;
					КонецЕсли;
					Если Найти(Элемент.Поле, "Кор") = 1 Тогда
						ЕстьКорЗначение = Истина;
					КонецЕсли;
					Если Элемент.Поле = "Счет" Тогда
						Счет = Элемент.Значение;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ФормироватьОСВПоСчету            = Ложь;
		ФормироватьАнализСчета           = Ложь;
		формироватьОборотыСчета          = Ложь;
		ФормироватьОборотыСчетаПоМесяцам = Ложь;
		ФормироватьОборотыСчетаПоДням    = Ложь;
		ФормироватьКарточкуСчета         = Ложь;
		ФормироватьКарточкуСубконто      = Ложь;
		ФормироватьОтчетПоПроводкам      = Ложь;
		
		ПредставлениеДляОСВПоСчету            = НСтр("ru = 'ОСВ по счету %Счет%'");
		ПредставлениеДляКарточкиСчета         = НСтр("ru = 'Карточка счета %Счет%'");
		ПредставлениеДляАнализаСчета          = НСтр("ru = 'Анализ счета %Счет%'");
		ПредставлениеДляОборотыСчета          = НСтр("ru = 'Обороты счета %Счет%'");
		ПредставлениеДляОборотыСчетаПоМесяцам = НСтр("ru = 'Обороты счета %Счет% по месяцам'");
		ПредставлениеДляОборотыСчетаПоДням    = НСтр("ru = 'Обороты счета %Счет% по дням'");
		ПредставлениеДляКарточкиСубконто      = НСтр("ru = 'Карточка субконто'");
		ПредставлениеДляОтчетаПоПроводкам     = НСтр("ru = 'Отчет по проводкам'");
		ПредставлениеОткрытьОбъект 			  = НСтр("ru = 'Открыть ""%Значение%""'");
		
		ПредставлениеДляОСВПоСчету            = СтрЗаменить(ПредставлениеДляОСВПоСчету           , "%Счет%", Счет);
		ПредставлениеДляКарточкиСчета         = СтрЗаменить(ПредставлениеДляКарточкиСчета        , "%Счет%", Счет);
		ПредставлениеДляАнализаСчета          = СтрЗаменить(ПредставлениеДляАнализаСчета         , "%Счет%", Счет);
		ПредставлениеДляОборотыСчета          = СтрЗаменить(ПредставлениеДляОборотыСчета         , "%Счет%", Счет);
		ПредставлениеДляОборотыСчетаПоМесяцам = СтрЗаменить(ПредставлениеДляОборотыСчетаПоМесяцам, "%Счет%", Счет);
		ПредставлениеДляОборотыСчетаПоДням    = СтрЗаменить(ПредставлениеДляОборотыСчетаПоДням   , "%Счет%", Счет);
		
		Если ЕстьПоказатель Тогда
			УстановитьВсеПоказатели = Ложь;
		Иначе
			УстановитьВсеПоказатели = Истина;
		КонецЕсли;
		
		ЛицевойСчет   = Неопределено;
		Квартира      = Неопределено;
		Здание        = Неопределено;
		Улица         = Неопределено;
		ФизЛицо       = Неопределено;
		Услуга        = Неопределено;
		Поставщик     = Неопределено;
		Начисления    = Ложь;
		Оплата        = Ложь;
		Льгота        = Ложь;
		Разовые       = Ложь;
		ОбщаяСумма    = Истина;
		
		СписокПолей = Новый СписокЗначений;
		
		ПоследняяГруппировка = "ДокументыРегистрации";
		
		Для Каждого Элемент Из МассивПолей Цикл
			Если ТипЗнч(Элемент) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
				
				Если Здание = Неопределено И Элемент.Поле = "Здание" Тогда
					
					Здание = Элемент.Значение;
					
				КонецЕсли;
				
				Если Улица = Неопределено И Элемент.Поле = "Улица" Тогда
					
					Улица = Элемент.Значение;
					
				КонецЕсли;
				
				Если ФизЛицо = Неопределено И Элемент.Поле = "ФизЛицо" Тогда
					
					ФизЛицо = Элемент.Значение;
					
				КонецЕсли;
				
				Если Услуга = Неопределено И Элемент.Поле = "Услуга" Тогда
					
					Услуга = Элемент.Значение;
					
				КонецЕсли;
				
				Если Квартира = Неопределено И Элемент.Поле = "ЛицевойСчет.Квартира" Тогда
					
					Квартира = Элемент.Значение;
					
				КонецЕсли;
				
				Если Поставщик = Неопределено И Элемент.Поле = "Поставщик" Тогда
					
					Поставщик = Элемент.Значение;
					
				КонецЕсли; 
				
				Если  ЛицевойСчет = неопределено И (Элемент.Поле = "ЛицевойСчет" ИЛИ Элемент.Поле = "ЛицевойСчетВывод") Тогда
					
					ЛицевойСчет = бит_ВернутьЛицевойСчет(Элемент.Значение,",");
					
				КонецЕсли; 
				
				Если Элемент.Поле = "Начисления" ИЛИ Элемент.Поле = "НачисленияУслуг" Тогда
					
					Начисления = Истина;
					ОбщаяСумма = Ложь;
					
					Если ИдентификаторОбъекта = "ОтчетОбъект.бит_ВедомостьПоНачислениюПени" Тогда
						// БИТ_ЖКХ изменения кода . Начало: 03.02.2012
						Если Элемент.Поле = "Начисления" Тогда
							СписокПолей.Добавить("НачисленияПени");
						Иначе
							СписокПолей.Добавить("НачисленияУслуг");
						КонецЕсли;
						// БИТ_ЖКХ изменения кода . Конец  03.02.2012
					Иначе
						СписокПолей.Добавить("Начисления");
					КонецЕсли; 
					
					ПоследняяГруппировка = "ДокументыНачислений";
					
				КонецЕсли; 
				
				Если Элемент.Поле = "Оплата" ИЛИ Элемент.Поле = "ОплатаУслуг" ИЛИ Элемент.Поле = "ОплатаОбщая" Тогда
					
					Оплата = Истина;
					ОбщаяСумма = Ложь;
					
					Если ИдентификаторОбъекта = "бит_ВедомостьПоНачислениюПени" Тогда
						// БИТ_ЖКХ изменения кода . Начало: 03.02.2012
						Если Элемент.Поле = "Оплата" Тогда
							СписокПолей.Добавить("ОплатаПени");
						ИначеЕсли Элемент.Поле = "ОплатаУслуг" Тогда
							СписокПолей.Добавить("ОплатаУслуг");
						Иначе	
							СписокПолей.Добавить("ОплатаПени");
							СписокПолей.Добавить("ОплатаУслуг");
						КонецЕсли;
						// БИТ_ЖКХ изменения кода . Конец  03.02.2012	
					Иначе
						СписокПолей.Добавить("Оплата");
					КонецЕсли; 
					
					ПоследняяГруппировка = "ДокументыОплаты";
					
				КонецЕсли;
				
				Если Элемент.Поле = "Льгота" Тогда
					
					Льгота = Истина;
					ОбщаяСумма = Ложь;
					СписокПолей.Добавить("Льгота");
					
					ПоследняяГруппировка = "ДокументыЛьготы";
					
				КонецЕсли;
				
				Если Элемент.Поле = "Разовые" Тогда
					
					Разовые = Истина;
					ОбщаяСумма = Ложь;
					СписокПолей.Добавить("Разовые");
					
					ПоследняяГруппировка = "ДокументыРазовые";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СписокПолей.Количество() = 0 Тогда
			
			Если ИдентификаторОбъекта = "ОтчетОбъект.бит_ВедомостьПоНачислениюПени" Тогда

			Иначе
				СписокПолей.Добавить("Сумма");
			КонецЕсли; 
			
		КонецЕсли; 
		
		ПредставлениеПоДоку = "Детальная расшифровка.";
		
		ФормаРасшифровка = Неопределено;
		
		СписокПунктовМеню = Новый СписокЗначений;
		
		Если ПервыйЭлемент <> Неопределено Тогда
			
			Если ИдентификаторОбъекта = "бит_ОборотнаяВедомостьПоПоставщикамУслуг" 
				или ИдентификаторОбъекта = "бит_ОборотнаяВедомостьПоУслугам" 
				или ИдентификаторОбъекта = "бит_ВедомостьПоНачислениюПени" Тогда
				
				Если ЛицевойСчет <> Неопределено И ЗначениеЗаполнено(ЛицевойСчет) И НЕ ПростойТип(ЛицевойСчет) Тогда
					СписокПунктовМеню.Добавить(ЛицевойСчет,"Открыть лицевой счет: """ + ЛицевойСчет + """");
					
				КонецЕсли;
				
				Если Квартира <> Неопределено И ЗначениеЗаполнено(Квартира) И НЕ ПростойТип(Квартира) Тогда
					СписокПунктовМеню.Добавить(Квартира,"Открыть квартира :""" + Квартира + """");
					
				КонецЕсли;
				
				Если Здание <> Неопределено И ЗначениеЗаполнено(Здание) И НЕ ПростойТип(Здание) Тогда
					СписокПунктовМеню.Добавить(Здание,"Открыть здание: """ + Здание + """");
					
				КонецЕсли;
				
				Если Услуга <> Неопределено И ЗначениеЗаполнено(Услуга) И НЕ ПростойТип(Услуга) Тогда
					СписокПунктовМеню.Добавить(Услуга,"Открыть услугу: """ + Услуга + """");
					
				КонецЕсли;
				
				Если ФизЛицо <> Неопределено И ЗначениеЗаполнено(ФизЛицо) И НЕ ПростойТип(ФизЛицо) Тогда
					СписокПунктовМеню.Добавить(ФизЛицо,"Открыть проживающиего: """ + ФизЛицо + """");
					
				КонецЕсли;
				
				Если Улица <> Неопределено И ЗначениеЗаполнено(Улица) И НЕ ПростойТип(Улица) Тогда
					СписокПунктовМеню.Добавить(Улица,"Открыть улицу: """ + Улица + """");
					
				КонецЕсли;
				
				Если Улица <> Неопределено И ЗначениеЗаполнено(Поставщик) И НЕ ПростойТип(Поставщик) Тогда
					СписокПунктовМеню.Добавить(Поставщик,"Открыть поставщика: """ + Поставщик + """");

				КонецЕсли;
				
				СписокПунктовМеню.Добавить(ПредставлениеПоДоку);							
			Иначе
				Если ЕстьПоказатель Тогда
					// Если расшифровывается показатель, то необходимо сразу формировать отчет.
					Если ИдентификаторОбъекта = "АнализСубконто" Тогда
						Если Счет <> Неопределено Тогда 
							СписокПунктовМеню.Добавить("КарточкаСчета");
						Иначе
							СписокПунктовМеню.Добавить("КарточкаСубконто");	
						КонецЕсли;
					ИначеЕсли ИдентификаторОбъекта = "АнализСчета" Тогда
						Если ЕстьКорЗначение Тогда
							СписокПунктовМеню.Добавить("ОтчетПоПроводкам");
						Иначе
							СписокПунктовМеню.Добавить("КарточкаСчета");		
						КонецЕсли;
					ИначеЕсли ИдентификаторОбъекта = "ОборотноСальдоваяВедомостьПоСчету" Тогда
						СписокПунктовМеню.Добавить("КарточкаСчета");
					ИначеЕсли ИдентификаторОбъекта = "ОборотыМеждуСубконто" Тогда
						СписокПунктовМеню.Добавить("ОтчетПоПроводкам");
					ИначеЕсли ИдентификаторОбъекта = "ОборотыСчета" Тогда				
						СписокПунктовМеню.Добавить("ОтчетПоПроводкам");
					ИначеЕсли ИдентификаторОбъекта = "СводныеПроводки" Тогда
						СписокПунктовМеню.Добавить("ОтчетПоПроводкам");
					ИначеЕсли ИдентификаторОбъекта = "ГлавнаяКнига" Тогда
						СписокПунктовМеню.Добавить("ОборотыСчета", ПредставлениеДляОборотыСчета);
						Если ЕстьКорЗначение Тогда
							СписокПунктовМеню.Добавить("ОтчетПоПроводкам", ПредставлениеДляОтчетаПоПроводкам);
						КонецЕсли;						
					КонецЕсли;
				Иначе
					Если ИдентификаторОбъекта = "СводныеПроводки"
						ИЛИ ИдентификаторОбъекта = "ШахматнаяВедомость" Тогда
						СписокПунктовМеню.Добавить("ОтчетПоПроводкам");
						УстановитьВсеПоказатели = Истина;
					Иначе 
						Если ЗначениеЗаполнено(ПервыйЭлемент.Значение) И Не БухгалтерскиеОтчетыКлиентСервер.ПростойТип(ПервыйЭлемент.Значение) Тогда
							Представление = СтрЗаменить(ПредставлениеОткрытьОбъект, "%Значение%", ПервыйЭлемент.Значение);
							СписокПунктовМеню.Добавить(ПервыйЭлемент.Значение, Представление);
						КонецЕсли;
						Если ИдентификаторОбъекта = "АнализСубконто" Тогда
							Если Счет <> Неопределено Тогда 
								СписокПунктовМеню.Добавить("КарточкаСчета", ПредставлениеДляКарточкиСчета);
							Иначе
								СписокПунктовМеню.Добавить("КарточкаСубконто", ПредставлениеДляКарточкиСубконто);
							КонецЕсли;	
						ИначеЕсли ИдентификаторОбъекта = "АнализСчета" Тогда
							Если ЕстьКорЗначение Тогда 
								СписокПунктовМеню.Добавить("ОтчетПоПроводкам", ПредставлениеДляОтчетаПоПроводкам);
							Иначе
								СписокПунктовМеню.Добавить("КарточкаСчета", ПредставлениеДляКарточкиСчета);
							КонецЕсли;
						ИначеЕсли ИдентификаторОбъекта = "ОборотноСальдоваяВедомостьПоСчету" Тогда
							СписокПунктовМеню.Добавить("КарточкаСчета", ПредставлениеДляКарточкиСчета);
						ИначеЕсли ИдентификаторОбъекта = "ОборотыМеждуСубконто" Тогда
							СписокПунктовМеню.Добавить("ОтчетПоПроводкам", ПредставлениеДляОтчетаПоПроводкам);
						ИначеЕсли ИдентификаторОбъекта = "ОборотыСчета" Тогда				
							СписокПунктовМеню.Добавить("ОтчетПоПроводкам", ПредставлениеДляОтчетаПоПроводкам);
						КонецЕсли; 
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Истина);
		ПараметрыРасшифровки.Вставить("Значение"       , ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение);
	КонецЕсли;
	
	НастройкиРасшифровки = Новый Структура;   
	Если СписокПунктовМеню <> Неопределено Тогда

		Адрес = ПоместитьВоВременноеХранилище(ДанныеОбъекта, Адрес);
		
		ПараметрыРасшифровки.Вставить("СписокПунктовМеню", СписокПунктовМеню);
		ПараметрыРасшифровки.Вставить("СписокПолей", СписокПолей);
		ПараметрыРасшифровки.Вставить("ПоследняяГруппировка", ПоследняяГруппировка);
		
	КонецЕсли;
	
	Возврат ПараметрыРасшифровки;
	
КонецФункции

// Функция определения лита значения.
//
Функция ПростойТип(Значение) Экспорт
	
	ОписаниеПростыхТипов = Новый ОписаниеТипов("Дата, Строка, Булево, Число");
	
	Возврат ОписаниеПростыхТипов.СодержитТип(ТипЗнч(Значение));
	
КонецФункции

// Возвращает массив, по которому следует расшифровать отчет.
Функция ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровки, ТекущийОтчет = Неопределено, ВключатьРесурсы = Ложь) Экспорт
	
	МассивПолейРасшифровки = Новый Массив;
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") 
		И ТипЗнч(Расшифровка) <> Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		Возврат МассивПолейРасшифровки;
	КонецЕсли;
	
	Если ТекущийОтчет = Неопределено Тогда
		ТекущийОтчет = ДанныеРасшифровки;
	КонецЕсли;
	
	// Добавим поля родительских группировок.
	ДобавитьРодителей(ДанныеРасшифровки.Элементы[Расшифровка], ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	
	Количество = МассивПолейРасшифровки.Количество();
	Для Индекс = 1 По Количество Цикл
		ОбратныйИндекс = Количество - Индекс;
		Для ИндексВнутри = 0 По ОбратныйИндекс - 1 Цикл
			Если МассивПолейРасшифровки[ОбратныйИндекс].Поле = МассивПолейРасшифровки[ИндексВнутри].Поле Тогда
				МассивПолейРасшифровки.Удалить(ОбратныйИндекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Добавим отбор, установленный в отчете.
	Для каждого ЭлементОтбора Из ТекущийОтчет.Настройки.Отбор.Элементы Цикл
		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		МассивПолейРасшифровки.Добавить(ЭлементОтбора);
	КонецЦикла;
	
	Возврат МассивПолейРасшифровки;
	
КонецФункции

Функция ДобавитьРодителей(ЭлементРасшифровки, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы = Ложь)  Экспорт
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Новый ПолеКомпоновкиДанных(Поле.Поле), ТекущийОтчет);
			Если ДоступноеПоле = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Не ВключатьРесурсы И ДоступноеПоле.Ресурс Тогда
				Продолжить;
			КонецЕсли;
			МассивПолейРасшифровки.Добавить(Поле);
		КонецЦикла;
	КонецЕсли;
	Для каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДобавитьРодителей(Родитель, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	КонецЦикла;
	
КонецФункции

// Возвращает доступное поле по полю компоновки.
Функция ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ПолеКомпоновкиДанных, ОбластьПоиска) Экспорт
	
	Если ТипЗнч(ПолеКомпоновкиДанных) = Тип("Строка") Тогда
		ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
	Иначе
		ПолеПоиска = ПолеКомпоновкиДанных;
	КонецЕсли;
	
	Если ТипЗнч(ОбластьПоиска) = Тип("КомпоновщикНастроекКомпоновкиДанных")
		Или ТипЗнч(ОбластьПоиска) = Тип("ДанныеРасшифровкиКомпоновкиДанных")
		Или ТипЗнч(ОбластьПоиска) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		Возврат ОбластьПоиска.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеПоиска);
	Иначе
		Возврат ОбластьПоиска.НайтиПоле(ПолеПоиска);
	КонецЕсли;
	
КонецФункции

// Функция определения значения из строки.
//
Функция бит_ВернутьЛицевойСчет(СтрокаДляРазбора, ПострокаПоиска,ЛицевойСчет = Неопределено )
	
	// БИТ_ЖКХ 28.07.2014
	ДлинаСтроки      = СтрДлина(СтрокаДляРазбора);
	
	Пока ДлинаСтроки <> 0 Цикл
		
		ПозицияПрисваивания = Найти(СтрокаДляРазбора, ПострокаПоиска);
		
		Если ПозицияПрисваивания = 0 Тогда
			
			Значение = СокрЛП(Лев(СтрокаДляРазбора, ДлинаСтроки));
			ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(Значение, Истина);
			Прервать;
			
		КонецЕсли;
		
		Значение = СокрЛП(Лев(СтрокаДляРазбора, ПозицияПрисваивания - 1));
		
		ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(Значение, Истина);
		
		Если ЛицевойСчет <> Неопределено Тогда
			Прервать;
		КонецЕсли; 
		
		Тег = Лев(СтрокаДляРазбора, ПозицияПрисваивания);
		ДлинаСтроки = ДлинаСтроки - СтрДлина(Тег);
		СтрокаДляРазбора = Прав(СтрокаДляРазбора,ДлинаСтроки);
		
	КонецЦикла;
	// БИТ_ЖКХ 28.07.2014
	
	Возврат ЛицевойСчет;
	
КонецФункции // ()
// БИТ_ЖКХ 16.01.2015}}

#КонецОбласти

#Область НастройкиДоступности

// Процедура проверяет наличие признака "Использовать при открытии" для других настроек по этому же ключу.
//
// Параметры:
//  ТекВариантНастройка - СправочникСсылка.бит_ВариантыОтчетов, СправочникСсылка.бит_СохраненныеНастройки.
//	ТекПользователь     - СправочникСсылка.ГруппыПользователей, СправочникСсылка.Пользователи.
//  
Процедура СброситьИспользоватьПриОткрытии(ТекВариантНастройка, ТекПользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючОбъекта"	       , ТекВариантНастройка.КлючОбъекта);
	Запрос.УстановитьПараметр("Пользователь"       , ТекПользователь);
	Запрос.УстановитьПараметр("ТекВариантНастройка", ТекВариантНастройка);	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НастройкиДоступности.ВариантНастройка
	|ИЗ
	|	РегистрСведений.бит_НастройкиДоступностиВариантовОтчетов КАК НастройкиДоступности
	|ГДЕ
	|	НастройкиДоступности.ВариантНастройка.КлючОбъекта = &КлючОбъекта
	|	И НастройкиДоступности.Пользователь = &Пользователь
	|	И НастройкиДоступности.ВариантНастройка <> &ТекВариантНастройка
	|	И НастройкиДоступности.ИспользоватьПриОткрытии
	|";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 	
		НаборЗаписей = РегистрыСведений.бит_НастройкиДоступностиВариантовОтчетов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВариантНастройка.Установить(Выборка.ВариантНастройка);
		НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
		НаборЗаписей.Прочитать();
		НаборЗаписей[0].ИспользоватьПриОткрытии = Ложь;
		бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборЗаписей, "Ошибки");	
	КонецЦикла; 	

КонецПроцедуры // СброситьИспользоватьПриОткрытии()

// Процедура изменяет признак "ИспользоватьПриОткрытии" у указнанного варианта/настройки.
// При установке признака в "Истина" выполняется проверка в рамках варианта.
// У других настроек признак сбрасывается в "Ложь".
//
// Параметры:
//  ВариантНастройка  		- СправочникСсылка.бит_ВариантОтчета или СправочникСсылка.бит_СохраненныеНастройки.
//  ИспользоватьПриОткрытии - Булево.
//  ТекПользователь			- СправочникСсылка.Пользователи.
//
Процедура ИзменитьИспользоватьПриОткрытии(ВариантНастройка, ИспользоватьПриОткрытии, ТекПользователь = Неопределено) Экспорт

	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	НастройкаЗаписана = Ложь;
	
	// Поиск записей в регистре бит_НастройкиДоступностиВариантовОтчетов по пользователю и варианте/настройке.
	НаборЗаписей = РегистрыСведений.бит_НастройкиДоступностиВариантовОтчетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВариантНастройка.Установить(ВариантНастройка);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		// Если в регистре нет записей, но нужно установить признак "Использовать при открытии".
		Если ИспользоватьПриОткрытии Тогда
		 	Запись = НаборЗаписей.Добавить();
			Запись.Пользователь     = ТекПользователь;
			Запись.ВариантНастройка = ВариантНастройка;
			Запись.Просмотр  		= Истина;
			Запись.Изменение 		= Истина;
			Запись.ИспользоватьПриОткрытии = ИспользоватьПриОткрытии;
			НастройкаЗаписана = бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборЗаписей, "Ошибки");
		КонецЕсли;
		
	Иначе
		
		// Если в регистре есть записи и признак "Использовать при открытии" в ней нужно изменить. 
		Если НаборЗаписей[0].ИспользоватьПриОткрытии <> ИспользоватьПриОткрытии Тогда
			НаборЗаписей[0].ИспользоватьПриОткрытии = ИспользоватьПриОткрытии;		
			НастройкаЗаписана = бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборЗаписей, "Ошибки");
		КонецЕсли;                                                            		
		
	КонецЕсли;
	
	// Если записана настройка в регистр с признаком "Использовать при открытии" равным истине.
	// То нужно сбросить все признаки у настроек совпадающих по ключу объекта и пользователю с текущей записью.
	Если НастройкаЗаписана И ИспользоватьПриОткрытии Тогда
		СброситьИспользоватьПриОткрытии(ВариантНастройка, ТекПользователь);			
	КонецЕсли; 
	
КонецПроцедуры // ИзменитьОткрыватьПоУмолчанию()

// Функция проверяет подходит ли настройка по умолчанию.
//
// Параметры:
//  ИспользуемаяПоУмолчаниюНастройка - СправочникСсылка.бит_СохраненныеНастройки.
//  СтруктураПроверки		  - Структура проверки данных для определения возможности.
//								установки в качестве настройки по умолчанию.
//  
// Возвращаемое значение:
//   Булево - настройка подходит.
//
Функция НастройкаПоУмолчаниюПодходит(ИспользуемаяПоУмолчаниюНастройка, СтруктураПроверки) Экспорт
	
	ДанныеПодходят = Истина;
	
	// Если нужно проверить данные настройки на возможность установки по умолчанию.
	Если СтруктураПроверки <> Неопределено Тогда
		
		// Данные из хранилища настроек.
		ДанныеНастройки = ИспользуемаяПоУмолчаниюНастройка.ХранилищеНастроек.Получить();					
		Если ДанныеНастройки <> Неопределено Тогда
			
			Для каждого КлЗнч Из СтруктураПроверки Цикл
				
				ИмяРеквизита 	  = КлЗнч.Ключ;
				ЗначениеРеквизита = КлЗнч.Значение;
				Если ДанныеНастройки[ИмяРеквизита] <> ЗначениеРеквизита Тогда
					// Значение реквизита в настройках не подходит.
					ДанныеПодходят = Ложь;
					Прервать;
				КонецЕсли;  							
			
			КонецЦикла;     							
		
		КонецЕсли;	
	
	КонецЕсли;
		
	Возврат ДанныеПодходят;
	
КонецФункции // НастройкаПоУмолчаниюПодходит()

// Функция проверяет доступность вариантов и настроек, формирует вспомогательные структуры.
//
// Параметры:
//  НастраиваемыйОбъект				   - Строка.
//  ЗаполнятьСтруктуруНастроекСсылками - Булево (По умолчанию = Ложь).
//	СтруктураДоступности			   - Структура (По умолчанию = Неопределено).
//  
// Возвращаемое значение:
//   СправочникСсылка.бит_СохраненныеНастройки.
//
Функция НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект, ПолучитьКлюч = Ложь, СтруктураДоступности = Неопределено) Экспорт

	// Используемые при открытии.
	ИспользуемаяПриОткрытииНастройка = Неопределено;
	МассивНедоступныхНастроек = ?(СтруктураДоступности = Неопределено, Новый Массив, СтруктураДоступности.МассивИсключений);
		
	ИмяТчСоставГруппПользователей = ?(Метаданные.Справочники.ГруппыПользователей.ТабличныеЧасти.Найти("Состав") = Неопределено
		, "ПользователиГруппы"
		, "Состав");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь"	   , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	Запрос.УстановитьПараметр("ГруппаПоУмолчанию"  , Справочники.ГруппыПользователей.ВсеПользователи);
	Запрос.УстановитьПараметр("Настройка"		   , ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнаяГруппаПользователя);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", НастраиваемыйОбъект);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	&Пользователь КАК ПользовательГруппа,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ МассивПользователейГрупп
    |
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	бит_НастройкиПользователей.ЗначениеНастройки,
	|	1
	|ИЗ
	|	РегистрСведений.бит_НастройкиПользователей КАК бит_НастройкиПользователей
	|ГДЕ
	|	бит_НастройкиПользователей.Пользователь = &Пользователь
	|	И бит_НастройкиПользователей.Настройка = &Настройка
    |
	|СГРУППИРОВАТЬ ПО
	|	бит_НастройкиПользователей.ЗначениеНастройки
    |
	|ОБЪЕДИНИТЬ ВСЕ  
	|ВЫБРАТЬ
	|	&ГруппаПоУмолчанию,
	|	2
    |
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ
	|	ГруппыПользователей.Ссылка,
	|	3
	|ИЗ
	|	Справочник.ГруппыПользователей." + ИмяТчСоставГруппПользователей + " КАК ГруппыПользователей
	|ГДЕ
	|	ГруппыПользователей.Пользователь = &Пользователь
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(МассивПользователейГрупп.Приоритет) КАК Приоритет,
	|	РегСвНастройки.ВариантНастройка
	|ПОМЕСТИТЬ АктуальныеПриоритеты
	|ИЗ
	|	МассивПользователейГрупп КАК МассивПользователейГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиДоступностиВариантовОтчетов КАК РегСвНастройки
	|		ПО (РегСвНастройки.Пользователь = МассивПользователейГрупп.ПользовательГруппа)
	|ГДЕ
	|	РегСвНастройки.ВариантНастройка.КлючОбъекта = &НастраиваемыйОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	РегСвНастройки.ВариантНастройка
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегСвНастройки.ВариантНастройка						КАК ВариантНастройка,
	|	РегСвНастройки.Просмотр,
	|	РегСвНастройки.Изменение,
	|	МАКСИМУМ(МассивПользователейГрупп.Приоритет) 		КАК Приоритет, 
	|	МАКСИМУМ(РегСвНастройки.ИспользоватьПриОткрытии) 	КАК ИспользоватьПриОткрытии, 
	|	РегСвНастройки.ВариантНастройка.КлючОбъекта			КАК КлючОбъекта,
	|	РегСвНастройки.ВариантНастройка.КлючВарианта       КАК КлючНастройки
	|	
	|ИЗ
	|	МассивПользователейГрупп КАК МассивПользователейГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиДоступностиВариантовОтчетов КАК РегСвНастройки
	|			ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеПриоритеты КАК АктуальныеПриоритеты
	|			ПО РегСвНастройки.ВариантНастройка = АктуальныеПриоритеты.ВариантНастройка
	|		ПО (РегСвНастройки.Пользователь = МассивПользователейГрупп.ПользовательГруппа)
	|ГДЕ
	|	АктуальныеПриоритеты.Приоритет = МассивПользователейГрупп.Приоритет
	|	И РегСвНастройки.ВариантНастройка.КлючОбъекта = &НастраиваемыйОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	РегСвНастройки.Просмотр,
	|	РегСвНастройки.Изменение,
	|	РегСвНастройки.ВариантНастройка,
	|	РегСвНастройки.ВариантНастройка.КлючОбъекта,
	|	РегСвНастройки.ВариантНастройка.КлючВарианта
    |
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(МассивПользователейГрупп.Приоритет),
	|	РегСвНастройки.ВариантНастройка
	|";
	Результат = Запрос.Выполнить();
			 
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
			
		Если Выборка.Просмотр Тогда
			// Используемая при открытии.
			Если Выборка.ИспользоватьПриОткрытии И МассивНедоступныхНастроек.Найти(Выборка.КлючНастройки) = Неопределено Тогда
				ИспользуемаяПриОткрытииНастройка = ?(ПолучитьКлюч, Выборка.КлючНастройки, Выборка.ВариантНастройка);
				Прервать;					
			КонецЕсли;
		КонецЕсли;	
	
	КонецЦикла; 									 
	
	Возврат ИспользуемаяПриОткрытииНастройка;
	
КонецФункции // НайтиНастройкуПоУмолчаниюДляОбъекта()

//31.01.2019 61
Функция бит_ПолучитьЛьготыБезКапРемонта(ПлатежныйДокумент) Экспорт
	
	суммаЛьгот = 0;
	
	для каждого стр из ПлатежныйДокумент.ТаблицаПлатежиГИСЖКХ36 цикл
		
		если стр.Услуга.ГрафаОтчетаГЦЖС <> перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт тогда	
			суммаЛьгот = суммаЛьгот + стр.Льготы;
		конецесли;	
		
	конеццикла;	
	
	Возврат суммаЛьгот;
	
КонецФункции


функция ПолучитьЕдиницуИзмерения (Услуга, ЛицевойСчет) Экспорт
	
  возврат "Из справочника";
  запрос= новый запрос;
  запрос.Текст = "ВЫБРАТЬ
  	|бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета
	| ИЗ
	| РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ) КАК бит_СведенияПоУслугамЛССрезПоследних
    | ГДЕ
	|   бит_СведенияПоУслугамЛССрезПоследних.Услуга = &Услуга
	|    И бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет";
  
  запрос.УстановитьПараметр("Услуга", Услуга);
  запрос.УстановитьПараметр("Дата", ТекущаяДата());
  запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
   
  табУслуг = запрос.Выполнить().Выгрузить();
  если табУслуг.Количество() > 0 тогда
	  
	СпособРасчета = табУслуг[0].СпособРасчета; 
	запросЕдИзм = новый запрос;
    запросЕдИзм.Текст = "ВЫБРАТЬ
	                     |бит_УслугиЖКХСпособыРасчета.Ссылка КАК Ссылка,
	                     |бит_УслугиЖКХСпособыРасчета.СпособРасчета КАК СпособРасчета,
	                     |бит_УслугиЖКХСпособыРасчета.ЕдИзм КАК ЕдИзм,
	                     |бит_УслугиЖКХСпособыРасчета.Основной КАК Основной
                         | ИЗ
	                     |Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
                         | ГДЕ
	                     |   бит_УслугиЖКХСпособыРасчета.Ссылка = &Ссылка
	                     |    И бит_УслугиЖКХСпособыРасчета.СпособРасчета = &СпособРасчета";
	
    запросЕдИзм.УстановитьПараметр("Ссылка", Услуга);
    запросЕдИзм.УстановитьПараметр("СпособРасчета", СпособРасчета);

    табРасчетов = запросЕдИзм.Выполнить().Выгрузить();

    если табРасчетов.Количество() > 0 тогда
     возврат строка(табРасчетов[0].ЕдИзм);
    конецесли;	

  конецесли;  
	
конецфункции	

//22.02.2019
Функция ПолучитьСуммуНачисленийЗаПериод(датаПериода, ЛицевойСчет, УслугаЖКХ) Экспорт
	
   запрос = новый Запрос;
   запрос.Текст = "ВЫБРАТЬ
                  |	бит_НачисленияПоУслугамЖКХ.Период КАК Период,
                  |	бит_НачисленияПоУслугамЖКХ.Регистратор КАК Регистратор,
                  |	бит_НачисленияПоУслугамЖКХ.ВидДвижения КАК ВидДвижения,
                  |	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет КАК ЛицевойСчет,
                  |	бит_НачисленияПоУслугамЖКХ.УслугаЖКХ КАК УслугаЖКХ,
                  |	бит_НачисленияПоУслугамЖКХ.Сумма КАК Сумма,
                  |	бит_НачисленияПоУслугамЖКХ.Объем КАК Объем
                  |ИЗ
                  |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ КАК бит_НачисленияПоУслугамЖКХ
                  |ГДЕ
                  |	бит_НачисленияПоУслугамЖКХ.Период МЕЖДУ &ПериодНачало И &ПериодКонец
                  |	И бит_НачисленияПоУслугамЖКХ.ЛицевойСчет = &ЛицевойСчет
                  |	И бит_НачисленияПоУслугамЖКХ.УслугаЖКХ = &УслугаЖКХ";
   
   запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
   запрос.УстановитьПараметр("УслугаЖКХ", УслугаЖКХ);
   запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(датаПериода));
   запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(датаПериода));
   
   табЗапроса = запрос.Выполнить().Выгрузить();

   суммаВозврата = 0;
   для каждого стр из табЗапроса цикл
	   
	   если ТипЗнч(стр.Регистратор) = Тип ("ДокументСсылка.бит_НачисленияПоСчетчикам") тогда
		  суммаВозврата = суммаВозврата + стр.Сумма; 
	   конецесли;	   
	   
   конеццикла;	   
   
   возврат суммаВозврата;
	
КонецФункции	

//15.03.2019
Функция ПолучитьСуммуСубсидий(датаПериода, УслугаЖКХ, ЛицевойСчет) Экспорт
	
   запрос = новый Запрос;
   
   запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	СУММА(ВЫБОР
                   |			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
                   |				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
                   |			ИНАЧЕ 0
                   |		КОНЕЦ * -1) КАК СубсидияПИ,
                   |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор
                   |ИЗ
                   |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
                   |			&НачалоПериода,
                   |			&КонецПериода,
                   |			Регистратор,
                   |			ЛицевойСчет = &ЛицевойСчет
                   |				И УслугаЖКХ = &УслугаЖКХ) КАК бит_НачисленияПоУслугамЖКХОбороты
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	бит_НачисленияПоУслугамЖКХОбороты.Регистратор";

   
  
   запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
   запрос.УстановитьПараметр("УслугаЖКХ", УслугаЖКХ);
   запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(датаПериода));
   запрос.УстановитьПараметр("КонецПериода", КонецМесяца(датаПериода));
   
   табЗапроса = запрос.Выполнить().Выгрузить();

   суммаВозврата = 0;
   для каждого стр из табЗапроса цикл
	   
	   если ТипЗнч(стр.Регистратор) = Тип ("ДокументСсылка.бит_РасчетПредельногоИндекса") тогда
		  суммаВозврата = суммаВозврата + стр.СубсидияПИ; 
	   конецесли;	   
	   
   конеццикла;	   
   
   возврат суммаВозврата;
	
КонецФункции	

//15.03.2019
Функция ПолучитьПовышающийКоэффициент( УслугаЖКХ ) Экспорт
	
   запрос = новый Запрос;
   
   запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                  |	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Начислять КАК Начислять,
                  |	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы КАК ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы
                  |ИЗ
                  |	РегистрСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СрезПоследних КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
                  |ГДЕ
                  |	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга = &Услуга
                  |	И бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Начислять = &Начислять";

   
  
   запрос.УстановитьПараметр("Услуга", УслугаЖКХ);
   запрос.УстановитьПараметр("Начислять", истина);
   
   табЗапроса = запрос.Выполнить().Выгрузить();
   
   если табЗапроса.Количество() > 0 тогда
     возврат табЗапроса[0].ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы;
   иначе	 
	 возврат неопределено;
   конецесли;	 
КонецФункции	

// БИТ ЖКХ 15.03.2019
Функция ПолучитьНачисленоЗаРасчетныйПериод(НачисленоИнд, НачисленоОбщДом)Экспорт	
	
   суммаНачислений = 0; 
   
   если ЗначениеЗаполнено(НачисленоИнд) = ложь тогда
	вНачисленоИнд = 0;	
   иначе
    вНачисленоИнд = НачисленоИнд;//Число(НачисленоИнд);
   конецесли;	

   если ЗначениеЗаполнено(НачисленоОбщДом) = ложь тогда
	вНачисленоОбщДом = 0;	
   иначе
    вНачисленоОбщДом = НачисленоОбщДом;//Число(вНачисленоОбщДом);
   конецесли;
   
   попытка
    суммаНачислений = вНачисленоИнд+вНачисленоОбщДом;
   исключение
	суммаНачислений = 0;   
   конецпопытки;	   
   
   возврат суммаНачислений;
	
КонецФункции	

// БИТ ЖКХ 04.03.2020
Функция ПолучитьПаспортныеДанныеФизлица(Физлицо) Экспорт	
	
   запрос = новый Запрос;
   
   запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо КАК ФизЛицо,
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения
                  |ИЗ
                  |	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
                  |ГДЕ
                  |	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо = &ФизЛицо";

   
   запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
      
   табЗапроса = запрос.Выполнить().Выгрузить();
   
   если табЗапроса.Количество() > 0 тогда
	 паспортныеДанные = строка(табЗапроса[0].ДокументВид);
	 паспортныеДанные = паспортныеДанные + ", выдан: " + строка(табЗапроса[0].ДокументКемВыдан);
     паспортныеДанные = паспортныеДанные + " " + строка(табЗапроса[0].ДокументДатаВыдачи);
     паспортныеДанные = паспортныеДанные + ", код подр.: " + строка(табЗапроса[0].ДокументКодПодразделения);
	 паспортныеДанные = паспортныеДанные + ", номер: " + строка(табЗапроса[0].ДокументНомер);
	 паспортныеДанные = паспортныеДанные + ", серия: " + строка(табЗапроса[0].ДокументСерия);
     возврат паспортныеДанные;
   иначе	 
	 возврат неопределено;
   конецесли;
  	
КонецФункции

// БИТ ЖКХ 04.03.2020
Функция ПолучитьДанныеПравоустанавливающихДокументов(Док) Экспорт	
	
   запрос = новый Запрос;
   
   запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                  |	бит_ПравоустанавливающиеДокументы.Ссылка КАК Ссылка,
                  |	бит_ПравоустанавливающиеДокументы.Наименование КАК Наименование,
                  |	бит_ПравоустанавливающиеДокументы.НомерДокумента КАК НомерДокумента,
                  |	бит_ПравоустанавливающиеДокументы.ДатаДокумента КАК ДатаДокумента,
                  |	бит_ПравоустанавливающиеДокументы.ОрганизацияВыдавшаяДокумент КАК ОрганизацияВыдавшаяДокумент
                  |ИЗ
                  |	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
                  |ГДЕ
                  |	бит_ПравоустанавливающиеДокументы.Ссылка = &Ссылка";

   
   запрос.УстановитьПараметр("Ссылка", Док);
      
   табЗапроса = запрос.Выполнить().Выгрузить();
   
   если табЗапроса.Количество() > 0 тогда
	 паспортныеДанные = строка(табЗапроса[0].Наименование);
	 паспортныеДанные = паспортныеДанные + ", номер: " + строка(табЗапроса[0].НомерДокумента);
	 паспортныеДанные = паспортныеДанные + ", выдан: " + строка(Формат(табЗапроса[0].ДатаДокумента, "ДЛФ=ДД"));
     паспортныеДанные = паспортныеДанные + " " + строка(табЗапроса[0].ОрганизацияВыдавшаяДокумент);
     возврат паспортныеДанные;
   иначе	 
	 возврат неопределено;
   конецесли;
  	
КонецФункции

Функция ПолучитьКоличествоПроживающихНаЛС(ЛС) Экспорт	
	
   запрос = новый Запрос;
   
    запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
    |ИЗ
	|РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
    |ГДЕ
	|бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет
	|И бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = &ДатаСнятияСРегистрации";
   
   запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
   запрос.УстановитьПараметр("ДатаСнятияСРегистрации", '00010101000000');
      
   табЗапроса = запрос.Выполнить().Выгрузить();
   возврат табЗапроса.Количество();	
КонецФункции

Функция ПолучитьКоличествоЛСПоКвартире(Квартира, ЛС) Экспорт	
	
	//если ЛС <> неопределено тогда
	// возврат 1;
	//конецесли; 
	//
    запрос = новый Запрос;
   
    запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
                   |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
                   |ИЗ
                   |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
                   |ГДЕ
                   |	бит_ЛицевыеСчета.Квартира = &Квартира";
   
   запрос.УстановитьПараметр("Квартира", Квартира);   
      
   табЗапроса = запрос.Выполнить().Выгрузить();
   возврат табЗапроса.Количество();	
КонецФункции

#КонецОбласти