
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТаблицыРасшифровкиВХранилище") Тогда
		
		ТаблицаРасшифровкиИзФормыЭлемента  = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыРасшифровкиВХранилище);
		ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаРасшифровки");
		
		МассивРеквизитов = Новый Массив;
	
		Для Каждого Колонка Из ТаблицаРасшифровкиИзФормыЭлемента.Колонки Цикл
			
			Если ТаблицаРасшифровкиИзРеквизитаФормы.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				
				МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаРасшифровки"));
				
			КонецЕсли;
			
		КонецЦикла;
		
	    ИзменитьРеквизиты(МассивРеквизитов);
   
	    ЗначениеВРеквизитФормы(ТаблицаРасшифровкиИзФормыЭлемента, "ТаблицаРасшифровки");
		
		Элементы.ТаблицаСчетчиков.Видимость =  Ложь;
		
	ИначеЕсли  Параметры.Свойство("АдресТаблицыРасшифровкиСчетчиковВХранилище") Тогда
		
		ТаблицаРасшифровкиИзФормыЭлемента  = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыРасшифровкиСчетчиковВХранилище);
		
		ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаРасшифровки");
		
		
		МассивРеквизитов = Новый Массив;
		
		Для Каждого Колонка Из ТаблицаРасшифровкиИзФормыЭлемента.Колонки Цикл
			
			Если ТаблицаРасшифровкиИзРеквизитаФормы.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				
				МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаРасшифровки"));
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИзменитьРеквизиты(МассивРеквизитов);
		
		ТаблицаРасшифровкиИзФормыЭлементаСкоп = ТаблицаРасшифровкиИзФормыЭлемента.Скопировать(,"Услуга, СпособРасчета, Ставка, СверхномСтавка, Норма, СверхНорма, Начислено");

		ЗначениеВРеквизитФормы(ТаблицаРасшифровкиИзФормыЭлементаСкоп, "ТаблицаСчетчиков");
		
		Элементы.ТаблицаРасшифровки.Видимость =  Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ТаблицаРасшифровкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.Имя = "ДоляОтГруппового" Тогда
		
		АдресТаблицыРасшифровкиВХранилище = ПоместитьТаблицуРасшифровкиВХранилище();
	
	    ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиВХранилище", АдресТаблицыРасшифровкиВХранилище);
		
		ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаРасшифровкиКоличестваЕдиницУправляемая", ПараметрыФормы, Элемент);
				
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПоместитьТаблицуРасшифровкиВХранилище()
	
	ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТаблицаРасшифровкиИзРеквизитаФормы, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

#КонецОбласти