#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВерсииТаблицШаблоновГИСЖКХ(ЭтоКоманда = Ложь) Экспорт
	
	ВерсииТаблицШаблоновГИСЖКХ = Новый Соответствие;
	
	Если ЭтоКоманда Тогда
		Возврат ВерсииТаблицШаблоновГИСЖКХ;	
	КонецЕсли;
	
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаАбонентовМО		,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопКоммРесурсы_Гр	,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопКоммРесурсы_Инд	,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаДопЛСПУ			,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилогоФондаМО		,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЖилыхПомещений		,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЗданий				,"1.3.2.50");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаИПУ				,"1.3.2.73");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаИПУМО				,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаКомнат				,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЛС					,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаЛСКапРем			,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаНежилыхПомещений	,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОДПУ				,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОДПУМО				,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплаты				,"1.3.2.99");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаОплатыКапРем		,"1.3.2.99");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2				,"1.3.2.97");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2КапРем		,"1.3.2.97");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2_2020			,"1.3.2.115");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД1_2КапРем2020	,"1.3.2.118");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6				,"1.3.2.98");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6КапРем		,"1.3.2.98");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6_2020 		,"1.3.2.115");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПД3_6КапРем2020	,"1.3.2.118");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПД				,"1.3.2.70");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДДПДКапРем		,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойки		,"1.3.2.66");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДНеустойкиКапРем	,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПодъездов			,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПомещений			,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПомещенийКапРем	,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПоставщиковУслугМО	,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПроживающихМО		,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПУ_Гр				,"1.3.2.42");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПУ_Инд				,"1.3.2.50");
	ВерсииТаблицШаблоновГИСЖКХ.Вставить(Справочники.бит_ТаблицыШаблоновГИСЖКХ.ТаблицаПДПлатежныеРеквизиты,"1.3.2.117");
	
	Возврат ВерсииТаблицШаблоновГИСЖКХ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
