
#Область ДействияКомандФормы

//  Процедура - обработчик команды "КомандаОбновитьПредопределенныеВарианты".
//
&НаКлиенте
Процедура КомандаОбновитьПредопределенныеВарианты(Команда)
	
	ОбновитьПредопределенныеВарианты();
	ТекстСообщения = Нстр("ru = 'Завершено обновление справочника ""Варианты отчётов"".'");
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.бит_ВариантыОтчетов"));
	
КонецПроцедуры // КомандаОбновитьПредопределенныеВарианты()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

//  Процедура обновляет предопределённые варианты отчётов.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура ОбновитьПредопределенныеВарианты()
	
	бит_ВариантыОтчета.ОбновитьПредопределенныеВарианты();
		
КонецПроцедуры // ОбновитьПредопределенныеВарианты()

#КонецОбласти