#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПриИзменении".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = "Элемент не может быть записан!";
	
			
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ТекстСообщения  = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС)+ " Не заполнен источник финансирования.";
		Отказ = Истина;
	КонецЕсли;
	
		
	Если Отказ Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли