#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПриИзменении".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = "Элемент не может быть записан!";
	
	// Проверяем на заполнение обязательные реквизиты.
		
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ТекстСообщения  = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС)+ " Не заполнено наименование.";
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипКомнаты) Тогда
		ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС)+ " Не заполнен тип комнаты.";
		Отказ = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Принадлежность) Тогда
		ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС)+ " Не заполнена принадлежность комнаты.";
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 
