
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 17.10.2014
	ЗаполнитьКэшЗначений(мКэшЗначений);
	// БИТ_ЖКХ 17.10.2014
	
	бит_ОтчетыВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// Вызов механизма разделения прав доступа.
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет,Тип("ОтчетОбъект.бит_СчетчикиНаЛС"));
	бит_ПраваДоступа.ПередОткрытиемФормыОтчета(Отказ,СтандартнаяОбработка,ОтчетОбъект,ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	бит_ОтчетыВызовСервера.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	бит_ОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если мКэшЗначений <> Неопределено Тогда
		
		Если мКэшЗначений.ИзЛС Тогда
			
			ЗначениеПараметраЛС = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ЛицевойСчет"));
			
			ЗначениеПараметраСчетчик = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Счетчик"));
			ЗначениеСчетчик = мКэшЗначений.Счетчик; 
			
			ЗначениеПараметраУслуга = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Услуга"));
			ЗначениеУслуга = мКэшЗначений.Услуга; 
			
			Для Каждого ТекСтрока Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
				Если ТекСтрока.ЛевоеЗначение = ЗначениеПараметраЛС.Поле тогда
					ТекСтрока.ПравоеЗначение = мКэшЗначений.ЛицевойСчет;
					ТекСтрока.Использование  = Истина;
				КонецЕсли;	 
				Если ТекСтрока.ЛевоеЗначение = ЗначениеПараметраСчетчик.Поле тогда
					ТекСтрока.ПравоеЗначение = ЗначениеСчетчик;
					ТекСтрока.Использование  = Истина;
				КонецЕсли;	 
				Если ТекСтрока.ЛевоеЗначение = ЗначениеПараметраУслуга.Поле тогда
					ТекСтрока.ПравоеЗначение = ЗначениеУслуга;
					ТекСтрока.Использование  = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			ОчиститьСообщения();
			
			РезультатВыполнения = Подключаемый_СформироватьОтчетНаСервере();
			Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
				бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// БИТ_ЖКХ 17.10.2014
// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения  = Новый Структура; 
	
	КэшированныеЗначения.Вставить("ИзЛС", Параметры.Свойство("ИзЛС"));
	
	Если Параметры.Свойство("ИзЛС") Тогда
		КэшированныеЗначения.Вставить("Счетчик", Параметры.ИзЛС.Счетчик);
		КэшированныеЗначения.Вставить("Услуга", Параметры.ИзЛС.Услуга);
		КэшированныеЗначения.Вставить("ЛицевойСчет", Параметры.ИзЛС.ЛицевойСчет);
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 17.10.2014

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура Отбор(Команда)
	
	Элементы.ФормаОтбор.Пометка = Не Элементы.ФормаОтбор.Пометка;
	
	Отбор = НЕ Отбор;
	
	Если Отбор = Истина Тогда
		Элементы.КомпоновщикНастроекНастройкиОтбор.Видимость = Истина;	
		
	Иначе
		
		Элементы.КомпоновщикНастроекНастройкиОтбор.Видимость = Ложь;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	РезультатВыполнения = Подключаемый_СформироватьОтчетНаСервере();
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	бит_Отчеты.ОбработкаРасшифровкиСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция Подключаемый_СформироватьОтчетНаСервере() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ИдентификаторЗадания = Неопределено;
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчетаНаСервере();
	
	// БИТ ЖКХ 20.01.2020
	ДатаКонцаПериода = ПараметрыОтчета.НастройкиКомпоновкиДанных.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ДатаКонцаПериода.Значение = КонецДня(ДатаКонцаПериода.Значение);

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	бит_ОтчетыВызовСервера.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанныеНаСервере();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанныеНаСервере()
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат           = РезультатВыполнения.Результат;
	ДанныеРасшифровки   = РезультатВыполнения.ДанныеРасшифровки;
	
	ИдентификаторЗадания = Неопределено;
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыОтчетаНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ИспользоватьВнешниеНаборыДанных"  , Истина);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("МакетОформления"                  , МакетОформления);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"            , ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , бит_ОтчетыКлиентСервер.ПолучитьИдентификаторОбъекта(ЭтаФорма));
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Возврат ПараметрыОтчета;
	
КонецФункции

#КонецОбласти