
#Область РаботаСПрофилямиДоступа

// Процедура добавляет в типовые профили необходимые роли БИТ в БП. 
// И создает профили БИТ. 
//
// Параметры:
//  ОписанияПрофилей – Массив.
//
Процедура ДоработатьОписаниеПоставляемыхПрофилей(ОписанияПрофилей) Экспорт
	            	
	//----------------------------------------------------------------------
	// Доработка типовых профилей
	
	ПрофильБухгалтер 	  = Неопределено;
	ПрофильТолькоПросмотр = Неопределено;
	
	Для каждого ОпТиповой Из ОписанияПрофилей Цикл
		
		Если ОпТиповой.Идентификатор = "ea55b08d-7d30-11e0-b9a7-20cf30c960bf" Тогда
			
			ПрофильБухгалтер = ОпТиповой;
			
			БП_СоздатьПрофилиБитНаОсновеБухгалтера(ОписанияПрофилей, ПрофильБухгалтер);
			
			// Бухгалтер
			ПрофильБухгалтер.Роли.Добавить("бит_ПользовательЖКХ");
			
		ИначеЕсли ОпТиповой.Идентификатор = "62730c03-81d6-11e0-a42a-be487808c52b" Тогда
			
			// Главный бухгалтер
			ОпТиповой.Роли.Добавить("бит_ПользовательЖКХ");
			
		ИначеЕсли ОпТиповой.Идентификатор = "45ce5549-ade3-11e0-9746-00179a3853da" Тогда
			
			ПрофильТолькоПросмотр = ОпТиповой;
			
			// Только просмотр
			ОпТиповой.Роли.Добавить("бит_ПраваНаЧтение"); 			
			
		КонецЕсли; 
		
	КонецЦикла; // ОписанияПрофилей
		
	
	//----------------------------------------------------------------------
	// Собственные профили БИТ.ЖКХ
	
	// Минимальный профиль, обеспечивающий запуск системы
	МинимальныйПрофиль = ПолучитьНовоеОписаниеПрофиляГруппДоступа();
	МинимальныйПрофиль.Роли.Добавить("БазовыеПраваБСП");
	МинимальныйПрофиль.Роли.Добавить("БазовыеПраваБП");
	МинимальныйПрофиль.Роли.Добавить("БазовыеПраваЭД");
	МинимальныйПрофиль.Роли.Добавить("БазовыеПраваИПП");
	МинимальныйПрофиль.Роли.Добавить("БазовыеПраваБТС");
	МинимальныйПрофиль.Роли.Добавить("ЗапускAutomation");
	МинимальныйПрофиль.Роли.Добавить("ЗапускВебКлиента");
	МинимальныйПрофиль.Роли.Добавить("ЗапускВнешнегоСоединения");
	МинимальныйПрофиль.Роли.Добавить("ЗапускТолстогоКлиента");
	МинимальныйПрофиль.Роли.Добавить("ЗапускТонкогоКлиента");
	// БИТ_ЖКХ_07082015_начало_изменений //роль удалена из конфигурации
	//МинимальныйПрофиль.Роли.Добавить("ЧтениеБазовойНСИ");
	// БИТ_ЖКХ_07082015_окончание_изменений
	МинимальныйПрофиль.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	МинимальныйПрофиль.Роли.Добавить("ЧтениеДанныхСотрудников");
	// БИТ_ЖКХ 08.09.2017 18:02:01 Начало правки... 
	//МинимальныйПрофиль.Роли.Добавить("РаботаСПапкамиФайлов");
	МинимальныйПрофиль.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	// БИТ_ЖКХ 08.09.2017 18:02:02 Конец правки. 
	// БИТ_ЖКХ 06.09.2016 12:11:13 Начало правки... 
	//МинимальныйПрофиль.Роли.Добавить("ИспользованиеДополнительныхОтчетовИОбработок");
	МинимальныйПрофиль.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	// БИТ_ЖКХ 06.09.2016 12:11:15 Конец правки. 
	                                  
	// Паспортист
	опНов = ПолучитьНовоеОписаниеПрофиляГруппДоступа();
	опНов.Идентификатор = "f1b65145-3842-4236-bc49-0ea51915f372";
	опНов.Наименование  = "БИТ.Паспортист";
	опНов.Роли.Добавить("бит_Паспортист");
	опНов.Роли.Добавить("бит_ПользовательЖКХ");
	опНов.Роли.Добавить("бит_сл_Пользователь");
	
	СкопироватьРолиПрофиля(МинимальныйПрофиль, опНов);
	опНов.Описание =  НСтр("ru = 'Профиль обеспечивает работу с паспортным столом'");
	ДобавитьВидыДоступа(опНов);
	ОписанияПрофилей.Добавить(опНов);
	
	// Кассир
	опНов = ПолучитьНовоеОписаниеПрофиляГруппДоступа();
	опНов.Идентификатор = "f1b65145-3842-4236-bc49-0ea51915f373";
	опНов.Наименование  = "БИТ.Кассир";
	опНов.Роли.Добавить("бит_Кассир");
	опНов.Роли.Добавить("бит_ПользовательЖКХ");
	опНов.Роли.Добавить("бит_сл_Пользователь");
	// БИТ_ЖКХ 26.09.2017 18:14:23 Начало правки... 
	опНов.Роли.Добавить("ДобавлениеИзменениеПодключаемогоОборудования");
	//24.12.209 уьрана из типовой
	//опНов.Роли.Добавить("УдаленныйДоступСтандартныйИнтерфейсOData");
	// БИТ_ЖКХ 26.09.2017 18:14:25 Конец правки. 
	
	СкопироватьРолиПрофиля(МинимальныйПрофиль, опНов);
	опНов.Описание =  НСтр("ru = 'Профиль обеспечивает работу с кассой'");
	ДобавитьВидыДоступа(опНов);
	ОписанияПрофилей.Добавить(опНов);
	
	// Бухгалтер
	опНов = ПолучитьНовоеОписаниеПрофиляГруппДоступа();
	опНов.Идентификатор = "f1b65145-3842-4236-bc49-0ea51915f374";
	опНов.Наименование  = "БИТ.Бухгалтер";
	опНов.Роли.Добавить("бит_Бухгалтер");
	опНов.Роли.Добавить("бит_ПользовательЖКХ");
	опНов.Роли.Добавить("бит_сл_Пользователь");
	опНов.Роли.Добавить("бит_ВнешнийБиллинг");
	
	СкопироватьРолиПрофиля(МинимальныйПрофиль, опНов);
	опНов.Описание =  НСтр("ru = 'Профиль обеспечивает работу с расчетами по коммунальным услугам'");
	ДобавитьВидыДоступа(опНов);
	ОписанияПрофилей.Добавить(опНов);
	
	// Диспетчер
	опНов = ПолучитьНовоеОписаниеПрофиляГруппДоступа();
	опНов.Идентификатор = "f1b65145-3842-4236-bc49-0ea51915f375";
	опНов.Наименование  = "БИТ.Диспетчер";
	опНов.Роли.Добавить("бит_ДобавлениеИзменениеДиспетчерскаяСлужба");
	опНов.Роли.Добавить("бит_ПользовательЖКХ");
	опНов.Роли.Добавить("бит_сл_Пользователь");
	
	СкопироватьРолиПрофиля(МинимальныйПрофиль, опНов);
	опНов.Описание =  НСтр("ru = 'Профиль обеспечивает работу с диспетчерской службой'");
	ДобавитьВидыДоступа(опНов);
	ОписанияПрофилей.Добавить(опНов);
	
КонецПроцедуры // БП_ДоработатьОписаниеПоставляемыхПрофилей()

// Процедура добавляет виды доступа профилю
//
// Параметры:
//  ОписаниеПрофиля - Структура
//
Процедура ДобавитьВидыДоступа(ОписаниеПрофиля)

	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");

КонецПроцедуры // ДобавитьВидыДоступа()

// Процедура ыыполняет копирование ролей из описания одного профиля в другой.
//
// Параметры:
//  Источник – Структура.ОписаниеПрофиля.
//  Приемник - Структура.ОписаниеПрофиля.
//  Исключения - Строка.
//
Процедура СкопироватьРолиПрофиля(Источник, Приемник, Исключения  = "")
	
	МассивИсключений = бит_СтрокиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Исключения, ";");
	
	Для каждого СтрРоль Из Источник.Роли Цикл
	
		Если МассивИсключений.Найти(СтрРоль) = Неопределено Тогда 		
			Приемник.Роли.Добавить(СтрРоль);  		
		КонецЕсли;         		
		
	КонецЦикла; 
	
КонецПроцедуры // СкопироватьРолиПрофиля()

// Функция получает новое описание профиля групп доступа  
//  
// Возвращаемое значение:
//   Структура
//
Функция ПолучитьНовоеОписаниеПрофиляГруппДоступа()
	
	Результат = Неопределено;
	Модуль = бит_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеДоступом");
	Результат = Модуль.НовоеОписаниеПрофиляГруппДоступа();                

	Возврат Результат;
	
КонецФункции // ПолучитьНовоеОписаниеПрофиляГруппДоступа()

// Процедура добавляет новые описания профилей на основе типового профиля "Бухгалтер" в БП
//
// Параметры:
//  ОписанияПрофилей - Структура
//  ПрофильБухгалтер - Структура
//
Процедура БП_СоздатьПрофилиБитНаОсновеБухгалтера(ОписанияПрофилей, ПрофильБухгалтер)

	// Минимальный профиль, обеспечивающий возможность работы с типовыми механизмами
	МинимальныйПрофиль = ПолучитьНовоеОписаниеПрофиляГруппДоступа();
	// БИТ_ЖКХ 08.09.2017 18:02:36 Начало правки... 
	//МинимальныйПрофиль.Роли.Добавить("РаботаСПапкамиФайлов");
	МинимальныйПрофиль.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	// БИТ_ЖКХ 08.09.2017 18:02:37 Конец правки. 
	
	// Профили на основе типового профиля бухгалтер
	Если ТипЗнч(ПрофильБухгалтер) = Тип("Структура") Тогда
		
		// Пользователь ЖКХ полные права
		опНов = ПолучитьНовоеОписаниеПрофиляГруппДоступа();
		опНов.Идентификатор = "f712fb91-6037-4a89-b61d-aa0202ad6f7d";
		опНов.Наименование  = "БИТ.Пользователь ЖКХ(полные права)";
		опНов.Роли.Добавить("бит_ПользовательЖКХ");
		
		СкопироватьРолиПрофиля(ПрофильБухгалтер, опНов);
		СкопироватьРолиПрофиля(МинимальныйПрофиль, опНов);
		опНов.Описание =  НСтр("ru = 'Профиль базируется на типовом профиле ""Бухгалтер"" и дополнительно обеспечивает полный доступ к объектам ЖКХ.'");
		ДобавитьВидыДоступа(опНов);
		ОписанияПрофилей.Добавить(опНов);
		
	КонецЕсли;	

КонецПроцедуры // БП_СоздатьПрофилиБитНаОсновеБухгалтера()

#КонецОбласти