#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ИзвещениеФСС, ПараметрыВыполненияКоманды)
	ТекстОшибки = "";
	ДанныеФайла = ДанныеФайла(ИзвещениеФСС, ТекстОшибки);
	Если ДанныеФайла = Неопределено Тогда
		ИнформированиеПользователяКлиент.Предупредить(ТекстОшибки);
	Иначе
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеФайла(Знач ИзвещениеФСС, ТекстОшибки)
	СсылкаФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИзвещениеФСС, "ВходящийФайл");
	Если Не ЗначениеЗаполнено(СсылкаФайла) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найден файл ""%1"". Возможно извещение еще не загружено.'"), Строка(ИзвещениеФСС));
		Возврат Неопределено;
	КонецЕсли;
	Возврат РаботаСФайлами.ДанныеФайла(СсылкаФайла);
КонецФункции

#КонецОбласти

