
// Этот модуль предназначен для реализации алгоритмов работы с контактной информацией.

#Область ПроцедурыИФункцииОтображенияКИВФормахОбъектов

// Процедура заполняет поля объекта редактирования адреса по структуре.
//
Процедура ЗаполнитьОбъектРедактированияАдресаПоСтруктуре(Объект, СтруктураАдреса) Экспорт
	
	Если СтруктураАдреса = Неопределено Тогда
		
		Объект.Поле1 = "";
		Объект.Поле2 = "";
		Объект.Поле3 = "";
		Объект.Поле4 = "";
		Объект.Поле5 = "";
		Объект.Поле6 = "";
		Объект.Поле7 = "";
		Объект.Поле8 = "";
		Объект.Поле9 = "";
		Объект.Представление = "";
	
		Возврат;
	КонецЕсли;
	
	Если СтруктураАдреса.Свойство("ЗаПределамиРФ") Тогда			
		Объект.Поле1 = СтруктураАдреса.Страна;
		Объект.Представление = СтруктураАдреса.Представление;		
	Иначе
		Объект.Поле1 = СтруктураАдреса.Индекс;
		Объект.Поле2 = СтруктураАдреса.Регион;
		Объект.Поле3 = СтруктураАдреса.Район;
		Объект.Поле4 = СтруктураАдреса.Город;
		Объект.Поле5 = СтруктураАдреса.НаселенныйПункт;
		Объект.Поле6 = СтруктураАдреса.Улица;
		Объект.Поле7 = СтруктураАдреса.Дом;
		Объект.Поле8 = СтруктураАдреса.Корпус;
		Объект.Поле9 = СтруктураАдреса.Квартира;
		
		// Определяем представление сразу же.
		Объект.Представление = ПолучитьПредставлениеАдреса(Объект);
	КонецЕсли;
  
КонецПроцедуры

// Процедура дополняет представление адреса строкой. 
//
Процедура ДополнитьПредставлениеАдреса(ТекущееПредставление, Дополнение, СтрокаКонкатенации)
	
	Если Дополнение <> "" Тогда
		ТекущееПредставление = ТекущееПредставление + СтрокаКонкатенации + Дополнение;
	КонецЕсли;
  	
КонецПроцедуры

// Функция возвращает строковое представление адреса (в формате через запятую) , включая незаполненные поля.
//
Функция ПолучитьПолныйАдрес(Запись) Экспорт
	
	Результат = "";
	
	Если Запись = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ПолучитьПредставлениеАдреса(Запись) = Запись.Представление Тогда
		Результат = СокрЛП(Запись.Поле10)+"," + 
		СокрЛП(Запись.Поле1) + ", " +
		СокрЛП(Запись.Поле2) + ", " +
		СокрЛП(Запись.Поле3) + ", " +
		СокрЛП(Запись.Поле4) + ", " +
		СокрЛП(Запись.Поле5) + ", " +
		СокрЛП(Запись.Поле6) + ", " +
		СокрЛП(Запись.Поле7) + ", " +
		СокрЛП(Запись.Поле8) + ", " +
		СокрЛП(Запись.Поле9);
		
	Иначе
		Результат = Запись.Представление;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрЗаменить(Результат, ",", "")) Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция выполняет "преобразование" строкового представления адреса в структуру.
//
Функция ПолучитьСтруктуруАдресаИзСтроки(Знач СтроковыйАдрес) Экспорт
	
	Если ПустаяСтрока(СтроковыйАдрес) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧислоВхожденийТочкиВАдрес = СтрЧислоВхождений(СтроковыйАдрес, "|"); 
	// БИТ_ЖКХ изменения кода: 05.06.2012
	// Если ЧислоВхожденийЗапятойВАдрес = 9  Тогда.
	ЧислоВхожденийЗапятойВАдрес = СтрЧислоВхождений(СтроковыйАдрес, ",");
	
	// БИТ_ЖКХ 16.10.2014{{
	// Если ЧислоВхожденийЗапятойВАдрес = 9 ИЛИ ЧислоВхожденийЗапятойВАдрес = 13 Тогда.
	
	// БИТ_ЖКХ 25.11.2016 15:51:02 Начало правки... 
	//Если ЧислоВхожденийТочкиВАдрес = 12 Тогда
	Если ЧислоВхожденийТочкиВАдрес = 12 ИЛИ ЧислоВхожденийТочкиВАдрес = 13 Тогда
	// БИТ_ЖКХ 25.11.2016 15:51:06 Конец правки. 	
		// СтруктураАдреса = РегламентированнаяОтчетность.РазложитьАдрес(СтроковыйАдрес);.
		// СтруктураАдреса = РегламентированнаяОтчетностьКлиентСервер.РазложитьАдрес(СтроковыйАдрес);.
		СтруктураАдреса = РазложитьАдрес(СтроковыйАдрес);
		// БИТ_ЖКХ 16.10.2014}}
		
	ИначеЕсли ЧислоВхожденийЗапятойВАдрес = 9 ИЛИ ЧислоВхожденийЗапятойВАдрес = 13 Тогда

		СтруктураАдреса = РазложитьАдрес(СтроковыйАдрес);

	ИначеЕсли ЧислоВхожденийЗапятойВАдрес >= 1 Тогда
		
		СтруктураАдреса = Новый Структура;	
		СтруктураАдреса.Вставить("ЗаПределамиРФ", Истина);
		СтруктураАдреса.Вставить("Страна", СокрЛП(Лев(СтроковыйАдрес, Найти(СтроковыйАдрес, ",") - 1)));
		СтруктураАдреса.Вставить("Представление", СтроковыйАдрес);			
		
	Иначе
		// Вообще запятых нет в представлении - значит необычный Российский Адрес
		СтруктураАдреса = Новый Структура;	
		СтруктураАдреса.Вставить("ЗаПределамиРФ", Истина);
		
		// БИТ_ЖКХ 12.02.2014{{
		// СтруктураАдреса.Вставить("Страна", Справочники.КлассификаторСтранМира.Россия.Наименование);.
		СтруктураАдреса.Вставить("Страна", Справочники.СтраныМира.Россия.Наименование);
		// БИТ_ЖКХ 12.02.2014}}		
		
		СтруктураАдреса.Вставить("Представление", СтроковыйАдрес);
		
	КонецЕсли;
		
	Возврат СтруктураАдреса;	
	
КонецФункции

Функция РазложитьАдрес(Знач СтрокаАдрес) Экспорт
	
	Страна          = "";
	Индекс          = "";
	Регион          = "";
	Район           = "";
	Город           = "";
	НаселенныйПункт = "";
	Улица           = "";
	Дом             = "";
	Корпус          = "";
	Квартира        = "";
	ТипДома         = "";
	ТипКорпуса      = "";
	ТипКвартиры     = "";
	// БИТ_ЖКХ 25.11.2016 15:50:23 Начало правки...
	Внутриграйон	= "";
	// БИТ_ЖКХ 25.11.2016 15:50:23 Конец правки.

	// БИТ_ЖКХ 17.10.2014{{
	ЧислоВхожденийТочкиВАдрес = СтрЧислоВхождений(СтрокаАдрес, "|"); 
	ЧислоВхожденийЗапятойВАдрес = СтрЧислоВхождений(СтрокаАдрес, ","); 
	
	МассивАдрес	=	РазложитьСтрокуВМассивПодстрок(СтрокаАдрес);
	Если ЧислоВхожденийТочкиВАдрес < ЧислоВхожденийЗапятойВАдрес Тогда
	МассивАдрес	=	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаАдрес);
	
	Иначе
	МассивАдрес	=	РазложитьСтрокуВМассивПодстрок(СтрокаАдрес);
	КонецЕсли;
	// БИТ_ЖКХ 17.10.2014}}
	
	ЭлементовВМассиве = МассивАдрес.Количество();   

	Если ЭлементовВМассиве > 0 Тогда
		Страна = СокрЛП(МассивАдрес[0]);
	КонецЕсли;
	Если ЭлементовВМассиве > 1 Тогда
		Индекс = СокрЛП(МассивАдрес[1]);
	КонецЕсли;
	Если ЭлементовВМассиве > 2 Тогда
		Регион = СокрЛП(МассивАдрес[2]);
	КонецЕсли;
	Если ЭлементовВМассиве > 3 Тогда
		Район = СокрЛП(МассивАдрес[3]);
	КонецЕсли;
	Если ЭлементовВМассиве > 4 Тогда
		Город = СокрЛП(МассивАдрес[4]);
	КонецЕсли;
	Если ЭлементовВМассиве > 5 Тогда
		НаселенныйПункт	= СокрЛП(МассивАдрес[5]);
	КонецЕсли;
	Если ЭлементовВМассиве > 6 Тогда
		Улица = СокрЛП(МассивАдрес[6]);
	КонецЕсли;
	Если ЭлементовВМассиве > 7 Тогда
		Дом = СокрЛП(МассивАдрес[7]);
	КонецЕсли;
	Если ЭлементовВМассиве > 8 Тогда
		Корпус = СокрЛП(МассивАдрес[8]);
	КонецЕсли;
	Если ЭлементовВМассиве > 9 Тогда
		Квартира = СокрЛП(МассивАдрес[9]);
	КонецЕсли;
	Если ЭлементовВМассиве > 10 Тогда
		ТипДома = СокрЛП(МассивАдрес[10]);
	КонецЕсли;
	Если ЭлементовВМассиве > 11 Тогда
		ТипКорпуса = СокрЛП(МассивАдрес[11]);
	КонецЕсли;
	Если ЭлементовВМассиве > 12 Тогда
		ТипКвартиры = СокрЛП(МассивАдрес[12]);
	КонецЕсли;
	
	// БИТ_ЖКХ 25.11.2016 15:41:30 Начало правки...
	Если ЭлементовВМассиве > 13 Тогда
		Внутриграйон = СокрЛП(МассивАдрес[13]);
	КонецЕсли;
	// БИТ_ЖКХ 25.11.2016 15:41:30 Конец правки.
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Страна",          Страна);
	СтруктураВозврата.Вставить("Индекс",          Индекс);
	СтруктураВозврата.Вставить("Регион",          Регион);
	СтруктураВозврата.Вставить("Район",           Район);
	СтруктураВозврата.Вставить("Город",           Город);
	СтруктураВозврата.Вставить("НаселенныйПункт", НаселенныйПункт);
	СтруктураВозврата.Вставить("Улица",           Улица);
	СтруктураВозврата.Вставить("Дом",             Дом);
	СтруктураВозврата.Вставить("Корпус",          Корпус);
	СтруктураВозврата.Вставить("Квартира",        Квартира);
	СтруктураВозврата.Вставить("ТипДома",         ТипДома);
	СтруктураВозврата.Вставить("ТипКорпуса",      ТипКорпуса);
	СтруктураВозврата.Вставить("ТипКвартиры",     ТипКвартиры);
	// БИТ_ЖКХ 25.11.2016 15:42:00 Начало правки... 
	СтруктураВозврата.Вставить("Внутриграйон",    Внутриграйон);
	// БИТ_ЖКХ 25.11.2016 15:42:01 Конец правки. 

	Возврат СтруктураВозврата;
	
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = "|", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Процедура считывает контактную информацию из ИБ в набор записей регистра сведений.
//
// Параметры:
//  НаборЗаписей - набор записей регистра сведений.
//  Ссылка - Объект, по которому необходимо заполнить КИ.
//
Процедура ПрочитатьКонтактнуюИнформацию(НаборЗаписей, Ссылка) Экспорт
	
	Если ТипЗнч(НаборЗаписей) <> Тип("РегистрСведенийНаборЗаписей.бит_КонтактнаяИнформация") Тогда
		НаборЗаписей = РегистрыСведений.бит_КонтактнаяИнформация.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей.Очистить();
	КонецЕсли;
	
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Вид КАК Вид,
	|	ВложенныйЗапрос.Тип КАК Тип,
	|	ВложенныйЗапрос.Объект КАК Объект,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле1) КАК Поле1,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле2) КАК Поле2,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле3) КАК Поле3,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле4) КАК Поле4,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле5) КАК Поле5,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле6) КАК Поле6,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле7) КАК Поле7,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле8) КАК Поле8,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле9) КАК Поле9,
	|	МАКСИМУМ(ВложенныйЗапрос.Поле10) КАК Поле10,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипДома) КАК ТипДома,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипКорпуса) КАК ТипКорпуса,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипКвартиры) КАК ТипКвартиры,
	|	МАКСИМУМ(ВложенныйЗапрос.Представление) КАК Представление,
	|	МАКСИМУМ(ВложенныйЗапрос.Комментарий) КАК Комментарий,
	|	МАКСИМУМ(ВложенныйЗапрос.ЗначениеПоУмолчанию) КАК ЗначениеПоУмолчанию
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Объект КАК Объект,
	|		ВидыКонтактнойИнформации.Тип КАК Тип,
	|		ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|		"""" КАК Представление,
	|		"""" КАК Поле1,
	|		"""" КАК Поле2,
	|		"""" КАК Поле3,
	|		"""" КАК Поле4,
	|		"""" КАК Поле5,
	|		"""" КАК Поле6,
	|		"""" КАК Поле7,
	|		"""" КАК Поле8,
	|		"""" КАК Поле9,
	|		"""" КАК Поле10,
	|		"""" КАК ТипДома,
	|		"""" КАК ТипКорпуса,
	|		"""" КАК ТипКвартиры,
	|		"""" КАК Комментарий,
	|		"""" КАК ЗначениеПоУмолчанию
	|	ИЗ
	|		Справочник.бит_ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|	ГДЕ
	|		(НЕ ВидыКонтактнойИнформации.ПометкаУдаления)
	|		И ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		РегистрСведенийКонтактнаяИнформация.Объект,
	|		РегистрСведенийКонтактнаяИнформация.Тип,
	|		РегистрСведенийКонтактнаяИнформация.Вид,
	|		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Представление КАК СТРОКА(1000)),
	|		РегистрСведенийКонтактнаяИнформация.Поле1,
	|		РегистрСведенийКонтактнаяИнформация.Поле2,
	|		РегистрСведенийКонтактнаяИнформация.Поле3,
	|		РегистрСведенийКонтактнаяИнформация.Поле4,
	|		РегистрСведенийКонтактнаяИнформация.Поле5,
	|		РегистрСведенийКонтактнаяИнформация.Поле6,
	|		РегистрСведенийКонтактнаяИнформация.Поле7,
	|		РегистрСведенийКонтактнаяИнформация.Поле8,
	|		РегистрСведенийКонтактнаяИнформация.Поле9,
	|		РегистрСведенийКонтактнаяИнформация.Поле10,
	|		РегистрСведенийКонтактнаяИнформация.ТипДома,
	|		РегистрСведенийКонтактнаяИнформация.ТипКорпуса,
	|		РегистрСведенийКонтактнаяИнформация.ТипКвартиры,
	|		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Комментарий КАК СТРОКА(1000)),
	|		РегистрСведенийКонтактнаяИнформация.ЗначениеПоУмолчанию
	|	ИЗ
	|		РегистрСведений.бит_КонтактнаяИнформация КАК РегистрСведенийКонтактнаяИнформация
	|	ГДЕ
	|		РегистрСведенийКонтактнаяИнформация.Объект = &Объект) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Вид,
	|	ВложенныйЗапрос.Тип,
	|	ВложенныйЗапрос.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление УБЫВ,
	|	ВложенныйЗапрос.Тип.Порядок,
	|	Вид";
	
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКИ(Ссылка));
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	ТабЗн = Запрос.Выполнить().Выгрузить();
	Для Каждого стр Из ТабЗн Цикл
		стр.Представление = СокрП(стр.Представление);
		стр.Комментарий   = СокрП(стр.Комментарий);
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТабЗн);
	
КонецПроцедуры

// Процедура записывает контактную информацию в ИБ из набора записей регистра сведений.
//
// Параметры:
//  НаборЗаписей - набор записей регистра сведений.
//  Ссылка - Объект, по которому необходимо записать КИ.
//  Отказ - Булево.
//
Процедура ЗаписатьКонтактнуюИнформацию(НаборЗаписей, Ссылка, Отказ, КопияНабораКонтактнойИнформации = Неопределено) Экспорт
	
	Если КопияНабораКонтактнойИнформации = Неопределено Тогда
		ЗаписатьКонтактнуюИнформациюКакНабор(НаборЗаписей, Ссылка, Отказ);
	Иначе
		ЗаписатьКонтактнуюИнформациюСравниваяСКопией(НаборЗаписей, Ссылка, Отказ, КопияНабораКонтактнойИнформации);
	КонецЕсли;
	
КонецПроцедуры

// Процедура записывает контактную информацию в ИБ из набора записей регистра сведений.
//
// Параметры:
//  НаборЗаписей - набор записей регистра сведений
//  Ссылка - Объект, по которому необходимо записать КИ
//  Отказ - Булево
//
Процедура ЗаписатьКонтактнуюИнформациюКакНабор(НаборЗаписей, Ссылка, Отказ)

	Индекс = 0;
	Пока 1 = 1 Цикл
		
		Если Индекс > НаборЗаписей.Количество() - 1 Тогда
			Прервать;
		КонецЕсли;
		
		Запись = НаборЗаписей[Индекс];
		
		Если НЕ ЗначениеЗаполнено(Запись.Представление) Тогда
			НаборЗаписей.Удалить(Запись);
			Продолжить;
		КонецЕсли;
		
		Запись.Объект = Ссылка;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	
	КопияНабора = НаборЗаписей.Выгрузить();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаНабораЗаписей Из КопияНабора Цикл
		НаборЗаписей.Отбор.Вид.Установить(СтрокаНабораЗаписей.Вид);
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаНабораЗаписей);
		
		Попытка
			НаборЗаписей.Записать();
			НаборЗаписей.Очистить();
		Исключение
			бит_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, ("Элемент """ + СокрЛП(Ссылка) + """ не записан. Не записана контактная информация."));
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	ПрочитатьКонтактнуюИнформацию(НаборЗаписей, Ссылка)
		
КонецПроцедуры

// Процедура записывает контактную информацию в ИБ из набора записей регистра сведений.
//
// Параметры:
//  НаборЗаписей - набор записей регистра сведений.
//  Ссылка - Объект, по которому необходимо записать КИ.
//  Отказ - Булево.
//
Процедура ЗаписатьКонтактнуюИнформациюСравниваяСКопией(НаборЗаписей, Ссылка, Отказ, КопияНабораКонтактнойИнформации)
	
	ТабКопия = КопияНабораКонтактнойИнформации.Выгрузить();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Запись.Объект = Ссылка;
		
		Отбор = Новый Структура("Объект,Тип,Вид", Запись.Объект, Запись.Тип, Запись.Вид);
		Строки = ТабКопия.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Отличаются = Не ПустаяСтрока(Запись.Представление);
		Иначе
			Отличаются = Ложь;
			СтрКопия = Строки[0];
			
			Для Каждого Колонка Из ТабКопия.Колонки Цикл
				Если СтрКопия[Колонка.Имя] <> Запись[Колонка.Имя] Тогда
					Отличаются = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не Отличаются Тогда
			Продолжить;
		КонецЕсли;
		
		Набор = РегистрыСведений.бит_КонтактнаяИнформация.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Ссылка);
		Набор.Отбор.Тип.Установить(Запись.Тип);
		Набор.Отбор.Вид.Установить(Запись.Вид);
		
		Если Не ПустаяСтрока(Запись.Представление) Тогда
			новЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(новЗапись, Запись);
		КонецЕсли;
		
		Попытка
			Набор.Записать();
		Исключение
			бит_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, ("Элемент """ + СокрЛП(Ссылка) + """ не записан. Не записана контактная информация."));
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	ПрочитатьКонтактнуюИнформацию(НаборЗаписей, Ссылка);
	
КонецПроцедуры

// Создать копию набора записей контактной информации.
//
Функция СоздатьКопиюНабораЗаписейКонтактнойИнформацииОбъекта(НаборЗаписей) Экспорт
	
	Набор = РегистрыСведений.бит_КонтактнаяИнформация.СоздатьНаборЗаписей();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ЗначениеЗаполнено(Запись.Представление) Тогда
			новЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(новЗапись, Запись);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Набор;
	
КонецФункции

#Если Клиент Тогда

// Процедура выполняется при активизации строки табличного поля, в котором.
// Отображается контактная информация объектов в их формах, и управляет.
// Доступностью кнопки командной панели установки значения по умолчанию.
//
// Параметры:
//  Элемент - ТабличноеПоле.
//  КнопкаУстановитьОсновным - Кнопка командной панели.
//
Процедура КонтактнаяИнформацияПриАктивизацииСтрокиТаблицы(Элемент, КнопкаУстановитьОсновным) Экспорт

	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущиеДанные.ЗначениеПоУмолчанию Тогда
			КнопкаУстановитьОсновным.Пометка     = Истина;
			КнопкаУстановитьОсновным.Доступность = Истина;
		ИначеЕсли НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Представление) Тогда
			КнопкаУстановитьОсновным.Пометка     = Ложь;
			КнопкаУстановитьОсновным.Доступность = Ложь;
		Иначе
			КнопкаУстановитьОсновным.Пометка     = Ложь;
			КнопкаУстановитьОсновным.Доступность = Истина;
		КонецЕсли; 
	Иначе
		КнопкаУстановитьОсновным.Пометка     = Ложь;
		КнопкаУстановитьОсновным.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура выполняется при выводе строки табличного поля, в котором.
// Отображается контактная информация объектов в их формах.
//
// Параметры:
//  Элемент - ТабличноеПоле.
//  ОформлениеСтроки - Оформление строки табличного поля.
//  ДанныеСтроки - данные строки табличного поля.
//
Процедура КонтактнаяИнформацияСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки.ЗначениеПоУмолчанию Тогда
		ОформлениеСтроки.Шрифт = Новый Шрифт(,, Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Представление) Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Серый;
	ИначеЕсли ТипЗнч(ДанныеСтроки.Вид) = Тип("Строка") Тогда
		ОформлениеСтроки.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	КонецЕсли;
	
	Если Элемент.Колонки.Картинка.Видимость Тогда
		ОформлениеСтроки.Ячейки.Картинка.ОтображатьКартинку = Истина;
		Если ДанныеСтроки.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес Тогда
			Если ПолучитьПредставлениеАдреса(ДанныеСтроки) = ДанныеСтроки.Представление Тогда
				// Формат МНС.
				Если ЗначениеЗаполнено(ДанныеСтроки.Представление) Тогда
					ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 2;
				Иначе
					ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 8;
				КонецЕсли; 
			Иначе
				Если ЗначениеЗаполнено(ДанныеСтроки.Представление) Тогда
					ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 1;
				Иначе
					ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 7;
				КонецЕсли; 
			КонецЕсли; 
		ИначеЕсли ДанныеСтроки.Тип = Перечисления.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Если ЗначениеЗаполнено(ДанныеСтроки.Представление) Тогда
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 3;
			Иначе
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 9;
			КонецЕсли; 
		ИначеЕсли ДанныеСтроки.Тип = Перечисления.бит_ТипыКонтактнойИнформации.ВебСтраница Тогда
			Если ЗначениеЗаполнено(ДанныеСтроки.Представление) Тогда
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 4;
			Иначе
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 10;
			КонецЕсли; 
		ИначеЕсли ДанныеСтроки.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Другое Тогда
			Если ЗначениеЗаполнено(ДанныеСтроки.Представление) Тогда
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 5;
			Иначе
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 11;
			КонецЕсли; 
		ИначеЕсли ДанныеСтроки.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Телефон Тогда
			Если ЗначениеЗаполнено(ДанныеСтроки.Представление) Тогда
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 0;
			Иначе
				ОформлениеСтроки.Ячейки.Картинка.ИндексКартинки = 6;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает запись контактной информации определенного типа и вида основной.
// Для объекта в пространстве одного типа.
//
// Параметры:
//  СтруктураПараметров - структура, параметры записи, для которой надо установить признак основной.
//   Ключи:
//    Объект, СправочникСсылка, значение измерения Объект регистра сведений.
//    Тип, ПеречислениеСсылка.бит_ТипыКонтактнойИнформации.
//    Вид, СправочникСсылка.ВидыКонтактнойИнформации.
//
Процедура УстановитьЗаписьОсновной(НаборЗаписей, ТабличноеПоле, Кнопка) Экспорт

	Если ТабличноеПоле.ТекущиеДанные <> Неопределено
	   И ЗначениеЗаполнено(ТабличноеПоле.ТекущиеДанные.Представление) Тогда
	
		Если ТабличноеПоле.ТекущиеДанные.ЗначениеПоУмолчанию Тогда
		
			ТабличноеПоле.ТекущиеДанные.ЗначениеПоУмолчанию = Ложь;
			Кнопка.Пометка = Ложь;
			
		Иначе
			
			Для каждого ЗаписьНабора Из НаборЗаписей Цикл
				Если ЗаписьНабора.Тип = ТабличноеПоле.ТекущиеДанные.Тип Тогда
					ЗаписьНабора.ЗначениеПоУмолчанию = Ложь;
				КонецЕсли; 
			КонецЦикла;
			
			ТабличноеПоле.ТекущиеДанные.ЗначениеПоУмолчанию = Истина;
			Кнопка.Пометка = Истина;
		
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

// Обраьботчик события "ПередУдалением" табличного поля набора записей.
//
// Параметры:
//  Элемент - Табличное поле.
//  Отказ - Булево.
//
Процедура УдалитьЗаписьКонтактнойИнформации(Элемент, Отказ) Экспорт

	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные <> Неопределено И (ЗначениеЗаполнено(Элемент.ТекущиеДанные.Представление) ИЛИ ТипЗнч(Элемент.ТекущиеДанные.Вид) = Тип("Строка")) Тогда
	
		ОтветНаВопрос = Неопределено;
	
		ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьЗаписьКонтактнойИнформацииЗавершение", бит_УправлениеКонтактнойИнформацией, Новый Структура("Элемент", Элемент)), "Удалить запись?", РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьЗаписьКонтактнойИнформацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Элемент = ДополнительныеПараметры.Элемент;
    
    ОтветНаВопрос = РезультатВопроса;
    Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
    Если ТипЗнч(Элемент.ТекущиеДанные.Вид) = Тип("Строка") Тогда
        Элемент.Значение.Удалить(Элемент.ТекущиеДанные);
    Иначе
        Элемент.ТекущиеДанные.Представление       = "";
        Элемент.ТекущиеДанные.ЗначениеПоУмолчанию = Ложь;
    КонецЕсли;

КонецПроцедуры

// Функция формирует структуру записи регистра.
//
// Параметры:
//  Запись - запись набора записей регистра сведений.
//
Функция ПолучитьСтруктуруЗаписиРегистра(Запись) Экспорт

	Если ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.бит_КонтактнаяИнформация")
	 ИЛИ ТипЗнч(Запись) = Тип("РегистрСведенийМенеджерЗаписи.бит_КонтактнаяИнформация") Тогда
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("Объект"       , Запись.Объект);
		СтруктураЗаписи.Вставить("Тип"          , Запись.Тип);
		СтруктураЗаписи.Вставить("Вид"          , Запись.Вид);
		СтруктураЗаписи.Вставить("Представление", Запись.Представление);
		СтруктураЗаписи.Вставить("Комментарий"  , Запись.Комментарий);
		Для Значение = 1 По 10 Цикл
			СтруктураЗаписи.Вставить("Поле" + Строка(Значение), Запись["Поле" + Строка(Значение)]);
		КонецЦикла;
		
		СтруктураЗаписи.Вставить("ТипДома"  ,     Запись.ТипДома);
		СтруктураЗаписи.Вставить("ТипКорпуса"  ,  Запись.ТипКорпуса);
		СтруктураЗаписи.Вставить("ТипКвартиры"  , Запись.ТипКвартиры);

		Возврат СтруктураЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 

КонецФункции

// Процедура контролирует возможность редактирования текста в поле ввода представления КИ.
//
Процедура УстановитьВозможностьРедактированияТекстаКИ(Элемент) Экспорт

	Если Элемент.ТекущиеДанные.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес
	   И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Представление)
	   И (ПолучитьПредставлениеАдреса(Элемент.ТекущиеДанные) = Элемент.ТекущиеДанные.Представление) Тогда
		Элемент.Колонки.Представление.ЭлементУправления.РедактированиеТекста = Ложь;
	Иначе
		Элемент.Колонки.Представление.ЭлементУправления.РедактированиеТекста = Истина;
	КонецЕсли; 

КонецПроцедуры

// Обработчик события "ПриНачалеРедактирования" табличного поля набора записей регистра сведений.
//
Процедура КонтактнаяИнформацияПриНачалеРедактированияОбщая(Элемент, НоваяСтрока, ПоследнееЗначениеЭлементаТайпингаВидаКИ) Экспорт

	Если НоваяСтрока Тогда
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Тип) Тогда
			Элемент.ТекущиеДанные.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Вид) Тогда
			Элемент.ТекущиеДанные.Вид = Справочники.бит_ВидыКонтактнойИнформации.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли; 
	
	ПоследнееЗначениеЭлементаТайпингаВидаКИ = Элемент.ТекущиеДанные.Вид;
	
КонецПроцедуры

// Обработчик события "ПередОкончаниемРедактирования" табличного поля набора записей регистра сведений.
//
Процедура КонтактнаяИнформацияПередОкончаниемРедактированияОбщая(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, мТекстТайпингаВидаКИ, мОбработкаТайпингаВидаКИ) Экспорт
	
	Если мОбработкаТайпингаВидаКИ И НЕ НоваяСтрока Тогда
		мОбработкаТайпингаВидаКИ = Ложь;
		Отказ = Истина;
		Элемент.ТекущаяКолонка = Элемент.Колонки.Вид;
		Элемент.Колонки.Вид.ЭлементУправления.ВыделенныйТекст = мТекстТайпингаВидаКИ;
		мТекстТайпингаВидаКИ = "";
	ИначеЕсли Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Вид) Тогда
		Отказ = Истина;
		Элемент.ТекущаяКолонка = Элемент.Колонки.Вид;
		бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен вид");
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "ПриИзменении" представления КИ табличного поля набора записей регистра сведений.
//
Процедура КонтактнаяИнформацияПредставлениеПриИзмененииОбщая(Элемент, ТабличноеПоле) Экспорт

	Если ТабличноеПоле.ТекущиеДанные.Тип = Перечисления.бит_ТипыКонтактнойИнформации.Телефон Тогда
		
		СтруктураПолей = РазложитьТелефонПоПолям(Элемент.Значение);
		ТабличноеПоле.ТекущиеДанные.Поле3 = СтруктураПолей.СамТелефон;
		ТабличноеПоле.ТекущиеДанные.Поле1 = СтруктураПолей.КодСтраны;
		ТабличноеПоле.ТекущиеДанные.Поле2 = СтруктураПолей.КодГорода;
		
		СформироватьПредставлениеТелефона(ТабличноеПоле.ТекущиеДанные);
		
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "ПриИзменении" Типа КИ табличного поля набора записей регистра сведений.
//
Процедура КонтактнаяИнформацияТипПриИзмененииОбщее(Элемент, ТабличноеПоле) Экспорт

	Если ТабличноеПоле.ТекущиеДанные <> Неопределено
	   И ЗначениеЗаполнено(ТабличноеПоле.ТекущиеДанные.Вид)
	   И ТипЗнч(ТабличноеПоле.ТекущиеДанные.Вид) = Тип("СправочникСсылка.бит_ВидыКонтактнойИнформации")
	   И ТабличноеПоле.ТекущиеДанные.Вид.Тип <> Элемент.Значение Тогда
	
		ТабличноеПоле.ТекущиеДанные.Вид = Справочники.бит_ВидыКонтактнойИнформации.ПустаяСсылка();
	
	КонецЕсли; 

КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция проверяет строку на наличие значимых символов.
//
// Параметры:
//  ВыбСтрока  – строка для проверки.
// Возвращаемое значение:
//   Строка - пробел или пустое значение строки.
//
Функция ПроверкаПустойСтроки(ВыбСтрока, ПризнакЗапятой=Истина)
	
	Если ПустаяСтрока(ВыбСтрока) Тогда
		Возврат "";
	Иначе
		Возврат ?(ПризнакЗапятой,",","")+" ";
	КонецЕсли; 
	
КонецФункции // ПроверкаПустойСтроки()

// Функция возвращает представление адреса собранного из полей значений Поле1 - Поле10.
//
// Параметры:
//  НЕТ.
//
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьПредставлениеАдреса(Запись) Экспорт

	ТекПредставление = "";

	Если СокрЛП(Запись.Поле10) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(Запись.Поле10);
	КонецЕсли;
	
	Если СокрЛП(Запись.Поле1) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(Запись.Поле1);
	КонецЕсли;

	Если СокрЛП(Запись.Поле2) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(Запись.Поле2);
	КонецЕсли;

	Если СокрЛП(Запись.Поле3) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(Запись.Поле3);
	КонецЕсли;

	Если СокрЛП(Запись.Поле4) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(Запись.Поле4);
	КонецЕсли;

	Если СокрЛП(Запись.Поле5) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(Запись.Поле5);
	КонецЕсли;

	Если СокрЛП(Запись.Поле6) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(Запись.Поле6);
	КонецЕсли;
	
	ТипДома = Неопределено;
	ТипКорпуса = Неопределено;
	ТипКвартиры = Неопределено;
	Если ТипЗнч(Запись) = Тип("Структура") Тогда
		Запись.Свойство("ТипДома",     ТипДома);
		Запись.Свойство("ТипКорпуса",  ТипКорпуса);
		Запись.Свойство("ТипКвартиры", ТипКвартиры);
	Иначе
		ТипДома     = Запись.ТипДома;
		ТипКорпуса  = Запись.ТипКорпуса;
		ТипКвартиры = Запись.ТипКвартиры;
	КонецЕсли;
	
	Если СокрЛП(Запись.Поле7) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + ?(ЗначениеЗаполнено(ТипДома), ТипДома, "дом") + " № " + СокрЛП(Запись.Поле7);
	КонецЕсли;

	Если СокрЛП(Запись.Поле8) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + ?(ЗначениеЗаполнено(ТипКорпуса), ТипКорпуса, "корпус") + " " + СокрЛП(Запись.Поле8);
	КонецЕсли;

	Если СокрЛП(Запись.Поле9) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + ?(ЗначениеЗаполнено(ТипКвартиры), ТипКвартиры, "кв.") + СокрЛП(Запись.Поле9);
	КонецЕсли;

	Если СтрДлина(ТекПредставление) > 2 Тогда
		ТекПредставление = Сред(ТекПредставление, 3);
	КонецЕсли;
	
	Возврат ТекПредставление;

КонецФункции

// Функция по структуре с адресом возвращает его представление.
Функция ПолучитьПредставлениеАдресаПоСтруктуре(СтруктураАдреса) Экспорт
	
	ТекПредставление = "";
	
	Если СтруктураАдреса = Неопределено Тогда
		Возврат ТекПредставление;
	КонецЕсли;
	
	АдресЗаПределамиРФ = Неопределено;
	СтруктураАдреса.Свойство("ЗаПределамиРФ", АдресЗаПределамиРФ);
	Если АдресЗаПределамиРФ = Неопределено Тогда
		АдресЗаПределамиРФ = Ложь;
	КонецЕсли;
	
	Если Не АдресЗаПределамиРФ Тогда
		
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Страна), ", ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Индекс), ", ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Регион), ", ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Район), ", ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Город), ", ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.НаселенныйПункт), ", ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Улица), ", ");
		
		ТипДома = Неопределено;
		ТипКорпуса = Неопределено;
		ТипКвартиры = Неопределено;
		СтруктураАдреса.Свойство("ТипДома", ТипДома);
		СтруктураАдреса.Свойство("ТипКорпуса", ТипКорпуса);
		СтруктураАдреса.Свойство("ТипКвартиры", ТипКвартиры);
		
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Дом), ", "      + ?(ЗначениеЗаполнено(ТипДома),     ТипДома,     "дом") + " № ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Корпус), ", "   + ?(ЗначениеЗаполнено(ТипКорпуса),  ТипКорпуса,  "корпус") + " ");
		ДополнитьПредставлениеАдреса(ТекПредставление, СокрЛП(СтруктураАдреса.Квартира), ", " + ?(ЗначениеЗаполнено(ТипКвартиры), ТипКвартиры, "кв."));
		
		Если СтрДлина(ТекПредставление) > 2 Тогда
			ТекПредставление = Сред(ТекПредставление, 3);
		КонецЕсли;
	
	Иначе
		
		ТекПредставление = СтруктураАдреса.Представление;
	
	КонецЕсли;
	
	Возврат ТекПредставление;
	
КонецФункции

// Функция по строке адреса (разделенная через запятую) возвращает его представление.
Функция ПолучитьПредставлениеАдресаПоСтрока(СтрокаАдреса) Экспорт
	
	СтруктураАдреса = ПолучитьСтруктуруАдресаИзСтроки(СтрокаАдреса);
	ПредставлениеАдреса = ПолучитьПредставлениеАдресаПоСтруктуре(СтруктураАдреса);
	Возврат ПредставлениеАдреса
	
КонецФункции

// Процедура формирует строковое представление адреса.
Процедура СформироватьПредставлениеТелефона(НаборПолей) Экспорт

	НаборПолей.Представление = НаборПолей.Поле1;
	НаборПолей.Представление = НаборПолей.Представление + ?((Не ПустаяСтрока(НаборПолей.Поле2)),(ПроверкаПустойСтроки(НаборПолей.Представление, Ложь)+"(" + НаборПолей.Поле2 + ")"),"");
	НаборПолей.Представление = НаборПолей.Представление + ?((Не ПустаяСтрока(НаборПолей.Поле3)),(ПроверкаПустойСтроки(НаборПолей.Представление, ПустаяСтрока(НаборПолей.Поле2)) + ПривестиНомерТелефонаКШаблону(НаборПолей.Поле3)),"");
	Если НЕ ПустаяСтрока(НаборПолей.Представление) Тогда
		НаборПолей.Представление = НаборПолей.Представление + ?((Не ПустаяСтрока(НаборПолей.Поле4)),(ПроверкаПустойСтроки(НаборПолей.Представление) + "доб. " + ПривестиНомерТелефонаКШаблону(НаборПолей.Поле4)),"");
	Иначе
		НаборПолей.Представление = ПривестиНомерТелефонаКШаблону(НаборПолей.Поле4);
	КонецЕсли; 

КонецПроцедуры // СформироватьПредставление()

#КонецОбласти

#Область ПроцедурыИФункцииМеханизмаХраниенияКИ

// Процедура переносит строку из таблицы в Структуру.
Процедура ПеренестиСтрокуТаблицыВСтруктуру(Таблица, СтрокаТаблицы, СтруктураЭлемента)Экспорт 
	
	Если СтруктураЭлемента = Неопределено 
		ИЛИ СтрокаТаблицы = Неопределено 
		ИЛИ Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЭлемента.Очистить();
	Для Каждого Колонка Из Таблица.Колонки Цикл
		СтруктураЭлемента.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
	КонецЦикла;
	
КонецПроцедуры

// Процедура переносит строку из запроса в Структуру.
Процедура ПеренестиСтрокуВыборкиВСтруктуру(РезультатЗапроса, СтрокаВыборки, СтруктураЭлемента)Экспорт 
	
	Если СтруктураЭлемента = Неопределено 
		ИЛИ РезультатЗапроса = Неопределено 
		ИЛИ СтрокаВыборки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЭлемента.Очистить();
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураЭлемента.Вставить(Колонка.Имя, СтрокаВыборки[Колонка.Имя]);
	КонецЦикла;
	
КонецПроцедуры // ПеренестиСтрокуВыборкиВСтруктуру()

// Функция возвращает пустое значение определенного типа,  в соответствии с видом объекта контактной информации
//
// Параметры:
//  ВидОбъектаКонтактнойИнформации - ПеречислениеСсылка.бит_ВидыОбъектовКонтактнойИнформации.
//
// Возвращаемое значение:
//   СправочникСсылка (пустая) или Неопределено
//
Функция ПолучитьПустоеЗначениеОбъектаКонтактнойИнформации(ВидОбъектаКонтактнойИнформации) Экспорт

	Если ВидОбъектаКонтактнойИнформации = Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие Тогда
		Возврат Справочники.бит_Проживающие.ПустаяСсылка();
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.бит_ВидыОбъектовКонтактнойИнформации.СписокЗданий Тогда
		Возврат Справочники.бит_СписокЗданий.ПустаяСсылка();
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.бит_ВидыОбъектовКонтактнойИнформации.ПодразделенияОрганизации Тогда
		Возврат Справочники.бит_ПодразделенияОрганизаций.ПустаяСсылка();
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьПустоеЗначениеОбъектаКонтактнойИнформации()

// Функция определяет вид объекта контактной информации
//
// Параметры:
//  ОбъектСсылка - Ссылка на объект контактной информации.
// Возвращаемые значения:
//  Возвращается ссылка на перечисление бит_ВидыОбъектовКонтактнойИнформации, соответствующее параметру ОбъектСсылка.
Функция ВидОбъектаКИ(ОбъектСсылка) Экспорт

	Если ОбъектСсылка = Неопределено Тогда
		Возврат Перечисления.бит_ВидыОбъектовКонтактнойИнформации.ПустаяСсылка();
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		Возврат Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Проживающие;
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
		Возврат Перечисления.бит_ВидыОбъектовКонтактнойИнформации.СписокЗданий;
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.бит_ПодразделенияОрганизаций") Тогда
		Возврат Перечисления.бит_ВидыОбъектовКонтактнойИнформации.ПодразделенияОрганизации;
		
	// БИТ_ЖКХ 10.09.2014{{	
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.бит_ОрганыФМС") Тогда
		Возврат Перечисления.бит_ВидыОбъектовКонтактнойИнформации.ОрганыФМС;
	// БИТ_ЖКХ 10.09.2014}}
	
	Иначе
		Возврат Перечисления.бит_ВидыОбъектовКонтактнойИнформации.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции // ВидОбъектаКИ()

// Функция вызывается при начале выбора объекта контактной информации.
//
// Параметры:
//  ФормаЗаписи - форма записи регистра сведений КонтактнаяИнформация.
//  Элемент - элемент формы записи регистра сведений КонтактнаяИнформация, значение которого выбирается.
//
// Возвращаемое значение:
//   Булево - продолжить стандартную операцию выбора или нет.
//
Функция НачалоВыбораОбъектаКИ(ФормаЗаписи, Элемент, ТекущийПользователь) Экспорт

	Если Элемент.Значение <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли; 
	
	СписокТиповОбъектов = Новый СписокЗначений;

	МассивТипов = ?(Элемент.ОграничениеТипа.Типы().Количество()>0, Элемент.ОграничениеТипа.Типы(), Элемент.ТипЗначения.Типы());
	Для каждого Тип Из МассивТипов Цикл
		НовыйТип = Новый(Тип);
		СписокТиповОбъектов.Добавить(НовыйТип.Ссылка.Метаданные().Имя, НовыйТип.Ссылка.Метаданные().Синоним);
	КонецЦикла;

	Если СписокТиповОбъектов.Количество() = 1 Тогда
		ВыбранноеЗначениеСписка = СписокТиповОбъектов[0];
	Иначе
		ВыбранноеЗначениеСписка = ФормаЗаписи.ВыбратьИзСписка(СписокТиповОбъектов, Элемент);
	КонецЕсли;
	
	Если ВыбранноеЗначениеСписка = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Элемент.Значение = Справочники[ВыбранноеЗначениеСписка.Значение].ПустаяСсылка();
		Возврат Истина;
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииМеханизмаРаботыСАдреснымКлассификатором

// Функция по полному наименованию адресного элемента выдает отдельно его имя, и отдельно его адресное сокращение.
Функция ПолучитьИмяИАдресноеСокращение(Знач СтрокаЭлемента, АдресноеСокращение) Экспорт

   	Буфер = СокрП(СтрокаЭлемента);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		Возврат СтрокаЭлемента;
	КонецЕсли;

	Пока  СтрЧислоВхождений(Буфер, " ") > 1 Цикл
		Буфер = Лев(Буфер, ПозицияПослПробела - 1) + "_" + Сред(Буфер, ПозицияПослПробела + 1);
		ПозицияПослПробела = Найти(Буфер, " ");
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сокращение", Сред(СтрокаЭлемента, ПозицияПослПробела + 1));
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АдресныеСокращения.Ссылка
	|ИЗ
	|	Справочник.АдресныеСокращения КАК АдресныеСокращения
	|
	|ГДЕ
	|	АдресныеСокращения.Сокращение = &Сокращение";

	Выборка = Запрос.Выполнить().Выбрать();
	АдресноеСокращение = "";

	Если Выборка.Следующий() Тогда
		Если ПустаяСтрока(СокрЛП(Лев(СтрокаЭлемента, ПозицияПослПробела - 1))) Тогда
			Возврат СтрокаЭлемента;
		Иначе
			АдресноеСокращение = Сред(СтрокаЭлемента, ПозицияПослПробела + 1);
			Возврат Лев(СтрокаЭлемента, ПозицияПослПробела - 1);
		КонецЕсли;
	Иначе
		Возврат СтрокаЭлемента;
	КонецЕсли;
  	
КонецФункции

// Функция определяет является ли последнее слово в строке допустимым. 
//  Сокращением, и если является, то обрезает его из строки.
//
// Параметры:
//  СтрокаЭлемента - Строка в которой необходимо обрезать сокращение.
// Возвращаемые значения:
//  Обрезанную строку в случае, если есть сокращение и полученную строку в обратном случае.
Функция ОбрезатьСокращение(Знач СтрокаЭлемента) Экспорт

	Буфер = СокрП(СтрокаЭлемента);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		Возврат СтрокаЭлемента;
	КонецЕсли;

	Пока  СтрЧислоВхождений(Буфер, " ") > 1 Цикл
		Буфер = Лев(Буфер, ПозицияПослПробела - 1) + "_" + Сред(Буфер, ПозицияПослПробела + 1);
		ПозицияПослПробела = Найти(Буфер, " ");
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сокращение", Сред(СтрокаЭлемента, ПозицияПослПробела + 1));
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АдресныеСокращения.Ссылка
	|ИЗ
	|	Справочник.АдресныеСокращения КАК АдресныеСокращения
	|
	|ГДЕ
	|	АдресныеСокращения.Сокращение = &Сокращение";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Если ПустаяСтрока(СокрЛП(Лев(СтрокаЭлемента, ПозицияПослПробела - 1))) Тогда
			Возврат СтрокаЭлемента;
		Иначе
			Возврат Лев(СтрокаЭлемента, ПозицияПослПробела - 1);
		КонецЕсли;
	Иначе
		Возврат СтрокаЭлемента;
	КонецЕсли;

КонецФункции

// Функция по для переданной строки определят необходимость дополнить её сокращением.
//
// Параметры:
//  Название - Строка .для которой определяется необходимость дополнения сокращением.
//  Уровень - уровень, для которого необходимо составить список сокращений.
// Возвращаемые значения:
//  Возвращается Неопределено, если строку дополнять не нужно или список. 
// Значений с сокращениями в обратном случае.
Функция ПолучитьСписокСокращений(Знач Название, Уровень) Экспорт

	Название = СокрЛП(Название);

	Если ПустаяСтрока(Название) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ОбрезатьСокращение(Название) <> Название Тогда // Было что обрезать.
		Возврат Неопределено; // Для строки не требуется дополнение сокращением.
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Уровень", Уровень);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АдресныеСокращения.Ссылка
	|ИЗ
	|	Справочник.АдресныеСокращения КАК АдресныеСокращения
	|
	|ГДЕ
	|	АдресныеСокращения.Уровень = &Уровень";

	Выборка = Запрос.Выполнить().Выбрать();

	СписокСокращений = Новый СписокЗначений();

	Пока Выборка.Следующий() Цикл
		СписокСокращений.Добавить(Выборка.Ссылка.Сокращение);
	КонецЦикла;

	Если СписокСокращений.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат СписокСокращений;
	КонецЕсли;

КонецФункции

// Функция формирует строку с названием адресного элемента,.
// Которое состоит из наименования и сокращения.
//
// Параметры:
//  АдресныйЭлемент - элемент справочника Адресный классификатор.
//
// Возвращаемое значение:
//  Название адресного элемента.
//
Функция ПолучитьНазвание(АдресныйЭлемент) Экспорт

	Если АдресныйЭлемент.Код = 0 Тогда
		Возврат "";
	Иначе
		Возврат СокрЛП(АдресныйЭлемент.Наименование) + " " + СокрЛП(АдресныйЭлемент.Сокращение)
	КонецЕсли;

КонецФункции

// Процедура раскладывает код адресного элемента на составляющие:.
// Код Региона, код района, код города, код населенного пункта, код улицы и код дома.
Процедура РазложитьКодАдресногоЭлементаНаСоставляющие(Знач Код, КодРегиона, КодРайона, КодГорода, КодНаселенногоПункта, КодУлицы, КодДома)
	
	КодЭлемента = Код;
	
	КодРегиона = Цел(КодЭлемента / МаскаРегиона());
	КодЭлемента = КодЭлемента % МаскаРегиона();

	КодРайона = Цел(КодЭлемента / МаскаРайона());
	КодЭлемента = КодЭлемента % МаскаРайона();

	КодГорода = Цел(КодЭлемента / МаскаГорода());
	КодЭлемента = КодЭлемента % МаскаГорода();

	КодНаселенногоПункта = Цел(КодЭлемента / МаскаНасПункта());
	КодЭлемента = КодЭлемента % МаскаНасПункта();

	КодУлицы = Цел(КодЭлемента / МаскаУлицы());
	КодЭлемента = КодЭлемента % МаскаУлицы();

	КодДома = Цел(КодЭлемента / МаскаДома());

КонецПроцедуры // РазложитьКодАдресногоЭлементаНаСоставляющие()

// Функция формирует строку с полным названием адресного элемента,.
// Которое состоит из наименования и сокращения самого адресного.
// Элемента и его "родителей".
//
// Параметры:
//  КодЭлемента - Код адресного элемента.
//
// Возвращаемое значение:
//  Название адресного элемента и его родителей через запятую.
//
Функция ПолучитьПолноеНазвание(Знач КодЭлемента, НачальныйУровеньДетализации = 1, КонечныйУровеньДетализации = 6) Экспорт
	
	Перем КодРегиона, КодРайона, КодГорода, КодНаселенногоПункта, КодУлицы, КодДома;

	РазложитьКодАдресногоЭлементаНаСоставляющие(КодЭлемента, КодРегиона, КодРайона, КодГорода, КодНаселенногоПункта, КодУлицы, КодДома);
	
	Название = "";
	НовыйКод = 0;

	Если (КодРегиона > 0) Тогда
		НовыйКод = КодРегиона * МаскаРегиона();
		Если (1 >= НачальныйУровеньДетализации) и (КонечныйУровеньДетализации >= 1) Тогда
			Название = Название + ", " + ПолучитьНазвание(ПолучитьСтруктуруАдресногоЭлемента(НовыйКод));
		КонецЕсли;
	КонецЕсли;

	Если (КодРайона > 0) Тогда
		НовыйКод = НовыйКод + КодРайона * МаскаРайона();
		Если (2 >= НачальныйУровеньДетализации) и (КонечныйУровеньДетализации >= 2) Тогда
			Название = Название + ", " + ПолучитьНазвание(ПолучитьСтруктуруАдресногоЭлемента(НовыйКод));
		КонецЕсли;
	КонецЕсли;

	Если (КодГорода > 0) Тогда
		НовыйКод = НовыйКод + КодГорода * МаскаГорода();
		Если (3 >= НачальныйУровеньДетализации) и (КонечныйУровеньДетализации >= 3) Тогда
			Название = Название + ", " + ПолучитьНазвание(ПолучитьСтруктуруАдресногоЭлемента(НовыйКод));
		КонецЕсли;
	КонецЕсли;

	Если (КодНаселенногоПункта > 0) Тогда
		НовыйКод = НовыйКод + КодНаселенногоПункта * МаскаНасПункта();
		Если (4 >= НачальныйУровеньДетализации) и (КонечныйУровеньДетализации >= 4) Тогда
			Название = Название + ", " + ПолучитьНазвание(ПолучитьСтруктуруАдресногоЭлемента(НовыйКод));
		КонецЕсли;
	КонецЕсли;

	Если (КодУлицы > 0) Тогда
		НовыйКод = НовыйКод + КодУлицы * МаскаУлицы();
		Если (5 >= НачальныйУровеньДетализации) и (КонечныйУровеньДетализации >= 5) Тогда
			Название = Название + ", " + ПолучитьНазвание(ПолучитьСтруктуруАдресногоЭлемента(НовыйКод));
		КонецЕсли;
	КонецЕсли;

	Если (КодДома > 0) Тогда
		НовыйКод = НовыйКод + КодДома * МаскаДома();
		Если (6 >= НачальныйУровеньДетализации) и (КонечныйУровеньДетализации >= 6) Тогда
			Название = Название + ", " + ПолучитьНазвание(ПолучитьСтруктуруАдресногоЭлемента(НовыйКод));
		КонецЕсли;
	КонецЕсли;

	Если СтрДлина(Название) > 2 Тогда
		Название = Сред(Название, 3);
	КонецЕсли;

	Возврат Название;

КонецФункции // ПолучитьПолноеНазвание()

// Функция ставит в соответствие типу адресного элемента маску,.
// Через которую выделяется его значимый код.
//
// Параметры:
//  ТипАдресногоЭлемента -  число - тип адресного элемента.
//
// Возвращаемое значение:
// Число - маска, при делении на которую выделяется значимый код адресного элемента.
//
Функция ПолучитьМаскуПоТипу(ТипАдресногоЭлемента) Экспорт

	Если ТипАдресногоЭлемента = 1 Тогда
		Возврат МаскаРегиона();

	ИначеЕсли ТипАдресногоЭлемента = 2 Тогда
		Возврат МаскаРайона();

	ИначеЕсли ТипАдресногоЭлемента = 3 Тогда
		Возврат МаскаГорода();

	ИначеЕсли ТипАдресногоЭлемента = 4 Тогда
		Возврат МаскаНасПункта();

	ИначеЕсли ТипАдресногоЭлемента = 5 Тогда
		Возврат МаскаУлицы();

	ИначеЕсли ТипАдресногоЭлемента = 6 Тогда
		Возврат МаскаДома();

	Иначе
		Возврат МаскаКвартиры();

	КонецЕсли;

КонецФункции

// Функция ставит в соответствие типу адресного элемента маску,.
// Через которую выделяется его значимый код.
//
// Параметры:
//  ТипАдресногоЭлемента -  число - тип адресного элемента.
//
// Возвращаемое значение:
// Число - маска, при делении на которую выделяется значимый код адресного элемента.
//
Функция ПолучитьТипАдресногоЭлемента(КодЭлемента) Экспорт
	
	Если КодЭлемента = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если КодЭлемента % МаскаРегиона() < 100  Тогда // Регион 21 ноль и АА.
		Возврат 1;
		
	ИначеЕсли КодЭлемента % МаскаРайона() < 100 Тогда // Район 18 ноль и АА.
		Возврат 2;
		
	ИначеЕсли КодЭлемента % МаскаГорода() < 100 Тогда // Город 15 ноль и АА.
		Возврат 3;
		
	ИначеЕсли КодЭлемента % МаскаНасПункта() < 100 Тогда // Населнный пункт 12 ноль и АА.
		Возврат 4;
		
	ИначеЕсли КодЭлемента % МаскаУлицы() < 100 Тогда // Улица 8 ноль и АА.
		Возврат 5;
		
	ИначеЕсли КодЭлемента % МаскаДома() < 100 Тогда // Дом 4 ноль и АА.
		Возврат 6;
		
	Иначе // Квартира.
		Возврат 7;
		
	КонецЕсли;
	
КонецФункции

// Функция ставит в соответствие типу адресного элемента маску,.
// Через которую выделяется его значимый код.
//
// Параметры:
//  ТипАдресногоЭлемента -  число - тип адресного элемента.
//
// Возвращаемое значение:
// Число - маска, при делении на которую выделяется значимый код адресного элемента.
//
Функция ПолучитьСтруктуруАдресногоЭлемента(КодЭлемента) Экспорт
	
	КодРазбора = КодЭлемента;
	ТипАдресногоЭлемента = ПолучитьТипАдресногоЭлемента(КодРазбора);
	
	КодРегиона = Цел(КодРазбора / МаскаРегиона());
	КодРазбора = КодРазбора % МаскаРегиона();

	КодРайона = Цел(КодРазбора / МаскаРайона());
	КодРазбора = КодРазбора % МаскаРайона();

	КодГорода = Цел(КодРазбора / МаскаГорода());
	КодРазбора = КодРазбора % МаскаГорода();

	КодНаселенногоПункта = Цел(КодРазбора / МаскаНасПункта());
	КодРазбора = КодРазбора % МаскаНасПункта();

	КодУлицы = Цел(КодРазбора / МаскаУлицы());
	
	ТексЗапроса = "ВЫБРАТЬ
	              |	АдресныйКлассификатор.Код,
	              |	АдресныйКлассификатор.КодРегионаВКоде,
	              |	АдресныйКлассификатор.Наименование,
	              |	АдресныйКлассификатор.Сокращение,
	              |	АдресныйКлассификатор.Индекс,
	              |	АдресныйКлассификатор.ТипАдресногоЭлемента,
	              |	АдресныйКлассификатор.КодРайонаВКоде,
	              |	АдресныйКлассификатор.КодГородаВКоде,
	              |	АдресныйКлассификатор.КодНаселенногоПунктаВКоде,
	              |	АдресныйКлассификатор.КодУлицыВКоде
	              |ИЗ
	              |	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	              |
	              |ГДЕ
	              |	АдресныйКлассификатор.ТипАдресногоЭлемента = &ТипАдресногоЭлемента И
	              |	АдресныйКлассификатор.КодРегионаВКоде = &КодРегиона И
	              |	АдресныйКлассификатор.КодРайонаВКоде = &КодРайона И
	              |	АдресныйКлассификатор.КодГородаВКоде = &КодГорода И
	              |	АдресныйКлассификатор.КодНаселенногоПунктаВКоде = &КодНаселенногоПункта И
	              |	АдресныйКлассификатор.КодУлицыВКоде = &КодУлицы И
	              |	АдресныйКлассификатор.Код = &КодЭлемента";
	
	Запрос = Новый Запрос(ТексЗапроса);
	Запрос.УстановитьПараметр("ТипАдресногоЭлемента", ТипАдресногоЭлемента);
	Запрос.УстановитьПараметр("КодРегиона", КодРегиона);
	Запрос.УстановитьПараметр("КодРайона", КодРайона);
	Запрос.УстановитьПараметр("КодГорода", КодГорода);
	Запрос.УстановитьПараметр("КодНаселенногоПункта", КодНаселенногоПункта);
	Запрос.УстановитьПараметр("КодУлицы", КодУлицы);
	Запрос.УстановитьПараметр("КодЭлемента", КодЭлемента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Код,Наименование,Сокращение,ТипАдресногоЭлемента,Индекс,КодРегионаВКоде,КодРайонаВКоде,КодГородаВКоде,КодНаселенногоПунктаВКоде,КодУлицыВКоде",
		                         Выборка.Код,
		                         Выборка.Наименование,
		                         Выборка.Сокращение,
		                         Выборка.ТипАдресногоЭлемента,
		                         Выборка.Индекс,
		                         Выборка.КодРегионаВКоде,
		                         Выборка.КодРайонаВКоде,
		                         Выборка.КодГородаВКоде,
		                         Выборка.КодНаселенногоПунктаВКоде,
		                         Выборка.КодУлицыВКоде);

	Иначе 
		Возврат ПолучитьПустуюСтруктуруАдреса();
		
	КонецЕсли;
	
КонецФункции

// Функция ставит в соответствие типу адресного элемента маску,.
// Через которую выделяется его значимый код.
//
// Параметры:
//  АдресныйЭлемент - элемент справочника "Адресный классификатор".
// Для которого необходимо получить маску.
//
// Возвращаемое значение:
// Число - маска, при делении на которую выделяется значимый код адресного элемента.
//
Функция ПолучитьМаску(АдресныйЭлемент) Экспорт

	Возврат ПолучитьМаскуПоТипу(АдресныйЭлемент.ТипАдресногоЭлемента);

КонецФункции

// Функция возвращает структуру с набором полей как у записи регистра сведений.
//  АдресныйКлассификатор с пустым набором значений.
//
// Параметры:
// Нет.
//
// Возвращаемое значение:
// Структура - структуру с набором полей как у записи регистра сведений.
//  АдресныйКлассификатор с пустым набором значений.
//
Функция ПолучитьПустуюСтруктуруАдреса() Экспорт
	
	Возврат Новый Структура("Код,Наименование,Сокращение,ТипАдресногоЭлемента,Индекс,КодРегионаВКоде,КодРайонаВКоде,КодГородаВКоде,КодНаселенногоПунктаВКоде,КодУлицыВКоде", 0, "", "", 0, "", 0, 0, 0, 0, 0);
	
КонецФункции

// Функция ищет требуемый адресный элемент по названию и типу. 
// И возвращает первый найденный. В качестве дополнения может. 
// Быть задан элемент "родитель".
//
// Параметры:
//  НазваниеЭлемента - название адресного элемента ( с сокращением).
//  ТипЭлемента - тип искомого адресного элемента.
//  ЭлементРодитель - элемент "родитель".
//
// Возвращаемое значение:
//  Найденный элемент справочника Адресный классификатор или пустая ссылка в случае неудачи.
//
Функция ПолучитьАдресныйЭлемент(НазваниеЭлемента, ТипЭлемента, КодЭлементаРодителя = 0) Экспорт

	Перем КодРегиона, КодРайона, КодГорода, КодНаселенногоПункта, КодУлицы, КодДома;
	
	Если (СокрЛП(НазваниеЭлемента) = "") ИЛИ (ТипЭлемента = 0) Тогда
		Возврат ПолучитьПустуюСтруктуруАдреса();
	КонецЕсли;
	
	// Смотрим есть ли в имени адресное сокращение этого уровня.
	// Если есть, то ищем по наименованию и адресному сокращению.
	АдресноеСокращение = "";
	НазваниеЭлемента = ПолучитьИмяИАдресноеСокращение(НазваниеЭлемента, АдресноеСокращение);

	Запрос = Новый Запрос();
	
	ОграничениеПоКоду = "";
	Если КодЭлементаРодителя > 0 Тогда // Проверка на соответствие подчинению родителю.
		ТипАдрЭлемента = ПолучитьТипАдресногоЭлемента(КодЭлементаРодителя);
		МаскаРодителя = ПолучитьМаскуПоТипу(ТипАдрЭлемента);
		
		Если ТипАдрЭлемента <= 5 Тогда
			
			КодЭлемента = КодЭлементаРодителя;
			
			РазложитьКодАдресногоЭлементаНаСоставляющие(КодЭлемента, КодРегиона, КодРайона, КодГорода, КодНаселенногоПункта, КодУлицы, КодДома);

			Если КодРегиона <> 0 Тогда
				ОграничениеПоКоду = ОграничениеПоКоду + Символы.ПС + "  И (АдресныйКлассификатор.КодРегионаВКоде = &КодРегионаВКоде)";
				Запрос.УстановитьПараметр("КодРегионаВКоде", КодРегиона);
			КонецЕсли;
			
			Если КодРайона <> 0 Тогда
				ОграничениеПоКоду = ОграничениеПоКоду + Символы.ПС + "  И (АдресныйКлассификатор.КодРайонаВКоде = &КодРайонаВКоде)";
				Запрос.УстановитьПараметр("КодРайонаВКоде", КодРайона);
			КонецЕсли;
			
			Если КодГорода <> 0 Тогда
				ОграничениеПоКоду = ОграничениеПоКоду + Символы.ПС + "  И (АдресныйКлассификатор.КодГородаВКоде = &КодГородаВКоде)";
				Запрос.УстановитьПараметр("КодГородаВКоде", КодГорода);
			КонецЕсли;
			
			Если КодНаселенногоПункта <> 0 Тогда
				ОграничениеПоКоду = ОграничениеПоКоду + Символы.ПС + "  И (АдресныйКлассификатор.КодНаселенногоПунктаВКоде = &КодНаселенногоПунктаВКоде)";
				Запрос.УстановитьПараметр("КодНаселенногоПунктаВКоде", КодНаселенногоПункта);
			КонецЕсли;
			
			Если КодУлицы <> 0 Тогда
				ОграничениеПоКоду = ОграничениеПоКоду + Символы.ПС + "  И (АдресныйКлассификатор.КодУлицыВКоде = &КодУлицыВКоде)";
				Запрос.УстановитьПараметр("КодУлицыВКоде", КодУлицы);
			КонецЕсли;
		
		Иначе
			// Ограничиваем по коду элемента.
			КонечноеЗначениеКода = КодЭлементаРодителя + МаскаРодителя - 1; 
			
			ОграничениеПоКоду = Символы.ПС + "  И (АдресныйКлассификатор.Код Между &НачальноеЗначениеКода И &КонечноеЗначениеКода)";
			Запрос.УстановитьПараметр("НачальноеЗначениеКода", КодЭлементаРодителя);
			Запрос.УстановитьПараметр("КонечноеЗначениеКода", КонечноеЗначениеКода);
		КонецЕсли;
		
	КонецЕсли;
	
	// Ограничение на адресное сокращение.
	Если АдресноеСокращение <> "" Тогда
		ОграничениеПоКоду = ОграничениеПоКоду + Символы.ПС + "  И (АдресныйКлассификатор.Сокращение = &АдресноеСокращение)";
		Запрос.УстановитьПараметр("АдресноеСокращение", АдресноеСокращение);
	КонецЕсли;
	
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				  |	АдресныйКлассификатор.Код,
	              |	АдресныйКлассификатор.КодРегионаВКоде,
	              |	АдресныйКлассификатор.Наименование,
	              |	АдресныйКлассификатор.Сокращение,
	              |	АдресныйКлассификатор.Индекс,
	              |	АдресныйКлассификатор.ТипАдресногоЭлемента,
	              |	АдресныйКлассификатор.КодРайонаВКоде,
	              |	АдресныйКлассификатор.КодГородаВКоде,
	              |	АдресныйКлассификатор.КодНаселенногоПунктаВКоде,
	              |	АдресныйКлассификатор.КодУлицыВКоде

	              |ИЗ
	              |	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	              |
	              |ГДЕ
	              |	АдресныйКлассификатор.Наименование = &Наименование И
	              |	АдресныйКлассификатор.ТипАдресногоЭлемента = &ТипАдресногоЭлемента " +
				  ОграничениеПоКоду;
	

	Запрос.УстановитьПараметр("Наименование", НазваниеЭлемента);
	Запрос.УстановитьПараметр("ТипАдресногоЭлемента", ТипЭлемента);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = СоздатьСтруктуруПоСтрокеВыборки(РезультатЗапроса, Выборка);
	Иначе 
		Структура =  ПолучитьПустуюСтруктуруАдреса();
	КонецЕсли;
	
	Возврат Структура;

КонецФункции

// Функция определяет входимость числа в заданный диапазон.
//  При этом диапазон задается как это описано в комментарии к функции ЧислоВИнтервале.
//
// Параметры: 
//  Номер - (число, строка) номер дома с корпусом.
//  Интервал - (строка), интервал чисел (домов).
//
// Возвращаемое значение:
//  Истина - если заданное число входит в диапазон,.
//  Ложь   - если не входит.
//
Функция ВходитВИнтервал(Знач Номер, Интервал) Экспорт

	Если ПустаяСтрока("" + Номер) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если НЕ бит_ОбщегоНазначения.ТолькоЦифрыВСтроке(Номер, Ложь) Тогда
		Возврат ВРЕГ(СтрЗаменить("" + Номер, " ", "")) = ВРЕГ(СтрЗаменить("" + Интервал, " ", ""));
	КонецЕсли;

	Номер = Число(Номер);

	ТолькоЧислоИнтервал = бит_ОбщегоНазначения.ТолькоЦифрыВСтроке(Интервал, Ложь);
	
	Если ТолькоЧислоИнтервал Тогда
		Если Номер = Число(Интервал) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Если Найти(Интервал,"Ч") > 0 Тогда // Диапазон четных чисел.
		Интервал      = СтрЗаменить(Интервал, "Ч", "");
		Четность = 2;
		
	ИначеЕсли Найти(Интервал,"Н") > 0 Тогда // Диапазон нечетных чисел.
		Интервал      = СтрЗаменить(Интервал, "Н", "");
		Четность = 1;
		
	ИначеЕсли (Найти(Интервал, "-") = 0) И ТолькоЧислоИнтервал Тогда 
		// Интервал это дом представленный в виде строки.
		Возврат Ложь;
		
	Иначе
		Четность=0;
		
	КонецЕсли;
	
	Интервал = СтрЗаменить(Интервал, ")", ""); // На всякий случай уберем скобки.
	Интервал = СтрЗаменить(Интервал, "(", "");
	Позиция  = Найти(Интервал, "-");
	Попали = 0;
	
	Если Позиция <> 0 Тогда
		МинЗначение  = Число(Лев(Интервал, Позиция - 1));
		МаксЗначение = Число(Сред(Интервал, Позиция + 1));
		Если (Номер >= МинЗначение) И (Номер <= МаксЗначение) Тогда
			Попали = 1;
		КонецЕсли;
		
	ИначеЕсли ПустаяСтрока(Интервал) Тогда
		// Случай когда интервал был равен Ч или Н.
		Попали = 1;
		
	Иначе
		Если бит_ОбщегоНазначения.ТолькоЦифрыВСтроке(Интервал, Ложь) Тогда
			Если Номер = Число(Интервал) Тогда
				Попали = 1;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Если (Попали = 1) И (
	((Четность = 2) И (Номер % 2 = 0)) ИЛИ 
	((Четность = 1) И (Номер % 2 = 1)) ИЛИ 
	 (Четность = 0)) Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВходитВИнтервал()

// Функция определяет входимость:
//  1. Номера дома (представленного в виде строки) где Номер дома, это строка вида:.
//     <СтрокаДом> пример: 58А, 32/1, 50А/8.
//
//  2. Номера дома и номера корпуса (строения), в виде строки:
//     <СтрокаДом>к<СтрокаКорпус>,   пример: 32к1   это дом 32 корпус 1,. 
//     <СтрокаДом>/<СтрокаКорпус>,   пример: 32/1   это дом 32 корпус 1,. 
//     <СтрокаДом>стр<СтрокаКорпус>, пример: 32стр1 это дом 32 корпус 1,. 
//		
//  3. Числа (номера дома) в заданный интервал чисел.
//     При этом интервал задается строкой вида:.
//     <Диапазон>[,<Диапазон>].
//     Где Диапазон, это строка вида:.
//     [Ч/Н]<Число>[-<Число>].
//     Префикс Ч или Н диапазона обозначает четность и нечетность входящих в него чисел.
//     Пример: в интервал Ч12-14,Н1-5,20-29 входят числа 1,3,5,12,14 и все с 20 по 29.
//
// Параметры: 
//  Номер - (число, строка) номер дома с корпусом .
//  Интервал - (строка), интервал чисел (домов).
//
//  Истина - если заданное число входит в диапазон,.
//  Ложь   - если не входит.
//
Функция НомерДомаВИнтервале(Номер, Знач Интервал) Экспорт
	
	Пока НЕ ПустаяСтрока(Интервал) Цикл

		Позиция = Найти(Интервал, ",");
		Если Позиция = 0 Тогда
			Возврат ВходитВИнтервал(Номер, Интервал);
		Иначе
			Если ВходитВИнтервал(Номер, СокрЛП(Лев(Интервал, Позиция - 1))) Тогда
				Возврат Истина;
			Иначе
				Интервал = Сред(Интервал, Позиция + 1);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат Ложь;

КонецФункции // НомерДомаВИнтервале()

// Функция определяет индекс по переданным улице, дому и корпусу.
//
// Параметры: 
//  Улица - элемент справочника адресный классификатор с требуемой улицей.
//  НомерДома - номер дома, для которого необходимо получить индекс.
//  НомерКорпуса - номер корпуса.
//
// Возвращаемое значение:
//  Строка - шестизначный почтовый индекс.
//
Функция ПолучитьИндексПоУлицеДомуКорпусу(Улица, НомерДома, НомерКорпуса) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Уровень", 6);
	Запрос.УстановитьПараметр("НижнийКод", Цел(Улица.Код / 10000000000) * 10000000000);
	Запрос.УстановитьПараметр("ВерхнийКод", Цел(Улица.Код / 10000000000 + 1) * 10000000000);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	АдресныйКлассификатор.Наименование,
	|	АдресныйКлассификатор.Индекс
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|
	|ГДЕ
	|	АдресныйКлассификатор.ТипАдресногоЭлемента = &Уровень И
	|	АдресныйКлассификатор.Код МЕЖДУ &НижнийКод И &ВерхнийКод";

	
	Выборка = Запрос.Выполнить().Выбрать();
	ИндексДома = "";
	
	Пока Выборка.Следующий() Цикл

		Если НЕ ПустаяСтрока(Выборка.Индекс) Тогда
			Интервал = Врег(СокрЛП(Выборка.Наименование));
			
			Если НомерДомаВИнтервале(СокрЛП(НомерДома), Интервал) Тогда
				ИндексДома = Выборка.Индекс;
				
			ИначеЕсли (НомерДомаВИнтервале(СокрЛП(НомерДома) + ?(НЕ ПустаяСтрока(НомерКорпуса), "К", "") + СокрЛП(НомерКорпуса), Интервал)) Тогда
				Возврат Выборка.Индекс;
				
			ИначеЕсли (НомерДомаВИнтервале(СокрЛП(НомерДома) + ?(НЕ ПустаяСтрока(НомерКорпуса), "/", "") + СокрЛП(НомерКорпуса), Интервал)) Тогда
				Возврат Выборка.Индекс;
				
			ИначеЕсли (НомерДомаВИнтервале(СокрЛП(НомерДома) + ?(НЕ ПустаяСтрока(НомерКорпуса), "стр", "") + СокрЛП(НомерКорпуса), Интервал)) Тогда
				Возврат Выборка.Индекс;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(ИндексДома) Тогда
		Возврат Улица.Индекс;
	Иначе
		Возврат ИндексДома;
	КонецЕсли;
	
КонецФункции

// Функция определяет индекс по переданным региону, району, городу, населенному пункту, улице, дому и корпусу.
//
// Параметры: 
//  НазваниеРегиона - название региона( с сокращением).
//  НазваниеРайона - название района( с сокращением).
//  НазваниеГорода - название города( с сокращением).
//  НазваниеНаселенногоПункта - название населенного пункта( с сокращением).
//  Улица - название улицы ( с сокращением).
//  НомерДома - номер дома, для которого необходимо получить индекс.
//  НомерКорпуса - номер корпуса.
//
// Возвращаемое значение:
//  Строка - шестизначный почтовый индекс.
//
Функция ПолучитьИндекс(Знач НазваниеРегиона, Знач НазваниеРайона, Знач НазваниеГорода, Знач НазваниеНаселенногоПункта, Знач НазваниеУлицы, Знач НомерДома, Знач НомерКорпуса) Экспорт

	РодительИндекса = ПолучитьПустуюСтруктуруАдреса();
	Индекс = "";
	
	Регион = ПолучитьАдресныйЭлемент(НазваниеРегиона, 1);
	Если Регион.Код > 0 Тогда
        РодительИндекса = Регион;
		Если НЕ ПустаяСтрока(Регион.Индекс) Тогда
			Индекс = Регион.Индекс;
		КонецЕсли;
	КонецЕсли;
	
	Район = ПолучитьАдресныйЭлемент(НазваниеРайона, 2, РодительИндекса.Код);
	Если Район.Код > 0 Тогда
		РодительИндекса = Район;
		Если НЕ ПустаяСтрока(Район.Индекс) Тогда
			Индекс = Район.Индекс;
		КонецЕсли;
	КонецЕсли;
	
	Город = ПолучитьАдресныйЭлемент(НазваниеГорода, 3, РодительИндекса.Код);
	Если Город.Код > 0 Тогда
		РодительИндекса = Город;
		Если НЕ ПустаяСтрока(Город.Индекс) Тогда
			Индекс = Город.Индекс;
		КонецЕсли;
	КонецЕсли;
	
	НаселенныйПункт = ПолучитьАдресныйЭлемент(НазваниеНаселенногоПункта, 4, РодительИндекса.Код);
	Если НаселенныйПункт.Код > 0 Тогда
		РодительИндекса = НаселенныйПункт;
		Если НЕ ПустаяСтрока(НаселенныйПункт.Индекс) Тогда
			Индекс = НаселенныйПункт.Индекс;
		КонецЕсли;
	КонецЕсли;
	
	Улица = ПолучитьАдресныйЭлемент(НазваниеУлицы, 5, РодительИндекса.Код);
	Если Улица.Код > 0 Тогда
		ИндексУлицы = ПолучитьИндексПоУлицеДомуКорпусу(Улица, НомерДома, НомерКорпуса);
		Если НЕ ПустаяСтрока(ИндексУлицы) Тогда
			Индекс = ИндексУлицы;
		КонецЕсли;
	КонецЕсли;

	Возврат Индекс;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСАдреснымКодом

Функция КодСтраныПоНазванию(Название) Экспорт
	
	Если ПустаяСтрока(Название) Тогда
		Возврат "";
	КонецЕсли;
	
	Назв = СокрЛ(Название);
	ПервыЙПробел = Найти(Назв, " ");
	Если ПервыйПробел <> 0 Тогда
		Назв = Лев(Назв, ПервыйПробел - 1);
	КонецЕсли;
	
	// Сначала пробуем найти в адресном классификаторе.
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторСтранМира.Код,
	|	КлассификаторСтранМира.Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК КлассификаторСтранМира
	|ГДЕ
	|	КлассификаторСтранМира.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Назв);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Формат(Выборка.КодРегионаВКоде, "ЧЦ=2; ЧВН=")
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Функция возвращает маску  для определения номера элемента в структуре кода. 
//
// Параметры: 
// Нет.
//
// Возвращаемое значение:
//  Число - маска с единица в значимых разрядах и нулями в остальных.
//
Функция МаскаРегиона() Экспорт
	Возврат 100000000000000000000000;
КонецФункции

// Функция возвращает маску  для определения номера элемента в структуре кода. 
//
// Параметры: 
// Нет.
//
// Возвращаемое значение:
//  Число - маска с единица в значимых разрядах и нулями в остальных.
//
Функция МаскаРайона() Экспорт
	Возврат 100000000000000000000;
КонецФункции

// Функция возвращает маску  для определения номера элемента в структуре кода. 
//
// Параметры: 
// Нет.
//
// Возвращаемое значение:
//  Число - маска с единица в значимых разрядах и нулями в остальных
//
Функция МаскаГорода() Экспорт
	Возврат 100000000000000000;
КонецФункции

// Функция возвращает маску  для определения номера элемента в структуре кода 
//
// Параметры: 
// Нет.
//
// Возвращаемое значение:
//  Число - маска с единица в значимых разрядах и нулями в остальных.
//
Функция МаскаНасПункта() Экспорт
	Возврат 100000000000000;
КонецФункции

// Функция возвращает маску  для определения номера элемента в структуре кода. 
//
// Параметры: 
// Нет.
//
// Возвращаемое значение:
//  Число - маска с единица в значимых разрядах и нулями в остальных.
//
Функция МаскаУлицы() Экспорт
	Возврат 10000000000;
КонецФункции

// Функция возвращает маску  для определения номера элемента в структуре кода. 
//
// Параметры: 
// Нет.
//
// Возвращаемое значение:
//  Число - маска с единица в значимых разрядах и нулями в остальных.
//
Функция МаскаДома() Экспорт
	Возврат 1000000;
КонецФункции

// Функция возвращает маску  для определения номера элемента в структуре кода. 
//
// Параметры: 
// Нет.
//
// Возвращаемое значение:
//  Число - маска с единица в значимых разрядах и нулями в остальных.
//
Функция МаскаКвартиры() Экспорт
	Возврат 100;
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииОбработчикиСАдреснымКлассификатором

#Если Клиент Тогда
	
// Процедура устанавливает последние значения тайпинга для адресныхЭлементов.
//
Процедура УстановитьПоследниеЗначенияТайпинговДляАдресныхЭлементов(Регион, Район, Город, НаселенныйПункт, Улица,
							ПоследнееЗначениеРегион, ПоследнееЗначениеРайон, ПоследнееЗначениеГород, ПоследнееЗначениеНаселенныйПункт, ПоследнееЗначениеУлица) Экспорт
	
	ПоследнееЗначениеРегион          = Регион;
	ПоследнееЗначениеРайон           = Район;
	ПоследнееЗначениеГород           = Город;
	ПоследнееЗначениеНаселенныйПункт = НаселенныйПункт;
	ПоследнееЗначениеУлица           = Улица;
	
КонецПроцедуры // УстановитьПоследниеЗначенияТайпинговДляАдресныхЭлементов()

// Стандартный обработчик "Начало выбора из списка" для выпадающего списка сокращений адресного элемента.
//
Процедура АдресныйЭлементПриВыбореИзСпискаСокращений(ЭтаФорма, Элемент, СтандартнаяОбработка, ПолеРедактирования, Уровень) Экспорт
	
	СтандартнаяОбработка = Ложь;
	НазваниеТерриториальнойЕдиницы = СокрЛП(ОбрезатьСокращение(ПолеРедактирования));
	СписокСокращений = ПолучитьСписокСокращений(НазваниеТерриториальнойЕдиницы, Уровень);
	
	Если СписокСокращений <> Неопределено Тогда
		Сокращение = ЭтаФорма.ВыбратьИзСписка(СписокСокращений, Элемент);
		Если Сокращение <> Неопределено Тогда
			ПолеРедактирования = НазваниеТерриториальнойЕдиницы + " " + СокрЛП(Сокращение.Значение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // АдресныйЭлементПриВыбореИзСпискаСокращений()

// Процедура автоподбора текста для адресного элемента.
//
Процедура АдресныйЭлементАвтоподборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка,
											ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, УровеньЭлемента, СтруктураЭлемента) Экспорт
	// БИТ_ЖКХ 05.06.2014{{										
	#Если НЕ Клиент Тогда
	МассивПоиска = Новый Массив();
	МассивПоиска.Добавить("Наименование");
	
	СтруктураОграничений = ПолучитьСтруктуруОграниченийПоАдресу(ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, "", УровеньЭлемента);
		
	СтруктураЭлемента = ПроцедурыПоискаПоСтроке.АвтоПодборТекстаВЭлементеУправленияПоРегистру(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, СтруктураОграничений, 
												  "АдресныйКлассификатор", МассивПоиска, "Наименование");
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}			
	
КонецПроцедуры

// Функция определяет необходимый уровень для детализации имени адресного элемента.
//
Функция ОпределитьУровеньДетализацииДляАдресногоЭлемента(ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, УровеньЭлемента)
	
	НачальныйУровеньАдреса = 1;
	
	Если ЗначениеЗаполнено(ПолеРегиона) И (УровеньЭлемента >= 2) Тогда
		НачальныйУровеньАдреса = 2;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеРайона) И (УровеньЭлемента >= 3) Тогда
		НачальныйУровеньАдреса = 3;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеГорода) И (УровеньЭлемента >= 4) Тогда
		НачальныйУровеньАдреса = 4;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеНаселенногоПункта) И (УровеньЭлемента >= 5) Тогда
		НачальныйУровеньАдреса = 5;	
	КонецЕсли;
	
	Возврат НачальныйУровеньАдреса;		
КонецФункции
											  
// Процедура обработки окончания ввода текста для адресного элемента.
//
Процедура АдресныйЭлементОкончаниеВводаТекстаАдреса(ЭтаФорма, Элемент, Текст, Значение, СтандартнаяОбработка,
													ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, УровеньЭлемента,
													ОбработкаПоискаПоСтроке, ТекстПоискаПоСтроке, ПоследнееЗначениеЭлементаПоискаПоСтроке, СтруктураЭлемента) Экспорт
	// БИТ_ЖКХ 05.06.2014{{												
	#Если НЕ Клиент Тогда
	СтруктураОграничений = ПолучитьСтруктуруОграниченийПоАдресу(ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, "", УровеньЭлемента);
	НачальныйУровеньДетализацииАдреса = ОпределитьУровеньДетализацииДляАдресногоЭлемента(ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, УровеньЭлемента);
	
	СтруктураЭлемента = Новый Структура();
	
	ПроцедурыПоискаПоСтроке.ОкончаниеВводаТекстаВЭлементеУправленияПоАдресномуКлассификатору(Элемент, Текст, Значение, СтандартнаяОбработка, 
		СтруктураОграничений, ЭтаФорма,  
		ОбработкаПоискаПоСтроке, ТекстПоискаПоСтроке, ПоследнееЗначениеЭлементаПоискаПоСтроке, ,
		СтруктураЭлемента, НачальныйУровеньДетализацииАдреса, УровеньЭлемента - 1);
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}	
	
КонецПроцедуры
	
// Процедура обработки окончания ввода текста для Города.
//
Процедура АдресныйЭлементОкончаниеВводаТекстаГорода(ЭтаФорма, Элемент, Текст, Значение, СтандартнаяОбработка,
													ОбработкаПоискаПоСтроке, ТекстПоискаПоСтроке, 
													ПоследнееЗначениеЭлементаПоискаПоСтроке, СтруктураЭлемента) Экспорт
	// БИТ_ЖКХ 05.06.2014{{												
	#Если НЕ Клиент Тогда
	СтруктураЭлемента = Новый Структура();
	
	ПроцедурыПоискаПоСтроке.ОкончаниеВводаТекстаВЭлементеУправленияПоГородуУлице(Элемент, Текст, Значение, СтандартнаяОбработка, 
		ЭтаФорма,  
		ОбработкаПоискаПоСтроке, ТекстПоискаПоСтроке, ПоследнееЗначениеЭлементаПоискаПоСтроке, ,
		СтруктураЭлемента, 2, Истина);
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}	
	
КонецПроцедуры

// Процедура обработки подбора текста для Города.
//
Функция АвтоПодборТекстаВЭлементеУправленияПоГороду(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка) Экспорт

	// БИТ_ЖКХ 05.06.2014{{												
	#Если НЕ Клиент Тогда
		РезультатЗапроса = ВернутьРезультатЗапросаПоискаГорода(Текст, 2);
		МассивПолеВыбора = Новый Массив();
		МассивПолеВыбора.Добавить("Наименование");
		СтруктураНайденногоЭлемента = ПроцедурыПоискаПоСтроке.ПолучитьАвтоподборПоВыборке(РезультатЗапроса, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, МассивПолеВыбора);
		Возврат СтруктураНайденногоЭлемента;
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}				
	
КонецФункции

// Процедура обработки окончания ввода текста для Города.
//
Процедура АдресныйЭлементОкончаниеВводаТекстаУлицы(ЭтаФорма, Элемент, Текст, Значение, СтандартнаяОбработка,
													ПолеГорода, ОбработкаПоискаПоСтроке, ТекстПоискаПоСтроке, 
													ПоследнееЗначениеЭлементаПоискаПоСтроке, СтруктураЭлемента) Экспорт
	// БИТ_ЖКХ 05.06.2014{{												
	#Если НЕ Клиент Тогда
	СтруктураЭлемента = Новый Структура();
	
	ПроцедурыПоискаПоСтроке.ОкончаниеВводаТекстаВЭлементеУправленияПоГородуУлице(Элемент, Текст, Значение, СтандартнаяОбработка, 
		ЭтаФорма,  
		ОбработкаПоискаПоСтроке, ТекстПоискаПоСтроке, ПоследнееЗначениеЭлементаПоискаПоСтроке, ,
		СтруктураЭлемента, 6, Ложь, ПолеГорода);
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}		
	
КонецПроцедуры
	
// Процедура обработки подбора текста для Улице.
//
Функция АвтоПодборТекстаВЭлементеУправленияПоУлице(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ПолеГорода) Экспорт

	// БИТ_ЖКХ 05.06.2014{{												
	#Если НЕ Клиент Тогда
		РезультатЗапроса = ВернутьРезультатЗапросаПоискаУлицыГорода(ПолеГорода, Текст, 2);
		МассивПолеВыбора = Новый Массив();
		МассивПолеВыбора.Добавить("Наименование");
		СтруктураНайденногоЭлемента = ПроцедурыПоискаПоСтроке.ПолучитьАвтоподборПоВыборке(РезультатЗапроса, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, МассивПолеВыбора);
		Возврат СтруктураНайденногоЭлемента;
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}		
	
КонецФункции

// функция возвращает результат запроса для поиска города.
//
Функция ВернутьРезультатЗапросаПоискаГорода(ИмяГорода, КоличествоСтрокВыборки) Экспорт
	
	// БИТ_ЖКХ 05.06.2014{{												
	#Если НЕ Клиент Тогда
	ОграничениеПоИмени = ПроцедурыПоискаПоСтроке.СформироватьОграничениеПоПолюВхождениеВНачало("АдресныйКлассификатор.Наименование", Тип("Строка"));
	
	НачалоЗапроса = "ВЫБРАТЬ ПЕРВЫЕ " + Строка(КоличествоСтрокВыборки) + " 
	              |	АдресныйКлассификатор.Код,
	              |	АдресныйКлассификатор.КодРегионаВКоде,
	              |	АдресныйКлассификатор.Наименование,
	              |	АдресныйКлассификатор.Сокращение,
	              |	АдресныйКлассификатор.Индекс,
	              |	АдресныйКлассификатор.ТипАдресногоЭлемента,
	              |	АдресныйКлассификатор.КодРайонаВКоде,
	              |	АдресныйКлассификатор.КодГородаВКоде,
	              |	АдресныйКлассификатор.КодНаселенногоПунктаВКоде,
	              |	АдресныйКлассификатор.КодУлицыВКоде
	              |ИЗ
	              |	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	              |
	              |ГДЕ
				  | " + ОграничениеПоИмени + "
				  |	И "; 
				  
	ТекстЗапроса = НачалоЗапроса + " (АдресныйКлассификатор.ТипАдресногоЭлемента = 3 ) 
					| ОБЪЕДИНИТЬ ВСЕ 
					| 
					|" + НачалоЗапроса + "  			  
	 			  	|	  (АдресныйКлассификатор.ТипАдресногоЭлемента = 1) 
				  	| 	И (АдресныйКлассификатор.КодРегионаВКоде В (77, 78)) 
				  	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТекстАвтоПодбора", ИмяГорода + "%");
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Возврат РезультатЗапроса;
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}			
	
КонецФункции

// Функция возвращает результат запроса для поиска улицы города.
//
Функция ВернутьРезультатЗапросаПоискаУлицыГорода(ИмяГорода, ИмяУлицы, КоличествоСтрокВыборки) Экспорт
	
	// БИТ_ЖКХ 05.06.2014{{												
	#Если НЕ Клиент Тогда
		МассивИменПоиска = Новый Массив();
		МассивИменПоиска.Добавить("Наименование");
		
		СтруктураОграничений = СформироватьСтруктуруОграниченийУлицыПоГороду(ИмяГорода);
		РезультатПодбора = ПроцедурыПоискаПоСтроке.ПолучитьРезультатЗапросаАвтоподбораДляРегистра(ИмяУлицы, СтруктураОграничений, "АдресныйКлассификатор", МассивИменПоиска, КоличествоСтрокВыборки);
		
		Возврат РезультатПодбора;
	#КонецЕсли	
	// БИТ_ЖКХ 05.06.2014}}	
	
КонецФункции

#КонецЕсли

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура КонтактнаяИнформацияОбновлениеИБ() Экспорт
	
	// Справочник "бит_СписокЗданий"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания;
	ПараметрыВида.Используется = Истина;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС = Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	Об = Справочники.ВидыКонтактнойИнформации.Справочникбит_СписокЗданий.ПолучитьОбъект();
	Об.Используется = Истина;
	Об.ОбменДанными.Загрузка = Истина;
	Об.Записать();
	
КонецПроцедуры

//  Функция формирует сведения об указанном ЮрФизЛице. 
//  К сведениям относятся - наименование, адрес, номер телефона, банковские реквизиты.
//
// Параметры: 
//  ЮрФизЛицо   - организация или физическое лицо, о котором собираются сведения.
//  ДатаПериода - дата, на которую выбираются сведения о ЮрФизЛице.
//  ДляФизЛицаТолькоИнициалы - Для физ. лица выводить только инициалы имени и отчества.
//
// Возвращаемое значение:
//  Сведения - собранные сведения.
//
Функция СведенияОЮрФизЛице(ЮрФизЛицо, ДатаПериода = '20200101', ДляФизЛицаТолькоИнициалы = Истина, БанковскийСчет = Неопределено) Экспорт

	Сведения = Новый Структура("Представление, ПолноеНаименование, СокращенноеНаименование, НаименованиеДляПечатныхФорм, 
		|КодПоОКПО, ИНН, КПП, Телефоны, ЮридическийАдрес, Банк, БИК, КоррСчет, НомерСчета, АдресБанка");
	Запрос   = Новый Запрос;
	Данные   = Неопределено;

	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат Сведения;
	КонецЕсли;

	Если БанковскийСчет = Неопределено ИЛИ БанковскийСчет.Пустая() Тогда
		ТекБанковскийСчет = ЮрФизЛицо.ОсновнойБанковскийСчет;
	Иначе
		ТекБанковскийСчет = БанковскийСчет;
	КонецЕсли;
	
	// Выберем основные сведения о контрагентеЮрФизЛицо.ОсновнойБанковскийСчет.БанкДляРасчетов.Пустая.
	Если ТекБанковскийСчет.БанкДляРасчетов.Пустая() Тогда
		ИмяРеквизитаБанка = "Банк";
	Иначе
		ИмяРеквизитаБанка = "БанкДляРасчетов";
	КонецЕсли;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		ИмяСправочника = "Организации";
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяСправочника = "Контрагенты";
	Иначе
		Возврат Сведения;
	КонецЕсли;

	Запрос.УстановитьПараметр("ПарЮрФизЛицо",      ЮрФизЛицо);
	Запрос.УстановитьПараметр("ПарБанковскийСчет", ТекБанковскийСчет);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Представление КАК Наименование,
	|	Организации.НаименованиеПолное КАК ПолноеНаименование,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.КодПоОКПО КАК КодПоОКПО,";
	
	Если ИмяСправочника = "Организации" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	Организации.НаименованиеСокращенное КАК СокращенноеНаименование,
		|	ВЫБОР 
		|		КОГДА Организации.ВариантНаименованияДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВариантыНаименованияДляПечатныхФорм.СокращенноеНаименование)
		|			ТОГДА Организации.НаименованиеСокращенное 
		|		ИНАЧЕ
		|			Организации.НаименованиеПолное
		|	КОНЕЦ КАК НаименованиеДляПечатныхФорм,
		|	Организации.СвидетельствоСерияНомер,
		|	Организации.СвидетельствоДатаВыдачи,";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	Организации.Представление КАК СокращенноеНаименование,
		|	Организации.НаименованиеПолное КАК НаименованиеДляПечатныхФорм,";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекБанковскийСчет) Тогда
	
		Запрос.Текст = Запрос.Текст + "
		|	""""                           КАК НомерСчета,
		|	""""                           КАК Банк,
		|	""""                           КАК БИК,
		|	""""                           КАК КоррСчет,
		|	""""                           КАК АдресБанка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК Организации
		|
		|ГДЕ
		|	Организации.Ссылка = &ПарЮрФизЛицо";
	
	Иначе
	
		Запрос.Текст = Запрос.Текст + "
		|	БанковскиеСчета.НомерСчета                     КАК НомерСчета,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+"          КАК Банк,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".Код      КАК БИК,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".КоррСчет КАК КоррСчет,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".Адрес    КАК АдресБанка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК Организации,
		|	Справочник.БанковскиеСчета    КАК БанковскиеСчета
		|
		|ГДЕ
		|	Организации.Ссылка       = &ПарЮрФизЛицо
		|	И БанковскиеСчета.Ссылка = &ПарБанковскийСчет";
		
	КонецЕсли;
	
	Данные = Запрос.Выполнить().Выбрать();
	Данные.Следующий();

	Сведения.Вставить("КодПоОКПО", 		"");
	Сведения.Вставить("КПП",       		"");
	Сведения.Вставить("Свидетельство",	"");

	// БИТ_ЖКХ 11.01.2016 10:43:23 Начало правки... 
	//Если НЕ (ЮрФизЛицо.Метаданные().Реквизиты.Найти("ЮрФизЛицо") = Неопределено) Тогда
	Если НЕ (ЮрФизЛицо.Метаданные().Реквизиты.Найти("ЮридическоеФизическоеЛицо") = Неопределено) Тогда
	// БИТ_ЖКХ 11.01.2016 10:43:33 Конец правки. 
		Сведения.КодПоОКПО = Данные.КодПоОКПО;
		
		// БИТ_ЖКХ 11.01.2016 10:44:01 Начало правки... 
		//Если ЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		Если ЮрФизЛицо.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		// БИТ_ЖКХ 11.01.2016 10:44:04 Конец правки. 	
			
			Сведения.КПП = Данные.КПП;
			
		ИначеЕсли ИмяСправочника = "Организации" Тогда
			
			Сведения.Свидетельство = "свидетельство " + Данные.СвидетельствоСерияНомер + " от " + Формат(Данные.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
			
		КонецЕсли;

	ИначеЕсли ИмяСправочника = "Организации" Тогда
		
		Сведения.КодПоОКПО = Данные.КодПоОКПО;
		Сведения.КПП       = Данные.КПП;
		
	КонецЕсли;
	
	Сведения.Вставить("ПолноеНаименование",          СокрЛП(Данные.ПолноеНаименование));
	Сведения.Вставить("СокращенноеНаименование",     СокрЛП(Данные.СокращенноеНаименование));
	Сведения.Вставить("НаименованиеДляПечатныхФорм", СокрЛП(Данные.НаименованиеДляПечатныхФорм));
	Сведения.Вставить("Представление",               СокрЛП(Данные.Наименование));
	
	Сведения.Вставить("ИНН",              Данные.ИНН);
	Сведения.Вставить("Телефоны",         ПолучитьТелефонИзКонтактнойИнформации(ЮрФизЛицо));
	Сведения.Вставить("НомерСчета",       Данные.НомерСчета);
	Сведения.Вставить("Банк",             Данные.Банк);
	Сведения.Вставить("БИК",              Данные.БИК);
	Сведения.Вставить("АдресБанка",       Данные.АдресБанка);
	Сведения.Вставить("КоррСчет",         Данные.КоррСчет);
	Сведения.Вставить("ЮридическийАдрес", ПолучитьАдресИзКонтактнойИнформации(ЮрФизЛицо, "Юридический"));
	Сведения.Вставить("ФактическийАдрес", ПолучитьАдресИзКонтактнойИнформации(ЮрФизЛицо, "Фактический"));

	Если НЕ ЗначениеЗаполнено(Сведения.ПолноеНаименование) Тогда
		Сведения.ПолноеНаименование = Сведения.Представление;
	КонецЕсли;
	
	Возврат Сведения;

КонецФункции // СведенияОЮрФизЛице()

// Функция находит актуальное значение адреса в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//  ТипАдреса - тип контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного адреса.
//
Функция ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса = "") Экспорт

	ОбъектКонтактнойИнформации = Объект;
	
	Если НЕ ЗначениеЗаполнено(ТипАдреса) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипАдреса="Фактический" Тогда
		Начало = "Факт";
	ИначеЕсли ТипАдреса="Регистрации"
		ИЛИ ТипАдреса="Юридический" Тогда
		Начало = "Юр";
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		
		// БИТ_ЖКХ 11.01.2016 10:39:59 Начало правки... 
		//// БИТ_ЖКХ 12.02.2014{{
		//// Если Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда.
		//Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		//// БИТ_ЖКХ 12.02.2014}}
		// БИТ_ЖКХ 11.01.2016 10:40:03 Конец правки. 
			
			ОбъектКонтактнойИнформации = Объект.ИндивидуальныйПредприниматель;
			
			Окончание = "ФизЛица";
			
		Иначе
			
			Окончание = "Организации";
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Окончание = "Контрагента";
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		
		Окончание = "Проживающего";
		
		
	КонецЕсли;
	
	
	// БИТ_ЖКХ 13.02.2014{{
	// ВидАдреса = Справочники.бит_ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];.
	Если Окончание = "Проживающего" Тогда
		//9.11.2018
//		ВидАдреса = Справочники.бит_ВидыКонтактнойИнформацииЖКХ[Начало+"Адрес"+Окончание];
		ВидАдреса = Справочники.ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];

		// БИТ_ЖКХ 02.04.2014	
	ИначеЕсли Окончание = "Контрагента" Тогда
		
		ВидАдреса = Справочники.ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
		
		Позиция=Найти(Строка(ВидАдреса)," "); 
		НашаСтрока=Лев(Строка(ВидАдреса),Позиция-1);		
		
	Иначе
		
		// БИТ_ЖКХ 27.01.2017 15:38:56 Начало правки... 
		//ВидАдреса = Справочники.ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
		Попытка
			ВидАдреса = Справочники.ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
		Исключение
			ВидАдреса = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
		КонецПопытки;
		// БИТ_ЖКХ 27.01.2017 15:38:59 Конец правки. 
		
	КонецЕсли;
	// БИТ_ЖКХ 13.02.2014}}	
	
	Для каждого ки из ОбъектКонтактнойИнформации.КонтактнаяИнформация Цикл
		
		Если  ки.вид = ВидАдреса Тогда
			
			Представление = ки.Представление;  
			
			// БИТ_ЖКХ 02.04.2014{{	
		ИначеЕсли  Строка(ки.вид) = Строка(НашаСтрока) Тогда
			
			Представление = ки.Представление;  
			
			// БИТ_ЖКХ 02.04.2014}}	
			
		КонецЕсли;
		
	КонецЦикла;   
	
	Возврат Представление;
		
КонецФункции // ПолучитьАдресИзКонтактнойИнформации()

// Функция находит актуальное значение телефона в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного телефона.
//
Функция ПолучитьТелефонИзКонтактнойИнформации(Объект) Экспорт

	ОбъектКонтактнойИнформации = Объект;
	
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Окончание = "Организации";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Окончание = "Контрагента";
	КонецЕсли;
	
	// БИТ_ЖКХ 21.02.2014{{	
	Попытка
		
		ВидТелефона = Справочники.бит_ВидыКонтактнойИнформации["Телефон" + Окончание];
		
	Исключение
		
		ВидТелефона = Справочники.ВидыКонтактнойИнформации["Телефон" + Окончание];
		
	КонецПопытки;
	
	// БИТ_ЖКХ 21.02.2014}}
	
	Факс = "";
	
	Если Окончание = "Организации" Тогда
		
		// БИТ_ЖКХ 21.02.2014{{	
	Попытка
	
	ВидФакса = Справочники.бит_ВидыКонтактнойИнформации["Факс" + Окончание];
	
Исключение
	
	ВидФакса = Справочники.ВидыКонтактнойИнформации["Факс" + Окончание];
	
	КонецПопытки;
	
	// БИТ_ЖКХ 21.02.2014}}
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("Вид"   , ВидФакса);
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И
		|	КонтактнаяИнформация.Тип = &Тип
		|	И
		|	КонтактнаяИнформация.Вид = &Вид
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Факс = ", факс: " + РезультатЗапроса.Выгрузить()[0].Представление;
		КонецЕсли;
	КонецЕсли;

	Для каждого ки из ОбъектКонтактнойИнформации.КонтактнаяИнформация Цикл
		
		Если  ки.вид = ВидТелефона Тогда
			
			Телефон = ки.НомерТелефона;  
			
		КонецЕсли;   
		
	КонецЦикла;   
	
		Возврат Телефон;

КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()

// Функция раскладывает номер телефона, по полям для записи в КИ объекта.
//
// Параметры:
//  
//  НомерТелефона - строка, номер телефона для преобразования.
//
// Возвращаемое значение:
//   Список значений.
//
Функция РазложитьТелефонПоПолям(НомерТелефона) Экспорт

	КодСтраны = "";
	НачалоКодаСтраны = Найти(НомерТелефона, "+");
	Если НачалоКодаСтраны > 0 Тогда
		Для Значение = (НачалоКодаСтраны + 1) По СтрДлина(НомерТелефона) Цикл
			Если Сред(НомерТелефона, Значение, 1) = " " Тогда
				Прервать;
			КонецЕсли; 
			КодСтраны = КодСтраны + Сред(НомерТелефона, Значение, 1);
		КонецЦикла; 
	КонецЕсли; 
	КодСтраны = СокрЛП(КодСтраны);

	КодГорода = "";
	Если СтрЧислоВхождений(НомерТелефона, "(") = 1 И СтрЧислоВхождений(НомерТелефона, ")") = 1 Тогда
		НачалоКодаГорода = Найти(НомерТелефона, "(");
		КонецКодаГорода = Найти(НомерТелефона, ")");
		Если КонецКодаГорода > НачалоКодаГорода Тогда
			КодГорода = Сред(НомерТелефона, (НачалоКодаГорода + 1), (КонецКодаГорода - НачалоКодаГорода - 1));
		КонецЕсли;
	КонецЕсли;
	КодГорода = СокрЛП(КодГорода);

	СамТелефон = НомерТелефона;
	Если НЕ ПустаяСтрока(КодСтраны) Тогда
		СамТелефон = СтрЗаменить(СамТелефон, ("+" + КодСтраны), "");
		СамТелефон = СокрЛП(СамТелефон);
	КонецЕсли; 
	Если НЕ ПустаяСтрока(КодГорода) Тогда
		СамТелефон = СтрЗаменить(СамТелефон, ("(" + КодГорода + ")"), "");
		СамТелефон = СокрЛП(СамТелефон);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(КодСтраны) И Лев(СокрЛ(КодСтраны), 1) <> "+" Тогда
		КодСтраны = СокрЛП(КодСтраны);
		Пока Лев(КодСтраны, 1) = "0" Цикл
			КодСтраны = Сред(КодСтраны, 2);
		КонецЦикла;
		Если НЕ ПустаяСтрока(КодСтраны) Тогда
			КодСтраны = "+" + КодСтраны;
		КонецЕсли; 
	КонецЕсли; 
	
	СтруктураПолейТелефона = Новый Структура("КодСтраны,КодГорода,СамТелефон", КодСтраны, КодГорода, ПривестиНомерТелефонаКШаблону(СамТелефон));
	
	Возврат СтруктураПолейТелефона;

КонецФункции // ()

// Функция приводит телефонный номер к одному из указанных в настройке шаблонов.
//
// Параметры:
//  НомерТЛФ – строка, номер телефона, который надо преобразовывать.
//
// Возвращаемое значение:
//   Приведенный номер – строка, номер, приведенный к одному из шаблонов.
//
Функция ПривестиНомерТелефонаКШаблону(НомерТЛФ) Экспорт
	
	ТолькоЦифрыНомера = "";
	КоличествоЦифрНомера = 0;
	
	Для Значение=1 По СтрДлина(НомерТЛФ) Цикл
		Если СтрЧислоВхождений("1234567890",Сред(НомерТЛФ,Значение,1)) > 0 Тогда
			КоличествоЦифрНомера = КоличествоЦифрНомера + 1;
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТЛФ,Значение,1);
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоЦифрНомера = 0 Тогда
		Возврат НомерТЛФ;
	КонецЕсли;
	
	Возврат НомерТЛФ;
	
	ПриведенныйНомер = "";
	НомерЦифры = 0;
	
КонецФункции // ПривестиКШаблону()

#Если Клиент Тогда

// Процедура по коду адресного элемента возвращает строковые представления его иерархии.
//
Процедура ПолучитьПоКодуАдресногоЭлементаЕгоКомпоненты(КодАдресногоЭлемента, Регион, Район, Город, НаселенныйПункт, Улица, Дом) Экспорт
	
	Элемент = ПолучитьСтруктуруАдресногоЭлемента(КодАдресногоЭлемента);
	
	Если Элемент.ТипАдресногоЭлемента >= 6 Тогда
		Дом = ПолучитьИмяАдресногоЭлементаПоКоду(КодАдресногоЭлемента - КодАдресногоЭлемента%МаскаДома(), 6);
	КонецЕсли;
	
	Если Элемент.ТипАдресногоЭлемента >= 5 Тогда
		Улица = ПолучитьИмяАдресногоЭлементаПоКоду(КодАдресногоЭлемента - КодАдресногоЭлемента%МаскаУлицы(), 5);
	КонецЕсли;
	
	Если Элемент.ТипАдресногоЭлемента >= 4 Тогда
		НаселенныйПункт = ПолучитьИмяАдресногоЭлементаПоКоду(КодАдресногоЭлемента - КодАдресногоЭлемента%МаскаНасПункта(), 4);
	КонецЕсли;

	Если Элемент.ТипАдресногоЭлемента >= 3 Тогда
		Город = ПолучитьИмяАдресногоЭлементаПоКоду(КодАдресногоЭлемента - КодАдресногоЭлемента%МаскаГорода(), 3);
	КонецЕсли;

	Если Элемент.ТипАдресногоЭлемента >= 2 Тогда    
		Район = ПолучитьИмяАдресногоЭлементаПоКоду(КодАдресногоЭлемента - КодАдресногоЭлемента%МаскаРайона(), 2);
	КонецЕсли;

	Если Элемент.ТипАдресногоЭлемента >= 1 Тогда
		Регион = ПолучитьИмяАдресногоЭлементаПоКоду(КодАдресногоЭлемента - КодАдресногоЭлемента%МаскаРегиона(), 1);
	КонецЕсли;	
	
КонецПроцедуры

// Стандартный обработчик "При Изменении" адресного элемента.
//
Процедура АдресныйЭлементПриИзменении(Элемент, Поле1, Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8, 
			ПоследнееЗначениеЭлементаТайпинга) Экспорт
	
	ПоследнееЗначениеЭлементаТайпинга = Элемент.Значение;
	Если ПустаяСтрока(Поле1) Тогда
		Поле1 = ПолучитьИндекс(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8);
	КонецЕсли;
	
КонецПроцедуры

//  Процедура формирует строковое представление адресных элементов - "родителей" переданного в переданных параметрах.
//
// Параметры:
//  Элемент - элемент справочника Адресный классфикатор, для которого надо получить родителей.
//  Регион - строка, куда будет помещено строковое представление "родительского" региона.
//  Район - строка, куда будет помещено строковое представление "родительского" района.
//  Город - строка, куда будет помещено строковое представление "родительского" города.
//  НаселенныйПункт - строка, куда будет помещено строковое представление "родительского" населенного пункта.
//
Процедура АдресныйЭлементЗаполнитьРодителей(Регион, Район, Город, НаселенныйПункт, Элемент) Экспорт

	Если (Элемент.ТипАдресногоЭлемента > 4) И НЕ ЗначениеЗаполнено(НаселенныйПункт) Тогда
		НаселенныйПункт = ПолучитьИмяАдресногоЭлементаПоКоду(Элемент.Код - Элемент.Код%МаскаНасПункта(), 4);
	КонецЕсли;

	Если (Элемент.ТипАдресногоЭлемента > 3) И НЕ ЗначениеЗаполнено(Город) Тогда
		Город = ПолучитьИмяАдресногоЭлементаПоКоду(Элемент.Код - Элемент.Код%МаскаГорода(), 3);
	КонецЕсли;

	Если (Элемент.ТипАдресногоЭлемента > 2) И НЕ ЗначениеЗаполнено(Район) Тогда    
		Район = ПолучитьИмяАдресногоЭлементаПоКоду(Элемент.Код - Элемент.Код%МаскаРайона(), 2);
	КонецЕсли;

	Если (Элемент.ТипАдресногоЭлемента > 1) И НЕ ЗначениеЗаполнено(Регион) Тогда
		Регион = ПолучитьИмяАдресногоЭлементаПоКоду(Элемент.Код - Элемент.Код%МаскаРегиона(), 1);
	КонецЕсли;
		
КонецПроцедуры

// Функция возвращает имя адресного элемента определенного уровня по коду.
//
Функция ПолучитьИмяАдресногоЭлементаПоКоду(КодЭлемента, ТипАдресногоЭлемента) Экспорт
	
	ИмяАдресногоЭлемента = "";
	// Сначала по коду определим уровень элемента, если не совпадет с требуемым, то к БД не обращаемся.
	ТипЭлемента = ПолучитьТипАдресногоЭлемента(КодЭлемента);
	Если  ТипЭлемента <> ТипАдресногоЭлемента Тогда
		Возврат ИмяАдресногоЭлемента;
	КонецЕсли;
	
	АдресныйЭлемент = ПолучитьСтруктуруАдресногоЭлемента(КодЭлемента);
	Если АдресныйЭлемент.ТипАдресногоЭлемента = ТипАдресногоЭлемента Тогда
		ИмяАдресногоЭлемента = ПолучитьНазвание(АдресныйЭлемент);
	КонецЕсли;
	
	Возврат ИмяАдресногоЭлемента;
	
КонецФункции

//  Процедура проверяет правильность заполнения потомков определенного адресного элемента.
//
// Параметры:
//  Элемент - элемент справочника Адресный классфикатор, для которого надо получить родителей.
//  Регион - строка, куда будет помещено строковое представление "родительского" региона.
//  Район - строка, куда будет помещено строковое представление "родительского" района.
//  Город - строка, куда будет помещено строковое представление "родительского" города.
//  НаселенныйПункт - строка, куда будет помещено строковое представление "родительского" населенного пункта.
//
Процедура АдресныйЭлементПроверитьПравильностьЗаполненияПотомков(Регион, Район, Город, НаселенныйПункт, Улица, Элемент) Экспорт
	
	КодЭлемента = Неопределено;
	
	ИмяРегиона = ?(Элемент.ТипАдресногоЭлемента = 1, Элемент.Наименование, Регион);
	ИмяРайона = ?(Элемент.ТипАдресногоЭлемента = 2, Элемент.Наименование, Район);
	ИмяГорода = ?(Элемент.ТипАдресногоЭлемента = 3, Элемент.Наименование, Город);
	ИмяНаселенногоПункта = ?(Элемент.ТипАдресногоЭлемента = 4, Элемент.Наименование, НаселенныйПункт);
	ИмяУлицы = ?(Элемент.ТипАдресногоЭлемента = 5, Элемент.Наименование, Улица);
	
	Если (Элемент.ТипАдресногоЭлемента < 2) И ЗначениеЗаполнено(ИмяРайона) Тогда
		СтруктураОграничений = ПолучитьСтруктуруОграниченийПоАдресу(ИмяРегиона, ИмяРайона, "", "", "", 2);
		СтруктураОграничений.Свойство("КодРайонаВКоде", КодЭлемента);
		Если (КодЭлемента = Неопределено) ИЛИ (КодЭлемента = -1) Тогда
			// Очищаем элемент и все что ниже него по иерархии.
			Район = "";	
			Город = "";
			НаселенныйПункт = "";
			Улица = "";
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если (Элемент.ТипАдресногоЭлемента < 3) И ЗначениеЗаполнено(ИмяГорода) Тогда
		СтруктураОграничений = ПолучитьСтруктуруОграниченийПоАдресу(ИмяРегиона, ИмяРайона, ИмяГорода, "", "", 3);
		СтруктураОграничений.Свойство("КодГородаВКоде", КодЭлемента);
		Если (КодЭлемента = Неопределено) ИЛИ (КодЭлемента = -1)	Тогда
			Город = "";
			НаселенныйПункт = "";
			Улица = "";
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	Если (Элемент.ТипАдресногоЭлемента < 4) И ЗначениеЗаполнено(ИмяНаселенногоПункта) Тогда
		СтруктураОграничений = ПолучитьСтруктуруОграниченийПоАдресу(ИмяРегиона, ИмяРайона, ИмяГорода, ИмяНаселенногоПункта, "", 4);
		СтруктураОграничений.Свойство("КодНаселенногоПунктаВКоде", КодЭлемента);
		Если (КодЭлемента = Неопределено) ИЛИ (КодЭлемента = -1) 	Тогда
			НаселенныйПункт = "";
			Улица = "";
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	Если (Элемент.ТипАдресногоЭлемента < 5) И ЗначениеЗаполнено(ИмяУлицы) Тогда
		СтруктураОграничений = ПолучитьСтруктуруОграниченийПоАдресу(ИмяРегиона, ИмяРайона, ИмяГорода, ИмяНаселенногоПункта, ИмяУлицы, 5);
		СтруктураОграничений.Свойство("КодУлицыВКоде", КодЭлемента);
		Если (КодЭлемента = Неопределено) ИЛИ (КодЭлемента = -1)	Тогда
			Улица = "";	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция по адресу возвращает структуру ограничений.
//
Функция ПолучитьСтруктуруОграниченийПоАдресу(ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, ИмяУлицы, УровеньЭлемента) Экспорт 
	
	Если УровеньЭлемента > 1 Тогда
		
		КодРодителя = Неопределено;
		СтруктураОграничений = ВернутьСтруктуруОграниченийПоРодителю(ПолеРегиона, ПолеРайона, ПолеГорода, ПолеНаселенногоПункта, ИмяУлицы, КодРодителя);
			
	Иначе
		СтруктураОграничений = Новый Структура();
	КонецЕсли;
	СтруктураОграничений.Вставить("ТипАдресногоЭлемента", УровеньЭлемента);
	
	Возврат СтруктураОграничений;
	
КонецФункции

// Функция возвращает строку адресного классификатора по значениям адресных элементов.
//
Функция ВернутьСтрокуАдресногоКлассификатораПоАдреснымЭлементам(Знач НазваниеРегиона, Знач НазваниеРайона, Знач НазваниеГорода, 
											Знач НазваниеНаселенногоПункта, Знач НазваниеУлицы)
											
	РодительскийЭлемент = Неопределено;
	КодРодителяРодителя = 0;

	Регион = ПолучитьАдресныйЭлемент(НазваниеРегиона, 1);
	Если Регион.Код > 0 Тогда
		РодительскийЭлемент = Регион;
		КодРодителяРодителя = Регион.Код;
	КонецЕсли;
	
	Район = ПолучитьАдресныйЭлемент(НазваниеРайона, 2, КодРодителяРодителя);
	Если Район.Код > 0 Тогда
		РодительскийЭлемент = Район;
		КодРодителяРодителя = Район.Код;
	КонецЕсли;
	
	Город = ПолучитьАдресныйЭлемент(НазваниеГорода, 3, КодРодителяРодителя);
    Если Город.Код > 0 Тогда
		РодительскийЭлемент = Город;
		КодРодителяРодителя = Город.Код;
	КонецЕсли;
	
	НаселенныйПункт = ПолучитьАдресныйЭлемент(НазваниеНаселенногоПункта, 4, КодРодителяРодителя);
	Если НаселенныйПункт.Код > 0 Тогда
		РодительскийЭлемент = НаселенныйПункт;
		КодРодителяРодителя = НаселенныйПункт.Код;
	КонецЕсли;
	
	Улица = ПолучитьАдресныйЭлемент(НазваниеУлицы, 5, КодРодителяРодителя);
	Если Улица.Код > 0 Тогда
		РодительскийЭлемент = Улица;
		КодРодителяРодителя = Улица.Код;
	КонецЕсли;
	
	Если РодительскийЭлемент = Неопределено Тогда
		Возврат ПолучитьПустуюСтруктуруАдреса()
	Иначе
		Возврат РодительскийЭлемент;
	КонецЕсли;
										
КонецФункции

// Функция возвращает структуру ограничений по переданным параметрам уже заполненным адресным полям.
//
// Параметры: 
//  НазваниеРегиона - название региона( с сокращением).
//  НазваниеРайона - название района( с сокращением).
//  НазваниеГорода - название города( с сокращением).
//  НазваниеНаселенногоПункта - название населенного пункта( с сокращением).
//
Функция ВернутьСтруктуруОграниченийПоРодителю(Знач НазваниеРегиона, Знач НазваниеРайона, Знач НазваниеГорода, 
											Знач НазваниеНаселенногоПункта, Знач НазваниеУлицы, КодРодителя) Экспорт
	
	СтруктураОграничений = Новый Структура();
	РодительскийЭлемент = ВернутьСтрокуАдресногоКлассификатораПоАдреснымЭлементам(НазваниеРегиона, НазваниеРайона, НазваниеГорода, 
											НазваниеНаселенногоПункта, НазваниеУлицы);
	
	КодРодителя = РодительскийЭлемент.Код;
	
	// По коду определяем уровень элемента.
	ТипЭлемента = ПолучитьТипАдресногоЭлемента(КодРодителя);
	ДобавитьКодВСтруктуру(СтруктураОграничений, "КодРегионаВКоде", Цел(КодРодителя / МаскаРегиона()), ТипЭлемента, 1);
    ДобавитьКодВСтруктуру(СтруктураОграничений, "КодРайонаВКоде", Цел(КодРодителя / МаскаРайона()) % 1000, ТипЭлемента, 2);
	ДобавитьКодВСтруктуру(СтруктураОграничений, "КодГородаВКоде", Цел(КодРодителя / МаскаГорода()) % 1000, ТипЭлемента, 3);
	ДобавитьКодВСтруктуру(СтруктураОграничений, "КодНаселенногоПунктаВКоде", Цел(КодРодителя / МаскаНасПункта()) % 1000, ТипЭлемента, 4);
	ДобавитьКодВСтруктуру(СтруктураОграничений, "КодУлицыВКоде", Цел(КодРодителя / МаскаУлицы())% 10000, ТипЭлемента, 5);
	
	Возврат СтруктураОграничений;
	
КонецФункции

// Процедура добавляет не нулевое значение кода в структуру.
//
Процедура ДобавитьКодВСтруктуру(ДанныеСтруктуры, ИмяЭлемента, КодЭлемента, УровеньРодителя, УровеньЭлемента)
	
	Если (КодЭлемента <> 0) ИЛИ (УровеньРодителя >= УровеньЭлемента) Тогда
		ДанныеСтруктуры.Вставить(ИмяЭлемента, КодЭлемента);
    КонецЕсли;
	
КонецПроцедуры

// Процедура обрабатывает событие ПередНачаломДобавления в форме списка справочника КонтактныеЛицаКонтрагентов.
//
Процедура ПередНачаломДобавленияКонтактногоЛица(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, СправочникСписок, ЭтаФорма) Экспорт

	Если НЕ ЭтоГруппа
	   И НЕ Копирование
	   И ((СправочникСписок.Отбор.ОбъектВладелец.Использование И СправочникСписок.Отбор.ОбъектВладелец.ВидСравнения = ВидСравнения.Равно)
	 ИЛИ (СправочникСписок.Отбор.ВидКонтактногоЛица.Использование И СправочникСписок.Отбор.ВидКонтактногоЛица.ВидСравнения = ВидСравнения.Равно)) Тогда

		Отказ = Истина;

		НовыйОбъект = Справочники.КонтактныеЛица.СоздатьЭлемент();
		Если СправочникСписок.Отбор.ОбъектВладелец.Использование Тогда
			НовыйОбъект.ВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента;
			НовыйОбъект.ОбъектВладелец     = СправочникСписок.Отбор.ОбъектВладелец.Значение;

		Иначе
			НовыйОбъект.ВидКонтактногоЛица = СправочникСписок.Отбор.ВидКонтактногоЛица.Значение;

		КонецЕсли;

		НовыйОбъект.ПолучитьФорму(, ЭтаФорма).Открыть();

	КонецЕсли;

КонецПроцедуры

// Стандартный обработчик "Обработка выбора" адресного элемента.
//
Процедура АдресныйЭлементОбработатьВыбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, АдреснаяЗапись) Экспорт
	
	СтандартнаяОбработка = Ложь;
	АдреснаяЗапись = ПолучитьСтруктуруАдресногоЭлемента(ВыбранноеЗначение.Код);
	Элемент.Значение = СокрЛП(АдреснаяЗапись.Наименование) + " " + СокрЛП(АдреснаяЗапись.Сокращение);
	
КонецПроцедуры

// Процедура открывает форму справочника ВидыКонтактнойИнформации для выбора.
//
// Параметры:
//  РежимВыбора - булево, задает режим выбора для открываемой формы.
//  ВладелецФормы - задает владельца для открываемой формы.
//  ЗначениеОтбораПоТипу - задает значение отбора по типу конт.инф.
//  ЗначениеОтбораПоВидуОбъектаКИ - задает значение отбора по виду объекта конт.инф.
Процедура ОткрытьФормуВыбораВидаКИ(РежимВыбора, ВладелецФормы, ЗначениеОтбораПоТипу = Неопределено,
                                     ЗначениеОтбораПоВидуОбъектаКИ = Неопределено) Экспорт

	ВыбФорма = Справочники.бит_ВидыКонтактнойИнформации.ПолучитьФорму("ФормаВыбораУправляемая", ВладелецФормы);
	ВыбФорма.РежимВыбора = РежимВыбора;
	
	Если ЗначениеОтбораПоТипу <> Неопределено Тогда
		ВыбФорма.Отбор.Тип.Значение = ЗначениеОтбораПоТипу;
		ВыбФорма.Отбор.Тип.Использование = Истина;
		ВыбФорма.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Тип.Доступность = Ложь;
	КонецЕсли; 
	
	Если ЗначениеОтбораПоВидуОбъектаКИ <> Неопределено Тогда
		ВыбФорма.Отбор.ВидОбъектаКонтактнойИнформации.Значение = ЗначениеОтбораПоВидуОбъектаКИ;
		ВыбФорма.Отбор.ВидОбъектаКонтактнойИнформации.Использование = Истина;
		ВыбФорма.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидОбъектаКонтактнойИнформации.Доступность = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы.Значение) = Тип("СправочникСсылка.бит_ВидыКонтактнойИнформации")
	   И ЗначениеЗаполнено(ВладелецФормы.Значение) Тогда
		ВыбФорма.ПараметрТекущаяСтрока = ВладелецФормы.Значение;
	КонецЕсли; 
	
	ВыбФорма.Открыть();
	
КонецПроцедуры

// Функция возвращает представление адреса за пределами РФ без Страны.
//
Функция ПолучитьПредставлениеАдресаЗаПределамиРФБезСтраны(Страна, Представление) Экспорт
	
	Если ЗначениеЗаполнено(Страна) И Страна <> Справочники.СтраныМира.Россия.Наименование Тогда
		
		ИмяСтраны = Страна + ", ";
		ПозицияСтраныВАдресе = Найти(Представление, ИмяСтраны);
		// Если только страна в начале, то удаляем ее, иначе не трогаем.
		Если ПозицияСтраныВАдресе = 1 Тогда
			ТекущееПредставлениеАдреса = Сред(Представление, СтрДлина(ИмяСтраны) + 1);	
		КонецЕсли;
		
	Иначе
		ТекущееПредставлениеАдреса = Представление;
	КонецЕсли;

	Возврат ТекущееПредставлениеАдреса;
	
КонецФункции

// Процедура формирует представление для Адреса за пределами РФ.
//
Функция СформироватьПредставлениеАдресаЗаПределамиРФ(Страна, Представление) Экспорт

	ТекущееПредставлениеАдреса = Представление;	
	
	Если ЗначениеЗаполнено(Страна) И Страна <> Справочники.СтраныМира.Россия.Наименование Тогда
			
		ПозицияСтраныВАдресе = Найти(Представление, Страна);
		// Добавляем страну в самое начало представления, если ее там еще нет.
		Если ПозицияСтраныВАдресе <> 1 Тогда
			ТекущееПредставлениеАдреса = Страна + ", " + Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекущееПредставлениеАдреса;
	
КонецФункции

// Функция возвращает структуру ограничений улицы по городу.
//
Функция СформироватьСтруктуруОграниченийУлицыПоГороду(ИмяГорода) Экспорт
	
	ОбрезанноеИмяГорода = ВРег(ОбрезатьСокращение(ИмяГорода));
	
	Если ОбрезанноеИмяГорода = "МОСКВА" ИЛИ ОбрезанноеИмяГорода = "САНКТ-ПЕТЕРБУРГ" Тогда
		// Это вот и есть исключение.
		СтруктураОграничений = Новый Структура();
		
		КодРегионаВКоде = ?(ОбрезанноеИмяГорода = "МОСКВА", 77, 78);
		СтруктураОграничений.Вставить("КодРегионаВКоде", КодРегионаВКоде);
		СтруктураОграничений.Вставить("КодНаселенногоПунктаВКоде", 0);
		СтруктураОграничений.Вставить("ТипАдресногоЭлемента", 5);
		
	Иначе
		// Ищем только для города.
		СтруктураОграничений = ПолучитьСтруктуруОграниченийПоАдресу("", "", ОбрезанноеИмяГорода, "", "", 5);
		СтруктураОграничений.Вставить("КодНаселенногоПунктаВКоде", 0);
		
	КонецЕсли;

	Возврат СтруктураОграничений;
	
КонецФункции

#КонецЕсли

// Функция создает структуру по строке выборки.
//
Функция СоздатьСтруктуруПоСтрокеВыборки(РезультатЗапроса, СтрокаВыборки)
	
	РезультирующаяСтруктура = Новый Структура;
	ПеренестиСтрокуВыборкиВСтруктуру(РезультатЗапроса, СтрокаВыборки, РезультирующаяСтруктура);
	Возврат РезультирующаяСтруктура; 
	
КонецФункции

#КонецОбласти

#Если Клиент Тогда

#Область РедактированиеКонтактнойИнформацииВДиалоге

// Открыть форму настройки видов контактной информации по объекту.
//
Процедура ОткрытьФормуНастройкиВидовКИ(ВидОбъектаКИ) Экспорт

	Форма = Справочники.бит_ВидыКонтактнойИнформации.ПолучитьФормуСписка("ФормаСпискаУправляемая", , ВидОбъектаКИ);
	Форма.СправочникСписок.Отбор.ВидОбъектаКонтактнойИнформации.Установить(ВидОбъектаКИ);
	Форма.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидОбъектаКонтактнойИнформации.Доступность = Ложь;
	Форма.ЭлементыФормы.СправочникСписок.Колонки.ВидОбъектаКонтактнойИнформации.Видимость = Ложь;
	Форма.СправочникСписок.Порядок.Установить("Порядок,Наименование");
	Форма.Открыть();

КонецПроцедуры

// Отобразить надписи, настроить вид, создать доп. кнопки для элементов связанных с вводом КИ.
//
Процедура ОтобразитьЭлементыВводаКИ(СтруктураДляРедактирования, ТолькоПросмотр) Экспорт

	СтруктураДляРедактирования.ДопКнопки.Очистить();
	
	// Настроим основные поля ввода, кнопки и надписи связанные с контактной информацией.
	ВсегоВидовКИ    = СтруктураДляРедактирования.Настройки.Количество();
	текНомерВидаКИ = 0;
	Для Каждого СтрПоля Из СтруктураДляРедактирования.Элементы Цикл
		
		// Определим какой вид КИ будет отображаться в поле ввода.
		СтрВидаКИ = Неопределено;
		Пока текНомерВидаКИ < ВсегоВидовКИ Цикл
			Стр = СтруктураДляРедактирования.Настройки.Получить(текНомерВидаКИ);
			Если Стр.Вид <> СтруктураДляРедактирования.ВидПрочейКИ Тогда
				СтрВидаКИ = Стр;
				Прервать;
			КонецЕсли;
			
			текНомерВидаКИ = текНомерВидаКИ + 1;
		КонецЦикла;
		текНомерВидаКИ = текНомерВидаКИ + 1;
		СтрПоля.СтрНастройки = СтрВидаКИ;
		
		// Если не нашелся вид КИ то скроем элементы.
		Если СтрВидаКИ = Неопределено Тогда
			Если СтрПоля.Кнопка <> Неопределено Тогда
				СтрПоля.Кнопка.Видимость    = Ложь;
			КонецЕсли;
			СтрПоля.ПолеВвода.Видимость = Ложь;
			СтрПоля.Надпись.Видимость   = Ложь;
			Продолжить;
		КонецЕсли;
		
		СтрПоля.Тип = СтрВидаКИ.Тип;
		
		// Получим прочие виды такого же типа.
		масВидов = ПолучитьПрочиеВидыТакогоЖеТипа(СтруктураДляРедактирования.Настройки, СтрВидаКИ.Тип, СтрВидаКИ.Вид);
		
		// Настроим поле ввода.
		Поле = СтрПоля.ПолеВвода;
		Поле.Видимость            = Истина;
		Поле.КнопкаВыбора         = ЕстьКнопкаВыбораКИ(СтрВидаКИ.Тип);
		Поле.КнопкаОткрытия       = ЕстьКнопкаОткрытияКИ(СтрВидаКИ.Тип);
		Поле.РедактированиеТекста = Не СтрВидаКИ.РедактированиеВДиалоге;
		Поле.ЦветФонаПоля         = ?(СтрВидаКИ.РедактированиеВДиалоге, Новый Цвет(255, 251, 245), ЦветаСтиля.ЦветФонаПоля);
		
		// Картинка для вида КИ.
		Картинка = ПолучитьКартинкуПоТипу(СтрВидаКИ.Тип, СтрВидаКИ.НомерКартинки);
		
		ОтображатьКнопки = СтруктураДляРедактирования.ОтображатьКнопкиВместоНадписей И СтруктураДляРедактирования.ЕстьПолныеПрава;
		
		// Настроим надпись.
		Надпись = СтрПоля.Надпись;
		Если ОтображатьКнопки Тогда
			Надпись.Видимость = Ложь;
		Иначе
			Надпись.Видимость = Истина;
			Надпись.Картинка  = Картинка;
			Надпись.Заголовок = "  " + СтрВидаКИ.Наименование + ":";
		КонецЕсли;
		
		// Настроим кнопку.
		Кнопка = СтрПоля.Кнопка;
		Если Кнопка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Кнопка.Кнопки.Очистить();
		Если Не ОтображатьКнопки Тогда
			Кнопка.Видимость = Ложь;
			Продолжить;
		КонецЕсли;
		
		Кнопка.Видимость = Истина;
		Кнопка.Картинка  = Картинка;
		Кнопка.Заголовок = СтрВидаКИ.Наименование;
		
		// Заполним дополнительные кнопки.
		Для Каждого СтрВида Из СтруктураДляРедактирования.Настройки Цикл
			Если ТипЗнч(СтрВида.Вид) = Тип("Строка") Тогда
				Продолжить;
			ИначеЕсли СтрВида.Вид = СтруктураДляРедактирования.ВидПрочейКИ Тогда
				Продолжить;
			ИначеЕсли СтрВида.Вид = СтрВидаКИ.Вид Тогда
				Продолжить;
			КонецЕсли;
			
			Картинка = ПолучитьКартинкуПоТипу(СтрВида.Тип, СтрВида.НомерКартинки);
			ДобавитьДополнительнуюКнопку(Кнопка.Кнопки, СтруктураДляРедактирования, Кнопка, СтрВида.Вид, СтрВидаКИ.Вид, СтрВида.Наименование, СтруктураДляРедактирования.ОбработчикДляДопКнопок, Картинка, 1);
		КонецЦикла;
		
		// Разделитель.
		Кнопка.Кнопки.Добавить(, ТипКнопкиКоманднойПанели.Разделитель);
		
		// Кнопка Добавить.
		ДобавитьДополнительнуюКнопку(Кнопка.Кнопки, СтруктураДляРедактирования, Кнопка, Неопределено, СтрВидаКИ.Вид, "Добавить новый вид контактной информации", СтруктураДляРедактирования.ОбработчикДляДопКнопок, БиблиотекаКартинок.КИДобавить, 2);
		
		// Кнопка Скопировать.
		Если масВидов.Количество() > 0 И Не ТолькоПросмотр Тогда
			ДобавитьДополнительнуюКнопку(Кнопка.Кнопки, СтруктураДляРедактирования, Кнопка, Неопределено, СтрВидаКИ.Вид, "Скопировать из ...", СтруктураДляРедактирования.ОбработчикДляДопКнопок, Картинка, 3);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура дополняет дополнительную кнопку на полле ввода.
//
Процедура ДобавитьДополнительнуюКнопку(Кнопки, СтруктураДляРедактирования, КнопкаВладелец, Вид, ВидВладельца, ТекстКнопки, Обработчик, Картинка, ТипДействия)

	новКнопка = Кнопки.Добавить(, ТипКнопкиКоманднойПанели.Действие, ТекстКнопки, Обработчик);
	Если Картинка <> Неопределено Тогда
		новКнопка.Картинка = Картинка;
	КонецЕсли;
	
	новСтр = СтруктураДляРедактирования.ДопКнопки.Добавить();
	новСтр.Кнопка         = новКнопка;
	новСтр.КнопкаВладелец = КнопкаВладелец;
	новСтр.Вид            = Вид;
	новСтр.ВидВладельца   = ВидВладельца;
	новСтр.ТипДействия    = ТипДействия;

КонецПроцедуры

// Заполнить значения полей ввода на основной форме и установить картинку в надписи "Прочая КИ".
//
Процедура ЗаполнитьЗначенияКИ(СтруктураДляРедактирования) Экспорт
	// Очистим сначала все поля ввода.
	Для Каждого Стр из СтруктураДляРедактирования.Элементы Цикл
		Стр.ПолеВвода.Значение = "";
	КонецЦикла;
	
	Если СтруктураДляРедактирования.ПолеВводаПрочейКИ <> Неопределено Тогда
		СтруктураДляРедактирования.ПолеВводаПрочейКИ.Значение = "";
	КонецЕсли;
	
	КолвоПрочейКИ = 0;
	Для Каждого Запись Из СтруктураДляРедактирования.НаборКонтактнойИнформации Цикл
		Если Не ПустаяСтрока(Запись.Представление) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Вид", Запись.Вид);
			Отбор.Вставить("Тип", Запись.Тип);
			Строки = СтруктураДляРедактирования.Настройки.НайтиСтроки(Отбор);
			Если Строки.Количество()=0 Тогда
				КолвоПрочейКИ = КолвоПрочейКИ + 1;
				Продолжить;
			КонецЕсли;
			
			Стр = СтруктураДляРедактирования.Элементы.Найти(Строки[0], "СтрНастройки");
			Если Стр<>Неопределено Тогда
				Стр.ПолеВвода.Значение = Запись.Представление;
			Иначе
				Если Запись.Вид = СтруктураДляРедактирования.ВидПрочейКИ Тогда
					Если СтруктураДляРедактирования.ПолеВводаПрочейКИ <> Неопределено Тогда
						СтруктураДляРедактирования.ПолеВводаПрочейКИ.Значение = Запись.Представление;
					КонецЕсли;
				Иначе
					КолвоПрочейКИ = КолвоПрочейКИ + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураДляРедактирования.НадписьПрочаяКИ <> Неопределено Тогда
		СтруктураДляРедактирования.НадписьПрочаяКИ.Заголовок = "Прочая контактная информация (" + ?(КолвоПрочейКИ = 0, "пусто", КолвоПрочейКИ) + ")";
	КонецЕсли;

КонецПроцедуры

// Проверить необходимость скопировать введенные данные в другой вид КИ.
//
Процедура ПроверитьНеобходимостьКопированияКИ(Запись, СтруктураДляРедактирования, ТабЗнКИ) Экспорт

	Если (Запись = Неопределено) ИЛИ ПустаяСтрока(Запись.Представление) Тогда
		Возврат;
	КонецЕсли;
	
	// Найдем виды в которые нужно скопировать.
	СтрЗамены = СтруктураДляРедактирования.Замены.Найти(Запись.Вид, "Вид1");
	Если СтрЗамены = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Найдем запись которую надо заменять.
	ЗаписьЗаменяемого = Неопределено;
	Для Каждого ЗаписьПоиска Из СтруктураДляРедактирования.НаборКонтактнойИнформации Цикл
		Если ЗаписьПоиска.Вид = СтрЗамены.Вид2 Тогда
			ЗаписьЗаменяемого = ЗаписьПоиска;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если (ЗаписьЗаменяемого = Неопределено) ИЛИ (Запись.Представление = ЗаписьЗаменяемого.Представление) ИЛИ Не ПустаяСтрока(ЗаписьЗаменяемого.Представление) Тогда
		Возврат;
	КонецЕсли;
	
	// Спросим, нужно ли заменять.
	// СтрВопроса = "Скопировать """ + Запись.Вид + """ в """ + СтрЗамены.Вид2 + """?";.
	СтрВопроса = "Изменился " + Запись.Вид.Наименование + ".
	|Автоматически изменить " + СтрЗамены.Вид2.Наименование + "?";
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьНеобходимостьКопированияКИЗавершение", бит_УправлениеКонтактнойИнформацией, Новый Структура("Запись, ЗаписьЗаменяемого, СтрЗамены, СтруктураДляРедактирования, ТабЗнКИ", Запись, ЗаписьЗаменяемого, СтрЗамены, СтруктураДляРедактирования, ТабЗнКИ)), СтрВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

Процедура ПроверитьНеобходимостьКопированияКИЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Запись = ДополнительныеПараметры.Запись;
    ЗаписьЗаменяемого = ДополнительныеПараметры.ЗаписьЗаменяемого;
    СтрЗамены = ДополнительныеПараметры.СтрЗамены;
    СтруктураДляРедактирования = ДополнительныеПараметры.СтруктураДляРедактирования;
    ТабЗнКИ = ДополнительныеПараметры.ТабЗнКИ;
    
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    // Запишем новые данные.
    СкопироватьДанныеКИИзЗаписиВДругую(Запись, ЗаписьЗаменяемого);
    
    // Заменим значение на основной форме.
    СтрНастройки = СтруктураДляРедактирования.Настройки.Найти(СтрЗамены.Вид2, "Вид");
    Если СтрНастройки <> Неопределено Тогда
        СтрЭл = СтруктураДляРедактирования.Элементы.Найти(СтрНастройки, "СтрНастройки");
        Если СтрЭл <> Неопределено Тогда
            СтрЭл.ПолеВвода.Значение = Запись.Представление;
        КонецЕсли;
    КонецЕсли;
    
    // Проверим, нужно ли менять в таблице значений.
    Если ТабЗнКИ <> Неопределено Тогда
        СтрКИ = ТабЗнКИ.Найти(СтрЗамены.Вид2, "Вид");
        Если СтрКИ <> Неопределено Тогда
            СтрКИ.Представление = Запись.Представление;
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// При изменении значения в поле ввода.
//
Процедура ПолеВводаКИПриИзменении(СтруктураДляРедактирования, Элемент) Экспорт

	СтрокаЭлемента = СтруктураДляРедактирования.Элементы.Найти(Элемент, "ПолеВвода");
	Если СтрокаЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись = ПолучитьЗаписьВНаборе(СтруктураДляРедактирования.НаборКонтактнойИнформации, СтрокаЭлемента.СтрНастройки.Вид, СтрокаЭлемента.Тип);
	Если Запись = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНеобходимостьКопированияКИ(Запись, СтруктураДляРедактирования, Неопределено);

КонецПроцедуры

// При нажатии кнопки открытие в поле ввода.
//
Процедура ПолеВводаКИОткрытие(СтруктураДляРедактирования, Элемент, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// При очистке в поле ввода.
//
Процедура ПолеВводаКИОчистка(СтруктураДляРедактирования, Элемент, СтандартнаяОбработка) Экспорт
	
	// Если не изменить текущий элемент, то после очистки адреса будет открываться форма.
	СтруктураДляРедактирования.ТекущийЭлемент = Элемент;
	
КонецПроцедуры

// При изменении значения в поле ввода прочей КИ.
//
Процедура ПолеВводаПрочаяКИПриИзменении(СтруктураДляРедактирования, Элемент) Экспорт

	Запись = ПолучитьЗаписьВНаборе(СтруктураДляРедактирования.НаборКонтактнойИнформации, СтруктураДляРедактирования.ВидПрочейКИ, Перечисления.бит_ТипыКонтактнойИнформации.Другое);
	Если Запись <> Неопределено Тогда
		Запись.Представление = Элемент.Значение;
	КонецЕсли;

КонецПроцедуры

// Процедура выполняет копирование КИ в диалоге.
//
Процедура КонтекстноеМенюПолейВводаПрочейКИСкопироватьИз(СтруктураДляРедактирования, ЭтаФорма) Экспорт

	ПолеВвода = ЭтаФорма.ТекущийЭлемент;
	СтрЭлемента = СтруктураДляРедактирования.Элементы.Найти(ПолеВвода, "ПолеВвода");
	
	Если СтрЭлемента <> Неопределено Тогда
		ВыполнитьКопированиеКИВДиалоге(СтруктураДляРедактирования, ЭтаФорма, СтрЭлемента.СтрНастройки.Тип, СтрЭлемента.СтрНастройки.Вид);
	КонецЕсли;

КонецПроцедуры

// Процедура открытия формы справочника.
//
Процедура РедактированиеНастроекОтображенияКИНажатие(СтруктураДляРедактирования, ЭтаФорма, КоличествоПолейВводаНаФорме) Экспорт

	ВидОбъекта = СтруктураДляРедактирования.ВидОбъекта;
	Форма = Справочники.бит_ВидыКонтактнойИнформации.ПолучитьФорму("ФормаСпискаУправляемая",,ВидОбъекта);
	Форма.СправочникСписок.Отбор.ВидОбъектаКонтактнойИнформации.Установить(ВидОбъекта);
	Форма.СправочникСписок.Порядок.Установить("Порядок");
	Форма.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидОбъектаКонтактнойИнформации.Доступность = Ложь;
	Форма.ЭлементыФормы.СправочникСписок.Колонки.ВидОбъектаКонтактнойИнформации.Видимость = Ложь;
	Форма.ЭлементыФормы.СправочникСписок.Колонки.Код.Видимость = Ложь;
	Форма.Показать(Новый ОписаниеОповещения("РедактированиеНастроекОтображенияКИНажатиеЗавершение", бит_УправлениеКонтактнойИнформацией, Новый Структура("ВидОбъекта, СтруктураДляРедактирования, ЭтаФорма", ВидОбъекта, СтруктураДляРедактирования, ЭтаФорма)));

КонецПроцедуры

Процедура РедактированиеНастроекОтображенияКИНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВидОбъекта = ДополнительныеПараметры.ВидОбъекта;
    СтруктураДляРедактирования = ДополнительныеПараметры.СтруктураДляРедактирования;
    ЭтаФорма = ДополнительныеПараметры.ЭтаФорма;
    
    
    СтруктураДляРедактирования.Настройки = ПолучитьНастройкиОтображенияКонтактнойИнформации(ВидОбъекта);
    ОтобразитьЭлементыВводаКИ(СтруктураДляРедактирования, ЭтаФорма.ТолькоПросмотр);
    ЗаполнитьЗначенияКИ(СтруктураДляРедактирования);

КонецПроцедуры

#КонецОбласти

#Область РаботаСоСтруктуройРедактирования

// Подготовить структуру хранящую данные для отображения контактной информации на форме элемента.
//
Функция ПодготовитьСтруктуруДляОтображенияКИ(ВидОбъекта, ОбработчикДляДопКнопок, НаборКонтактнойИнформации, ОсновнаяПанельФормы, СтраницаКИ, НадписьПрочаяКИ, ПолеВводаПрочейКИ, ВидПрочейКИ, КнопкаРедактированияНастроек, ОтображатьКнопкиВместоНадписей) Экспорт

	Стр = Новый Структура;
	Стр.Вставить("ОбработчикДляДопКнопок",         ОбработчикДляДопКнопок);
	Стр.Вставить("НадписьПрочаяКИ",                НадписьПрочаяКИ);
	Стр.Вставить("ПолеВводаПрочейКИ",              ПолеВводаПрочейКИ);
	Стр.Вставить("ВидПрочейКИ",                    ВидПрочейКИ);
	Стр.Вставить("ТекущийЭлемент",                 Неопределено);
	Стр.Вставить("НаборКонтактнойИнформации",      НаборКонтактнойИнформации);
	Стр.Вставить("ВидОбъекта",                     ВидОбъекта);
	Стр.Вставить("ОткрытаФормаРедактирования",     Ложь);
	Стр.Вставить("ОсновнаяПанельФормы",            ОсновнаяПанельФормы);
	Стр.Вставить("СтраницаКИ",                     СтраницаКИ);
	Стр.Вставить("ТекущаяСтраница",                ?(ОсновнаяПанельФормы = Неопределено, Неопределено, ОсновнаяПанельФормы.ТекущаяСтраница));
	Стр.Вставить("Настройки",                      ПолучитьНастройкиОтображенияКонтактнойИнформации(ВидОбъекта));
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Стр.Вставить("ЕстьПолныеПрава",                РольДоступна("ПолныеПрава"));
	Стр.Вставить("ОтображатьКнопкиВместоНадписей", ОтображатьКнопкиВместоНадписей);
	
	Если КнопкаРедактированияНастроек <> Неопределено Тогда
		КнопкаРедактированияНастроек.Видимость = Стр.ЕстьПолныеПрава;
	КонецЕсли;
	
	Элементы = Новый ТаблицаЗначений;
	Элементы.Колонки.Добавить("Кнопка");
	Элементы.Колонки.Добавить("ПолеВвода");
	Элементы.Колонки.Добавить("Надпись");
	Элементы.Колонки.Добавить("Тип");
	Элементы.Колонки.Добавить("СтрНастройки");
	Стр.Вставить("Элементы", Элементы);
	
	ДопКнопки = Новый ТаблицаЗначений;
	ДопКнопки.Колонки.Добавить("Кнопка");
	ДопКнопки.Колонки.Добавить("КнопкаВладелец");
	ДопКнопки.Колонки.Добавить("Вид");
	ДопКнопки.Колонки.Добавить("ВидВладельца");
	ДопКнопки.Колонки.Добавить("ТипДействия"); // 1 - сменить вид, 2 - добавить новый вид, 3 - скопировать, 4 - настройка видок КИ.
	Стр.Вставить("ДопКнопки", ДопКнопки);
	
	Замены = Новый ТаблицаЗначений;
	Замены.Колонки.Добавить("Вид1");
	Замены.Колонки.Добавить("Вид2");
	
	ЗаполнитьЗаменыПоВидуОбъекта(Замены, ВидОбъекта);
	
	Стр.Вставить("Замены", Замены);
	
	Возврат Стр;

КонецФункции // ПодготовитьСтруктуруДляОтображенияКИ()

// Очистить структуру для редактирования контактной информации.
//
Процедура ОчиститьСтруктуруРедактированияКИ(СтруктураДляРедактирования) Экспорт

	СтруктураДляРедактирования = Неопределено;

КонецПроцедуры

// Заполнить замены в контактной информации производимые для вида объекта.
//
Процедура ЗаполнитьЗаменыПоВидуОбъекта(Замены, ВидОбъекта)

	// БИТ_ЖКХ 15.09.2014
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектовКонтактнойИнформации.Организации Тогда
		ДобавитьЗамену(Замены, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Истина);
	КонецЕсли;
	// БИТ_ЖКХ 15.09.2014

КонецПроцедуры

// Добавить запись в таблицу замен.
//
Процедура ДобавитьЗамену(Замены, Вид1, Вид2, ВОбеСтороны)

	новСтр = Замены.Добавить();
	новСтр.Вид1 = Вид1;
	новСтр.Вид2 = Вид2;
	
	Если ВОбеСтороны Тогда
		новСтр = Замены.Добавить();
		новСтр.Вид1 = Вид2;
		новСтр.Вид2 = Вид1;
	КонецЕсли;
	
КонецПроцедуры

// В структуру для отображения добавить кнопку и поле ввода.
//
Процедура ДобавитьКнопкуИПоле(СтруктураДляОтображения, Надпись, Кнопка, ПолеВВода) Экспорт

	новСтр = СтруктураДляОтображения.Элементы.Добавить();
	новСтр.Надпись   = Надпись;
	новСтр.Кнопка    = Кнопка;
	новСтр.ПолеВвода = ПолеВВода;

КонецПроцедуры

// Редактируется ли вид контактной информации в основной форме.
//
Функция ВидРедактируетсяВОсновнойФорме(СтруктураДляРедактирования, Вид) Экспорт

	СтрНастройки = СтруктураДляРедактирования.Настройки.Найти(Вид, "Вид");
	Если СтрНастройки = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли СтруктураДляРедактирования.Элементы.Найти(СтрНастройки, "СтрНастройки") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ВидРедактируетсяВОсновнойФорме()

// Редактируется ли вид контактной информации в диалоге.
//
Функция ВидРедактируетсяВДиалоге(СтруктураДляРедактирования, Вид) Экспорт

	СтрНастройки = СтруктураДляРедактирования.Настройки.Найти(Вид, "Вид");
	Если СтрНастройки = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат СтрНастройки.РедактированиеВДиалоге;
	КонецЕсли;

КонецФункции // ВидРедактируетсяВДиалоге()

#КонецОбласти

#Область ВспомогательныеФункции

// Получить виды контактной информации такого же типа.
//
Функция ПолучитьПрочиеВидыТакогоЖеТипа(Настройки, Тип, Вид)

	масВидов = Новый Массив;
	
	Для Каждого Стр Из Настройки Цикл
		Если (Стр.Тип = Тип) И (Стр.Вид <> Вид) Тогда
			масВидов.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Возврат масВидов;

КонецФункции // ПолучитьПрочиеВидыТакогоЖеТипа()

// Есть ли кнопка выбора у поля ввода.
//
Функция ЕстьКнопкаВыбораКИ(Тип)

	Если Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ЕстьКнопкаВыбораКИ()

// Есть ли кнопка открытия у поля ввода.
//
Функция ЕстьКнопкаОткрытияКИ(Тип)

	Если Тип = Перечисления.бит_ТипыКонтактнойИнформации.ВебСтраница Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ЕстьКнопкаОткрытияКИ()

// Получить картинку для отображения типа.
//
Функция ПолучитьКартинкуПоТипу(Тип, НомерКартинки = 0) Экспорт

	Если НомерКартинки = 1 Тогда
		Возврат БиблиотекаКартинок.КИФакс;
		
	ИначеЕсли НомерКартинки = 2 Тогда
		Возврат БиблиотекаКартинок.КИАдресИМНС;
	
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес Тогда
		Возврат БиблиотекаКартинок.КИАдрес;
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Возврат БиблиотекаКартинок.КИEmail;
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.ВебСтраница Тогда
		Возврат БиблиотекаКартинок.КИWWW;
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.Телефон Тогда
		Возврат БиблиотекаКартинок.КИТелефон;
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.Другое Тогда
		Возврат БиблиотекаКартинок.ПрочаяКонтактнаяИнформация;
		
	Иначе
		Возврат Новый Картинка;
	КонецЕсли;

КонецФункции // ПолучитьКартинкуПоТипу()

// Выполнить копирование записи контактной информации.
//
Процедура ВыполнитьКопированиеКИВДиалоге(СтруктураДляРедактирования, ЭтаФорма, Тип, Вид)

	масВидов = ПолучитьПрочиеВидыТакогоЖеТипа(СтруктураДляРедактирования.Настройки, Тип, Вид);
	колВидов = масВидов.Количество();
	Если колВидов = 0 Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыполнитьКопированиеКИВДиалогеЗавершение1", бит_УправлениеКонтактнойИнформацией), "Нет других видов контактной информации этого же типа!");
		Возврат;
	КонецЕсли;
	
	спсВидов = Новый СписокЗначений;
	Для Каждого стрВида Из масВидов Цикл
		спсВидов.Добавить(стрВида.Вид);
	КонецЦикла;
	
	выбрВид = Неопределено;

	
	спсВидов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыполнитьКопированиеКИВДиалогеЗавершение", бит_УправлениеКонтактнойИнформацией, Новый Структура("Вид, СтруктураДляРедактирования, Тип, ЭтаФорма", Вид, СтруктураДляРедактирования, Тип, ЭтаФорма)), "Откуда скопировать");

КонецПроцедуры

Процедура ВыполнитьКопированиеКИВДиалогеЗавершение1(ДополнительныеПараметры) Экспорт
    
	Завершение = Истина;  

КонецПроцедуры

Процедура ВыполнитьКопированиеКИВДиалогеЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Вид = ДополнительныеПараметры.Вид;
    СтруктураДляРедактирования = ДополнительныеПараметры.СтруктураДляРедактирования;
    Тип = ДополнительныеПараметры.Тип;
    ЭтаФорма = ДополнительныеПараметры.ЭтаФорма;
    
    выбрВид = ВыбранныйЭлемент;
    Если выбрВид = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Запись1 = ПолучитьЗаписьВНаборе(СтруктураДляРедактирования.НаборКонтактнойИнформации, Вид,              Тип);
    Запись2 = ПолучитьЗаписьВНаборе(СтруктураДляРедактирования.НаборКонтактнойИнформации, выбрВид.Значение, Тип);
    Если Запись1=Неопределено ИЛИ Запись2=Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    СкопироватьДанныеКИИзЗаписиВДругую(Запись2, Запись1);
    
    ЗаполнитьЗначенияКИ(СтруктураДляРедактирования);
    ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры // ВыполнитьКопированиеКИВДиалоге()

#КонецОбласти

#Область РаботаСНаборомЗаписейКонтактнойИнформации

// Очистить поля хранящие контактную информацию в записи из набора.
//
Процедура ОчиститьЗаписьКонтактнойИнформации(Запись) Экспорт

	Если Запись = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Представление = "";
	Запись.Комментарий   = "";
	Запись.Поле1 = "";
	Запись.Поле2 = "";
	Запись.Поле3 = "";
	Запись.Поле4 = "";
	Запись.Поле5 = "";
	Запись.Поле6 = "";
	Запись.Поле7 = "";
	Запись.Поле8 = "";
	Запись.Поле9 = "";
	Запись.Поле10= "";
	Запись.ТипДома     = Неопределено;
	Запись.ТипКорпуса  = Неопределено;
	Запись.ТипКвартиры = Неопределено;

КонецПроцедуры

// Скопировать данные из одной записи в другую.
//
Процедура СкопироватьДанныеКИИзЗаписиВДругую(Откуда, Куда) Экспорт

	Куда.Представление = Откуда.Представление;
	Куда.Поле1         = Откуда.Поле1;
	Куда.Поле2         = Откуда.Поле2;
	Куда.Поле3         = Откуда.Поле3;
	Куда.Поле4         = Откуда.Поле4;
	Куда.Поле5         = Откуда.Поле5;
	Куда.Поле6         = Откуда.Поле6;
	Куда.Поле7         = Откуда.Поле7;
	Куда.Поле8         = Откуда.Поле8;
	Куда.Поле9         = Откуда.Поле9;
	Куда.Поле10        = Откуда.Поле10;
	Куда.ТипДома       = Откуда.ТипДома;
	Куда.ТипКорпуса    = Откуда.ТипКорпуса;
	Куда.ТипКвартиры   = Откуда.ТипКвартиры;
	Куда.Комментарий   = Откуда.Комментарий;

КонецПроцедуры

// Получить запись в наборе записей по типу и виду.
//
Функция ПолучитьЗаписьВНаборе(Набор, Вид, Тип) Экспорт

	Для Каждого Запись Из Набор Цикл
		
		Если (Запись.Тип = Тип) И (Запись.Вид = Вид) Тогда
			Возврат Запись;
		КонецЕсли;
		
	КонецЦикла;
	
	Запись = Набор.Добавить();
	Запись.Вид = Вид;
	Запись.Тип = Тип;
	
	Возврат Запись;

КонецФункции // ПолучитьЗаписьВНаборе()

#КонецОбласти

#Область РаботаСНастройкамиОтображенияКИ

// Получить настройки для редактирования контактной информации.
//
Функция ПолучитьНастройкиОтображенияКонтактнойИнформации(ВидОбъекта)

	ТЗ = "ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|	ВидыКонтактнойИнформации.Наименование КАК Наименование,
	|	ВидыКонтактнойИнформации.Тип КАК Тип,
	|	ВидыКонтактнойИнформации.РедактированиеВДиалоге,
	|	ВидыКонтактнойИнформации.МожноРедактироватьТолькоВДиалоге,
	|	ВидыКонтактнойИнформации.НомерКартинки,
	|	ВидыКонтактнойИнформации.Порядок КАК Порядок
	|ИЗ
	|	Справочник.бит_ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Тип,
	|	Наименование";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТЗ;
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъекта);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьНастройкиПоУмолчанию()

#КонецОбласти

#КонецЕсли