
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Элемент Из Параметры.Отбор Цикл
		СписокОбязательныхОтборов.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Если ТипЗнч(Параметры.ДополнительныеОтборы) = Тип("Структура") Тогда
		
		Для каждого Элемент Из Параметры.ДополнительныеОтборы Цикл
			
			ЭлементОтбора = Элемент.Значение;
			
			бит_ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, ЭлементОтбора.ИмяПоля, ЭлементОтбора.ПравоеЗначение, ЭлементОтбора.Использование, ЭлементОтбора.ВидСравнения);
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Дата = КонецДня(ТекущаяДата());
	
	Если ЗначениеЗаполнено(Параметры.Дата) Тогда
		Дата = Параметры.Дата;
	КонецЕсли; 
	
	Список.Параметры.УстановитьЗначениеПараметра("Период"     , Дата);
	Список.Параметры.УстановитьЗначениеПараметра("ТипСчетчика", Параметры.ТипСчетчика);
	
	Если Параметры.ОбъектУчета.Пустая() Тогда
		Если Параметры.СписокОбъектовУчета.Количество() > 0 Тогда
			Если Параметры.ЭтоСписокЗданий Тогда
				Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И Объект = &Объект", "И Объект.Здание В (&СписокОбъектовУчета)");
			Иначе
				Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И Объект = &Объект", "И Объект В (&СписокОбъектовУчета)");
			КонецЕсли; 
			
			Список.Параметры.УстановитьЗначениеПараметра("СписокОбъектовУчета", Параметры.СписокОбъектовУчета);
		Иначе
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И Объект = &Объект", "");
		КонецЕсли; 
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Объект", Параметры.ОбъектУчета);
	КонецЕсли;
	
	Если Параметры.Свойство("Многотарифный") Тогда
		Услуовие = "И " + ?(Параметры.Многотарифный,"","НЕ") + " Многотарифный";
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И ИСТИНА", Услуовие);
	КонецЕсли; 
	
	Если НЕ Параметры.Установлен Тогда
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "бит_Счетчики.Ссылка В", "НЕ бит_Счетчики.Ссылка В");
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ИмяОтбора Из СписокОбязательныхОтборов Цикл
		Для Каждого Элемент Из ЭтаФорма.Список.Отбор.Элементы Цикл
			Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора) Тогда
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти