
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаборЗаписей.Очистить();
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГражданствоФизЛицСрезПоследних.Период,
		|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
		|	ГражданствоФизЛицСрезПоследних.Страна
		|ИЗ
		|	РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.Ключ.ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаПроживающие") Тогда
		
		НаборЗаписей.Очистить();
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГражданствоФизЛицСрезПоследних.Период,
		|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
		|	ГражданствоФизЛицСрезПоследних.Страна
		|ИЗ
		|	РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ЗаписьИзНабора = НаборЗаписей.Добавить();
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("ФизЛицо") Тогда
				
				ЗаписьИзНабора.ФизЛицо = Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо;
				
			КонецЕсли;
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("Период") Тогда
				
				ЗаписьИзНабора.Период = Параметры.ЗаполнитьИзСправочникаПроживающие.Период;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьИзНабора = НаборЗаписей[0];
	
	Период  = ?(НЕ ЗначениеЗаполнено(ЗаписьИзНабора.Период), '19000101', ЗаписьИзНабора.Период);
	Страна  = ЗаписьИзНабора.Страна;
	ФизЛицо	= ЗаписьИзНабора.Физлицо;
	
	Если ФизЛицо = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка") Тогда
		
		Элементы.История.Видимость = Ложь;
		
	КонецЕсли;
	
	НеИмеетПравоНаПенсиюПриОткрытии = НеИмеетПравоНаПенсию;
	НеЯвляетсяНалоговымРезидентомРФПриОткрытии = НеЯвляетсяНалоговымРезидентомРФ;
	СтранаПриОткрытии = Страна;
	ФизЛицоПриОткрытии = ФизЛицо;
	ПериодПриОткрытии = Период;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьИзменения();
		
	Закрыть();
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "Гражданство"), ФизЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор          = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", ФизЛицо);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.бит_ГражданствоПроживающих.Форма.ФормаСпискаУправляемая", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзменения()
	
	Набор = РегистрыСведений.бит_ГражданствоПроживающих.СоздатьНаборЗаписей();
	Набор.Отбор.ФизЛицо.Установить(ФизЛицо);
	Набор.Прочитать();
	
	// Если что-то поменяли тогда запишем. 
	Если НеИмеетПравоНаПенсиюПриОткрытии <> НеИмеетПравоНаПенсию ИЛИ
		НеЯвляетсяНалоговымРезидентомРФПриОткрытии <> НеЯвляетсяНалоговымРезидентомРФ ИЛИ
		ПериодПриОткрытии <> Период ИЛИ
		СтранаПриОткрытии <> Страна Тогда
 
    Если Набор.Количество() = 0 Тогда
        НовыйНабор = Набор.Добавить();
        НовыйНабор.Период = ТекущаяДата();
	ИначеЕсли Набор.Количество() > 0 и Период <> ПериодПриОткрытии Тогда
        НовыйНабор = Набор.Добавить();
		
        НовыйНабор.Период = Период;
	Иначе 
		
		Для каждого Строка из Набор Цикл
			
			Если Строка.Период = Период Тогда
				
				НовыйНабор = Строка;
				
			КонецЕсли;
			
		КонецЦикла;
		
    КонецЕсли;
 
	НовыйНабор.НеИмеетПравоНаПенсию            = НеИмеетПравоНаПенсию;
	НовыйНабор.НеЯвляетсяНалоговымРезидентомРФ = НеЯвляетсяНалоговымРезидентомРФ;
	НовыйНабор.Страна                          = Страна;
	
	НовыйНабор.ФизЛицо                         = ФизЛицо;
	Набор.Записать();
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти