#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Функция ПодготовитьПредупреждения(Ссылка) Экспорт
	
	СоответствиеЛС = Новый Соответствие();
	
	ДанныеДокумента =  ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Дата,Организация,СрокПогашения,ДатаРасчета");
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ВыводитьСуммуБезУчетаПереплатПоУслугам", Ложь);
	ПараметрыЖКХ.Вставить("ВключатьВРасчетСуммыДолгаПени"         , Ложь);
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(ДанныеДокумента.Дата, ДанныеДокумента.Организация, ПараметрыЖКХ);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.бит_Предупреждение.Предупреждение");
	
	Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
	
	СтруктураПечати = Новый Структура();
	СтруктураПечати.Вставить("Организация"          ,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Организация, "Наименование"));
	СтруктураПечати.Вставить("ФИОРуководителя"      ,Руководители.Руководитель);
	СтруктураПечати.Вставить("ДолжностьРуководителя",Руководители.РуководительДолжность);
	СтруктураПечати.Вставить("СрокПогашения"        ,Формат(ДанныеДокумента.СрокПогашения, "ДФ='dd MMMM yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(ДанныеДокумента.ДатаРасчета) Тогда
		ДатаПросмотра = ДанныеДокумента.ДатаРасчета;
	Иначе
		ДатаПросмотра = ДанныеДокумента.Дата;
	КонецЕсли;
	
	СтруктураПечати.Вставить("ДатаПросмотра", Формат(ДатаПросмотра, "ДФ='dd MMMM yyyy ""г.""'"));
	
	ФормСтрока  = "Л = ru_RU; ДП = Истина";
	ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПредупреждениеЛицевыеСчета.Ссылка КАК Ссылка,
	|	бит_ПредупреждениеЛицевыеСчета.НомерСтроки КАК НомерСтроки,
	|	бит_ПредупреждениеЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПредупреждениеЛицевыеСчета.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	бит_ПредупреждениеЛицевыеСчета.Сумма КАК Сумма,
	|	бит_ПредупреждениеЛицевыеСчета.СуммаБезПереплат КАК СуммаБезПереплат,
	|	бит_ПредупреждениеЛицевыеСчета.СуммаПени КАК СуммаПени,
	|	ЕСТЬNULL(бит_ЛицевыеСчета.Здание, ЗНАЧЕНИЕ(Справочник.бит_СписокЗданий.ПустаяСсылка)) КАК Здание,
	|	ЕСТЬNULL(бит_ЛицевыеСчета.Квартира, """") КАК Квартира
	|ИЗ
	|	Документ.бит_Предупреждение.ЛицевыеСчета КАК бит_ПредупреждениеЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ПО бит_ПредупреждениеЛицевыеСчета.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	|ГДЕ
	|	бит_ПредупреждениеЛицевыеСчета.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "МакетПредупреждения";
		ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
		
		
		СтруктураПечати.Вставить("ФИО",   Выборка.ОтветственноеЛицо);
		СтруктураПечати.Вставить("Адрес", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Здание, "ПочтовыйАдрес") + ?(ЗначениеЗаполнено(Выборка.Квартира),", кв. " + Строка(Выборка.Квартира),""));
		
		Если НЕ ПараметрыЖКХ.ВыводитьСуммуБезУчетаПереплатПоУслугам Тогда
			Сумма = Выборка.Сумма;
		Иначе
			Сумма = Выборка.СуммаБезПереплат;
		КонецЕсли;
		
		Если ПараметрыЖКХ.ВключатьВРасчетСуммыДолгаПени Тогда
			Сумма = Сумма + Выборка.СуммаПени;
		КонецЕсли;
		
		СуммаПрописью = ЧислоПрописью(Сумма,ФормСтрока, ПарПредмета);
		СтруктураПечати.Вставить("Сумма"        , Сумма);
		СтруктураПечати.Вставить("СуммаПрописью", СуммаПрописью);
		
		ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
		ШапкаОбласть.Параметры.Заполнить(СтруктураПечати);
		
		Для Каждого ТекПараметр Из СтруктураПечати Цикл
			Пока НайтиИЗаменитьВДокументе(ШапкаОбласть, "[" + ТекПараметр.Ключ + "]", ТекПараметр.Значение) Цикл
			КонецЦикла;
		КонецЦикла;
		
		СтрокаПредупреждения = Новый Массив;
		СтрокаПредупреждения.Добавить(ШапкаОбласть);
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаПредупреждения) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ШапкаОбласть);
		ТабДокумент.ОбластьПечати      = ТабДокумент.Область(1, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент.ПолеСверху         = 0;
		ТабДокумент.ПолеСлева          = 0;
		ТабДокумент.ПолеСнизу          = 0;
		ТабДокумент.ПолеСправа         = 0;
		
		СоответствиеЛС.Вставить(Выборка.ЛицевойСчет, ТабДокумент) 
		
	КонецЦикла;
	
	Возврат СоответствиеЛС;
	
КонецФункции

// Производит замену строк в указанном табличном документе.
//
// Возвращаемое значение:
//  Булево – была ли произведена замена.
//
Функция НайтиИЗаменитьВДокументе(ТабДок, СтрокаПоиска, СтрокаЗамены)
	
	ОбластьЗамены = ТабДок.НайтиТекст(СтрокаПоиска);
	Если ОбластьЗамены = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ОбластьЗамены.Текст = СтрЗаменить(ОбластьЗамены.Текст, СтрокаПоиска, СтрокаЗамены);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли