#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" объекта справочника. 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	// Выполним проверку заполненности обязательных реквизитов для элемента справочника.
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено наименование!",,,);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		бит_ДатаВнесенияДокументов = ТекущаяДата();	
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Если ЭтоНовый() Тогда
	//	бит_ДатаВнесенияДокументов = ТекущаяДата();	
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли