
#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РегионВыгрузки = Перечисления.бит_РегионыВыгрузкиВГЦЖС.Москва Тогда
		
		НеПроверятьРеквизиты = Новый Массив;
		
		НеПроверятьРеквизиты.Добавить("КоличествоКолонокExcel");
		НеПроверятьРеквизиты.Добавить("ИмяСтраницыExcel");
		НеПроверятьРеквизиты.Добавить("НомерСтрокиExcel");
		НеПроверятьРеквизиты.Добавить("ФайлExcel");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаКвартиросъемщики");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаОплатыУслуг");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаСведения");
		НеПроверятьРеквизиты.Добавить("кр_Каталог");
		НеПроверятьРеквизиты.Добавить("кр_Кодировка");
		
		Если ВидВыгрузки = Перечисления.бит_ВидВыгрузкиГЦЖС.Льготы Тогда
			
			НеПроверятьРеквизиты.Добавить("КодОрганизацииВладельцаЖилФонда");
			НеПроверятьРеквизиты.Добавить("КодОрганизацииПредоставившейСведенияОНачислениях");
			НеПроверятьРеквизиты.Добавить("ИмяФайлаНач1");
			НеПроверятьРеквизиты.Добавить("ИмяФайлаНач2");
			НеПроверятьРеквизиты.Добавить("ИмяФайлаНач3");
			НеПроверятьРеквизиты.Добавить("КаталогНач1");
			НеПроверятьРеквизиты.Добавить("КаталогНач2");
			НеПроверятьРеквизиты.Добавить("КаталогНач3");
			
			Для каждого Элемент Из НеПроверятьРеквизиты Цикл
				
				Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
				
				Если НЕ Реквизит = Неопределено Тогда
					
					ПроверяемыеРеквизиты.Удалить(Реквизит);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		ИначеЕсли ВидВыгрузки = Перечисления.бит_ВидВыгрузкиГЦЖС.Начисления Тогда
			
			НеПроверятьРеквизиты.Добавить("НомерДоговора");
			НеПроверятьРеквизиты.Добавить("ИмяФайла");
			НеПроверятьРеквизиты.Добавить("Каталог");
			
			Для каждого Элемент Из НеПроверятьРеквизиты Цикл
				
				Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
				
				Если НЕ Реквизит = Неопределено Тогда
					
					ПроверяемыеРеквизиты.Удалить(Реквизит);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
	ИначеЕсли РегионВыгрузки = Перечисления.бит_РегионыВыгрузкиВГЦЖС.Иркутск Тогда
		
		НеПроверятьРеквизиты = Новый Массив;
		НеПроверятьРеквизиты.Добавить("КодОрганизацииВладельцаЖилФонда");
		НеПроверятьРеквизиты.Добавить("КодОрганизацииПредоставившейСведенияОНачислениях");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач1");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач2");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач3");
		НеПроверятьРеквизиты.Добавить("КаталогНач1");
		НеПроверятьРеквизиты.Добавить("КаталогНач2");
		НеПроверятьРеквизиты.Добавить("КаталогНач3");
		НеПроверятьРеквизиты.Добавить("НомерДоговора");
		НеПроверятьРеквизиты.Добавить("ИмяФайла");
		НеПроверятьРеквизиты.Добавить("Каталог");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаКвартиросъемщики");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаОплатыУслуг");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаСведения");
		НеПроверятьРеквизиты.Добавить("кр_Каталог");
		НеПроверятьРеквизиты.Добавить("кр_Кодировка");
		
		Для каждого Элемент Из НеПроверятьРеквизиты Цикл
			
			Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
			
			Если НЕ Реквизит = Неопределено Тогда
				
				ПроверяемыеРеквизиты.Удалить(Реквизит);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	ИначеЕсли РегионВыгрузки = Перечисления.бит_РегионыВыгрузкиВГЦЖС.КрасноярскийКрай Тогда
		
		НеПроверятьРеквизиты = Новый Массив;
		НеПроверятьРеквизиты.Добавить("КоличествоКолонокExcel");
		НеПроверятьРеквизиты.Добавить("ИмяСтраницыExcel");
		НеПроверятьРеквизиты.Добавить("НомерСтрокиExcel");
		НеПроверятьРеквизиты.Добавить("ФайлExcel");
		НеПроверятьРеквизиты.Добавить("КодОрганизацииВладельцаЖилФонда");
		НеПроверятьРеквизиты.Добавить("КодОрганизацииПредоставившейСведенияОНачислениях");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач1");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач2");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач3");
		НеПроверятьРеквизиты.Добавить("КаталогНач1");
		НеПроверятьРеквизиты.Добавить("КаталогНач2");
		НеПроверятьРеквизиты.Добавить("КаталогНач3");
		НеПроверятьРеквизиты.Добавить("НомерДоговора");
		НеПроверятьРеквизиты.Добавить("ИмяФайла");
		НеПроверятьРеквизиты.Добавить("Каталог");
		
		Для каждого Элемент Из НеПроверятьРеквизиты Цикл
			
			Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
			
			Если НЕ Реквизит = Неопределено Тогда
				
				ПроверяемыеРеквизиты.Удалить(Реквизит);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти