
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВывестиМакет();
	ЭтаФорма.Высота = 200;
	ЭтаФорма.Ширина = 120;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Структура = новый структура;
	ОповеститьОВыборе(Структура);
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	// Получение значений полей выбранной строки.
	ТекущаяОбласть    = ТабличныйДокумент.ТекущаяОбласть;
	
	ОбластьКод          = ТабличныйДокумент.Области.Код;
	ОбластьНаименование = ТабличныйДокумент.Области.Наименование;
	
	Если ТекущаяОбласть.Низ = ТекущаяОбласть.Верх Тогда
		
		Код          = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКод.         Лево, ТекущаяОбласть.Низ, ОбластьКод.         Право).Текст;
		Наименование = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименование.Лево, ТекущаяОбласть.Низ, ОбластьНаименование.Право).Текст;
		
		// Проверка наличия выбранного элемента.
		Ссылка =    НайтиПоНаименованиюНаСервере(Наименование);
		
		Если НЕ Ссылка.Пустая() Тогда
			
			Вопрос = "В справочнике ""Степени родства физических лиц"" уже существует элемент с наименованием """ + Наименование + """! Открыть существующий?";
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ТабличныйДокументОбработкаРасшифровкиЗавершение", ЭтотОбъект, Новый Структура("Код, Наименование, ОбластьКод, ОбластьНаименование, Ссылка, ТекущаяОбласть", Код, Наименование, ОбластьКод, ОбластьНаименование, Ссылка, ТекущаяОбласть)), Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );
			Возврат;
			
		КонецЕсли;
		
		ТабличныйДокументОбработкаРасшифровкиФрагмент(Код, Наименование);
		
	Иначе
		
		Форма = ОткрытьФорму("ОбщаяФорма.бит_ФормаПодбораИзКлассификатораУправляемая",,ЭтаФорма);
		
		СтуктураКолонок = Новый Структура();
		СтуктураКолонок.Вставить("Код", Новый Структура("Заголовок, Ширина", "Код", 5));
		СтуктураКолонок.Вставить("Наименование", Новый Структура("Заголовок, Ширина", "Наименование"));
		СтуктураКолонок.Вставить("Видимость", Новый Структура("Заголовок, Ширина", ""));	
		Форма.ТипСправочника = "бит_СтепениРодстваФизЛиц";
		Форма.НастроитьФорму(СтуктураКолонок);
		
		СписокВыбора =  Форма.СписокВыбора;		
		
		Для ТекущаяСтрока = ТекущаяОбласть.Верх по ТекущаяОбласть.Низ Цикл
			
			Код          = ТабличныйДокумент.Область(ТекущаяСтрока, ОбластьКод.         Лево, ТекущаяСтрока, ОбластьКод.         Право).Текст;
			Наименование = ТабличныйДокумент.Область(ТекущаяСтрока, ОбластьНаименование.Лево, ТекущаяСтрока, ОбластьНаименование.Право).Текст;
			
			ЭтоЧисло = Истина;
			Попытка
				КодКакЧисло = Число(Код);
			Исключение
				ЭтоЧисло = Ложь;
			КонецПопытки;
			
			ЕСли ЭтоЧисло Тогда
				СтрокаПодбора = СписокВыбора.Добавить();
				СтрокаПодбора.Код = Код;				
				СтрокаПодбора.Наименование = Наименование;
				СтрокаПодбора.Видимость = НайтиПоКодуНаСервере(Код);
				СтрокаПодбора.Переносить = СтрокаПодбора.Видимость;
			КонецЕсли;
			
		КонецЦикла;
		
		Форма.Открыть();		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Код = ДополнительныеПараметры.Код;
	Наименование = ДополнительныеПараметры.Наименование;
	ОбластьКод = ДополнительныеПараметры.ОбластьКод;
	ОбластьНаименование = ДополнительныеПараметры.ОбластьНаименование;
	Ссылка = ДополнительныеПараметры.Ссылка;
	ТекущаяОбласть = ДополнительныеПараметры.ТекущаяОбласть;
	
	
	Ответ  = РезультатВопроса;
	
	Если      Ответ = КодВозвратаДиалога.Да Тогда
		
		Ссылка.ПолучитьФорму( , ВладелецФормы, ).Открыть();
		Возврат;
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	
	ТабличныйДокументОбработкаРасшифровкиФрагмент(Код, Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровкиФрагмент(Код, Наименование)
	
	Перем ПараметрыФормы;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура());
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Наименование", Наименование);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Код", Код);
	ОткрытьФорму("Справочник.бит_СтепениРодстваФизЛиц.Форма.ФормаЭлементаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция НайтиПоНаименованиюНаСервере(Наименование)
	
	Ссылка = Справочники.бит_СтепениРодстваФизЛиц.НайтиПоНаименованию(Наименование);
	Возврат Ссылка;
КонецФункции

&НаСервере
Функция НайтиПоКодуНаСервере(Код)
	
	Ссылка = Справочники.бит_СтепениРодстваФизЛиц.НайтиПоКоду(Код).Пустая();
	Возврат Ссылка;
КонецФункции

&НаСервере
Процедура ВывестиМакет()
	Макет = Справочники.бит_СтепениРодстваФизЛиц.ПолучитьМакет("КлассификаторРодства");
	
	Макет.Параметры.Расшифровка = Истина; // Чтобы работала расшифровка.
	ТабличныйДокумент = Элементы.ТабличныйДокумент;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Макет);
	
	ТабличныйДокумент.ФиксацияСверху      = 3;
	
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;
	
КонецПроцедуры   

#КонецОбласти