
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоваяСтрока = ВидОперацииДокумента.Добавить();
	НоваяСтрока.Вид = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ПодключениеУслуги;
	
	НоваяСтрока = ВидОперацииДокумента.Добавить();
	НоваяСтрока.Вид = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ОтключениеУслуги;
	
	мКэшЗначений = Новый Структура;
	
	мКэшЗначений.Вставить("Здание", Параметры.Здание);
	мКэшЗначений.Вставить("Улица" , Параметры.Улица);

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ТекущиеДанные = Элементы.ВидОперацииДокумента.ТекущиеДанные;
		
	ЗначенияЗаполнения = Новый Структура;
	ПараметрыФормы     = Новый Структура;
		
	ЗначенияЗаполнения.Вставить("ВидОперации", ТекущиеДанные.Вид);
	
	ПараметрыФормы.Вставить("Здание", мКэшЗначений.Здание);
	ПараметрыФормы.Вставить("Улица" , мКэшЗначений.Улица);	
	
	ОткрытьФорму("Документ.бит_ПодключениеУслугКЗданиям.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаСписокЗданий, ЗначенияЗаполнения", ПараметрыФормы, ЗначенияЗаполнения), ЭтаФорма);
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
