
#Область ПрограммныйИнтерфейс

// Функция получает номер релиза типовой конфигурации Бухгалтерии из перечисления бит_СведенияОПрограмме.
//
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьНомерРелиза_1С() Экспорт
	
	//Возврат Метаданные.Перечисления.бит_СведенияОПрограмме.ЗначенияПеречисления.НомерРелиза_1С.Синоним;
	Возврат Строка(Перечисления.бит_СведенияОПрограмме.НомерРелиза_1С);
	
КонецФункции

// Функция получает номер релиза конфигурации БИТ.ЖКХ из перечисления бит_СведенияОПрограмме.
//
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьНомерРелиза_бит() Экспорт
	
	//Возврат Метаданные.Перечисления.бит_СведенияОПрограмме.ЗначенияПеречисления.НомерРелиза_БИТ.Синоним;
	Возврат Строка(Перечисления.бит_СведенияОПрограмме.НомерРелиза_БИТ);
	
КонецФункции

//  Процедура выполняет получение настроек ЖКХ.
//
// Параметры: 
//  Дата                - Дата             - Дата на которую получить настройки, 
//  Организация         - СправочникСсылка - Огранизация по которой получить настройки,
//  СтруктураПараметров - Структура        - Заполненая структура Настроек жкх.
//                                           (Ключ - имя настройки, Значение - стандартное значение настройки),
// Возвращаемое значение:
//  СтруктураПараметров.
//
Функция ПолучитьНастройкиЖКХ(Дата, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 *
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() >0  Тогда
		
		СтруктураПараметров = Новый Структура();
		Для Каждого Стр Из Результат Цикл
			Для Каждого Колонка Из Результат.Колонки Цикл
				СтруктураПараметров.Вставить(Колонка.Имя, Стр[Колонка.Имя]);
			КонецЦикла;
		КонецЦикла;
		
		Возврат СтруктураПараметров;
		
	Иначе
		
		Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Дата) Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Настройки ЖКХ для организации: " + Организация + " на " + Формат(Дата, "ДФ=dd.MM.yyyy")  + " не заданы!");
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
КонецФункции

Функция ПоследняяДатаИзмененийНастроекЖКХ(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних КАК бит_НастройкаПараметровЖКХСрезПоследних
	|ГДЕ
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Период;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СведенияОбАдресе(ЗначенияПолей) Экспорт
	
	ДополнительныеПараметры =  Новый Структура("НаименованиеВключаетСокращение", Ложь);
	Возврат РаботаСАдресами.СведенияОбАдресе(ЗначенияПолей, ДополнительныеПараметры);
	
КонецФункции

//Функция НомерТелефонаКонтактнойИнформации(Знач XMLСтрока) Экспорт
//	
//	Возврат УправлениеКонтактнойИнформацией.НомерТелефонаКонтактнойИнформации(XMLСтрока);
//	   
//КонецФункции

#КонецОбласти