
#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор          = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", ФизЛицо);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.бит_ВоинскийУчет.Форма.ФормаСпискаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИзменения(Команда)
	
	ЗаписатьИзменения();
	Закрыть();
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "ВоинскийУчет"), ФизЛицо);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменения()
	
	ЗаписьИзНабораНабор = ДанныеФормыВЗначение(НаборЗаписей, Тип("РегистрСведенийНаборЗаписей.бит_ВоинскийУчет"));
	
	// БИТ_ЖКХ 28.12.2015 10:41:20 Начало правки... 
	//Если Период <> ПериодПриОткрытии Тогда 
	//	ЗаписьИзНабора = ЗаписьИзНабораНабор.Добавить();
	//	ЗаписьИзНабора.ФизЛицо = ФизЛицо;
	//Иначе
	//	ЗаписьИзНабора = ЗаписьИзНабораНабор[0];
	//КонецЕсли;
	
	ЗаписьИзНабора = ЗаписьИзНабораНабор[0];
	// БИТ_ЖКХ 28.12.2015 10:41:16 Конец правки.
	
    // Если что-то поменяли тогда запишем. 
	Если ВоенкоматПриОткрытии <> Военкомат ИЛИ
		ВУСПриОткрытии <> ВУС ИЛИ
		ГодностьПриОткрытии <> Годность ИЛИ
		ЗваниеПриОткрытии <> Звание ИЛИ
		НаличиеМобпредписанияПриОткрытии <> НаличиеМобпредписания ИЛИ
		ОтношениеКВоинскойОбязанностиПриОткрытии <> ОтношениеКВоинскойОбязанности ИЛИ
		Период <> ПериодПриОткрытии ИЛИ
		ОтношениеКВоинскомуУчетуПриОткрытии <> ОтношениеКВоинскомуУчету ИЛИ
		ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчетаПриОткрытии <> ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета ИЛИ
		КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчетаПриОткрытии <> КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета ИЛИ
		КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчетаПриОткрытии <> КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета Тогда
	
		ЗаписьИзНабора.Период  						 = Период;
		ЗаписьИзНабора.Военкомат					 = Военкомат;
		ЗаписьИзНабора.ВУС							 = ВУС;
		ЗаписьИзНабора.Годность						 = Годность;
		ЗаписьИзНабора.Звание 						 = Звание;
		ЗаписьИзНабора.НаличиеМобпредписания		 = НаличиеМобпредписания;
		ЗаписьИзНабора.ОтношениеКВоинскойОбязанности = ОтношениеКВоинскойОбязанности;
		ЗаписьИзНабора.ОтношениеКВоинскомуУчету		 = ОтношениеКВоинскомуУчету;
		ЗаписьИзНабора.КатегорияЗапаса				 = КатегорияЗапаса;
		ЗаписьИзНабора.Состав						 = Состав;
		ЗаписьИзНабора.НомерКомандыПартии			 = НомерКомандыПартии;
		ЗаписьИзНабора.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета = ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета;
		ЗаписьИзНабора.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета    = КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
		ЗаписьИзНабора.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета      = КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
		
		Попытка
			// БИТ_ЖКХ 28.12.2015 10:43:01 Начало правки... 
			ЗаписьИзНабораНабор.Отбор.Физлицо.Использование	= Истина;
			ЗаписьИзНабораНабор.Отбор.Физлицо.Значение		= ФизЛицо;
			ЗаписьИзНабораНабор.Отбор.Период.Использование	= Истина;
			ЗаписьИзНабораНабор.Отбор.Период.Значение		= Период;
			// БИТ_ЖКХ 28.12.2015 10:43:03 Конец правки. 
		    ЗаписьИзНабораНабор.Записать(Истина);
		Исключение
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		КонецПопытки;
		
		ЗначениеВДанныеФормы(ЗаписьИзНабораНабор, НаборЗаписей);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаборЗаписей.Очистить();
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	бит_ВоинскийУчетСрезПоследних.Период КАК Период,
	    |	бит_ВоинскийУчетСрезПоследних.ФизЛицо КАК ФизЛицо,
	    |	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	    |	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскомуУчету,
	    |	бит_ВоинскийУчетСрезПоследних.КатегорияЗапаса,
	    |	бит_ВоинскийУчетСрезПоследних.Звание,
	    |	бит_ВоинскийУчетСрезПоследних.Состав,
	    |	бит_ВоинскийУчетСрезПоследних.ВУС,
	    |	бит_ВоинскийУчетСрезПоследних.Годность,
	    |	бит_ВоинскийУчетСрезПоследних.Военкомат,
	    |	бит_ВоинскийУчетСрезПоследних.НаличиеМобпредписания,
	    |	бит_ВоинскийУчетСрезПоследних.НомерКомандыПартии,
	    |	бит_ВоинскийУчетСрезПоследних.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	    |	бит_ВоинскийУчетСрезПоследних.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	    |	бит_ВоинскийУчетСрезПоследних.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета
	    |ИЗ
	    |	РегистрСведений.бит_ВоинскийУчет.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ВоинскийУчетСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.Ключ.ФизЛицо);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;

	КонецЕсли;

	Если НаборЗаписей.Количество() = 0 Тогда
		
		НаборЗаписей.Добавить();
		
		ЗаписьИзНабора = НаборЗаписей[0];
		
		Если Параметры.Свойство("ЗаполнитьИзСправочникаПроживающие") Тогда
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("ФизЛицо") Тогда
				
				ЗаписьИзНабора.ФизЛицо = Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо;
				
			КонецЕсли;
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("Период") Тогда
				
				ЗаписьИзНабора.Период = Параметры.ЗаполнитьИзСправочникаПроживающие.Период;
				
			КонецЕсли;
		
		КонецЕсли;

	КонецЕсли;
	
	ЗаписьИзНабора = НаборЗаписей[0];
	
	Период  = ?(НЕ ЗначениеЗаполнено(ЗаписьИзНабора.Период), '19000101', ЗаписьИзНабора.Период);
	
	Военкомат						                   = ЗаписьИзНабора.Военкомат;
	ВУС								                   = ЗаписьИзНабора.ВУС;
	Годность						                   = ЗаписьИзНабора.Годность;
	Звание							                   = ЗаписьИзНабора.Звание;
	НаличиеМобпредписания			                   = ЗаписьИзНабора.НаличиеМобпредписания;
	ОтношениеКВоинскойОбязанности	                   = ЗаписьИзНабора.ОтношениеКВоинскойОбязанности;
	ОтношениеКВоинскомуУчету		                   = ЗаписьИзНабора.ОтношениеКВоинскомуУчету;
	Период 							                   = ?(ЗначениеЗаполнено(ЗаписьИзНабора.Период), ЗаписьИзНабора.Период, '19000101');
	КатегорияЗапаса					                   = ЗаписьИзНабора.КатегорияЗапаса;
	Состав							                   = ЗаписьИзНабора.Состав;
	НомерКомандыПартии				                   = ЗаписьИзНабора.НомерКомандыПартии;
	ФизЛицо							                   = ЗаписьИзНабора.Физлицо;
	ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета = ЗаписьИзНабора.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета;
	КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета    = ЗаписьИзНабора.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
	КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета      = ЗаписьИзНабора.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
	
	Если ФизЛицо = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка") Тогда
		
		Элементы.История.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти