
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    тДерево = РеквизитФормыВЗначение("СписокОбработок");
	
	ВеткаАдреса = ДобавитьСтрокуВДерево(тДерево,"РЕЛИЗ","Обновление на 1.3.2.49",Ложь, "Обработки по обновлению информационной базы, предназначенные для выполнения при переходе с версии 1.3.2.48");
	ДобавитьСтрокуВДерево(ВеткаАдреса, "бит_ЗаполнениеАдресаИзКонтактнойИнформации", "Заполнние почтового адреса здания" ,Ложь, "В релизе ЖКХ 1.3.2.49 добавлена возможность заполнения адреса здания из контактной информации. При обновлении данной обработкой реквизит будет заполнен автоматически.");
	
	ЗначениеВРеквизитФормы(тДерево, "СписокОбработок");

КонецПроцедуры

// Функция добавления строки в дерево.
//
Функция ДобавитьСтрокуВДерево(Корень, Наименование, Представление, Пометка, ОписаниеОбработки = "");

	НоваяСтрока = Корень.Строки.Добавить();
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.Пометка = Пометка;
	НоваяСтрока.ОписаниеОбработки = ОписаниеОбработки;

	Возврат НоваяСтрока;

КонецФункции

&НаКлиенте
Процедура СписокОбработокПометкаПриИзменении(Элемент)
	
	ИДТекущейСтроки = Элементы["СписокОбработок"].ТекущаяСтрока;

    Если ИДТекущейСтроки <> Неопределено Тогда

        ЭлементКоллекции = ЭтаФорма["СписокОбработок"].НайтиПоИдентификатору(ИДТекущейСтроки);

        Если ЭлементКоллекции.Пометка = 2 Тогда
            ЭлементКоллекции.Пометка = 0;
        КонецЕсли;

        УстановкаФлажков(ЭлементКоллекции, ЭлементКоллекции.Пометка);

        Родитель = ЭлементКоллекции.ПолучитьРодителя();
        Пока Родитель <> Неопределено Цикл
            Родитель.Пометка = ?(УстановленноДляВсех(ЭлементКоллекции), ЭлементКоллекции.Пометка, 2);
            ЭлементКоллекции = Родитель;
            Родитель = ЭлементКоллекции.ПолучитьРодителя();
        КонецЦикла;

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции, ЗначениеПометки)

    ПодчинЭлементы = ЭлементКоллекции.ПолучитьЭлементы();
    Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
        ТекЭлемент.Пометка = ЗначениеПометки;
        УстановкаФлажков(ТекЭлемент, ТекЭлемент.Пометка);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция УстановленноДляВсех(ЭлементКоллекции)

    СоседниеЭлементы = ЭлементКоллекции.ПолучитьРодителя().ПолучитьЭлементы();
    
    Для Каждого ТекЭлемент Из СоседниеЭлементы Цикл
        Если ТекЭлемент.Пометка <> ЭлементКоллекции.Пометка Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    Возврат Истина;

КонецФункции

&НаСервере
Процедура ПолучитьСписокОбработокНаСервере()
	
	тДерево = РеквизитФормыВЗначение("СписокОбработок");
	СписокИменОбработок.Очистить();
	МассивПомеченных = тДерево.Строки.НайтиСтроки(Новый Структура("Пометка", Истина), Истина);
	Для Каждого Элемент Из МассивПомеченных Цикл
		Если (Элемент.Пометка) И (Элемент.Строки.Количество() = 0) Тогда
			текОбработка = Элемент.Наименование;
	//		
	//// БИТ_ЖКХ 23.06.2014		
	//Попытка 
	//	Предупреждение("Выполнение обработки может занять длительное время(в зависимости от размера информационной базы)");	
	//Исключение	
	//	Сообщить("Выполнение обработки может занять длительное время(в зависимости от размера информационной базы)");
	//КонецПопытки;
	//// БИТ_ЖКХ 23.06.2014
	
	        СписокИменОбработок.Добавить(текОбработка);
			Элемент.Пометка = Ложь;
		КонецЕсли;	
	КонецЦикла;

	
КонецПроцедуры


&НаКлиенте
Процедура Запустить(Команда)
	
	ПолучитьСписокОбработокНаСервере();
	
	если СписокИменОбработок.Количество() > 0 тогда
	 текОбработка = ЭтотОбъект.СписокИменОбработок[0].Значение;
	
	 имяФормыОбработки = строка("Обработка.") + текОбработка + строка(".Форма.Форма"); 
	 ФормаОбработки = ПолучитьФорму(имяФормыОбработки);

     ФормаОбработки.Открыть();
	конецесли; 

КонецПроцедуры

