
#Область СлужебныеПроцедурыИФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    
	СтандартнаяОбработка = Ложь; 
	
	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("НачалоПериода");
	СписокПараметровНаФорме.Добавить("КонецПериода");
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		
		НовыйПараметрКД =  Новый ПараметрКомпоновкиДанных(ИмяПараметра);
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(НовыйПараметрКД);
		
		Если ЗначениеПараметра = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеПараметра.Использование = Истина;
		
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяПараметра]) Тогда
			
			Если ИмяПараметра = "НачалоПериода" Тогда
				
				ЭтотОбъект[ИмяПараметра] = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
				
			Иначе
				ЭтотОбъект[ИмяПараметра] = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
				
			КонецЕсли; 
			
		ИначеЕсли ИмяПараметра = "КонецПериода"  Тогда

			ЭтотОбъект.КонецПериода = КонецДня(ЭтотОбъект[ИмяПараметра]);
		КонецЕсли; 
		
		ЗначениеПараметра.Значение = ЭтотОбъект[ИмяПараметра];
		
	КонецЦикла;
	
	// Установим заголовок.
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыВывода.
	НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	
	
	ЗначениеПараметра.Значение = " Данные по групповым счетчикам
	| за период с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");// +"
	ЗначениеПараметра.Использование = Истина;
	
	ТаблицаДанных = ПолучитьСписокСтавок(); 
	ВнешниеНаборы = Новый Структура;
	ВнешниеНаборы.Вставить("ТаблицаДанных", ТаблицаДанных);
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ПолучитьСписокСтавок() 
	
	ИтоговаяТаблица = Новый ТаблицаЗначений;
	Период  = КонецМесяца(НачалоПериода);
	ИтоговаяТаблица.Колонки.Добавить("Период",,"Период");
	ИтоговаяТаблица.Колонки.Добавить("Услуга",,"Услуга");
	ИтоговаяТаблица.Колонки.Добавить("ЛицевойСчет",,"ЛицевойСчет");
	ИтоговаяТаблица.Колонки.Добавить("Поставщик",,"Поставщик");
	ИтоговаяТаблица.Колонки.Добавить("ОсновнаяСтавка",,"ОсновнаяСтавка");
	Пока Период <= КонецМесяца(КонецПериода)  Цикл
		
		Запрос = Новый Запрос;                        
		Запрос.Текст =                                
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(бит_СчетчикиНаУслугахОбщийСрезПоследних.Период, МЕСЯЦ) КАК Период,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный
		|ПОМЕСТИТЬ ГрупСчетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|			&Момент,
		|			ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
		|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(бит_ГрупповыеСчетчикиСрезПоследних.Период, МЕСЯЦ) КАК Период,
		|	ГрупСчетчики.Объект КАК Здание,
		|	ГрупСчетчики.Счетчик,
		|	ГрупСчетчики.Услуга КАК Услуга,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет
		|ПОМЕСТИТЬ Счетчики_ЛС
		|ИЗ
		|	ГрупСчетчики КАК ГрупСчетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Момент, ) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|		ПО ГрупСчетчики.Услуга = бит_ГрупповыеСчетчикиСрезПоследних.Услуга
		|			И ГрупСчетчики.Счетчик = бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Счетчики_ЛС.Период,
		|	Счетчики_ЛС.Здание,
		|	Счетчики_ЛС.Счетчик,
		|	Счетчики_ЛС.Услуга,
		|	Счетчики_ЛС.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик
		|ПОМЕСТИТЬ ВсеБезСтавок
		|ИЗ
		|	Счетчики_ЛС КАК Счетчики_ЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ) КАК бит_СведенияПоУслугамЛССрезПоследних
		|		ПО Счетчики_ЛС.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|			И Счетчики_ЛС.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ) КАК Период,
		|	ВсеБезСтавок.Услуга,
		|	ВсеБезСтавок.ЛицевойСчет,
		|	ВсеБезСтавок.Поставщик,
		|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка
		|ИЗ
		|	ВсеБезСтавок КАК ВсеБезСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
		|				&Момент,
		|				СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
		|					И ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
		|					И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_СтавкиНаУслугиСрезПоследних
		|		ПО ВсеБезСтавок.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
		|			И ВсеБезСтавок.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
		|ГДЕ
		|	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.Услуга.ОсновнойРежимПотребления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупСчетчики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счетчики_ЛС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеБезСтавок";
		
		Запрос.УстановитьПараметр("Момент", КонецМесяца(Период));
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			
			НоваяСтрока = ИтоговаяТаблица.Добавить();
			НоваяСтрока.Период	 		= НачалоМесяца(Период);
			НоваяСтрока.Услуга 			= Справочники.бит_УслугиЖКХ.ПустаяСсылка();
			НоваяСтрока.ЛицевойСчет		= Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
			НоваяСтрока.Поставщик		= Справочники.бит_ПоставщикиУслуг.ПустаяСсылка();
			НоваяСтрока.ОсновнаяСтавка	= 0;
			
		Иначе
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = ИтоговаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
				
			КонецЦикла;
			
		КонецЕсли; 
		Период = ДобавитьМесяц(Период,1);
		
	КонецЦикла;
	Возврат  ИтоговаяТаблица;
	 
КонецФункции // ПолучитьСписокСтавок()

#КонецОбласти