
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ЗаголовокСообщения = "Добавление нового документа:";
	Текст              = "Заведение нового документа ""Начисление пени по лицевым счетам"" осуществляеться через ввод на основании из документа ""Оплата КУ"" 
						 | или при закрытии платежного периода!!";
				
	бит_ОбщегоНазначения.СообщитьОбОшибке(Текст,Отказ,ЗаголовокСообщения,СтатусСообщения.ОченьВажное);
	
КонецПроцедуры

#КонецОбласти
