&НаКлиенте
Процедура ПечататьВсеЧеки(Команда)
	Элементы.Прогресс.МаксимальноеЗначение = Объект.Документы.Количество();
	Прогресс = Элементы.Прогресс.МинимальноеЗначение;
	Для Каждого Стр ИЗ Объект.Документы Цикл
		Прогресс = Прогресс + 1;
		Если НЕ Стр.Пробит Тогда
		
			Если НЕ ЗначениеЗаполнено(Стр.ПараметрыДокумента) Тогда
				ПолучитьДанныеДляПечати(Стр)	
			КонецЕсли;
			
			//25.09.2019
			если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр.ПараметрыДокумента, "МассивЧеков") = ложь тогда				
			  продолжить;
			конецесли;	
			
			Если НЕ ОтправлятьЧекПочтой Тогда
				Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = Неопределено;
				
			Иначе
				Стр.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail = ПолучитьНастройкиОтправкиОтчетов(Стр.ПараметрыДокумента.ИдентификаторУстройства).Отправляет1СEmail;
				//БИТ ЖКХ 13.05.2020
				если ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков) тогда 
				 если ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail) = ложь тогда 	
					Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = ЭтотОбъект.АдресЭлектроннойПочты;
				 конецесли;	
				конецесли;	
			КонецЕсли;
			
			Если НЕ ОтправлятьЧекSMS Тогда
				Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер = "";
				
			Иначе
				Стр.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS = ПолучитьНастройкиОтправкиОтчетов(Стр.ПараметрыДокумента.ИдентификаторУстройства).Отправляет1СSMS;
			КонецЕсли;
		
			Если (ОтправлятьЧекSMS И ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер)) ИЛИ (ОтправлятьЧекПочтой И ЗначениеЗаполнено(Стр.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail)) Тогда
				Если НЕПечататьЧек Тогда			
					Стр.ПараметрыДокумента.МассивЧеков[0].Электронно = Истина;
					
				КонецЕсли;	
				
			КонецЕсли;
			
			// БИТ ЖКХ 19.02.2020
			Если НЕПечататьЧек = истина Тогда
				Стр.ПараметрыДокумента.МассивЧеков[0].Электронно = Истина;
			конецесли;	
			
			//ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",Стр.Документ));
			//25.09.2019
			//если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") тогда
			// БИТ ЖКХ 31.12.2020 PTC
			если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") или ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			 // БИТ ЖКХ 27.04.2020
			 попытка
		      ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокументаОбщая",Новый Структура("Ключ",Стр.Документ));
		     исключение
			  ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",Стр.Документ)); 
	         конецпопытки;  			  
		    иначе
		     ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",Стр.Документ));
			  // БИТ ЖКХ 01.09.2020
			 если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			  ФормаДок = ПолучитьФорму("Документ."+Стр.ИмяДок+".Форма.ФормаДокументаОбщая",Новый Структура("Ключ",Стр.Документ));
			 конецесли; 
		    конецесли;
			
			Если Стр.ПараметрыДокумента.МассивЧеков.Количество() > 0 Тогда
			  НапечататьОдинЧек(ФормаДок, Стр.ПараметрыДокумента.МассивЧеков, Стр.ПараметрыДокумента.ИдентификаторУстройства, Стр.ПараметрыДокумента.ВерсияФормата, Стр.Адрес, Стр.Контрагент, Стр.ЛицевойСчет);
			КонецЕсли;
			
			Если Не Отладка_НеМенятьНомерЧекаККМ Тогда
				// БИТ ЖКХ 23.05.2020
				// БИТ ЖКХ 19.06.2020
				//ФормаДок.Объект.РучнаяКорректировка = ложь;
				ФормаДок.Записать();
			КонецЕсли;
			Если ФормаДок.Объект.НомерЧекаККМ <> 0 Тогда
			Стр.Пробит = Истина;
		Иначе
			Стр.Пробит = Ложь;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;	
	
	//25.09.2019
	ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("Пробит", ложь);
	НайденныеСтроки = Объект.Документы.НайтиСтроки(ПараметрыОтбора);
	
	если НайденныеСтроки.Количество() > 0 тогда
	 Сообщить("Чеки не пробиты!");
    иначе
	 Сообщить("Чеки пробиты!");
	конецесли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметры(Форма)
	
	ДокОбъект = Форма.Объект;
	
	ОчиститьСообщения();
	
	ОписаниеОшибки = "";
	
	//+МРЦ
	//Если ДокОбъект.НомерЧекаККМ <> 0 Тогда
	//	ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном устройстве!'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//	
	//	Возврат;
	//КонецЕсли;
	//-МРЦ
	
	// БИТ ЖКХ 26.02.2021
	если ДокОбъект.Проведен = ложь тогда
	  ТекстСообщения = НСтр("ru = 'Операция возможна только после проведения документа'");
	  Сообщить(ТекстСообщения);         
	  // ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		  
	  возврат;
	конецесли;	
	
	Если ПроверитьВозможностьПечатиЧека(Форма) Тогда
		
		Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
			Контекст = Новый Структура();
			Контекст.Вставить("Форма", Форма);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение", ЭтотОбъект, Контекст);
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
			ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
				НСтр("ru = 'Выберите фискальное устройство'"), НСтр("ru = 'Фискальное устройство не подключено.'"));
		Иначе
			ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьВыбратьУстройство(ОповещениеВыбора, ТипОборудования, ТекстЗаголовкаВыбора, 
	
	СообщениеНеПодключен = "", СообщениеНеВыбран = "", БезСообщений = Ложь, ТекстСообщения = "") 
	
	Если Не МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		Если Не БезСообщений Тогда
		      ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СписокДоступныхУстройств = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипОборудования);
	
	Если СписокДоступныхУстройств.Количество() = 0 Тогда
		Если Не ПустаяСтрока(СообщениеНеПодключен) Тогда
			Если БезСообщений Тогда
				ТекстСообщения = СообщениеНеПодключен;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеНеПодключен);
			КонецЕсли;
		КонецЕсли;
		ВыполнитьОбработкуОповещения(ОповещениеВыбора, Неопределено);
	Иначе
		СписокУстройств = Новый СписокЗначений();
		Для Каждого Устройства Из СписокДоступныхУстройств Цикл
			СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
		КонецЦикла;
		Если СписокУстройств.Количество() = 1 Тогда
			Идентификатор = СписокУстройств[0].Значение;
			ВыполнитьОбработкуОповещения(ОповещениеВыбора, Идентификатор); 
		Иначе
			Контекст = Новый Структура;
			Контекст.Вставить("СледующееОповещение", ОповещениеВыбора);
			Контекст.Вставить("СообщениеНеВыбран"  , ?(ПустаяСтрока(СообщениеНеВыбран), СообщениеНеПодключен, СообщениеНеВыбран));
			Контекст.Вставить("БезСообщений"       , БезСообщений);
			//25.09.2019
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение", ЭтотОбъект, Контекст);
//			ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);

			СписокУстройств.ПоказатьВыборЭлемента(ОписаниеОповещения, ТекстЗаголовкаВыбора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФискальногоУстройстваЗавершение(ИдентификаторУстройства, Параметры)Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства);
	ТипУстройства = ?(ДанныеУстройства.Свойство("ТипОборудованияИмя"), ДанныеУстройства.ТипОборудованияИмя, "ККТ");
	
	Параметры.Вставить("ТипУстройства", ТипУстройства);
	
	Если ТипУстройства = "ККТ" Тогда
		Форма = Параметры.Форма;
	
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПолучитьПараметрыЗавершение", ЭтотОбъект, Параметры);
		МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, Форма.УникальныйИдентификатор , ИдентификаторУстройства, Ложь);
	Иначе
		ПолучитьПараметрыЗавершение(Неопределено, Параметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыЗавершение(ПараметрыФискальногоУстройства, Параметры) Экспорт
	
	Перем АдресУстановкиККТ, ОписаниеОшибки;	
	Если ПараметрыФискальногоУстройства =  Неопределено Тогда
		// Принтер чеков эмулирует все атрибуды ФФД 1.1
		пВерсияФормата = ?(Параметры.ТипУстройства = "ПринтерЧеков", "1.1.0.0", "1.0.0.0");
	ИначеЕсли НЕ ПараметрыФискальногоУстройства.Результат Тогда 
		ОписаниеОшибки = ПараметрыФискальногоУстройства.ОписаниеОшибки;
	Иначе
		пВерсияФормата = ПечатьФискальныхДокументовКлиент.ПолучитьВерсиюФФД(ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДФН, ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДККТ);
		ПараметрыФискальногоУстройства.ВыходныеПараметры.Свойство("АдресУстановкиККТ", АдресУстановкиККТ);
	КонецЕсли; 
	
	// Если не удалось подключить ККТ, то формировать чеки смысла нет
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(Параметры.ИдентификаторУстройства);
		НомерСекции         = ?(ПараметрыУстройства.Свойство("НомерСекции"), ПараметрыУстройства.НомерСекции, 0);
		
		// БИТ ЖКХ 11.02.2021
		если УчитыватьАванс= истина тогда
		 МассивЧеков = СобратьДанныеСАвансом(Параметры.Форма.Объект.Ссылка,пВерсияФормата,Параметры.ИдентификаторУстройства);	
		иначе	
		 МассивЧеков = СобратьДанные(Параметры.Форма.Объект.Ссылка,пВерсияФормата,Параметры.ИдентификаторУстройства);
		конецесли; 
		
		//07.8.2019
		ОбъектТекущегоДокумента = Параметры.Форма.Объект.Ссылка;
		
		// БИТ ЖКХ 31.12.2020 РТС
		Если Объект.Документы.Количество() > 0 и ТипЗнч(Объект.Документы[0].Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Иначе
		
			для каждого стр из МассивЧеков[0].ПозицииЧека цикл
				//+МРЦ
				//стр.ПризнакСпособаРасчета = Объект.Документы[0].ПризнакиСпособаРасчета;
				//-МРЦ
				//20.09.2019
				если ТипЗнч(ОбъектТекущегоДокумента) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") и стр.СтавкаНДС = 0 или 
					  ТипЗнч(ОбъектТекущегоДокумента) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") и стр.СтавкаНДС = 0 или
					   ТипЗнч(ОбъектТекущегоДокумента) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") и стр.СтавкаНДС = 0 тогда
					НДСИзПоступления = ПолучитьНДСИзДокумента(ОбъектТекущегоДокумента);
					стр.СтавкаНДС = НДСИзПоступления.СтавкаНДС;
					стр.СуммаНДС = НДСИзПоступления.СуммаНДС;
				конецесли;				
							
			конеццикла;				
						
		КонецЕсли;
		
		ПараметрСтроки = Новый Структура("МассивЧеков,ИдентификаторУстройства,ВерсияФормата",МассивЧеков, Параметры.ИдентификаторУстройства, пВерсияФормата);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
			|Чек не напечатан на фискальном устройстве.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	

КонецПроцедуры
//20.09.2019
функция ПолучитьНДСИзДокумента(Док)	
	
  ндс = новый Структура();	
  ндс.Вставить("СтавкаНДС", 0);//
  
  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/120") > 0  тогда
	ндс.СтавкаНДС = 120;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;
  конецесли;

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "20") > 0 и
      Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/120") = 0 тогда	
	ндс.СтавкаНДС = 20;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;     
  конецесли; 

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/110") > 0  тогда
	ндс.СтавкаНДС = 110;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;
  конецесли;

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "10") > 0 и
      Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/110") = 0 тогда	
	ндс.СтавкаНДС = 10;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;     
  конецесли; 

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/118") > 0  тогда
	ндс.СтавкаНДС = 118;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;
  конецесли;

  если Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "18") > 0 и
      Найти(Строка(Док.РасшифровкаПлатежа[0].СтавкаНДС), "/118") = 0 тогда	
	ндс.СтавкаНДС = 18;
	ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
    возврат ндс;     
  конецесли; 

  ндс.Вставить("СуммаНДС", Док.РасшифровкаПлатежа[0].СуммаНДС);  
  возврат ндс;    
  
конецфункции	

&НаКлиенте
Процедура НапечататьОдинЧек(Форма, МассивЧеков, ИдентификаторУстройства, ВерсияФормата, Адрес = "", Контрагент = "", ЛицевойСчет = "")
	ДокОбъект = Форма.Объект;
	
	ОбщиеПараметры    = МассивЧеков[0];
	
	Контекст = Новый Структура();
	Контекст.Вставить("МассивЧеков", МассивЧеков);
	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	Контекст.Вставить("ВерсияФормата", ВерсияФормата);
	Контекст.Вставить("Форма", Форма);
	
	Оповещение = Новый ОписаниеОповещения("НапечататьОдинЧекЗавершение", ЭтотОбъект, Контекст);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыПечатиЧека",     МассивЧеков[0]);
	ПараметрыФормы.Вставить("Организация",             ДокОбъект.Организация);
	ПараметрыФормы.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ПараметрыФормы.Вставить("ВерсияФормата",           ВерсияФормата);
	
	Если ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 118 Тогда
		ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 18; 
	ИначеЕсли ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 110 Тогда
		ПараметрыФормы.ПараметрыПечатиЧека.ПозицииЧека[0].СтавкаНДС = 10;
	КонецЕсли;	

	// 23.10.2020
	//ПараметрыФормы.ПараметрыПечатиЧека.ПолучательИНН = "";
	
	// БИТ ЖКХ 23.10.2020		 
	если Контрагент <> "" тогда
	     
	     ПараметрыФормы.ПараметрыПечатиЧека.Получатель = Контрагент;
	    
	конецесли;	
	 
	если Адрес <> "" тогда
	   если ПараметрыФормы.ПараметрыПечатиЧека.Получатель <> "" тогда  
	     ПараметрыФормы.ПараметрыПечатиЧека.Получатель = ПараметрыФормы.ПараметрыПечатиЧека.Получатель + "; " + Адрес;
	   иначе	 
		 ПараметрыФормы.ПараметрыПечатиЧека.Получатель = Адрес;  
	   конецесли;	   
	конецесли;	

	если ЛицевойСчет <> "" тогда
	   если ПараметрыФормы.ПараметрыПечатиЧека.Получатель <> "" тогда  
	     ПараметрыФормы.ПараметрыПечатиЧека.Получатель = ПараметрыФормы.ПараметрыПечатиЧека.Получатель + "; " + ЛицевойСчет;
	   иначе	 
		 ПараметрыФормы.ПараметрыПечатиЧека.Получатель = ЛицевойСчет;  
	   конецесли;	 
	     
	конецесли;

	
	 
	
	// БИТ ЖКХ 14.07.2020
	ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ПараметрыФормы.ПараметрыПечатиЧека, ПараметрыФормы.ИдентификаторУстройства);
	
	МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, 
		Форма.УникальныйИдентификатор, 
		ПараметрыФормы.ПараметрыПечатиЧека, 
		ПараметрыФормы.ИдентификаторУстройства,
		,
		,
		);

КонецПроцедуры

&НаКлиенте
Процедура НапечататьОдинЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = Параметры.Форма;
	ДокОбъект = Форма.Объект;
	
	Если РезультатВыполнения.Результат Тогда
		
		Параметры.МассивЧеков.Удалить(0);
		ДокОбъект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		
		Если Параметры.МассивЧеков.Количество() > 0 Тогда
			НапечататьОдинЧек(Форма, Параметры.МассивЧеков, Параметры.ИдентификаторУстройства, Параметры.ВерсияФормата);
		Иначе
			Модифицированность = Истина;
			Если Не Отладка_НеМенятьНомерЧекаККМ Тогда
				Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
			|Чек не напечатан на фискальном устройстве.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ДополнительноеОписание%",
			РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Функция ПроверитьВозможностьПечатиЧека(Форма)
	ПечататьЧек = Истина;
	
	// Если объект не проведен или модифицирован - сообщим пользователю, что печать не возможна.
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.")
		И (НЕ Форма.Объект.Проведен
		ИЛИ Форма.Модифицированность) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( НСтр("ru = 'Операция возможна только после проведения документа'"), Форма.Объект.ДокументОснование);
		ПечататьЧек = Ложь;
		
	КонецЕсли;
	
	Возврат ПечататьЧек;
КонецФункции 
&НаСервере
Функция СобратьДанные(пСсылка,пВерсияФормата,пИдентификаторУстройства) 
	//08.08.2019
	// БИТ ЖКХ 11.02.2021
 Возврат бит_ПечатьФискальныхДокументов.СобратьДанныеЧеков(пСсылка,, пВерсияФормата,пИдентификаторУстройства); 
    
КонецФункции

&НаСервере
Функция СобратьДанныеСАвансом(пСсылка,пВерсияФормата,пИдентификаторУстройства) 
	//08.08.2019
 Возврат бит_ПечатьФискальныхДокументов.СобратьДанныеЧековСАвансом(пСсылка,, пВерсияФормата,пИдентификаторУстройства); 
	 
КонецФункции


функция ЗаменитьАвансВСтроке (ПризнакСпособаРасчета)
 если ПризнакСпособаРасчета = перечисления.ПризнакиСпособаРасчета.Аванс тогда
  возврат перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой;
 конецесли; 
конецфункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Если Параметры.МассивДокументов.Количество() = 0 Тогда
	//06.08.2019	
	  Сообщение = Новый СообщениеПользователю();
      Сообщение.Текст = НСтр("ru='Открытие формы печати без документов запрещено'");
      Сообщение.Поле = "Печать чека";
      Сообщение.УстановитьДанные(Объект);
      Сообщение.Сообщить();
	  
	  Отказ = истина;
	  возврат;	  

	Иначе		
		// БИТ ЖКХ 13.08.2020
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
			
		СписокДоступныхУстройств = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ПоддерживаемыеТипыВО);
		пВерсияФормата = "1.1.0.0";
		СписокУстройств = Новый СписокЗначений();
		Для Каждого Устройства Из СписокДоступныхУстройств Цикл
			СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
		КонецЦикла;
		Если СписокУстройств.Количество() = 1 Тогда
		  ИдентификаторУстройства = СписокУстройств[0].Значение;			
	    конецесли;    
	  
	    если Параметры.Свойство("УчитыватьАванс") тогда
		   УчитыватьАванс = Параметры.УчитыватьАванс; 
	    конецесли; 				
		
		Для каждого стр из Параметры.МассивДокументов Цикл
			Добавить = Объект.Документы.Добавить();
			Добавить.Документ = стр.Ссылка;
			Добавить.ИмяДок = стр.Метаданные().Имя;
						
			// БИТ ЖКХ 14.08.2020
			//Добавить.ПризнакиСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
			если ТипЗнч(стр) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			 Добавить.ПризнакиСпособаРасчета = ПолучитьПризнакиСпособаРасчета (стр.Ссылка, пВерсияФормата, ИдентификаторУстройства);
		    иначе
			 Добавить.ПризнакиСпособаРасчета = перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		    конецесли;
			
			//видНачисленияДокумента = ПолучитьВидНачисления(стр.Ссылка);   
			
			//если ЗначениеЗаполнено(видНачисленияДокумента) тогда
			//	Добавить.НДСАванса = видНачисленияДокумента;
			//конецесли;	
			
			Если стр.НомерЧекаККМ <> 0 Тогда
				Добавить.Пробит = Истина;
			Иначе
				Добавить.Пробит = Ложь;
			КонецЕсли;
			//10.07.2020
			//11.08.2020
			если ТипЗнч(стр) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
				если стр.Контрагент.ЮридическоеФизическоеЛицо = перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо тогда
					
				 // 31.12.2020 БИТ ЖКХ РТС
				 //если Параметры.ЛС = истина тогда					
				 если Параметры.Свойство("ЛС") и Параметры.ЛС = истина тогда
				  Добавить.ЛицевойСчет = строка(стр.бит_ЛицевойСчет);
				 конецесли; 
			//	 Добавить.Контрагент = строка(стр.Контрагент.Наименование) + "; " + 
			//	                         строка(НайтиФактическийАдрес(стр.бит_ЛицевойСчет)) + ", " +
			//							   строка(стр.бит_ЛицевойСчет);
			     // 31.12.2020 БИТ ЖКХ РТС
			     //если Параметры.ФИО = истина тогда
				 если Параметры.Свойство("ФИО") и Параметры.ФИО = истина тогда
			      Добавить.Контрагент = строка(стр.Контрагент.Наименование);
			     конецесли;
				 
				 // 31.12.2020 БИТ ЖКХ РТС
				 //если Параметры.Адрес = истина тогда
				 если Параметры.Свойство("Адрес") и Параметры.Адрес = истина тогда
				  Добавить.Адрес = НайтиФактическийАдрес (стр.бит_ЛицевойСчет);
			     конецесли; 
			    конецесли;
		    конецесли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// БИТ ЖКХ 05.02.2021
функция ПолучитьВидНачисления (ДокСчета)	
 
 если ЗначениеЗаполнено(ДокСчета.ДокументОснование) = истина тогда
	 если ЗначениеЗаполнено(ДокСчета.ДокументОснование.бит_ДокументОснование) = истина тогда	
		 для каждого стр из ДокСчета.ДокументОснование.бит_ДокументОснование.СписокУслугПоПериоду цикл
			 если ЗначениеЗаполнено(стр.ВидНачисления) тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура"     , стр.Услуга.Номенклатура);
				
				ПоискСтроки = ДокСчета.ДокументОснование.Товары.НайтиСтроки(Отбор); 
				
				если ЗначениеЗаполнено(ПоискСтроки) тогда
					возврат ПоискСтроки[0].СтавкаНДС;
				конецесли;
				
			 конецесли;
		 конеццикла;	 
	 конецесли;	 
 конецесли;
 
 возврат неопределено;	
 
конецфункции	

// БИТ ЖКХ 13.08.2020   
Функция ПолучитьПризнакиСпособаРасчета (ДокРеализация, пВерсияФормата, ИдентификаторУстройства)             
 
 МассивЧеков = СобратьДанные(ДокРеализация, пВерсияФормата, ИдентификаторУстройства);

 попытка
  значениеВозврата = МассивЧеков[0].ПозицииЧека[0].ПризнакСпособаРасчета;		
 исключение
  возврат неопределено; 
 конецпопытки; 

 возврат значениеВозврата;  
	
Конецфункции	

функция НайтиФактическийАдрес (ЛС)
	
  // БИТ ЖКХ 30.09.2020	
  если ЛС.Здание.Корпус <> "" тогда
	возврат строка(ЛС.УлицаЛицевогоСчета) + ", " + строка(ЛС.Здание) +
            ", корп. " + строка(ЛС.Здание.Корпус) + ", " + строка(ЛС.Квартира);
  иначе	
    возврат строка(ЛС.УлицаЛицевогоСчета) + ", " + строка(ЛС.Здание) +
            ", " + строка(ЛС.Квартира);	  
  конецесли; 
	
конецфункции	

&НаКлиенте
Процедура ПолучитьДанныеДляПечати(СсылкаДокумент)	
	
	Если ТипЗнч(СсылкаДокумент) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		СтрокаТаблицы = СсылкаДокумент;
		
	    если ТипЗнч(СсылкаДокумент.Документ) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда	
		 ФормаДок = ПолучитьФорму("Документ."+СтрокаТаблицы.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",СтрокаТаблицы.Документ));
	    иначе 
		 ФормаДок = ПолучитьФорму("Документ."+СтрокаТаблицы.ИмяДок+".Форма.ФормаДокументаОбщая",Новый Структура("Ключ",СтрокаТаблицы.Документ));
		конецесли; 
		
		//25.09.2019
		//если ТипЗнч(СсылкаДокумент.Документ) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") тогда 
		// ФормаДок = ПолучитьФорму("Документ."+СтрокаТаблицы.ИмяДок+".Форма.ФормаДокументаОднострочная",Новый Структура("Ключ",СтрокаТаблицы.Документ));
		//иначе
		// ФормаДок = ПолучитьФорму("Документ."+СтрокаТаблицы.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",СтрокаТаблицы.Документ));
		//конецесли;  	
		
		ПолучитьПараметры(ФормаДок);
		
		СтрокаТаблицы.ПараметрыДокумента = ПараметрСтроки;
		
		ПараметрСтроки = Неопределено;			
	Иначе
		
		Для каждого стр	из Объект.Документы.НайтиСтроки(Новый Структура("Документ",СсылкаДокумент)) Цикл 
			
			ФормаДок = ПолучитьФорму("Документ."+стр.ИмяДок+".Форма.ФормаДокумента",Новый Структура("Ключ",стр.Документ));
			
			ПолучитьПараметры(ФормаДок);
			
			стр.ПараметрыДокумента = ПараметрСтроки;
			
			ПараметрСтроки = Неопределено;		
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьНастройки(Ссылка)
	
	ИдентификаторНастроек = СтрШаблон("НастройкиОтправкиСообщений_%1", Ссылка.Метаданные().Имя);
	Возврат ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("ПечатьЧека", ИдентификаторНастроек);	
	
КонецФункции

&НаСервере
Функция ПолучитьНастройкиКонтрагента(док)
	
//	об = Документы.ПоступлениеНаРасчетныйСчет.НайтиПоНомеру(;
	
	Возврат неопределено;	
	
КонецФункции


&НаКлиенте
Процедура ДокументыПриАктивизацииСтроки(Элемент)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Элементы.Документы.ТекущиеДанные.Документ) Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
	Элементы.Меню.Доступность = Истина;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ПараметрыДокумента) Тогда
		ПолучитьДанныеДляПечати(ТекущиеДанные)	
	КонецЕсли; 	
	
	Попытка
		Если ТекущиеДанные.ПараметрыДокумента.МассивЧеков.Количество()>0 Тогда
			АдресЭлектроннойПочты = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail;
			НомерТелефона = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер;

			НастройкиОтправкиСообщений = ПолучитьНастройки(ТекущиеДанные.Документ);
			
			Если НастройкиОтправкиСообщений <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиОтправкиСообщений, "ОтправлятьEmail, ОтправлятьSMS");
			КонецЕсли;
			
			ОтправлятьEmail = ОтправлятьEmail И ЗначениеЗаполнено(АдресЭлектроннойПочты);
			ОтправлятьSMS   = ОтправлятьEmail И ЗначениеЗаполнено(НомерТелефона);			
			// 10.07.2020
			ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПолучательИНН = ТекущиеДанные.Контрагент;
//			ОбъектДока = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ДокументОснование.Ссылка.ПолучитьОбъект(); 
            ОбъектДока = ПолучитьНастройкиКонтрагента(ТекущиеДанные.Документ);
			//ОбъектДока = ТекущиеДанные.Документ.ПолучитьОбъект()
						 // БИТ ЖКХ 04.02.2021 
			ОбновитьПечатнуюФорму(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0], ТекущиеДанные);
			Организация = Строка(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Организация);
			СистемаНалогообложения = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].СистемаНалогообложения;
			
		КонецЕсли;
	Исключение
		
		ОтправлятьEmail = Ложь;
		
		ОтправлятьSMS = Ложь;
		
		АдресЭлектроннойПочты = "";
		
		НомерТелефона = "";
		
		Элементы.Меню.Доступность = Ложь;
				
		Организация = "";
		
		СистемаНалогообложения = Неопределено;
		
		ПечатнаяФорма.УстановитьТекст("");
		
	КонецПопытки;
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьПечатнуюФорму(ПараметрыЧека, ТекущиеДанные = неопределено)
	
 // БИТ ЖКХ 20.01.2021
 если ТекущиеДанные = неопределено тогда     
     возврат;                                
 конецесли;	 
 
// БИТ ЖКХ 13.07.2020	
 ПараметрыЧека.Получатель = "";
 ПараметрыЧека.ПолучательИНН = ""; 	
 
 если ТекущиеДанные.Контрагент <> "" тогда
     
     ПараметрыЧека.Получатель = ТекущиеДанные.Контрагент;
    
 конецесли;	
 
 если ТекущиеДанные.Адрес <> "" тогда
   если ПараметрыЧека.Получатель <> "" тогда  
     ПараметрыЧека.Получатель = ПараметрыЧека.Получатель + "; " + ТекущиеДанные.Адрес;
   иначе	 
	 ПараметрыЧека.Получатель = ТекущиеДанные.Адрес;  
   конецесли;	   
 конецесли;	

 если ТекущиеДанные.ЛицевойСчет <> "" тогда
   если ПараметрыЧека.Получатель <> "" тогда  
     ПараметрыЧека.Получатель = ПараметрыЧека.Получатель + "; " + ТекущиеДанные.ЛицевойСчет;
   иначе	 
	 ПараметрыЧека.Получатель = ТекущиеДанные.ЛицевойСчет;  
   конецесли;	 
     
 конецесли; 
 
 // БИТ ЖКХ 19.02.2021
 //ТекстЧека = МенеджерОборудованияКлиентСервер.СформироватьТекстНефискальногоЧека(ПараметрыЧека);	
 ТекстЧека = СформироватьТекстНефискальногоДокумента(0, ПараметрыЧека, , , );
 
 ПечатнаяФорма.УстановитьТекст(ТекстЧека);
 
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].СистемаНалогообложения = СистемаНалогообложения;
	
    //БИТ ЖКХ 22.01.2021		
	ОбновитьПечатнуюФорму(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0], ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
	Устройство = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.ИдентификаторУстройства;	
	
	Если ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = АдресЭлектроннойПочты;
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail = ПолучитьНастройкиОтправкиОтчетов(Устройство).Отправляет1СEmail;
	Иначе
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail = "";
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail = Ложь;
	КонецЕсли;
	
	ОтправлятьEmail = ЗначениеЗаполнено(АдресЭлектроннойПочты);
	
	ОбработкаПроверкиЗаполненияНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
	Устройство = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.ИдентификаторУстройства;	
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер = НомерТелефона;
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS = ПолучитьНастройкиОтправкиОтчетов(Устройство).Отправляет1СSMS;
	Иначе
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер = "";
		ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS = Ложь;			
	КонецЕсли;
	
	ОтправлятьSMS = ЗначениеЗаполнено(НомерТелефона);
	
	ОбработкаПроверкиЗаполненияНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОтправкиОтчетов(Устройство)	
	Возврат РегистрыСведений.ОборудованиеПоОрганизациям.Получить(Новый Структура("Оборудование", Устройство));		
КонецФункции

&НаКлиенте
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ)
	
	Отправляет1СSMS = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СSMS;
	Отправляет1СEmail = Элементы.Документы.ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Отправляет1СEmail;
	
	// Чек должен отправляться только через ОФД любым из способов
	ЧекОтправляетсяЧерезОФД = (НЕ ОтправлятьSMS ИЛИ НЕ Отправляет1СSMS) И (НЕ ОтправлятьEmail ИЛИ НЕ Отправляет1СEmail) 
		И (ОтправлятьSMS ИЛИ ОтправлятьEmail);
	
	Если НЕПечататьЧек И НЕ ЧекОтправляетсяЧерезОФД Тогда
		ОписаниеОшибки = НСтр("ru = 'Необходимо либо напечатать чек либо отправить его в электронном виде по email/sms через ОФД.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, ,"ПечататьЧек", "Объект", Отказ);
	Иначе
		Если ОтправлятьEmail Тогда
			Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ТекстСообщения = "";
				ВидСообщения   = "Заполнение";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения,"Адрес электронной почты",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "АдресЭлектроннойПочты", "Объект", Отказ);
			ИначеЕсли НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресЭлектроннойПочты) Тогда 
				ТекстСообщения = НСтр("ru = 'Неверный формат адреса электронной почты.'");
				ВидСообщения   = "Корректность";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения,"Адрес электронной почты",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "АдресЭлектроннойПочты", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ОтправлятьSMS Тогда
			НомерТелефонаБезПрефикса = ?(СтрНайти(НомерТелефона, "+") = 1, Сред(НомерТелефона, 2), НомерТелефона);
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				ТекстСообщения = "";
				ВидСообщения   = "Заполнение";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения, "Номер телефона",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "НомерТелефона", "Объект", Отказ);
			ИначеЕсли НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерТелефонаБезПрефикса) 
				ИЛИ НЕ ОрганизацииФормыКлиентСервер.ТелефонСоответствуетТребованиям(НомерТелефонаБезПрефикса) Тогда
				
				ТекстСообщения = НСтр("ru = 'Неверный формат номера телефона.'");
				ВидСообщения   = "Корректность";
				
				ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", ВидСообщения, "Номер телефона",,,ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, , "НомерТелефона", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		// Если отправляем и по emal и по SMS и при этом пользуемся услугами ОФД.
		Если ОтправлятьEmail И ОтправлятьSMS 
			И НЕ(Отправляет1СEmail ИЛИ Отправляет1СSMS) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При отправке электронного чека через ОФД необходимо выбрать или email или sms'"), ,,,Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Объект.Документы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДокументОткрытие(Элемент, СтандартнаяОбработка)
	
	Строка = Объект.Документы.НайтиСтроки(Новый Структура("Документ", Элементы.Документы.ТекущиеДанные.Документ))[0];	
	Строка.ПараметрыДокумента = Неопределено;
	ПечатнаяФорма.Очистить();
	
	ОтправлятьEmail = Ложь;
	
	ОтправлятьSMS = Ложь;
	
	АдресЭлектроннойПочты = "";
	
	НомерТелефона = "";
	
	Элементы.Меню.Доступность = Ложь;
	
	Организация = "";
	
	СистемаНалогообложения = Неопределено;
	
	ПечатнаяФорма.УстановитьТекст("");

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриОкончанииРедактированияНаСервере()
    ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Элементы.Документы.ТекущиеДанные.Документ) Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
	Элементы.Меню.Доступность = Истина;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ПараметрыДокумента) Тогда
		ПолучитьДанныеДляПечати(ТекущиеДанные)	
	КонецЕсли;
	
	
	Попытка
		Если ТекущиеДанные.ПараметрыДокумента.МассивЧеков.Количество()>0 Тогда
			АдресЭлектроннойПочты = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательEmail;
			НомерТелефона = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПокупательНомер;

			НастройкиОтправкиСообщений = ПолучитьНастройки(ТекущиеДанные.Документ);
			
			Если НастройкиОтправкиСообщений <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиОтправкиСообщений, "ОтправлятьEmail, ОтправлятьSMS");
			КонецЕсли;
			
			ОтправлятьEmail = ОтправлятьEmail И ЗначениеЗаполнено(АдресЭлектроннойПочты);
			ОтправлятьSMS   = ОтправлятьEmail И ЗначениеЗаполнено(НомерТелефона);			
			
			ОбновитьПечатнуюФорму(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0], ТекущиеДанные);
			Организация = Строка(ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].Организация);
			СистемаНалогообложения = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].СистемаНалогообложения;
			
		КонецЕсли;
	Исключение
		
		ОтправлятьEmail = Ложь;
		
		ОтправлятьSMS = Ложь;
		
		АдресЭлектроннойПочты = "";
		
		НомерТелефона = "";
		
		Элементы.Меню.Доступность = Ложь;
				
		Организация = "";
		
		СистемаНалогообложения = Неопределено;
		
		ПечатнаяФорма.УстановитьТекст("");
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
  попытка	
		
   для каждого стр из Элемент.ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0].ПозицииЧека цикл	  
	стр.ПризнакСпособаРасчета = Элемент.ТекущиеДанные.ПризнакиСпособаРасчета;
   конеццикла;
   ДокументыПриОкончанииРедактированияНаСервере();
  исключение
  конецпопытки;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПризнакиСпособаРасчетаПриИзменении(Элемент)
	
 ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
 Если ТекущиеДанные.ПараметрыДокумента.МассивЧеков.Количество()>0 Тогда
  ПараметрыЧека = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0];
// БИТ ЖКХ 04.02.2021 
	 попытка
	     для каждого стр из ПараметрыЧека.ПозицииЧека цикл
	      если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчета") тогда
	    	стр.ПризнакСпособаРасчета = ТекущиеДанные.ПризнакиСпособаРасчета;
	      конецесли;
	      если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчетаОплатаКредита") И 
	    	    ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ПризнакСпособаРасчетаОплатаКредита") тогда
	    	стр.ПризнакСпособаРасчетаОплатаКредита = ТекущиеДанные.ПризнакСпособаРасчетаОплатаКредита;
	      конецесли;
	      если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчетаАванс") И
	    	    ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ПризнакиСпособаРасчета") тогда
	    	стр.ПризнакСпособаРасчетаАванс = ТекущиеДанные.ПризнакиСпособаРасчета;
	      конецесли
	     конеццикла;
	 исключение
	 конецпопытки;	 	 
  ТекстЧека = МенеджерОборудованияКлиентСервер.СформироватьТекстНефискальногоЧека(ПараметрыЧека);	
 
  ПечатнаяФорма.УстановитьТекст(ТекстЧека);
 КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДокументыНДСАвансаПриИзменении(Элемент)
 ТекущиеДанные = Объект.Документы.НайтиСтроки(Новый Структура("Документ",Элементы.Документы.ТекущиеДанные.Документ))[0];
	
 Если ТекущиеДанные.ПараметрыДокумента.МассивЧеков.Количество()>0 Тогда
  ПараметрыЧека = ТекущиеДанные.ПараметрыДокумента.МассивЧеков[0];
// БИТ ЖКХ 04.02.2021 
	 попытка
	     для каждого стр из ПараметрыЧека.ПозицииЧека цикл
	      если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчета") тогда
	    	стр.ПризнакСпособаРасчета = ТекущиеДанные.ПризнакиСпособаРасчета;
	      конецесли;
	      если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчетаОплатаКредита") И 
	    	    ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ПризнакСпособаРасчетаОплатаКредита") тогда
	    	стр.ПризнакСпособаРасчетаОплатаКредита = ТекущиеДанные.ПризнакСпособаРасчетаОплатаКредита;
	      конецесли;
	      если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, "ПризнакСпособаРасчетаАванс") И
	    	    ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ПризнакиСпособаРасчета") тогда
	    	стр.ПризнакСпособаРасчетаАванс = ТекущиеДанные.ПризнакиСпособаРасчета;
	      конецесли
	     конеццикла;
	 исключение
	 конецпопытки;	 	 
  ТекстЧека = МенеджерОборудованияКлиентСервер.СформироватьТекстНефискальногоЧека(ПараметрыЧека);	
 
  ПечатнаяФорма.УстановитьТекст(ТекстЧека);
 КонецЕсли; 

КонецПроцедуры
// Функция проверяет возможность печати чека на фискальном регистраторе.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма документа
//
// Возвращаемое значение:
//	Булево - Признак возможности печати
//
// БИТ ЖКХ 19.02.2021
Функция СформироватьТекстНефискальногоДокумента(ТипДокумента, ОбщиеПараметры, ШиринаСтроки = 32, ДополнительныйТекст = Неопределено, ФорматФФД = "1.1") Экспорт
	
	ПозицииЧека  = ?(ОбщиеПараметры.Свойство("ПозицииЧека"), ОбщиеПараметры.ПозицииЧека, Неопределено);
	ТаблицаОплат = ?(ОбщиеПараметры.Свойство("ТаблицаОплат"), ОбщиеПараметры.ТаблицаОплат, Неопределено);
	
	Если ТипДокумента = 0 Тогда
		ТипыЧеков = Новый Соответствие();
		ТипыЧеков.Вставить(1, НСтр("ru='ПРИХОД'"));          // Чек продажи     
		ТипыЧеков.Вставить(2, НСтр("ru='ВОЗВРАТ ПРИХОДА'")); // Чек возврата продажи 
		ТипыЧеков.Вставить(3, НСтр("ru='РАСХОД'"));          // Чек покупки 
		ТипыЧеков.Вставить(4, НСтр("ru='ВОЗВРАТ РАСХОДА'")); // Чек возврата покупки 
		ТипЧека = ТипыЧеков.Получить(МенеджерОборудованияКлиентСервер.КодРасчетаДенежнымиСредствами(ОбщиеПараметры.ТипРасчета))
	ИначеЕсли ТипДокумента = 1 Тогда
		ТипЧека = НСтр("ru='ОТКРЫТИЕ СМЕНЫ'");  
	ИначеЕсли ТипДокумента = 2 Тогда
		ТипЧека = НСтр("ru='ВНЕСЕНИЕ'");  
	ИначеЕсли ТипДокумента = 3 Тогда
		ТипЧека = НСтр("ru='ВЫЕМКА'");  
	ИначеЕсли ТипДокумента = 4 Тогда
		ТипЧека = НСтр("ru='ОТЧЕТ БЕЗ ГАШЕНИЯ'");   
	ИначеЕсли ТипДокумента = 5 Тогда
		ТипЧека = НСтр("ru='ОТЧЕТ С ГАШЕНИЕМ'");  
	КонецЕсли;
	
	ПечатьКлише = Истина;
	
	Разделитель = ПостроитьПоле("", ШиринаСтроки, "=") + Символы.ПС;
	РазделительВнут = ПостроитьПоле("", ШиринаСтроки, "-") + Символы.ПС;
	
	Текст = Разделитель;
	
	Если ПечатьКлише Тогда 
		// Сформировать шапку чека.
		Если ОбщиеПараметры.Свойство("ОрганизацияНазвание") И НЕ ПустаяСтрока(ОбщиеПараметры.ОрганизацияНазвание) Тогда
			Текст = Текст + ПостроитьПолеПереносом(ОбщиеПараметры.ОрганизацияНазвание, ШиринаСтроки, , Истина) + Символы.ПС;
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("АдресРасчетов") Тогда
			АдресРасчетов = ОбщиеПараметры.АдресРасчетов;
			Если НЕ ПустаяСтрока(АдресРасчетов) Тогда
				Текст = Текст + ПостроитьПолеПереносом(АдресРасчетов, ШиринаСтроки, , Истина) + Символы.ПС;
				Если ОбщиеПараметры.Свойство("МестоРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.МестоРасчетов) Тогда
					Текст = Текст + ПостроитьПолеПереносом(ОбщиеПараметры.МестоРасчетов, ШиринаСтроки, , Истина) + Символы.ПС;
				КонецЕсли;
			ИначеЕсли ОбщиеПараметры.Свойство("АдресМагазина") И НЕ ПустаяСтрока(ОбщиеПараметры.АдресМагазина) Тогда
				Текст = Текст + ПостроитьПолеПереносом(ОбщиеПараметры.АдресМагазина, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
		КонецЕсли;
			
		Если ОбщиеПараметры.Свойство("ТекстШапки") И НЕ ПустаяСтрока(ОбщиеПараметры.ТекстШапки) Тогда
			Текст = Текст + ВыстроитьПоля(ОбщиеПараметры.ТекстШапки, , ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		
		Если ТипДокумента = 0 Тогда 
			Текст = Текст +  ВыстроитьПоля(НСтр("ru='КАССОВЫЙ ЧЕК'"), , ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		
		ОрганизацияИНН = ?(ОбщиеПараметры.Свойство("ОрганизацияИНН") И НЕ ПустаяСтрока(ОбщиеПараметры.ОрганизацияИНН), 
			НСтр("ru='ИНН'") + Символы.НПП + ОбщиеПараметры.ОрганизацияИНН, "");
			
		НомерЧека = ?(ОбщиеПараметры.Свойство("НомерЧека") И НЕ ПустаяСтрока(ОбщиеПараметры.НомерЧека),
			НСтр("ru='ЧЕК №'") + ОбщиеПараметры.НомерЧека, "");
			
		Если Не ПустаяСтрока(ОрганизацияИНН) Тогда
			Текст = Текст + ВыстроитьПоля(ТипЧека, ОрганизацияИНН, ШиринаСтроки) + Символы.ПС;
		Иначе
			Текст = Текст + ПостроитьПоле(ТипЧека, ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		
		ДатаВремя = ?(ОбщиеПараметры.Свойство("ДатаВремя") И НЕ ПустаяСтрока(ОбщиеПараметры.ДатаВремя), ОбщиеПараметры.ДатаВремя, ТекущаяДата());
		ДатаВремя = Формат(ДатаВремя, "ДФ=""дд.ММ.гггг ЧЧ:мм""");
		Текст = Текст + ВыстроитьПоля(НомерЧека, ДатаВремя, ШиринаСтроки) + Символы.ПС;
		
		Если ТипДокумента = 0  Тогда
		
			Если НЕ ПустаяСтрока(ОбщиеПараметры.Получатель) Тогда
				Текст = Текст + ПостроитьПолеПереносом(НСтр("ru='ПОКУПАТЕЛЬ:'") + ОбщиеПараметры.Получатель, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ПолучательИНН) Тогда
				Текст = Текст + ПостроитьПоле(НСтр("ru='ИНН ПОКУПАТЕЛЯ:'") + ОбщиеПараметры.ПолучательИНН, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
		
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ПризнакАгента) Тогда
				Текст = Текст + ПостроитьПоле(ВРег(Строка(ОбщиеПараметры.ПризнакАгента)), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеПоставщика.Наименование) Тогда
				Текст = Текст + ПостроитьПолеПереносом(НСтр("ru='ПОСТАВЩИК:'") + ОбщиеПараметры.ДанныеПоставщика.Наименование, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеПоставщика.Телефон) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='ТЛФ.ПОСТ.:'"), ОбщиеПараметры.ДанныеПоставщика.Телефон, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеПоставщика.ИНН) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='ИНН ПОСТАВЩИКА:'"), ОбщиеПараметры.ДанныеПоставщика.ИНН, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Операция) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='ПЛ.АГЕНТ ОПЕР.:'"), ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Операция, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Телефон) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='ПЛ.АГЕНТ.ТЛФ.:'"), ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Телефон, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Наименование) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='ОПЕРАТОР ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Наименование, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Телефон) Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ТЛФ.ОП.ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Телефон, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Адрес) Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='АДР.ОП.ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Адрес, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеАгента.ОператорПеревода.ИНН) Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ИНН ОП.ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.ИНН, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='ОПЕР.ПО ПРИЕМУ ПЛАТ.ТЛФ:'"), ОбщиеПараметры.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДополнительныйРеквизитПользователя.Наименование) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='РЕК.ПОЛЬЗ.:'"), ОбщиеПараметры.ДополнительныйРеквизитПользователя.Наименование, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ДополнительныйРеквизитПользователя.Значение) Тогда
				Текст = Текст + ВыстроитьПоля(НСтр("ru='РЕК.ПОЛЬЗ.:'"), ОбщиеПараметры.ДополнительныйРеквизитПользователя.Значение, ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			
		КонецЕсли;
		
		Текст = Текст + РазделительВнут;
	КонецЕсли;
	
	ФорматЧисла = "ЧРД=.;ЧЦ=12;ЧДЦ=2;ЧН=0.00;ЧГ=0";
	СуммаЧека   = 0;
	СуммаПозицийНДС0   = 0;
	СуммаПозицийНДС10  = 0;
	СуммаПозицийНДС18  = 0;
	СуммаПозицийНДС20  = 0;
	СуммаПозицийНДС110 = 0;
	СуммаПозицийНДС118 = 0;
	СуммаПозицийНДС120 = 0;
	СуммаПозицийБезНДС = 0;
	СуммаНДС0   = 0;
	СуммаНДС10  = 0;
	СуммаНДС18  = 0;
	СуммаНДС20  = 0;
	СуммаНДС110 = 0;
	СуммаНДС118 = 0;
	СуммаНДС120 = 0;
	СуммаБезНДС = 0;
	
	// Формируем строки чека.
	Если ПозицииЧека <> Неопределено Тогда
		
		Для ИндексМассива = 0 По ПозицииЧека.Количество() - 1 Цикл
			
			ПозицияЧека = ПозицииЧека[ИндексМассива];
			
			Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
				Наименование = ?(ПозицияЧека.Свойство("Наименование"), ПозицияЧека.Наименование, "");
				Количество   = ?(ПозицияЧека.Свойство("Количество")  , ПозицияЧека.Количество  , 1);
				Цена         = ?(ПозицияЧека.Свойство("Цена")        , ПозицияЧека.Цена        , 0);
				Сумма        = ?(ПозицияЧека.Свойство("Сумма")       , ПозицияЧека.Сумма       , 0);
				НомерСекции  = ?(ПозицияЧека.Свойство("НомерСекции") , ПозицияЧека.НомерСекции , 0);
				СтавкаНДС    = ?(ПозицияЧека.Свойство("СтавкаНДС")   , ПозицияЧека.СтавкаНДС   , 0);
				СуммаНДС     = ?(ПозицияЧека.Свойство("СуммаНДС")    , ?(ПустаяСтрока(ПозицияЧека.СуммаНДС), 0, ПозицияЧека.СуммаНДС), 0);
				СуммаСкидок  = ?(ПозицияЧека.Свойство("СуммаСкидок") , ?(ПустаяСтрока(ПозицияЧека.СуммаСкидок), 0, ПозицияЧека.СуммаСкидок), 0);
				
				ТекстСтроки  = ПостроитьПолеПереносом(Наименование, ШиринаСтроки) + Символы.ПС;
				ЦенаДляПечати = Окр(Сумма / ?(Количество > 0, Количество, 1), 2);
				
				СтрокаТовара = Формат(Количество, "ЧРД=.;ЧЦ=12;ЧДЦ=3;ЧН=0.000;ЧГ=0") + " х " 
					+ Формат(ЦенаДляПечати, ФорматЧисла) + "=" + Формат(Сумма, ФорматЧисла);
				ТекстСтроки = Символы.ПС + ТекстСтроки + ВыстроитьПоля("", СтрокаТовара, ШиринаСтроки) + Символы.ПС;
				
				Если СуммаСкидок > 0 Тогда
					ТекстСкидки = НСтр("ru='СКИДКА'") + "=" + Формат(СуммаСкидок, ФорматЧисла);
				ИначеЕсли СуммаСкидок < 0 Тогда
					ТекстСкидки = НСтр("ru='НАДБАВКА'") + "=" + Формат(СуммаСкидок, ФорматЧисла);
				Иначе
					ТекстСкидки = "";
				КонецЕсли;
				
				ТекстНалога = "";
				Если ПозицияЧека.СтавкаНДС = 10 Тогда
					СуммаПозицийНДС10 = СуммаПозицийНДС10 + Сумма;
					СуммаНДС10 = СуммаНДС10 + СуммаНДС;
					ТекстНалога = НСтр("ru='НДС 10%'");
				ИначеЕсли ПозицияЧека.СтавкаНДС = 18 Тогда
					СуммаПозицийНДС18  = СуммаПозицийНДС18 + Сумма; 
					СуммаНДС18 = СуммаНДС18 + СуммаНДС;
					ТекстНалога = НСтр("ru='НДС 18%'");
				ИначеЕсли ПозицияЧека.СтавкаНДС = 20 Тогда
					СуммаПозицийНДС20  = СуммаПозицийНДС20 + Сумма; 
					СуммаНДС20 = СуммаНДС20 + СуммаНДС;
					ТекстНалога = НСтр("ru='НДС 20%'");
				ИначеЕсли ПозицияЧека.СтавкаНДС = 0 Тогда
					СуммаПозицийНДС0 = СуммаПозицийНДС0 + Сумма;
					СуммаНДС0 = СуммаНДС0 + СуммаНДС;
					ТекстНалога = НСтр("ru='НДС 0%'");
				ИначеЕсли ПозицияЧека.СтавкаНДС = 110 Тогда
					СуммаПозицийНДС110 = СуммаПозицийНДС110 + Сумма;
					СуммаНДС110 = СуммаНДС110 + СуммаНДС;
					ТекстНалога = НСтр("ru='НДС 10/110%'");
				ИначеЕсли ПозицияЧека.СтавкаНДС = 118 Тогда
					СуммаПозицийНДС118 = СуммаПозицийНДС118 + Сумма;
					СуммаНДС118 = СуммаНДС118 + СуммаНДС;
					ТекстНалога = НСтр("ru='НДС 18/118%'");
				ИначеЕсли ПозицияЧека.СтавкаНДС = 120 Тогда
					СуммаПозицийНДС120 = СуммаПозицийНДС120 + Сумма;
					СуммаНДС120 = СуммаНДС120 + СуммаНДС;
					ТекстНалога = НСтр("ru='НДС 20/120%'");
				Иначе 
					СуммаПозицийБезНДС = СуммаПозицийБезНДС + Сумма;
					СуммаБезНДС = СуммаБезНДС + Сумма;
					ТекстНалога = НСтр("ru='БЕЗ НДС'");
				КонецЕсли;
				
				Если ПустаяСтрока(ТекстСкидки) Тогда
					ТекстСтроки = ТекстСтроки + ПостроитьПоле(ТекстНалога, ШиринаСтроки) + Символы.ПС;
				Иначе
					ТекстСтроки = ТекстСтроки + ВыстроитьПоля(ТекстНалога, ТекстСкидки, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Текст = Текст + ТекстСтроки; 
				
				Если НЕ ПустаяСтрока(ПозицияЧека.ПризнакПредметаРасчета) Тогда
					ПризнакПредметаРасчетаНаименование = ВРег(Строка(ПозицияЧека.ПризнакПредметаРасчета));
					Текст = Текст + ПостроитьПоле(ПризнакПредметаРасчетаНаименование, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				
				//+МРЦ
				//Если НЕ ПустаяСтрока(ПозицияЧека.ПризнакСпособаРасчета) Тогда
				// БИТ ЖКХ 08.02.2021
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияЧека, "ПризнакСпособаРасчетаАванс") И
					  ПозицияЧека.Свойство("ПризнакСпособаРасчетаАванс") Тогда
					ПризнакСпособаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаСпособаРасчета(ПозицияЧека.ПризнакСпособаРасчетаАванс);
					ПризнакСпособаРасчетаНаименование = МенеджерОборудованияКлиентСервер.НаименованиеПризнакаСпособаРасчета(ПризнакСпособаРасчета);
					Текст = Текст + ПостроитьПоле(ПризнакСпособаРасчетаНаименование, ШиринаСтроки) + Символы.ПС;
				// БИТ ЖКХ 08.02.2021
			    ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияЧека, "ПризнакСпособаРасчетаОплатаКредита") И
				     ПозицияЧека.Свойство("ПризнакСпособаРасчетаОплатаКредита") Тогда
					ПризнакСпособаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаСпособаРасчета(ПозицияЧека.ПризнакСпособаРасчетаОплатаКредита);
					ПризнакСпособаРасчетаНаименование = МенеджерОборудованияКлиентСервер.НаименованиеПризнакаСпособаРасчета(ПризнакСпособаРасчета);
					Текст = Текст + ПостроитьПоле(ПризнакСпособаРасчетаНаименование, ШиринаСтроки) + Символы.ПС;
				ИначеЕсли НЕ ПустаяСтрока(ПозицияЧека.ПризнакСпособаРасчета) Тогда
				//-МРЦ
					ПризнакСпособаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаСпособаРасчета(ПозицияЧека.ПризнакСпособаРасчета);
					ПризнакСпособаРасчетаНаименование = МенеджерОборудованияКлиентСервер.НаименованиеПризнакаСпособаРасчета(ПризнакСпособаРасчета);
					Текст = Текст + ПостроитьПоле(ПризнакСпособаРасчетаНаименование, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				
				Если ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.Свойство("РеквизитКодаТовара") Тогда 
					//+МРЦ
					//Штрихкод = ПозицияЧека.Штрихкод;
					//Если ПозицияЧека.Свойство("КодВидаНоменклатурнойКлассификации") И НЕ ПустаяСтрока(ПозицияЧека.КодВидаНоменклатурнойКлассификации) Тогда
					//	Штрихкод = ПозицияЧека.КодВидаНоменклатурнойКлассификации;
					//КонецЕсли;
					//КодТовараИдентифицируетЭкземпляр = МенеджерОборудованияМаркировкаКлиентСервер.КодТовараИдентифицируетЭкземпляр(ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара, Штрихкод);
					//КодТовараТекст = Штрихкод;
					КодТовараИдентифицируетЭкземпляр = МенеджерОборудованияМаркировкаКлиентСервер.КодТовараИдентифицируетЭкземпляр(ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара, ПозицияЧека.Штрихкод);
					КодТовараТекст = "";
					//-МРЦ
					Если КодТовараИдентифицируетЭкземпляр Тогда
						//+МРЦ
						//КодТовараТекст = НСтр("ru='[М]'") + КодТовараТекст + Символы.НПП;
						КодТовараТекст = НСтр("ru='[М]'") + Символы.НПП;
						//-МРЦ
					КонецЕсли;
					Текст = Текст + ПостроитьПолеПереносом(КодТовараТекст, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ПозицияЧека.КодСтраныПроисхожденияТовара) Тогда
					Текст = Текст + ПостроитьПоле(НСтр("ru='КОД СТРАНЫ:'") + ПозицияЧека.КодСтраныПроисхожденияТовара, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.НомерТаможеннойДекларации) Тогда
					Текст = Текст + ПостроитьПолеПереносом(НСтр("ru='ДЕКЛАРАЦИЯ:'") + ПозицияЧека.НомерТаможеннойДекларации, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.СуммаАкциза) И ПозицияЧека.СуммаАкциза > 0 Тогда
					Текст = Текст + ПостроитьПоле(НСтр("ru='АКЦИЗ:'") + ПозицияЧека.СуммаАкциза, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ЕдиницаИзмерения) Тогда
					Текст = Текст + ПостроитьПоле(НСтр("ru='ЕД.ИЗМЕРЕНИЯ:'") + ПозицияЧека.ЕдиницаИзмерения, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ПозицияЧека.ПризнакАгентаПоПредметуРасчета) Тогда
					Текст = Текст + ПостроитьПоле(ВРег(Строка(ПозицияЧека.ПризнакАгентаПоПредметуРасчета)), ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеПоставщика.Наименование) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ПОСТАВЩИК:'"), ПозицияЧека.ДанныеПоставщика.Наименование, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеПоставщика.Телефон) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ТЛФ.ПОСТ.:'"), ПозицияЧека.ДанныеПоставщика.Телефон, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеПоставщика.ИНН) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ИНН ПОСТАВЩИКА:'"), ПозицияЧека.ДанныеПоставщика.ИНН, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеАгента.ПлатежныйАгент.Операция) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ПЛ.АГЕНТ ОПЕР.:'"), ПозицияЧека.ДанныеАгента.ПлатежныйАгент.Операция, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеАгента.ПлатежныйАгент.Телефон) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru=' ПЛ.АГЕНТ ТЛФ.:'"), ПозицияЧека.ДанныеАгента.ПлатежныйАгент.Телефон, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеАгента.ОператорПеревода.Наименование) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ОПЕРАТОР ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.Наименование, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеАгента.ОператорПеревода.Телефон) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ТЛФ.ОП.ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.Телефон, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеАгента.ОператорПеревода.Адрес) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='АДР.ОП.ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.Адрес, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеАгента.ОператорПеревода.ИНН) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ИНН ОП.ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.ИНН, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ОПЕР.ПО ПРИЕМУ ПЛАТ.ТЛФ:'"), ПозицияЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПозицияЧека.ДополнительныйРеквизит) Тогда
					Текст = Текст + ВыстроитьПоля(НСтр("ru='ДОП.РЕК.:'"), ПозицияЧека.ДополнительныйРеквизит, ШиринаСтроки) + Символы.ПС;
				КонецЕсли;
				
				СуммаЧека = СуммаЧека + Сумма;
			ИначеЕсли ПозицияЧека.Свойство("ТекстоваяСтрока") Тогда
				ТекстСтроки = ?(ПозицияЧека.Свойство("Текст"), ПозицияЧека.Текст, "");
				Текст = Текст + ТекстСтроки + Символы.ПС;
			ИначеЕсли ПозицияЧека.Свойство("ШтрихКод") Тогда
				СтрокаШтрихкода = "|ШтрихКод|" + ПозицияЧека.ТипШтрихкода + "|" + ПозицияЧека.ШтрихКод; 
				Текст = Текст + СтрокаШтрихкода + Символы.ПС; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Формируем подвал чека
	Если ТаблицаОплат <> Неопределено Тогда
		
		СуммаНаличными       = 0;
		СуммаЭлектронными    = 0;
		СуммаПостоплатой     = 0;
		СуммаПредоплатой     = 0;
		СуммаПредоставлением = 0;
		Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
			Если ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно") Тогда
				СуммаЭлектронными = СуммаЭлектронными + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата") Тогда
				СуммаПредоплатой = СуммаПредоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата") Тогда
				СуммаПостоплатой = СуммаПостоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление") Тогда
				СуммаПредоставлением = СуммаПредоставлением + ТаблицаОплат[ИндексОплаты].Сумма;
			Иначе
				СуммаНаличными = СуммаНаличными + ТаблицаОплат[ИндексОплаты].Сумма;
			КонецЕсли;
		КонецЦикла;
		
		СуммаОплаты = СуммаНаличными + СуммаЭлектронными + СуммаПостоплатой + СуммаПредоплатой + СуммаПредоставлением;
	
		Текст = Текст + РазделительВнут;
		Текст = Текст + ВыстроитьПоля(НСтр("ru='ИТОГ'"), "=" + Формат(СуммаЧека, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		Текст = Текст + РазделительВнут;
		
		Текст = Текст + НСтр("ru='ОПЛАТА'") + Символы.ПС;
		
		Если ФорматФФД = "1.0" Тогда // ФФД 1.0
			Если СуммаНаличными > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='НАЛИЧНЫМИ'"), "=" + Формат(СуммаНаличными, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если СуммаЭлектронными > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), "=" + Формат(СуммаЭлектронными, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если СуммаПостоплатой > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), "=" + Формат(СуммаПостоплатой, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если СуммаПредоплатой > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), "=" + Формат(СуммаПредоплатой, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;          
			Если СуммаПредоставлением > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), "=" + Формат(СуммаПредоставлением, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;          
		Иначе // ФФД 1.0.5 & ФФД 1.1
			Если СуммаНаличными > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='НАЛИЧНЫМИ'"), "=" + Формат(СуммаНаличными, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если СуммаЭлектронными > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='БЕЗНАЛИЧНЫМИ'"), "=" + Формат(СуммаЭлектронными, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если СуммаПредоплатой > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ПРЕДВАРИТЕЛЬНАЯ'"), "=" + Формат(СуммаПредоплатой, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;          
			Если СуммаПостоплатой > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ПОСЛЕДУЮЩАЯ'"), "=" + Формат(СуммаПостоплатой, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;
			Если СуммаПредоставлением > 0 Тогда
				Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='ИНАЯ ФОРМА'"), "=" + Формат(СуммаПредоставлением, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			КонецЕсли;          
		КонецЕсли; 
		
		Если СуммаОплаты - СуммаЧека > 0 Тогда
			Текст = Текст + ВыстроитьПоля(НСтр("ru='ПОЛУЧЕНО'"), "=" + Формат(СуммаОплаты, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
			Текст = Текст + ВыстроитьПоля(" " + НСтр("ru='СДАЧА'"), "=" + Формат(СуммаОплаты - СуммаЧека, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли; 
		
		Если ОбщиеПараметры.Свойство("СистемаНалогообложения") Тогда
			СистемаНалогообложенияКод = МенеджерОборудованияКлиентСервер.КодСистемыНалогообложенияККТ(ОбщиеПараметры.СистемаНалогообложения);
			СистемаНалогообложения = МенеджерОборудованияКлиентСервер.НаименованиеСистемыНалогообложения(СистемаНалогообложенияКод, Истина);
			Текст = Текст + ВыстроитьПоля(НСтр("ru='СНО:'"), СистемаНалогообложения, ШиринаСтроки) + Символы.ПС;
		КонецЕсли;          
		
		Если СуммаПозицийНДС20 > 0 Тогда
			ЗначениеНДС = ?(СуммаНДС20 > 0, СуммаНДС20, СуммаПозицийНДС20 / 120 * 20);
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА НДС 20%'"), "=" + Формат(ЗначениеНДС, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		Если СуммаПозицийНДС18 > 0 Тогда
			ЗначениеНДС = ?(СуммаНДС18 > 0, СуммаНДС18, СуммаПозицийНДС18 / 118 * 18);
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА НДС 18%'"), "=" + Формат(ЗначениеНДС, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		Если СуммаПозицийНДС10 > 0 Тогда
			ЗначениеНДС = ?(СуммаНДС10 > 0, СуммаНДС10, СуммаПозицийНДС10 / 110 * 10);
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА НДС 10%'"), "=" + Формат(ЗначениеНДС, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		Если СуммаПозицийНДС120 > 0 Тогда
			ЗначениеНДС = ?(СуммаНДС120 > 0, СуммаНДС120, СуммаПозицийНДС120 / 120 * 20);
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА НДС 20/120%'"), "=" + Формат(ЗначениеНДС, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		Если СуммаПозицийНДС118 > 0 Тогда
			ЗначениеНДС = ?(СуммаНДС118 > 0, СуммаНДС118, СуммаПозицийНДС118 / 118 * 18);
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА НДС 18/118%'"), "=" + Формат(ЗначениеНДС, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		Если СуммаПозицийНДС110 > 0 Тогда
			ЗначениеНДС = ?(СуммаНДС110 > 0, СуммаНДС110, СуммаПозицийНДС110 / 110 * 10);
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА НДС 10/110%'"), "=" + Формат(ЗначениеНДС, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		Если СуммаПозицийНДС0 > 0 Тогда
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА C НДС 0%'")  , "=" + Формат(СуммаПозицийНДС0, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		Если СуммаПозицийБезНДС > 0 Тогда
			Текст = Текст + ВыстроитьПоля(НСтр("ru=' СУММА БЕЗ НДС'"), "=" + Формат(СуммаПозицийБезНДС, ФорматЧисла), ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
		
		Кассир = ?(ОбщиеПараметры.Свойство("Кассир"), ОбщиеПараметры.Кассир, "");
		Текст = Текст + ПостроитьПоле(НСтр("ru='КАССИР'") + ":" + Символы.НПП + Кассир, ШиринаСтроки) + Символы.ПС + Символы.ПС;                        
		Текст = Текст + ПостроитьПоле(НСтр("ru='ПОДПИСЬ'") + ":", ШиринаСтроки, "_") + Символы.ПС;
		
		Если ОбщиеПараметры.Свойство("ТекстПодвала") И НЕ ПустаяСтрока(ОбщиеПараметры.ТекстПодвала) Тогда
			Текст = Текст + ВыстроитьПоля(ОбщиеПараметры.ТекстПодвала, , ШиринаСтроки) + Символы.ПС;
		КонецЕсли;
	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ДополнительныйТекст) Тогда
		Текст = Текст + ДополнительныйТекст + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + Разделитель + Символы.ПС;
	
	Возврат Текст;
	
КонецФункции
// Выстраивает строку по длине поля, если поле длинное - переносит на следующую строку.
//
Функция ПостроитьПолеПереносом(Знач Текст, Знач ДлинаПоля, ДобСимвол = "", ПоЦентру = Ложь) Экспорт
	
	ДобСимвол = ?(ПустаяСтрока(ДобСимвол), " ", ДобСимвол);
	
	Если СтрДлина(Текст) > ДлинаПоля Тогда 
		ТекстПолный = "";
		Пока СтрДлина(Текст) > ДлинаПоля Цикл
			ТекстПолный = ТекстПолный + ?(ПустаяСтрока(ТекстПолный), "", Символы.ПС) +  Лев(Текст, ДлинаПоля);
			Текст = Сред(Текст, ДлинаПоля + 1);
		КонецЦикла;
		ТекстПолный = ТекстПолный + ?(ПустаяСтрока(Текст), "", Символы.ПС + Текст);
	Иначе
		Если ПоЦентру Тогда
			ТекстПолный = Текст;
			ДобавлятьСправа = Истина; 
			Пока СтрДлина(ТекстПолный) < ДлинаПоля Цикл
				Если ДобавлятьСправа Тогда
					ТекстПолный = ТекстПолный + ДобСимвол;
				Иначе
					ТекстПолный = ДобСимвол + ТекстПолный;
				КонецЕсли;
				ДобавлятьСправа = Не ДобавлятьСправа;
			КонецЦикла;
		Иначе
			ТекстПолный = Текст;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ТекстПолный;
	
КонецФункции

// Обрезает передаваемую строку по длине поля, если поле слишком короткое - дополняет символами.
//
Функция ПостроитьПоле(Знач Текст, Знач ДлинаПоля, ДобСимвол = "", ДобавлятьСправа = Истина) Экспорт
	
	ДобСимвол = ?(ПустаяСтрока(ДобСимвол), " ", ДобСимвол);
	
	ТекстПолный = Лев(Текст, ДлинаПоля);
	Пока СтрДлина(ТекстПолный) < ДлинаПоля Цикл
		Если ДобавлятьСправа Тогда
			ТекстПолный = ТекстПолный + ДобСимвол;
		Иначе
			ТекстПолный = ДобСимвол + ТекстПолный;
		КонецЕсли;
	КонецЦикла;
	          
	Возврат ТекстПолный;
	
КонецФункции
// Формирует строку из двух полей, если передается одно поле дополняет символами до нужного размера.
//
Функция ВыстроитьПоля(Знач Текст1, Знач Текст2 = "", Знач ДлинаПоля) Экспорт
	
	Если ПустаяСтрока(Текст2) Тогда
		ТекстПолный = ПостроитьПоле(Текст1, СтрДлина(Текст1) + Цел((ДлинаПоля - СтрДлина(Текст1))/2), , Ложь);
		ТекстПолный = ПостроитьПоле(ТекстПолный, ДлинаПоля);
	ИначеЕсли СтрДлина(Текст1) + СтрДлина(Текст2) < ДлинаПоля Тогда
		ТекстПолный = ПостроитьПоле(Текст1, ДлинаПоля - СтрДлина(Текст2)) + Текст2;
	Иначе
		ТекстПолный = ПостроитьПоле(Текст1, ДлинаПоля) + Символы.ПС + ПостроитьПоле(Текст2, ДлинаПоля, ,Ложь)
	КонецЕсли;
	
	Возврат ТекстПолный;
	
КонецФункции

//  Выравнить передаваемую строку по длине поля, если поле слишком короткое - дополняет символами.
//
Функция ВыравнитьПоле(Знач Текст, Знач ДлинаПоля = 32, Знач Выравнивание = "Лево", ДобСимвол = "") Экспорт
	
	ДобСимвол = ?(ПустаяСтрока(ДобСимвол), " ", ДобСимвол);
	НачПозиция = Истина;
	ТекстПолный = Лев(Текст, ДлинаПоля);
	Пока СтрДлина(ТекстПолный) < ДлинаПоля Цикл
		Если Выравнивание = "Лево" Тогда
			ТекстПолный = ТекстПолный + ДобСимвол;
		ИначеЕсли Выравнивание = "Право" Тогда
			ТекстПолный = ДобСимвол + ТекстПолный;
		Иначе
			Если НачПозиция Тогда
				ТекстПолный = ТекстПолный + ДобСимвол;
				НачПозиция = Ложь;
			Иначе
				ТекстПолный = ДобСимвол + ТекстПолный;
				НачПозиция = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	          
	Возврат ТекстПолный;
	
КонецФункции
