
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
		Если НЕ ЗначениеЗаполнено(Запись.Номер) Тогда
			
		ПолучитьНомерЛицевойСчетНаСервере();	
			
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
		Элементы.ЛицевойСчет.Доступность = ?(ЗначениеЗаполнено(Запись.ЛицевойСчет), Ложь, Истина);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда

		Запись.ДатаЗаписи = ТекущаяДата();
		
		Запись.ЛицевойСчет = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура  ПолучитьНомерЛицевойСчетНаСервере()
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_ЗамечанияПоЛС.ЛицевойСчет,
		|	бит_ЗамечанияПоЛС.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.бит_ЗамечанияПоЛС КАК бит_ЗамечанияПоЛС
		|ГДЕ
		|	бит_ЗамечанияПоЛС.ЛицевойСчет = &ЛицевойСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
		Запрос.УстановитьПараметр("ЛицевойСчет", Запись.ЛицевойСчет);
		ТабЗначЗапрос = Запрос.Выполнить().Выгрузить();
		
		Если  ТабЗначЗапрос.Количество()=0  Тогда
			
			Запись.Номер = 1;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ТабЗначЗапрос[0].Номер) Тогда
			Запись.Номер = 1;
		Иначе
			Запись.Номер = Число(ТабЗначЗапрос[0].Номер) + 1;
		КонецЕсли; 
		
КонецПроцедуры	

#КонецОбласти