
#Область ВыводМакета

// Процедура формирует и выводит отчет.
//
// Параметры:
//       ТабДок  - ЭлементФормы.
//
Процедура СпискиГражданПрописанныхВыписанныхВывести(ДатаНач, ДатаКон,КолЛет,ТабДок,РезультатЗапроса) Экспорт 
	 
	ТабДок.Очистить();
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	
	Выборка =РезультатЗапроса.Выбрать();
	Макет = ЭтотОбъект.ПолучитьМакет("ФормаСписки");
	ЗаголовокОбласть = Макет.ПолучитьОбласть("Заголовок");
	ДеталиОбласть = Макет.ПолучитьОбласть("Детали");
	
	ЗаголовокОбласть.Параметры.ДатаТек = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	ЗаголовокОбласть.Параметры.ДатаНач = Формат(ДатаНач,"ДФ=dd.MM.yyyy");
	ЗаголовокОбласть.Параметры.ДатаКон = Формат(ДатаКон,"ДФ=dd.MM.yyyy");
	
	ТабДок.Вывести(ЗаголовокОбласть);
	
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Физлицо) Тогда
				
				ДеталиОбласть.Параметры.НомерСтроки = НомерСтроки;
				Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
					ДеталиОбласть.Параметры.ФИО = Выборка.Фамилия +" "+ Выборка.Имя + " " + Выборка.Отчество;
				Иначе
					ДеталиОбласть.Параметры.ФИО = Выборка.ФизЛицо;
				КонецЕсли;
				ДеталиОбласть.Параметры.Заполнить(Выборка);
				
				Если ЗначениеЗаполнено(Выборка.ПолФизЛицо) Тогда
					Если Выборка.ПолФизЛицо = Перечисления.ПолФизическогоЛица.Мужской Тогда 
						ДеталиОбласть.Параметры.Пол = "М";
					Иначе ДеталиОбласть.Параметры.Пол = "Ж";
					КонецЕсли;
				КонецЕсли;
				
				Адрес = "";
				Если ЗначениеЗаполнено(Выборка.Улица) Тогда
					 Адрес = Адрес +"ул." + Строка(Выборка.Улица);
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.Здание) Тогда
					Адрес = Адрес + ", д." + Строка(Выборка.Здание);
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.Корпус) Тогда
					Адрес = Адрес + ", корпус" + Строка(Выборка.Корпус);
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.Квартира) Тогда
					Адрес = Адрес + ", кв." + Строка(Выборка.Квартира);
				КонецЕсли;
				ДеталиОбласть.Параметры.Адрес = Адрес;
				
				ДокПарам1="";
				Если ЗначениеЗаполнено(Выборка.ДокДатаВыдачи) Тогда
					 ДокПарам1 = ДокПарам1 +  Строка(Формат(Выборка.ДокДатаВыдачи,"ДФ=dd.MM.yyyy"));
				КонецЕсли;
				ДокПарам2="";
				Если ЗначениеЗаполнено(Выборка.ДокСерия) Тогда
					 ДокПарам2 = ДокПарам2 + Строка(Выборка.ДокСерия);
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.ДокНомер) Тогда
					 ДокПарам2 = ДокПарам2 + ", " + Строка(Выборка.ДокНомер);
				 КонецЕсли;
				 ДеталиОбласть.Параметры.ДокПарам1 = ДокПарам1;
				 ДеталиОбласть.Параметры.ДокПарам2 = ДокПарам2;
				 
				 ТипРегистрации="";
				Если Выборка.СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно Тогда
					 ТипРегистрации = "По М.Ж.";
				КонецЕсли;
				ДеталиОбласть.Параметры.ТипРегистрации = ТипРегистрации;
				
				ДатаРег="";
				Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
					
					ДатаРег = Строка(Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy"))+ " (выбытие)";
				ИначеЕсли ЗначениеЗаполнено(Выборка.ДатаРегистрации)   Тогда
					ДатаРег = Строка(Формат(Выборка.ДатаРегистрации,"ДФ=dd.MM.yyyy"))+ " (прибытие)";
				КонецЕсли;
				 ДеталиОбласть.Параметры.ДатаРег = ДатаРег;
				
				
				НомерСтроки = НомерСтроки + 1;
				ТабДок.Вывести(ДеталиОбласть);
			
		Иначе
			
			Продолжить;	
			
		КонецЕсли; 
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти