#Область ПеременныеМодуля

&НаКлиенте
Перем мПлатежныеСистемы; // Хранит список платежных систем.

&НаКлиенте
Перем мСписокКодировок;  // Хранит список кодировок.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СоставШК.Видимость = НастроитьСоставШК;
	Элементы.СтраницыОтбор.Видимость = (Объект.ЛицевыеСчета = "По выбору");
	
	Элементы.СтраницыОтборУслуг.Видимость = (Объект.Услуги = "По выбору");
	
	Элементы.ВидОперации.Доступность = ЗначениеЗаполнено(Объект.Организация);
	
	Элементы.РабочаяПанель.Видимость = ЗначениеЗаполнено(Объект.ВидОперации);
	
	Если Объект.ПлатежнаяСистема = "Система Город" Тогда
		
		// Добавление элемента в список выбора.
		НайденныйЭлемент = Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению("Загрузка");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.ВидОперации.СписокВыбора.Добавить("Загрузка","Загрузка");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ФИО");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ФИО","ФИО");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Адрес");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("Адрес","Адрес");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ИдентификаторЛицевогоСчета");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ИдентификаторЛицевогоСчета","ИдентификаторЛицевогоСчета");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдо");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдо","НачальноеСальдо");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачислений");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачислений","СуммаНачислений");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомОплаты");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачисленийСУчетомОплаты","СуммаНачисленийСУчетомОплаты");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомОплатыИПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачисленийСУчетомОплатыИПени","СуммаНачисленийСУчетомОплатыИПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаОплаты");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаОплаты","СуммаОплаты");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоПени","НачальноеСальдоПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаПени","СуммаПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоСУчетомПени","НачальноеСальдоСУчетомПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачисленийСУчетомПени","СуммаНачисленийСУчетомПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомОплаты");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоСУчетомОплаты","НачальноеСальдоСУчетомОплаты");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомОплатыИПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоСУчетомОплатыИПени","НачальноеСальдоСУчетомОплатыИПени");
		КонецЕсли;
		Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодУслуги");
			Если НайденныйЭлемент = Неопределено Тогда  // БИТ_ЖКХ 25.11.2015 14:07:49 Ошибка в условии, вызывала задвойки "КодУслуги"
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("КодУслуги","КодУслуги");
			КонецЕсли;
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НаименованиеУслуги"); 
			Если НайденныйЭлемент = Неопределено Тогда
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НаименованиеУслуги","НаименованиеУслуги");
			КонецЕсли;
		Иначе
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодУслуги");
			Если НайденныйЭлемент <> Неопределено Тогда
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
			КонецЕсли;
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НаименованиеУслуги");
			Если НайденныйЭлемент <> Неопределено Тогда
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
			КонецЕсли;
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачалоПериода");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачалоПериода","НачалоПериода");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодДополнения");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("КодДополнения","КодДополнения");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КолПроживающих"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("КолПроживающих","КолПроживающих");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ОбщаяПлощадь"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ОбщаяПлощадь","ОбщаяПлощадь");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ШтрихКод"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ШтрихКод","ШтрихКод");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ФИОАдрес"); 
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НаселенныйПункт"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НаселенныйПункт","НаселенныйПункт");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Улица"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("Улица","Улица");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НомерДома"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НомерДома","НомерДома");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НомерКвартиры"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НомерКвартиры","НомерКвартиры");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Счетчики"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("Счетчики","Счетчики");
		КонецЕсли;
		
		Элементы.сг_НомерУслуги.Видимость               = Истина; 
		Элементы.сг_ВспомогательныйСимвол.Видимость     = Истина; 
		Элементы.сг_ФиксированныйКод.Видимость           = Истина; 
		//Элементы.сг_СимволПослеКодаДополнения.Видимость = Истина; 
		Элементы.сг_ЗаканчиватьСтрокуСимволом.Видимость = Истина;
		Элементы.Примечание.Видимость                   = Истина;
	//	Элементы.ВидЗагрузки.Видимость                   = Истина;

				
		Если Объект.ВидОперации = "Выгрузка" Тогда
			
			Элементы.РабочаяПанель.ТекущаяСтраница = Элементы.Выгрузка;
			
			Элементы.ГруппаВыводИнформации.Видимость = Истина;
			
		ИначеЕсли Объект.ВидОперации = "Загрузка" Тогда
			
			Элементы.РабочаяПанель.ТекущаяСтраница = Элементы.Загрузка;
			
		КонецЕсли;
		
	ИначеЕсли Объект.ПлатежнаяСистема = "Сбербанк" Тогда
		
		Элементы.РабочаяПанель.ТекущаяСтраница = Элементы.Выгрузка;
		
		// Удаление по элементу из списка выбора.
		НайденныйЭлемент = Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению("Загрузка");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.ВидОперации.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		Элементы.сг_НомерУслуги.Видимость               = Ложь; 
		Элементы.сг_ВспомогательныйСимвол.Видимость     = Ложь; 
		Элементы.сг_ФиксированныйКод.Видимость           = Ложь; 
		//Элементы.сг_СимволПослеКодаДополнения.Видимость = Ложь; 
		Элементы.сг_ЗаканчиватьСтрокуСимволом.Видимость = Ложь;
		Элементы.Примечание.Видимость                   = Ложь;
	//	Элементы.ВидЗагрузки.Видимость                   = Ложь;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ИдентификаторЛицевогоСчета");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдо");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачислений");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомОплаты");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомОплатыИПени");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаОплаты");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоПени");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаПени");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомПени");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомПени");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомОплаты");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомОплатыИПени");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодУслуги");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачалоПериода");
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КолПроживающих"); 
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ОбщаяПлощадь"); 
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ШтрихКод"); 
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НаименованиеУслуги"); 
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ФИОАдрес"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ФИОАдрес","ФИОАдрес");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НаселенныйПункт"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НаселенныйПункт","НаселенныйПункт");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Улица"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("Улица","Улица");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НомерДома"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НомерДома","НомерДома");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НомерКвартиры"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НомерКвартиры","НомерКвартиры");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Счетчики"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("Счетчики","Счетчики");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодДополнения");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("КодДополнения","КодДополнения");
		КонецЕсли;
		
		
		Элементы.ГруппаВыводИнформации.Видимость = Ложь;
		Объект.ВидОперации = "Выгрузка";
		
	КонецЕсли; 
	
	Объект.Вручную = Ложь;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		
	Объект.Услуги = "Все";
	
	Объект.ЛицевыеСчета = "Все";
	
	Объект.ВыводИнформации = "С разбивкой по услугам";
	Объект.ВводИнформации  = "С разбивкой по услугам";
	Объект.Вручную         = Ложь;
	
	Если НЕ ЗначениеЗаполнено(сг_ВспомогательныйСимвол) Тогда
		
		сг_ВспомогательныйСимвол = "#";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(сг_СимволРазделения) Тогда
		
		сг_СимволРазделения = ";";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(сг_СимволПослеКодаДополнения) Тогда
		
		сг_СимволПослеКодаДополнения = ":";
		
	КонецЕсли; 
	
	сг_ИмяЛСВФайле = Элементы.сг_ВыгружатьЛС.СписокВыбора[0].Значение;
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	УправлениеЭлементамиФормы();
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	Массив.Добавить(Тип("Число"));
	Массив.Добавить(Тип("Дата"));
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(100);
	КД = Новый КвалификаторыДаты();
	
	Элементы.НастройкаПолейСтрокиРеестраСальдоТип.ДоступныеТипы         = Новый ОписаниеТипов(Массив, КЧ, КС,КД);
	Элементы.НастройкаПолейСтрокиРеестраСальдоТип.РазрешитьСоставнойТип = Ложь;
	
	Элементы.УсловиеОтбора.СписокВыбора.Добавить(ВидСравнения.ВСписке);
	Элементы.УсловиеОтбора.СписокВыбора.Добавить(ВидСравнения.НеВСписке);
	
	УсловиеОтбора = ВидСравнения.ВСписке;
	
	Элементы.УсловиеОтбораУслуг.СписокВыбора.Добавить(ВидСравнения.ВСписке);
	Элементы.УсловиеОтбораУслуг.СписокВыбора.Добавить(ВидСравнения.НеВСписке);
	
	УсловиеОтбораУслуг = ВидСравнения.ВСписке;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ПлатежнаяСистема.СписокВыбора.Добавить("Система Город", "Система Город", , БиблиотекаКартинок.бит_СистемаГородЛоготип);
	Элементы.ПлатежнаяСистема.СписокВыбора.Добавить("Сбербанк", "Сбербанк", , );// БИТ_ЖКХ_изменение_19072013
	
	Объект.ВидЗагрузки = "ОплатаКУ";
	Объект.ПлатежнаяСистема = неопределено;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПлатежнаяСистемаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
	Если Объект.ПлатежнаяСистема = "Сбербанк" Тогда
		МассивСтр = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Новый Структура("ИмяПоля","КодУслуги"));
		Для Каждого Элт Из МассивСтр Цикл
			Элт.Использовать = Ложь;	
		КонецЦикла;
	
	КонецЕсли;	

	//16.05.2019
	если Объект.ВидЗагрузки = "ПоказанияСчетчиков" тогда
	  Элементы.ДеревоОплатыСоздатьВводПоказанийПоСчетчикам.Видимость = истина;
	  Элементы.СоздатьОплаты.Видимость = ложь;
    иначе
	  Элементы.ДеревоОплатыСоздатьВводПоказанийПоСчетчикам.Видимость = ложь;
	  Элементы.СоздатьОплаты.Видимость = истина;
    конецесли;	   
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПриИзменении(Элемент)
	
	Элементы.СтраницыОтбор.Видимость = (Объект.ЛицевыеСчета = "По выбору");
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ИмяФайлаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок               = "Выберите файл";
	ДиалогВыбораФайла.ПолноеИмяФайла          = Объект.сг_ИмяФайлаВыгрузки;
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.Фильтр                  = "Файл данных (*.txt)|*.txt";
	ДиалогВыбораФайла.Расширение              = "txt";
	ДиалогВыбораФайла.ИндексФильтра           = 0;
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ДиалогВыбораФайлаВыгрузкиЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораФайлаВыгрузкиЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
    
    Если РезультатВыбора = Неопределено Тогда
        Возврат;
    КонецЕсли;
	Объект.сг_ИмяФайлаВыгрузки = РезультатВыбора[0];

КонецПроцедуры

&НаКлиенте
Процедура сг_ИмяФайлаВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.сг_ИмяФайлаВыгрузки);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевыхСчетовЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок         		   = "Выберите файл";
	ДиалогВыбораФайла.ПолноеИмяФайла    		   = сг_ФайлЗагрузки;
	ДиалогВыбораФайла.МножественныйВыбор           = Ложь;
	ДиалогВыбораФайла.ПредварительныйПросмотр      = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла  = Истина;
	ДиалогВыбораФайла.Фильтр					   = "Файл данных (*.txt);Табличный документ(*.dbf)|*.txt;*.dbf";
	ДиалогВыбораФайла.Расширение				   = "txt";
	ДиалогВыбораФайла.ИндексФильтра				   = 0;
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ДиалогВыбораФайлаЗагрузкиЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораФайлаЗагрузкиЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
    
    Если РезультатВыбора = Неопределено Тогда
        Возврат;
    КонецЕсли;
	сг_ФайлЗагрузки = РезультатВыбора[0];

КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗагрузкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) 
		И ЗначениеРеквизитаОбъектаНаСервере(ВыбранноеЗначение,"ПометкаУдаления") Тогда
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("ru = 'Шаблон помечен на удаление, выберите другой вариант шаблона.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъектаНаСервере(Объект ,РеквизитОбъекта)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, РеквизитОбъекта);	
	
КонецФункции

&НаКлиенте
Процедура сг_ФайлЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(сг_ФайлЗагрузки);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДатаОплаты_ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	
	если ТипЗнч(ТекДанные.ДатаОплаты_ЛицевойСчет_Услуга) = Тип("Дата") Тогда
		СтандартнаяОбработка = истина;
   	иначе
	//14.12.2018
	//16.01.2019  59
	//Если НЕ ТекДанные.ПолучитьРодителя() = Неопределено  И ТекДанные.ПолучитьЭлементы().Количество() > 0 Тогда;
	  если ТипЗнч(ТекДанные.ДатаОплаты_ЛицевойСчет_Услуга) = Тип("СправочникСсылка.бит_ЛицевыеСчета") Тогда	
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Объект.Организация);
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор", Отбор),Элемент);
		
	  конецесли;	
	
	  если ТипЗнч(ТекДанные.ДатаОплаты_ЛицевойСчет_Услуга) = Тип("СправочникСсылка.бит_УслугиЖКХ") Тогда	
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Объект.Организация);
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор", Отбор),Элемент);
		
	  конецесли;	

	//ИначеЕсли НЕ ТекДанные.ПолучитьРодителя() = Неопределено  И ТекДанные.ПолучитьЭлементы().Количество() = 0 Тогда;
	//	
	//	СтандартнаяОбработка = Ложь;
	//	
	//	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",,Элемент);
	//	
	//КонецЕсли; 
	конецесли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыИсточникОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	
	СтандартнаяОбработка = ТекДанные.ПолучитьРодителя() = Неопределено 
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДокументОплатыОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДокументОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДокументОплатыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	Если Тип(ТекущиеДанные.Тип) = Тип("Строка") Тогда
		
		Текст = "Нельзя назначить формат на поля с типом ""Строка""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли; 
	
	КонструкторФорматнойСтроки = Новый КонструкторФорматнойСтроки;
	КонструкторФорматнойСтроки.Текст = ТекущиеДанные.Формат;
	
	КонструкторФорматнойСтроки.Показать(Новый ОписаниеОповещения("НастройкаПолейСтрокиРеестраСальдоФорматНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("КонструкторФорматнойСтроки, ТекущиеДанные", КонструкторФорматнойСтроки, ТекущиеДанные))); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		
		ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
		
		Индекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(ТекущаяСтрока);
		
		ТекущаяСтрока.Использовать = Истина;
		ТекущаяСтрока.Порядок      = Индекс + 1;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоПослеУдаления(Элемент)
	
	Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
		СтрокаТаблицы.Порядок = НастройкаПолейСтрокиРеестраСальдо.Индекс(СтрокаТаблицы) + 1;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоИспользоватьВИтогахПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	Попытка
		
		Если НЕ Тип(ТекущаяСтрока.Тип) = Тип("Число") Тогда
			
			ТекущаяСтрока.ИспользоватьВИтогах = Ложь;
			
			Текст = "Тип поля " + ТекущаяСтрока.ИмяПоля + " не предназначен для расчета итогов.";
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			
		КонецЕсли;
		
	Исключение
		ТекущаяСтрока.ИспользоватьВИтогах = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип не назначен.");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоФорматОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	Если Тип(ТекущиеДанные.Тип) = Тип("Строка") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Текст = "Нельзя назначить формат на поля с типом ""Строка""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевыхСчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработатьВыбранныеЗначения(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводИнформацииПриИзменении(Элемент)
	Если Объект.ВыводИнформации = "Без разбивки по услугам" Тогда
		ПараметрыОтбора = Новый Структура("ИмяПоля","КодУслуги");
		МассивНастроек = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ЭлементМассива Из МассивНастроек Цикл
			НастройкаПолейСтрокиРеестраСальдо.Удалить(ЭлементМассива);	
		КонецЦикла;
		ПараметрыОтбора = Новый Структура("ИмяПоля","НаименованиеУслуги");
		МассивНастроек = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ЭлементМассива Из МассивНастроек Цикл
			НастройкаПолейСтрокиРеестраСальдо.Удалить(ЭлементМассива);	
		КонецЦикла;
		Ном = 0;
		Для Каждого СтрокаНастроек Из НастройкаПолейСтрокиРеестраСальдо Цикл
			Ном = Ном + 1;
			СтрокаНастроек.Порядок = Ном;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		
		Объект.Услуги = "По выбору"; 
		Элементы.Услуги.Видимость = Истина;
		Элементы.СтраницыОтборУслуг.Видимость = Истина;
		
	ИначеЕсли Объект.ВыводИнформации = "Без разбивки по услугам" Тогда
		
		Объект.Услуги = "Все"; 

		Элементы.Услуги.Видимость			  = Истина;
		Элементы.СтраницыОтборУслуг.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	
	ТриУровня = Ложь;
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	Для каждого СтрокаКорня Из Корень Цикл
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		Для Каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
			Если ТретийУровень.Количество() > 0 Тогда
				ТриУровня = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТриУровня Тогда
		Если ТекДанные.ПолучитьРодителя() <> Неопределено Тогда
			Родитель = ТекДанные.ПолучитьРодителя();
			КореньРодителя = Родитель.ПолучитьЭлементы();
			Итог = 0;
			Для каждого СтрокаКорня Из КореньРодителя Цикл
				Итог = Итог + СтрокаКорня.Сумма;
			КонецЦикла;
			Родитель.Сумма = Итог;
			РодительРодитель = ТекДанные.ПолучитьРодителя().ПолучитьРодителя();
			КореньРодительРодитель = РодительРодитель.ПолучитьЭлементы();
			ИтогРодителя = 0;
			Для каждого СтрокаКорня Из КореньРодительРодитель Цикл
				ИтогРодителя = ИтогРодителя + СтрокаКорня.Сумма;
			КонецЦикла;
			РодительРодитель.Сумма = ИтогРодителя;
		КонецЕсли;
	Иначе
		Если ТекДанные.ПолучитьРодителя() <> Неопределено Тогда
			Родитель = ТекДанные.ПолучитьРодителя();
			КореньРодителя = Родитель.ПолучитьЭлементы();
			Итог = 0;
			Для каждого СтрокаКорня Из КореньРодителя Цикл
				Итог = Итог + СтрокаКорня.Сумма;
			КонецЦикла;
			Родитель.Сумма = Итог;
		КонецЕсли;
	КонецЕсли;
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СуммаИтоИтогов = 0;
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИтогПоДокументу      = СтрокаКорня.Сумма;
		СуммаИтогПоДокументу = 0;
		
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		
		МассивЛС = Новый Массив;
		
		ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
		
		Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			
			Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
				
				ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
				СуммаИтогПоЛС = 0;
				
				ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
				
				Если ТретийУровень.Количество() = 0 Тогда
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
					
				Иначе
					
					Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
						
						Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
							
							СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
							
						КонецЕсли;
						
					КонецЦикла; 
					
					Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
						
						МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
						
					КонецЕсли; 
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
					
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла; 
		СуммаИтоИтогов = СуммаИтоИтогов + СуммаИтогПоДокументу;
	КонецЦикла; 
	Объект.ТекстИтогоДокумент = "Итого по дереву без учета процента: "+Строка(СуммаИтоИтогов);
	Объект.Вручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыПриАктивизацииЯчейки(Элемент)
	
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	ТекСтрока = Элементы.ДеревоОплаты.ТекущаяСтрока;
	
	ТриУровня = Ложь;
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	Для каждого СтрокаКорня Из Корень Цикл
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		Для Каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
			Если ТретийУровень.Количество() > 0 Тогда
				ТриУровня = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТекДанные <> Неопределено Тогда	
		Если ТриУровня Тогда		
			Если ТекДанные.ПолучитьРодителя() = Неопределено Тогда
				Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
					Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
				КонецЕсли;
			Иначе
				Если ТекДанные.ПолучитьРодителя().ПолучитьРодителя() = Неопределено Тогда
					Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
						Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
					КонецЕсли;
				Иначе
					Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
						Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТекДанные.ПолучитьРодителя() = Неопределено Тогда
				Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
					Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
				КонецЕсли;
			Иначе
				Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
					Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСоставШКПриИзменении(Элемент)
	Элементы.СоставШК.Видимость = НастроитьСоставШК;
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	Элементы.СтраницыОтборУслуг.Видимость = (Объект.Услуги = "По выбору");
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ВыбратьСтандартныйПериод(Команда)
	
	СтандартныйПериод.ДатаНачала         = Объект.сг_НачалоПериода;
	СтандартныйПериод.ДатаОкончания      = Объект.сг_КонецПериода;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = СтандартныйПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьСтандартныйПериодЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтандартныйПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если ЗначениеЗаполнено(Период) Тогда
		СтандартныйПериод = Диалог.Период;
		Объект.сг_НачалоПериода    = СтандартныйПериод.ДатаНачала;
		Объект.сг_КонецПериода     = СтандартныйПериод.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	Если Объект.ВидОперации = "Выгрузка" Тогда
		
		СтрокиСчетчки = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Новый Структура("ИмяПоля","Счетчики"));
		Если СтрокиСчетчки.Количество() = 1 Тогда
			
			Если НастройкаПолейСтрокиРеестраСальдо.Количество() <> СтрокиСчетчки[0].Порядок Тогда
				ТекстСообщения = НСтр("ru = 'Выгрузка остановлена! Счетчики должны указываться последними в списке полей.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
			
		ИначеЕсли СтрокиСчетчки.Количество() > 1 Тогда
			
			ТекстСообщения = НСтр("ru = 'Выгрузка остановлена! Счетчики указаны в списке полей дважды. Необходимо удалить лишнее поле.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкаПолейСтрокиРеестраСальдо.Количество() = 0 Тогда
		
		Текст = "Формат реестра выгрузки не настроен!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли; 
	
	Текст = Новый ТекстовыйДокумент;
	
	Если Объект.ПлатежнаяСистема = "Система Город" Тогда
		сгВыгрузить(Текст);
	Иначе
		сбВыгрузить(Текст);
	КонецЕсли;
	
	Попытка
		
		Текст.Записать(Объект.сг_ИмяФайлаВыгрузки, КодировкаТекста[Кодировка]);
		
	Исключение

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+ ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	ВыбФайл = Новый Файл(сг_ФайлЗагрузки);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл не существует!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивОшибок = Новый Массив;
	
	Если НРег(Прав(сг_ФайлЗагрузки,4)) = ".dbf" Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные(сг_ФайлЗагрузки);
		
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
		Если Объект.ВводИнформации = "С разбивкой по услугам" Тогда
			ПрочитатьDBFФайлНаСервере(МассивОшибок, ПутьВоВременномХранилище, Истина);
		Иначе
			// БИТ ЖКХ 25.03.2021
			если строка(Объект.ШаблонЗагрузки) = "Шаблон DBF" тогда	
			 ЗагрузитьDBFФайлНаСервере(МассивОшибок, ПутьВоВременномХранилище, Ложь);
			иначе	
			 ПрочитатьDBFФайлНаСервере(МассивОшибок, ПутьВоВременномХранилище, Ложь);
			конецесли; 
		КонецЕсли;
		
		Если МассивОшибок.Количество() > 0 Тогда
			Для каждого Ошибка Из МассивОшибок Цикл
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Ошибка);
			КонецЦикла; 
		КонецЕсли;
		
	Иначе	
		
		ТекстФайл = Новый ТекстовыйДокумент;
		Попытка
			ТекстФайл.Прочитать(сг_ФайлЗагрузки, КодировкаТекста[Кодировка]);
		Исключение
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Неправильно задан путь к файлу или файл отсутствует!");
			Возврат;
		КонецПопытки;
		
		#Если Не ВебКлиент Тогда
			Текст = ТекстФайл.ПолучитьТекст();
			Позиция = НайтиНедопустимыеСимволыXML(Текст, 1);
			Если Позиция > 0 Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Файл содержит недопустимые символы, необходимо ручное исправление перед загрузкой:
							|Порядковый номер символа: %1'"), Позиция);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
		#КонецЕсли
		
		Попытка
			Если Объект.ВводИнформации = "С разбивкой по услугам" Тогда
				ПрочитатьФайлНаСервере(МассивОшибок, ТекстФайл, Истина);
			Иначе
				ПрочитатьФайлНаСервере(МассивОшибок, ТекстФайл, Ложь);
			КонецЕсли;
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Если ИнформацияОбОшибке.Причина = Неопределено Тогда
				ОписаниеОшибки = ИнформацияОбОшибке.Описание;
			Иначе
				ОписаниеОшибки = ИнформацияОбОшибке.Причина.Описание;
			КонецЕсли;
			
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Ошибка при обработке файла загрузки на сервере:
							|%1'"), ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецПопытки;
		
		Если МассивОшибок.Количество() > 0 Тогда
			Для каждого Ошибка Из МассивОшибок Цикл
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Ошибка);
			КонецЦикла; 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДвоичныхДанныхЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
		МассивОшибок = Новый Массив;
		
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
		Если Объект.ВводИнформации = "С разбивкой по услугам" Тогда
			ПрочитатьDBFФайлНаСервере(МассивОшибок, ПутьВоВременномХранилище, Истина);
		Иначе
			ПрочитатьDBFФайлНаСервере(МассивОшибок, ПутьВоВременномХранилище, Ложь);
		КонецЕсли;
		
		Если МассивОшибок.Количество() > 0 Тогда
			Для каждого Ошибка Из МассивОшибок Цикл
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Ошибка);
			КонецЦикла; 
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиФорматаРеестра(Команда)
	
	Если Объект.ПлатежнаяСистема = "Система Город" Тогда
		Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
			ЗаполнитьНастройкиПолейРеестраСальдо();
		Иначе
			ЗаполнитьНастройкиПолейРеестраСальдоБезУслуг();
		КонецЕсли;
	ИначеЕсли Объект.ПлатежнаяСистема = "Сбербанк" Тогда
		сбЗаполнитьНастройкиПолейРеестраСальдо();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	ТекИндекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(ТекущаяСтрока);
	
	Попытка
		НастройкаПолейСтрокиРеестраСальдо.Сдвинуть(ТекИндекс, -1);
	Исключение
		Возврат;
	КонецПопытки;
	
	Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
		СтрокаТаблицы.Порядок = НастройкаПолейСтрокиРеестраСальдо.Индекс(СтрокаТаблицы) + 1;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	ТекИндекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(ТекущаяСтрока);
	
	Попытка
		НастройкаПолейСтрокиРеестраСальдо.Сдвинуть(ТекИндекс, 1);
	Исключение
		Возврат;
	КонецПопытки;
	
	Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
		СтрокаТаблицы.Порядок = НастройкаПолейСтрокиРеестраСальдо.Индекс(СтрокаТаблицы) + 1;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , Объект.сг_КонецПериода);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, Элементы.ОтборЛицевыхСчетов, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОплаты(Команда)
	
	сг_СоздатьОплаты();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура сбВыгрузить(Текст)
	
	ИспользоватьНомерПолучателя = Ложь;
	НомерПолучателяПоБанку      = 0;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИспользоватьНомерПолучателяВШК", ИспользоватьНомерПолучателя);
	СтруктураПараметров.Вставить("НомерПолучателяПоБанку"        , НомерПолучателяПоБанку);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Объект.сг_КонецПериода), Объект.Организация, СтруктураПараметров);
	
	ИспользоватьНомерПолучателя = СтруктураПараметров.ИспользоватьНомерПолучателяВШК;
	НомерПолучателяПоБанку      = СтруктураПараметров.НомерПолучателяПоБанку;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Параметры.Вставить("НачалоПериода", НачалоДня(Объект.сг_НачалоПериода));
	ПостроительЗапроса.Параметры.Вставить("КонецПериода" , КонецДня(Объект.сг_КонецПериода));
	ПостроительЗапроса.Параметры.Вставить("Организация"  , Объект.Организация);
	
	ПостроительЗапроса.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальноеСальдо,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечноеСальдо,
	|	СУММА(0) КАК НачальноеСальдоПени,
	|	СУММА(0) КАК КонечноеСальдоПени
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток)
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ЛицевойСчет,
	|	Остатки.УслугаЖКХ,
	|	СУММА(Остатки.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(Остатки.КонечноеСальдо) КАК КонечноеСальдо,
	|	СУММА(Остатки.НачальноеСальдоПени) КАК НачальноеСальдоПени,
	|	СУММА(Остатки.КонечноеСальдоПени) КАК КонечноеСальдоПени
	|ПОМЕСТИТЬ ГрупОстатки
	|ИЗ
	|	Остатки КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЛицевойСчет,
	|	Остатки.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНачислений,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОплаты,
	|	СУММА(0) КАК СуммаПени
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.ЛицевойСчет,
	|	Обороты.УслугаЖКХ,
	|	СУММА(Обороты.СуммаНачислений) КАК СуммаНачислений,
	|	СУММА(Обороты.СуммаОплаты) КАК СуммаОплаты,
	|	СУММА(Обороты.СуммаПени) КАК СуммаПени
	|ПОМЕСТИТЬ ГрупОбороты
	|ИЗ
	|	Обороты КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.ЛицевойСчет,
	|	Обороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ПОМЕСТИТЬ СведенияПоУслугам
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.данет.да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество
	|ПОМЕСТИТЬ ОтветсвенныеЛица
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&КонецПериода, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
	|ПОМЕСТИТЬ СведенияОКвартре
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Таб.ЛицевойСчет.Квартира
	|				ИЗ
	|					СведенияПоУслугам КАК Таб)) КАК бит_СведенияОКвартиреСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияПоУслугам.ЛицевойСчет.Наименование КАК НаименованиеЛС,
	|	СведенияПоУслугам.ЛицевойСчет.Идентификатор КАК ИдентификаторЛицевогоСчета,
	|	ОтветсвенныеЛица.ФизЛицо КАК ФИО,
	|	ОтветсвенныеЛица.Фамилия КАК Фамилия,
	|	ОтветсвенныеЛица.Имя КАК Имя,
	|	ОтветсвенныеЛица.Отчество КАК Отчество,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Район КАК Город,
	|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	СведенияПоУслугам.ЛицевойСчет.Здание КАК Здание,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус КАК Корпус,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Строение КАК Строение,
	|	СведенияПоУслугам.ЛицевойСчет.Квартира КАК Квартира,
	|	СведенияПоУслугам.ЛицевойСчет.Квартира.ПрефиксКвартиры КАК ПрефиксКвартиры,
	|	ЕСТЬNULL(Проживающие.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачислений,
	|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0)) КАК СуммаОплаты,
	|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаПени,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0)) КАК НачальноеСальдо,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдо,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоПени,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0)) КАК КонечноеСальдоПени,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомПени,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) + ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдоСУчетомПени,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0)) КАК НачальноеСальдоСУчетомОплаты,
	|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомОплатыИПени,
	|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомПени,
	|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачисленийСУчетомОплаты,
	|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомОплатыИПени
	|ИЗ
	|	СведенияПоУслугам КАК СведенияПоУслугам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОстатки КАК ГрупОстатки
	|		ПО СведенияПоУслугам.ЛицевойСчет = ГрупОстатки.ЛицевойСчет
	|			И СведенияПоУслугам.Услуга = ГрупОстатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОбороты КАК ГрупОбороты
	|		ПО СведенияПоУслугам.Услуга = ГрупОбороты.УслугаЖКХ
	|			И СведенияПоУслугам.ЛицевойСчет = ГрупОбороты.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветсвенныеЛица КАК ОтветсвенныеЛица
	|		ПО СведенияПоУслугам.ЛицевойСчет = ОтветсвенныеЛица.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО СведенияПоУслугам.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКвартре КАК СведенияОКвартре
	|		ПО СведенияПоУслугам.ЛицевойСчет.Квартира = СведенияОКвартре.Квартира
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияПоУслугам.ЛицевойСчет,
	|	СведенияПоУслугам.ЛицевойСчет.Наименование,
	|	ОтветсвенныеЛица.ФизЛицо,
	|	ОтветсвенныеЛица.Фамилия,
	|	ОтветсвенныеЛица.Имя,
	|	ОтветсвенныеЛица.Отчество,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Район,
	|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета,
	|	СведенияПоУслугам.ЛицевойСчет.Здание,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Строение,
	|	СведенияПоУслугам.ЛицевойСчет.Квартира,
	|	СведенияПоУслугам.ЛицевойСчет.Квартира.ПрефиксКвартиры,
	|	СведенияПоУслугам.ЛицевойСчет.Идентификатор,
	|	ЕСТЬNULL(Проживающие.КолПроживающих, 0),
	|	ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГрупОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГрупОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияПоУслугам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтветсвенныеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Проживающие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОКвартре";
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если Объект.ОтборЛицевыхСчетов.Количество() > 0 Тогда
		
		ТабЛС    = Объект.ОтборЛицевыхСчетов.Выгрузить();
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(ТабЛС.ВыгрузитьКолонку("ЛицевойСчет"));
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = УсловиеОтбора;
		ОтборЛС.Значение      = Значение;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли;
	
	Если Объект.Услуги = "По выбору" Тогда
		
		Если Объект.ОтборУслуг.Количество() > 0 Тогда
			
			ТабУслуг    = Объект.ОтборУслуг.Выгрузить();
			Значение = Новый СписокЗначений;
			Значение.ЗагрузитьЗначения(ТабУслуг.ВыгрузитьКолонку("Услуга"));
			
			Попытка
				ОтборУс = ПостроительЗапроса.Отбор.Добавить("УслугаЖКХ");
			Исключение
				ОтборУс = ПостроительЗапроса.Отбор.Добавить("Услуга");
			КонецПопытки;
			ОтборУс.ВидСравнения  = УсловиеОтбораУслуг;
			ОтборУс.Значение      = Значение;
			ОтборУс.Использование = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПостроительЗапроса.ВыбранныеПоля.Очистить();
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ЛицевойСчет");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("НаименованиеЛС");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ИдентификаторЛицевогоСчета");
	//02.08.2019
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ФИО");
	
	Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
		
		Если СтрокаТаблицы.Использовать Тогда
			
			Если СтрокаТаблицы.имяПоля = "НачалоПериода"
				ИЛИ	СтрокаТаблицы.имяПоля = "КонецПериода"
				ИЛИ	СтрокаТаблицы.имяПоля = "КодДополнения"
				ИЛИ СтрокаТаблицы.имяПоля = "ШтрихКод"
				ИЛИ	СтрокаТаблицы.имяПоля = "НаименованиеЛС"
				ИЛИ	СтрокаТаблицы.имяПоля = "ИдентификаторЛицевогоСчета"
				ИЛИ	СтрокаТаблицы.имяПоля = "Счетчики" 
				//01.08.2019
				ИЛИ СтрокаТаблицы.имяПоля = "СчетчикиБезТипа" 
				ИЛИ СтрокаТаблицы.имяПоля = "ФИО" Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СтрокаТаблицы.имяПоля = "Адрес" Тогда
				
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Город");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Улица");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Здание");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Корпус");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Квартира");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Строение");
				//ПостроительЗапроса.ВыбранныеПоля.Добавить("ПрефиксКвартиры");
				
				Продолжить;
				
			КонецЕсли;
			
			Если СтрокаТаблицы.имяПоля = "ФИОАдрес" Тогда
				
				ПостроительЗапроса.ВыбранныеПоля.Добавить("ФИО");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Город");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Улица");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Здание");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Корпус");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Квартира");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Строение");
				//ПостроительЗапроса.ВыбранныеПоля.Добавить("ПрефиксКвартиры");
				
				Продолжить;
				
			КонецЕсли;
			
			
			Если СтрокаТаблицы.имяПоля = "ФИОСЗапятыми" ИЛИ 
				// БИТ ЖКХ 02.07.2020
				   СтрокаТаблицы.имяПоля = "ЕЛС" ИЛИ
				     СтрокаТаблицы.имяПоля = "КодФИАС" ИЛИ 
					 // БИТ ЖКХ 11.01.2021
				      СтрокаТаблицы.имяПоля = "КодФИАСКвартира" ИЛИ 
					   // БИТ ЖКХ 11.01.2021
				       СтрокаТаблицы.имяПоля = "Реквизит1" или
					     СтрокаТаблицы.имяПоля = "Реквизит2" Тогда			
								
				Продолжить;
				
			КонецЕсли;

			ПостроительЗапроса.ВыбранныеПоля.Добавить(СтрокаТаблицы.ИмяПоля);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("За данный периода - данные не найдены.");
		
		Возврат;
	КонецЕсли; 
	
	НастройкаПолейСтрокиРеестраСальдо.Сортировать("Порядок Возр");
	
	Выборка = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КоличествоПолей = НастройкаПолейСтрокиРеестраСальдо.Количество() - 1;
	
	ОтборСчетчики = Новый Структура("ИмяПоля, Использовать", "Счетчики", Истина);
	Если НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(ОтборСчетчики).Количество() > 0 Тогда
		ТабСчетчики = ПолучитьСчетчики();
		
		//// Выравнивает количество полей по счетчикам для всех ЛС.
		//МаксКолВоСчетчиков = 0;
		//Если ТабСчетчики.Количество() > 0 Тогда
		//	МаксКолВоСчетчиков = ТабСчетчики[0].КолВоСчетчиков;
		//КонецЕсли;
	КонецЕсли;
	
	//01.08.2019
	Если НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(ОтборСчетчики).Количество() = 0 Тогда
      ОтборСчетчики = Новый Структура("ИмяПоля, Использовать", "СчетчикиБезТипа", Истина);
	  Если НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(ОтборСчетчики).Количество() > 0 Тогда
		ТабСчетчики = ПолучитьСчетчики();		
	  КонецЕсли;		
	КонецЕсли;	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = "";
		
		СимволРазделения = сг_СимволРазделения;
		
		Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
			
			Индекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(СтрокаТаблицы);
			
			ПоследСтрока = (Индекс = КоличествоПолей);
			
			Город       = "";
			Здание      = "";
			Улица       = "";
			Квартира    = "";
			ЛицевойСчет = "";
			ФИО         = "";
			
			Если СтрокаТаблицы.Использовать И НЕ ПустаяСтрока(СтрокаТаблицы.ИмяПоля) Тогда
				
				// Поле лицевого счета заполняется по настройке либо наименованием либо идентификатором.
				Если СтрокаТаблицы.ИмяПоля = "ЛицевойСчет" Тогда
					
					ЛицевойСчет = СокрЛП(Выборка.НаименованиеЛС);
					
					НоваяСтрока  = НоваяСтрока + ЛицевойСчет;
					
				// БИТ ЖКХ 30.06.2020	
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "ЕЛС" Тогда
					
					НоваяСтрока = НоваяСтрока + Выборка.ЛицевойСчет.ЕЛСГИСЖКХ;
                // БИТ ЖКХ 02.07.2020
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "КодФИАС" Тогда
					
					// БИТ ЖКХ 19.10.2020
					//НоваяСтрока = НоваяСтрока + Выборка.Здание.КодФИАС + строка(",") + строка(Выборка.Квартира.НомерКвартиры);
				   // БИТ ЖКХ 05.03.2021	
				   Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "Здание") тогда					
					 НоваяСтрока = НоваяСтрока + Выборка.Здание.КодФИАС;
				   иначе	 
				    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка.ЛицевойСчет, "Здание") тогда					
				     НоваяСтрока = НоваяСтрока + Выборка.ЛицевойСчет.Здание.КодФИАС
				    конецесли;
				   конецесли;
				// БИТ ЖКХ 11.01.2021
			    ИначеЕсли СтрокаТаблицы.ИмяПоля = "КодФИАСКвартира" Тогда
				    // БИТ ЖКХ 05.03.2021
				    кодФИАС = "";
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "Здание") тогда				
					 кодФИАС = Выборка.Здание.КодФИАС;
				    иначе 
					  Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка.ЛицевойСчет, "Здание") тогда					
				       кодФИАС = Выборка.ЛицевойСчет.Здание.КодФИАС
				      конецесли
					конецесли;	
					// БИТ ЖКХ 11.01.2021
					
					НоваяСтрока = НоваяСтрока + кодФИАС + строка(ДобавитьРазделитель(кодФИАС)) + строка(Выборка.Квартира.НомерКвартиры);
					
				// БИТ ЖКХ 12.01.2021	
			    ИначеЕсли СтрокаТаблицы.ИмяПоля = "Реквизит1" ИЛИ
				           СтрокаТаблицы.ИмяПоля = "Реквизит2" Тогда
					
					НоваяСтрока = НоваяСтрока + СтрокаТаблицы.ЗначениеРеквизита;
	
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "ИдентификаторЛицевогоСчета" Тогда
					
					ИД = Формат(Выборка.ИдентификаторЛицевогоСчета, "ЧГ=0");
					
					НоваяСтрока  = НоваяСтрока + ИД;
					
					// Состав поля адреса ГОРОД,УЛИЦА,ЗДАНИЕ,КВАРТИРА.
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "Адрес" Тогда
					
					Город    = Город + Выборка.Город;
					Улица    = Улица + Выборка.Улица;
					Здание   = Здание + Выборка.Здание + ?(ЗначениеЗаполнено(Выборка.Корпус), "К" + Выборка.Корпус, "") + ?(ЗначениеЗаполнено(Выборка.Строение), " строение " + Выборка.Строение, "");
					Квартира = Квартира + Выборка.Квартира; // + ?(ЗначениеЗаполнено(Выборка.ПрефиксКвартиры), Выборка.ПрефиксКвартиры, "");
					// БИТ ЖКХ 12.01.2021
					НоваяСтрока = НоваяСтрока + Город + ДобавитьРазделитель(Город) + Улица + "," + Здание + "," + Квартира;
				//08.05.2019	
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "ФИОСЗапятыми" Тогда
					
                    ЧастиФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
					НоваяСтрока  = НоваяСтрока + ЧастиФИО.Фамилия + "," + ЧастиФИО.Имя + "," + ЧастиФИО.Отчество;
                									
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "ФИОАдрес" Тогда
					
					ЧастиФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
//					НоваяСтрока  = НоваяСтрока + ЧастиФИО.Фамилия + "," + ЧастиФИО.Имя + "," + ЧастиФИО.Отчество;

					ФИО      = ФИО + ЧастиФИО.Фамилия + "," + ЧастиФИО.Имя + "," + ЧастиФИО.Отчество;
					Город    = Город + Выборка.Город;
					Улица    = Улица + Выборка.Улица;
					Здание   = Здание + Выборка.Здание + ?(ЗначениеЗаполнено(Выборка.Корпус), "К" + Выборка.Корпус, "") + ?(ЗначениеЗаполнено(Выборка.Строение), " строение " + Выборка.Строение, "");
					Квартира = Квартира + Выборка.Квартира; // + ?(ЗначениеЗаполнено(Выборка.ПрефиксКвартиры), Выборка.ПрефиксКвартиры, "");
					
					НоваяСтрока = НоваяСтрока + ФИО + "/" + Город + "," + Улица + "," + Здание + "," + Квартира;
					
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "КодДополнения" Тогда
					
					НоваяСтрока      = НоваяСтрока + Объект.сг_ФиксированныйКод;
					СимволРазделения = сг_СимволПослеКодаДополнения;
					
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "НачалоПериода" Тогда
					
					НоваяСтрока = НоваяСтрока + Формат(Объект.сг_НачалоПериода, СтрокаТаблицы.Формат);
					
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "КонецПериода" Тогда
					
					НоваяСтрока = НоваяСтрока + Формат(Объект.сг_КонецПериода, СтрокаТаблицы.Формат);
					
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "ШтрихКод" Тогда
					
					ШаблонИзвещения = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам");
					
					Сумма = 0;
					
					Попытка
						Сумма = ?(Выборка.КонечноеСальдо > 0, Выборка.КонечноеСальдо,0);
					Исключение
					КонецПопытки; 
					
					Если НЕ НастроитьСоставШК Тогда
						ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(Сумма,
						Выборка.НаименованиеЛС,
						ШаблонИзвещения.Идентификатор,
						Выборка.ИдентификаторЛицевогоСчета,
						НомерПолучателяПоБанку,
						ИспользоватьНомерПолучателя);
					Иначе
						Попытка
							Выполнить(ТекстПользовательскойФункции);
						Исключение	
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка выполнения пользовательской функции:
							|"+ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
					
					НоваяСтрока = НоваяСтрока + ЗначениеШтрихкода;
					
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "НаселенныйПункт" Тогда
					
					НоваяСтрока = НоваяСтрока + Выборка.Город;
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "Улица" Тогда
					
					НоваяСтрока = НоваяСтрока + Выборка.Улица;
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "НомерДома" Тогда
					
					НоваяСтрока = НоваяСтрока + Выборка.Здание + ?(ЗначениеЗаполнено(Выборка.Корпус), "К" + Выборка.Корпус, "") + ?(ЗначениеЗаполнено(Выборка.Строение), " строение " + Выборка.Строение, "");
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "НомерКвартиры" Тогда
					
					НоваяСтрока = НоваяСтрока + Выборка.Квартира; // + ?(ЗначениеЗаполнено(Выборка.ПрефиксКвартиры), Выборка.ПрефиксКвартиры, "");
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "Счетчики" И ЗначениеЗаполнено(ТабСчетчики) Тогда
					
					МассивСчетчики = ТабСчетчики.НайтиСтроки(Новый Структура("ЛицевойСчет", Выборка.ЛицевойСчет));
					//КолВоСчетчиковЛС = 0;
					Для Каждого Элт Из МассивСчетчики Цикл
						НоваяСтрока = НоваяСтрока + СтрШаблон("%1%4%2%4%3%4"
																, Лев(Элт.НомерСчетчика, 20)
																, Лев(Строка(Элт.Тип), 8)
																, Формат(Элт.ПоследниеПоказания, СтрокаТаблицы.Формат)
																, СимволРазделения);
						//КолВоСчетчиковЛС = КолВоСчетчиковЛС + 1;
					КонецЦикла;
					
					//// Выравнивает количество полей по счетчикам для всех ЛС.
					//Пока КолВоСчетчиковЛС <= МаксКолВоСчетчиков Цикл
					//	НоваяСтрока = НоваяСтрока + СтрШаблон("%1%1%1", СимволРазделения);
					//	КолВоСчетчиковЛС = КолВоСчетчиковЛС + 1;
					//КонецЦикла; 
					
				//01.08.2019
				ИначеЕсли СтрокаТаблицы.ИмяПоля = "СчетчикиБезТипа" И ЗначениеЗаполнено(ТабСчетчики) Тогда
					
					МассивСчетчики = ТабСчетчики.НайтиСтроки(Новый Структура("ЛицевойСчет", Выборка.ЛицевойСчет));
					//КолВоСчетчиковЛС = 0;
					Для Каждого Элт Из МассивСчетчики Цикл
						НоваяСтрока = НоваяСтрока + СтрШаблон("%1%3%2%3"
																	, Лев(Элт.НомерСчетчика, 20)
																	, Формат(Элт.ПоследниеПоказания, СтрокаТаблицы.Формат)
																	, СимволРазделения);

						//КолВоСчетчиковЛС = КолВоСчетчиковЛС + 1;
					КонецЦикла;						
					
				Иначе
					
					НоваяСтрока = НоваяСтрока + Формат(Выборка[СтрокаТаблицы.ИмяПоля], СтрокаТаблицы.Формат);
					
				КонецЕсли;
				
			Иначе
				
				// Разеделитель поля ФИО "Пробел" если не используется поле - два пробела.
				Если СтрокаТаблицы.ИмяПоля = "ФИО" Тогда
					НоваяСтрока = НоваяСтрока + "  ";
				КонецЕсли;
				
				// Разеделитель поля адрес "Запятая" если не используется поле - три запятых.
				Если СтрокаТаблицы.ИмяПоля = "Адрес" Тогда
					НоваяСтрока = НоваяСтрока + ",,,";
				КонецЕсли; 
				
			КонецЕсли;
			
			НоваяСтрока = НоваяСтрока + ?(ПоследСтрока И НЕ сг_ЗаканчиватьСтрокуСимволом,"",СимволРазделения);
			
		КонецЦикла;
		
		Текст.ДобавитьСтроку(НоваяСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура сгВыгрузить(Текст)
	
	ИспользоватьНомерПолучателя = Ложь;
	НомерПолучателяПоБанку      = 0;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИспользоватьНомерПолучателяВШК", ИспользоватьНомерПолучателя);
	СтруктураПараметров.Вставить("НомерПолучателяПоБанку"        , НомерПолучателяПоБанку);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Объект.сг_КонецПериода), Объект.Организация, СтруктураПараметров);
	
	ИспользоватьНомерПолучателя = СтруктураПараметров.ИспользоватьНомерПолучателяВШК;
	НомерПолучателяПоБанку      = СтруктураПараметров.НомерПолучателяПоБанку;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;

	ПостроительЗапроса.Параметры.Вставить("НачалоПериода", НачалоДня(Объект.сг_НачалоПериода));
	ПостроительЗапроса.Параметры.Вставить("КонецПериода" , КонецДня(Объект.сг_КонецПериода));
	ПостроительЗапроса.Параметры.Вставить("Организация"  , Объект.Организация);
	
	Если Объект.ВыводИнформации  = "С разбивкой по услугам" Тогда
		ПостроительЗапроса.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальноеСальдо,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечноеСальдо,
		|	СУММА(0) КАК НачальноеСальдоПени,
		|	СУММА(0) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ,
		|	СУММА(Остатки.НачальноеСальдо) КАК НачальноеСальдо,
		|	СУММА(Остатки.КонечноеСальдо) КАК КонечноеСальдо,
		|	СУММА(Остатки.НачальноеСальдоПени) КАК НачальноеСальдоПени,
		|	СУММА(Остатки.КонечноеСальдоПени) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ ГрупОстатки
		|ИЗ
		|	Остатки КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНачислений,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОплаты,
		|	СУММА(0) КАК СуммаПени
		|ПОМЕСТИТЬ Обороты
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ,
		|	СУММА(Обороты.СуммаНачислений) КАК СуммаНачислений,
		|	СУММА(Обороты.СуммаОплаты) КАК СуммаОплаты,
		|	СУММА(Обороты.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ ГрупОбороты
		|ИЗ
		|	Обороты КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|ПОМЕСТИТЬ СведенияПоУслугам
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.данет.да)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
		|	бит_ФИОПроживающихСрезПоследних.Фамилия,
		|	бит_ФИОПроживающихСрезПоследних.Имя,
		|	бит_ФИОПроживающихСрезПоследних.Отчество
		|ПОМЕСТИТЬ ОтветсвенныеЛица
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&КонецПериода, ) КАК бит_ФИОПроживающихСрезПоследних
		|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
		|ПОМЕСТИТЬ Проживающие
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира,
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
		|ПОМЕСТИТЬ СведенияОКвартре
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
		|			&КонецПериода,
		|			Квартира В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Таб.ЛицевойСчет.Квартира
		|				ИЗ
		|					СведенияПоУслугам КАК Таб)) КАК бит_СведенияОКвартиреСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
		|	СведенияПоУслугам.ЛицевойСчет.Наименование КАК НаименованиеЛС,
		|	СведенияПоУслугам.ЛицевойСчет.Идентификатор КАК ИдентификаторЛицевогоСчета,
		|	СведенияПоУслугам.Услуга КАК Услуга,
		|	СведенияПоУслугам.Услуга.Код КАК КодУслуги,
		|	СведенияПоУслугам.Услуга.НаименованиеСокращенное КАК НаименованиеУслуги,
		|	ОтветсвенныеЛица.ФизЛицо КАК ФИО,
		|	ОтветсвенныеЛица.Фамилия КАК Фамилия,
		|	ОтветсвенныеЛица.Имя КАК Имя,
		|	ОтветсвенныеЛица.Отчество КАК Отчество,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Район КАК Город,
		|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
		|	СведенияПоУслугам.ЛицевойСчет.Здание КАК Здание,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус КАК Корпус,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Строение КАК Строение,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира КАК Квартира,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира.ПрефиксКвартиры КАК ПрефиксКвартиры,
		|	ЕСТЬNULL(Проживающие.КолПроживающих, 0) КАК КолПроживающих,
		|	ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
		|	ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) КАК СуммаНачислений,
		|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) КАК СуммаОплаты,
		|	ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаПени,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) КАК НачальноеСальдо,
		|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0) КАК КонечноеСальдо,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоПени,
		|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) КАК КонечноеСальдоПени,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоСУчетомПени,
		|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) + ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0) КАК КонечноеСальдоСУчетомПени,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) КАК НачальноеСальдоСУчетомОплаты,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоСУчетомОплатыИПени,
		|	ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаНачисленийСУчетомПени,
		|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) КАК СуммаНачисленийСУчетомОплаты,
		|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаНачисленийСУчетомОплатыИПени
		|ИЗ
		|	СведенияПоУслугам КАК СведенияПоУслугам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОстатки КАК ГрупОстатки
		|		ПО СведенияПоУслугам.ЛицевойСчет = ГрупОстатки.ЛицевойСчет
		|			И СведенияПоУслугам.Услуга = ГрупОстатки.УслугаЖКХ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОбороты КАК ГрупОбороты
		|		ПО СведенияПоУслугам.Услуга = ГрупОбороты.УслугаЖКХ
		|			И СведенияПоУслугам.ЛицевойСчет = ГрупОбороты.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветсвенныеЛица КАК ОтветсвенныеЛица
		|		ПО СведенияПоУслугам.ЛицевойСчет = ОтветсвенныеЛица.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
		|		ПО СведенияПоУслугам.ЛицевойСчет = Проживающие.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКвартре КАК СведенияОКвартре
		|		ПО СведенияПоУслугам.ЛицевойСчет.Квартира = СведенияОКвартре.Квартира
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеЛС
		|ИТОГИ
		|	СУММА(СуммаНачислений),
		|	СУММА(СуммаОплаты),
		|	СУММА(СуммаПени),
		|	СУММА(НачальноеСальдо),
		|	СУММА(КонечноеСальдо),
		|	СУММА(НачальноеСальдоПени),
		|	СУММА(КонечноеСальдоПени),
		|	СУММА(НачальноеСальдоСУчетомПени),
		|	СУММА(КонечноеСальдоСУчетомПени),
		|	СУММА(НачальноеСальдоСУчетомОплаты),
		|	СУММА(НачальноеСальдоСУчетомОплатыИПени),
		|	СУММА(СуммаНачисленийСУчетомПени),
		|	СУММА(СуммаНачисленийСУчетомОплаты),
		|	СУММА(СуммаНачисленийСУчетомОплатыИПени)
		|ПО
		|	ОБЩИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияПоУслугам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОтветсвенныеЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Проживающие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияОКвартре";
		
	Иначе
		ПостроительЗапроса.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальноеСальдо,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечноеСальдо,
		|	СУММА(0) КАК НачальноеСальдоПени,
		|	СУММА(0) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ,
		|	СУММА(Остатки.НачальноеСальдо) КАК НачальноеСальдо,
		|	СУММА(Остатки.КонечноеСальдо) КАК КонечноеСальдо,
		|	СУММА(Остатки.НачальноеСальдоПени) КАК НачальноеСальдоПени,
		|	СУММА(Остатки.КонечноеСальдоПени) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ ГрупОстатки
		|ИЗ
		|	Остатки КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНачислений,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОплаты,
		|	СУММА(0) КАК СуммаПени
		|ПОМЕСТИТЬ Обороты
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ,
		|	СУММА(Обороты.СуммаНачислений) КАК СуммаНачислений,
		|	СУММА(Обороты.СуммаОплаты) КАК СуммаОплаты,
		|	СУММА(Обороты.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ ГрупОбороты
		|ИЗ
		|	Обороты КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|ПОМЕСТИТЬ СведенияПоУслугам
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.данет.да)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
		|	бит_ФИОПроживающихСрезПоследних.Фамилия,
		|	бит_ФИОПроживающихСрезПоследних.Имя,
		|	бит_ФИОПроживающихСрезПоследних.Отчество
		|ПОМЕСТИТЬ ОтветсвенныеЛица
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&КонецПериода, ) КАК бит_ФИОПроживающихСрезПоследних
		|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
		|ПОМЕСТИТЬ Проживающие
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира,
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
		|ПОМЕСТИТЬ СведенияОКвартре
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
		|			&КонецПериода,
		|			Квартира В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Таб.ЛицевойСчет.Квартира
		|				ИЗ
		|					СведенияПоУслугам КАК Таб)) КАК бит_СведенияОКвартиреСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
		|	СведенияПоУслугам.ЛицевойСчет.Наименование КАК НаименованиеЛС,
		|	СведенияПоУслугам.ЛицевойСчет.Идентификатор КАК ИдентификаторЛицевогоСчета,
		|	ОтветсвенныеЛица.ФизЛицо КАК ФИО,
		|	ОтветсвенныеЛица.Фамилия КАК Фамилия,
		|	ОтветсвенныеЛица.Имя КАК Имя,
		|	ОтветсвенныеЛица.Отчество КАК Отчество,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Район КАК Город,
		|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
		|	СведенияПоУслугам.ЛицевойСчет.Здание КАК Здание,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус КАК Корпус,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Строение КАК Строение,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира КАК Квартира,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира.ПрефиксКвартиры КАК ПрефиксКвартиры,
		|	ЕСТЬNULL(Проживающие.КолПроживающих, 0) КАК КолПроживающих,
		|	ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачислений,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0)) КАК СуммаОплаты,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0)) КАК НачальноеСальдо,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдо,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0)) КАК КонечноеСальдоПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) + ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдоСУчетомПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0)) КАК НачальноеСальдоСУчетомОплаты,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомОплатыИПени,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомПени,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачисленийСУчетомОплаты,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомОплатыИПени
		|ИЗ
		|	СведенияПоУслугам КАК СведенияПоУслугам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОстатки КАК ГрупОстатки
		|		ПО СведенияПоУслугам.ЛицевойСчет = ГрупОстатки.ЛицевойСчет
		|			И СведенияПоУслугам.Услуга = ГрупОстатки.УслугаЖКХ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОбороты КАК ГрупОбороты
		|		ПО СведенияПоУслугам.Услуга = ГрупОбороты.УслугаЖКХ
		|			И СведенияПоУслугам.ЛицевойСчет = ГрупОбороты.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветсвенныеЛица КАК ОтветсвенныеЛица
		|		ПО СведенияПоУслугам.ЛицевойСчет = ОтветсвенныеЛица.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
		|		ПО СведенияПоУслугам.ЛицевойСчет = Проживающие.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКвартре КАК СведенияОКвартре
		|		ПО СведенияПоУслугам.ЛицевойСчет.Квартира = СведенияОКвартре.Квартира
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияПоУслугам.ЛицевойСчет,
		|	ОтветсвенныеЛица.ФизЛицо,
		|	ОтветсвенныеЛица.Фамилия,
		|	ОтветсвенныеЛица.Имя,
		|	ОтветсвенныеЛица.Отчество,
		|	СведенияПоУслугам.ЛицевойСчет.Наименование,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Район,
		|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета,
		|	СведенияПоУслугам.ЛицевойСчет.Здание,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Строение,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира.ПрефиксКвартиры,
		|	СведенияПоУслугам.ЛицевойСчет.Идентификатор,
		|	ЕСТЬNULL(Проживающие.КолПроживающих, 0),
		|	ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеЛС
		|ИТОГИ
		|	СУММА(СуммаНачислений),
		|	СУММА(СуммаОплаты),
		|	СУММА(СуммаПени),
		|	СУММА(НачальноеСальдо),
		|	СУММА(КонечноеСальдо),
		|	СУММА(НачальноеСальдоПени),
		|	СУММА(КонечноеСальдоПени),
		|	СУММА(НачальноеСальдоСУчетомПени),
		|	СУММА(КонечноеСальдоСУчетомПени),
		|	СУММА(НачальноеСальдоСУчетомОплаты),
		|	СУММА(НачальноеСальдоСУчетомОплатыИПени),
		|	СУММА(СуммаНачисленийСУчетомПени),
		|	СУММА(СуммаНачисленийСУчетомОплаты),
		|	СУММА(СуммаНачисленийСУчетомОплатыИПени)
		|ПО
		|	ОБЩИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияПоУслугам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОтветсвенныеЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Проживающие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияОКвартре";	
	КонецЕсли;
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если Объект.ОтборЛицевыхСчетов.Количество() > 0 Тогда
		
		ТабЛС    = Объект.ОтборЛицевыхСчетов.Выгрузить();
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(ТабЛС.ВыгрузитьКолонку("ЛицевойСчет"));
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = УсловиеОтбора;
		ОтборЛС.Значение      = Значение;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли;
	
	Если Объект.Услуги = "По выбору" Тогда
	
		Если Объект.ОтборУслуг.Количество() > 0 Тогда
			
			ТабУслуг    = Объект.ОтборУслуг.Выгрузить();
			Значение = Новый СписокЗначений;
			Значение.ЗагрузитьЗначения(ТабУслуг.ВыгрузитьКолонку("Услуга"));
			
			Попытка
				ОтборУс = ПостроительЗапроса.Отбор.Добавить("Услуга");
			Исключение
				ОтборУс = ПостроительЗапроса.Отбор.Добавить("УслугаЖКХ");
			КонецПопытки;
			ОтборУс.ВидСравнения  = УсловиеОтбораУслуг;
			ОтборУс.Значение      = Значение;
			ОтборУс.Использование = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПостроительЗапроса.ВыбранныеПоля.Очистить();
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ЛицевойСчет");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("НаименованиеЛС");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ИдентификаторЛицевогоСчета");
	//02.08.2019
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ФИО");

	Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		ПостроительЗапроса.ВыбранныеПоля.Добавить("Услуга");
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
		
		Если СтрокаТаблицы.Использовать Тогда
			
			Если СтрокаТаблицы.имяПоля = "НачалоПериода" ИЛИ 
				СтрокаТаблицы.имяПоля = "КонецПериода" ИЛИ 
				СтрокаТаблицы.имяПоля = "КодДополнения" ИЛИ 
				СтрокаТаблицы.имяПоля = "ШтрихКод" ИЛИ 
				СтрокаТаблицы.имяПоля = "НаименованиеЛС" ИЛИ 
				СтрокаТаблицы.имяПоля = "ИдентификаторЛицевогоСчета" ИЛИ 
				СтрокаТаблицы.имяПоля = "НаселенныйПункт" ИЛИ
				СтрокаТаблицы.имяПоля = "НомерДома" ИЛИ
				СтрокаТаблицы.имяПоля = "НомерКвартиры"	ИЛИ
				СтрокаТаблицы.имяПоля = "Счетчики"	ИЛИ 
				СтрокаТаблицы.имяПоля = "СчетчикиБезТипа" ИЛИ
				СтрокаТаблицы.имяПоля = "ФИО" Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СтрокаТаблицы.имяПоля = "Адрес" Тогда
				
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Город");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Улица");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Здание");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Корпус");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Квартира");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Строение");
				//ПостроительЗапроса.ВыбранныеПоля.Добавить("ПрефиксКвартиры");
				
				Продолжить;
				
			КонецЕсли;
						
			Если СтрокаТаблицы.имяПоля = "ФИОАдрес" Тогда
				
				ПостроительЗапроса.ВыбранныеПоля.Добавить("ФИО");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Город");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Улица");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Здание");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Корпус");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Квартира");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Строение");
				//ПостроительЗапроса.ВыбранныеПоля.Добавить("ПрефиксКвартиры");
				
				Продолжить;
				
			КонецЕсли;
			


			//Если СтрокаТаблицы.имяПоля = "ФИОСЗапятыми" Тогда			
			//					
			//	Продолжить;
			//	
			//КонецЕсли;
			
			Если СтрокаТаблицы.имяПоля = "ФИОСЗапятыми" ИЛИ 
				// БИТ ЖКХ 02.07.2020
				   СтрокаТаблицы.имяПоля = "ЕЛС" ИЛИ
				     СтрокаТаблицы.имяПоля = "КодФИАС" ИЛИ
					   // БИТ ЖКХ 11.01.2021
				       СтрокаТаблицы.имяПоля = "КодФИАСКвартира" Тогда			
								
				Продолжить;
				
			КонецЕсли;

			
			//Если СтрокаТаблицы.имяПоля = "ФИО" Тогда			
			//					
			//	Продолжить;
			//	
			//КонецЕсли;

			
			Попытка
				ПостроительЗапроса.ВыбранныеПоля.Добавить(СтрокаТаблицы.ИмяПоля);
	        Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка в заполнении реквизитов, на закладке 'Формат записи реестра'");
			КонецПопытки;				
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("За данный периода - данные не найдены.");
		
		Возврат;
	КонецЕсли; 
	
	НастройкаПолейСтрокиРеестраСальдо.Сортировать("Порядок Возр");
	
	ВыборкаОбщ = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОтборСчетчики = Новый Структура("ИмяПоля, Использовать", "Счетчики", Истина);
	Если НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(ОтборСчетчики).Количество() > 0 Тогда
		ТабСчетчики = ПолучитьСчетчики();
		
		//// Выравнивает количество полей по счетчикам для всех ЛС.
		//МаксКолВоСчетчиков = 0;
		//Если ТабСчетчики.Количество() > 0 Тогда
		//	МаксКолВоСчетчиков = ТабСчетчики[0].КолВоСчетчиков;
		//КонецЕсли;
	КонецЕсли;
	
	ОтборСчетчики = Новый Структура("ИмяПоля, Использовать", "СчетчикиБезТипа", Истина);
	Если НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(ОтборСчетчики).Количество() > 0 Тогда
		ТабСчетчики = ПолучитьСчетчики();
		
		//// Выравнивает количество полей по счетчикам для всех ЛС.
		//МаксКолВоСчетчиков = 0;
		//Если ТабСчетчики.Количество() > 0 Тогда
		//	МаксКолВоСчетчиков = ТабСчетчики[0].КолВоСчетчиков;
		//КонецЕсли;
	КонецЕсли;

	
	Пока ВыборкаОбщ.Следующий() Цикл
		
		Выборка = ВыборкаОбщ.Выбрать();
		
		Итого = 0;
		
		Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
			
			Если СтрокаТаблицы.Использовать И СтрокаТаблицы.ИспользоватьВИтогах Тогда
				Попытка
					Итого = Итого + ВыборкаОбщ[СтрокаТаблицы.ИмяПоля];
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """+ СтрокаТаблицы.ИмяПоля+ """ не может учавствовать в итогах.");
				КонецПопытки;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Текст.ДобавитьСтроку(сг_ВспомогательныйСимвол + "FILESUM " + Формат(Итого, "ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0"));
		Текст.ДобавитьСтроку(сг_ВспомогательныйСимвол + "TYPE 7");
		Текст.ДобавитьСтроку(сг_ВспомогательныйСимвол + "SERVICE " + СокрЛП(Объект.сг_КодУслугиВСистемеГород));
		Текст.ДобавитьСтроку(сг_ВспомогательныйСимвол + "NOTE " + Объект.Примечание);
		
		КоличествоПолей = НастройкаПолейСтрокиРеестраСальдо.Количество() - 1;
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = "";
			
			СимволРазделения = сг_СимволРазделения;
			
			Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
				
				Индекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(СтрокаТаблицы);
				
				ПоследСтрока = (Индекс = КоличествоПолей);
				
				Город       = "";
				Здание      = "";
				Улица       = "";
				Квартира    = "";
				ЛицевойСчет = "";
				ФИО         = "";

				
				Если СтрокаТаблицы.Использовать И НЕ ПустаяСтрока(СтрокаТаблицы.ИмяПоля) Тогда
					
					// Поле лицевого счета заполняется по настройке либо наименованием либо идентификатором.
					Если СтрокаТаблицы.ИмяПоля = "ЛицевойСчет" Тогда
						
						ЛицевойСчет = СокрЛП(Выборка.НаименованиеЛС);
						
						НоваяСтрока  = НоваяСтрока + ЛицевойСчет;
						
					// БИТ ЖКХ 30.06.2020	
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "ЕЛС" Тогда
							
							НоваяСтрока = НоваяСтрока + Выборка.ЛицевойСчет.ЕЛСГИСЖКХ;
		                // БИТ ЖКХ 02.07.2020
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "КодФИАС" Тогда
						
						 // БИТ ЖКХ 19.10.2020
					     //НоваяСтрока = НоваяСтрока + Выборка.Здание.КодФИАС + строка(",") + строка(Выборка.Квартира.НомерКвартиры);
					     НоваяСтрока = НоваяСтрока + Выборка.Здание.КодФИАС;
					
                    // БИТ ЖКХ 11.01.2021
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "КодФИАСКвартира" Тогда
						
						// БИТ ЖКХ 11.01.2021
						НоваяСтрока = НоваяСтрока + Выборка.Здание.КодФИАС + строка(",") + строка(Выборка.Квартира.НомерКвартиры);						

					ИначеЕсли СтрокаТаблицы.ИмяПоля = "ФИОАдрес" Тогда
					
						ЧастиФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
	//					НоваяСтрока  = НоваяСтрока + ЧастиФИО.Фамилия + "," + ЧастиФИО.Имя + "," + ЧастиФИО.Отчество;

						ФИО      = ФИО + ЧастиФИО.Фамилия + "," + ЧастиФИО.Имя + "," + ЧастиФИО.Отчество;
						Город    = Город + Выборка.Город;
						Улица    = Улица + Выборка.Улица;
						Здание   = Здание + Выборка.Здание + ?(ЗначениеЗаполнено(Выборка.Корпус), "К" + Выборка.Корпус, "") + ?(ЗначениеЗаполнено(Выборка.Строение), " строение " + Выборка.Строение, "");
						Квартира = Квартира + Выборка.Квартира; // + ?(ЗначениеЗаполнено(Выборка.ПрефиксКвартиры), Выборка.ПрефиксКвартиры, "");
						
						НоваяСтрока = НоваяСтрока + ФИО + "/" + Город + "," + Улица + "," + Здание + "," + Квартира;
						

					//08.05.2019	
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "ФИОСЗапятыми" Тогда
						
                        ЧастиФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
						НоваяСтрока  = НоваяСтрока + ЧастиФИО.Фамилия + "," + ЧастиФИО.Имя + "," + ЧастиФИО.Отчество;
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "ИдентификаторЛицевогоСчета" Тогда
						
						ИД = Формат(Выборка.ИдентификаторЛицевогоСчета, "ЧГ=0");
						
						НоваяСтрока  = НоваяСтрока + ИД;
						
						// Состав поля адреса ГОРОД,УЛИЦА,ЗДАНИЕ,КВАРТИРА.
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "Адрес" Тогда
						
						Город    = Город + Выборка.Город;
						Улица    = Улица + Выборка.Улица;
						Здание   = Здание + Выборка.Здание + ?(ЗначениеЗаполнено(Выборка.Корпус), "К" + Выборка.Корпус, "") + ?(ЗначениеЗаполнено(Выборка.Строение), " строение " + Выборка.Строение, "");
						Квартира = Квартира + Выборка.Квартира; // + ?(ЗначениеЗаполнено(Выборка.ПрефиксКвартиры), Выборка.ПрефиксКвартиры, "");
						
						НоваяСтрока = НоваяСтрока + Город + "," + Улица + "," + Здание + "," + Квартира;
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "КодДополнения" Тогда
						
						НоваяСтрока      = НоваяСтрока + Объект.сг_ФиксированныйКод;
						СимволРазделения = сг_СимволПослеКодаДополнения;
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "НачалоПериода" Тогда
						
						НоваяСтрока = НоваяСтрока + Формат(Объект.сг_НачалоПериода, СтрокаТаблицы.Формат);
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "КонецПериода" Тогда
						
						НоваяСтрока = НоваяСтрока + Формат(Объект.сг_КонецПериода, СтрокаТаблицы.Формат);
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "ШтрихКод" Тогда
						
						ШаблонИзвещения = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам");
						
						Сумма = 0;
						
						Попытка
							Сумма = ?(Выборка.КонечноеСальдо > 0, Выборка.КонечноеСальдо,0);
						Исключение
						КонецПопытки; 
						
						Если НЕ НастроитьСоставШК Тогда
							ЗначениеШтрихкода = бит_ОбщегоНазначения.СформируемШтрихКод(Сумма,
							Выборка.НаименованиеЛС,
							ШаблонИзвещения.Идентификатор,
							Выборка.ИдентификаторЛицевогоСчета,
							НомерПолучателяПоБанку,
							ИспользоватьНомерПолучателя);
						Иначе
							Попытка
								Выполнить(ТекстПользовательскойФункции);
							Исключение	
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка выполнения пользовательской функции:
								|"+ОписаниеОшибки());
							КонецПопытки;
						КонецЕсли;
						
						НоваяСтрока = НоваяСтрока + ЗначениеШтрихкода;
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "НаселенныйПункт" Тогда
						
						НоваяСтрока = НоваяСтрока + Строка(Выборка.Город);
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "Улица" Тогда
						
						НоваяСтрока = НоваяСтрока + Строка(Выборка.Улица);
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "НомерДома" Тогда
						
						НоваяСтрока = НоваяСтрока + Строка(Выборка.Здание) + ?(ЗначениеЗаполнено(Выборка.Корпус), "К" + Строка(Выборка.Корпус), "") + ?(ЗначениеЗаполнено(Выборка.Строение), " строение " + Строка(Выборка.Строение), "");
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "НомерКвартиры" Тогда
						
						НоваяСтрока = НоваяСтрока + Строка(Выборка.Квартира); // + ?(ЗначениеЗаполнено(Выборка.ПрефиксКвартиры), Строка(Выборка.ПрефиксКвартиры), "");
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "СчетчикиБезТипа" И ЗначениеЗаполнено(ТабСчетчики) Тогда
						
						Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
							МассивСчетчики = ТабСчетчики.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", Выборка.ЛицевойСчет, Выборка.Услуга));
						Иначе
							МассивСчетчики = ТабСчетчики.НайтиСтроки(Новый Структура("ЛицевойСчет", Выборка.ЛицевойСчет));
						КонецЕсли;
						//КолВоСчетчиковЛС = 0;
						Для Каждого Элт Из МассивСчетчики Цикл
							НоваяСтрока = НоваяСтрока + СтрШаблон("%1%3%2%3"
																	, Лев(Элт.НомерСчетчика, 20)
																	, Формат(Элт.ПоследниеПоказания, СтрокаТаблицы.Формат)
																	, СимволРазделения);
							//КолВоСчетчиковЛС = КолВоСчетчиковЛС + 1;
						КонецЦикла;
						
					ИначеЕсли СтрокаТаблицы.ИмяПоля = "Счетчики" И ЗначениеЗаполнено(ТабСчетчики) Тогда
						
						Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
							МассивСчетчики = ТабСчетчики.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", Выборка.ЛицевойСчет, Выборка.Услуга));
						Иначе
							МассивСчетчики = ТабСчетчики.НайтиСтроки(Новый Структура("ЛицевойСчет", Выборка.ЛицевойСчет));
						КонецЕсли;
						//КолВоСчетчиковЛС = 0;
						Для Каждого Элт Из МассивСчетчики Цикл
							НоваяСтрока = НоваяСтрока + СтрШаблон("%1%4%2%4%3%4"
																	, Лев(Элт.НомерСчетчика, 20)
																	, Лев(Строка(Элт.Тип), 8)
																	, Формат(Элт.ПоследниеПоказания, СтрокаТаблицы.Формат)
																	, СимволРазделения);
							//КолВоСчетчиковЛС = КолВоСчетчиковЛС + 1;
						КонецЦикла;  	
						
					Иначе
						
						НоваяСтрока = НоваяСтрока + Формат(Выборка[СтрокаТаблицы.ИмяПоля], СтрокаТаблицы.Формат);
						
					КонецЕсли;
					
				Иначе
					
					// Разеделитель поля ФИО "Пробел" если не используется поле - два пробела.
					Если СтрокаТаблицы.ИмяПоля = "ФИО" Тогда
						НоваяСтрока = НоваяСтрока + "  ";
					КонецЕсли;
					
					// Разеделитель поля адрес "Запятая" если не используется поле - три запятых.
					Если СтрокаТаблицы.ИмяПоля = "Адрес" Тогда
						НоваяСтрока = НоваяСтрока + ",,,";
					КонецЕсли; 
					
				КонецЕсли;
				
				НоваяСтрока = НоваяСтрока + ?(ПоследСтрока И НЕ сг_ЗаканчиватьСтрокуСимволом,"",СимволРазделения);
				
			КонецЦикла;
			
			Текст.ДобавитьСтроку(НоваяСтрока);
			
		КонецЦикла; 
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетчики()
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Параметры.Вставить("КонецПериода"	, КонецМесяца(Объект.сг_КонецПериода));
	ПостроительЗапроса.Параметры.Вставить("Организация"		, Объект.Организация);
	
	ПостроительЗапроса.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВТ_ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	|	И НЕ бит_ЛицевыеСчета.ПометкаУдаления
	|	И бит_ЛицевыеСчета.Организация = &Организация
	|{ГДЕ
	|	бит_ЛицевыеСчета.Ссылка.* КАК ОтборЛС}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК ЛицевойСчет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный КАК Многотарифный
	|ПОМЕСТИТЬ ВТ_ДанныеУстановкиПУ
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&КонецПериода,
	|			Объект В
	|				(ВЫБРАТЬ
	|					ВТ_ЛицевыеСчета.ЛицевойСчет
	|				ИЗ
	|					ВТ_ЛицевыеСчета КАК ВТ_ЛицевыеСчета)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|	И бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|{ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.* КАК ОтборУслуга}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПоказанияСчетчиковОстатки.Объект КАК ЛицевойСчет,
	|	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
	|	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_Показания
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|			&КонецПериода,
	|			(Объект, Счетчик, Услуга) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ДанныеУстановкиПУ.ЛицевойСчет,
	|					ВТ_ДанныеУстановкиПУ.Счетчик,
	|					ВТ_ДанныеУстановкиПУ.Услуга
	|				ИЗ
	|					ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ)) КАК бит_ПоказанияСчетчиковОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеУстановкиПУ.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ДанныеУстановкиПУ.Счетчик КАК Счетчик,
	|	СУММА(1) КАК КолВоТарифов
	|ПОМЕСТИТЬ ВТ_Многотарифные
	|ИЗ
	|	ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ
	|ГДЕ
	|	ВТ_ДанныеУстановкиПУ.Многотарифный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеУстановкиПУ.ЛицевойСчет,
	|	ВТ_ДанныеУстановкиПУ.Счетчик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеУстановкиПУ.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ДанныеУстановкиПУ.Счетчик КАК Счетчик,
	|	бит_УслугиЖКХ.Приоритет КАК Приоритет,
	|	ВТ_ДанныеУстановкиПУ.Услуга КАК Услуга,
	|	ВТ_ДанныеУстановкиПУ.Многотарифный КАК Многотарифный,
	|	ЕСТЬNULL(ВТ_Многотарифные.КолВоТарифов, 1) КАК КолВоТарифов,
	|	ЕСТЬNULL(ВТ_Показания.ПоследниеПоказания, 0) КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ВсеСчетчики
	|ИЗ
	|	ВТ_ДанныеУстановкиПУ КАК ВТ_ДанныеУстановкиПУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_ДанныеУстановкиПУ.Услуга = бит_УслугиЖКХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Многотарифные КАК ВТ_Многотарифные
	|		ПО ВТ_ДанныеУстановкиПУ.ЛицевойСчет = ВТ_Многотарифные.ЛицевойСчет
	|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Многотарифные.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показания КАК ВТ_Показания
	|		ПО ВТ_ДанныеУстановкиПУ.ЛицевойСчет = ВТ_Показания.ЛицевойСчет
	|			И ВТ_ДанныеУстановкиПУ.Услуга = ВТ_Показания.Услуга
	|			И ВТ_ДанныеУстановкиПУ.Счетчик = ВТ_Показания.Счетчик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Счетчик,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчики.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ВсеСчетчики.Счетчик КАК Счетчик,
	|	МИНИМУМ(ВТ_ВсеСчетчики.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетОднотарифный
	|ИЗ
	|	ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	|ГДЕ
	|	НЕ ВТ_ВсеСчетчики.Многотарифный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеСчетчики.ЛицевойСчет,
	|	ВТ_ВсеСчетчики.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПриоритетОднотарифный.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ПриоритетОднотарифный.Счетчик КАК Счетчик,
	|	ВТ_ПриоритетОднотарифный.Приоритет КАК Приоритет,
	|	ВТ_ВсеСчетчики.Услуга КАК Услуга,
	|	ВТ_ВсеСчетчики.КолВоТарифов КАК КолВоТарифов,
	|	ВТ_ВсеСчетчики.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ИтогОднотарифные
	|ИЗ
	|	ВТ_ПриоритетОднотарифный КАК ВТ_ПриоритетОднотарифный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	|		ПО ВТ_ПриоритетОднотарифный.ЛицевойСчет = ВТ_ВсеСчетчики.ЛицевойСчет
	|			И ВТ_ПриоритетОднотарифный.Счетчик = ВТ_ВсеСчетчики.Счетчик
	|			И ВТ_ПриоритетОднотарифный.Приоритет = ВТ_ВсеСчетчики.Приоритет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Счетчик,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчики.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ВсеСчетчики.Счетчик КАК Счетчик,
	|	ВТ_ВсеСчетчики.Приоритет КАК Приоритет,
	|	ВТ_ВсеСчетчики.Услуга КАК Услуга,
	|	ВТ_ВсеСчетчики.КолВоТарифов КАК КолВоТарифов,
	|	ВТ_ВсеСчетчики.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ИтогМноготарифные
	|ИЗ
	|	ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	|ГДЕ
	|	ВТ_ВсеСчетчики.Многотарифный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Счетчик,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтогОднотарифные.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ИтогОднотарифные.Счетчик КАК Счетчик,
	|	ВТ_ИтогОднотарифные.Приоритет КАК Приоритет,
	|	ВТ_ИтогОднотарифные.Услуга КАК Услуга,
	|	ВТ_ИтогОднотарифные.КолВоТарифов КАК КолВоТарифов,
	|	ВТ_ИтогОднотарифные.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|ИЗ
	|	ВТ_ИтогОднотарифные КАК ВТ_ИтогОднотарифные
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ИтогМноготарифные.ЛицевойСчет,
	|	ВТ_ИтогМноготарифные.Счетчик,
	|	ВТ_ИтогМноготарифные.Приоритет,
	|	ВТ_ИтогМноготарифные.Услуга,
	|	ВТ_ИтогМноготарифные.КолВоТарифов,
	|	ВТ_ИтогМноготарифные.ПоследниеПоказания
	|ИЗ
	|	ВТ_ИтогМноготарифные КАК ВТ_ИтогМноготарифные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТаблица.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(ВТ_ИтоговаяТаблица.Счетчик) КАК КолВоСчетчиков
	|ПОМЕСТИТЬ ВТ_КолвоСчетчиков
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИтоговаяТаблица.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КолвоСчетчиков.КолВоСчетчиков КАК КолВоСчетчиков,
	|	ВТ_ИтоговаяТаблица.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ИтоговаяТаблица.Счетчик КАК Счетчик,
	|	ВТ_ИтоговаяТаблица.Приоритет КАК Приоритет,
	|	ВТ_ИтоговаяТаблица.Услуга КАК Услуга,
	|	ВТ_ИтоговаяТаблица.КолВоТарифов КАК КолВоТарифов,
	|	бит_Счетчики.Наименование КАК НомерСчетчика,
	|	бит_Счетчики.ВидСчетчика КАК Тип,
	|	ВТ_ИтоговаяТаблица.ПоследниеПоказания КАК ПоследниеПоказания
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Счетчики КАК бит_Счетчики
	|		ПО ВТ_ИтоговаяТаблица.Счетчик = бит_Счетчики.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолвоСчетчиков КАК ВТ_КолвоСчетчиков
	|		ПО ВТ_ИтоговаяТаблица.ЛицевойСчет = ВТ_КолвоСчетчиков.ЛицевойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолВоСчетчиков УБЫВ,
	|	ЛицевойСчет,
	|	Счетчик,
	|	Приоритет";
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если Объект.ОтборЛицевыхСчетов.Количество() > 0 Тогда
		
		ТабЛС					= Объект.ОтборЛицевыхСчетов.Выгрузить();
		СписокЛС				= Новый СписокЗначений;
		СписокЛС.ЗагрузитьЗначения(ТабЛС.ВыгрузитьКолонку("ЛицевойСчет"));
		
		ОтборЛС					= ПостроительЗапроса.Отбор.Добавить("ОтборЛС");
		ОтборЛС.ВидСравнения	= УсловиеОтбора;
		ОтборЛС.Значение		= СписокЛС;
		ОтборЛС.Использование	= Истина;
	КонецЕсли;
	
	Если Объект.Услуги = "По выбору" 
		И Объект.ОтборУслуг.Количество() > 0 Тогда
		
		ТабУслуг				= Объект.ОтборУслуг.Выгрузить();
		СписокУслуг				= Новый СписокЗначений;
		СписокУслуг.ЗагрузитьЗначения(ТабУслуг.ВыгрузитьКолонку("Услуга"));
		
		ОтборУс					= ПостроительЗапроса.Отбор.Добавить("ОтборУслуга");
		ОтборУс.ВидСравнения	= УсловиеОтбораУслуг;
		ОтборУс.Значение		= СписокУслуг;
		ОтборУс.Использование	= Истина;
	КонецЕсли;
	
	ПостроительЗапроса.ВыбранныеПоля.Очистить();
	ПостроительЗапроса.ВыбранныеПоля.Добавить("КолВоСчетчиков");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ЛицевойСчет");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Услуга");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("НомерСчетчика");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Тип");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ПоследниеПоказания");
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат ПостроительЗапроса.Результат.Выгрузить();
	
КонецФункции

&НаСервере
Процедура ПрочитатьDBFФайлНаСервере(МассивОшибок, ПутьВоВременномХранилище, РазбивкаПоУслугам)
	
	ТекущийКаталог = КаталогВременныхФайлов();
	ПутьФайла = ТекущийКаталог + (Лев(Строка(Новый УникальныйИдентификатор()), 8)) + ".dbf";
	
	Попытка
		УдалитьФайлы(ПутьФайла);
	Исключение
	КонецПопытки;

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПутьВоВременномХранилище);
	Попытка
		ДвоичныеДанные.Записать(ПутьФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка работы с файлом.'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + ".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	XBase  = Новый XBase;
	XBase.Кодировка = КодировкаXBase[Кодировка];
	Попытка
		XBase.ОткрытьФайл(ПутьФайла);
	Исключение
		ТекстСообщенияОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПолныйТекстСообщенияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщенияОбОшибке);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ПолныйТекстСообщенияОбОшибке);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка открытия файла!");
		Попытка
			УдалитьФайлы(ПутьФайла);
		Исключение
		КонецПопытки;
		Возврат;
	КонецПопытки;

	КоличествоСтрок = XBase.КоличествоЗаписей();
	
	Если КоличествоСтрок = 0 Тогда
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Файл пуст!");
		Возврат;
	КонецЕсли; 

	СтруктураТипов = Новый Структура;
	СтруктураТипов.Вставить("Услуга"		   , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	СтруктураТипов.Вставить("ЛицевойСчет"	   , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	СтруктураТипов.Вставить("Сумма"			   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	СтруктураТипов.Вставить("ДатаОплаты"	   , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СтруктураТипов.Вставить("Комментарий"	   , ОбщегоНазначения.ОписаниеТипаСтрока(999));
	СтруктураТипов.Вставить("НазначениеПлатежа", ОбщегоНазначения.ОписаниеТипаСтрока(999));
	
	// БИТ ЖКХ 25.03.2021
	//если Объект.ШаблонЗагрузки = справочники.бит_ШаблоныЗагрузки.ШаблонДБФ тогда
	//  СтруктураТипов.Вставить("Счетчик"	   , ОбщегоНазначения.ОписаниеТипаСтрока(999));
	//  СтруктураТипов.Вставить("ЗначенияСчетчика", ОбщегоНазначения.ОписаниеТипаСтрока(999));	
	//конецесли;	
	
	ТаблицаОплаты = Новый ТаблицаЗначений;
	СоответствиеПозиций = Новый Соответствие;
	// Заполнение по шаблону.
	Если ЗначениеЗаполнено(Объект.ШаблонЗагрузки) Тогда
		ТаблицаШаблона = Объект.ШаблонЗагрузки.ПоляЗагрузки;
		Для Каждого Стр Из ТаблицаШаблона Цикл
			ТаблицаОплаты.Колонки.Добавить(Стр.ПолеОплатыКУ, СтруктураТипов[Стр.ПолеОплатыКУ]);
			СоответствиеПозиций.Вставить(Стр.НомерПозиции, Стр.ПолеОплатыКУ);
		КонецЦикла;
	// По умолчанию старая логика чтения.	
	Иначе
		ТаблицаОплаты.Колонки.Добавить("ЛицевойСчет"		 , СтруктураТипов.ЛицевойСчет);
		ТаблицаОплаты.Колонки.Добавить("Услуга"     		 , СтруктураТипов.Услуга);
		ТаблицаОплаты.Колонки.Добавить("Сумма"      		 , СтруктураТипов.Сумма);
		ТаблицаОплаты.Колонки.Добавить("ДатаОплаты"			 , СтруктураТипов.ДатаОплаты);
		
		СоответствиеПозиций.Вставить(3	, "ЛицевойСчет");
		СоответствиеПозиций.Вставить(4	, "Сумма");
		СоответствиеПозиций.Вставить(5	, "Услуга");
		СоответствиеПозиций.Вставить(10	, "ДатаОплаты");
	КонецЕсли;
	ТаблицаОплаты.Колонки.Добавить("СуммаСУчетомПроцента", СтруктураТипов.Сумма);
	
	ЕстьКолонкаКомменатрий = ?(ТаблицаОплаты.Колонки.Найти("Комментарий") = Неопределено, Ложь, Истина);
	ЕстьКолонкаНазначениеПлатежа = ?(ТаблицаОплаты.Колонки.Найти("НазначениеПлатежа") = Неопределено, Ложь, Истина);
	ЕстьКолонкаУслуга = ?(ТаблицаОплаты.Колонки.Найти("Услуга") = Неопределено, Ложь, Истина);
	
	Элементы.ДеревоОплатыКомментарий.Видимость = ЕстьКолонкаКомменатрий;
	Элементы.ДеревоОплатыНазначениеПлатежа.Видимость = ЕстьКолонкаНазначениеПлатежа;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
	
	Номер = 0;
	СуммаКПеречислению = 0;
	НомерРеестра = 0;
	
	ТекущаяСтрока = 1;
	XBase.Первая();
	Пока Не XBase.ВКонце() Цикл
		
		НоваяСтрока = ТаблицаОплаты.Добавить();
		
		Для Каждого ПолеШаблона Из СоответствиеПозиций Цикл
			
			Если ЗначениеЗаполнено(ПолеШаблона.Ключ) Тогда
				ИндексПоля = ?(ПолеШаблона.Ключ-1 < 0, 0, ПолеШаблона.Ключ-1);
				ЗначениеПоля = XBase.ПолучитьЗначениеПоля(ИндексПоля);
				
				Если  ПолеШаблона.Значение = "ЛицевойСчет" Тогда // Поле содержащее ЛС.
					
					ЛицевойСчет = Неопределено;
					ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(СокрЛП(ЗначениеПоля), Истина);
					
					Если ЛицевойСчет.Пустая() Тогда
						
						Попытка
							Идентификатор =	 Число(ЗначениеПоля);
						Исключение
							Возврат;
						КонецПопытки;
						
						Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							ЛицевойСчет = Выборка.ЛицевойСчет;
						КонецЕсли;
					КонецЕсли; 
					НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
					
				ИначеЕсли  ПолеШаблона.Значение = "Сумма" Тогда // Поле содержащее сумму.
					
					Попытка
						НоваяСтрока.Сумма                = Окр(Число(ЗначениеПоля) * (1 - (Объект.Процент/100)),2);
						НоваяСтрока.СуммаСУчетомПроцента = Число(ЗначениеПоля);
					Исключение
					КонецПопытки; 
					
				ИначеЕсли ПолеШаблона.Значение = "Услуга" Тогда // Поле содержащее услугу.
					
					Услуга = Справочники.бит_УслугиЖКХ.НайтиПоКоду(ЗначениеПоля);
					НоваяСтрока.Услуга = Услуга;
					
				ИначеЕсли  ПолеШаблона.Значение = "ДатаОплаты" Тогда // Поле содержащее дату оплаты.
					Попытка
						Дата = Дата("20"+Сред(ЗначениеПоля,9,2)+Сред(ЗначениеПоля,4,2)+Сред(ЗначениеПоля,0,2));
						НоваяСтрока.ДатаОплаты = Дата;
					Исключение
					КонецПопытки;
					
				Иначе
					
					НоваяСтрока[ПолеШаблона.Значение] = СокрЛП(ЗначениеПоля); // Комментарий и НазначениеПлатежа.
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		XBase.Следующая();
	КонецЦикла;
	
	Если XBase.Открыта() Тогда
		XBase.ЗакрытьФайл();
	КонецЕсли; 

	Попытка
		УдалитьФайлы(ПутьФайла);
	Исключение
	КонецПопытки;
	
	ТекстЗапрос = 
	"ВЫБРАТЬ
	|	Таблица.ДатаОплаты,
	|	Таблица.ЛицевойСчет,
	|	Таблица.Сумма,
	|	Таблица.СуммаСУчетомПроцента
	|ПОМЕСТИТЬ ТаблицаОплаты
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплаты.ДатаОплаты КАК ДатаОплаты,
	|	ТаблицаОплаты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(ТаблицаОплаты.Сумма) КАК Сумма,
	|	СУММА(ТаблицаОплаты.СуммаСУчетомПроцента) КАК СуммаСУчетомПроцента
	|ИЗ
	|	ТаблицаОплаты КАК ТаблицаОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОплаты.ЛицевойСчет,
	|	ТаблицаОплаты.ДатаОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты,
	|	ЛицевойСчет
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаСУчетомПроцента)
	|ПО
	|	ДатаОплаты,
	|	ЛицевойСчет";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапрос);
	ЗапросВыбораВТ 	 = СхемаЗапроса.ПакетЗапросов[0];
	ОператорВыбратьВТ = ЗапросВыбораВТ.Операторы[0];
	ЗапросВыбораТиблицыОплаты 	 = СхемаЗапроса.ПакетЗапросов[1];
	ОператорВыбратьТиблицыОплаты = ЗапросВыбораТиблицыОплаты.Операторы[0];
	
	// Опциональные колонки.
	НомерКолонки = 4; // Для индексного позиционирования в СхемаЗапроса.
	Если ЕстьКолонкаУслуга Тогда // Услуга.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.Услуга");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.Услуга");
		ЗапросВыбораТиблицыОплаты.Порядок.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		НомерКолонки = НомерКолонки + 1;
	КонецЕсли;

	Если ЕстьКолонкаКомменатрий  Тогда	// Комментарий.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.Комментарий");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.Комментарий");
		ЗапросВыбораТиблицыОплаты.ВыраженияИтогов.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		Для Каждого ВыражениеИтогов  Из ЗапросВыбораТиблицыОплаты.ВыраженияИтогов Цикл
			Если ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("СУММА(Комментарий)") Тогда
				ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("МАКСИМУМ(Комментарий)");
			КонецЕсли;
		КонецЦикла;
		НомерКолонки = НомерКолонки + 1;
	КонецЕсли;
	
	Если ЕстьКолонкаНазначениеПлатежа Тогда	// НазначениеПлатежа.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.НазначениеПлатежа");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.НазначениеПлатежа");
		ЗапросВыбораТиблицыОплаты.ВыраженияИтогов.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		Для Каждого ВыражениеИтогов  Из ЗапросВыбораТиблицыОплаты.ВыраженияИтогов Цикл
			Если ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("СУММА(НазначениеПлатежа)") Тогда
				ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("МАКСИМУМ(НазначениеПлатежа)");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());	
	Запрос.УстановитьПараметр("Таблица", ТаблицаОплаты);
	
	ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	Корень.Очистить();
	
	НеУказаноДат = 0;
	
	Пока ВыборкаДата.Следующий() Цикл
		
		СтрокаДерева = Корень.Добавить();
		СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаДата.ДатаОплаты;
		СтрокаДерева.Сумма                         = ВыборкаДата.Сумма;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
			НеУказаноДат = НеУказаноДат + 1;
		КонецЕсли; 
		
		ВыборкаЛС = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВторойУровень = СтрокаДерева.ПолучитьЭлементы();
		
		Если НЕ РазбивкаПоУслугам Тогда
			СтрокаДерева.СуммаСУчетомПроцента      = ВыборкаДата.СуммаСУчетомПроцента;
			ИтогПоДокументу      = ВыборкаДата.СуммаСУчетомПроцента;
		Иначе	
			ИтогПоДокументу      = ВыборкаДата.Сумма;
		КонецЕсли;
		
		СуммаИтогПоДокументу = 0;
		МассивЛС = Новый Массив;
		НеНайденоЛС = 0;
		
		Пока ВыборкаЛС.Следующий() Цикл
			
			СтрокаВеткиДерева = ВторойУровень.Добавить();
			СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаЛС.ЛицевойСчет;
			СтрокаВеткиДерева.Сумма                         = ВыборкаЛС.Сумма;
			СтрокаВеткиДерева.СуммаСУчетомПроцента          = ВыборкаЛС.СуммаСУчетомПроцента;
			
			Если ЕстьКолонкаКомменатрий  Тогда
				СтрокаВеткиДерева.Комментарий = ВыборкаЛС.Комментарий;
			КонецЕсли;
			
			Если ЕстьКолонкаНазначениеПлатежа Тогда
				СтрокаВеткиДерева.НазначениеПлатежа = ВыборкаЛС.НазначениеПлатежа;
			КонецЕсли;
				
			Если РазбивкаПоУслугам Тогда
				СтрокаДерева.СуммаСУчетомПроцента			= ВыборкаДата.СуммаСУчетомПроцента;
			КонецЕсли;
			
			СтруктураОплаты = НайтиДокументОплаты(ВыборкаДата.ДатаОплаты,НомерРеестра,ВыборкаЛС.ЛицевойСчет,ВыборкаЛС.Сумма);
			Если СтруктураОплаты.Свойство("Ссылка") Тогда
				СтрокаДерева.ДокументОплаты = СтруктураОплаты.Ссылка;
			КонецЕсли;
			Если СтруктураОплаты.Свойство("ИсточникОплаты") Тогда
				СтрокаДерева.ИсточникОплаты = СтруктураОплаты.ИсточникОплаты;
			КонецЕсли;
			
			Если РазбивкаПоУслугам Тогда
				ИтокСуммаЛС = ВыборкаЛС.Сумма;
			Иначе
				ИтокСуммаЛС = ВыборкаЛС.СуммаСУчетомПроцента;
			КонецЕсли;	
			ИтогПоЛС    = 0;
			
			ТретийУровень =  СтрокаВеткиДерева.ПолучитьЭлементы();
			Выборка = ВыборкаЛС.Выбрать();
			УслугВДОкументе = 0;
			
			Пока ЕстьКолонкаУслуга И Выборка.Следующий() Цикл // Услуги.
				
				Если Выборка.Услуга.Пустая() И Выборка.Количество() = 1 Тогда
					Продолжить;
				КонецЕсли; 
				
				СтрокаВеткиДерева2 = ТретийУровень.Добавить();
				СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга = Выборка.Услуга;
				СтрокаВеткиДерева2.Сумма                         = Выборка.Сумма;
				СтрокаВеткиДерева2.СуммаСУчетомПроцента          = Выборка.СуммаСУчетомПроцента;
				
				Если ЗначениеЗаполнено(СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
					Если РазбивкаПоУслугам Тогда
						ИтогПоЛС = ИтогПоЛС + Выборка.Сумма;
					Иначе
						ИтогПоЛС = ИтогПоЛС + Выборка.СуммаСУчетомПроцента;
					КонецЕсли;
					ИтогПоЛС = ИтогПоЛС + Выборка.Сумма;
					УслугВДОкументе = УслугВДОкументе + 1;
				КонецЕсли; 
				
			КонецЦикла;
			
			Если УслугВДОкументе = 0 Тогда
				ИтогПоЛС = ИтогПоДокументу;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
				Если РазбивкаПоУслугам Тогда
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтогПоЛС;
				Иначе
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтокСуммаЛС;
				КонецЕсли;
			Иначе
				НеНайденоЛС = НеНайденоЛС + 1;
			КонецЕсли; 
			
			Если ИтокСуммаЛС = ИтогПоЛС Тогда
				
				МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет.Наименование);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если НЕ СуммаИтогПоДокументу = ИтогПоДокументу Тогда
			
			Разница =  ИтогПоДокументу - СуммаИтогПоДокументу;
			
			Текст = "Оплаты от " + Формат(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга, "ДФ=dd.MM.yyyy") + " сумма документа("+СуммаИтогПоДокументу+") не сходится с суммой файла(" + ИтогПоДокументу + "), разница: " + Разница + ".";
			
			ТекстЛС = "Сумма не сходится по лицевым счетам: ";
			
			Если МассивЛС.Количество() > 0 Тогда
				
				Для каждого ЭлементМассива Из МассивЛС Цикл
					
					ТекстЛС = ТекстЛС + "" + ЭлементМассива + " ";
					
				КонецЦикла; 
				
				Текст = Текст + "
				|" + ТекстЛС;
				
			КонецЕсли;
			
			Если НеНайденоЛС > 0 Тогда
				
				Текст = Текст + "
				|Не найдено лицевых счетов: " + НеНайденоЛС;
				
			КонецЕсли; 
			
			МассивОшибок.Добавить(Текст);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если НеНайденоЛС > 0 Тогда
		
		МассивОшибок.Добавить("Не указанна дата у " + НеНайденоЛС + " позиций.");
		
	КонецЕсли; 
	
	Элементы.ДеревоОплаты.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СуммаИтоИтогов = 0;
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИтогПоДокументу      = СтрокаКорня.Сумма;
		СуммаИтогПоДокументу = 0;
		
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		
		МассивЛС = Новый Массив;
		
		ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
		
		Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			
			Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
				
				ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
				СуммаИтогПоЛС = 0;
				
				ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
				
				Если ТретийУровень.Количество() = 0 Тогда
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
					
				Иначе
					
					Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
						
						Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
							
							СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
							
						КонецЕсли;
						
					КонецЦикла; 
					
					Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
						
						МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
						
					КонецЕсли; 
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
					
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла; 
		СуммаИтоИтогов = СуммаИтоИтогов + СуммаИтогПоДокументу;
	КонецЦикла;
	
	Объект.ТекстИтогоДокумент = "Итого по дереву минус процент: "+Строка(СуммаИтоИтогов);
	
КонецПроцедуры

Процедура ЗагрузитьDBFФайлНаСервере(МассивОшибок, ПутьВоВременномХранилище, РазбивкаПоУслугам)
	
	ТекущийКаталог = КаталогВременныхФайлов();
	ПутьФайла = ТекущийКаталог + (Лев(Строка(Новый УникальныйИдентификатор()), 8)) + ".dbf";
	
	Попытка
		УдалитьФайлы(ПутьФайла);
	Исключение
	КонецПопытки;

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПутьВоВременномХранилище);
	Попытка
		ДвоичныеДанные.Записать(ПутьФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка работы с файлом.'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + ".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	XBase  = Новый XBase;
	XBase.Кодировка = КодировкаXBase[Кодировка];
	Попытка
		XBase.ОткрытьФайл(ПутьФайла);
	Исключение
		ТекстСообщенияОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПолныйТекстСообщенияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщенияОбОшибке);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ПолныйТекстСообщенияОбОшибке);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка открытия файла!");
		Попытка
			УдалитьФайлы(ПутьФайла);
		Исключение
		КонецПопытки;
		Возврат;
	КонецПопытки;

	КоличествоСтрок = XBase.КоличествоЗаписей();
	
	Если КоличествоСтрок = 0 Тогда
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Файл пуст!");
		Возврат;
	КонецЕсли; 

	СтруктураТипов = Новый Структура;
	СтруктураТипов.Вставить("Услуга"		   , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	СтруктураТипов.Вставить("ЛицевойСчет"	   , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	СтруктураТипов.Вставить("Сумма"			   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	СтруктураТипов.Вставить("ДатаОплаты"	   , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СтруктураТипов.Вставить("Комментарий"	   , ОбщегоНазначения.ОписаниеТипаСтрока(999));
	СтруктураТипов.Вставить("НазначениеПлатежа", ОбщегоНазначения.ОписаниеТипаСтрока(999));
		
	
	ТаблицаОплаты = Новый ТаблицаЗначений;
	СоответствиеПозиций = Новый Соответствие;
	// Заполнение по шаблону.
	Если ЗначениеЗаполнено(Объект.ШаблонЗагрузки) Тогда
		ТаблицаШаблона = Объект.ШаблонЗагрузки.ПоляЗагрузки;
		Для Каждого Стр Из ТаблицаШаблона Цикл
			ТаблицаОплаты.Колонки.Добавить(Стр.ПолеОплатыКУ, СтруктураТипов[Стр.ПолеОплатыКУ]);
			СоответствиеПозиций.Вставить(Стр.НомерПозиции, Стр.ПолеОплатыКУ);
		КонецЦикла;
	// По умолчанию старая логика чтения.	
	Иначе
		ТаблицаОплаты.Колонки.Добавить("ЛицевойСчет"		 , СтруктураТипов.ЛицевойСчет);
		ТаблицаОплаты.Колонки.Добавить("Услуга"     		 , СтруктураТипов.Услуга);
		ТаблицаОплаты.Колонки.Добавить("Сумма"      		 , СтруктураТипов.Сумма);
		ТаблицаОплаты.Колонки.Добавить("ДатаОплаты"			 , СтруктураТипов.ДатаОплаты);
		
		СоответствиеПозиций.Вставить(3	, "ЛицевойСчет");
		СоответствиеПозиций.Вставить(4	, "Сумма");
		СоответствиеПозиций.Вставить(5	, "Услуга");
		СоответствиеПозиций.Вставить(10	, "ДатаОплаты");
	КонецЕсли;
	ТаблицаОплаты.Колонки.Добавить("СуммаСУчетомПроцента", СтруктураТипов.Сумма);
	
	ЕстьКолонкаКомменатрий = ?(ТаблицаОплаты.Колонки.Найти("Комментарий") = Неопределено, Ложь, Истина);
	ЕстьКолонкаНазначениеПлатежа = ?(ТаблицаОплаты.Колонки.Найти("НазначениеПлатежа") = Неопределено, Ложь, Истина);
	ЕстьКолонкаУслуга = ?(ТаблицаОплаты.Колонки.Найти("Услуга") = Неопределено, Ложь, Истина);
	
	Элементы.ДеревоОплатыКомментарий.Видимость = ЕстьКолонкаКомменатрий;
	Элементы.ДеревоОплатыНазначениеПлатежа.Видимость = ЕстьКолонкаНазначениеПлатежа;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
	
	Номер = 0;
	СуммаКПеречислению = 0;
	НомерРеестра = 0;
	
	ТекущаяСтрока = 1;
	XBase.Первая();
	Пока Не XBase.ВКонце() Цикл
		
		НоваяСтрока = ТаблицаОплаты.Добавить();
		
		Для Каждого ПолеШаблона Из СоответствиеПозиций Цикл
			
			Если ЗначениеЗаполнено(ПолеШаблона.Ключ) Тогда
				ИндексПоля = ?(ПолеШаблона.Ключ-1 < 0, 0, ПолеШаблона.Ключ-1);
				ЗначениеПоля = XBase.ПолучитьЗначениеПоля(ИндексПоля);
				
				Если  ПолеШаблона.Значение = "ЛицевойСчет" Тогда // Поле содержащее ЛС.
					
					ЛицевойСчет = Неопределено;					
					ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(СокрЛП(СтрЗаменить(Строка(ЗначениеПоля ), Символы.НПП,"")), Истина);
					
					Если ЛицевойСчет.Пустая() Тогда						
					  ЛицевойСчет = ЗначениеПоля;
				    КонецЕсли; 
				  
					НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
					
				ИначеЕсли  ПолеШаблона.Значение = "Сумма" Тогда // Поле содержащее сумму.
					
					Попытка
						НоваяСтрока.Сумма                = Окр(Число(ЗначениеПоля) * (1 - (Объект.Процент/100)),2);
						НоваяСтрока.СуммаСУчетомПроцента = Число(ЗначениеПоля);
					Исключение
					КонецПопытки; 
					
				ИначеЕсли ПолеШаблона.Значение = "Услуга" Тогда // Поле содержащее услугу.
					
					Услуга = Справочники.бит_УслугиЖКХ.НайтиПоКоду(ЗначениеПоля);
					НоваяСтрока.Услуга = Услуга;
					
				ИначеЕсли  ПолеШаблона.Значение = "ДатаОплаты" Тогда // Поле содержащее дату оплаты.
					Попытка
						Дата = Дата("20"+Сред(ЗначениеПоля,9,2)+Сред(ЗначениеПоля,4,2)+Сред(ЗначениеПоля,0,2));
						НоваяСтрока.ДатаОплаты = Дата;
					Исключение
					КонецПопытки;
					
				Иначе
					
					НоваяСтрока[ПолеШаблона.Значение] = СокрЛП(ЗначениеПоля); // Комментарий и НазначениеПлатежа.
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		XBase.Следующая();
	КонецЦикла;
	
	Если XBase.Открыта() Тогда
		XBase.ЗакрытьФайл();
	КонецЕсли; 

	Попытка
		УдалитьФайлы(ПутьФайла);
	Исключение
	КонецПопытки;
	
	ТекстЗапрос = 
	"ВЫБРАТЬ
	|	Таблица.ДатаОплаты,
	|	Таблица.ЛицевойСчет,
	|	Таблица.Сумма,
	|	Таблица.СуммаСУчетомПроцента
	|ПОМЕСТИТЬ ТаблицаОплаты
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплаты.ДатаОплаты КАК ДатаОплаты,
	|	ТаблицаОплаты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(ТаблицаОплаты.Сумма) КАК Сумма,
	|	СУММА(ТаблицаОплаты.СуммаСУчетомПроцента) КАК СуммаСУчетомПроцента
	|ИЗ
	|	ТаблицаОплаты КАК ТаблицаОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОплаты.ЛицевойСчет,
	|	ТаблицаОплаты.ДатаОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты,
	|	ЛицевойСчет
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаСУчетомПроцента)
	|ПО
	|	ДатаОплаты,
	|	ЛицевойСчет";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапрос);
	ЗапросВыбораВТ 	 = СхемаЗапроса.ПакетЗапросов[0];
	ОператорВыбратьВТ = ЗапросВыбораВТ.Операторы[0];
	ЗапросВыбораТиблицыОплаты 	 = СхемаЗапроса.ПакетЗапросов[1];
	ОператорВыбратьТиблицыОплаты = ЗапросВыбораТиблицыОплаты.Операторы[0];
	
	// Опциональные колонки.
	НомерКолонки = 4; // Для индексного позиционирования в СхемаЗапроса.
	Если ЕстьКолонкаУслуга Тогда // Услуга.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.Услуга");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.Услуга");
		ЗапросВыбораТиблицыОплаты.Порядок.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		НомерКолонки = НомерКолонки + 1;
	КонецЕсли;

	Если ЕстьКолонкаКомменатрий  Тогда	// Комментарий.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.Комментарий");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.Комментарий");
		ЗапросВыбораТиблицыОплаты.ВыраженияИтогов.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		Для Каждого ВыражениеИтогов  Из ЗапросВыбораТиблицыОплаты.ВыраженияИтогов Цикл
			Если ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("СУММА(Комментарий)") Тогда
				ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("МАКСИМУМ(Комментарий)");
			КонецЕсли;
		КонецЦикла;
		НомерКолонки = НомерКолонки + 1;
	КонецЕсли;
	
	Если ЕстьКолонкаНазначениеПлатежа Тогда	// НазначениеПлатежа.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.НазначениеПлатежа");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.НазначениеПлатежа");
		ЗапросВыбораТиблицыОплаты.ВыраженияИтогов.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		Для Каждого ВыражениеИтогов  Из ЗапросВыбораТиблицыОплаты.ВыраженияИтогов Цикл
			Если ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("СУММА(НазначениеПлатежа)") Тогда
				ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("МАКСИМУМ(НазначениеПлатежа)");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());	
	Запрос.УстановитьПараметр("Таблица", ТаблицаОплаты);
	
	ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	Корень.Очистить();
	
	НеУказаноДат = 0;
	
	Пока ВыборкаДата.Следующий() Цикл
		
		СтрокаДерева = Корень.Добавить();
		СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаДата.ДатаОплаты;
		СтрокаДерева.Сумма                         = ВыборкаДата.Сумма;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
			НеУказаноДат = НеУказаноДат + 1;
		КонецЕсли; 
		
		ВыборкаЛС = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВторойУровень = СтрокаДерева.ПолучитьЭлементы();
		
		Если НЕ РазбивкаПоУслугам Тогда
			СтрокаДерева.СуммаСУчетомПроцента      = ВыборкаДата.СуммаСУчетомПроцента;
			ИтогПоДокументу      = ВыборкаДата.СуммаСУчетомПроцента;
		Иначе	
			ИтогПоДокументу      = ВыборкаДата.Сумма;
		КонецЕсли;
		
		СуммаИтогПоДокументу = 0;
		МассивЛС = Новый Массив;
		НеНайденоЛС = 0;
		
		Пока ВыборкаЛС.Следующий() Цикл
			
			СтрокаВеткиДерева = ВторойУровень.Добавить();
			СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаЛС.ЛицевойСчет;
			СтрокаВеткиДерева.Сумма                         = ВыборкаЛС.Сумма;
			СтрокаВеткиДерева.СуммаСУчетомПроцента          = ВыборкаЛС.СуммаСУчетомПроцента;
			
			Если ЕстьКолонкаКомменатрий  Тогда
				СтрокаВеткиДерева.Комментарий = ВыборкаЛС.Комментарий;
			КонецЕсли;
			
			Если ЕстьКолонкаНазначениеПлатежа Тогда
				СтрокаВеткиДерева.НазначениеПлатежа = ВыборкаЛС.НазначениеПлатежа;
			КонецЕсли;
				
			Если РазбивкаПоУслугам Тогда
				СтрокаДерева.СуммаСУчетомПроцента			= ВыборкаДата.СуммаСУчетомПроцента;
			КонецЕсли;
			
			СтруктураОплаты = НайтиДокументОплаты(ВыборкаДата.ДатаОплаты,НомерРеестра,ВыборкаЛС.ЛицевойСчет,ВыборкаЛС.Сумма);
			Если СтруктураОплаты.Свойство("Ссылка") Тогда
				СтрокаДерева.ДокументОплаты = СтруктураОплаты.Ссылка;
			КонецЕсли;
			Если СтруктураОплаты.Свойство("ИсточникОплаты") Тогда
				СтрокаДерева.ИсточникОплаты = СтруктураОплаты.ИсточникОплаты;
			КонецЕсли;
			
			Если РазбивкаПоУслугам Тогда
				ИтокСуммаЛС = ВыборкаЛС.Сумма;
			Иначе
				ИтокСуммаЛС = ВыборкаЛС.СуммаСУчетомПроцента;
			КонецЕсли;	
			ИтогПоЛС    = 0;
			
			ТретийУровень =  СтрокаВеткиДерева.ПолучитьЭлементы();
			Выборка = ВыборкаЛС.Выбрать();
			УслугВДОкументе = 0;
			
			Пока ЕстьКолонкаУслуга И Выборка.Следующий() Цикл // Услуги.
				
				Если Выборка.Услуга.Пустая() И Выборка.Количество() = 1 Тогда
					Продолжить;
				КонецЕсли; 
				
				СтрокаВеткиДерева2 = ТретийУровень.Добавить();
				СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга = Выборка.Услуга;
				СтрокаВеткиДерева2.Сумма                         = Выборка.Сумма;
				СтрокаВеткиДерева2.СуммаСУчетомПроцента          = Выборка.СуммаСУчетомПроцента;
				
				Если ЗначениеЗаполнено(СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
					Если РазбивкаПоУслугам Тогда
						ИтогПоЛС = ИтогПоЛС + Выборка.Сумма;
					Иначе
						ИтогПоЛС = ИтогПоЛС + Выборка.СуммаСУчетомПроцента;
					КонецЕсли;
					ИтогПоЛС = ИтогПоЛС + Выборка.Сумма;
					УслугВДОкументе = УслугВДОкументе + 1;
				КонецЕсли; 
				
			КонецЦикла;
			
			Если УслугВДОкументе = 0 Тогда
				ИтогПоЛС = ИтогПоДокументу;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
				Если РазбивкаПоУслугам Тогда
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтогПоЛС;
				Иначе
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтокСуммаЛС;
				КонецЕсли;
			Иначе
				НеНайденоЛС = НеНайденоЛС + 1;
			КонецЕсли; 
			
			Если ИтокСуммаЛС = ИтогПоЛС Тогда
				
				МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет.Наименование);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если НЕ СуммаИтогПоДокументу = ИтогПоДокументу Тогда
			
			Разница =  ИтогПоДокументу - СуммаИтогПоДокументу;
			
			Текст = "Оплаты от " + Формат(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга, "ДФ=dd.MM.yyyy") + " сумма документа("+СуммаИтогПоДокументу+") не сходится с суммой файла(" + ИтогПоДокументу + "), разница: " + Разница + ".";
			
			ТекстЛС = "Сумма не сходится по лицевым счетам: ";
			
			Если МассивЛС.Количество() > 0 Тогда
				
				Для каждого ЭлементМассива Из МассивЛС Цикл
					
					ТекстЛС = ТекстЛС + "" + ЭлементМассива + " ";
					
				КонецЦикла; 
				
				Текст = Текст + "
				|" + ТекстЛС;
				
			КонецЕсли;
			
			Если НеНайденоЛС > 0 Тогда
				
				Текст = Текст + "
				|Не найдено лицевых счетов: " + НеНайденоЛС;
				
			КонецЕсли; 
			
			МассивОшибок.Добавить(Текст);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если НеНайденоЛС > 0 Тогда
		
		МассивОшибок.Добавить("Не указанна дата у " + НеНайденоЛС + " позиций.");
		
	КонецЕсли; 
	
	Элементы.ДеревоОплаты.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СуммаИтоИтогов = 0;
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИтогПоДокументу      = СтрокаКорня.Сумма;
		СуммаИтогПоДокументу = 0;
		
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		
		МассивЛС = Новый Массив;
		
		ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
		
		Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			
			Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
				
				ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
				СуммаИтогПоЛС = 0;
				
				ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
				
				Если ТретийУровень.Количество() = 0 Тогда
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
					
				Иначе
					
					Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
						
						Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
							
							СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
							
						КонецЕсли;
						
					КонецЦикла; 
					
					Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
						
						МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
						
					КонецЕсли; 
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
					
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла; 
		СуммаИтоИтогов = СуммаИтоИтогов + СуммаИтогПоДокументу;
	КонецЦикла;
	
	Объект.ТекстИтогоДокумент = "Итого по дереву минус процент: "+Строка(СуммаИтоИтогов);
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьФайлНаСервере(МассивОшибок, ТекстФайл, РазбивкаПоУслугам)
	       	
	КоличествоСтрок = ТекстФайл.КоличествоСтрок();
	
	Если КоличествоСтрок = 0 Тогда
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Файл пуст!");
		Возврат;
	КонецЕсли; 

	СтруктураТипов = Новый Структура;
	СтруктураТипов.Вставить("Услуга"		   , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	СтруктураТипов.Вставить("ЛицевойСчет"	   , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	СтруктураТипов.Вставить("Сумма"			   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	СтруктураТипов.Вставить("ДатаОплаты"	   , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СтруктураТипов.Вставить("Комментарий"	   , ОбщегоНазначения.ОписаниеТипаСтрока(999));
	СтруктураТипов.Вставить("НазначениеПлатежа", ОбщегоНазначения.ОписаниеТипаСтрока(999));
	СтруктураТипов.Вставить("НомерСтроки"			   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	//13.05.2019
	//14.05.2019
	СтруктураТипов.Вставить("Счетчик", Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
	СтруктураТипов.Вставить("ЗначениеСчетчика"			   , ОбщегоНазначения.ОписаниеТипаСтрока(999));
	
	ТаблицаОплаты = Новый ТаблицаЗначений;
	СоответствиеПозиций = Новый Соответствие;
	// Заполнение по шаблону.
	Если ЗначениеЗаполнено(Объект.ШаблонЗагрузки) Тогда
		ТаблицаШаблона = Объект.ШаблонЗагрузки.ПоляЗагрузки;
		Для Каждого Стр Из ТаблицаШаблона Цикл
			ТаблицаОплаты.Колонки.Добавить(Стр.ПолеОплатыКУ, СтруктураТипов[Стр.ПолеОплатыКУ]);
			СоответствиеПозиций.Вставить(Стр.НомерПозиции, Стр.ПолеОплатыКУ);
		КонецЦикла;
		//22.01.2019 59
		ТаблицаОплаты.Колонки.Добавить("НомерСтроки", СтруктураТипов.НомерСтроки);
		//13.05.2019
//		ТаблицаОплаты.Колонки.Добавить("Счетчик"			 ,ОбщегоНазначения.ОписаниеТипаСтрока(999));
//		ТаблицаОплаты.Колонки.Добавить("ПоказанияСчетчика" , ОбщегоНазначения.ОписаниеТипаСтрока(999));

	// По умолчанию старая логика чтения.	
	Иначе
		ТаблицаОплаты.Колонки.Добавить("ЛицевойСчет"		 , СтруктураТипов.ЛицевойСчет);
		ТаблицаОплаты.Колонки.Добавить("Услуга"     		 , СтруктураТипов.Услуга);
		ТаблицаОплаты.Колонки.Добавить("Сумма"      		 , СтруктураТипов.Сумма);
		ТаблицаОплаты.Колонки.Добавить("ДатаОплаты"			 , СтруктураТипов.ДатаОплаты);
		ТаблицаОплаты.Колонки.Добавить("НомерСтроки" , СтруктураТипов.НомерСтроки);
		//13.05.2019
//		ТаблицаОплаты.Колонки.Добавить("Счетчик"			 , СтруктураТипов.Счетчик);
//		ТаблицаОплаты.Колонки.Добавить("ПоказанияСчетчика" , СтруктураТипов.ПоказанияСчетчика);
		
		СоответствиеПозиций.Вставить(3	, "ЛицевойСчет");
		СоответствиеПозиций.Вставить(4	, "Сумма");
		СоответствиеПозиций.Вставить(5	, "Услуга");
		СоответствиеПозиций.Вставить(10	, "ДатаОплаты");
	КонецЕсли;
	ТаблицаОплаты.Колонки.Добавить("СуммаСУчетомПроцента", СтруктураТипов.Сумма);
	
	ЕстьКолонкаКомменатрий = ?(ТаблицаОплаты.Колонки.Найти("Комментарий") = Неопределено, Ложь, Истина);
	ЕстьКолонкаНазначениеПлатежа = ?(ТаблицаОплаты.Колонки.Найти("НазначениеПлатежа") = Неопределено, Ложь, Истина);
	ЕстьКолонкаУслуга = ?(ТаблицаОплаты.Колонки.Найти("Услуга") = Неопределено, Ложь, Истина);
	
	Элементы.ДеревоОплатыКомментарий.Видимость = ЕстьКолонкаКомменатрий;
	Элементы.ДеревоОплатыНазначениеПлатежа.Видимость = ЕстьКолонкаНазначениеПлатежа;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
	
	Номер = 0;
	//22.01.2019 59
	НомерСтроки = 0;
	СуммаКПеречислению = 0;
	НомерРеестра = 0;
	
	Для Значение=1 По КоличествоСтрок Цикл
		
		Строка = ТекстФайл.ПолучитьСтроку(Значение);
		
		Если Найти(Строка,сг_ВспомогательныйСимвол) = 1 Тогда
			
			Номер = Номер + 1;
			
			Если Номер = 1 Тогда
				
				ДлинСтроки = СтрДлина(Строка);
				темпСтрока = СокрЛП(Сред(Строка,2,11));
				Попытка
					НомерРеестра = НомерРеестра + Число(темпСтрока);
				Исключение
				КонецПопытки;
				Объект.НомерРеестра = НомерРеестра;
				
			КонецЕсли;
			
			Если Объект.Процент = 0 Тогда
				
				Если Номер = 2 Тогда
					
					ДлинСтроки = СтрДлина(Строка);
					темпСтрока = СокрЛП(Сред(Строка,2,10));
					Попытка
						СуммаКПеречислению = СуммаКПеречислению + Число(темпСтрока);
					Исключение
					КонецПопытки;
					Объект.ТекстИтогоФайл = "Итого по файлу сумма реестра (справочно): "+Строка(СуммаКПеречислению);
					
				КонецЕсли;
				
			Иначе
				
				Если Номер = 5 Тогда
					
					ДлинСтроки = СтрДлина(Строка);
					темпСтрока = СокрЛП(Сред(Строка,2,10));
					Попытка
						СуммаКПеречислению = СуммаКПеречислению + Число(темпСтрока);
					Исключение
					КонецПопытки;
					Объект.ТекстИтогоФайл = "Итого по файлу сумма к перечислению (справочно): "+Строка(СуммаКПеречислению);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли; 
		
		НоваяСтрока = ТаблицаОплаты.Добавить();
		
		//22.01.2019 59
		НомерСтроки = НомерСтроки + 1;
		НоваяСтрока.НомерСтроки = НомерСтроки;

		ДлиннаСтроки = СтрДлина(Строка);
		ПоследнийСимвол = 1;
		СчетчикПолей = 1;
		тмпСтрока = "" + Строка;
		
		//08.05.2019
		//13.05.2019
		//14.05.2019
		полеСчетчика = ЕстьПолеСчетчик (Объект.ШаблонЗагрузки.ПоляЗагрузки);
		если Объект.ВидЗагрузки <> "ОплатаКУ" и полеСчетчика <> неопределено тогда
		    массивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка, ";");	
			ПозицияПоляСчетчика = полеСчетчика.НомерПозиции;
			
			для каждого стр из СоответствиеПозиций цикл
			 если (стр.Ключ-1) < ПозицияПоляСчетчика тогда 	
			  попытка 	
			   НоваяСтрока[стр.Значение] = НайтиЗначениеПоля(стр.Значение, массивПолей[стр.Ключ-1]);	
		      исключение 
			  конецпопытки; 
			 конецесли; 
		    конеццикла;
			
			если массивПолей.Количество() > ПозицияПоляСчетчика тогда 
				колвоСтрок = ((массивПолей.Количество() - (ПозицияПоляСчетчика-1)) / 2) - 1;
				ПозицияПоляСчетчика = ПозицияПоляСчетчика - 1;
				НоваяСтрока.Счетчик = НайтиЗначениеПоля("Счетчик", массивПолей[ПозицияПоляСчетчика]);
				НоваяСтрока.ЗначениеСчетчика = массивПолей[ПозицияПоляСчетчика + 1]; 
	//			НоваяСтрока.НомерСтроки = НоваяСтрока.НомерСтроки + 1;
				
				счетчикСтрок = 0;
	//			пока ПозицияПоляСчетчика < массивПолей.Количество() цикл
				пока счетчикСтрок < колвоСтрок цикл    				
									
					НоваяСтрокаСчетчика = ТаблицаОплаты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСчетчика, НоваяСтрока);
					ПозицияПоляСчетчика = ПозицияПоляСчетчика + 2;
					
					НоваяСтрокаСчетчика.Счетчик = НайтиЗначениеПоля("Счетчик", массивПолей[ПозицияПоляСчетчика]);
					НоваяСтрокаСчетчика.НомерСтроки = НоваяСтрокаСчетчика.НомерСтроки + 1;
				    НоваяСтрокаСчетчика.ЗначениеСчетчика = массивПолей[ПозицияПоляСчетчика + 1]; 
					
					счетчикСтрок = счетчикСтрок + 1;
				конеццикла;
			конецесли;
			
			номерСтроки = 0;
			для каждого стр из ТаблицаОплаты цикл
				стр.НомерСтроки = номерСтроки + 1;
				номерСтроки = номерСтроки + 1;
			конеццикла;	
			
			//14.05.2019
            ЗначениеВРеквизитФормы(ТаблицаОплаты, "ТаблицаСчетчиков");

	    иначе
		 
			Пока ДлиннаСтроки > 0 Цикл
				
				тмпСтрока = Прав(тмпСтрока, ДлиннаСтроки);
				ПоследнийСимвол = Найти(тмпСтрока,сг_СимволРазделения);
				Если ПоследнийСимвол = 0 Тогда
					ПоследнийСимвол = СтрДлина(тмпСтрока) + 1;			
				КонецЕсли;
				ЗначениеПоля = Сред(тмпСтрока, 1, ПоследнийСимвол - 1);
				ИмяПоля = СоответствиеПозиций.Получить(СчетчикПолей);
				
				Если НЕ ИмяПоля = Неопределено Тогда
					
					Если ИмяПоля = "ЛицевойСчет" Тогда // Поле содержащее ЛС.
						
						ЛицевойСчет = Неопределено;
						ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(СокрЛП(ЗначениеПоля), Истина);
						
						Если ЛицевойСчет.Пустая() Тогда
							
							Попытка
								Идентификатор =	 Число(ЗначениеПоля);
							Исключение
								Возврат;
							КонецПопытки;
							
							Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
							Выборка = Запрос.Выполнить().Выбрать();
							Если Выборка.Следующий() Тогда
								ЛицевойСчет = Выборка.ЛицевойСчет;
							КонецЕсли;
						КонецЕсли; 
						НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
						
					ИначеЕсли ИмяПоля = "Сумма" Тогда // Поле содержащее сумму.
						
						Попытка
							НоваяСтрока.Сумма                = Окр(Число(ЗначениеПоля) * (1 - (Объект.Процент/100)),2);
							НоваяСтрока.СуммаСУчетомПроцента = Число(ЗначениеПоля);
						Исключение
						КонецПопытки; 
						
					ИначеЕсли ИмяПоля = "Услуга" Тогда // Поле содержащее услугу.
						
						Услуга = Справочники.бит_УслугиЖКХ.НайтиПоКоду(ЗначениеПоля);
						НоваяСтрока.Услуга = Услуга;
						
					ИначеЕсли ИмяПоля = "ДатаОплаты" Тогда // Поле содержащее дату оплаты.
						
						Попытка
							Дата = Дата("20"+Сред(ЗначениеПоля,9,2)+Сред(ЗначениеПоля,4,2)+Сред(ЗначениеПоля,0,2));
							НоваяСтрока.ДатаОплаты = Дата;
						Исключение
						КонецПопытки;
						
					Иначе
						
						НоваяСтрока[ИмяПоля] = СокрЛП(ЗначениеПоля); // Комментарий и НазначениеПлатежа.
						
					КонецЕсли;
				КонецЕсли;
				
				ДлиннаСтроки = ДлиннаСтроки - (ПоследнийСимвол); 
				СчетчикПолей = СчетчикПолей + 1;				
		
			КонецЦикла; 
	   конецесли;	
	КонецЦикла; 
		
	ТекстЗапрос = 
	"ВЫБРАТЬ
	|	Таблица.ДатаОплаты,
	|	Таблица.НомерСтроки,
	|	Таблица.ЛицевойСчет,
	|	Таблица.Сумма,
	|	Таблица.СуммаСУчетомПроцента
	|ПОМЕСТИТЬ ТаблицаОплаты
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   1,
	|	ТаблицаОплаты.ДатаОплаты КАК ДатаОплаты,
	|	ТаблицаОплаты.ЛицевойСчет КАК ЛицевойСчет,
	|	ТаблицаОплаты.НомерСтроки КАК НомерСтроки,
//	|	ТаблицаОплаты.Сумма КАК Сумма,
//  21.11.2018	
	|	СУММА(ТаблицаОплаты.Сумма) КАК Сумма,
	|	СУММА(ТаблицаОплаты.СуммаСУчетомПроцента) КАК СуммаСУчетомПроцента
	|ИЗ
	|	ТаблицаОплаты КАК ТаблицаОплаты
	|
	|СГРУППИРОВАТЬ ПО
	//  21.11.2018	
	//|	ТаблицаОплаты.Сумма,
	|	ТаблицаОплаты.ЛицевойСчет,
	|	ТаблицаОплаты.НомерСтроки,
	|	ТаблицаОплаты.ДатаОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты,
	|	ЛицевойСчет
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаСУчетомПроцента)
	|ПО
	|	ДатаОплаты//;//, //13.12.2018
	|	ЛицевойСчет";

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапрос);
	ЗапросВыбораВТ 	 = СхемаЗапроса.ПакетЗапросов[0];
	ОператорВыбратьВТ = ЗапросВыбораВТ.Операторы[0];
	ЗапросВыбораТиблицыОплаты 	 = СхемаЗапроса.ПакетЗапросов[1];
	ОператорВыбратьТиблицыОплаты = ЗапросВыбораТиблицыОплаты.Операторы[0];
	
	// Опциональные колонки.
	НомерКолонки = 4; // Для индексного позиционирования в СхемаЗапроса.
	Если ЕстьКолонкаУслуга Тогда // Услуга.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.Услуга");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.Услуга");
		ЗапросВыбораТиблицыОплаты.Порядок.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		НомерКолонки = НомерКолонки + 1;
	КонецЕсли;

	Если ЕстьКолонкаКомменатрий  Тогда	// Комментарий.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.Комментарий");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.Комментарий");
		ЗапросВыбораТиблицыОплаты.ВыраженияИтогов.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		Для Каждого ВыражениеИтогов  Из ЗапросВыбораТиблицыОплаты.ВыраженияИтогов Цикл
			Если ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("СУММА(Комментарий)") Тогда
				ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("МАКСИМУМ(Комментарий)");
			КонецЕсли;
		КонецЦикла;
		НомерКолонки = НомерКолонки + 1;
	КонецЕсли;
	
	Если ЕстьКолонкаНазначениеПлатежа Тогда	// НазначениеПлатежа.
		ОператорВыбратьВТ.ВыбираемыеПоля.Добавить("Таблица.НазначениеПлатежа");
		ОператорВыбратьТиблицыОплаты.ВыбираемыеПоля.Добавить("ТаблицаОплаты.НазначениеПлатежа");
		ЗапросВыбораТиблицыОплаты.ВыраженияИтогов.Добавить(ЗапросВыбораТиблицыОплаты.Колонки[НомерКолонки]);
		Для Каждого ВыражениеИтогов  Из ЗапросВыбораТиблицыОплаты.ВыраженияИтогов Цикл
			Если ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("СУММА(НазначениеПлатежа)") Тогда
				ВыражениеИтогов.Выражение = Новый ВыражениеСхемыЗапроса("МАКСИМУМ(НазначениеПлатежа)");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());	
	Запрос.УстановитьПараметр("Таблица", ТаблицаОплаты);
	
//13.12.2018
	ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	ВыборкаДата = Запрос.Выполнить().Выбрать();//.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	Корень.Очистить();
	
	НеУказаноДат = 0;
	
	СчетчикСчетчиков = 0;
	Пока ВыборкаДата.Следующий() Цикл
		
		СтрокаДерева = Корень.Добавить();
		СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаДата.ДатаОплаты;
		
		если Объект.ВидЗагрузки = "ОплатаКУ" тогда 	
		  СтрокаДерева.Сумма                         = ВыборкаДата.Сумма;
		конецесли;  
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
			НеУказаноДат = НеУказаноДат + 1;
		КонецЕсли; 
		
		//13.12.2018
		ВыборкаЛС = ВыборкаДата.Выбрать();//ОбходРезультатаЗапроса.ПоГруппировкам);
		ВторойУровень = СтрокаДерева.ПолучитьЭлементы();
		
		Если НЕ РазбивкаПоУслугам Тогда
			СтрокаДерева.СуммаСУчетомПроцента      = ВыборкаДата.СуммаСУчетомПроцента;
			ИтогПоДокументу      = ВыборкаДата.СуммаСУчетомПроцента;
		Иначе	
			ИтогПоДокументу      = ВыборкаДата.Сумма;
		КонецЕсли;
		
		СуммаИтогПоДокументу = 0;
		МассивЛС = Новый Массив;
		НеНайденоЛС = 0;
		
		Пока ВыборкаЛС.Следующий() Цикл
			
			СтрокаВеткиДерева = ВторойУровень.Добавить();
			СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаЛС.ЛицевойСчет;
			
			если Объект.ВидЗагрузки = "ОплатаКУ" тогда 			
			 СтрокаВеткиДерева.Сумма                         = ВыборкаЛС.Сумма;
			конецесли; 
			 
			СтрокаВеткиДерева.СуммаСУчетомПроцента          = ВыборкаЛС.СуммаСУчетомПроцента;
			
			если Объект.ВидЗагрузки <> "ОплатаКУ" и ЕстьПолеСчетчик (Объект.ШаблонЗагрузки.ПоляЗагрузки) <> неопределено тогда
			 //13.05.2019
			 СтрокаВеткиДерева.Счетчик = ТаблицаОплаты[СчетчикСчетчиков].Счетчик;
			 СтрокаВеткиДерева.ЗначениеСчетчика = ТаблицаОплаты[СчетчикСчетчиков].ЗначениеСчетчика;
			 
			конецесли; 
			 
			Если ЕстьКолонкаКомменатрий  Тогда
				СтрокаВеткиДерева.Комментарий = ВыборкаЛС.Комментарий;
			КонецЕсли;
			
			Если ЕстьКолонкаНазначениеПлатежа Тогда
				СтрокаВеткиДерева.НазначениеПлатежа = ВыборкаЛС.НазначениеПлатежа;
			КонецЕсли;
				
			Если РазбивкаПоУслугам Тогда
				СтрокаДерева.СуммаСУчетомПроцента			= ВыборкаДата.СуммаСУчетомПроцента;
			КонецЕсли;
			
			СтруктураОплаты = НайтиДокументОплаты(ВыборкаДата.ДатаОплаты,НомерРеестра,ВыборкаЛС.ЛицевойСчет,ВыборкаЛС.Сумма);
			Если Объект.ВидЗагрузки = "ОплатаКУ" и СтруктураОплаты.Свойство("Ссылка") Тогда
				СтрокаДерева.ДокументОплаты = СтруктураОплаты.Ссылка;
			КонецЕсли;
			Если Объект.ВидЗагрузки = "ОплатаКУ" и СтруктураОплаты.Свойство("ИсточникОплаты") Тогда
				СтрокаДерева.ИсточникОплаты = СтруктураОплаты.ИсточникОплаты;
			КонецЕсли;
			
			Если РазбивкаПоУслугам Тогда
				ИтокСуммаЛС = ВыборкаЛС.Сумма;
			Иначе
				ИтокСуммаЛС = ВыборкаЛС.СуммаСУчетомПроцента;
			КонецЕсли;	
			ИтогПоЛС    = 0;
			
			ТретийУровень =  СтрокаВеткиДерева.ПолучитьЭлементы();
			Выборка = ВыборкаЛС.Выбрать();
			УслугВДОкументе = 0;
			
			Пока ЕстьКолонкаУслуга И Выборка.Следующий() Цикл // Услуги.
				
				Если Выборка.Услуга.Пустая() И Выборка.Количество() = 1 Тогда
					Продолжить;
				КонецЕсли; 
				
				СтрокаВеткиДерева2 = ТретийУровень.Добавить();
				СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга = Выборка.Услуга;
				СтрокаВеткиДерева2.Сумма                         = Выборка.Сумма;
				СтрокаВеткиДерева2.СуммаСУчетомПроцента          = Выборка.СуммаСУчетомПроцента;
				
				Если ЗначениеЗаполнено(СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
					Если РазбивкаПоУслугам Тогда
						ИтогПоЛС = ИтогПоЛС + Выборка.Сумма;
					Иначе
						ИтогПоЛС = ИтогПоЛС + Выборка.СуммаСУчетомПроцента;
					КонецЕсли;
					ИтогПоЛС = ИтогПоЛС + Выборка.Сумма;
					УслугВДОкументе = УслугВДОкументе + 1;
				КонецЕсли; 
				
			КонецЦикла;
			
			Если УслугВДОкументе = 0 Тогда
				ИтогПоЛС = ИтогПоДокументу;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
				Если РазбивкаПоУслугам Тогда
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтогПоЛС;
				Иначе
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтокСуммаЛС;
				КонецЕсли;
			Иначе
				НеНайденоЛС = НеНайденоЛС + 1;
			КонецЕсли; 
			
			Если ИтокСуммаЛС = ИтогПоЛС Тогда
				
				МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет.Наименование);
				
			КонецЕсли; 
			
			СчетчикСчетчиков = СчетчикСчетчиков + 1;

		КонецЦикла; 
		
		//13.12.2018
		Если НЕ ИтогПоЛС = ИтогПоДокументу Тогда
//		Если НЕ СуммаИтогПоДокументу = ИтогПоДокументу Тогда

			
			Разница =  ИтогПоДокументу - СуммаИтогПоДокументу;
			
			Текст = "Оплаты от " + Формат(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга, "ДФ=dd.MM.yyyy") + " сумма документа("+СуммаИтогПоДокументу+") не сходится с суммой файла(" + ИтогПоДокументу + "), разница: " + Разница + ".";
			
			ТекстЛС = "Сумма не сходится по лицевым счетам: ";
			
			Если МассивЛС.Количество() > 0 Тогда
				
				Для каждого ЭлементМассива Из МассивЛС Цикл
					
					ТекстЛС = ТекстЛС + "" + ЭлементМассива + " ";
					
				КонецЦикла; 
				
				Текст = Текст + "
				|" + ТекстЛС;
				
			КонецЕсли;
			
			Если НеНайденоЛС > 0 Тогда
				
				Текст = Текст + "
				|Не найдено лицевых счетов: " + НеНайденоЛС;
				
			КонецЕсли; 
			
			МассивОшибок.Добавить(Текст);
			
		КонецЕсли; 		
				
	КонецЦикла; 
	
	Если НеНайденоЛС > 0 Тогда
		
		МассивОшибок.Добавить("Не указанна дата у " + НеНайденоЛС + " позиций.");
		
	КонецЕсли; 
	
	Элементы.ДеревоОплаты.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СуммаИтоИтогов = 0;
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИтогПоДокументу      = СтрокаКорня.Сумма;
		СуммаИтогПоДокументу = 0;
		
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		
		МассивЛС = Новый Массив;
		
		ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
		
		Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			
			Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
				
				ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
				СуммаИтогПоЛС = 0;
				
				ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
				
				Если ТретийУровень.Количество() = 0 Тогда
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
					
				Иначе
					
					Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
						
						Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
							
							СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
							
						КонецЕсли;
						
					КонецЦикла; 
					
					Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
						
						МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
						
					КонецЕсли; 
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
					
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла; 
		СуммаИтоИтогов = СуммаИтоИтогов + СуммаИтогПоДокументу;
	КонецЦикла;
	
	Объект.ТекстИтогоДокумент = "Итого по дереву минус процент: "+Строка(СуммаИтоИтогов);
	
КонецПроцедуры

функция НайтиЗначениеПоля (ИмяПоля, ЗначениеПоля)
	
  Если ИмяПоля = "ЛицевойСчет" Тогда // Поле содержащее ЛС.
						
		ЛицевойСчет = Неопределено;
		ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(СокрЛП(ЗначениеПоля), Истина);
		
		возврат ЛицевойСчет;
  конецесли; 	
  
  
  Если ИмяПоля = "Счетчик" Тогда // Поле содержащее ЛС.
						
		Счетчик = Неопределено;
		Счетчик = Справочники.бит_Счетчики.НайтиПоНаименованию(СокрЛП(ЗначениеПоля), Истина);
		
		возврат Счетчик;
  конецесли; 	
	
  Если ИмяПоля = "ДатаОплаты" Тогда // Поле содержащее дату оплаты.
						
		Попытка
			Дата = Дата("20"+Сред(ЗначениеПоля,9,2)+Сред(ЗначениеПоля,4,2)+Сред(ЗначениеПоля,0,2));
			ДатаОплаты = Дата;
		Исключение
		КонецПопытки;
		возврат ДатаОплаты;
  конецесли; 	
	
  возврат ЗначениеПоля;	
конецфункции	

функция ЕстьПолеСчетчик (таблицаПолей)
	
	для каждого стр из таблицаПолей цикл
		
		если стр.ПолеОплатыКУ = "Счетчик" тогда
		 возврат стр;	
		конецесли; 
		 
	конеццикла;	
	
	возврат неопределено;
конецфункции	

&НаСервере
Функция НайтиДокументОплаты(ДатаОплаты,НомерРеестра,ЛицевойСчет,Сумма)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_ОплатаКУ.ИсточникОплаты,
	|	бит_ОплатаКУ.Ссылка
	|ИЗ
	|	Документ.бит_ОплатаКУ КАК бит_ОплатаКУ
	|ГДЕ
	|	бит_ОплатаКУ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОплаты, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОплаты, ДЕНЬ)
	|	И бит_ОплатаКУ.НомерРеестра = &НомерРеестра");
	Запрос.УстановитьПараметр("ДатаОплаты",ДатаОплаты);
	Запрос.УстановитьПараметр("НомерРеестра",НомерРеестра);
	Выборка = Запрос.Выполнить().Выбрать();
	Структура = Новый Структура();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка.СписокЛС.Количество() > 0 и ЗначениеЗаполнено(ЛицевойСчет) Тогда
			Если Выборка.Ссылка.СписокЛС[0].ЛицевойСчет = ЛицевойСчет и Выборка.Ссылка.СписокЛС[0].Сумма = Сумма Тогда
				Структура.Вставить("ИсточникОплаты", Выборка.ИсточникОплаты);
				Структура.Вставить("Ссылка", Выборка.Ссылка);
				Продолжить;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	Возврат Структура;
КонецФункции

&НаСервере
Процедура сг_СоздатьОплаты()
	
	//22.01.2019 59
	сворачиватьТабЧасть = ложь;

	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Если СтрокаКорня.ДокументОплаты <> Документы.бит_ОплатаКУ.ПустаяСсылка() и
			    СтрокаКорня.ДокументОплаты <> неопределено Тогда
			
			Документ = СтрокаКорня.ДокументОплаты.ПолучитьОбъект();
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.ОтменаПроведения,,"Ошибки");
			
			Документ.ИсточникОплаты = СтрокаКорня.ИсточникОплаты;
			
			Документ.СписокЛС.Очистить();
			Документ.СписокУслуг.Очистить();
			
			Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
			
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ИтогПоДокументу      = СтрокаКорня.Сумма;
			
			СуммаИтогПоДокументу = 0;
			
			ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
			
			МассивЛС = Новый Массив;
			
			ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
			
			Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
				
				Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
					
					НоваяСтрокаЛС = Документ.СписокЛС.Добавить();
					НоваяСтрокаЛС.ЛицевойСчет     = СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга;
					Если ЗначениеЗаполнено(СтрокаВторогоУровня.ШаблонИзвещений) Тогда
						НоваяСтрокаЛС.ШаблонИзвещений = СтрокаВторогоУровня.ШаблонИзвещений;
					Иначе	
						НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
					КонецЕсли;
					
					ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
					СуммаИтогПоЛС = 0;
					
					ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
					
					Если ТретийУровень.Количество() = 0 Тогда
						
						Документ.ВводВРучную    = Объект.Вручную;
						
						НоваяСтрокаЛС.Сумма = СтрокаВторогоУровня.Сумма;
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
						
					Иначе
						
						Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
							
							Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
								
								НоваяСтрокаУС = Документ.СписокУслуг.Добавить();
								НоваяСтрокаУС.ЛицевойСчет     = НоваяСтрокаЛС.ЛицевойСчет;
								НоваяСтрокаУС.ШаблонИзвещений = НоваяСтрокаЛС.ШаблонИзвещений;
								НоваяСтрокаУС.Услуга          = СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга;
								НоваяСтрокаУС.Сумма           = СтрокаТретьегоУрованя.Сумма;
								
								СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
								
							КонецЕсли;
							
						КонецЦикла; 
						
						Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
							
							МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
							
						КонецЕсли; 
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
						НоваяСтрокаЛС.Сумма  = СуммаИтогПоЛС;
						
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла; 
			
	        // БИТ ЖКХ 16.02.2021						
			ТаблицаЛС          = Документ.СписокЛС.Выгрузить();
			КоммунальныеУслуги = Документ.СписокУслуг.ВыгрузитьКолонки();
			
			бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Дата,
				Объект.Организация,
				ТаблицаЛС,
				КоммунальныеУслуги,
				ПараметрыЖКХ.ЛьготаПерсонифицированная,
				ПараметрыЖКХ.РасчетСУчетомДолейВладения,
				ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта,
				ПараметрыЖКХ.НачислениеСУчетомДнейПроживания,
				ПараметрыЖКХ.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.НачислятьПениСУчетомПереплаты); 
				
			Документ.СписокУслуг.Очистить();
			Документ.СписокУслуг.Загрузить(КоммунальныеУслуги);
			
			Документ.СуммаДокумента = СуммаИтогПоДокументу;
			
			//22.01.2019 59
			//	21.11.2018;
			если сворачиватьТабЧасть = истина тогда
			
			 временнаяТаблица = Документ.СписокЛС.Выгрузить();
			 временнаяТаблица.Свернуть("ЛицевойСчет, НомерДок, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет, СальдоНаЛС, СальдоПениВХ, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3,СчетАбонента, СчетКУ, Услуга, ЧекККМ, ШаблонИзвещений", "Сумма");
			 Документ.СписокЛС.Загрузить(временнаяТаблица);
			//---
			
            конецесли;

			
			Документ.ЗапролнитьСчета();
			
			Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
				
				СтрокаКорня.ДокументОплаты = Документ.Ссылка;
				
			КонецЕсли;
			
		Иначе
			
			Документ = Документы.бит_ОплатаКУ.СоздатьДокумент();
			
			Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
			
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Документ.Дата           = Дата;
			Документ.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
			Документ.Организация    = Объект.Организация;
			Документ.Ответственный  = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
			Документ.ИсточникОплаты = СтрокаКорня.ИсточникОплаты;
			Документ.ВводВРучную    = Объект.Вручную;
			Документ.НомерРеестра   = Объект.НомерРеестра;
			Документ.Комментарий    = "Документ создан автоматически из обработки ""Обмен с платежными системами"".";
			
			ИтогПоДокументу      = СтрокаКорня.Сумма;
			СуммаИтогПоДокументу = 0;
			
			ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
			
			МассивЛС = Новый Массив;
			
			ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
			
			Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
				
				Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
					
					НоваяСтрокаЛС = Документ.СписокЛС.Добавить();
					НоваяСтрокаЛС.ЛицевойСчет     = СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга;
					Если ЗначениеЗаполнено(СтрокаВторогоУровня.ШаблонИзвещений) Тогда
						НоваяСтрокаЛС.ШаблонИзвещений = СтрокаВторогоУровня.ШаблонИзвещений;
					Иначе	
						НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
					КонецЕсли;
					
					ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
					СуммаИтогПоЛС = 0;
					
					ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
					
					Если ТретийУровень.Количество() = 0 Тогда
						Документ.ВводВРучную    = Объект.Вручную;
						НоваяСтрокаЛС.Сумма = СтрокаВторогоУровня.Сумма;						
												
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
						
					Иначе
						
						Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
							
							Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
								
								НоваяСтрокаУС = Документ.СписокУслуг.Добавить();
								НоваяСтрокаУС.ЛицевойСчет     = НоваяСтрокаЛС.ЛицевойСчет;
								НоваяСтрокаУС.ШаблонИзвещений = НоваяСтрокаЛС.ШаблонИзвещений;
								НоваяСтрокаУС.Услуга          = СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга;
								НоваяСтрокаУС.Сумма           = СтрокаТретьегоУрованя.Сумма;
								
								СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
								
							КонецЕсли;
							
						КонецЦикла; 
						
						Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
							
							МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
							
						КонецЕсли; 
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
						НоваяСтрокаЛС.Сумма  = СуммаИтогПоЛС;
						
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла; 
			
			 // БИТ ЖКХ 16.02.2021						
			ТаблицаЛС          = Документ.СписокЛС.Выгрузить();
			КоммунальныеУслуги = Документ.СписокУслуг.ВыгрузитьКолонки();
			
			бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Дата,
				Объект.Организация,
				ТаблицаЛС,
				КоммунальныеУслуги,
				ПараметрыЖКХ.ЛьготаПерсонифицированная,
				ПараметрыЖКХ.РасчетСУчетомДолейВладения,
				ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта,
				ПараметрыЖКХ.НачислениеСУчетомДнейПроживания,
				ПараметрыЖКХ.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.НачислятьПениСУчетомПереплаты); 
				
			Документ.СписокУслуг.Очистить();
			Документ.СписокУслуг.Загрузить(КоммунальныеУслуги);

			//22.01.2019 59
			//	21.11.2018;
			если сворачиватьТабЧасть = истина тогда
			
			 временнаяТаблица = Документ.СписокЛС.Выгрузить();
			 временнаяТаблица.Свернуть("ЛицевойСчет, НомерДок, ПлательщикБИК, ПлательщикИНН, ПлательщикКПП, ПлательщикСчет, СальдоНаЛС, СальдоПениВХ, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3,СчетАбонента, СчетКУ, Услуга, ЧекККМ, ШаблонИзвещений", "Сумма");
			 Документ.СписокЛС.Загрузить(временнаяТаблица);
			//---
			
            конецесли;

			Документ.СуммаДокумента = СуммаИтогПоДокументу;			
			Документ.ЗапролнитьСчета();
			
			Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
				
				СтрокаКорня.ДокументОплаты = Документ.Ссылка;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПолейРеестраСальдо()
	
	НастройкаПолейСтрокиРеестраСальдо.Очистить();
	
	// ФИО.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ФИО";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(60);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 1;
	
	// Адрес.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "Адрес";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(70);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 2;
	
	// Лицевой счет.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ЛицевойСчет";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 3;
	
	// Сальдо.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "НачальноеСальдоСУчетомПени";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат			= "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок			= 4;
	НоваяСтрока.ИспользоватьВИтогах = Истина;
	
	// КодУслуги.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КодУслуги";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(9);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 5;
	
	// НачалоПериода.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "НачалоПериода";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат			= "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок			= 6;
	
	// КонецПериода.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КонецПериода";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат			= "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок			= 7;
	
	// ФиксированныйКод.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КодДополнения";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(2);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 8;
	
	// СуммаНачислений.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "СуммаНачисленийСУчетомОплатыИПени";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат			= "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок			= 9;
	
	// КолПроживающих.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КолПроживающих";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,0);
	НоваяСтрока.Формат			= "ЧГ=0";
	НоваяСтрока.Порядок			= 10;
	
	// ОбщаяПлощадь.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ОбщаяПлощадь";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат			= "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок			= 11;
	
	// Счетчики.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "Счетчики";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(16,4);
	НоваяСтрока.Формат			= "ЧЦ=8; ЧДЦ=; ЧН=0; ЧГ=0";
	НоваяСтрока.Порядок			= 12;
	
	//02.08.2019
	//// ФИОСЗапятыми.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "ФИОСЗапятыми";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(199);
	//НоваяСтрока.Формат			= "";
	//НоваяСтрока.Порядок			= 4;
	//
	//// СчетчикиБезТипа.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "СчетчикиБезТипа";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(16,4);
	//НоваяСтрока.Формат			= "ЧЦ=8; ЧДЦ=; ЧН=0; ЧГ=0";
	//НоваяСтрока.Порядок			= 5;

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПолейРеестраСальдоБезУслуг()
	
	НастройкаПолейСтрокиРеестраСальдо.Очистить();
	
	// ФИО.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ФИО";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(60);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 1;
	
	// Адрес.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "Адрес";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(70);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 2;
	
	// Лицевой счет.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ЛицевойСчет";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 3;
	
	// Сальдо.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "НачальноеСальдоСУчетомПени";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат			= "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок			= 4;
	НоваяСтрока.ИспользоватьВИтогах = Истина;
	
	// НачалоПериода.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "НачалоПериода";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат			= "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок			= 5;
	
	// КонецПериода.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КонецПериода";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат			= "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок			= 6;
	
	// ФиксированныйКод.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КодДополнения";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(2);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 7;
	
	// СуммаНачислений.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "СуммаНачисленийСУчетомОплатыИПени";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат			= "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок			= 8;
	
	// КолПроживающих.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КолПроживающих";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,0);
	НоваяСтрока.Формат			= "ЧГ=0";
	НоваяСтрока.Порядок			= 9;
	
	// ОбщаяПлощадь.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ОбщаяПлощадь";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат			= "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок			= 10;
	
	// Счетчики.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "Счетчики";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(16,4);
	НоваяСтрока.Формат			= "ЧЦ=8; ЧДЦ=; ЧН=0; ЧГ=0";
	НоваяСтрока.Порядок			= 11;
	
	//02.08.2019
	//// ФИОСЗапятыми.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "ФИОСЗапятыми";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(199);
	//НоваяСтрока.Формат			= "";
	//НоваяСтрока.Порядок			= 4;
	//
	//// СчетчикиБезТипа.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "СчетчикиБезТипа";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(16,4);
	//НоваяСтрока.Формат			= "ЧЦ=8; ЧДЦ=; ЧН=0; ЧГ=0";
	//НоваяСтрока.Порядок			= 5;


КонецПроцедуры

&НаКлиенте
Процедура сбЗаполнитьНастройкиПолейРеестраСальдо()
	
	НастройкаПолейСтрокиРеестраСальдо.Очистить();
	// БИТ ЖКХ 18.02.2021
	// Лицевой счет.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ЛицевойСчет";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(25,0);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 1;
	
	// ЕЛС.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ЕЛС";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(199);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 2;
	
	// КодФИАС.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КодФИАС";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(199);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 3;

    // ФИО.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "ФИО";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(60);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 4;

	// Адрес.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "Адрес";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(70);
	НоваяСтрока.Формат			= "";
	НоваяСтрока.Порядок			= 5;

	// КонецПериода.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КонецПериода";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат			= "ДФ='MMyy'";
	НоваяСтрока.Порядок			= 6;
	
	// Сальдо.
	НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать	= Истина;
	НоваяСтрока.ИмяПоля			= "КонечноеСальдоСУчетомПени";
	НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат			= "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок			= 7;
	НоваяСтрока.ИспользоватьВИтогах = Истина;
	
	//// ФИОАдрес.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "ФИОАдрес";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(199);
	//НоваяСтрока.Формат			= "";
	//НоваяСтрока.Порядок			= 4;
	//
	//// Счетчики.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "Счетчики";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(16,4);
	//НоваяСтрока.Формат			= "ЧЦ=8; ЧДЦ=; ЧН=0; ЧГ=0";
	//НоваяСтрока.Порядок			= 5;
	
	//2.08.2019
	//// ФИОСЗапятыми.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "ФИОСЗапятыми";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(199);
	//НоваяСтрока.Формат			= "";
	//НоваяСтрока.Порядок			= 4;
	//
	//// СчетчикиБезТипа.
	//НоваяСтрока					= НастройкаПолейСтрокиРеестраСальдо.Добавить();
	//НоваяСтрока.Использовать	= Истина;
	//НоваяСтрока.ИмяПоля			= "СчетчикиБезТипа";
	//НоваяСтрока.Тип				= бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(16,4);
	//НоваяСтрока.Формат			= "ЧЦ=8; ЧДЦ=; ЧН=0; ЧГ=0";
	//НоваяСтрока.Порядок			= 5;

	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоФорматНачалоВыбораЗавершение(Текст1, ДополнительныеПараметры) Экспорт
	
	КонструкторФорматнойСтроки = ДополнительныеПараметры.КонструкторФорматнойСтроки;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Текст1) Тогда
		ТекущиеДанные.Формат = КонструкторФорматнойСтроки.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыбранныеЗначения(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения данных из временного хранилища. Выполните подбор заново.");
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаЛС Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаЛС.ЛицевойСчет);
		
		Поиск = Объект.ОтборЛицевыхСчетов.НайтиСтроки(Отбор);
		
		Если Поиск.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.ОтборЛицевыхСчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЛС);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПараметрыЖКХ(Дата)
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты", Ложь); 
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Объект.Организация, ПараметрыЖКХ);
	
	Возврат ПараметрыЖКХ;
	
КонецФункции

&НаКлиенте
Процедура ДеревоОплатыШаблонИзвещенийПриИзменении(Элемент)
	
	Если Элементы.ДеревоОплаты.ТекущиеДанные.ПолучитьРодителя() = Неопределено И НЕ Элемент.ТекстРедактирования = "" Тогда
		ТекстВопроса = СтрШаблон(
							НСтр("ru = 'Установить текущий шаблон извещений: ""%1"" для всех?'"),
							Элемент.ТекстРедактирования);
		ПоказатьВопрос(Новый ОписаниеОповещения("ДеревоОплатыШаблонИзвещенийПриИзмененииЗавершение", ЭтотОбъект, Элементы.ДеревоОплаты.ТекущиеДанные), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыШаблонИзвещенийПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДочерниеЛС = ДополнительныеПараметры.ПолучитьЭлементы();
	Для каждого Строка Из ДочерниеЛС Цикл
		Строка.ШаблонИзвещений = ДополнительныеПараметры.ШаблонИзвещений;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗагрузкиПриИзменении(Элемент)
	
	ОчиститьДеревоОплатыСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДеревоОплатыСервер()
	
	тДеревоОплаты = РеквизитФормыВЗначение("ДеревоОплаты");
	тДеревоОплаты.Строки.Очистить();
	ЗначениеВРеквизитФормы(тДеревоОплаты, "ДеревоОплаты");
   
КонецПроцедуры

//14.05.2019
&НаКлиенте
Процедура СоздатьНачисленияПоСчетчикам(Команда)
	СоздатьНачисленияПоСчетчикамНаСервере();
КонецПроцедуры
//14.05.2019
&НаСервере
Процедура СоздатьНачисленияПоСчетчикамНаСервере()
		
   ТаблицаСчетчиковЛок = РеквизитФормыВЗначение("ТаблицаСчетчиков");
   списокЛС = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаСчетчиковЛок.ВыгрузитьКолонку("ЛицевойСчет"));
   списокДатОплаты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаСчетчиковЛок.ВыгрузитьКолонку("ДатаОплаты"));
   
   тДеревоОплаты = РеквизитФормыВЗначение("ДеревоОплаты");

   для каждого стрОплат из списокДатОплаты цикл
	   
	   ДокументВводПоказаний					= Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();	   
	   датаДока                                 = НайтиДатуДокумента(стрОплат);	   
	   ДокументВводПоказаний.Дата				= датаДока;
	   ДокументВводПоказаний.Организация		= Объект.Организация;
	   ДокументВводПоказаний.ВидОперации		= Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
	   ДокументВводПоказаний.ТипСчетчика		= Перечисления.бит_ТипСчетчика.Индивидуальный;
	   ДокументВводПоказаний.ПоказанияНаселения= Истина;
	   ДокументВводПоказаний.Ответственный		= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	   ДокументВводПоказаний.Комментарий		= "Документ создан из обработки Обмен с платежными системами. " + ТекущаяДата();
	   ДокументВводПоказаний.ПоказанияПоСчетчикам.Очистить();		   
	   
	   для каждого стрЛС из списокЛС цикл
		   
		    Отбор = Новый Структура;
	        Отбор.Вставить("ЛицевойСчет", стрЛС);
			Отбор.Вставить("ДатаОплаты", стрОплат);

	        ТаблицаСчетчиковПоЛС = ТаблицаСчетчиков.НайтиСтроки(Отбор);
			
			счетчик = неопределено;
			для каждого строкаСчетчика из ТаблицаСчетчиковПоЛС цикл
				если строкаСчетчика.Счетчик <> неопределено и
					      строкаСчетчика.Счетчик <> Справочники.бит_Счетчики.ПустаяСсылка() тогда
				  счетчик = строкаСчетчика.Счетчик;	
				  прервать;	
				конецесли;	
			конеццикла;	
			
			если счетчик = неопределено тогда
			 продолжить;
			конецесли;     						
			
			для каждого строкаСчетчика из ТаблицаСчетчиковПоЛС цикл
				
			 таблицаУслуг = ПолучитьТаблицуУслуг(строкаСчетчика.Счетчик, строкаСчетчика.ДатаОплаты);	
				
			 для каждого строкаУслуги из таблицаУслуг цикл 	
				
			    строкаНачислений = ДокументВводПоказаний.ПоказанияПоСчетчикам.Добавить();	
			
			    строкаНачислений.Дом = строкаСчетчика.ЛицевойСчет.Здание; 
//			    строкаНачислений.КоличествоЕдиницПоСчетчику = ПолучитьКоличествоЕдиницПоСчетчику(строкаСчетчика.Счетчик);
			    строкаНачислений.ЛицевойСчет = строкаСчетчика.ЛицевойСчет; 
			    строкаНачислений.Многотарифный = ложь;
			    строкаНачислений.ПредыдущиеПоказания = ПолучитьПредыдущиеПоказанияСчетчика(строкаСчетчика.ДатаОплаты, строкаСчетчика.Счетчик, строкаУслуги.Услуга);
			    строкаНачислений.Разрядность = 9999;
			    строкаНачислений.Счетчик = строкаСчетчика.Счетчик; 
			    строкаНачислений.ТекущиеПоказания = строкаСчетчика.ЗначениеСчетчика; 
			    строкаНачислений.Улица = строкаСчетчика.ЛицевойСчет.УлицаЛицевогоСчета;
			    строкаНачислений.Услуга = строкаУслуги.Услуга; 
				строкаНачислений.КоличествоЕдиницПоСчетчику = строкаНачислений.ТекущиеПоказания - строкаНачислений.ПредыдущиеПоказания;
					  
		      конеццикла;
		  
			конеццикла;	
			
			// Удаление счетчиков без показаний жильцов.
			ОтборБезПоказаний	= Новый Структура("ТекущиеПоказания",0);
			СтрокиБезПоказаний	= ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(ОтборБезПоказаний);

			Если СтрокиБезПоказаний.Количество() > 0 Тогда
				Для Каждого Элт Из СтрокиБезПоказаний Цикл
					ДокументВводПоказаний.ПоказанияПоСчетчикам.Удалить(Элт);
				КонецЦикла;
			КонецЕсли;
			
			
			Попытка
	//			Если ПревышениеРазрядности Тогда
	//				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Запись);
	//			Иначе
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
				
				Отбор = Новый Структура;
	            Отбор.Вставить("ДатаОплаты_ЛицевойСчет_Услуга", стрОплат);

	            ТаблицаДат = тДеревоОплаты.Строки.НайтиСтроки(Отбор);
                ТаблицаДат[0].ДокументОплаты = ДокументВводПоказаний.Ссылка;
	//			КонецЕсли;
				ТекстСообщения = НСтр("ru = 'Создан документ ввода показаний: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументВводПоказаний.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументВводПоказаний.Ссылка);
			Исключение
				Ошибка = Истина;
				ТекстСообщения = НСтр("ru = 'Ошибка при записи документов ввода показаний счетчиков: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ОтменитьТранзакцию();
			КонецПопытки;
			
	  КонецЦикла;	
    КонецЦикла;
  
    ЗначениеВРеквизитФормы(тДеревоОплаты, "ДеревоОплаты");

КонецПроцедуры

Функция НайтиДатуДокумента(датаДока)
	
 докПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.ПустаяСсылка();
 датаДокаЛок = НачалоДня(датаДока) + 43200;
 пока докПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.ПустаяСсылка() цикл	
  Выборка = Документы.бит_ВводПоказанийПоСчетчикам.Выбрать(датаДокаЛок, датаДокаЛок);
  если Выборка.Следующий() тогда
   датаДокаЛок = датаДокаЛок + 60;
  иначе
   прервать;
  конецесли; 
 конеццикла;	

 возврат датаДокаЛок;
КонецФункции // НайтиДатуДокумента()

Функция ПолучитьТаблицуУслуг(Счетчик, Период)

  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ
                 |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга
                 |ИЗ
                 |	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Период, ) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
                 |ГДЕ
                 |	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = &Счетчик
                 |	И бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик.ПометкаУдаления = ложь";
  
  запрос.УстановитьПараметр("Счетчик", Счетчик);
  запрос.УстановитьПараметр("Период", Период);
  
  таб = новый ТаблицаЗначений;
  таб = запрос.Выполнить().Выгрузить();  
  
  возврат таб;
  
КонецФункции // ПолучитьТаблицуУслуг()


Функция ПолучитьКоличествоЕдиницПоСчетчику(Счетчик)

  запрос = новый Запрос;
  запрос.Текст = 
  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
   | СУММА(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдиницПоЛСОборот + бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдПодкруткаОборот) КАК КоличествоЕдиниц
   | ИЗ
   |	РегистрНакопления.бит_КолЕдиницПоСчетчикам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК бит_КолЕдиницПоСчетчикамОбороты
   | ГДЕ
   |	НЕ бит_КолЕдиницПоСчетчикамОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
   |	И бит_КолЕдиницПоСчетчикамОбороты.Счетчик = &Счетчик";

   запрос.УстановитьПараметр("Счетчик", Счетчик);
   запрос.УстановитьПараметр("НачалоПериода", '00010101000000');
   запрос.УстановитьПараметр("КонецПериода", '00010101000000');
   
   таб = запрос.Выполнить().Выгрузить();
   
   если таб.Количество() > 0 тогда
	 возврат таб[0].КоличествоЕдиниц;   
   иначе	   
	 возврат неопределено;  
   конецесли;	

КонецФункции // ПолучитьКоличествоЕдиницПоСчетчику()


функция ПолучитьПредыдущиеПоказанияСчетчика(Дата, Счетчик, Услуга)
	
  запрос = новый Запрос;
  запрос.Текст = 
  "ВЫБРАТЬ
  |	бит_ПоказанияСчетчиковОстатки.Объект КАК Объект,
  |	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
  |	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
  |	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПредыдущиеПоказания
  |ИЗ
  |	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, ) КАК бит_ПоказанияСчетчиковОстатки
  |ГДЕ
  |	бит_ПоказанияСчетчиковОстатки.Счетчик = &Счетчик
  |	И бит_ПоказанияСчетчиковОстатки.Услуга = &Услуга";
  
   запрос.УстановитьПараметр("Счетчик", Счетчик);
   запрос.УстановитьПараметр("Дата", Дата);
   запрос.УстановитьПараметр("Услуга", Услуга);
   
   таб = запрос.Выполнить().Выгрузить();
   
   если таб.Количество() > 0 тогда
	 возврат таб[0].ПредыдущиеПоказания;   
   иначе	   
	 возврат неопределено;  
   конецесли;	   
конецфункции	


//16.05.2019
&НаКлиенте
Процедура ВидЗагрузкиПриИзменении(Элемент)
	если Объект.ВидЗагрузки = "ПоказанияСчетчиков" тогда
	  Элементы.ДеревоОплатыСоздатьВводПоказанийПоСчетчикам.Видимость = истина;
	  Элементы.СоздатьОплаты.Видимость = ложь;
	  
      Элементы.ДеревоОплатыСчетчик.Видимость = истина;
	  Элементы.ДеревоОплатыЗначениеСчетчика.Видимость = истина; 
	  
	  Элементы.ДеревоОплатыИсточникОплаты.Видимость = ложь;
	  Элементы.ДеревоОплатыКомментарий.Видимость = ложь;
	  Элементы.ДеревоОплатыНазначениеПлатежа.Видимость = ложь;
	  Элементы.ДеревоОплатыСумма.Видимость = ложь;
	  Элементы.ДеревоОплатыСуммаСУчетомПроцента.Видимость = ложь;
	  Элементы.ДеревоОплатыШаблонИзвещений.Видимость = ложь;
	  
	  Элементы.ДеревоОплатыДокументОплаты.Заголовок = "Документ ввода показаний";
	  
    иначе
	  Элементы.ДеревоОплатыСоздатьВводПоказанийПоСчетчикам.Видимость = ложь;
	  Элементы.СоздатьОплаты.Видимость = истина;
	  
	  Элементы.ДеревоОплатыИсточникОплаты.Видимость = истина;
	  Элементы.ДеревоОплатыКомментарий.Видимость = истина;
	  Элементы.ДеревоОплатыНазначениеПлатежа.Видимость = истина;
	  Элементы.ДеревоОплатыСумма.Видимость = истина;
	  Элементы.ДеревоОплатыСуммаСУчетомПроцента.Видимость = истина;
	  Элементы.ДеревоОплатыШаблонИзвещений.Видимость = истина;
	  
      Элементы.ДеревоОплатыСчетчик.Видимость = ложь;
	  Элементы.ДеревоОплатыЗначениеСчетчика.Видимость = ложь; 

	  Элементы.ДеревоОплатыДокументОплаты.Заголовок = "Документ оплаты";
    конецесли;	
    ОчиститьДеревоОплатыСервер();
КонецПроцедуры
// БИТ ЖКХ 12.01.2021
функция ДобавитьРазделитель(ЗначениеИзСтроки)
	
	если ЗначениеЗаполнено(ЗначениеИзСтроки) = истина тогда
		возврат ",";
	конецесли;
	
конецфункции

#КонецОбласти