
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОписаниеОбновлений = Элементы.ДокументОписаниеОбновлений;
	
	ОбработкаОбъект=РеквизитФормыВЗначение("Объект");	
	МакетОписаниеОбновлений = ОбработкаОбъект.ПолучитьМакет("ОписаниеОбновлений");	
	
	ДокументОписаниеОбновлений.Очистить();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПакетаОбработокОбновленияИБ(Команда)
	Форма = ПолучитьФорму("Обработка.бит_ОбновлениеИнформационнойБазы.Форма.ЗапускПакетаОбработокОбновленияКонфигурации");
	Форма.Открыть();
КонецПроцедуры

#КонецОбласти
