
#Область РасчетыНачисленийПоКоммунальнымУслугам

// Процедура формирует таблицы для выплнения начисоений по лицевым счетам.
//
// Параметры:
//  Дата         - <Тип.Дата>             - Дата начислений.
//
//  Организация  - <Тип.СправочникСсылка> - Текущая организация.
//                 
//  СписокЛС     - <Тип.Массив>           - Список лицевых счетов по которым необходимо вести начисления.
//
//  СписокЗданий - <Тип.Массив>           - Список зданий по которым необходимо вести начисления по лицевым счетам.
//
//  ЛьготаПерф   - <Тип.Булево>           - Флаг настроек параметров ЖКХ поорганизации по пефинифицированной льготе.
//
//  ЭтоЛС        - <Тип.Булево>           - Флаг, является ли расчет начислений.
//  Заполнением элемента справочника "ЛицевыеСчета".
//
//  ЭтоОплата    - <Тип.Булево>           - Флаг, является ли расчет начислений заполнением документа "ОплатаКУ".
//
//  ТаблицаНачислений    - <Тип.ТаблицаЗначений - Таблица для заполнения расчетами начислений по нормам.
//
//  ТаблицаСчетчиков     - <Тип.ТаблицаЗначений - Таблица для заполнения расчетами начислений по счетчикам.
//
//  ТаблицаРаспределений - <Тип.ТаблицаЗначений - Таблица для заполнения расчетами начислений по распределениям.
//
//  ТаблицаЛьгот         - <Тип.ТаблицаЗначений - Таблица для заполнения расчетами начислений по льготам.
//
//  ТолькоГрупповые      - <Тип.Булево>         - Флаг, ведется ли расчет начислений только по групповым счетчикам. 
//  Используется для заполнения таблицы расшифровки в справочнике "СписокЗданий".
//
//  РасчетДолей          - <Тип.Булево>         - Флаг, хранит настройку.
//  Параметров жкх "Расчет с учетом долей владения".
//
//  УменьшитьНормуЛьготы - <Тип.Булево>         - Флаг, хранит настройку.
//  Параметров жкх "Уменьшение нормы льготы до фактического потребления на человека".
//
//  СписокЗданий         - <Тип.Массив>         - Список услуг по которым необходимо вести начисления по лицевым счетам.
//
//  ОтОсновногоСпособаРасчета - <Тип.Булево>    - Флаг, признак расчета начислений услуг по основному способу расчета.
//
// Возвращаемое значение:
//  ТаблицаНачислений    - <Тип.ТаблицаЗначений - Таблица заполненая расчетами начислений по нормам.
//
//  ТаблицаСчетчиков     - <Тип.ТаблицаЗначений - Таблица заполненая расчетами начислений по счетчикам.
//
//  ТаблицаРаспределений - <Тип.ТаблицаЗначений - Таблица заполненая расчетами начислений по распределениям.
//
//  ТаблицаЛьгот         - <Тип.ТаблицаЗначений - Таблица заполненая расчетами начислений по льготам.
//
//  УчетДнейПроживания   - <Тип.Булево>         - Флаг, хранит настройку.
//  Параметров жкх "Начисление с учетом дней проживания".
//
//  ТаблицаПроживающих   - <Тип.ТаблицаЗначений - Таблица для заполнения расчетами начислений по льготам.
//
Процедура ВыполнитьНачисления(Дата, Организация, СписокЛС, СписокЗданий, ЛьготаПерф = Ложь, ПолнаяТаблицаНачислений = Ложь, 
	ТаблицаНачислений = Неопределено, ТаблицаСчетчиков = Неопределено, ТаблицаРаспределений = Неопределено, ТаблицаЛьгот = Неопределено ,
	ТолькоГрупповые = Ложь, ЭтоОплата = Ложь, РасчетДолей = Ложь, УменьшитьНормуЛьготы = Ложь, УчетДнейПроживания = Ложь,
	ТаблицаПроживающих = Неопределено, ТаблицаОбщедомовыхРасходов = Неопределено, РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = Ложь,
	РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = Ложь,
	РасчетДляРазовых = Ложь,
	ЭтоЛС = Ложь) Экспорт
	// БИТ_ЖКХ 07.07.2015}}
	// БИТ_ЖКХ 24.05.2017 10:03:31 Необходимо заменить передачу параметров структурой.
	
	Перем ТаблицаУчетаДнейПроживания;
	
	Запрос = Новый Запрос;
	
	МВТ    = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Момент"      , Дата);
	Запрос.УстановитьПараметр("ИсхСписокЛС" , СписокЛС);
	Запрос.УстановитьПараметр("СписокЗданий", СписокЗданий);
	
	// БИТ_ЖКХ 03.02.2016 12:04:14 Начало правки... Нужно пернести весь кэш с точек вызова, сложно везде исправлять параметры.
	Если Дата >= Дата('20160101') Тогда
		ПараметрыЖКХ = Новый Структура;
		ПараметрыЖКХ.Вставить("Мосэнергосбыт2016", Ложь);
		ПараметрыЖКХ.Вставить("РасчетОбъемовДоТретьегоЗнака", Ложь);
		бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, ПараметрыЖКХ);
		РасчетОбъемовДоТретьегоЗнака = ПараметрыЖКХ.РасчетОбъемовДоТретьегоЗнака;
		Мосэнергосбыт2016 = ПараметрыЖКХ.Мосэнергосбыт2016;
	Иначе
		ПараметрыЖКХ = Новый Структура;
		ПараметрыЖКХ.Вставить("РасчетОбъемовДоТретьегоЗнака", Ложь);
		бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, ПараметрыЖКХ);
		РасчетОбъемовДоТретьегоЗнака = ПараметрыЖКХ.РасчетОбъемовДоТретьегоЗнака;
		Мосэнергосбыт2016 = Ложь;
	КонецЕсли; 
	// БИТ_ЖКХ 03.02.2016 12:04:14 Конец правки.
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик
	|ПОМЕСТИТЬ ГрупСчетчики
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Момент,
	|			Объект В (&СписокЗданий)
	|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)) КАК бит_СчетчикиНаУслугахСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать = ИСТИНА";
	
	Запрос.Выполнить();
	
	// БИТ_ЖКХ 24.05.2017 10:48:35 Начало правки...
	Если ЭтоЛС Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
		|ИЗ
		|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
		|			&Момент,
		|			ГрупповойСчетчик В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						Таб.Счетчик
		|					ИЗ
		|						ГрупСчетчики КАК Таб)
		|				И ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|ГДЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
		|	бит_РаспределенияНаУслугахСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
		|			&Момент,
		|			Объект В (&СписокЗданий)
		|				И ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_РаспределенияНаУслугахСрезПоследних
		|ГДЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.Использовать = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрупСчетчики.Счетчик
		|ИЗ
		|	ГрупСчетчики КАК ГрупСчетчики";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
		|ИЗ
		|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
		|			&Момент,
		|			ГрупповойСчетчик В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Таб.Счетчик
		|				ИЗ
		|					ГрупСчетчики КАК Таб)) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|ГДЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
		|	бит_РаспределенияНаУслугахСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Момент, Объект В (&СписокЗданий)) КАК бит_РаспределенияНаУслугахСрезПоследних
		|ГДЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.Использовать = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрупСчетчики.Счетчик
		|ИЗ
		|	ГрупСчетчики КАК ГрупСчетчики";
 	КонецЕсли;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
	//|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
	//|ИЗ
	//|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
	//|			&Момент,
	//|			ГрупповойСчетчик В
	//|				(ВЫБРАТЬ
	//|					Таб.Счетчик
	//|				ИЗ
	//|					ГрупСчетчики КАК Таб)) КАК бит_ГрупповыеСчетчикиСрезПоследних
	//|ГДЕ
	//|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	//|	бит_РаспределенияНаУслугахСрезПоследних.Объект
	//|ИЗ
	//|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Момент, Объект В (&СписокЗданий)) КАК бит_РаспределенияНаУслугахСрезПоследних
	//|ГДЕ
	//|	бит_РаспределенияНаУслугахСрезПоследних.Использовать = ИСТИНА
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ГрупСчетчики.Счетчик
	//|ИЗ
	//|	ГрупСчетчики КАК ГрупСчетчики";
	//// БИТ_ЖКХ изменение кода. Конец. 20.03.2012}}
	// БИТ_ЖКХ 24.05.2017 10:48:29 Конец правки. 
	
	ПолныйСписокЛС = Новый Массив;
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	Результат = РезультатПакета[0].Выгрузить();
	ПолныйСписокЛС     = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	// ПолныйСписокЗданий = Результат.ВыгрузитьКолонку("Здание");.
	
	Для каждого ЭлементСписка Из СписокЛС Цикл
		
		Если ПолныйСписокЛС.Найти(ЭлементСписка) = Неопределено Тогда
			
			ПолныйСписокЛС.Добавить(ЭлементСписка);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Результат = РезультатПакета[1].Выгрузить();
	СписокГрупСчетчиков = Результат.ВыгрузитьКолонку("Счетчик");
	
	Запрос.УстановитьПараметр("СписокЛС"           , ПолныйСписокЛС);
	Запрос.УстановитьПараметр("СписокГрупСчетчиков", СписокГрупСчетчиков);
	// Запрос.УстановитьПараметр("ПолныйСписокЗданий", ПолныйСписокЗданий);.
	// Запрос.УстановитьПараметр("СписокУслуг" , СписокУслуг);.
	
	// БИТ_ЖКХ_23082013_начало_изменений
	ЗапросДата = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения
	|ИЗ
	|	РегистрСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СрезПоследних(
	|			&Момент,
	|			Организация = &Организация
	|				И Начислять = ИСТИНА) КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних");
	
	ЗапросДата.УстановитьПараметр("Момент",      Дата);
	ЗапросДата.УстановитьПараметр("Организация", Организация);
	
	ДатаДо = Дата(1,1,1,1,1,2);
	
	Выборка = ЗапросДата.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДатаДо = Выборка.ПериодСравнения;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ДатаДо"             , ДатаДо);
	Запрос.УстановитьПараметр("Организация"        , Организация);
	// БИТ_ЖКХ_23082013_окончание_изменений
	
	// Составление таблицы со сведениями по лицевым счетам.

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГруппаУслуги КАК ГруппаУслуги,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК МойПоставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	|ПОМЕСТИТЬ бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет В (&СписокЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	// БИТ_ЖКХ 14.07.2017 11:45:36 Начало правки... 
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Номенклатура КАК Номенклатура,
	// БИТ_ЖКХ 14.07.2017 11:45:38 Конец правки. 
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГруппаУслуги КАК ГруппаУслуги,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК МойПоставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	|ПОМЕСТИТЬ ЛС
	|ИЗ
	|	бит_СведенияПоУслугамЛССрезПоследних КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	Квартира,
	|	СпособРасчета,
	|	Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры
	|ПОМЕСТИТЬ ВтСведенияОКвартире
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&Момент,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ЛС.Квартира
	|				ИЗ
	|					ЛС КАК ЛС)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Услуга,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ДоговорКонтрагента
	|ПОМЕСТИТЬ ВтПолучателиДенежныхСредств
	|ИЗ
	|	РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(
	|			&Момент,
	|			(Услуга, Поставщик) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ЛС.Услуга,
	|					ЛС.Поставщик
	|				ИЗ
	|					ЛС КАК ЛС)) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Услуга,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ЛС.Услуга КАК Услуга,
	|	ЛС.Квартира,
	|	ЛС.РежимПотребления КАК РежимПотребления,
	|	ЛС.Поставщик КАК Поставщик,
	|	ЛС.СпособРасчета КАК СпособРасчета,
	|	ЛС.ГруппаУслуги,
	|	ЛС.МойПоставщик,
	// БИТ_ЖКХ 14.07.2017 11:47:24 Начало правки... 
	|	ЛС.Номенклатура,
	// БИТ_ЖКХ 14.07.2017 11:47:25 Конец правки. 
	|	бит_УслугиЖКХСпособыРасчета.ЕдИзм,
	|	ЛС.КоличествоЕдиницПотребления,
	|	ВтСведенияОКвартире.ОбщаяПлощадь,
	|	ВтСведенияОКвартире.ЖилаяПлощадь,
	|	ВтСведенияОКвартире.МОП,
	|	ВтСведенияОКвартире.ОтапливаемаяПлощадь,
	|	ВтСведенияОКвартире.СовокупнаяПлощадь,
	|	ВтСведенияОКвартире.ТипКвартиры КАК ТипКвартиры,
	|	ВтСведенияОКвартире.СтатусКвартиры КАК СтатусКвартиры,
	|	ВтПолучателиДенежныхСредств.ПолучательДенежныхСредств,
	|	ВтПолучателиДенежныхСредств.ДоговорКонтрагента,
	|	бит_УслугиЖКХ.Приоритет КАК Приоритет,
	|	бит_УслугиЖКХ.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
	|	бит_УслугиЖКХ.ОсновнойРежимПотребления КАК ОсновнойРежимПотребления
	|ПОМЕСТИТЬ ТаблицаСведенийПоЛС
	|ИЗ
	|	ЛС КАК ЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСведенияОКвартире КАК ВтСведенияОКвартире
	|		ПО ЛС.Квартира = ВтСведенияОКвартире.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|		ПО ЛС.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|			И ЛС.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПолучателиДенежныхСредств КАК ВтПолучателиДенежныхСредств
	|		ПО ЛС.Услуга = ВтПолучателиДенежныхСредств.Услуга
	|			И ЛС.Поставщик = ВтПолучателиДенежныхСредств.Поставщик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ЛС.Услуга = бит_УслугиЖКХ.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Поставщик,
	|	РежимПотребления,
	|	СпособРасчета,
	|	СтатусКвартиры,
	|	ТипКвартиры";
	Запрос.Выполнить();
	
	// Составления таблицы с проживающими.

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы КАК ПравоНаЛьготы,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.Период
	|ПОМЕСТИТЬ ТаблицаФизЛиц
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	ФизЛицо";
	Запрос.Выполнить();
	
	// Составление таблицы с проживающими и их правами.

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ЛьготыПоЛССрезПоследних.ФизЛицо) КАК КоличествоЛьготников
	|ПОМЕСТИТЬ КолЛьготников
	|ИЗ
	|	РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&СписокЛС)) КАК бит_ЛьготыПоЛССрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроживающих,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличчествоПоНорме,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК мКоличествоПоНормеЛьгота,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК мКоличествоПроживающихЛьготы,
	|	ЕСТЬNULL(КолЛьготников.КоличествоЛьготников, 0) КАК КоличествоЛьготников,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме, ЛОЖЬ)
	|				ТОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоляПлощади,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме, ЛОЖЬ)
	|					И ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы, ЛОЖЬ)
	|				ТОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоляПлощадиПоЛьготам,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроживающихПоНорме
	|ПОМЕСТИТЬ ТаблицаПроживающих
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&СписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ КолЛьготников КАК КолЛьготников
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = КолЛьготников.ЛицевойСчет
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	ЕСТЬNULL(КолЛьготников.КоличествоЛьготников, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет";
	Запрос.Выполнить();
	
	// Составление таблицы со списком льгот.

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Льготы.ФизЛицо,
	|	Льготы.Льгота,
	|	Льготы.СрокДействияЛьготы,
	|	ФизЛица.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	ФизЛица.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы КАК ПравоНаЛьготы,
	|	ФизЛица.ЛицевойСчет,
	|	ФизЛица.ДоляПлощади
	|ПОМЕСТИТЬ ТаблицаЛьгот
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|		ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|		ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|		ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|		ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|		ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|		ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади
	|	ИЗ
	|		РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ИсхСписокЛС)) КАК ПроживающиеПоЛССрезПоследних
	|	ГДЕ
	|		(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))) КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ЛьготыПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|			бит_ЛьготыПоЛССрезПоследних.Льготы КАК Льгота,
	|			бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы КАК СрокДействияЛьготы,
	|			бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	|		ИЗ
	|			РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_ЛьготыПоЛССрезПоследних
	|		ГДЕ
	|			(бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &Момент
	|					ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1))) КАК Льготы
	|		ПО ФизЛица.ФизЛицо = Льготы.ФизЛицо
	|			И ФизЛица.ЛицевойСчет = Льготы.ЛицевойСчет
	|ГДЕ
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы = ИСТИНА";
	Запрос.Выполнить();
	
	// Расчет норм.

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСведенийПоЛС.Услуга
	|ПОМЕСТИТЬ РазличныеУслугиЖКХ
	|ИЗ
	|	ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСведенийПоЛС.Услуга,
	|	ТаблицаСведенийПоЛС.Поставщик,
	|	ТаблицаСведенийПоЛС.РежимПотребления,
	|	ТаблицаСведенийПоЛС.СпособРасчета,
	|	ТаблицаСведенийПоЛС.СтатусКвартиры,
	|	ТаблицаСведенийПоЛС.ТипКвартиры
	|ПОМЕСТИТЬ РазличныеСведенийПоЛС
	|ИЗ
	|	ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем
	|ПОМЕСТИТЬ Объемы
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ),
	|			,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТАб.Услуга КАК УслугаЖКХ
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАб)
	|				И ЛицевойСчет В (&СписокЛС)) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ),
	|			Регистратор,
	|			УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАб.Услуга КАК УслугаЖКХ
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАб)
	|				И ЛицевойСчет В (&СписокЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ТипУслуги = ЗНАЧЕНИЕ(Перечисление.бит_ТипыУслуг.ВнешняяДобровольноеСтрахование)
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сальдо
	|ПОМЕСТИТЬ СальдоНаКонец
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			ЛицевойСчет В (&СписокЛС)
	|				И УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАБ.Услуга КАК УСЛУГА
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАБ)) КАК бит_НачисленияПоУслугамЖКХОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ТипУслуги = ЗНАЧЕНИЕ(Перечисление.бит_ТипыУслуг.ВнешняяДобровольноеСтрахование)
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сальдо
	|ПОМЕСТИТЬ ТекСальдо
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	|			КОНЕЦПЕРИОДА(&Момент, ДЕНЬ),
	|			ЛицевойСчет В (&СписокЛС)
	|				И УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАБ.Услуга КАК УСЛУГА
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАБ)) КАК бит_НачисленияПоУслугамЖКХОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток) КАК СальдоПени
	|ПОМЕСТИТЬ ТекСальдоПени
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(
	|			КОНЕЦПЕРИОДА(&Момент, ДЕНЬ),
	|			ЛицевойСчет В (&СписокЛС)
	|				И УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАБ.Услуга КАК Услуга
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАБ)) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследних.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследних.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка,
	// БИТ_ЖКХ_07072015_++	
	|	бит_СтавкиНаУслугиСрезПоследних.ЛьготнаяСтавка,
	// БИТ_ЖКХ_07072015_--	
	|	бит_СтавкиНаУслугиСрезПоследних.Тариф
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			(Услуга, Поставщик, РежимПотребления, СпособРасчета, СтатусКвартиры, ТипКвартиры) В
	|				(ВЫБРАТЬ
	|					РазличныеСведенийПоЛС.Услуга,
	|					РазличныеСведенийПоЛС.Поставщик,
	|					РазличныеСведенийПоЛС.РежимПотребления,
	|					РазличныеСведенийПоЛС.СпособРасчета,
	|					РазличныеСведенийПоЛС.СтатусКвартиры,
	|					РазличныеСведенийПоЛС.ТипКвартиры
	|				ИЗ
	|					РазличныеСведенийПоЛС)) КАК бит_СтавкиНаУслугиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследних.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследних.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ТипКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СверхНормативнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ПлановаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Тариф
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследнихДо
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&ДатаДо,
	|			(Услуга, Поставщик, РежимПотребления, СпособРасчета, СтатусКвартиры, ТипКвартиры) В
	|				(ВЫБРАТЬ
	|					РазличныеСведенийПоЛС.Услуга,
	|					РазличныеСведенийПоЛС.Поставщик,
	|					РазличныеСведенийПоЛС.РежимПотребления,
	|					РазличныеСведенийПоЛС.СпособРасчета,
	|					РазличныеСведенийПоЛС.СтатусКвартиры,
	|					РазличныеСведенийПоЛС.ТипКвартиры
	|				ИЗ
	|					РазличныеСведенийПоЛС)) КАК бит_СтавкиНаУслугиСрезПоследнихДо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НормыНаУслугиСрезПоследних.Услуга,
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге,
	|	бит_НормыНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.ТипКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.НаОдного,
	|	бит_НормыНаУслугиСрезПоследних.НаДвоих,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью4,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью5,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью6,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника,
	|	бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу
	|ПОМЕСТИТЬ бит_НормыНаУслугиСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|			&Момент,
	|			(Услуга, РежимПотребления, СпособРасчетаПоУслуге, СтатусКвартиры, ТипКвартиры) В
	|				(ВЫБРАТЬ
	|					РазличныеСведенийПоЛС.Услуга,
	|					РазличныеСведенийПоЛС.РежимПотребления,
	|					РазличныеСведенийПоЛС.СпособРасчета,
	|					РазличныеСведенийПоЛС.СтатусКвартиры,
	|					РазличныеСведенийПоЛС.ТипКвартиры
	|				ИЗ
	|					РазличныеСведенийПоЛС)) КАК бит_НормыНаУслугиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_НормыНаУслугиСрезПоследних.Услуга,
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге,
	|	бит_НормыНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.ПлановаяСтавка
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследнихПлановая
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
	|				И ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
	|				И Поставщик ССЫЛКА Справочник.бит_ПоставщикиУслуг) КАК бит_СтавкиНаУслугиСрезПоследнихПлановая
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.СпособРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ТипКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ПлановаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СверхНормативнаяСтавка
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследнихПоОС
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТаблицаСведенийПоЛС.Услуга
	|					ИЗ
	|						ТаблицаСведенийПоЛС)
	|				И Поставщик ССЫЛКА Справочник.бит_ПоставщикиУслуг) КАК бит_СтавкиНаУслугиСрезПоследнихПоОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиГрупСИнд.Услуга,
	|	бит_СтавкиНаУслугиГрупСИнд.Поставщик,
	|	бит_СтавкиНаУслугиГрупСИнд.РежимПотребления,
	|	бит_СтавкиНаУслугиГрупСИнд.ОсновнаяСтавка
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиГрупСИнд
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТаблицаСведенийПоЛС.Услуга
	|					ИЗ
	|						ТаблицаСведенийПоЛС)
	|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|				И СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
	|				И ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
	|				И Поставщик ССЫЛКА Справочник.бит_ПоставщикиУслуг) КАК бит_СтавкиНаУслугиГрупСИнд
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиГрупСИнд.Услуга,
	|	бит_СтавкиНаУслугиГрупСИнд.Поставщик,
	|	бит_СтавкиНаУслугиГрупСИнд.РежимПотребления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Начислять,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения
	|ПОМЕСТИТЬ бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СрезПоследних(
	|			&Момент,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТаблицаСведенийПоЛС.Услуга
	|					ИЗ
	|						ТаблицаСведенийПоЛС)
	|				И Организация = &Организация) КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСведенийПоЛС.ЛицевойСчет,
	|	ТаблицаСведенийПоЛС.Услуга,
	// БИТ_ЖКХ 14.07.2017 11:35:37 Начало правки...
	//19.12.2018 55
	|	ЕСТЬNULL(ВТ_Номенклатура.ВидСтавкиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)) КАК СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 11:35:37 Конец правки.
	|	ТаблицаСведенийПоЛС.Квартира,
	|	ТаблицаСведенийПоЛС.РежимПотребления,
	|	ТаблицаСведенийПоЛС.Поставщик,
	|	ТаблицаСведенийПоЛС.СпособРасчета,
	|	ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0) КАК ЖилаяПлощадь,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.МОП, 0) КАК МОП,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0) КАК ОтапливаемаяПлощадь,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.СовокупнаяПлощадь, 0) КАК СовокупнаяПлощадь,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка, 0) КАК Ставка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка, 0) КАК СверхномСтавка,
	// БИТ_ЖКХ_07072015_++	
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ЛьготнаяСтавка, 0) КАК ЛьготнаяСтавка,
	// БИТ_ЖКХ_07072015_--	
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ) КАК ИспользоватьДопНормуНаЛьготника,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(Проживающие.КоличествоПроживающих, 0) КАК мКоличествоПроживающих,
	|	ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0) КАК мКоличествоПоНорме,
	|	ЕСТЬNULL(Проживающие.мКоличествоПроживающихЛьготы, 0) КАК мКоличествоПроживающихЛьготы,
	|	ТаблицаСведенийПоЛС.ПолучательДенежныхСредств,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПлановая.ПлановаяСтавка, 0) КАК ПлановаяСтавка,
	|	ЕСТЬNULL(Проживающие.мКоличествоПоНормеЛьгота, 0) КАК мКоличествоПоНормеЛьгота,
	|	ЕСТЬNULL(Обороты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(Обороты.Разовые, 0) КАК Разовые,
	|	ЕСТЬNULL(СальдоНаКонец.Сальдо, 0) КАК СальдоНаНачало,
	|	ЕСТЬNULL(ТекСальдо.Сальдо, 0) КАК Сальдо,
	|	ЕСТЬNULL(ТекСальдоПени.СальдоПени, 0) КАК СальдоПени,
	|	ТаблицаСведенийПоЛС.Приоритет,
	|	ТаблицаСведенийПоЛС.ОсновнойСпособРасчета,
	|	ТаблицаСведенийПоЛС.ДоговорКонтрагента,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПоОС.ПлановаяСтавка, 0) КАК ОсновнаяПлановаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПоОС.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПоОС.СверхНормативнаяСтавка, 0) КАК ОсновнаяСверхНормСтавка,
	|	ЕСТЬNULL(Проживающие.ДоляПлощади, 0) КАК ДоляПлощади,
	|	ТаблицаСведенийПоЛС.ОсновнойРежимПотребления,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиГрупСИнд.ОсновнаяСтавка, 0) КАК СтавкаГрупСИнд,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.Тариф, 0) КАК Тариф,
	|	ВЫБОР
	|		КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|			ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|					ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	// БИТ_ЖКХ 16.05.2017 11:12:25 Начало правки... 
	|									ИЛИ ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом)
	// БИТ_ЖКХ 16.05.2017 11:12:27 Конец правки. 
	|									ТОГДА ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|											ТОГДА ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|													ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0)
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ФактОтОсновного,
	|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу, 0) КАК НормативПотребленияПоКу,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.ОсновнаяСтавка, 0) КАК СтавкаДо,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.СверхНормативнаяСтавка, 0) КАК СверхномСтавкаДо,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.ПлановаяСтавка, 0) КАК ПлановаяСтавкаДо,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.Тариф, 0) КАК ТарифДо,
	|	ЕСТЬNULL(бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы, 0) КАК ПредельныйИндекс,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Начислять КАК НачислятьПредельныйИндекс,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения КАК ПериодСравнения,
	|	ТаблицаСведенийПоЛС.ГруппаУслуги КАК ГруппаУслуги,
	|	ТаблицаСведенийПоЛС.МойПоставщик КАК МойПоставщик,
	|	ТаблицаСведенийПоЛС.ЕдИзм КАК ЕдИзм,
	|	ЕСТЬNULL(Проживающие.КоличествоПроживающихПоНорме, 0) КАК КоличествоПроживающихПоНорме
	|ИЗ
	|	ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследних КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследнихДо КАК бит_СтавкиНаУслугиСрезПоследнихДо
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследнихДо.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследнихДо.Поставщик
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследнихДо.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследнихДо.СпособРасчета
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследнихДо.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследнихДо.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_НормыНаУслугиСрезПоследних КАК бит_НормыНаУслугиСрезПоследних
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроживающих КАК Проживающие
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = Обороты.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = Обороты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СальдоНаКонец КАК СальдоНаКонец
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = СальдоНаКонец.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = СальдоНаКонец.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекСальдо КАК ТекСальдо
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = ТекСальдо.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = ТекСальдо.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекСальдоПени КАК ТекСальдоПени
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = ТекСальдоПени.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = ТекСальдоПени.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследнихПоОС КАК бит_СтавкиНаУслугиСрезПоследнихПоОС
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследнихПоОС.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследнихПоОС.Поставщик
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследнихПоОС.РежимПотребления
	|			И ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = бит_СтавкиНаУслугиСрезПоследнихПоОС.СпособРасчета
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследнихПоОС.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследнихПоОС.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследнихПлановая КАК бит_СтавкиНаУслугиСрезПоследнихПлановая
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследнихПлановая.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследнихПлановая.Поставщик
	|			И ТаблицаСведенийПоЛС.ОсновнойРежимПотребления = бит_СтавкиНаУслугиСрезПоследнихПлановая.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследнихПлановая.СпособРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиГрупСИнд КАК бит_СтавкиНаУслугиГрупСИнд
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиГрупСИнд.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиГрупСИнд.Поставщик
	|			И ТаблицаСведенийПоЛС.ОсновнойРежимПотребления = бит_СтавкиНаУслугиГрупСИнд.РежимПотребления
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = Объемы.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = Объемы.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ВТ_Номенклатура
	|		ПО ТаблицаСведенийПоЛС.Номенклатура  = ВТ_Номенклатура.Ссылка";

	ТаблицаНорм = СформироватьТаблицуНорм();
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Норма       = ПолучитьНорму(Выборка);
		НормаЛьготы = ПолучитьНормуЛьготы(Выборка);
		СверхНорма  = 0;
		
		НоваяСтрока = ТаблицаНорм.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);           
		
		ДоляПлощади = ?(РасчетДолей,Выборка.ОбщаяПлощадь * Выборка.ДоляПлощади,0);
		
		СпособРасчета = Выборка.СпособРасчета;
		
		Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
			
			Если ДоляПлощади <> 0 Тогда
				
				Норма = ?(Норма > ДоляПлощади, ДоляПлощади, Норма);
				
			КонецЕсли; 
			
			НоваяСтрока.Норматив =  НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.ОбщаяПлощадь тогда
				Норма      = Выборка.ОбщаяПлощадь;
			иначе
				СверхНорма = Выборка.ОбщаяПлощадь - Норма; 
			КонецЕсли;
			
			НоваяСтрока.Факт        = Выборка.ОбщаяПлощадь;
			НоваяСтрока.НормаЛьготы = НормаЛьготы;
			НоваяСтрока.Норма       = Норма;
			НоваяСтрока.СверхНорма  = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
			
			Если ДоляПлощади <> 0 Тогда
				
				Норма = ?(Норма > ДоляПлощади, ДоляПлощади, Норма);
				
			КонецЕсли; 
			
			НоваяСтрока.Норматив = НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.ЖилаяПлощадь тогда
				Норма      = Выборка.ЖилаяПлощадь;
			иначе
				СверхНорма = Выборка.ЖилаяПлощадь - Норма; 
			КонецЕсли;	
			
			НоваяСтрока.Факт         = Выборка.ЖилаяПлощадь;
			НоваяСтрока.НормаЛьготы  = НормаЛьготы;
			НоваяСтрока.Норма        = Норма;
			НоваяСтрока.СверхНорма   = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади Тогда
			
			Если ДоляПлощади <> 0 Тогда
				
				Норма = ?(Норма > ДоляПлощади, ДоляПлощади, Норма);
				
			КонецЕсли; 
			
			НоваяСтрока.Норматив =  НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.ОтапливаемаяПлощадь тогда
				Норма      = Выборка.ОтапливаемаяПлощадь;
			иначе
				СверхНорма = Выборка.ОтапливаемаяПлощадь - Норма; 
			КонецЕсли;	
			
			НоваяСтрока.Факт          = Выборка.ОтапливаемаяПлощадь;
			НоваяСтрока.НормаЛьготы   = НормаЛьготы;
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда
			
			// БИТ_ЖКХ изменение кода. Начало. 25.01.2013{{
			// Норма      =  Выборка.мКоличествоПроживающих;.
			Норма      = Выборка.КоличествоПроживающихПоНорме;
			СверхНорма = Выборка.мКоличествоПроживающих - Норма;
			// БИТ_ЖКХ изменение кода. Конец. 25.01.2013}}
			НоваяСтрока.Норматив = Выборка.мКоличествоПроживающихЛьготы * Выборка.Ставка;
			
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
			НоваяСтрока.Факт           = Выборка.мКоличествоПроживающих;
			НоваяСтрока.НормаЛьготы    = Выборка.мКоличествоПроживающихЛьготы;
			
		// БИТ_ЖКХ 16.05.2017 11:06:02 Начало правки...
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом Тогда
			
			НоваяСтрока.Норматив		= Выборка.мКоличествоПроживающихЛьготы * Выборка.Ставка;
			НоваяСтрока.Норма			= Выборка.КоличествоПроживающихПоНорме;
			НоваяСтрока.РасчетнаяНорма	= Норма;
			НоваяСтрока.СверхНорма		= 0;
			НоваяСтрока.Факт			= Выборка.мКоличествоПроживающих;
			НоваяСтрока.НормаЛьготы		= Выборка.мКоличествоПроживающихЛьготы;
		// БИТ_ЖКХ 16.05.2017 11:06:02 Конец правки.	
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления Тогда
			
			НоваяСтрока.Норматив =  НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.КоличествоЕдиницПотребления тогда
				Норма      = Выборка.КоличествоЕдиницПотребления;
				СверхНорма = 0; 
			иначе
				СверхНорма = Выборка.КоличествоЕдиницПотребления - Норма; 
			КонецЕсли;
			
			НоваяСтрока.Факт          = Выборка.КоличествоЕдиницПотребления;
			НоваяСтрока.НормаЛьготы   = НормаЛьготы;
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
			
			Норма = Выборка.НаЛицевойСчет;
			
			НоваяСтрока.Норматив =  Норма * Выборка.Ставка;
			
			Если Норма > Выборка.КоличествоЕдиницПотребления тогда
				Норма      = Выборка.КоличествоЕдиницПотребления;
				СверхНорма = 0; 
			иначе
				СверхНорма = Выборка.КоличествоЕдиницПотребления - Норма; 
			КонецЕсли;	
			
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
			НоваяСтрока.Факт           = Выборка.КоличествоЕдиницПотребления;
			НоваяСтрока.НормаЛьготы    = Норма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению Тогда
			
			Если Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
				
				НоваяСтрока.Норматив    = Выборка.НаЛицевойСчет * Выборка.Ставка;
				НоваяСтрока.Норма       = Выборка.НаЛицевойСчет;
				НоваяСтрока.НормаЛьготы = Выборка.НаЛицевойСчет;
				
			Иначе
				
				НоваяСтрока.Норматив    = НормаЛьготы * Выборка.Ставка;
				НоваяСтрока.Норма       = Норма;
				НоваяСтрока.НормаЛьготы = НормаЛьготы;
				
			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЦикла; 
	
	ТаблицаНорм.Сортировать("Приоритет возр");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНорм.ЛицевойСчет,
	|	ТаблицаНорм.Услуга,
	// БИТ_ЖКХ 14.07.2017 11:56:58 Начало правки...
	|	ТаблицаНорм.СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 11:56:58 Конец правки.
	|	ТаблицаНорм.Приоритет,
	|	ТаблицаНорм.РежимПотребления,
	|	ТаблицаНорм.ОсновнойРежимПотребления,
	|	ТаблицаНорм.СпособРасчета,
	|	ТаблицаНорм.Ставка,
	|	ТаблицаНорм.ОсновнаяСтавка,
	|	ТаблицаНорм.СверхномСтавка,
	|	ТаблицаНорм.ПлановаяСтавка,
	|	ТаблицаНорм.Норма,
	// БИТ_ЖКХ 16.05.2017 14:07:28 Начало правки... 
	|	ТаблицаНорм.РасчетнаяНорма,
	// БИТ_ЖКХ 16.05.2017 14:07:29 Конец правки. 
	|	ТаблицаНорм.СверхНорма,
	|	ТаблицаНорм.Норматив,
	|	ТаблицаНорм.НормаЛьготы,
	|	ТаблицаНорм.Поставщик,
	|	ТаблицаНорм.Факт,
	|	ТаблицаНорм.ПолучательДенежныхСредств,
	|	ТаблицаНорм.Сальдо,
	|	ТаблицаНорм.СальдоНаНачало,
	|	ТаблицаНорм.СальдоПени,
	|	ТаблицаНорм.Оплата,
	|	ТаблицаНорм.Разовые,
	|	ТаблицаНорм.НаОдного,
	|	ТаблицаНорм.НаДвоих,
	|	ТаблицаНорм.НаСемью,
	|	ТаблицаНорм.НаСемью4,
	|	ТаблицаНорм.НаСемью5,
	|	ТаблицаНорм.НаСемью6,
	|	ТаблицаНорм.НаЛицевойСчет,
	|	ТаблицаНорм.ДопНормаНаСемью,
	|	ТаблицаНорм.ДопНормаНаКаждого,
	|	ТаблицаНорм.ИспользоватьДопНормуНаОдного,
	|	ТаблицаНорм.ИспользоватьДопНормуНаЛьготника,
	|	ТаблицаНорм.СтавкаГрупСИнд,
	|	ТаблицаНорм.Тариф,
	|	ТаблицаНорм.Объем,
	|	ТаблицаНорм.ФактОтОсновного,
	|	ТаблицаНорм.ОсновнойСпособРасчета,
	// БИТ_ЖКХ_23082013_начало_изменений
	|	ТаблицаНорм.СтавкаДо,
	|	ТаблицаНорм.СверхномСтавкаДо,
	|	ТаблицаНорм.ПлановаяСтавкаДо,
	|	ТаблицаНорм.ТарифДо,
	|	ТаблицаНорм.ПредельныйИндекс,
	|	ТаблицаНорм.НачислятьПредельныйИндекс,
	|	ТаблицаНорм.ПериодСравнения,
	|	ТаблицаНорм.ГруппаУслуги,
	|	ТаблицаНорм.МойПоставщик,
	|	ТаблицаНорм.ЕдИзм,
	// БИТ_ЖКХ_23082013_окончание_изменений
	// БИТ_ЖКХ_07072015_++
	|	ТаблицаНорм.ЛьготнаяСтавка,	
	// БИТ_ЖКХ_07072015_--
	|	ТаблицаНорм.НормативПотребленияПоКу
	|ПОМЕСТИТЬ ТаблицаНорм
	|ИЗ
	|	&ТаблицаНорм КАК ТаблицаНорм";
	
	Запрос.УстановитьПараметр("ТаблицаНорм", ТаблицаНорм);
	Запрос.Выполнить();
	
	// Выполнение расчетов по начислениям.

	Если ТаблицаНачислений <> Неопределено  Тогда
		
		Если УчетДнейПроживания И ТаблицаПроживающих <> Неопределено Тогда
			
			РасчитатьНачисленияСУчетомДнейПроживания(Запрос, Дата, ТаблицаПроживающих);
			
		КонецЕсли; 
		
		// БИТ_ЖКХ 07.07.2015{{
		//РасчитатьНачисленияПоЛС(ТаблицаНачислений, Запрос, ТаблицаПроживающих);
		РасчитатьНачисленияПоЛС(ТаблицаНачислений, Запрос, ТаблицаПроживающих,РасчетДляРазовых);
		// БИТ_ЖКХ 07.07.2015}}
		
	КонецЕсли;
	
	Если ТаблицаСчетчиков <> Неопределено И НЕ ТолькоГрупповые Тогда
		
		РасчитатьНачисленияПоИндСчетчикам(ТаблицаСчетчиков, Запрос, РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика, РасчетОбъемовДоТретьегоЗнака);
		
	КонецЕсли;
	
	Если ТаблицаСчетчиков <> Неопределено  Тогда
		
		РасчитатьНачисленияПоГрупСчетчикам(СписокЛС, ТаблицаСчетчиков, Запрос, ЭтоЛС, РасчетОбъемовДоТретьегоЗнака);
		
	КонецЕсли;
	
	Если ТаблицаРаспределений <> Неопределено Тогда
		
		РасчитатьНачисленияПоРаспределений(СписокЛС, ТаблицаРаспределений, Запрос, , РасчетОбъемовДоТретьегоЗнака);
		
	КонецЕсли;
	
	Если ТаблицаЛьгот <> Неопределено Тогда
		
		// БИТ_ЖКХ 02.03.2016 11:07:37 Начало правки... 
		//РасчитатьНачисленияЛьгот(Дата, Организация, СписокЛС, ТаблицаЛьгот, ТаблицаНачислений, ТаблицаСчетчиков, ТаблицаРаспределений, Запрос, УменьшитьНормуЛьготы,,РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
		РасчитатьНачисленияЛьгот(Дата, Организация, СписокЛС, ТаблицаЛьгот, ТаблицаНачислений, ТаблицаСчетчиков, ТаблицаРаспределений, Запрос, УменьшитьНормуЛьготы,,РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика, Мосэнергосбыт2016);
		// БИТ_ЖКХ 02.03.2016 11:07:39 Конец правки. 
		
	КонецЕсли; 
	
	// В случае заполнения оплаты ку или лицевойго счета "таблица начислений" должна содержать все виды начислений. 

	Если ПолнаяТаблицаНачислений Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСчетчиков.ЛицевойСчет,
		|	ТаблицаСчетчиков.Услуга,
		// БИТ_ЖКХ 14.07.2017 12:17:15 Начало правки...
		|	ТаблицаСчетчиков.СтавкаНДС,
		// БИТ_ЖКХ 14.07.2017 12:17:15 Конец правки.
		|	ТаблицаСчетчиков.Ставка,
		|	ТаблицаСчетчиков.СверхномСтавка,
		|	ТаблицаСчетчиков.Поставщик,
		|	ТаблицаСчетчиков.ПолучательДенежныхСредств,
		|	ТаблицаСчетчиков.Сальдо,
		|	ТаблицаСчетчиков.СальдоНаНачало,
		|	ТаблицаСчетчиков.СальдоПени,
		|	ТаблицаСчетчиков.Оплата,
		|	ТаблицаСчетчиков.Разовые,
		|	ТаблицаСчетчиков.Приоритет,
		|	ТаблицаСчетчиков.Начислено,
		|	ТаблицаСчетчиков.Норма,
		|	ТаблицаСчетчиков.СверхНорма,
		|	ТаблицаСчетчиков.КоличествоЕдиниц,
		|	ТаблицаСчетчиков.КоличествоЕдиницПоЛС
		|ПОМЕСТИТЬ ТаблицаСчетчиковКопия
		|ИЗ
		|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСчетчиковКопия.ЛицевойСчет,
		|	ТаблицаСчетчиковКопия.Услуга,
		// БИТ_ЖКХ 14.07.2017 12:19:10 Начало правки... 
		|	ТаблицаСчетчиковКопия.СтавкаНДС,
		// БИТ_ЖКХ 14.07.2017 12:19:11 Конец правки. 
		|	МАКСИМУМ(ТаблицаСчетчиковКопия.Ставка) КАК Ставка,
		|	МАКСИМУМ(ТаблицаСчетчиковКопия.СверхномСтавка) КАК СверхномСтавка,
		|	ТаблицаСчетчиковКопия.Поставщик,
		|	ТаблицаСчетчиковКопия.ПолучательДенежныхСредств,
		|	МАКСИМУМ(ТаблицаСчетчиковКопия.Сальдо) КАК Сальдо,
		|	МАКСИМУМ(ТаблицаСчетчиковКопия.СальдоНаНачало) КАК СальдоНаНачало,
		|	МАКСИМУМ(ТаблицаСчетчиковКопия.СальдоПени) КАК СальдоПени,
		|	МАКСИМУМ(ТаблицаСчетчиковКопия.Оплата) КАК Оплата,
		|	МАКСИМУМ(ТаблицаСчетчиковКопия.Разовые) КАК Разовые,
		|	ТаблицаСчетчиковКопия.Приоритет,
		|	СУММА(ТаблицаСчетчиковКопия.Начислено) КАК Начислено,
		// БИТ_ЖКХ_23082013_начало_изменений
		// |	МАКСИМУМ(ТаблицаСчетчиковКопия.Норма) КАК Норма,.
		|	СУММА(ТаблицаСчетчиковКопия.Норма) КАК Норма,
		// БИТ_ЖКХ_23082013_окончание_изменений
		|	СУММА(ТаблицаСчетчиковКопия.КоличествоЕдиниц) КАК КоличествоЕдиниц,
		|	СУММА(ТаблицаСчетчиковКопия.КоличествоЕдиницПоЛС) КАК Факт,
		// БИТ_ЖКХ_23082013_начало_изменений
		// |	МАКСИМУМ(ТаблицаСчетчиковКопия.СверхНорма) КАК СверхНорма.
		|	СУММА(ТаблицаСчетчиковКопия.СверхНорма) КАК СверхНорма
		// БИТ_ЖКХ_23082013_окончание_изменений
		|ИЗ
		|	ТаблицаСчетчиковКопия КАК ТаблицаСчетчиковКопия
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаСчетчиковКопия.ЛицевойСчет,
		|	ТаблицаСчетчиковКопия.Услуга,
		|	ТаблицаСчетчиковКопия.СтавкаНДС,
		|	ТаблицаСчетчиковКопия.Поставщик,
		|	ТаблицаСчетчиковКопия.ПолучательДенежныхСредств,
		|	ТаблицаСчетчиковКопия.Приоритет";
		
		Запрос.УстановитьПараметр("ТаблицаСчетчиков", ТаблицаСчетчиков);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
			Отбор.Вставить("Услуга"     , Выборка.Услуга);
			
			МассивСтрок   = ТаблицаНачислений.НайтиСтроки(Отбор);
			
			Если МассивСтрок.Количество() = 0  Тогда
				
				НоваяСтрока = ТаблицаНачислений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.КОплате        = НоваяСтрока.СальдоНаНачало + НоваяСтрока.Начислено - НоваяСтрока.Льгота 
				- НоваяСтрока.Оплата + НоваяСтрока.Разовые;
				НоваяСтрока.КОплате        = ?(НоваяСтрока.КОплате < 0,0,НоваяСтрока.КОплате);
				НоваяСтрока.КОплатеЗаМесяц = НоваяСтрока.Начислено + НоваяСтрока.Разовые;
				НоваяСтрока.Переплата      = НоваяСтрока.ПереплатаНаначало  + НоваяСтрока.Начислено - НоваяСтрока.Оплата + НоваяСтрока.Разовые;
				НоваяСтрока.СпособРасчета  = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Для каждого Строка Из ТаблицаРаспределений Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЛицевойСчет", Строка.ЛицевойСчет);
			Отбор.Вставить("Услуга"     , Строка.Услуга);
			
			МассивСтрок = ТаблицаНачислений.НайтиСтроки(Отбор);
			
			Если МассивСтрок.Количество() = 0  Тогда
				
				НоваяСтрока = ТаблицаНачислений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.КОплате   = НоваяСтрока.СальдоНаНачало + НоваяСтрока.Начислено - НоваяСтрока.Льгота 
				- НоваяСтрока.Оплата + НоваяСтрока.Разовые;
				НоваяСтрока.КОплате   = ?(НоваяСтрока.КОплате < 0,0,НоваяСтрока.КОплате);
				НоваяСтрока.КОплатеЗаМесяц = НоваяСтрока.Начислено + НоваяСтрока.Разовые;
				НоваяСтрока.Переплата      = НоваяСтрока.ПереплатаНаначало  + НоваяСтрока.Начислено - НоваяСтрока.Оплата + НоваяСтрока.Разовые;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Если НЕ ТаблицаЛьгот = Неопределено Тогда
			
			ТаблицаЛьгот.Свернуть("ЛицевойСчет, Услуга, Начислено");
			ТаблицаНачислений.Индексы.Добавить("ЛицевойСчет,Услуга");	
			
			Для каждого Строка Из ТаблицаЛьгот Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ЛицевойСчет", Строка.ЛицевойСчет);
				Отбор.Вставить("Услуга"     , Строка.Услуга);
				
				МассивСтрок = ТаблицаНачислений.НайтиСтроки(Отбор);
				
				Для каждого СтрокаУслуги Из МассивСтрок Цикл
					
					Льгота = ?(ЛьготаПерф, 0, Строка.Начислено);
					СтрокаУслуги.Льгота    = Строка.Начислено;
					СтрокаУслуги.КОплате   = СтрокаУслуги.СальдоНаНачало + СтрокаУслуги.Начислено - Льгота - СтрокаУслуги.Оплата + СтрокаУслуги.Разовые;
					СтрокаУслуги.КОплате   = ?(СтрокаУслуги.КОплате < 0,0,СтрокаУслуги.КОплате);
					СтрокаУслуги.КОплатеЗаМесяц     = СтрокаУслуги.Начислено - Льгота + СтрокаУслуги.Разовые;
					СтрокаУслуги.Переплата          = СтрокаУслуги.ПереплатаНаначало  + СтрокаУслуги.Начислено - СтрокаУслуги.Оплата - Льгота +  СтрокаУслуги.Разовые;
					
					Если ЭтоОплата Тогда
						
						Начислено              = СтрокаУслуги.Начислено - Льгота;
						СтрокаУслуги.Начислено = ?(Начислено > 0, Начислено, 0);
						
					КонецЕсли; 
					
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	МВТ.Закрыть();
	
КонецПроцедуры

Процедура ВыполнитьНачисленияПоДнямСобственности(Дата, Организация, СписокЛС, СписокЗданий, ЛьготаПерф = Ложь, ПолнаяТаблицаНачислений = Ложь, 
	ТаблицаНачислений = Неопределено, ТаблицаСчетчиков = Неопределено, ТаблицаРаспределений = Неопределено, ТаблицаЛьгот = Неопределено ,
	ТолькоГрупповые = Ложь, ЭтоОплата = Ложь, РасчетДолей = Ложь, УменьшитьНормуЛьготы = Ложь, УчетДнейПроживания = Ложь,
	ТаблицаПоДнямСобственности = Неопределено, ТаблицаОбщедомовыхРасходов = Неопределено, РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = Ложь,
	РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = Ложь,
	РасчетДляРазовых = Ложь,
	ЭтоЛС = Ложь) Экспорт
	// БИТ_ЖКХ 07.07.2015}}
	// БИТ_ЖКХ 24.05.2017 10:03:31 Необходимо заменить передачу параметров структурой.
	
	Перем ТаблицаУчетаДнейПроживания;
	
	Запрос = Новый Запрос;
	
	МВТ    = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Момент"      , Дата);
	Запрос.УстановитьПараметр("ИсхСписокЛС" , СписокЛС);
	Запрос.УстановитьПараметр("СписокЗданий", СписокЗданий);
	
	// БИТ_ЖКХ 03.02.2016 12:04:14 Начало правки... Нужно пернести весь кэш с точек вызова, сложно везде исправлять параметры.
	Если Дата >= Дата('20160101') Тогда
		ПараметрыЖКХ = Новый Структура;
		ПараметрыЖКХ.Вставить("Мосэнергосбыт2016", Ложь);
		ПараметрыЖКХ.Вставить("РасчетОбъемовДоТретьегоЗнака", Ложь);
		бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, ПараметрыЖКХ);
		РасчетОбъемовДоТретьегоЗнака = ПараметрыЖКХ.РасчетОбъемовДоТретьегоЗнака;
		Мосэнергосбыт2016 = ПараметрыЖКХ.Мосэнергосбыт2016;
	Иначе
		ПараметрыЖКХ = Новый Структура;
		ПараметрыЖКХ.Вставить("РасчетОбъемовДоТретьегоЗнака", Ложь);
		бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, ПараметрыЖКХ);
		РасчетОбъемовДоТретьегоЗнака = ПараметрыЖКХ.РасчетОбъемовДоТретьегоЗнака;
		Мосэнергосбыт2016 = Ложь;
	КонецЕсли; 
	// БИТ_ЖКХ 03.02.2016 12:04:14 Конец правки.
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик
	|ПОМЕСТИТЬ ГрупСчетчики
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Момент,
	|			Объект В (&СписокЗданий)
	|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)) КАК бит_СчетчикиНаУслугахСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать = ИСТИНА";
	
	Запрос.Выполнить();
	
	// БИТ_ЖКХ 24.05.2017 10:48:35 Начало правки...
	Если ЭтоЛС Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
		|ИЗ
		|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
		|			&Момент,
		|			ГрупповойСчетчик В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						Таб.Счетчик
		|					ИЗ
		|						ГрупСчетчики КАК Таб)
		|				И ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|ГДЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
		|	бит_РаспределенияНаУслугахСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
		|			&Момент,
		|			Объект В (&СписокЗданий)
		|				И ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_РаспределенияНаУслугахСрезПоследних
		|ГДЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.Использовать = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрупСчетчики.Счетчик
		|ИЗ
		|	ГрупСчетчики КАК ГрупСчетчики";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
		|ИЗ
		|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
		|			&Момент,
		|			ГрупповойСчетчик В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Таб.Счетчик
		|				ИЗ
		|					ГрупСчетчики КАК Таб)) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|ГДЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
		|	бит_РаспределенияНаУслугахСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Момент, Объект В (&СписокЗданий)) КАК бит_РаспределенияНаУслугахСрезПоследних
		|ГДЕ
		|	бит_РаспределенияНаУслугахСрезПоследних.Использовать = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрупСчетчики.Счетчик
		|ИЗ
		|	ГрупСчетчики КАК ГрупСчетчики";
 	КонецЕсли;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
	//|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
	//|ИЗ
	//|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
	//|			&Момент,
	//|			ГрупповойСчетчик В
	//|				(ВЫБРАТЬ
	//|					Таб.Счетчик
	//|				ИЗ
	//|					ГрупСчетчики КАК Таб)) КАК бит_ГрупповыеСчетчикиСрезПоследних
	//|ГДЕ
	//|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
	//|	бит_РаспределенияНаУслугахСрезПоследних.Объект
	//|ИЗ
	//|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Момент, Объект В (&СписокЗданий)) КАК бит_РаспределенияНаУслугахСрезПоследних
	//|ГДЕ
	//|	бит_РаспределенияНаУслугахСрезПоследних.Использовать = ИСТИНА
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ГрупСчетчики.Счетчик
	//|ИЗ
	//|	ГрупСчетчики КАК ГрупСчетчики";
	//// БИТ_ЖКХ изменение кода. Конец. 20.03.2012}}
	// БИТ_ЖКХ 24.05.2017 10:48:29 Конец правки. 
	
	ПолныйСписокЛС = Новый Массив;
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	Результат = РезультатПакета[0].Выгрузить();
	ПолныйСписокЛС     = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	// ПолныйСписокЗданий = Результат.ВыгрузитьКолонку("Здание");.
	
	Для каждого ЭлементСписка Из СписокЛС Цикл
		
		Если ПолныйСписокЛС.Найти(ЭлементСписка) = Неопределено Тогда
			
			ПолныйСписокЛС.Добавить(ЭлементСписка);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Результат = РезультатПакета[1].Выгрузить();
	СписокГрупСчетчиков = Результат.ВыгрузитьКолонку("Счетчик");
	
	Запрос.УстановитьПараметр("СписокЛС"           , ПолныйСписокЛС);
	Запрос.УстановитьПараметр("СписокГрупСчетчиков", СписокГрупСчетчиков);
	// Запрос.УстановитьПараметр("ПолныйСписокЗданий", ПолныйСписокЗданий);.
	// Запрос.УстановитьПараметр("СписокУслуг" , СписокУслуг);.
	
	// БИТ_ЖКХ_23082013_начало_изменений
	ЗапросДата = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения
	|ИЗ
	|	РегистрСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СрезПоследних(
	|			&Момент,
	|			Организация = &Организация
	|				И Начислять = ИСТИНА) КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних");
	
	ЗапросДата.УстановитьПараметр("Момент",      Дата);
	ЗапросДата.УстановитьПараметр("Организация", Организация);
	
	ДатаДо = Дата(1,1,1,1,1,2);
	
	Выборка = ЗапросДата.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДатаДо = Выборка.ПериодСравнения;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ДатаДо"             , ДатаДо);
	Запрос.УстановитьПараметр("Организация"        , Организация);
	// БИТ_ЖКХ_23082013_окончание_изменений
	
	// Составление таблицы со сведениями по лицевым счетам.

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГруппаУслуги КАК ГруппаУслуги,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК МойПоставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	|ПОМЕСТИТЬ бит_СведенияПоУслугамЛССрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет В (&СписокЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	// БИТ_ЖКХ 14.07.2017 11:45:36 Начало правки... 
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Номенклатура КАК Номенклатура,
	// БИТ_ЖКХ 14.07.2017 11:45:38 Конец правки. 
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГруппаУслуги КАК ГруппаУслуги,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК МойПоставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	|ПОМЕСТИТЬ ЛС
	|ИЗ
	|	бит_СведенияПоУслугамЛССрезПоследних КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	Квартира,
	|	СпособРасчета,
	|	Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры
	|ПОМЕСТИТЬ ВтСведенияОКвартире
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&Момент,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ЛС.Квартира
	|				ИЗ
	|					ЛС КАК ЛС)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Услуга,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ДоговорКонтрагента
	|ПОМЕСТИТЬ ВтПолучателиДенежныхСредств
	|ИЗ
	|	РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(
	|			&Момент,
	|			(Услуга, Поставщик) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ЛС.Услуга,
	|					ЛС.Поставщик
	|				ИЗ
	|					ЛС КАК ЛС)) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Услуга,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ЛС.Услуга КАК Услуга,
	|	ЛС.Квартира,
	|	ЛС.РежимПотребления КАК РежимПотребления,
	|	ЛС.Поставщик КАК Поставщик,
	|	ЛС.СпособРасчета КАК СпособРасчета,
	|	ЛС.ГруппаУслуги,
	|	ЛС.МойПоставщик,
	// БИТ_ЖКХ 14.07.2017 11:47:24 Начало правки... 
	|	ЛС.Номенклатура,
	// БИТ_ЖКХ 14.07.2017 11:47:25 Конец правки. 
	|	бит_УслугиЖКХСпособыРасчета.ЕдИзм,
	|	ЛС.КоличествоЕдиницПотребления,
	|	ВтСведенияОКвартире.ОбщаяПлощадь,
	|	ВтСведенияОКвартире.ЖилаяПлощадь,
	|	ВтСведенияОКвартире.МОП,
	|	ВтСведенияОКвартире.ОтапливаемаяПлощадь,
	|	ВтСведенияОКвартире.СовокупнаяПлощадь,
	|	ВтСведенияОКвартире.ТипКвартиры КАК ТипКвартиры,
	|	ВтСведенияОКвартире.СтатусКвартиры КАК СтатусКвартиры,
	|	ВтПолучателиДенежныхСредств.ПолучательДенежныхСредств,
	|	ВтПолучателиДенежныхСредств.ДоговорКонтрагента,
	|	бит_УслугиЖКХ.Приоритет КАК Приоритет,
	|	бит_УслугиЖКХ.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
	|	бит_УслугиЖКХ.ОсновнойРежимПотребления КАК ОсновнойРежимПотребления
	|ПОМЕСТИТЬ ТаблицаСведенийПоЛС
	|ИЗ
	|	ЛС КАК ЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСведенияОКвартире КАК ВтСведенияОКвартире
	|		ПО ЛС.Квартира = ВтСведенияОКвартире.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.СпособыРасчета КАК бит_УслугиЖКХСпособыРасчета
	|		ПО ЛС.Услуга = бит_УслугиЖКХСпособыРасчета.Ссылка
	|			И ЛС.СпособРасчета = бит_УслугиЖКХСпособыРасчета.СпособРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПолучателиДенежныхСредств КАК ВтПолучателиДенежныхСредств
	|		ПО ЛС.Услуга = ВтПолучателиДенежныхСредств.Услуга
	|			И ЛС.Поставщик = ВтПолучателиДенежныхСредств.Поставщик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ЛС.Услуга = бит_УслугиЖКХ.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Поставщик,
	|	РежимПотребления,
	|	СпособРасчета,
	|	СтатусКвартиры,
	|	ТипКвартиры";
	Запрос.Выполнить();
	
	// Составления таблицы с проживающими.

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы КАК ПравоНаЛьготы,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.Период
	|ПОМЕСТИТЬ ТаблицаФизЛиц
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	ФизЛицо";
	Запрос.Выполнить();
	
	// Составление таблицы с проживающими и их правами.

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ЛьготыПоЛССрезПоследних.ФизЛицо) КАК КоличествоЛьготников
	|ПОМЕСТИТЬ КолЛьготников
	|ИЗ
	|	РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&СписокЛС)) КАК бит_ЛьготыПоЛССрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроживающих,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличчествоПоНорме,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК мКоличествоПоНормеЛьгота,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК мКоличествоПроживающихЛьготы,
	|	ЕСТЬNULL(КолЛьготников.КоличествоЛьготников, 0) КАК КоличествоЛьготников,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме, ЛОЖЬ)
	|				ТОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоляПлощади,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме, ЛОЖЬ)
	|					И ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы, ЛОЖЬ)
	|				ТОГДА ЕСТЬNULL(бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоляПлощадиПоЛьготам,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|					И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроживающихПоНорме
	|ПОМЕСТИТЬ ТаблицаПроживающих
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&СписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ КолЛьготников КАК КолЛьготников
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = КолЛьготников.ЛицевойСчет
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	ЕСТЬNULL(КолЛьготников.КоличествоЛьготников, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет";
	Запрос.Выполнить();
	
	// Составление таблицы со списком льгот.

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Льготы.ФизЛицо,
	|	Льготы.Льгота,
	|	Льготы.СрокДействияЛьготы,
	|	ФизЛица.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	ФизЛица.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы КАК ПравоНаЛьготы,
	|	ФизЛица.ЛицевойСчет,
	|	ФизЛица.ДоляПлощади
	|ПОМЕСТИТЬ ТаблицаЛьгот
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|		ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|		ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|		ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|		ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|		ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|		ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади
	|	ИЗ
	|		РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ИсхСписокЛС)) КАК ПроживающиеПоЛССрезПоследних
	|	ГДЕ
	|		(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))) КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ЛьготыПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|			бит_ЛьготыПоЛССрезПоследних.Льготы КАК Льгота,
	|			бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы КАК СрокДействияЛьготы,
	|			бит_ЛьготыПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	|		ИЗ
	|			РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ИсхСписокЛС)) КАК бит_ЛьготыПоЛССрезПоследних
	|		ГДЕ
	|			(бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &Момент
	|					ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1))) КАК Льготы
	|		ПО ФизЛица.ФизЛицо = Льготы.ФизЛицо
	|			И ФизЛица.ЛицевойСчет = Льготы.ЛицевойСчет
	|ГДЕ
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы = ИСТИНА";
	Запрос.Выполнить();
	
	// Расчет норм.

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСведенийПоЛС.Услуга
	|ПОМЕСТИТЬ РазличныеУслугиЖКХ
	|ИЗ
	|	ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСведенийПоЛС.Услуга,
	|	ТаблицаСведенийПоЛС.Поставщик,
	|	ТаблицаСведенийПоЛС.РежимПотребления,
	|	ТаблицаСведенийПоЛС.СпособРасчета,
	|	ТаблицаСведенийПоЛС.СтатусКвартиры,
	|	ТаблицаСведенийПоЛС.ТипКвартиры
	|ПОМЕСТИТЬ РазличныеСведенийПоЛС
	|ИЗ
	|	ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга КАК Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем
	|ПОМЕСТИТЬ Объемы
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ),
	|			,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТАб.Услуга КАК УслугаЖКХ
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАб)
	|				И ЛицевойСчет В (&СписокЛС)) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ),
	|			Регистратор,
	|			УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАб.Услуга КАК УслугаЖКХ
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАб)
	|				И ЛицевойСчет В (&СписокЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ТипУслуги = ЗНАЧЕНИЕ(Перечисление.бит_ТипыУслуг.ВнешняяДобровольноеСтрахование)
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сальдо
	|ПОМЕСТИТЬ СальдоНаКонец
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			ЛицевойСчет В (&СписокЛС)
	|				И УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАБ.Услуга КАК УСЛУГА
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАБ)) КАК бит_НачисленияПоУслугамЖКХОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ТипУслуги = ЗНАЧЕНИЕ(Перечисление.бит_ТипыУслуг.ВнешняяДобровольноеСтрахование)
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сальдо
	|ПОМЕСТИТЬ ТекСальдо
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	|			КОНЕЦПЕРИОДА(&Момент, ДЕНЬ),
	|			ЛицевойСчет В (&СписокЛС)
	|				И УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАБ.Услуга КАК УСЛУГА
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАБ)) КАК бит_НачисленияПоУслугамЖКХОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток) КАК СальдоПени
	|ПОМЕСТИТЬ ТекСальдоПени
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(
	|			КОНЕЦПЕРИОДА(&Момент, ДЕНЬ),
	|			ЛицевойСчет В (&СписокЛС)
	|				И УслугаЖКХ В
	|					(ВЫБРАТЬ
	|						ТАБ.Услуга КАК Услуга
	|					ИЗ
	|						РазличныеУслугиЖКХ КАК ТАБ)) КАК бит_НачислениеПениПоУслугамЖКХОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследних.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследних.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка,
	// БИТ_ЖКХ_07072015_++	
	|	бит_СтавкиНаУслугиСрезПоследних.ЛьготнаяСтавка,
	// БИТ_ЖКХ_07072015_--	
	|	бит_СтавкиНаУслугиСрезПоследних.Тариф
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			(Услуга, Поставщик, РежимПотребления, СпособРасчета, СтатусКвартиры, ТипКвартиры) В
	|				(ВЫБРАТЬ
	|					РазличныеСведенийПоЛС.Услуга,
	|					РазличныеСведенийПоЛС.Поставщик,
	|					РазличныеСведенийПоЛС.РежимПотребления,
	|					РазличныеСведенийПоЛС.СпособРасчета,
	|					РазличныеСведенийПоЛС.СтатусКвартиры,
	|					РазличныеСведенийПоЛС.ТипКвартиры
	|				ИЗ
	|					РазличныеСведенийПоЛС)) КАК бит_СтавкиНаУслугиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследних.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследних.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ТипКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СверхНормативнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ПлановаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Тариф
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследнихДо
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&ДатаДо,
	|			(Услуга, Поставщик, РежимПотребления, СпособРасчета, СтатусКвартиры, ТипКвартиры) В
	|				(ВЫБРАТЬ
	|					РазличныеСведенийПоЛС.Услуга,
	|					РазличныеСведенийПоЛС.Поставщик,
	|					РазличныеСведенийПоЛС.РежимПотребления,
	|					РазличныеСведенийПоЛС.СпособРасчета,
	|					РазличныеСведенийПоЛС.СтатусКвартиры,
	|					РазличныеСведенийПоЛС.ТипКвартиры
	|				ИЗ
	|					РазличныеСведенийПоЛС)) КАК бит_СтавкиНаУслугиСрезПоследнихДо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихДо.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НормыНаУслугиСрезПоследних.Услуга,
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге,
	|	бит_НормыНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.ТипКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.НаОдного,
	|	бит_НормыНаУслугиСрезПоследних.НаДвоих,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью4,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью5,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью6,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника,
	|	бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу
	|ПОМЕСТИТЬ бит_НормыНаУслугиСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|			&Момент,
	|			(Услуга, РежимПотребления, СпособРасчетаПоУслуге, СтатусКвартиры, ТипКвартиры) В
	|				(ВЫБРАТЬ
	|					РазличныеСведенийПоЛС.Услуга,
	|					РазличныеСведенийПоЛС.РежимПотребления,
	|					РазличныеСведенийПоЛС.СпособРасчета,
	|					РазличныеСведенийПоЛС.СтатусКвартиры,
	|					РазличныеСведенийПоЛС.ТипКвартиры
	|				ИЗ
	|					РазличныеСведенийПоЛС)) КАК бит_НормыНаУслугиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_НормыНаУслугиСрезПоследних.Услуга,
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге,
	|	бит_НормыНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.ПлановаяСтавка
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследнихПлановая
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
	|				И ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
	|				И Поставщик ССЫЛКА Справочник.бит_ПоставщикиУслуг) КАК бит_СтавкиНаУслугиСрезПоследнихПлановая
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПлановая.СпособРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ТипКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ПлановаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ОсновнаяСтавка,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СверхНормативнаяСтавка
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиСрезПоследнихПоОС
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТаблицаСведенийПоЛС.Услуга
	|					ИЗ
	|						ТаблицаСведенийПоЛС)
	|				И Поставщик ССЫЛКА Справочник.бит_ПоставщикиУслуг) КАК бит_СтавкиНаУслугиСрезПоследнихПоОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследнихПоОС.ТипКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиГрупСИнд.Услуга,
	|	бит_СтавкиНаУслугиГрупСИнд.Поставщик,
	|	бит_СтавкиНаУслугиГрупСИнд.РежимПотребления,
	|	бит_СтавкиНаУслугиГрупСИнд.ОсновнаяСтавка
	|ПОМЕСТИТЬ бит_СтавкиНаУслугиГрупСИнд
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			&Момент,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТаблицаСведенийПоЛС.Услуга
	|					ИЗ
	|						ТаблицаСведенийПоЛС)
	|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|				И СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
	|				И ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
	|				И Поставщик ССЫЛКА Справочник.бит_ПоставщикиУслуг) КАК бит_СтавкиНаУслугиГрупСИнд
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СтавкиНаУслугиГрупСИнд.Услуга,
	|	бит_СтавкиНаУслугиГрупСИнд.Поставщик,
	|	бит_СтавкиНаУслугиГрупСИнд.РежимПотребления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Начислять,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения
	|ПОМЕСТИТЬ бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СрезПоследних(
	|			&Момент,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ТаблицаСведенийПоЛС.Услуга
	|					ИЗ
	|						ТаблицаСведенийПоЛС)
	|				И Организация = &Организация) КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСведенийПоЛС.ЛицевойСчет,
	|	ТаблицаСведенийПоЛС.Услуга,
	// БИТ_ЖКХ 14.07.2017 11:35:37 Начало правки...
	//19.12.2018 55
	|	ЕСТЬNULL(ВТ_Номенклатура.ВидСтавкиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)) КАК СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 11:35:37 Конец правки.
	|	ТаблицаСведенийПоЛС.Квартира,
	|	ТаблицаСведенийПоЛС.РежимПотребления,
	|	ТаблицаСведенийПоЛС.Поставщик,
	|	ТаблицаСведенийПоЛС.СпособРасчета,
	|	ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0) КАК ЖилаяПлощадь,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.МОП, 0) КАК МОП,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0) КАК ОтапливаемаяПлощадь,
	|	ЕСТЬNULL(ТаблицаСведенийПоЛС.СовокупнаяПлощадь, 0) КАК СовокупнаяПлощадь,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка, 0) КАК Ставка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка, 0) КАК СверхномСтавка,
	// БИТ_ЖКХ_07072015_++	
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ЛьготнаяСтавка, 0) КАК ЛьготнаяСтавка,
	// БИТ_ЖКХ_07072015_--	
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника, ЛОЖЬ) КАК ИспользоватьДопНормуНаЛьготника,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(Проживающие.КоличествоПроживающих, 0) КАК мКоличествоПроживающих,
	|	ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0) КАК мКоличествоПоНорме,
	|	ЕСТЬNULL(Проживающие.мКоличествоПроживающихЛьготы, 0) КАК мКоличествоПроживающихЛьготы,
	|	ТаблицаСведенийПоЛС.ПолучательДенежныхСредств,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПлановая.ПлановаяСтавка, 0) КАК ПлановаяСтавка,
	|	ЕСТЬNULL(Проживающие.мКоличествоПоНормеЛьгота, 0) КАК мКоличествоПоНормеЛьгота,
	|	ЕСТЬNULL(Обороты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(Обороты.Разовые, 0) КАК Разовые,
	|	ЕСТЬNULL(СальдоНаКонец.Сальдо, 0) КАК СальдоНаНачало,
	|	ЕСТЬNULL(ТекСальдо.Сальдо, 0) КАК Сальдо,
	|	ЕСТЬNULL(ТекСальдоПени.СальдоПени, 0) КАК СальдоПени,
	|	ТаблицаСведенийПоЛС.Приоритет,
	|	ТаблицаСведенийПоЛС.ОсновнойСпособРасчета,
	|	ТаблицаСведенийПоЛС.ДоговорКонтрагента,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПоОС.ПлановаяСтавка, 0) КАК ОсновнаяПлановаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПоОС.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихПоОС.СверхНормативнаяСтавка, 0) КАК ОсновнаяСверхНормСтавка,
	|	ЕСТЬNULL(Проживающие.ДоляПлощади, 0) КАК ДоляПлощади,
	|	ТаблицаСведенийПоЛС.ОсновнойРежимПотребления,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиГрупСИнд.ОсновнаяСтавка, 0) КАК СтавкаГрупСИнд,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.Тариф, 0) КАК Тариф,
	|	ВЫБОР
	|		КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|			ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|					ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	// БИТ_ЖКХ 16.05.2017 11:12:25 Начало правки... 
	|									ИЛИ ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом)
	// БИТ_ЖКХ 16.05.2017 11:12:27 Конец правки. 
	|									ТОГДА ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|											ТОГДА ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|													ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0)
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ФактОтОсновного,
	|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу, 0) КАК НормативПотребленияПоКу,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.ОсновнаяСтавка, 0) КАК СтавкаДо,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.СверхНормативнаяСтавка, 0) КАК СверхномСтавкаДо,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.ПлановаяСтавка, 0) КАК ПлановаяСтавкаДо,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследнихДо.Тариф, 0) КАК ТарифДо,
	|	ЕСТЬNULL(бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы, 0) КАК ПредельныйИндекс,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Начислять КАК НачислятьПредельныйИндекс,
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения КАК ПериодСравнения,
	|	ТаблицаСведенийПоЛС.ГруппаУслуги КАК ГруппаУслуги,
	|	ТаблицаСведенийПоЛС.МойПоставщик КАК МойПоставщик,
	|	ТаблицаСведенийПоЛС.ЕдИзм КАК ЕдИзм,
	|	ЕСТЬNULL(Проживающие.КоличествоПроживающихПоНорме, 0) КАК КоличествоПроживающихПоНорме
	|ИЗ
	|	ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследних КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследнихДо КАК бит_СтавкиНаУслугиСрезПоследнихДо
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследнихДо.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследнихДо.Поставщик
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследнихДо.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследнихДо.СпособРасчета
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследнихДо.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследнихДо.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_НормыНаУслугиСрезПоследних КАК бит_НормыНаУслугиСрезПоследних
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроживающих КАК Проживающие
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = Обороты.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = Обороты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СальдоНаКонец КАК СальдоНаКонец
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = СальдоНаКонец.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = СальдоНаКонец.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекСальдо КАК ТекСальдо
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = ТекСальдо.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = ТекСальдо.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекСальдоПени КАК ТекСальдоПени
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = ТекСальдоПени.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = ТекСальдоПени.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследнихПоОС КАК бит_СтавкиНаУслугиСрезПоследнихПоОС
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследнихПоОС.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследнихПоОС.Поставщик
	|			И ТаблицаСведенийПоЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследнихПоОС.РежимПотребления
	|			И ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = бит_СтавкиНаУслугиСрезПоследнихПоОС.СпособРасчета
	|			И ТаблицаСведенийПоЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследнихПоОС.СтатусКвартиры
	|			И ТаблицаСведенийПоЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследнихПоОС.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиСрезПоследнихПлановая КАК бит_СтавкиНаУслугиСрезПоследнихПлановая
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиСрезПоследнихПлановая.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиСрезПоследнихПлановая.Поставщик
	|			И ТаблицаСведенийПоЛС.ОсновнойРежимПотребления = бит_СтавкиНаУслугиСрезПоследнихПлановая.РежимПотребления
	|			И ТаблицаСведенийПоЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследнихПлановая.СпособРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СтавкиНаУслугиГрупСИнд КАК бит_СтавкиНаУслугиГрупСИнд
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СтавкиНаУслугиГрупСИнд.Услуга
	|			И ТаблицаСведенийПоЛС.Поставщик = бит_СтавкиНаУслугиГрупСИнд.Поставщик
	|			И ТаблицаСведенийПоЛС.ОсновнойРежимПотребления = бит_СтавкиНаУслугиГрупСИнд.РежимПотребления
	|		ЛЕВОЕ СОЕДИНЕНИЕ бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних
	|		ПО ТаблицаСведенийПоЛС.Услуга = бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	|		ПО ТаблицаСведенийПоЛС.ЛицевойСчет = Объемы.ЛицевойСчет
	|			И ТаблицаСведенийПоЛС.Услуга = Объемы.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ВТ_Номенклатура
	|		ПО ТаблицаСведенийПоЛС.Номенклатура  = ВТ_Номенклатура.Ссылка";

	ТаблицаНорм = СформироватьТаблицуНорм();
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Норма       = ПолучитьНорму(Выборка);
		НормаЛьготы = ПолучитьНормуЛьготы(Выборка);
		СверхНорма  = 0;
		
		НоваяСтрока = ТаблицаНорм.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);           
		
		ДоляПлощади = ?(РасчетДолей,Выборка.ОбщаяПлощадь * Выборка.ДоляПлощади,0);
		
		СпособРасчета = Выборка.СпособРасчета;
		
		Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
			
			Если ДоляПлощади <> 0 Тогда
				
				Норма = ?(Норма > ДоляПлощади, ДоляПлощади, Норма);
				
			КонецЕсли; 
			
			НоваяСтрока.Норматив =  НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.ОбщаяПлощадь тогда
				Норма      = Выборка.ОбщаяПлощадь;
			иначе
				СверхНорма = Выборка.ОбщаяПлощадь - Норма; 
			КонецЕсли;
			
			НоваяСтрока.Факт        = Выборка.ОбщаяПлощадь;
			НоваяСтрока.НормаЛьготы = НормаЛьготы;
			НоваяСтрока.Норма       = Норма;
			НоваяСтрока.СверхНорма  = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
			
			Если ДоляПлощади <> 0 Тогда
				
				Норма = ?(Норма > ДоляПлощади, ДоляПлощади, Норма);
				
			КонецЕсли; 
			
			НоваяСтрока.Норматив = НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.ЖилаяПлощадь тогда
				Норма      = Выборка.ЖилаяПлощадь;
			иначе
				СверхНорма = Выборка.ЖилаяПлощадь - Норма; 
			КонецЕсли;	
			
			НоваяСтрока.Факт         = Выборка.ЖилаяПлощадь;
			НоваяСтрока.НормаЛьготы  = НормаЛьготы;
			НоваяСтрока.Норма        = Норма;
			НоваяСтрока.СверхНорма   = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади Тогда
			
			Если ДоляПлощади <> 0 Тогда
				
				Норма = ?(Норма > ДоляПлощади, ДоляПлощади, Норма);
				
			КонецЕсли; 
			
			НоваяСтрока.Норматив =  НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.ОтапливаемаяПлощадь тогда
				Норма      = Выборка.ОтапливаемаяПлощадь;
			иначе
				СверхНорма = Выборка.ОтапливаемаяПлощадь - Норма; 
			КонецЕсли;	
			
			НоваяСтрока.Факт          = Выборка.ОтапливаемаяПлощадь;
			НоваяСтрока.НормаЛьготы   = НормаЛьготы;
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда
			
			// БИТ_ЖКХ изменение кода. Начало. 25.01.2013{{
			// Норма      =  Выборка.мКоличествоПроживающих;.
			Норма      = Выборка.КоличествоПроживающихПоНорме;
			СверхНорма = Выборка.мКоличествоПроживающих - Норма;
			// БИТ_ЖКХ изменение кода. Конец. 25.01.2013}}
			НоваяСтрока.Норматив = Выборка.мКоличествоПроживающихЛьготы * Выборка.Ставка;
			
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
			НоваяСтрока.Факт           = Выборка.мКоличествоПроживающих;
			НоваяСтрока.НормаЛьготы    = Выборка.мКоличествоПроживающихЛьготы;
			
		// БИТ_ЖКХ 16.05.2017 11:06:02 Начало правки...
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом Тогда
			
			НоваяСтрока.Норматив		= Выборка.мКоличествоПроживающихЛьготы * Выборка.Ставка;
			НоваяСтрока.Норма			= Выборка.КоличествоПроживающихПоНорме;
			НоваяСтрока.РасчетнаяНорма	= Норма;
			НоваяСтрока.СверхНорма		= 0;
			НоваяСтрока.Факт			= Выборка.мКоличествоПроживающих;
			НоваяСтрока.НормаЛьготы		= Выборка.мКоличествоПроживающихЛьготы;
		// БИТ_ЖКХ 16.05.2017 11:06:02 Конец правки.	
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления Тогда
			
			НоваяСтрока.Норматив =  НормаЛьготы * Выборка.Ставка;
			
			Если Норма > Выборка.КоличествоЕдиницПотребления тогда
				Норма      = Выборка.КоличествоЕдиницПотребления;
				СверхНорма = 0; 
			иначе
				СверхНорма = Выборка.КоличествоЕдиницПотребления - Норма; 
			КонецЕсли;
			
			НоваяСтрока.Факт          = Выборка.КоличествоЕдиницПотребления;
			НоваяСтрока.НормаЛьготы   = НормаЛьготы;
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
			
			Норма = Выборка.НаЛицевойСчет;
			
			НоваяСтрока.Норматив =  Норма * Выборка.Ставка;
			
			Если Норма > Выборка.КоличествоЕдиницПотребления тогда
				Норма      = Выборка.КоличествоЕдиницПотребления;
				СверхНорма = 0; 
			иначе
				СверхНорма = Выборка.КоличествоЕдиницПотребления - Норма; 
			КонецЕсли;	
			
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			
			НоваяСтрока.Факт           = Выборка.КоличествоЕдиницПотребления;
			НоваяСтрока.НормаЛьготы    = Норма;
			
		ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению Тогда
			
			Если Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
				
				НоваяСтрока.Норматив    = Выборка.НаЛицевойСчет * Выборка.Ставка;
				НоваяСтрока.Норма       = Выборка.НаЛицевойСчет;
				НоваяСтрока.НормаЛьготы = Выборка.НаЛицевойСчет;
				
			Иначе
				
				НоваяСтрока.Норматив    = НормаЛьготы * Выборка.Ставка;
				НоваяСтрока.Норма       = Норма;
				НоваяСтрока.НормаЛьготы = НормаЛьготы;
				
			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЦикла; 
	
	ТаблицаНорм.Сортировать("Приоритет возр");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНорм.ЛицевойСчет,
	|	ТаблицаНорм.Услуга,
	// БИТ_ЖКХ 14.07.2017 11:56:58 Начало правки...
	|	ТаблицаНорм.СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 11:56:58 Конец правки.
	|	ТаблицаНорм.Приоритет,
	|	ТаблицаНорм.РежимПотребления,
	|	ТаблицаНорм.ОсновнойРежимПотребления,
	|	ТаблицаНорм.СпособРасчета,
	|	ТаблицаНорм.Ставка,
	|	ТаблицаНорм.ОсновнаяСтавка,
	|	ТаблицаНорм.СверхномСтавка,
	|	ТаблицаНорм.ПлановаяСтавка,
	|	ТаблицаНорм.Норма,
	// БИТ_ЖКХ 16.05.2017 14:07:28 Начало правки... 
	|	ТаблицаНорм.РасчетнаяНорма,
	// БИТ_ЖКХ 16.05.2017 14:07:29 Конец правки. 
	|	ТаблицаНорм.СверхНорма,
	|	ТаблицаНорм.Норматив,
	|	ТаблицаНорм.НормаЛьготы,
	|	ТаблицаНорм.Поставщик,
	|	ТаблицаНорм.Факт,
	|	ТаблицаНорм.ПолучательДенежныхСредств,
	|	ТаблицаНорм.Сальдо,
	|	ТаблицаНорм.СальдоНаНачало,
	|	ТаблицаНорм.СальдоПени,
	|	ТаблицаНорм.Оплата,
	|	ТаблицаНорм.Разовые,
	|	ТаблицаНорм.НаОдного,
	|	ТаблицаНорм.НаДвоих,
	|	ТаблицаНорм.НаСемью,
	|	ТаблицаНорм.НаСемью4,
	|	ТаблицаНорм.НаСемью5,
	|	ТаблицаНорм.НаСемью6,
	|	ТаблицаНорм.НаЛицевойСчет,
	|	ТаблицаНорм.ДопНормаНаСемью,
	|	ТаблицаНорм.ДопНормаНаКаждого,
	|	ТаблицаНорм.ИспользоватьДопНормуНаОдного,
	|	ТаблицаНорм.ИспользоватьДопНормуНаЛьготника,
	|	ТаблицаНорм.СтавкаГрупСИнд,
	|	ТаблицаНорм.Тариф,
	|	ТаблицаНорм.Объем,
	|	ТаблицаНорм.ФактОтОсновного,
	|	ТаблицаНорм.ОсновнойСпособРасчета,
	// БИТ_ЖКХ_23082013_начало_изменений
	|	ТаблицаНорм.СтавкаДо,
	|	ТаблицаНорм.СверхномСтавкаДо,
	|	ТаблицаНорм.ПлановаяСтавкаДо,
	|	ТаблицаНорм.ТарифДо,
	|	ТаблицаНорм.ПредельныйИндекс,
	|	ТаблицаНорм.НачислятьПредельныйИндекс,
	|	ТаблицаНорм.ПериодСравнения,
	|	ТаблицаНорм.ГруппаУслуги,
	|	ТаблицаНорм.МойПоставщик,
	|	ТаблицаНорм.ЕдИзм,
	// БИТ_ЖКХ_23082013_окончание_изменений
	// БИТ_ЖКХ_07072015_++
	|	ТаблицаНорм.ЛьготнаяСтавка,	
	// БИТ_ЖКХ_07072015_--
	|	ТаблицаНорм.НормативПотребленияПоКу
	|ПОМЕСТИТЬ ТаблицаНорм
	|ИЗ
	|	&ТаблицаНорм КАК ТаблицаНорм";
	
	Запрос.УстановитьПараметр("ТаблицаНорм", ТаблицаНорм);
	Запрос.Выполнить();
	
	// Выполнение расчетов по начислениям.

	Если ТаблицаНачислений <> Неопределено  Тогда
		
		Если УчетДнейПроживания И ТаблицаПоДнямСобственности <> Неопределено Тогда
			
			РасчитатьНачисленияСУчетомДнейСобственности(Запрос, Дата, ТаблицаПоДнямСобственности);
			
		КонецЕсли; 
		
		// БИТ_ЖКХ 17.04.2020                                               		
		ТаблицаПоДнямСобственности = РассчетПоДнямВладения(ТаблицаПоДнямСобственности, ТаблицаНачислений, День(КонецМесяца(Дата)));		
		ТаблицаДляЗакладкиЛицевойСчет = ТаблицаПоДнямСобственности.Скопировать(); 
		ТаблицаДляЗакладкиЛицевойСчет.Свернуть("ЛицевойСчет, Услуга", "Начислено");
		
		для каждого стрЛС из ТаблицаДляЗакладкиЛицевойСчет цикл
		  Отбор = Новый Структура;
          Отбор.Вставить("ЛицевойСчет", стрЛС.ЛицевойСчет);
          Отбор.Вставить("Услуга", стрЛС.Услуга);
   
          строкиЛС = ТаблицаНачислений.НайтиСтроки(Отбор);  
   
          если строкиЛС.Количество() > 0 тогда
           строкиЛС[0].Начислено = стрЛС.Начислено;
	      конецесли;				
			
		конеццикла;	
		//// БИТ_ЖКХ 07.07.2015{{
		////РасчитатьНачисленияПоЛС(ТаблицаНачислений, Запрос, ТаблицаПроживающих);
		//РасчитатьНачисленияПоЛС(ТаблицаНачислений, Запрос, ТаблицаПоДнямСобственности,РасчетДляРазовых);
		//// БИТ_ЖКХ 07.07.2015}}
		//
	КонецЕсли;
	
	//Если ТаблицаСчетчиков <> Неопределено И НЕ ТолькоГрупповые Тогда
	//	
	//	РасчитатьНачисленияПоИндСчетчикам(ТаблицаСчетчиков, Запрос, РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика, РасчетОбъемовДоТретьегоЗнака);
	//	
	//КонецЕсли;
	//
	//Если ТаблицаСчетчиков <> Неопределено  Тогда
	//	
	//	РасчитатьНачисленияПоГрупСчетчикам(СписокЛС, ТаблицаСчетчиков, Запрос, ЭтоЛС, РасчетОбъемовДоТретьегоЗнака);
	//	
	//КонецЕсли;
	//
	//Если ТаблицаРаспределений <> Неопределено Тогда
	//	
	//	РасчитатьНачисленияПоРаспределений(СписокЛС, ТаблицаРаспределений, Запрос, , РасчетОбъемовДоТретьегоЗнака);
	//	
	//КонецЕсли;
	//
	//Если ТаблицаЛьгот <> Неопределено Тогда
	//	
	//	// БИТ_ЖКХ 02.03.2016 11:07:37 Начало правки... 
	//	//РасчитатьНачисленияЛьгот(Дата, Организация, СписокЛС, ТаблицаЛьгот, ТаблицаНачислений, ТаблицаСчетчиков, ТаблицаРаспределений, Запрос, УменьшитьНормуЛьготы,,РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
	//	РасчитатьНачисленияЛьгот(Дата, Организация, СписокЛС, ТаблицаЛьгот, ТаблицаНачислений, ТаблицаСчетчиков, ТаблицаРаспределений, Запрос, УменьшитьНормуЛьготы,,РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика, Мосэнергосбыт2016);
	//	// БИТ_ЖКХ 02.03.2016 11:07:39 Конец правки. 
	//	
	//КонецЕсли; 
	//
	//// В случае заполнения оплаты ку или лицевойго счета "таблица начислений" должна содержать все виды начислений. 

	//Если ПолнаяТаблицаНачислений Тогда
	//	
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТаблицаСчетчиков.ЛицевойСчет,
	//	|	ТаблицаСчетчиков.Услуга,
	//	// БИТ_ЖКХ 14.07.2017 12:17:15 Начало правки...
	//	|	ТаблицаСчетчиков.СтавкаНДС,
	//	// БИТ_ЖКХ 14.07.2017 12:17:15 Конец правки.
	//	|	ТаблицаСчетчиков.Ставка,
	//	|	ТаблицаСчетчиков.СверхномСтавка,
	//	|	ТаблицаСчетчиков.Поставщик,
	//	|	ТаблицаСчетчиков.ПолучательДенежныхСредств,
	//	|	ТаблицаСчетчиков.Сальдо,
	//	|	ТаблицаСчетчиков.СальдоНаНачало,
	//	|	ТаблицаСчетчиков.СальдоПени,
	//	|	ТаблицаСчетчиков.Оплата,
	//	|	ТаблицаСчетчиков.Разовые,
	//	|	ТаблицаСчетчиков.Приоритет,
	//	|	ТаблицаСчетчиков.Начислено,
	//	|	ТаблицаСчетчиков.Норма,
	//	|	ТаблицаСчетчиков.СверхНорма,
	//	|	ТаблицаСчетчиков.КоличествоЕдиниц,
	//	|	ТаблицаСчетчиков.КоличествоЕдиницПоЛС
	//	|ПОМЕСТИТЬ ТаблицаСчетчиковКопия
	//	|ИЗ
	//	|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ТаблицаСчетчиковКопия.ЛицевойСчет,
	//	|	ТаблицаСчетчиковКопия.Услуга,
	//	// БИТ_ЖКХ 14.07.2017 12:19:10 Начало правки... 
	//	|	ТаблицаСчетчиковКопия.СтавкаНДС,
	//	// БИТ_ЖКХ 14.07.2017 12:19:11 Конец правки. 
	//	|	МАКСИМУМ(ТаблицаСчетчиковКопия.Ставка) КАК Ставка,
	//	|	МАКСИМУМ(ТаблицаСчетчиковКопия.СверхномСтавка) КАК СверхномСтавка,
	//	|	ТаблицаСчетчиковКопия.Поставщик,
	//	|	ТаблицаСчетчиковКопия.ПолучательДенежныхСредств,
	//	|	МАКСИМУМ(ТаблицаСчетчиковКопия.Сальдо) КАК Сальдо,
	//	|	МАКСИМУМ(ТаблицаСчетчиковКопия.СальдоНаНачало) КАК СальдоНаНачало,
	//	|	МАКСИМУМ(ТаблицаСчетчиковКопия.СальдоПени) КАК СальдоПени,
	//	|	МАКСИМУМ(ТаблицаСчетчиковКопия.Оплата) КАК Оплата,
	//	|	МАКСИМУМ(ТаблицаСчетчиковКопия.Разовые) КАК Разовые,
	//	|	ТаблицаСчетчиковКопия.Приоритет,
	//	|	СУММА(ТаблицаСчетчиковКопия.Начислено) КАК Начислено,
	//	// БИТ_ЖКХ_23082013_начало_изменений
	//	// |	МАКСИМУМ(ТаблицаСчетчиковКопия.Норма) КАК Норма,.
	//	|	СУММА(ТаблицаСчетчиковКопия.Норма) КАК Норма,
	//	// БИТ_ЖКХ_23082013_окончание_изменений
	//	|	СУММА(ТаблицаСчетчиковКопия.КоличествоЕдиниц) КАК КоличествоЕдиниц,
	//	|	СУММА(ТаблицаСчетчиковКопия.КоличествоЕдиницПоЛС) КАК Факт,
	//	// БИТ_ЖКХ_23082013_начало_изменений
	//	// |	МАКСИМУМ(ТаблицаСчетчиковКопия.СверхНорма) КАК СверхНорма.
	//	|	СУММА(ТаблицаСчетчиковКопия.СверхНорма) КАК СверхНорма
	//	// БИТ_ЖКХ_23082013_окончание_изменений
	//	|ИЗ
	//	|	ТаблицаСчетчиковКопия КАК ТаблицаСчетчиковКопия
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ТаблицаСчетчиковКопия.ЛицевойСчет,
	//	|	ТаблицаСчетчиковКопия.Услуга,
	//	|	ТаблицаСчетчиковКопия.СтавкаНДС,
	//	|	ТаблицаСчетчиковКопия.Поставщик,
	//	|	ТаблицаСчетчиковКопия.ПолучательДенежныхСредств,
	//	|	ТаблицаСчетчиковКопия.Приоритет";
	//	
	//	Запрос.УстановитьПараметр("ТаблицаСчетчиков", ТаблицаСчетчиков);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
	//		Отбор.Вставить("Услуга"     , Выборка.Услуга);
	//		
	//		МассивСтрок   = ТаблицаНачислений.НайтиСтроки(Отбор);
	//		
	//		Если МассивСтрок.Количество() = 0  Тогда
	//			
	//			НоваяСтрока = ТаблицаНачислений.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//			
	//			НоваяСтрока.КОплате        = НоваяСтрока.СальдоНаНачало + НоваяСтрока.Начислено - НоваяСтрока.Льгота 
	//			- НоваяСтрока.Оплата + НоваяСтрока.Разовые;
	//			НоваяСтрока.КОплате        = ?(НоваяСтрока.КОплате < 0,0,НоваяСтрока.КОплате);
	//			НоваяСтрока.КОплатеЗаМесяц = НоваяСтрока.Начислено + НоваяСтрока.Разовые;
	//			НоваяСтрока.Переплата      = НоваяСтрока.ПереплатаНаначало  + НоваяСтрока.Начислено - НоваяСтрока.Оплата + НоваяСтрока.Разовые;
	//			НоваяСтрока.СпособРасчета  = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам; 
	//			
	//		КонецЕсли; 
	//		
	//	КонецЦикла;
	//	
	//	Для каждого Строка Из ТаблицаРаспределений Цикл
	//		
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("ЛицевойСчет", Строка.ЛицевойСчет);
	//		Отбор.Вставить("Услуга"     , Строка.Услуга);
	//		
	//		МассивСтрок = ТаблицаНачислений.НайтиСтроки(Отбор);
	//		
	//		Если МассивСтрок.Количество() = 0  Тогда
	//			
	//			НоваяСтрока = ТаблицаНачислений.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	//			
	//			НоваяСтрока.КОплате   = НоваяСтрока.СальдоНаНачало + НоваяСтрока.Начислено - НоваяСтрока.Льгота 
	//			- НоваяСтрока.Оплата + НоваяСтрока.Разовые;
	//			НоваяСтрока.КОплате   = ?(НоваяСтрока.КОплате < 0,0,НоваяСтрока.КОплате);
	//			НоваяСтрока.КОплатеЗаМесяц = НоваяСтрока.Начислено + НоваяСтрока.Разовые;
	//			НоваяСтрока.Переплата      = НоваяСтрока.ПереплатаНаначало  + НоваяСтрока.Начислено - НоваяСтрока.Оплата + НоваяСтрока.Разовые;
	//			
	//		КонецЕсли; 
	//		
	//	КонецЦикла;
	//	
	//	Если НЕ ТаблицаЛьгот = Неопределено Тогда
	//		
	//		ТаблицаЛьгот.Свернуть("ЛицевойСчет, Услуга, Начислено");
	//		ТаблицаНачислений.Индексы.Добавить("ЛицевойСчет,Услуга");	
	//		
	//		Для каждого Строка Из ТаблицаЛьгот Цикл
	//			
	//			Отбор = Новый Структура;
	//			Отбор.Вставить("ЛицевойСчет", Строка.ЛицевойСчет);
	//			Отбор.Вставить("Услуга"     , Строка.Услуга);
	//			
	//			МассивСтрок = ТаблицаНачислений.НайтиСтроки(Отбор);
	//			
	//			Для каждого СтрокаУслуги Из МассивСтрок Цикл
	//				
	//				Льгота = ?(ЛьготаПерф, 0, Строка.Начислено);
	//				СтрокаУслуги.Льгота    = Строка.Начислено;
	//				СтрокаУслуги.КОплате   = СтрокаУслуги.СальдоНаНачало + СтрокаУслуги.Начислено - Льгота - СтрокаУслуги.Оплата + СтрокаУслуги.Разовые;
	//				СтрокаУслуги.КОплате   = ?(СтрокаУслуги.КОплате < 0,0,СтрокаУслуги.КОплате);
	//				СтрокаУслуги.КОплатеЗаМесяц     = СтрокаУслуги.Начислено - Льгота + СтрокаУслуги.Разовые;
	//				СтрокаУслуги.Переплата          = СтрокаУслуги.ПереплатаНаначало  + СтрокаУслуги.Начислено - СтрокаУслуги.Оплата - Льгота +  СтрокаУслуги.Разовые;
	//				
	//				Если ЭтоОплата Тогда
	//					
	//					Начислено              = СтрокаУслуги.Начислено - Льгота;
	//					СтрокаУслуги.Начислено = ?(Начислено > 0, Начислено, 0);
	//					
	//				КонецЕсли; 
	//				
	//			КонецЦикла; 
	//			
	//		КонецЦикла; 
	//		
	//	КонецЕсли;
		
	//КонецЕсли; 
	
	МВТ.Закрыть();
	
КонецПроцедуры

// БИТ_ЖКХ 16.04.2020 
функция РассчетПоДнямВладения(ТаблицаПоДнямСобственности, ТаблицаНачислений, ДнейВМесяце)
	
 таблицаЛСиУслуг = ТаблицаПоДнямСобственности.Скопировать();
 таблицаЛСиУслуг.Свернуть("ЛицевойСчет, Услуга");
 таблицаЛСиУслуг.Сортировать("ЛицевойСчет, Услуга");
 таблицаЛСиУслуг.Колонки.Добавить("НачисленоИзНачислений", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 4)));
 //таблицаЛСиУслуг.Колонки.Добавить("КолвоДнейВладения", Новый ОписаниеТипов("Число"));
 таблицаЛСиУслуг.Колонки.Добавить("НачисленияПоДнямВладения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 4)));
  
 для каждого стр из таблицаЛСиУслуг цикл
	 
   Отбор = Новый Структура;
   Отбор.Вставить("ЛицевойСчет", стр.ЛицевойСчет);
   Отбор.Вставить("Услуга", стр.Услуга);
   
   строкиЛС = ТаблицаНачислений.НайтиСтроки(Отбор);  
   
   если строкиЛС.Количество() > 0 тогда
    стр.НачисленоИзНачислений = строкиЛС[0].Начислено;
	НачисленоЗаДень = Окр(стр.НачисленоИзНачислений/ДнейВМесяце, 4);
	стр.НачисленияПоДнямВладения = НачисленоЗаДень;//(стр.НачисленоИзНачислений/ДнейВМесяце);

	//Окр(стр.НачисленоИзНачислений/ДнейВМесяце, 4);
   конецесли;	
   //Отбор = Новый Структура;
   //Отбор.Вставить("ЛицевойСчет", стр.ЛицевойСчет);
   //Отбор.Вставить("Услуга", стр.Услуга);
   //
   //строкиДней = ТаблицаПоДнямСобственности.НайтиСтроки(Отбор);  
   //
   //для каждого стрДней из строкиДней цикл
   // стр.КолвоДнейВладения = стр.КолвоДнейВладения + стрДней.КоличествоДней;
   //конеццикла;

   
 конеццикла;	 
 
 для каждого стр из ТаблицаПоДнямСобственности цикл

   Отбор = Новый Структура;
   Отбор.Вставить("ЛицевойСчет", стр.ЛицевойСчет);
   Отбор.Вставить("Услуга", стр.Услуга);
   
   строкиДней = таблицаЛСиУслуг.НайтиСтроки(Отбор);  
   
   если строкиДней.Количество() > 0 тогда
	  НачисленоПоУслугеЗаДень = Окр(стр.КоличествоДней*строкиДней[0].НачисленияПоДнямВладения, 2);
	  стр.Начислено = НачисленоПоУслугеЗаДень;//стр.КоличествоДней*строкиДней[0].НачисленияПоДнямВладения;
   конецесли;	   
   
 конеццикла;
 
 // БИТ ЖКХ 22.04.2020
 ТаблицаПоДнямСобственности.Сортировать("ЛицевойСчет, Услуга, ФизЛицо");
 возврат ТаблицаПоДнямСобственности; 
конецфункции	

// БИТ_ЖКХ 07.07.2015{{ // Добавлен четвертый параметр РасчетДляРазовых.
// Процедура выполняет расчет начислений по лс.
//
Процедура РасчитатьНачисленияПоЛС(ТаблицаНачислений, Запрос, ТаблицаПроживающих = Неопределено,РасчетДляРазовых = Ложь)
	
	Если РасчетДляРазовых = Ложь Тогда
		
		Текст = " И ТаблицаНорм.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам) И ТаблицаНорм.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению)";
	Иначе
		Текст = "";
		
	КонецЕсли;
	// БИТ_ЖКХ 07.07.2015}}
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНорм.ЛицевойСчет,
	|	ТаблицаНорм.Услуга,
	// БИТ_ЖКХ 14.07.2017 11:34:11 Начало правки...
	|	ТаблицаНорм.СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 11:34:11 Конец правки.
	|	ТаблицаНорм.Приоритет,
	|	ТаблицаНорм.СпособРасчета,
	|	ТаблицаНорм.Ставка,
	|	ТаблицаНорм.СверхномСтавка,
	|	ТаблицаНорм.ПлановаяСтавка,
	|	ТаблицаНорм.Норма,
	// БИТ_ЖКХ 16.05.2017 14:07:13 Начало правки... 
	|	ТаблицаНорм.РасчетнаяНорма,
	// БИТ_ЖКХ 16.05.2017 14:07:16 Конец правки. 
	|	ТаблицаНорм.СверхНорма,
	|	ТаблицаНорм.Норматив,
	|	ТаблицаНорм.НормаЛьготы,
	|	ТаблицаНорм.Поставщик,
	|	ТаблицаНорм.Факт,
	|	ТаблицаНорм.ПолучательДенежныхСредств,
	|	ТаблицаНорм.Сальдо,
	|	ТаблицаНорм.СальдоНаНачало,
	|	ТаблицаНорм.СальдоПени,
	|	ТаблицаНорм.Оплата,
	|	ТаблицаНорм.Разовые,
	// БИТ_ЖКХ_23082013_начало_изменений
	|	ТаблицаНорм.СтавкаДо,
	|	ТаблицаНорм.СверхномСтавкаДо,
	|	ТаблицаНорм.ПлановаяСтавкаДо,
	|	ТаблицаНорм.ТарифДо,
	|	ТаблицаНорм.ПредельныйИндекс,
	|	ТаблицаНорм.НачислятьПредельныйИндекс,
	|	ТаблицаНорм.ПериодСравнения,
	|	ТаблицаНорм.ГруппаУслуги,
	|	ТаблицаНорм.МойПоставщик,
	|	ТаблицаНорм.ЕдИзм,
	// БИТ_ЖКХ_23082013_окончание_изменений
	|	ТаблицаНорм.Тариф
	|ИЗ
	|	ТаблицаНорм КАК ТаблицаНорм
	|ГДЕ
	
	// БИТ_ЖКХ 07.07.2015{{
	//|	ТаблицаНорм.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам) 
	//|	И ТаблицаНорм.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению)
	//|	И ТаблицаНорм.ЛицевойСчет В (&ИсхСписокЛС)";
	
	|	ТаблицаНорм.ЛицевойСчет В (&ИсхСписокЛС)" +Текст;
	// БИТ_ЖКХ 07.07.2015}}
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если ТаблицаПроживающих <> Неопределено Тогда
		ТаблицаПроживающих.Индексы.Добавить("ЛицевойСчет,Услуга");	
	КонецЕсли;
	//Результат = Запрос.Выполнить();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Норма					= Выборка.Норма;
		НачисленияПроживающих	= 0;
		
		Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим и ТаблицаПроживающих <> Неопределено Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет);
			Отбор.Вставить("Услуга"     , Выборка.Услуга);
			СтрокиПоиска = ТаблицаПроживающих.НайтиСтроки(Отбор);
			
			Для каждого Строка Из СтрокиПоиска Цикл
				
				Если Строка.ПроживаниеВданныйМомент Тогда
					
					Норма = Норма - 1;
					
				КонецЕсли; 
				
				НачисленияПроживающих = НачисленияПроживающих + Строка.Начислено;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		// БИТ_ЖКХ 16.05.2017 14:09:25 Начало правки...
		//НоваяСтрока.Начислено  = Норма * Выборка.Ставка + НачисленияПроживающих + Выборка.СверхНорма * Выборка.СверхномСтавка;
		//
		//// БИТ_ЖКХ_23082013_начало_изменений
		//НоваяСтрока.НачисленоДо  = Норма * Выборка.СтавкаДо + НачисленияПроживающих + Выборка.СверхНорма * Выборка.СверхномСтавкаДо;
		//// БИТ_ЖКХ_23082013_окончание_изменений
		Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом Тогда
			НоваяСтрока.Начислено	= Выборка.Ставка * Выборка.РасчетнаяНорма + НачисленияПроживающих + Выборка.СверхНорма * Выборка.СверхномСтавка;
			НоваяСтрока.НачисленоДо	= Выборка.СтавкаДо * Выборка.РасчетнаяНорма + НачисленияПроживающих + Выборка.СверхНорма * Выборка.СверхномСтавкаДо;
		Иначе
			//УТОЧНИТЬ
			НоваяСтрока.Начислено	= (Норма * Выборка.Ставка + НачисленияПроживающих + Выборка.СверхНорма * Выборка.СверхномСтавка);
			НоваяСтрока.НачисленоДо	= (Норма * Выборка.СтавкаДо + НачисленияПроживающих + Выборка.СверхНорма * Выборка.СверхномСтавкаДо);
		КонецЕсли; 
		// БИТ_ЖКХ 16.05.2017 14:09:25 Конец правки.
		НоваяСтрока.ОбъемДо      = 0;
		
		
		Если НЕ Выборка.Тариф = 0 Тогда
			
			НоваяСтрока.Объем = НоваяСтрока.Начислено/Выборка.Тариф;
			
		КонецЕсли; 
		
		// БИТ_ЖКХ_28082013_начало_изменений
		Если НЕ Выборка.ТарифДо = 0 Тогда
			
			НоваяСтрока.ОбъемДо = НоваяСтрока.НачисленоДо/Выборка.ТарифДо;
			
		КонецЕсли; 
		// БИТ_ЖКХ_28082013_окончание_изменений
		
		НоваяСтрока.Норматив = ?(НоваяСтрока.Начислено <= НоваяСтрока.Норматив, НоваяСтрока.Начислено, НоваяСтрока.Норматив);
		
		НоваяСтрока.КОплате = НоваяСтрока.СальдоНаначало + НоваяСтрока.Начислено + НоваяСтрока.Разовые - НоваяСтрока.Оплата;
		НоваяСтрока.КОплате = ?(НоваяСтрока.КОплате < 0,0,НоваяСтрока.КОплате);
		
		НоваяСтрока.Долг               = ?(Выборка.СальдоНаначало > 0 ,Выборка.СальдоНаначало,0);
		НоваяСтрока.ПереплатаНаначало  = ?(Выборка.СальдоНаначало < 0 ,Выборка.СальдоНаначало,0) * -1;
		НоваяСтрока.КОплатеЗаМесяц     = НоваяСтрока.Начислено + НоваяСтрока.Разовые;
		НоваяСтрока.Переплата          = НоваяСтрока.ПереплатаНаначало  + НоваяСтрока.Начислено + НоваяСтрока.Разовые - НоваяСтрока.Оплата;
		
	КонецЦикла; 
	
	ОбъектСравнения = Новый СравнениеЗначений;
	ТаблицаНачислений.Сортировать("ЛицевойСчет Возр, Приоритет Убыв", ОбъектСравнения);
	
КонецПроцедуры

// Процедура выполняет расчет начислений по индивидуальным счетчикам.
//
Процедура РасчитатьНачисленияПоИндСчетчикам(ТаблицаСчетчиков, Запрос, РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = Ложь, РасчетОбъемовДоТретьегоЗнака = Ложь)
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК ЛицевойСчет,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ОтПоказаний,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
	|			ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
	|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
	|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|								ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|							КОНЕЦ
	|					КОНЕЦ > ВЫБОР
	|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
	|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
	|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|								ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|					ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
	|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
	|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|									КОНЕЦ
	|							КОНЕЦ = ВЫБОР
	|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
	|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
	|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) = ЕСТЬNULL(ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0), 0)
	|										ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|									ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|								КОНЕЦ
	|						ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ДоПоказаний,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) = ВЫБОР
	|					КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
	|						ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|					ИНАЧЕ ЕСТЬNULL(ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|											ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|										ИНАЧЕ ВЫБОР
	|												КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|													ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|												ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|											КОНЕЦ
	|									КОНЕЦ > ВЫБОР
	|										КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|											ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|										ИНАЧЕ ВЫБОР
	|												КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|													ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|												ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|											КОНЕЦ
	|									КОНЕЦ
	|									ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|								ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|							КОНЕЦ, 0)
	|				КОНЕЦ
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
	|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
	|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
	|									ИЛИ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
	|								ТОГДА ЕСТЬNULL(ВЫБОР
	|											КОГДА ВЫБОР
	|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|													ИНАЧЕ ВЫБОР
	|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|														КОНЕЦ
	|												КОНЕЦ > ВЫБОР
	|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|													ИНАЧЕ ВЫБОР
	|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|														КОНЕЦ
	|												КОНЕЦ
	|												ТОГДА ВЫБОР
	|														КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|															ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|														ИНАЧЕ ВЫБОР
	|																КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|																	ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
	|																ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|															КОНЕЦ
	|													КОНЕЦ
	|											ИНАЧЕ ВЫБОР
	|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|													ИНАЧЕ ВЫБОР
	|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
	|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ, 0)
	|							ИНАЧЕ бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, 0) * бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток КАК КоличествоЕдиниц,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	ВЫБОР
	|		КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Подкрутка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Инспектор)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ИсточникПоказаний,
	|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный КАК Многотарифный
	|ПОМЕСТИТЬ ПоказанияСчетчиковИнд
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Момент,
	|			Объект В (&ИсхСписокЛС)
	|				И Услуга В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Таб.услуга КАК услуга
	|					ИЗ
	|						ТаблицаНорм КАК Таб)) КАК бит_СчетчикиНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|				&Момент,
	|				Объект В (&ИсхСписокЛС)
	|					И Услуга В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Таб.услуга КАК услуга
	|						ИЗ
	|							ТаблицаНорм КАК Таб)) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНорм.ЛицевойСчет,
	|	ТаблицаНорм.Услуга,
	// БИТ_ЖКХ 14.07.2017 12:13:54 Начало правки...
	|	ТаблицаНорм.СтавкаНДС КАК СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 12:13:54 Конец правки.
	|	ТаблицаНорм.Приоритет,
	|	ТаблицаНорм.СпособРасчета,
	|	ТаблицаНорм.Ставка,
	|	ТаблицаНорм.СверхномСтавка,
	|	ТаблицаНорм.ПлановаяСтавка,
	|	ТаблицаНорм.Норматив,
	|	ТаблицаНорм.НормаЛьготы,
	|	ТаблицаНорм.Поставщик,
	|	ТаблицаНорм.ПолучательДенежныхСредств,
	|	ТаблицаНорм.Сальдо,
	|	ТаблицаНорм.СальдоНаНачало,
	|	ТаблицаНорм.СальдоПени,
	|	ТаблицаНорм.Оплата,
	|	ТаблицаНорм.Разовые,
	// БИТ_ЖКХ_23082013_начало_изменений
	|	ТаблицаНорм.СтавкаДо,
	|	ТаблицаНорм.СверхномСтавкаДо,
	|	ТаблицаНорм.ПлановаяСтавкаДо,
	|	ТаблицаНорм.ТарифДо,
	|	ТаблицаНорм.ПредельныйИндекс,
	|	ТаблицаНорм.НачислятьПредельныйИндекс,
	|	ТаблицаНорм.ПериодСравнения,
	|	ТаблицаНорм.ГруппаУслуги,
	|	ТаблицаНорм.МойПоставщик,
	|	ТаблицаНорм.ЕдИзм,
	// БИТ_ЖКХ_23082013_окончание_изменений
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.ОтПоказаний, 0) КАК ОтПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.ДоПоказаний, 0) КАК ДоПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	|	ПоказанияСчетчиковИнд.Счетчик КАК Счетчик,
	|	ПоказанияСчетчиковИнд.ИсточникПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК Факт,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК КоличествоЕдиницПоЛС,
	|	ПоказанияСчетчиковИнд.ЛицевойСчет КАК ВладелецСчетчика,
	|	ЕСТЬNULL(ТаблицаНорм.Норма, 0) КАК Норма,
	|	ПоказанияСчетчиковИнд.Многотарифный КАК Многотарифный,
	|	ЕСТЬNULL(ТаблицаНорм.Норма, 0) - ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК Разница,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ТаблицаНорм.Норма, 0) - ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КолУслуг,
	|	ЕСТЬNULL(ТаблицаНорм.Тариф,0) КАК Тариф
	|ИЗ
	|	ТаблицаНорм КАК ТаблицаНорм
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказанияСчетчиковИнд КАК ПоказанияСчетчиковИнд
	|		ПО ТаблицаНорм.ЛицевойСчет = ПоказанияСчетчиковИнд.ЛицевойСчет
	|			И ТаблицаНорм.Услуга = ПоказанияСчетчиковИнд.Услуга
	|ГДЕ
	|	ТаблицаНорм.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|	И ПоказанияСчетчиковИнд.Многотарифный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Разница
	|ИТОГИ
	|	СУММА(КоличествоЕдиниц),
	|	СУММА(Норма),
	|	МАКСИМУМ(Многотарифный),
	|	СУММА(КолУслуг)
	|ПО
	|	Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНорм.ЛицевойСчет КАК ЛицевойСчет,
	|	ТаблицаНорм.Услуга КАК Услуга,
	// БИТ_ЖКХ 14.07.2017 12:13:54 Начало правки...
	|	ТаблицаНорм.СтавкаНДС КАК СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 12:13:54 Конец правки.
	|	ТаблицаНорм.Приоритет,
	|	ТаблицаНорм.СпособРасчета,
	|	ТаблицаНорм.Ставка КАК Ставка,
	|	ТаблицаНорм.СверхномСтавка КАК СверхномСтавка,
	|	ТаблицаНорм.ПлановаяСтавка КАК ПлановаяСтавка,
	|	ТаблицаНорм.Норматив,
	|	ТаблицаНорм.НормаЛьготы,
	|	ТаблицаНорм.Поставщик,
	|	ТаблицаНорм.ПолучательДенежныхСредств,
	|	ТаблицаНорм.Сальдо,
	|	ТаблицаНорм.СальдоНаНачало,
	|	ТаблицаНорм.СальдоПени,
	|	ТаблицаНорм.Оплата,
	|	ТаблицаНорм.Разовые,
	// БИТ_ЖКХ_23082013_начало_изменений
	|	ТаблицаНорм.СтавкаДо,
	|	ТаблицаНорм.СверхномСтавкаДо,
	|	ТаблицаНорм.ПлановаяСтавкаДо,
	|	ТаблицаНорм.ТарифДо,
	|	ТаблицаНорм.ПредельныйИндекс,
	|	ТаблицаНорм.НачислятьПредельныйИндекс,
	|	ТаблицаНорм.ПериодСравнения,
	|	ТаблицаНорм.ГруппаУслуги,
	|	ТаблицаНорм.МойПоставщик,
	|	ТаблицаНорм.ЕдИзм,
	// БИТ_ЖКХ_23082013_окончание_изменений
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.ОтПоказаний, 0) КАК ОтПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.ДоПоказаний, 0) КАК ДоПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	|	ПоказанияСчетчиковИнд.Счетчик КАК Счетчик,
	|	ПоказанияСчетчиковИнд.ИсточникПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК Факт,
	|	ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК КоличествоЕдиницПоЛС,
	|	ПоказанияСчетчиковИнд.ЛицевойСчет КАК ВладелецСчетчика,
	|	ЕСТЬNULL(ТаблицаНорм.Норма, 0) КАК Норма,
	|	ПоказанияСчетчиковИнд.Многотарифный КАК Многотарифный,
	|	ЕСТЬNULL(ТаблицаНорм.Норма, 0) - ЕСТЬNULL(ПоказанияСчетчиковИнд.КоличествоЕдиниц, 0) КАК Разница,
	|	ЕСТЬNULL(ТаблицаНорм.Тариф,0) КАК Тариф
	|ИЗ
	|	ТаблицаНорм КАК ТаблицаНорм
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказанияСчетчиковИнд КАК ПоказанияСчетчиковИнд
	|		ПО ТаблицаНорм.ЛицевойСчет = ПоказанияСчетчиковИнд.ЛицевойСчет
	|			И ТаблицаНорм.Услуга = ПоказанияСчетчиковИнд.Услуга
	|ГДЕ
	|	ТаблицаНорм.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|	И НЕ ПоказанияСчетчиковИнд.Многотарифный
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоЕдиниц УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Ставка),
	|	МАКСИМУМ(СверхномСтавка),
	|	МАКСИМУМ(ПлановаяСтавка),
	// БИТ_ЖКХ_23082013_начало_изменений
	|	МАКСИМУМ(СтавкаДо),
	|	МАКСИМУМ(СверхномСтавкаДо),
	|	МАКСИМУМ(ПлановаяСтавкаДо),
	// БИТ_ЖКХ_23082013_окончание_изменений
	|	СУММА(КоличествоЕдиниц),
	|	МАКСИМУМ(Норма)
	|ПО
	|	ЛицевойСчет,
	|	Услуга";
	
	Результат = Запрос.ВыполнитьПакет(); 
	
	// Многотарифные счетчики.
	ВыборкаСЧ = Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	тмпТаблица = ТаблицаСчетчиков.СкопироватьКолонки();
	
	Пока ВыборкаСЧ.Следующий() Цикл
		
		тмпТаблица.Очистить();
		
		Выборка = ВыборкаСЧ.Выбрать();
		
		КолУслуг       = ВыборкаСЧ.КолУслуг;
		ДобавитьКНорме = 0;
		КолУслугИсп    = 0;
		
		// Получаем Добавочную норму.
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = тмпТаблица.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Если РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Тогда
				
				Разница = (Выборка.Норма + ДобавитьКНорме) - Выборка.Факт;
				
				Если Разница > 0 Тогда
					
					тмпКолУслуг = (КолУслуг - 1 - КолУслугИсп);
					
					ДобавитьКНорме = ДобавитьКНорме + Разница / ?(тмпКолУслуг <= 0, 1, тмпКолУслуг);
					КолУслугИсп  = КолУслугИсп + 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Определяем остаток нормы и сумируем с добавочной.
		Если РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Тогда
			
			Остаток = 0;
			
			тмпДобавитьКНорме = Число(ДобавитьКНорме);
			
			Выборка.Сбросить();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Разница < 0 Тогда
					
					тмпОстаток = тмпДобавитьКНорме + Выборка.Разница;
					
					Если тмпОстаток > 0 Тогда
						КолУслуг = КолУслуг - 1;
						Остаток = Остаток + тмпОстаток;
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Если КолУслуг > 0 Тогда
				
				ДобавитьКНорме = ДобавитьКНорме + (Остаток/КолУслуг);
				
			КонецЕсли; 
			
		КонецЕсли;
		
		// Вычесляем начисления.
		Для каждого СтрокаТаблицы Из тмпТаблица Цикл
			
			НоваяСтрока = ТаблицаСчетчиков.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			// БИТ_ЖКХ_04102013_начало_изменений
			// Норма        = Мин(СтрокаТаблицы.Норма + ДобавитьКНорме, СтрокаТаблицы.КоличествоЕдиниц);.
			Если РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика Тогда
				
				СуммаНорма = 0;
				СуммаФакт  = 0;
				СуммаНорма = тмпТаблица.Итог("Норма");
				СуммаФакт  = тмпТаблица.Итог("КоличествоЕдиниц");
				
				Если (СуммаФакт = 0) ИЛИ (СуммаФакт = Неопределено) Тогда
					
					Норма = 0;
					
				Иначе
					
					Норма = СтрокаТаблицы.КоличествоЕдиниц*СуммаНорма/СуммаФакт;
					
					// БИТ_ЖКХ_21102013_начало_изменений
					Если Норма > СтрокаТаблицы.КоличествоЕдиниц Тогда
						
						Норма = СтрокаТаблицы.КоличествоЕдиниц;
						
					КонецЕсли;
					// БИТ_ЖКХ_21102013_окончание_изменений
					
				КонецЕсли;
				
			Иначе
				
				Норма = Мин(СтрокаТаблицы.Норма + ДобавитьКНорме, СтрокаТаблицы.КоличествоЕдиниц);
				
			КонецЕсли;
			// БИТ_ЖКХ_04102013_окончание_изменений
			
			СверхНорма = ?(СтрокаТаблицы.КоличествоЕдиниц > Норма, СтрокаТаблицы.КоличествоЕдиниц - Норма, 0);
			Начислено  = Норма * СтрокаТаблицы.Ставка + СверхНорма * СтрокаТаблицы.СверхномСтавка;
			
			// БИТ_ЖКХ_23082013_начало_изменений
			НачисленоДо  = Норма * СтрокаТаблицы.СтавкаДо + СверхНорма * СтрокаТаблицы.СверхномСтавкаДо;
			// БИТ_ЖКХ_23082013_окончание_изменений
			
			НоваяСтрока.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам;
			НоваяСтрока.Норма         = Норма;
			НоваяСтрока.СверхНорма    = СверхНорма;
			НоваяСтрока.Начислено     = Начислено;
			НоваяСтрока.Многотарифный = Истина;
			
			// БИТ_ЖКХ_23082013_начало_изменений
			НоваяСтрока.НачисленоДо   = НачисленоДо;
			НоваяСтрока.ОбъемДо       = 0;
			// БИТ_ЖКХ_23082013_окончание_изменений
			
			Если НЕ СтрокаТаблицы.Тариф = 0 Тогда
				// БИТ_ЖКХ 02.03.2017 16:24:11 Начало правки...
				//НоваяСтрока.Объем = Окр(Начислено/СтрокаТаблицы.Тариф,4);
				Если РасчетОбъемовДоТретьегоЗнака Тогда
					НоваяСтрока.Объем = Окр(Начислено/СтрокаТаблицы.Тариф,3);
				Иначе
					НоваяСтрока.Объем = Окр(Начислено/СтрокаТаблицы.Тариф,4);
				КонецЕсли;
				// БИТ_ЖКХ 02.03.2017 16:24:11 Конец правки.
			КонецЕсли; 
			
			// БИТ_ЖКХ_28082013_начало_изменений
			Если НЕ СтрокаТаблицы.ТарифДо = 0 Тогда
				НоваяСтрока.ОбъемДо = Окр(НачисленоДо/СтрокаТаблицы.ТарифДо,4);
			КонецЕсли; 
			// БИТ_ЖКХ_28082013_окончание_изменений
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Однотарифные счетчики.
	ВыборкаЛС = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ВыборкаУС = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаУС.Следующий() Цикл
			
			Выборка = ВыборкаУС.Выбрать();
			
			Норма          = ВыборкаУС.Норма;
			Ставка         = ВыборкаУС.Ставка;
			СверхномСтавка = ВыборкаУС.СверхномСтавка;
			
			// БИТ_ЖКХ_26082013_начало_изменений
			СтавкаДо         = ВыборкаУС.СтавкаДо;
			СверхномСтавкаДо = ВыборкаУС.СверхномСтавкаДо;
			// БИТ_ЖКХ_26082013_окончание_изменений
			
			Итого = 0;
			
			СуммаПроверки  =  ВыборкаУС.КоличествоЕдиниц * Ставка;
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = ТаблицаСчетчиков.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				// БИТ_ЖКХ_26082013_начало_изменений
				Если Выборка.КоличествоЕдиниц <= Норма Тогда
					расчНорма  = Выборка.КоличествоЕдиниц;
					СверхНорма = 0;
				Иначе
					расчНорма  = Норма;
					СверхНорма = Выборка.КоличествоЕдиниц - Норма;
				КонецЕсли;
				Норма = Норма - расчНорма;
				// БИТ_ЖКХ_26082013_окончание_изменений
				Начислено  = расчНорма * Ставка + СверхНорма * СверхномСтавка;
				
				НоваяСтрока.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам;
				НоваяСтрока.Норма         = расчНорма;// Норма; Исправлена ошибка норма = 0 для однотарифного счетчика akozlov 04/07/2013.
				НоваяСтрока.СверхНорма    = СверхНорма;
				НоваяСтрока.Начислено     = Начислено;
				
				// БИТ_ЖКХ_26082013_начало_изменений
				НоваяСтрока.НачисленоДо   = расчНорма * СтавкаДо + СверхНорма * СверхномСтавкаДо;
				// БИТ_ЖКХ_26082013_окончание_изменений
				
				Если НЕ Выборка.Тариф = 0 Тогда
					// БИТ_ЖКХ 02.03.2017 14:51:04 Начало правки...
					//НоваяСтрока.Объем = Окр(Начислено/Выборка.Тариф,4); 
					Если РасчетОбъемовДоТретьегоЗнака Тогда
						НоваяСтрока.Объем = Окр(Начислено/Выборка.Тариф,3); 
					Иначе
						НоваяСтрока.Объем = Окр(Начислено/Выборка.Тариф,4); 
					КонецЕсли;
					// БИТ_ЖКХ 02.03.2017 14:51:04 Конец правки.
				КонецЕсли;
				
				Итого = Итого + Начислено;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет расчет начислений по счетчикам.
//
Процедура РасчитатьНачисленияПоГрупСчетчикам(СписокЛС, ТаблицаСчетчиков, Запрос, ЭтоЛС = Ложь, РасчетОбъемовДоТретьегоЗнака = Ложь)
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Здание,
	|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ОтПоказаний,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
	|				ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
	|			ИНАЧЕ ВЫБОР
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|					ИНАЧЕ ВЫБОР
	|							КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, 0) КАК ДоПоказаний,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ > ВЫБОР
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|					ИНАЧЕ ВЫБОР
	|							КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|				ТОГДА ВЫБОР
	|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|							ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток = 0
	|							ТОГДА 0
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|									ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, 0) * бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток КАК КоличествоЕдиниц,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	ВЫБОР
	|		КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Подкрутка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Инспектор)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ИсточникПоказаний,
	|	бит_СчетчикиНаУслугахСрезПоследних.ИспользоватьСтавкуПоСчетчику,
	|	бит_СчетчикиНаУслугахСрезПоследних.Поставщик КАК Поставщик,
	|	бит_СчетчикиНаУслугахСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_СчетчикиНаУслугахСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СчетчикиНаУслугахСрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СчетчикиНаУслугахСрезПоследних.СпособРасчетаУменьшения,
	|	бит_СчетчикиНаУслугахСрезПоследних.ИспользоватьПравилоУменьшения
	|ПОМЕСТИТЬ ПоказанияСчетчиков
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			,
	|			Счетчик В (&СписокГрупСчетчиков)
	|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)) КАК бит_СчетчикиНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Момент, Счетчик В (&СписокГрупСчетчиков)) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Момент, ГрупповойСчетчик В (&СписокГрупСчетчиков)) КАК бит_ГрупповыеСчетчикиСрезПоследних
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик
	|			И бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ГрупповыеСчетчикиСрезПоследних.Услуга
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
	|	И бит_ГрупповыеСчетчикиСрезПоследних.Использовать
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	Поставщик,
	|	СтатусКвартиры,
	|	ТипКвартиры,
	|	РежимПотребления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияСчетчиков.Здание КАК Здание,
	|	ПоказанияСчетчиков.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоказанияСчетчиков.Услуга КАК Услуга,
	|	ПоказанияСчетчиков.Счетчик КАК Счетчик,
	|	ЕСТЬNULL(ПоказанияСчетчиков.ОтПоказаний, 0) КАК ОтПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиков.ДоПоказаний, 0) КАК ДоПоказаний,
	|	ЕСТЬNULL(ПоказанияСчетчиков.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	|	ПоказанияСчетчиков.ИсточникПоказаний,
	|	ТаблицаНорм.Приоритет,
	// БИТ_ЖКХ 14.07.2017 12:12:10 Начало правки...
	|	ТаблицаНорм.СтавкаНДС,
	// БИТ_ЖКХ 14.07.2017 12:12:10 Конец правки.
	|	ТаблицаНорм.СпособРасчета,
	|	ТаблицаНорм.РежимПотребления,
	|	ЕСТЬNULL(ТаблицаНорм.СтавкаДо, 0) КАК СтавкаДо,
	|	ЕСТЬNULL(ТаблицаНорм.СверхномСтавкаДо, 0) КАК СверхномСтавкаДо,
	|	ЕСТЬNULL(ТаблицаНорм.ПлановаяСтавкаДо, 0) КАК ПлановаяСтавкаДо,
	|	ЕСТЬNULL(ТаблицаНорм.ТарифДо, 0) КАК ТарифДо,
	|	ЕСТЬNULL(ТаблицаНорм.ПредельныйИндекс, 0) КАК ПредельныйИндекс,
	|	ТаблицаНорм.НачислятьПредельныйИндекс,
	|	ТаблицаНорм.ПериодСравнения,
	|	ТаблицаНорм.ГруппаУслуги,
	|	ТаблицаНорм.МойПоставщик,
	|	ТаблицаНорм.ЕдИзм,
	|	ЕСТЬNULL(ТаблицаНорм.Ставка, 0) КАК Ставка,
	|	ЕСТЬNULL(ТаблицаНорм.СверхномСтавка, 0) КАК СверхномСтавка,
	|	ЕСТЬNULL(ТаблицаНорм.ПлановаяСтавка, 0) КАК ПлановаяСтавка,
	|	ЕСТЬNULL(ТаблицаНорм.Норма, 0) КАК Норма,
	|	ЕСТЬNULL(ТаблицаНорм.СверхНорма, 0) КАК СверхНорма,
	|	ЕСТЬNULL(ТаблицаНорм.Норматив, 0) КАК Норматив,
	|	ЕСТЬNULL(ТаблицаНорм.НормаЛьготы, 0) КАК НормаЛьготы,
	|	ТаблицаНорм.Поставщик,
	|	ТаблицаНорм.ПолучательДенежныхСредств,
	|	ЕСТЬNULL(ТаблицаНорм.Сальдо, 0) КАК Сальдо,
	|	ЕСТЬNULL(ТаблицаНорм.СальдоНаНачало, 0) КАК СальдоНаНачало,
	|	ЕСТЬNULL(ТаблицаНорм.СальдоПени, 0) КАК СальдоПени,
	|	ЕСТЬNULL(ТаблицаНорм.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ТаблицаНорм.Разовые, 0) КАК Разовые,
	|	ВЫБОР
	|		КОГДА ПоказанияСчетчиков.ИспользоватьПравилоУменьшения
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0) * ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|									ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0) * ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|											ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0) * ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка, 0)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|													ТОГДА ТаблицаПроживающих.КоличествоПроживающих * ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка, 0)
	|												ИНАЧЕ ВЫБОР
	|														КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|																ИЛИ ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|															ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления, 0) * ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка, 0)
	|													КОНЕЦ
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВЫБОР
	|					КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|						ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|								ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|										ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|												ТОГДА ТаблицаПроживающих.КоличествоПроживающих * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|											ИНАЧЕ ВЫБОР
	|													КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|															ИЛИ ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|														ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ, 0)
	|	КОНЕЦ КАК ДоляЛС,
	|	ПоказанияСчетчиков.КоличествоЕдиниц КАК КоличествоЕдиницПоЛС,
	|	ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка2,
	|	ТаблицаСведенийПоЛС.ОсновнойСпособРасчета,
	|	ВЫБОР
	|		КОГДА ПоказанияСчетчиков.ИспользоватьПравилоУменьшения
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|									ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|											ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|													ТОГДА ТаблицаПроживающих.КоличествоПроживающих
	|												ИНАЧЕ ВЫБОР
	|														КОГДА ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|																ИЛИ ПоказанияСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|															ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления, 0)
	|													КОНЕЦ
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВЫБОР
	|					КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|						ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|								ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|										ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|												ТОГДА ТаблицаПроживающих.КоличествоПроживающих
	|											ИНАЧЕ ВЫБОР
	|													КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|															ИЛИ ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|														ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления, 0)
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ, 0)
	|	КОНЕЦ КАК ДоляЛСФакт,
	|	ПоказанияСчетчиков.Здание КАК ВладелецСчетчика,
	|	ПоказанияСчетчиков.Услуга.ОсновнойРежимПотребления КАК ОсновнойРежимПотребления,
	|	ЕСТЬNULL(ТаблицаНорм.Тариф, 0) КАК Тариф,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ПлановаяСтавка, 0) КАК ПлановаяСтавкаПоСч,
	|	ПоказанияСчетчиков.ИспользоватьСтавкуПоСчетчику КАК ИспользоватьСтавкуПоСчетчику,
	|	ПоказанияСчетчиков.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	|	ПоказанияСчетчиков.ИспользоватьПравилоУменьшения,
	|	ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления,
	|	ТаблицаСведенийПоЛС.ЖилаяПлощадь,
	|	ТаблицаСведенийПоЛС.ОбщаяПлощадь,
	|	ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь,
	|	ТаблицаПроживающих.КоличествоПроживающих
	|ИЗ
	|	ПоказанияСчетчиков КАК ПоказанияСчетчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНорм КАК ТаблицаНорм
	|		ПО ПоказанияСчетчиков.ЛицевойСчет = ТаблицаНорм.ЛицевойСчет
	|			И ПоказанияСчетчиков.Услуга = ТаблицаНорм.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроживающих КАК ТаблицаПроживающих
	|		ПО ПоказанияСчетчиков.ЛицевойСчет = ТаблицаПроживающих.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|		ПО ПоказанияСчетчиков.ЛицевойСчет = ТаблицаСведенийПоЛС.ЛицевойСчет
	|			И ПоказанияСчетчиков.Услуга = ТаблицаСведенийПоЛС.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&Момент, СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО ПоказанияСчетчиков.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И ПоказанияСчетчиков.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И ПоказанияСчетчиков.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|			И ПоказанияСчетчиков.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|			И ПоказанияСчетчиков.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|				&Момент,
	|				Услуга В
	|						(ВЫБРАТЬ
	|							ТаблицаСведенийПоЛС.Услуга
	|						ИЗ
	|							ТаблицаСведенийПоЛС)
	|					И Поставщик В
	|						(ВЫБРАТЬ
	|							ТаблицаСведенийПоЛС.Поставщик
	|						ИЗ
	|							ТаблицаСведенийПоЛС)
	|					И РежимПотребления В
	|						(ВЫБРАТЬ
	|							ТаблицаСведенийПоЛС.РежимПотребления
	|						ИЗ
	|							ТаблицаСведенийПоЛС)
	|					И СпособРасчета В
	|						(ВЫБРАТЬ
	|							ПоказанияСчетчиков.СпособРасчетаУменьшения
	|						ИЗ
	|							ПоказанияСчетчиков)
	|					И СтатусКвартиры В
	|						(ВЫБРАТЬ
	|							ТаблицаСведенийПоЛС.СтатусКвартиры
	|						ИЗ
	|							ТаблицаСведенийПоЛС)
	|					И ТипКвартиры В
	|						(ВЫБРАТЬ
	|							ТаблицаСведенийПоЛС.ТипКвартиры
	|						ИЗ
	|							ТаблицаСведенийПоЛС)) КАК бит_СтавкиНаУслугиСрезПоследних1
	|		ПО ПоказанияСчетчиков.Поставщик = бит_СтавкиНаУслугиСрезПоследних1.Поставщик
	|			И ПоказанияСчетчиков.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних1.СтатусКвартиры
	|			И ПоказанияСчетчиков.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних1.ТипКвартиры
	|			И ПоказанияСчетчиков.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних1.РежимПотребления
	|			И ПоказанияСчетчиков.Услуга = бит_СтавкиНаУслугиСрезПоследних1.Услуга
	|			И ПоказанияСчетчиков.СпособРасчетаУменьшения = бит_СтавкиНаУслугиСрезПоследних1.СпособРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет
	|ИТОГИ
	|	МАКСИМУМ(КоличествоЕдиниц),
	|	МАКСИМУМ(ПлановаяСтавкаДо),
	|	МАКСИМУМ(ПлановаяСтавка),
	|	СУММА(ДоляЛС),
	|	СУММА(ДоляЛСФакт),
	|	МАКСИМУМ(ПлановаяСтавкаПоСч),
	|	МАКСИМУМ(ИспользоватьСтавкуПоСчетчику),
	|	МАКСИМУМ(ОсновнаяСтавка)
	|ПО
	|	Услуга,
	|	Счетчик";
	
	ТаблицаПогрешностей = Новый ТаблицаЗначений;
	ТаблицаПогрешностей.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПогрешностей.Колонки.Добавить("Услуга"     , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПогрешностей.Колонки.Добавить("Сумма"      , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	
	Результат    = Запрос.Выполнить();
	
	ТЗРезультат    = Результат.Выгрузить();
	
	ВыборкаУслуг = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		
		ВыборкаСчетчик = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСчетчик.Следующий() Цикл  
			
			ТаблицаПогрешностей.Очистить();
			
			//МассивУслуг   = Новый Массив;
			ИтогСумма     = 0;
			ПлановаяСумма = 0;
			Счетчик       = ВыборкаСчетчик.Счетчик;
			
			СтавкаПоСчетчику = ?(ВыборкаСчетчик.ИспользоватьСтавкуПоСчетчику, ВыборкаСчетчик.ПлановаяСтавкаПоСч, ВыборкаСчетчик.ПлановаяСтавка);
			
			// БИТ_ЖКХ_23082013_начало_изменений
			СтавкаПоСчетчикуДо = ?(ВыборкаСчетчик.ИспользоватьСтавкуПоСчетчику, ВыборкаСчетчик.ПлановаяСтавкаПоСч, ВыборкаСчетчик.ПлановаяСтавкаДо);
			ИтогСуммаДо        = 0;
			СуммаДляОбъема = 0;
			ПлановаяСуммаДо    = Окр(ВыборкаСчетчик.КоличествоЕдиниц*СтавкаПоСчетчикуДо,4,1);
			// БИТ_ЖКХ_23082013_окончание_изменений
			
			// БИТ_ЖКХ 13.05.2014
			//ПлановаяСумма = Окр(ВыборкаСчетчик.КоличествоЕдиниц*СтавкаПоСчетчику,4,1);
			ПлановаяСумма = Окр(ВыборкаСчетчик.КоличествоЕдиниц*СтавкаПоСчетчику,2,1);
			// БИТ_ЖКХ 13.05.2014
			
			Выборка = ВыборкаСчетчик.Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				
					Если ВыборкаСчетчик.ДоляЛС = 0 Тогда
						
						Единицы   = 0;
						Сумма     = 0;
						// БИТ_ЖКХ 02.12.2020
						СуммаДляОбъема = 0;
						
					Иначе
						Единицы 	= Окр(Выборка.КоличествоЕдиниц*Выборка.ДоляЛС/ВыборкаСчетчик.ДоляЛС,4,1); 
						// БИТ_ЖКХ_01102013_начало_изменений
						//Сумма 		= Окр(Единицы*СтавкаПоСчетчику,2,1);
						
						Сумма                 = Окр(Выборка.КоличествоЕдиниц*Выборка.ДоляЛС/ВыборкаСчетчик.ДоляЛС*СтавкаПоСчетчику,2,1);
						// БИТ_ЖКХ 24.11.2020
						СуммаДляОбъема        = Окр(Выборка.КоличествоЕдиниц*Выборка.ДоляЛС/ВыборкаСчетчик.ДоляЛС*СтавкаПоСчетчику,4,1);
						

						
						//// БИТ_ЖКХ 02.12.2014{{	
						//Если Единицы <= Выборка.Норма Тогда
						//	расчНорма  = Единицы;
						//	СверхНорма = 0;
						//Иначе
						//	расчНорма  = Выборка.Норма;
						//	СверхНорма = Единицы - Выборка.Норма;
						//КонецЕсли;
						//Норма = Выборка.Норма - расчНорма;
						//Начислено  = расчНорма * Выборка.Ставка + СверхНорма * Выборка.СверхномСтавка;
						//Сумма 		= Окр(Начислено,2,1);
						//// БИТ_ЖКХ 02.12.2014}}
						
						// БИТ_ЖКХ_01102013_окончание_изменений
						
						ИтогСумма 	= ИтогСумма + Сумма;
						
						// БИТ_ЖКХ_26082013_начало_изменений
						ИтогСуммаДо = ИтогСуммаДо + Окр(Выборка.КоличествоЕдиниц*Выборка.ДоляЛС/ВыборкаСчетчик.ДоляЛС*СтавкаПоСчетчикуДо,4,1);
						// БИТ_ЖКХ_26082013_окончание_изменений
					КонецЕсли; 
					
					//КонецЕсли; 
					
				//КонецЕсли; 
				
				СтрокаПогрешности = ТаблицаПогрешностей.Добавить();
				СтрокаПогрешности.ЛицевойСчет = Выборка.ЛицевойСчет;
				СтрокаПогрешности.Услуга      = Выборка.Услуга;
				СтрокаПогрешности.Сумма       = Сумма;
				
				Если СписокЛС.Найти(Выборка.ЛицевойСчет) = Неопределено   Тогда
					Продолжить;
				КонецЕсли;
				
				НовСтрока = ТаблицаСчетчиков.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
				НовСтрока.КоличествоЕдиницПоЛС = Единицы;
				НовСтрока.КоличествоЕдиниц     = Выборка.КоличествоЕдиниц;
				НовСтрока.Факт                 = Единицы;
				НовСтрока.СпособРасчета        = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам;
				// БИТ_ЖКХ 24.05.2017 11:33:05 Начало правки...
				//НовСтрока.Начислено            = Сумма;
				//НовСтрока.Норматив             = ?(НовСтрока.Начислено <= Выборка.Норматив, НовСтрока.Начислено, Выборка.Норматив);
				Если ЭтоЛС Тогда
					НовСтрока.Начислено			= 0;
					НовСтрока.Норматив			= 0;
				Иначе	
					НовСтрока.Начислено			= Сумма;
					НовСтрока.Норматив			= ?(НовСтрока.Начислено <= Выборка.Норматив, НовСтрока.Начислено, Выборка.Норматив);
				КонецЕсли;
				// БИТ_ЖКХ 24.05.2017 11:33:05 Конец правки.
				
				НовСтрока.Доля                 = ВыборкаСчетчик.ДоляЛСФакт;
				НовСтрока.ДоляПоЛС             = Выборка.ДоляЛСФакт;
				//НовСтрока.Ставка               = Выборка.ПлановаяСтавка;
				НовСтрока.Ставка               = СтавкаПоСчетчику;
				
				// БИТ_ЖКХ 04.12.2014{{
				Если Выборка.ИспользоватьПравилоУменьшения Тогда
					
					НовСтрока.ОсновнойСпособРасчета        = Выборка.СпособРасчетаУменьшения;
					
				КонецЕсли;
				// БИТ_ЖКХ 04.12.2014}}
				
				
				// БИТ_ЖКХ 24.05.2017 11:33:58 Начало правки... 
				//// БИТ_ЖКХ_23082013_начало_изменений
				//Если ВыборкаСчетчик.ДоляЛС = 0 Тогда
				Если ВыборкаСчетчик.ДоляЛС = 0 ИЛИ ЭтоЛС Тогда
				// БИТ_ЖКХ 24.05.2017 11:34:04 Конец правки. 		
						НовСтрока.НачисленоДо = 0;
					Иначе
						НовСтрока.НачисленоДо = Окр(Выборка.КоличествоЕдиниц*Выборка.ДоляЛС/ВыборкаСчетчик.ДоляЛС*СтавкаПоСчетчикуДо,4,1);
					КонецЕсли;
					// БИТ_ЖКХ_23082013_окончание_изменений
				
				Если НЕ Выборка.Тариф = 0 Тогда
                    // БИТ_ЖКХ 02.03.2017 14:51:49 Начало правки...
					//НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,4);
					//Если РасчетОбъемовДоТретьегоЗнака Тогда
					//	НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,3);
					//Иначе
					//	НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,4);
					//КонецЕсли;
					// БИТ_ЖКХ 02.03.2017 14:51:49 Конец правки.
					// БИТ_ЖКХ 24.11.2020
					Если РасчетОбъемовДоТретьегоЗнака Тогда
						НовСтрока.Объем = Окр(СуммаДляОбъема/Выборка.Тариф,3);
					Иначе
						НовСтрока.Объем = Окр(СуммаДляОбъема/Выборка.Тариф,4);
					КонецЕсли;

				КонецЕсли;
				// БИТ_ЖКХ_28082013_начало_изменений
				Если НЕ Выборка.ТарифДо = 0 Тогда
					
						Если НЕ ВыборкаСчетчик.ДоляЛС = 0 Тогда
							
							НовСтрока.ОбъемДо = Окр(Окр(Выборка.КоличествоЕдиниц*Выборка.ДоляЛС/ВыборкаСчетчик.ДоляЛС*СтавкаПоСчетчикуДо,4,1)/Выборка.ТарифДо,4);
							
						КонецЕсли;
					//КонецЕсли;
					
				КонецЕсли; 
				// БИТ_ЖКХ_28082013_окончание_изменений
			КонецЦикла;
			
			//Если НЕ ЭтоЛС Тогда
			Погрешность = ПлановаяСумма - ИтогСумма;
			
			Если Погрешность <> 0 Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Счетчик", ВыборкаСчетчик.Счетчик);
				ТаблицаПогрешностей.Сортировать("Сумма Убыв");
				Если ТаблицаПогрешностей.Количество() > 0 Тогда
					
					Отбор.Вставить("ЛицевойСчет", ТаблицаПогрешностей[0].ЛицевойСчет);
					Отбор.Вставить("Услуга"     , ТаблицаПогрешностей[0].Услуга);
					
					Строки = ТаблицаСчетчиков.НайтиСтроки(Отбор);
					Если Строки.Количество() > 0 тогда 
						Строки[0].Начислено = Строки[0].Начислено + Погрешность;
						// БИТ_ЖКХ_26082013_начало_изменений
						Если НЕ Строки[0].Тариф = 0 Тогда
							// БИТ_ЖКХ 02.03.2017 16:06:33 Начало правки...
							//Строки[0].Объем = Окр(Строки[0].Начислено/Строки[0].Тариф,4);
							Если РасчетОбъемовДоТретьегоЗнака Тогда
								Строки[0].Объем = Окр(Строки[0].Начислено/Строки[0].Тариф,3);
							Иначе
								Строки[0].Объем = Окр(Строки[0].Начислено/Строки[0].Тариф,4);
							КонецЕсли;
							// БИТ_ЖКХ 02.03.2017 16:06:33 Конец правки.
						КонецЕсли;
						// БИТ_ЖКХ_26082013_начало_изменений
					КонецЕсли;
					
				КонецЕсли; 
			КонецЕсли;
			//КонецЕсли;
			
			// БИТ_ЖКХ_26082013_начало_изменений
			ПогрешностьДо = ПлановаяСуммаДо - ИтогСуммаДо;
			
			Если ПогрешностьДо <> 0 Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Счетчик", ВыборкаСчетчик.Счетчик);
				ТаблицаПогрешностей.Сортировать("Сумма Убыв");
				Если ТаблицаПогрешностей.Количество() > 0 Тогда
					
					Отбор.Вставить("ЛицевойСчет", ТаблицаПогрешностей[0].ЛицевойСчет);
					Отбор.Вставить("Услуга"     , ТаблицаПогрешностей[0].Услуга);
					
					Строки = ТаблицаСчетчиков.НайтиСтроки(Отбор);
					Если Строки.Количество() > 0 тогда 
						Строки[0].НачисленоДо = Строки[0].НачисленоДо + ПогрешностьДо;
						
						Если НЕ Строки[0].Тариф = 0 Тогда
							// БИТ_ЖКХ 02.03.2017 16:19:38 Начало правки...
							//Строки[0].Объем = Окр(Строки[0].Начислено/Строки[0].Тариф,4);
							Если РасчетОбъемовДоТретьегоЗнака Тогда
								Строки[0].Объем = Окр(Строки[0].Начислено/Строки[0].Тариф,3);
							Иначе
								Строки[0].Объем = Окр(Строки[0].Начислено/Строки[0].Тариф,4);
							КонецЕсли;
							// БИТ_ЖКХ 02.03.2017 16:19:38 Конец правки.
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли; 
			КонецЕсли;
			// БИТ_ЖКХ_26082013_окончание_изменений
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбъектСравнения = Новый СравнениеЗначений;
	ТаблицаСчетчиков.Сортировать("ЛицевойСчет Возр, Приоритет Убыв", ОбъектСравнения);
	
КонецПроцедуры

// Процедура выполняет расчет начислений по Распределениям.
//
Процедура РасчитатьНачисленияПоРаспределений(СписокЛС, ТаблицаРаспределений, Запрос, ЭтоЛС = Ложь, РасчетОбъемовДоТретьегоЗнака = Ложь)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоказанияСчетчиков.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоказанияСчетчиков.Услуга КАК Услуга,
	|	ПоказанияСчетчиков.Распределение КАК Распределение,
	|	ЕСТЬNULL(ПоказанияСчетчиков.КоличествоЕдиниц, 0) КАК КоличествоЕдиниц,
	// БИТ_ЖКХ 31.08.2017 15:03:35 Начало правки... 
	|	ЕСТЬNULL(ТаблицаНорм.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)) КАК СтавкаНДС,
	// БИТ_ЖКХ 31.08.2017 15:03:37 Конец правки. 
	|	ТаблицаНорм.Приоритет,
	|	ТаблицаНорм.СпособРасчета,
	|	ЕСТЬNULL(ТаблицаНорм.Ставка, 0) КАК Ставка,
	|	ЕСТЬNULL(ТаблицаНорм.СверхномСтавка, 0) КАК СверхномСтавка,
	|	ЕСТЬNULL(ТаблицаНорм.ПлановаяСтавка, 0) КАК ПлановаяСтавка,
	|	ЕСТЬNULL(ТаблицаНорм.Норма, 0) КАК Норма,
	|	ЕСТЬNULL(ТаблицаНорм.СверхНорма, 0) КАК СверхНорма,
	|	ЕСТЬNULL(ТаблицаНорм.Норматив, 0) КАК Норматив,
	|	ЕСТЬNULL(ТаблицаНорм.НормаЛьготы, 0) КАК НормаЛьготы,
	|	ТаблицаНорм.Поставщик,
	|	ТаблицаНорм.ПолучательДенежныхСредств,
	|	ЕСТЬNULL(ТаблицаНорм.Сальдо, 0) КАК Сальдо,
	|	ЕСТЬNULL(ТаблицаНорм.СальдоНаНачало, 0) КАК СальдоНаНачало,
	|	ЕСТЬNULL(ТаблицаНорм.СальдоПени, 0) КАК СальдоПени,
	|	ЕСТЬNULL(ТаблицаНорм.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ТаблицаНорм.Разовые, 0) КАК Разовые,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|				ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|						ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|								ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|										ТОГДА ТаблицаПроживающих.КоличествоПроживающих * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|													ИЛИ ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|												ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления, 0) * ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, 0) КАК ДоляЛС,
	|	ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	|	ТаблицаСведенийПоЛС.ОсновнойСпособРасчета,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|				ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОтапливаемаяПлощадь, 0)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|						ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ОбщаяПлощадь, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|								ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.ЖилаяПлощадь, 0)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|										ТОГДА ЕСТЬNULL(ТаблицаПроживающих.КоличествоПроживающих, 0)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|													ИЛИ ТаблицаСведенийПоЛС.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|												ТОГДА ЕСТЬNULL(ТаблицаСведенийПоЛС.КоличествоЕдиницПотребления, 0)
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, 0) КАК ДоляЛСФакт,
	|	ЕСТЬNULL(ТаблицаНорм.Тариф, 0) КАК Тариф
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|		бит_РаспределенияНаУслугахСрезПоследних.Услуга КАК Услуга,
	|		бит_РаспределенияНаУслугахСрезПоследних.Распределение КАК Распределение,
	|		бит_РаспределенияОстатки.СуммаОстаток КАК КоличествоЕдиниц
	|	ИЗ
	|		РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	|				&Момент,
	|				Объект В (&СписокЗданий)
	|					И ЛицевойСчет В (&СписокЛС)) КАК бит_РаспределенияНаУслугахСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_Распределения.Остатки(&Момент, Объект В (&СписокЗданий)) КАК бит_РаспределенияОстатки
	|			ПО бит_РаспределенияНаУслугахСрезПоследних.Объект = бит_РаспределенияОстатки.Объект
	|				И бит_РаспределенияНаУслугахСрезПоследних.Услуга = бит_РаспределенияОстатки.Услуга
	|				И бит_РаспределенияНаУслугахСрезПоследних.Распределение = бит_РаспределенияОстатки.Распределение
	|	ГДЕ
	|		бит_РаспределенияНаУслугахСрезПоследних.Использовать = ИСТИНА) КАК ПоказанияСчетчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНорм КАК ТаблицаНорм
	|		ПО ПоказанияСчетчиков.ЛицевойСчет = ТаблицаНорм.ЛицевойСчет
	|			И ПоказанияСчетчиков.Услуга = ТаблицаНорм.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроживающих КАК ТаблицаПроживающих
	|		ПО ПоказанияСчетчиков.ЛицевойСчет = ТаблицаПроживающих.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСведенийПоЛС КАК ТаблицаСведенийПоЛС
	|		ПО ПоказанияСчетчиков.ЛицевойСчет = ТаблицаСведенийПоЛС.ЛицевойСчет
	|			И ПоказанияСчетчиков.Услуга = ТаблицаСведенийПоЛС.Услуга
	|ИТОГИ
	|	СУММА(ДоляЛС),
	|	СУММА(ДоляЛСФакт)
	|ПО
	|	Услуга,
	|	Распределение,
	|	ЛицевойСчет";
	
	ТаблицаПогрешностей = Новый ТаблицаЗначений;
	ТаблицаПогрешностей.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПогрешностей.Колонки.Добавить("Сумма"      , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	
	ВыборкаУслуг  = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаУслуг.Следующий() Цикл
		
		ВыборкаРасп = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРасп.Следующий() Цикл 
			
			ТаблицаПогрешностей.Очистить();
			
			МассивУслуг  = Новый Массив;
			ИтогСумма     = 0;
			ПлановаяСумма = 0;
			Распределение = ВыборкаРасп.Распределение;
			
			ВыборкаЛС = ВыборкаРасп.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЛС.Следующий() Цикл 
				
				Выборка = ВыборкаЛС.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					Если ВыборкаРасп.ДоляЛС = 0 Тогда
						
						Индекс = МассивУслуг.Найти(Выборка.Услуга);
						Значение = ?(Индекс = Неопределено, Неопределено, МассивУслуг.Получить(Индекс));
						
						Если Значение <> Выборка.Услуга Тогда						
							Текст = " Установите ставку для услуги """ + Выборка.Услуга + """ по способу расчета ""по распределению"". Распределение: """+ Выборка.Распределение +""".";
							
							бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
							
							МассивУслуг.Добавить(Выборка.Услуга);
							
						КонецЕсли;
						
						Единицы   = 0;
						Сумма     = 0;
						
					Иначе
						
						Единицы 	= Окр(Выборка.КоличествоЕдиниц*Выборка.ДоляЛС/ВыборкаРасп.ДоляЛС,4,1); 
						
						// БИТ_ЖКХ 27.05.2014
						// Сумма 		= Окр(Единицы*Выборка.ПлановаяСтавка,4,1);.
						Сумма 		= Окр(Единицы*Выборка.ПлановаяСтавка,2,1);
						// БИТ_ЖКХ 27.05.2014
						
						ИтогСумма 	= ИтогСумма + Сумма;
						
					КонецЕсли; 
					
					Если СписокЛС.Найти(Выборка.ЛицевойСчет) = Неопределено   Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					СтрокаПогрешности = ТаблицаПогрешностей.Добавить();
					СтрокаПогрешности.ЛицевойСчет = Выборка.ЛицевойСчет;
					СтрокаПогрешности.Сумма       = Сумма;
					
					МассивСтрок = ТаблицаРаспределений.НайтиСтроки(Новый Структура("ЛицевойСчет,Услуга",Выборка.ЛицевойСчет,Выборка.Услуга));
					
					Если МассивСтрок.количество() = 0 тогда	
						
						НовСтрока = ТаблицаРаспределений.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
						НовСтрока.КоличествоЕдиниц     = Выборка.КоличествоЕдиниц;
						НовСтрока.КоличествоЕдиницПоЛС = Единицы;
						НовСтрока.Факт                 = Единицы;
						НовСтрока.Начислено            = Сумма;
						НовСтрока.Доля                 = ВыборкаРасп.ДоляЛСФакт;
						НовСтрока.ДоляПоЛС             = Выборка.ДоляЛСФакт;
						НовСтрока.Ставка               = Выборка.Ставка;
						
						// БИТ_ЖКХ 27.05.2014
						// ПлановаяСумма = Окр(Выборка.КоличествоЕдиниц*Выборка.ПлановаяСтавка,4,1);.
						ПлановаяСумма = Окр(Выборка.КоличествоЕдиниц*Выборка.ПлановаяСтавка,2,1);
						// БИТ_ЖКХ 27.05.2014
						
						Если НЕ Выборка.Тариф = 0 Тогда
							// БИТ_ЖКХ 02.03.2017 16:21:41 Начало правки...
							//НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,4);
							Если РасчетОбъемовДоТретьегоЗнака Тогда
								НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,3);
							Иначе
								НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,4);
							КонецЕсли;
							// БИТ_ЖКХ 02.03.2017 16:21:41 Конец правки.
						КонецЕсли;
						
					иначе
						
						НовСтрока = МассивСтрок[0];
						ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
						НовСтрока.КоличествоЕдиниц     = Выборка.КоличествоЕдиниц;
						НовСтрока.КоличествоЕдиницПоЛС = Единицы;
						НовСтрока.Факт                 = Единицы;
						НовСтрока.Начислено            = Сумма;
						НовСтрока.Доля                 = ВыборкаРасп.ДоляЛСФакт;
						НовСтрока.ДоляПоЛС             = Выборка.ДоляЛСФакт;
						НовСтрока.Ставка               = Выборка.Ставка;
						
						// БИТ_ЖКХ 27.05.2014
						// ПлановаяСумма = Окр(Выборка.КоличествоЕдиниц*Выборка.ПлановаяСтавка,4,1);.
						ПлановаяСумма = Окр(Выборка.КоличествоЕдиниц*Выборка.ПлановаяСтавка,2,1);
						// БИТ_ЖКХ 27.05.2014
						
						Если НЕ Выборка.Тариф = 0 Тогда
							// БИТ_ЖКХ 02.03.2017 16:20:45 Начало правки...
							//НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,4);
							Если РасчетОбъемовДоТретьегоЗнака Тогда
								НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,3);
							Иначе
								НовСтрока.Объем = Окр(Сумма/Выборка.Тариф,4);
							КонецЕсли;
							// БИТ_ЖКХ 02.03.2017 16:20:45 Конец правки.
						КонецЕсли;
						
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЦикла;
			Если НЕ ЭтоЛС Тогда
				
				Погрешность = ПлановаяСумма - ИтогСумма;
				
				Если Погрешность <> 0 Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Распределение", ВыборкаРасп.Распределение);
					ТаблицаПогрешностей.Сортировать("Сумма Убыв");
					Если ТаблицаПогрешностей.Количество() > 0 Тогда
						
						Отбор.Вставить("ЛицевойСчет", ТаблицаПогрешностей[0].ЛицевойСчет);
						
						Строки = ТаблицаРаспределений.НайтиСтроки(Отбор);
						Если Строки.Количество() > 0 тогда 
							Строки[0].Начислено = Строки[0].Начислено + Погрешность;
							
						КонецЕсли;
						
					КонецЕсли; 
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОбъектСравнения = Новый СравнениеЗначений;
	ТаблицаРаспределений.Сортировать("ЛицевойСчет Возр, Приоритет Убыв", ОбъектСравнения);
	
КонецПроцедуры

// Процедура выполняет расчет начислений по Льготам.
//
Процедура РасчитатьНачисленияЛьгот(Дата, Организация, СписокЛС, ТаблицаЛьгот, ТаблицаНачислений = Неопределено, ТаблицаСчетчиков = Неопределено, ТаблицаРаспределений = Неопределено, Запрос, УменьшитьНормуЛьготы = Ложь, ТаблицаПоГрупСИндСчетчиков = Неопределено, РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = Ложь, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = Ложь, Мосэнергосбыт2016 = Ложь)
	
	/////////////////////////////////////////////////////
	/////#1 - Изменения расчета с учетом долей площади.
	
	Если ТаблицаНачислений = Неопределено Тогда
		
		ТаблицаНачислений = ПолучитьТаблицуНачислений(Дата, Организация, СписокЛС);
		
	КонецЕсли; 
	
	Если ТаблицаСчетчиков = Неопределено Тогда
		
		ТаблицаСчетчиков = ПолучитьТаблицуСчетчиков(Дата, Организация, СписокЛС);
		
	КонецЕсли;
	
	Если ТаблицаРаспределений = Неопределено Тогда
		
		ТаблицаРаспределений = ПолучитьТаблицуРаспределений(Дата, Организация, СписокЛС);
		
	КонецЕсли;
	
	Если ТаблицаПоГрупСИндСчетчиков = Неопределено Тогда
		
		ТаблицаПоГрупСИндСчетчиков = ПолучитьТаблицуПоГрупСИндСчетчиков(Дата, Организация, СписокЛС);
		
	КонецЕсли;
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСчетчиков.ЛицевойСчет КАК ЛицевойСчет,
	|	ТаблицаСчетчиков.Услуга,
	|	ТаблицаСчетчиков.Приоритет,
	|	ТаблицаСчетчиков.Норматив КАК Норматив,
	|	ТаблицаСчетчиков.НормаЛьготы КАК НормаЛьготы,
	|	ТаблицаСчетчиков.Факт КАК Факт,
	|	ТаблицаСчетчиков.Ставка КАК Ставка,
	|	ТаблицаСчетчиков.СверхномСтавка КАК СверхномСтавка,
	|	ТаблицаСчетчиков.Начислено КАК Начислено,
	|	ТаблицаСчетчиков.Норма,
	|	ТаблицаСчетчиков.Многотарифный
	|ПОМЕСТИТЬ ТаблицаСчетчиков
	|ИЗ
	|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетчиков.ЛицевойСчет,
	|	ТаблицаСчетчиков.Услуга,
	|	ТаблицаСчетчиков.Приоритет,
	|	МАКСИМУМ(ТаблицаСчетчиков.Норматив) КАК Норматив,
	|	МАКСИМУМ(ТаблицаСчетчиков.НормаЛьготы) КАК НормаЛьготы,
	|	СУММА(ТаблицаСчетчиков.Факт) КАК Факт,
	|	МАКСИМУМ(ТаблицаСчетчиков.Ставка) КАК Ставка,
	|	МАКСИМУМ(ТаблицаСчетчиков.СверхномСтавка) КАК СверхномСтавка,
	|	СУММА(ТаблицаСчетчиков.Начислено) КАК Начислено,
	|	МАКСИМУМ(ТаблицаСчетчиков.Норма) КАК Норма,
	|	МАКСИМУМ(ТаблицаСчетчиков.Многотарифный) КАК Многотарифный,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК СпособРасчета
	|ИЗ
	|	ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСчетчиков.ЛицевойСчет,
	|	ТаблицаСчетчиков.Услуга,
	|	ТаблицаСчетчиков.Приоритет";
	
	Запрос.УстановитьПараметр("ТаблицаСчетчиков", ТаблицаСчетчиков);
	ТаблицаПоСчетчикам = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПоГрупСИндСчетчиков.ЛицевойСчет,
	|	ТаблицаПоГрупСИндСчетчиков.Услуга,
	|	ТаблицаПоГрупСИндСчетчиков.Начислено
	|ПОМЕСТИТЬ ТаблицаГруп
	|ИЗ
	|	&ТаблицаПоГрупСИндСчетчиков КАК ТаблицаПоГрупСИндСчетчиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаГруп.ЛицевойСчет,
	|	ТаблицаГруп.Услуга,
	|	СУММА(ТаблицаГруп.Начислено) КАК Начислено
	|ИЗ
	|	ТаблицаГруп КАК ТаблицаГруп
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаГруп.ЛицевойСчет,
	|	ТаблицаГруп.Услуга";
	Запрос.УстановитьПараметр("ТаблицаПоГрупСИндСчетчиков", ТаблицаПоГрупСИндСчетчиков);
	
	ТаблицаПоГрупСИндСчетчиков = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНачислений.ЛицевойСчет,
	|	ТаблицаНачислений.Услуга,
	|	ТаблицаНачислений.Норматив,
	|	ТаблицаНачислений.НормаЛьготы,
	|	ТаблицаНачислений.Факт,
	|	ТаблицаНачислений.Начислено,
	|	ТаблицаНачислений.СпособРасчета,
	|	ТаблицаНачислений.Приоритет
	|ПОМЕСТИТЬ ТаблицаНачисления
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоСчетчикам.ЛицевойСчет,
	|	ТаблицаПоСчетчикам.Услуга,
	|	ТаблицаПоСчетчикам.Норматив,
	|	ТаблицаПоСчетчикам.НормаЛьготы,
	|	ТаблицаПоСчетчикам.Факт,
	|	ТаблицаПоСчетчикам.Начислено,
	|	ТаблицаПоСчетчикам.СпособРасчета,
	|	ТаблицаПоСчетчикам.Приоритет,
	|	ТаблицаПоСчетчикам.Норма,
	|	ТаблицаПоСчетчикам.Многотарифный
	|ПОМЕСТИТЬ ТаблицаСЧ
	|ИЗ
	|	&ТаблицаПоСчетчикам КАК ТаблицаПоСчетчикам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРаспределения.ЛицевойСчет,
	|	ТаблицаРаспределения.Услуга,
	|	ТаблицаРаспределения.Норматив,
	|	ТаблицаРаспределения.НормаЛьготы,
	|	ТаблицаРаспределения.Факт,
	|	ТаблицаРаспределения.Начислено,
	|	ТаблицаРаспределения.СпособРасчета,
	|	ТаблицаРаспределения.Приоритет
	|ПОМЕСТИТЬ ТаблицаРасп
	|ИЗ
	|	&ТаблицаРаспределений КАК ТаблицаРаспределения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоГрупСИндСчетчиков.ЛицевойСчет,
	|	ТаблицаПоГрупСИндСчетчиков.Услуга,
	|	ТаблицаПоГрупСИндСчетчиков.Начислено
	|ПОМЕСТИТЬ ТаблицаГрупСИнд
	|ИЗ
	|	&ТаблицаПоГрупСИндСчетчиков КАК ТаблицаПоГрупСИндСчетчиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачисления.ЛицевойСчет,
	|	ТаблицаНачисления.Услуга,
	|	ТаблицаНачисления.Норматив,
	|	ТаблицаНачисления.НормаЛьготы,
	|	ТаблицаНачисления.Факт,
	|	ТаблицаНачисления.Начислено,
	|	ТаблицаНачисления.СпособРасчета,
	|	ТаблицаНачисления.Приоритет,
	|	0 КАК Норма,
	|	ЛОЖЬ КАК Многотарифный
	|ПОМЕСТИТЬ ТемпТаблицаНачислений
	|ИЗ
	|	ТаблицаНачисления КАК ТаблицаНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСЧ.ЛицевойСчет,
	|	ТаблицаСЧ.Услуга,
	|	ТаблицаСЧ.Норматив,
	|	ТаблицаСЧ.НормаЛьготы,
	|	ТаблицаСЧ.Факт,
	|	ТаблицаСЧ.Начислено,
	|	ТаблицаСЧ.СпособРасчета,
	|	ТаблицаСЧ.Приоритет,
	|	ТаблицаСЧ.Норма,
	|	ТаблицаСЧ.Многотарифный
	|ИЗ
	|	ТаблицаСЧ КАК ТаблицаСЧ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРасп.ЛицевойСчет,
	|	ТаблицаРасп.Услуга,
	|	ТаблицаРасп.Норматив,
	|	ТаблицаРасп.НормаЛьготы,
	|	ТаблицаРасп.Факт,
	|	ТаблицаРасп.Начислено,
	|	ТаблицаРасп.СпособРасчета,
	|	ТаблицаРасп.Приоритет,
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	ТаблицаРасп КАК ТаблицаРасп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТемпТаблицаНачислений.ЛицевойСчет,
	|	ТемпТаблицаНачислений.Услуга,
	|	ТемпТаблицаНачислений.Норматив,
	|	ТемпТаблицаНачислений.НормаЛьготы,
	|	ТемпТаблицаНачислений.Факт,
	|	ЕСТЬNULL(ТемпТаблицаНачислений.Начислено, 0) + ЕСТЬNULL(ТаблицаГрупСИнд.Начислено, 0) КАК Начислено,
	|	ТемпТаблицаНачислений.СпособРасчета,
	|	ТемпТаблицаНачислений.Приоритет,
	|	ТемпТаблицаНачислений.Норма,
	|	ТемпТаблицаНачислений.Многотарифный
	|ПОМЕСТИТЬ ТаблицаНач
	|ИЗ
	|	ТемпТаблицаНачислений КАК ТемпТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаГрупСИнд КАК ТаблицаГрупСИнд
	|		ПО ТемпТаблицаНачислений.ЛицевойСчет = ТаблицаГрупСИнд.ЛицевойСчет
	|			И ТемпТаблицаНачислений.Услуга = ТаблицаГрупСИнд.Услуга";
	
	
	Запрос.УстановитьПараметр("ТаблицаНачислений"         , ТаблицаНачислений);
	Запрос.УстановитьПараметр("ТаблицаПоСчетчикам"        , ТаблицаПоСчетчикам);
	Запрос.УстановитьПараметр("ТаблицаРаспределений"      , ТаблицаРаспределений);
	Запрос.УстановитьПараметр("ТаблицаПоГрупСИндСчетчиков", ТаблицаПоГрупСИндСчетчиков);
	
	Запрос.Выполнить();
	
	// БИТ_ЖКХ 03.02.2016 12:27:14 Начало правки... 
	Если Дата >= Дата('20160101') И Мосэнергосбыт2016 Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаНач.Услуга КАК Услуга,
		|	ТаблицаНач.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаНач.Норматив КАК Норматив,
		|	ТаблицаНач.НормаЛьготы КАК НормаЛьготы,
		|	ТаблицаНач.Факт КАК Факт,
		|	ТаблицаНач.Начислено КАК Начислено,
		|	ТаблицаНач.СпособРасчета КАК СпособРасчета,
		|	ТаблицаНач.Приоритет КАК Приоритет,
		|	ТаблицаНач.Норма КАК Норма,
		|	ТаблицаНач.Многотарифный КАК Многотарифный
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	ТаблицаНач КАК ТаблицаНач
		|ГДЕ
		|	ЕСТЬNULL(ТаблицаНач.Начислено, 0) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Услуга,
		|	ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_УстановкаЛьготСрезПоследних.Услуга КАК Услуга,
		|	ТаблицаЛьгот.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаЛьгот.ФизЛицо КАК ФизЛицо,
		|	ТаблицаЛьгот.Льгота КАК Льгота,
		|	бит_УстановкаЛьготСрезПоследних.СемейнаяСтавка КАК СемейнаяСтавка,
		|	бит_УстановкаЛьготСрезПоследних.ЛичнаяСтавка КАК ЛичнаяСтавка,
		|	бит_УстановкаЛьготСрезПоследних.Распространение КАК Распространение,
		|	ТаблицаЛьгот.НачислятьПоНорме КАК НачислятьПоНорме,
		|	ТаблицаЛьгот.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
		|	бит_УстановкаЛьготСрезПоследних.ИспользоватьНормуНаОдного КАК ИспользоватьНормуНаОдного,
		|	бит_УстановкаЛьготСрезПоследних.РасчетСУчетомДолейВладения КАК РасчетСУчетомДолейВладения,
		|	бит_УстановкаЛьготСрезПоследних.РасчетСУчетомСоставаСемьи КАК РасчетСУчетомСоставаСемьи,
		|	ТаблицаЛьгот.ДоляПлощади КАК ДоляПлощади,
		|	ТаблицаЛьгот.ПравоНаЛьготы КАК ПравоНаЛьготы,
		|	бит_УстановкаЛьготСрезПоследних.ФактическоеПотреблениеПоСчетчикамБезУчетаВременноПроживающих КАК ФактПотребПоСЧБезУчетаВременноПрож
		|ПОМЕСТИТЬ ВТ_ЛьготыНаУс
		|ИЗ
		|	ТаблицаЛьгот КАК ТаблицаЛьгот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановкаЛьгот.СрезПоследних(
		|				&Момент,
		|				Льгота В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ТаблицаЛьгот.Льгота
		|					ИЗ
		|						ТаблицаЛьгот)) КАК бит_УстановкаЛьготСрезПоследних
		|		ПО ТаблицаЛьгот.Льгота = бит_УстановкаЛьготСрезПоследних.Льгота
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Услуга,
		|	ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_Начисления.Услуга КАК Услуга,
		|	ВТ_Начисления.Приоритет КАК ПриоритетСч,
		|	ВТ_ЛьготыНаУс.ФизЛицо КАК ФизЛицо,
		|	ВТ_Начисления.Норматив,
		|	ВТ_Начисления.НормаЛьготы,
		|	ВТ_Начисления.Факт КАК Факт,
		|	ВТ_ЛьготыНаУс.Льгота КАК Льгота,
		|	ВТ_ЛьготыНаУс.НачислятьПоНорме,
		|	ВТ_ЛьготыНаУс.ПроживаниеВДанныйМомент,
		|	ВТ_Начисления.СпособРасчета КАК СпособРасчета,
		|	ЕСТЬNULL(ВТ_ЛьготыНаУс.СемейнаяСтавка, 0) КАК СемейнаяСтавка,
		|	ЕСТЬNULL(ВТ_ЛьготыНаУс.ЛичнаяСтавка, 0) КАК ЛичнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ЕСТЬNULL(ТаблицаНорм.ЛьготнаяСтавка, 0) КАК ЛьготнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ЕСТЬNULL(ВТ_ЛьготыНаУс.ИспользоватьНормуНаОдного, ЛОЖЬ) КАК ИспользоватьНормуНаОдного,
		|	ЕСТЬNULL(ТаблицаНорм.НаДвоих, 0) КАК НаДвоих,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью, 0) КАК НаСемью,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью4, 0) КАК НаСемью4,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью5, 0) КАК НаСемью5,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью6, 0) КАК НаСемью6,
		|	ЕСТЬNULL(ТаблицаНорм.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
		|	ЕСТЬNULL(ТаблицаНорм.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
		|	ЕСТЬNULL(ТаблицаНорм.ИспользоватьДопНормуНаОдного, 0) КАК ИспользоватьДопНормуНаОдного,
		|	ЕСТЬNULL(ТаблицаНорм.ИспользоватьДопНормуНаЛьготника, 0) КАК ИспользоватьДопНормуНаЛьготника,
		|	ЕСТЬNULL(ТаблицаПроживающих.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
		|	ЕСТЬNULL(ТаблицаПроживающих.мКоличествоПоНормеЛьгота, 0) КАК мКоличествоПоНормеЛьгота,
		|	ВТ_ЛьготыНаУс.Распространение КАК Распространение,
		|	ЕСТЬNULL(ТаблицаНорм.Ставка, 0) КАК Ставка,
		|	ЕСТЬNULL(ТаблицаНорм.НаОдного, 0) КАК НаОдного,
		|	ЕСТЬNULL(ТаблицаПроживающих.мКоличествоПоНормеЛьгота, 0) КАК КоличествоНосителей,
		|	ЕСТЬNULL(ВТ_Начисления.Начислено, 0) КАК Начислено,
		|	ТаблицаНорм.НормативПотребленияПоКу,
		|	ТаблицаНорм.ОсновнаяСтавка,
		|	ВЫБОР
		|		КОГДА (ВТ_Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
		|				ИЛИ ВТ_Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
		|				ИЛИ ВТ_Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади))
		|				И ВТ_ЛьготыНаУс.РасчетСУчетомДолейВладения
		|			ТОГДА ЕСТЬNULL(ВТ_Начисления.Факт, 0) * ЕСТЬNULL(ВТ_ЛьготыНаУс.ДоляПлощади, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДоляПлощади,
		|	ЕСТЬNULL(ТаблицаНорм.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
		|	ТаблицаНорм.ОсновнойСпособРасчета,
		|	ЕСТЬNULL(ВТ_Начисления.Норма, 0) КАК Норма,
		|	ЕСТЬNULL(ВТ_Начисления.Многотарифный, ЛОЖЬ) КАК Многотарифный,
		|	ВТ_ЛьготыНаУс.РасчетСУчетомДолейВладения,
		|	ТаблицаПроживающих.ДоляПлощадиПоЛьготам,
		|	ВТ_ЛьготыНаУс.РасчетСУчетомСоставаСемьи,
		|	ВТ_ЛьготыНаУс.ПравоНаЛьготы,
		|	ЕСТЬNULL(ВТ_ЛьготыНаУс.ФактПотребПоСЧБезУчетаВременноПрож, ЛОЖЬ) КАК ФактПотребПоСЧБезУчетаВременноПрож
		|ПОМЕСТИТЬ ВТ_ВсеЛьготы
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛьготыНаУс КАК ВТ_ЛьготыНаУс
		|		ПО ВТ_Начисления.Услуга = ВТ_ЛьготыНаУс.Услуга
		|			И ВТ_Начисления.ЛицевойСчет = ВТ_ЛьготыНаУс.ЛицевойСчет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНорм КАК ТаблицаНорм
		|		ПО ВТ_Начисления.Услуга = ТаблицаНорм.Услуга
		|			И ВТ_Начисления.ЛицевойСчет = ТаблицаНорм.ЛицевойСчет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроживающих КАК ТаблицаПроживающих
		|		ПО ВТ_Начисления.ЛицевойСчет = ТаблицаПроживающих.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеЛьготы.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_ВсеЛьготы.Услуга КАК Услуга,
		|	ВТ_ВсеЛьготы.ПриоритетСч,
		|	ВТ_ВсеЛьготы.ФизЛицо,
		|	ВТ_ВсеЛьготы.Норматив,
		|	ВТ_ВсеЛьготы.НормаЛьготы,
		|	ВТ_ВсеЛьготы.Факт КАК Факт,
		|	ВТ_ВсеЛьготы.Льгота КАК Льгота,
		|	ВТ_ВсеЛьготы.НачислятьПоНорме,
		|	ВТ_ВсеЛьготы.ПроживаниеВДанныйМомент,
		|	ВТ_ВсеЛьготы.СпособРасчета КАК СпособРасчета,
		|	ВТ_ВсеЛьготы.СемейнаяСтавка КАК СемейнаяСтавка,
		|	ВТ_ВсеЛьготы.ЛичнаяСтавка КАК ЛичнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ВТ_ВсеЛьготы.ЛьготнаяСтавка КАК ЛьготнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ВТ_ВсеЛьготы.ИспользоватьНормуНаОдного,
		|	ВТ_ВсеЛьготы.НаДвоих,
		|	ВТ_ВсеЛьготы.НаСемью,
		|	ВТ_ВсеЛьготы.НаСемью4,
		|	ВТ_ВсеЛьготы.НаСемью5,
		|	ВТ_ВсеЛьготы.НаСемью6,
		|	ВТ_ВсеЛьготы.ДопНормаНаСемью,
		|	ВТ_ВсеЛьготы.ДопНормаНаКаждого,
		|	ВТ_ВсеЛьготы.ИспользоватьДопНормуНаОдного,
		|	ВТ_ВсеЛьготы.ИспользоватьДопНормуНаЛьготника,
		|	ВТ_ВсеЛьготы.КоличествоПроживающих КАК КоличествоПроживающих,
		|	ВТ_ВсеЛьготы.мКоличествоПоНормеЛьгота,
		|	ВТ_ВсеЛьготы.Распространение КАК Распространение,
		|	ВТ_ВсеЛьготы.Ставка,
		|	ВТ_ВсеЛьготы.НаОдного,
		|	ВТ_ВсеЛьготы.КоличествоНосителей,
		|	ВТ_ВсеЛьготы.Начислено КАК Начислено,
		|	ВТ_ВсеЛьготы.НормативПотребленияПоКу,
		|	ВТ_ВсеЛьготы.ОсновнаяСтавка,
		|	ВТ_ВсеЛьготы.ДоляПлощади,
		|	ВТ_ВсеЛьготы.НаЛицевойСчет,
		|	ВТ_ВсеЛьготы.ОсновнойСпособРасчета,
		|	ВТ_ВсеЛьготы.Норма,
		|	ВТ_ВсеЛьготы.Многотарифный,
		|	ВТ_ВсеЛьготы.РасчетСУчетомДолейВладения,
		|	ВТ_ВсеЛьготы.ДоляПлощадиПоЛьготам,
		|	ВТ_ВсеЛьготы.РасчетСУчетомСоставаСемьи,
		|	ВТ_ВсеЛьготы.ПравоНаЛьготы,
		|	ВТ_ВсеЛьготы.ФактПотребПоСЧБезУчетаВременноПрож
		|ИЗ
		|	ВТ_ВсеЛьготы КАК ВТ_ВсеЛьготы
		|ГДЕ
		|	НЕ ВТ_ВсеЛьготы.Многотарифный
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВсеЛьготы.ЛицевойСчет
		|ИТОГИ
		|	МАКСИМУМ(Факт),
		|	МАКСИМУМ(СпособРасчета),
		|	МАКСИМУМ(СемейнаяСтавка),
		|	МАКСИМУМ(ЛичнаяСтавка),
		|	МАКСИМУМ(КоличествоПроживающих),
		|	МАКСИМУМ(Распространение),
		|	МАКСИМУМ(Начислено)
		|ПО
		|	ЛицевойСчет,
		|	Льгота,
		|	Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеЛьготы.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_ВсеЛьготы.Услуга КАК Услуга,
		|	ВТ_ВсеЛьготы.ПриоритетСч,
		|	ВТ_ВсеЛьготы.ФизЛицо,
		|	ВТ_ВсеЛьготы.Норматив,
		|	ВТ_ВсеЛьготы.НормаЛьготы,
		|	ВТ_ВсеЛьготы.Факт КАК Факт,
		|	ВТ_ВсеЛьготы.Льгота КАК Льгота,
		|	ВТ_ВсеЛьготы.НачислятьПоНорме,
		|	ВТ_ВсеЛьготы.ПроживаниеВДанныйМомент,
		|	ВТ_ВсеЛьготы.СпособРасчета КАК СпособРасчета,
		|	ВТ_ВсеЛьготы.СемейнаяСтавка КАК СемейнаяСтавка,
		|	ВТ_ВсеЛьготы.ЛичнаяСтавка КАК ЛичнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ВТ_ВсеЛьготы.ЛьготнаяСтавка КАК ЛьготнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ВТ_ВсеЛьготы.ИспользоватьНормуНаОдного,
		|	ВТ_ВсеЛьготы.НаДвоих,
		|	ВТ_ВсеЛьготы.НаСемью,
		|	ВТ_ВсеЛьготы.НаСемью4,
		|	ВТ_ВсеЛьготы.НаСемью5,
		|	ВТ_ВсеЛьготы.НаСемью6,
		|	ВТ_ВсеЛьготы.ДопНормаНаСемью,
		|	ВТ_ВсеЛьготы.ДопНормаНаКаждого,
		|	ВТ_ВсеЛьготы.ИспользоватьДопНормуНаОдного,
		|	ВТ_ВсеЛьготы.ИспользоватьДопНормуНаЛьготника,
		|	ВТ_ВсеЛьготы.КоличествоПроживающих КАК КоличествоПроживающих,
		|	ВТ_ВсеЛьготы.мКоличествоПоНормеЛьгота,
		|	ВТ_ВсеЛьготы.Распространение КАК Распространение,
		|	ВТ_ВсеЛьготы.Ставка,
		|	ВТ_ВсеЛьготы.НаОдного,
		|	ВТ_ВсеЛьготы.КоличествоНосителей,
		|	ВТ_ВсеЛьготы.Начислено КАК Начислено,
		|	ВТ_ВсеЛьготы.НормативПотребленияПоКу,
		|	ВТ_ВсеЛьготы.ОсновнаяСтавка,
		|	ВТ_ВсеЛьготы.ДоляПлощади,
		|	ВТ_ВсеЛьготы.НаЛицевойСчет,
		|	ВТ_ВсеЛьготы.ОсновнойСпособРасчета,
		|	ВТ_ВсеЛьготы.Норма,
		|	ВТ_ВсеЛьготы.Многотарифный,
		|	ВТ_ВсеЛьготы.РасчетСУчетомДолейВладения,
		|	ВТ_ВсеЛьготы.ДоляПлощадиПоЛьготам,
		|	ВТ_ВсеЛьготы.РасчетСУчетомСоставаСемьи,
		|	ВТ_ВсеЛьготы.ПравоНаЛьготы,
		|	ВТ_ВсеЛьготы.ФактПотребПоСЧБезУчетаВременноПрож
		|ИЗ
		|	ВТ_ВсеЛьготы КАК ВТ_ВсеЛьготы
		|ГДЕ
		|	ВТ_ВсеЛьготы.Многотарифный
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВсеЛьготы.ЛицевойСчет,
		|	ВТ_ВсеЛьготы.ПриоритетСч,
		|	ВТ_ВсеЛьготы.ФизЛицо
		|ИТОГИ
		|	МАКСИМУМ(Факт),
		|	МАКСИМУМ(СпособРасчета),
		|	МАКСИМУМ(СемейнаяСтавка),
		|	МАКСИМУМ(ЛичнаяСтавка),
		|	МАКСИМУМ(КоличествоПроживающих),
		|	МАКСИМУМ(Распространение),
		|	МАКСИМУМ(Начислено)
		|ПО
		|	ЛицевойСчет,
		|	Услуга";
		//|	Льгота";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		Результат = МассивРезультатов[3];
		РезультатМноготарифные = МассивРезультатов[4];
		
	Иначе	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.ЛицевойСчет КАК ЛицевойСчет,
		|	Начисления.Услуга КАК Услуга,
		|	ЛьготыНаУс.ФизЛицо КАК ФизЛицо,
		|	Начисления.Норматив,
		|	Начисления.НормаЛьготы,
		|	Начисления.Факт КАК Факт,
		|	ЛьготыНаУс.Льгота КАК Льгота,
		|	ЛьготыНаУс.НачислятьПоНорме,
		|	ЛьготыНаУс.ПроживаниеВДанныйМомент,
		|	Начисления.СпособРасчета КАК СпособРасчета,
		|	ЕСТЬNULL(ЛьготыНаУс.СемейнаяСтавка, 0) КАК СемейнаяСтавка,
		|	ЕСТЬNULL(ЛьготыНаУс.ЛичнаяСтавка, 0) КАК ЛичнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ЕСТЬNULL(ТаблицаНорм.ЛьготнаяСтавка, 0) КАК ЛьготнаяСтавка,
		// БИТ_ЖКХ_07072015 ++
		|	ЕСТЬNULL(ЛьготыНаУс.ИспользоватьНормуНаОдного, ЛОЖЬ) КАК ИспользоватьНормуНаОдного,
		|	ЕСТЬNULL(ТаблицаНорм.НаДвоих, 0) КАК НаДвоих,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью, 0) КАК НаСемью,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью4, 0) КАК НаСемью4,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью5, 0) КАК НаСемью5,
		|	ЕСТЬNULL(ТаблицаНорм.НаСемью6, 0) КАК НаСемью6,
		|	ЕСТЬNULL(ТаблицаНорм.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
		|	ЕСТЬNULL(ТаблицаНорм.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
		|	ЕСТЬNULL(ТаблицаНорм.ИспользоватьДопНормуНаОдного, 0) КАК ИспользоватьДопНормуНаОдного,
		|	ЕСТЬNULL(ТаблицаНорм.ИспользоватьДопНормуНаЛьготника, 0) КАК ИспользоватьДопНормуНаЛьготника,
		|	ЕСТЬNULL(ТаблицаПроживающих.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
		|	ЕСТЬNULL(ТаблицаПроживающих.мКоличествоПоНормеЛьгота, 0) КАК мКоличествоПоНормеЛьгота,
		|	ЛьготыНаУс.Распространение КАК Распространение,
		|	ЕСТЬNULL(ТаблицаНорм.Ставка, 0) КАК Ставка,
		|	ЕСТЬNULL(ТаблицаНорм.НаОдного, 0) КАК НаОдного,
		|	ЕСТЬNULL(ТаблицаПроживающих.мКоличествоПоНормеЛьгота, 0) КАК КоличествоНосителей,
		|	ЕСТЬNULL(Начисления.Начислено, 0) КАК Начислено,
		// БИТ_ЖКХ_29112013_начало_изменений
		|	ТаблицаНорм.НормативПотребленияПоКу,
		// БИТ_ЖКХ_29112013_начало_изменений
		|	ТаблицаНорм.ОсновнаяСтавка,
		|	ВЫБОР
		|		КОГДА (Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
		|				ИЛИ Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
		|				ИЛИ Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади))
		|				И ЛьготыНаУс.РасчетСУчетомДолейВладения
		|			ТОГДА ЕСТЬNULL(Начисления.Факт, 0) * ЕСТЬNULL(ЛьготыНаУс.ДоляПлощади, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДоляПлощади,
		|	ЕСТЬNULL(ТаблицаНорм.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
		|	ТаблицаНорм.ОсновнойСпособРасчета,
		|	ЕСТЬNULL(Начисления.Норма, 0) КАК Норма,
		|	ЕСТЬNULL(Начисления.Многотарифный, ЛОЖЬ) КАК Многотарифный,
		|	ЛьготыНаУс.РасчетСУчетомДолейВладения,
		|	ТаблицаПроживающих.ДоляПлощадиПоЛьготам,
		|	ЛьготыНаУс.РасчетСУчетомСоставаСемьи,
		|	ЛьготыНаУс.ПравоНаЛьготы,
		|	ЕСТЬNULL(ЛьготыНаУс.ФактПотребПоСЧБезУчетаВременноПрож, ЛОЖЬ) КАК ФактПотребПоСЧБезУчетаВременноПрож
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаНач.Услуга КАК Услуга,
		|		ТаблицаНач.Норматив КАК Норматив,
		|		ТаблицаНач.НормаЛьготы КАК НормаЛьготы,
		|		ТаблицаНач.Факт КАК Факт,
		|		ТаблицаНач.Начислено КАК Начислено,
		|		ТаблицаНач.СпособРасчета КАК СпособРасчета,
		|		ТаблицаНач.Приоритет КАК Приоритет,
		|		ТаблицаНач.ЛицевойСчет КАК ЛицевойСчет,
		|		ТаблицаНач.Норма КАК Норма,
		|		ТаблицаНач.Многотарифный КАК Многотарифный
		|	ИЗ
		|		ТаблицаНач КАК ТаблицаНач
		|	ГДЕ
		|		ЕСТЬNULL(ТаблицаНач.Начислено, 0) > 0) КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТаблицаЛьгот.ЛицевойСчет КАК ЛицевойСчет,
		|			ТаблицаЛьгот.ФизЛицо КАК ФизЛицо,
		|			ТаблицаЛьгот.Льгота КАК Льгота,
		|			бит_УстановкаЛьготСрезПоследних.Услуга КАК Услуга,
		|			бит_УстановкаЛьготСрезПоследних.СемейнаяСтавка КАК СемейнаяСтавка,
		|			бит_УстановкаЛьготСрезПоследних.ЛичнаяСтавка КАК ЛичнаяСтавка,
		|			бит_УстановкаЛьготСрезПоследних.Распространение КАК Распространение,
		|			ТаблицаЛьгот.НачислятьПоНорме КАК НачислятьПоНорме,
		|			ТаблицаЛьгот.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
		|			бит_УстановкаЛьготСрезПоследних.ИспользоватьНормуНаОдного КАК ИспользоватьНормуНаОдного,
		|			бит_УстановкаЛьготСрезПоследних.РасчетСУчетомДолейВладения КАК РасчетСУчетомДолейВладения,
		|			бит_УстановкаЛьготСрезПоследних.РасчетСУчетомСоставаСемьи КАК РасчетСУчетомСоставаСемьи,
		|			ТаблицаЛьгот.ДоляПлощади КАК ДоляПлощади,
		|			ТаблицаЛьгот.ПравоНаЛьготы КАК ПравоНаЛьготы,
		|			бит_УстановкаЛьготСрезПоследних.ФактическоеПотреблениеПоСчетчикамБезУчетаВременноПроживающих КАК ФактПотребПоСЧБезУчетаВременноПрож
		|		ИЗ
		|			ТаблицаЛьгот КАК ТаблицаЛьгот
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановкаЛьгот.СрезПоследних(&Момент, ) КАК бит_УстановкаЛьготСрезПоследних
		|				ПО ТаблицаЛьгот.Льгота = бит_УстановкаЛьготСрезПоследних.Льгота) КАК ЛьготыНаУс
		|		ПО Начисления.Услуга = ЛьготыНаУс.Услуга
		|			И Начисления.ЛицевойСчет = ЛьготыНаУс.ЛицевойСчет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНорм КАК ТаблицаНорм
		|		ПО Начисления.Услуга = ТаблицаНорм.Услуга
		|			И Начисления.ЛицевойСчет = ТаблицаНорм.ЛицевойСчет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроживающих КАК ТаблицаПроживающих
		|		ПО Начисления.ЛицевойСчет = ТаблицаПроживающих.ЛицевойСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет
		|ИТОГИ
		|	МАКСИМУМ(Факт),
		|	МАКСИМУМ(СпособРасчета),
		|	МАКСИМУМ(СемейнаяСтавка),
		|	МАКСИМУМ(ЛичнаяСтавка),
		|	МАКСИМУМ(КоличествоПроживающих),
		|	МАКСИМУМ(Распространение),
		|	МАКСИМУМ(Начислено)
		|ПО
		|	ЛицевойСчет,
		|	Льгота,
		|	Услуга";
		
		Результат = Запрос.Выполнить();
	КонецЕсли;	
	
	// Ставка
	//|	ВЫБОР
	//|	КОГДА Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)
	//|			ИЛИ Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению)
	//|		ТОГДА ЕСТЬNULL(ТаблицаНорм.ОсновнаяСтавка, 0)
	//|	ИНАЧЕ ЕСТЬNULL(ТаблицаНорм.Ставка, 0)
	//|	КОНЕЦ
	
	ТекстЗапросаСемейнойЛьготы =
	"ВЫБРАТЬ
	|	ТаблицаФизЛиц.ЛицевойСчет,
	|	ТаблицаФизЛиц.ФизЛицо,
	|	ТаблицаФизЛиц.ПравоНаЛьготы,
	|	ТаблицаФизЛиц.НачислятьПоНорме,
	|	ТаблицаФизЛиц.ПроживаниеВДанныйМомент,
	|	ТаблицаФизЛиц.ДоляПлощади,
	|	ВЫБОР
	|		КОГДА ТаблицаФизЛиц.ПравоНаЛьготы
	|				И ТаблицаФизЛиц.НачислятьПоНорме
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоНормеЛьгота
	|ИЗ
	|	ТаблицаФизЛиц КАК ТаблицаФизЛиц
	|ГДЕ
	|	ТаблицаФизЛиц.ЛицевойСчет = &ЛицевойСчет
	|	И ТаблицаФизЛиц.ФизЛицо <> &ФизЛицо
	|	И ВЫБОР
	|			КОГДА &РасчетСУчетомСоставаСемьи
	|				ТОГДА ТаблицаФизЛиц.ФизЛицо В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							бит_СоставСемьиЛьготника.ПолучательЛьготы
	|						ИЗ
	|							РегистрСведений.бит_СписокСемейнойЛьготы КАК бит_СоставСемьиЛьготника
	|						ГДЕ
	|							бит_СоставСемьиЛьготника.ЛицевойСчет = &ЛицевойСчет
	|							И бит_СоставСемьиЛьготника.ВладелецЛьготы = &ФизЛицо
	|							И бит_СоставСемьиЛьготника.Льгота = &Льгота)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|ИТОГИ
	|	СУММА(КоличествоПоНормеЛьгота)
	|ПО
	|	ОБЩИЕ";
	
	// БИТ_ЖКХ 18.02.2016 16:10:16 Начало правки... 
	//Результат = Запрос.Выполнить();
	// БИТ_ЖКХ 18.02.2016 16:10:17 Конец правки. 
	ВыборкаЛС = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛС.Следующий() Цикл
		
		ВыборкаЛьготы    = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЛьготы.Следующий() Цикл
			
			ВыборкаУслуга = ВыборкаЛьготы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаУслуга.Следующий() Цикл
				
				// Пересчет погрешности Начало:{
				ПогрешностьНачислений = 0;
				ПогрешностьФакта      = 0;
				
				КоличествоПроживающих = ?(ВыборкаУслуга.КоличествоПроживающих = 0, 1, ВыборкаУслуга.КоличествоПроживающих);
				
				НачисленоПоУслуге     = ВыборкаУслуга.Начислено;
				ФактПоУслуге          = ВыборкаУслуга.Факт;
				
				НачисленоПоПрож       = Окр(НачисленоПоУслуге/КоличествоПроживающих,4);
				ФактПоПрож            = ОКР(ФактПоУслуге/КоличествоПроживающих,4);
				
				// Расчет поргешности только для льгот распространяющихся по факту начислений
				Если ВыборкаУслуга.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоФакту
					И НЕ ВыборкаУслуга.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
					
					СтавкаЛьготы       = ?(НЕ ВыборкаУслуга.СемейнаяСтавка = 0, ВыборкаУслуга.СемейнаяСтавка, ВыборкаУслуга.ЛичнаяСтавка);
					
					СуммаДляПроверки   = НачисленоПоПрож * КоличествоПроживающих; 
					ФактДляПроверки    = ФактПоПрож      * КоличествоПроживающих;
					
					ПогрешностьНачислений = НачисленоПоУслуге - СуммаДляПроверки;
					ПогрешностьФакта      = ФактПоУслуге      - ФактДляПроверки;
					
				КонецЕсли;
				// Пересчет погрешности }Конец
				
				Выборка = ВыборкаУслуга.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ПоПлощадям = (Выборка.СпособРасчета   = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади
					ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади
					ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади);
					
					Норма         = 0;
					Начислено     = 0;
					НормаСемейная = 0;
					
					//ПоНорме      = Ложь;
					
					//ТекстУсловия = " И ТаблицаФизЛиц.ПравоНаЛьготы";
					//
					//Если Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоФакту Тогда
					//	
					//	Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим 
					//		ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
					//		ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
					//		ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
					//		ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению 
					//		ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
					//		
					//		ТекстУсловия = "";
					//	КонецЕсли;
					//	
					//КонецЕсли;
					
					КоличествоПоНормеЛьгота = 0;
					
					Запрос.Текст = ТекстЗапросаСемейнойЛьготы;
					Запрос.УстановитьПараметр("ЛицевойСчет"              , Выборка.ЛицевойСчет);
					Запрос.УстановитьПараметр("ФизЛицо"                  , Выборка.ФизЛицо);
					Запрос.УстановитьПараметр("Льгота"                   , Выборка.Льгота);
					Запрос.УстановитьПараметр("РасчетСУчетомСоставаСемьи", Выборка.РасчетСУчетомСоставаСемьи);
					
					ВыборкаОбщ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Если ВыборкаОбщ.Следующий() Тогда
						КоличествоПоНормеЛьгота = ВыборкаОбщ.КоличествоПоНормеЛьгота;
					КонецЕсли;
					
					Если Выборка.ПравоНаЛьготы И Выборка.НачислятьПоНорме Тогда
						КоличествоПоНормеЛьгота = КоличествоПоНормеЛьгота + 1;
					КонецЕсли; 
					
					ВыборкаФизЛиц = ВыборкаОбщ.Выбрать();
					
					//ДоляПлощади  = ?(Выборка.ДоляПлощади > Выборка.Факт, Выборка.Факт, Выборка.ДоляПлощади);
					
					Если Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоФакту Тогда
						
						Факт = Выборка.Факт;
						
						Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим 
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению Тогда
							
							Норма         = Факт/КоличествоПроживающих;
							
							// БИТ_ЖКХ 17.12.2014{{
							Если Выборка.ФактПотребПоСЧБезУчетаВременноПрож = Истина Тогда
								КоличествоПроживающих = КоличествоПоНормеЛьгота;
							КонецЕсли;
							// БИТ_ЖКХ 17.12.2014}}
							
							КоличествоПроживающих = ?(КоличествоПроживающих = 0,1,КоличествоПроживающих); // БИТ_ЖКХ 15.12.2016 16:42:55 
							Начислено     = Выборка.Начислено/КоличествоПроживающих;
							НормаСемейная = Норма;
							
						ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
							
							Норма = Факт;
							
							Начислено     = Выборка.Начислено;
							НормаСемейная = Выборка.Факт;
							
						Иначе
							
							// БИТ_ЖКХ 26.04.2013
							// При расчете по площадям количество человек для расчета ровно 
							// количеству человек где в статусе физ лица установлены флаги НачислятьПоНорме, ПравоНаЛьготы
							//
							//Норма         = Факт/КоличествоПроживающих;
							//Начислено     = Выборка.Начислено/КоличествоПроживающих;
							//
							//Если НЕ КоличествоПоНормеЛьгота = 0 Тогда
							//	НормаСемейная = Выборка.Факт/ КоличествоПоНормеЛьгота;
							//КонецЕсли; 
							КоличествоПоНормеЛьгота = ?(КоличествоПоНормеЛьгота = 0,1,КоличествоПоНормеЛьгота);
							Норма         = Факт/КоличествоПоНормеЛьгота;
							Начислено     = Выборка.Начислено/КоличествоПоНормеЛьгота;
							НормаСемейная = Выборка.Факт/ КоличествоПоНормеЛьгота;
							
						КонецЕсли;
						
					Иначе
						
						Если КоличествоПоНормеЛьгота = 0 Тогда
							Продолжить;
						КонецЕсли; 
						
						//Факт    = ?(ДоляПлощади <> 0 И РасчетДолей, ДоляПлощади, Выборка.Факт);
						//ПоНорме = ?(ДоляПлощади <> 0 И РасчетДолей, Истина, Ложь);
						
						Факт    = Выборка.Факт;
						//ПоНорме = ?(Выборка.ДоляПлощади <> 0 И РасчетДолей, Истина, Ложь);
						
						Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет 
							ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению) И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
							Тогда
							
							Норма = Выборка.НаЛицевойСчет;
							
						Иначе
							
							Если КоличествоПоНормеЛьгота = 1 Тогда
								Норма = Выборка.НаОдного;
							ИначеЕсли КоличествоПоНормеЛьгота = 2 Тогда
								Норма = Выборка.НаДвоих;
							ИначеЕсли КоличествоПоНормеЛьгота = 3 Тогда
								Норма = Выборка.НаСемью;
							ИначеЕсли КоличествоПоНормеЛьгота = 4 Тогда
								Норма = Выборка.НаСемью4;
							ИначеЕсли КоличествоПоНормеЛьгота = 5 Тогда
								Норма = Выборка.НаСемью5;
							ИначеЕсли КоличествоПоНормеЛьгота > 5 Тогда
								Норма = Выборка.НаСемью6;
							КонецЕсли;
							
							Если Выборка.ИспользоватьДопНормуНаЛьготника Тогда
								
								Норма = Норма + Выборка.ДопНормаНаКаждого;
								
							КонецЕсли;
							
						КонецЕсли;
						
						Если УменьшитьНормуЛьготы Тогда
							
							КолЧелРасчет = ?((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению)
							И НЕ Выборка.ФактПотребПоСЧБезУчетаВременноПрож,
							КоличествоПроживающих,
							КоличествоПоНормеЛьгота);
							
							// БИТ_ЖКХ 22.12.2011
							// Временное решение проблемы деления на 0.
							КолЧелРасчет = ?(КолЧелРасчет = 0, 1, КолЧелРасчет);
							
							Норма = ?(Норма > Выборка.Факт/КолЧелРасчет, Выборка.Факт/КолЧелРасчет, Норма);
							
							// БИТ_ЖКХ_07102013_начало_изменений
							//добавлено условие если начислено < норматива (общедомовые расходы) тогда считаем по начислено
							//иначе (нет уменьшения за счет отрицательных общедомовых расходов) тогда считаем по нормативу
							Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда
								Если Выборка.Начислено < Выборка.Норматив Тогда
									Начислено = Выборка.Начислено/КолЧелРасчет;
								Иначе
									Начислено = Выборка.Норматив/КолЧелРасчет;
								КонецЕсли;
							КонецЕсли;
							// БИТ_ЖКХ_07102013_окончание_изменений
							
						Иначе
							Норма = ?(Норма > Выборка.Факт, Выборка.Факт, Норма);
						КонецЕсли;   
						
						Если РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика И Выборка.Многотарифный Тогда
							
							Если НЕ Выборка.Норма = 0 Тогда
								
								КолЧелРасчет  = ?(Выборка.мКоличествоПоНормеЛьгота = 0, 1, КоличествоПоНормеЛьгота);
								Норма         = (Выборка.Норма / КолЧелРасчет);
								
							КонецЕсли; 
							
						КонецЕсли;
						
						НормаСемейная = Норма;
						
						Если Выборка.ИспользоватьНормуНаОдного Тогда
							
							// БИТ_ЖКХ 22.12.2011
							// Попртавка льгота при использовании нормы на одного не уменьшать факт до фактического потребления.
							// Норма = ?(Выборка.НаОдного > ?(УменьшитьНормуЛьготы, Факт/ Выборка.мКоличествоПоНормеЛьгота,Факт)
							// ,?(УменьшитьНормуЛьготы,Факт/ Выборка.мКоличествоПоНормеЛьгота,Факт), Выборка.НаОдного);
							Норма = ?(Выборка.НаОдного > Факт , Факт, Выборка.НаОдного);
							Начислено = 0;
							
						КонецЕсли;
						
					КонецЕсли;
					
					
					НачислитьСуммуЛьготы = Истина;
					
					Если (НЕ Выборка.НачислятьПоНорме И Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме) Тогда
						НачислитьСуммуЛьготы = Ложь;
					ИначеЕсли НЕ Выборка.ПроживаниеВДанныйМомент И(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
						ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
						ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
						ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
						ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных) 
						И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим)) Тогда
						
						НачислитьСуммуЛьготы = Ложь;
						
					КонецЕсли; 
					
					Если Выборка.ЛичнаяСтавка <> 0  Тогда
						
						СуммаЛичной = ОКР(?(Начислено = 0,Норма * Выборка.Ставка,Начислено) * Выборка.ЛичнаяСтавка / 100, 4, РежимОкругления.Окр15как10);
						
						// БИТ_ЖКХ_07072015++
						Если Выборка.ЛьготнаяСтавка > 0 Тогда
							СуммаЛичной = ОКР(?(Начислено = 0,Норма * Выборка.ЛьготнаяСтавка, Начислено / Выборка.Ставка* Выборка.ЛьготнаяСтавка ) * Выборка.ЛичнаяСтавка / 100, 4, РежимОкругления.Окр15как10);
						КонецЕсли;	
						// БИТ_ЖКХ_07072015--
						
						//Если НЕ Выборка.ПроживаниеВДанныйМомент И(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
						//	ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных) 
						//	И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим)) Тогда
						//Иначе
						
						НоваяСтрока = ТаблицаЛьгот.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						
						НоваяСтрока.СуммаЛичной   = ?(НачислитьСуммуЛьготы,СуммаЛичной,0);
						НоваяСтрока.Приоритет     = 1;
						НоваяСтрока.ПравоНаЛьготы = Истина;
						НоваяСтрока.Норма         = ?(НачислитьСуммуЛьготы,Норма,0);
						//НоваяСтрока.ПоНорме       = ПоНорме;
						// БИТ_ЖКХ 28.06.2013
						// #1
						//Если Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме Тогда
						НоваяСтрока.РасчетДолей   = ?(ПоПлощадям, Выборка.РасчетСУчетомДолейВладения, Ложь);
						//КонецЕсли;
						
						Если ПоПлощадям Тогда
							НоваяСтрока.ДоляПлощади = Выборка.ДоляПлощади;
						КонецЕсли; 
						
						НоваяСтрока.ВладелецЛьготы =  Выборка.ФизЛицо;
						
						НоваяСтрока.ПриоритетУслуги = Выборка.Услуга.Приоритет;
						
						// БИТ_ЖКХ_02122013_начало_изменений
						Если  Выборка.НормативПотребленияПоКу <> 0 Тогда
							// БИТ_ЖКХ_29112013_начало_изменений
							
							НоваяСтрока.Объем                   = Выборка.НормаЛьготы * Выборка.НормативПотребленияПоКу;
							НоваяСтрока.НормативПотребленияПоКу = Выборка.НормативПотребленияПоКу;
							// БИТ_ЖКХ_29112013_окончание_изменений
						Иначе
							НоваяСтрока.Объем = Выборка.НормаЛьготы;
							
						КонецЕсли;
						// БИТ_ЖКХ_02122013_окончание_изменений
						
						//КонецЕсли; 
						
					КонецЕсли;
					
					Если Выборка.СемейнаяСтавка <> 0  Тогда
						
						СуммаСемейной = ОКР(?(Начислено = 0,НормаСемейная * Выборка.Ставка,Начислено) * Выборка.СемейнаяСтавка / 100,4, РежимОкругления.Окр15как10);
						
						// БИТ_ЖКХ_07072015++
						Если Выборка.ЛьготнаяСтавка > 0 Тогда
							СуммаСемейной = ОКР(?(Начислено = 0,НормаСемейная * Выборка.ЛьготнаяСтавка, Начислено / Выборка.Ставка* Выборка.ЛьготнаяСтавка) * Выборка.СемейнаяСтавка / 100,4, РежимОкругления.Окр15как10);
						КонецЕсли;	
						// БИТ_ЖКХ_07072015--
						
						//Если НЕ Выборка.ПроживаниеВДанныйМомент И(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
						//	ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных) 
						//	И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим)) Тогда
						//	
						//Иначе
						
						
						НоваяСтрока = ТаблицаЛьгот.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						
						НоваяСтрока.СуммаЛичной   = ?(НачислитьСуммуЛьготы,СуммаСемейной,0);;
						НоваяСтрока.Приоритет     = 1;
						НоваяСтрока.ПравоНаЛьготы = Истина;
						НоваяСтрока.Норма         = ?(НачислитьСуммуЛьготы,НормаСемейная,0);;
						//НоваяСтрока.ПоНорме       = ПоНорме;
						// БИТ_ЖКХ 28.06.2013
						// #1
						//Если Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме Тогда
						НоваяСтрока.РасчетДолей   = ?(ПоПлощадям, Выборка.РасчетСУчетомДолейВладения, Ложь);
						//КонецЕсли;
						
						Если ПоПлощадям Тогда
							НоваяСтрока.ДоляПлощади = Выборка.ДоляПлощади;
						КонецЕсли; 
						
						НоваяСтрока.ВладелецЛьготы = Выборка.ФизЛицо; 
						НоваяСтрока.СемейнаяЛьгота = Истина;
						
						НоваяСтрока.ПриоритетУслуги = Выборка.Услуга.Приоритет;
						
						// БИТ_ЖКХ_02122013_начало_изменений
						Если  Выборка.НормативПотребленияПоКу <> 0 Тогда
							
							// БИТ_ЖКХ_29112013_начало_изменений
							НоваяСтрока.Объем                   = Выборка.НормаЛьготы * Выборка.НормативПотребленияПоКу;
							НоваяСтрока.НормативПотребленияПоКу = Выборка.НормативПотребленияПоКу;
							// БИТ_ЖКХ_29112013_окончание_изменений
						Иначе
							НоваяСтрока.Объем = Выборка.НормаЛьготы;
							
						КонецЕсли;
						// БИТ_ЖКХ_02122013_окончание_изменений
						
						//КонецЕсли;
						
						Пока ВыборкаФизЛиц.Следующий() Цикл
							
							НачислитьСуммуЛьготы = Истина;
							
							Если (НЕ ВыборкаФизЛиц.НачислятьПоНорме И Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме) Тогда
								НачислитьСуммуЛьготы = Ложь;
							ИначеЕсли НЕ ВыборкаФизЛиц.ПравоНаЛьготы Тогда
								НачислитьСуммуЛьготы = Ложь;
							ИначеЕсли НЕ ВыборкаФизЛиц.ПроживаниеВДанныйМомент И(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
								ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
								ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
								ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
								ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных) 
								И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим)) Тогда
								НачислитьСуммуЛьготы = Ложь;
							КонецЕсли;
							
							//Если НЕ ВыборкаФизЛиц.НачислятьПоНорме И Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме Тогда
							//	Продолжить;
							//КонецЕсли; 
							
							НоваяСтрока = ТаблицаЛьгот.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
							
							НоваяСтрока.ФизЛицо       = ВыборкаФизЛиц.ФизЛицо;
							НоваяСтрока.СуммаЛичной   = ?(НачислитьСуммуЛьготы,СуммаСемейной,0);
							НоваяСтрока.Приоритет     = 2;
							НоваяСтрока.ПравоНаЛьготы = ВыборкаФизЛиц.ПравоНаЛьготы;
							НоваяСтрока.Норма         = ?(НачислитьСуммуЛьготы,НормаСемейная,0);
							//НоваяСтрока.ПоНорме       = ПоНорме;
							// БИТ_ЖКХ 28.06.2013
							// #1
							//Если Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме Тогда
							НоваяСтрока.РасчетДолей   = ?(ПоПлощадям, Выборка.РасчетСУчетомДолейВладения, Ложь);
							//КонецЕсли; 
							
							Если ПоПлощадям Тогда
								НоваяСтрока.ДоляПлощади = Факт * ВыборкаФизЛиц.ДоляПлощади;
							КонецЕсли;
							
							НоваяСтрока.ВладелецЛьготы = Выборка.ФизЛицо;
							НоваяСтрока.СемейнаяЛьгота = Истина;
							
							НоваяСтрока.ПриоритетУслуги = Выборка.Услуга.Приоритет;
							
							// БИТ_ЖКХ_02122013_начало_изменений
							Если  Выборка.НормативПотребленияПоКу <> 0 Тогда
								
								// БИТ_ЖКХ_29112013_начало_изменений
								НоваяСтрока.Объем                   = Выборка.НормаЛьготы * Выборка.НормативПотребленияПоКу;
								НоваяСтрока.НормативПотребленияПоКу = Выборка.НормативПотребленияПоКу;
								// БИТ_ЖКХ_29112013_окончание_изменений
								
							Иначе
								НоваяСтрока.Объем = Выборка.НормаЛьготы;
								
							КонецЕсли;
							// БИТ_ЖКХ_02122013_окончание_изменений
							
						КонецЦикла; 
						
					КонецЕсли; 
					
				КонецЦикла;
				
				// Начисление погрещности.
				Попытка
					НоваяСтрока.СуммаЛичной =  НоваяСтрока.СуммаЛичной  + Окр(ПогрешностьНачислений * СтавкаЛьготы / 100,4);
					НоваяСтрока.Норма       =  НоваяСтрока.Норма        + ПогрешностьФакта;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Дата >= Дата('20160101') И Мосэнергосбыт2016 Тогда //Обход многотарифных счетчиков для Мосэнегосбыта
		ВыборкаЛС = РезультатМноготарифные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаСчетчиков.Индексы.Добавить("ЛицевойСчет,Многотарифный");	
		
		Пока ВыборкаЛС.Следующий() Цикл //Обход Лицевых счетов
			
			КэшУслуга = Неопределено;
			КэшЛьгота = 0;
			
			//Таблица соответствия услуга-счетчик
			МассивСчетчиков = ТаблицаСчетчиков.НайтиСтроки(Новый Структура("ЛицевойСчет, Многотарифный",ВыборкаЛС.ЛицевойСчет, Истина));
			СоответствиеСчетчиков = Новый Соответствие;
			Для каждого Элт из МассивСчетчиков Цикл
				СоответствиеСчетчиков.Вставить(Элт.Услуга, Элт.Счетчик);	
			КонецЦикла;
			
			//Остаток нормы по счетчику
			СоответОстатокНормыСчетчика = Новый Соответствие;
			
			//Остаток Факта по счетчику
			СоответОстатокФактаСчетчика = Новый Соответствие;
			
			////Остаток семейной льготы по счетчику
			СоответствиеОстатокСемейнойЛьготы = Новый Соответствие; 
			
			//Остаток номы льготника
			СоответствиеОстаткаНормыЛьготника = Новый Соответствие;
			
			//Таблица остатки
			тз_остатки = ТаблицаЛьгот.СкопироватьКолонки("ФизЛицо,Услуга,Норма");
			
			ВсеНаВладельцаСемейнойЛьготы = Ложь;
			
			ВыборкаУслуга = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаУслуга.Следующий() Цикл //Обход Услуг
				
				//ТаблицаОстаткаЛьготПоЛьготнику
				тмпТаблицаЛьгот = ТаблицаЛьгот.СкопироватьКолонки();
				
				//Остаток Нормы по счетчику
				Если КэшУслуга = Неопределено 
					ИЛИ КэшУслуга <> ВыборкаУслуга.Услуга Тогда
					
					КэшУслуга	= ВыборкаУслуга.Услуга;
					КэшСчетчик  = СоответствиеСчетчиков.Получить(КэшУслуга);
					КэшЛьгота	= СоответОстатокНормыСчетчика.Получить(КэшСчетчик);
					
					//Если нормы льготников потрачены - обнуляем при переходе на следующую услугу.
					Если КэшЛьгота = Неопределено
						ИЛИ КэшЛьгота < 0 Тогда
						КэшЛьгота = 0;
						СоответОстатокНормыСчетчика.Вставить(КэшСчетчик, 0);	
					КонецЕсли;
					
				КонецЕсли;
				
				// Пересчет погрешности Начало:{
				ПогрешностьНачислений = 0;
				ПогрешностьФакта      = 0;
				
				КоличествоПроживающих = ?(ВыборкаУслуга.КоличествоПроживающих = 0, 1, ВыборкаУслуга.КоличествоПроживающих);
				
				НачисленоПоУслуге     = ВыборкаУслуга.Начислено;
				ФактПоУслуге          = ВыборкаУслуга.Факт;
				
				//Остаток Факта по счетчику
				СоответОстатокФактаСчетчика.Вставить(КэшСчетчик, ФактПоУслуге);
				
				НачисленоПоПрож       = Окр(НачисленоПоУслуге/КоличествоПроживающих,4);
				ФактПоПрож            = ОКР(ФактПоУслуге/КоличествоПроживающих,4);
				
				// Расчет поргешности только для льгот распространяющихся по факту начислений
				Если ВыборкаУслуга.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоФакту
					И НЕ ВыборкаУслуга.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
					
					СтавкаЛьготы       = ?(НЕ ВыборкаУслуга.СемейнаяСтавка = 0, ВыборкаУслуга.СемейнаяСтавка, ВыборкаУслуга.ЛичнаяСтавка);
					
					СуммаДляПроверки   = НачисленоПоПрож * КоличествоПроживающих; 
					ФактДляПроверки    = ФактПоПрож      * КоличествоПроживающих;
					
					ПогрешностьНачислений = НачисленоПоУслуге - СуммаДляПроверки;
					ПогрешностьФакта      = ФактПоУслуге      - ФактДляПроверки;
					
				КонецЕсли;
				// Пересчет погрешности }Конец
				
				Выборка = ВыборкаУслуга.Выбрать();
				
				КэшФизЛицо = Неопределено;
				КэшНорма = 0;
				Пока Выборка.Следующий() Цикл //Обход Льготников
					
					ПоПлощадям = (Выборка.СпособРасчета   = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади
					ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади
					ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади);
					
					Норма         = 0;
					Начислено     = 0;
					НормаСемейная = 0;
					
					КоличествоПоНормеЛьгота = 0;
					
					Запрос.Текст = ТекстЗапросаСемейнойЛьготы;
					Запрос.УстановитьПараметр("ЛицевойСчет"              , Выборка.ЛицевойСчет);
					Запрос.УстановитьПараметр("ФизЛицо"                  , Выборка.ФизЛицо);
					Запрос.УстановитьПараметр("Льгота"                   , Выборка.Льгота);
					Запрос.УстановитьПараметр("РасчетСУчетомСоставаСемьи", Выборка.РасчетСУчетомСоставаСемьи);
					
					ВыборкаОбщ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Если ВыборкаОбщ.Следующий() Тогда
						КоличествоПоНормеЛьгота = ВыборкаОбщ.КоличествоПоНормеЛьгота;
					КонецЕсли;
					
					Если Выборка.ПравоНаЛьготы И Выборка.НачислятьПоНорме Тогда
						КоличествоПоНормеЛьгота = КоличествоПоНормеЛьгота + 1;
					КонецЕсли; 
					
					ВыборкаФизЛиц = ВыборкаОбщ.Выбрать();
					
					
					Если Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоФакту Тогда
						
						Факт = Выборка.Факт;
						
						Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим 
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению Тогда
							
							Норма         = Факт/КоличествоПроживающих;
							
							Если Выборка.ФактПотребПоСЧБезУчетаВременноПрож = Истина Тогда
								КоличествоПроживающих = КоличествоПоНормеЛьгота;
							КонецЕсли;
							
							КоличествоПроживающих = ?(КоличествоПроживающих = 0,1,КоличествоПроживающих); // БИТ_ЖКХ 15.12.2016 16:42:55 
							Начислено     = Выборка.Начислено/КоличествоПроживающих;
							НормаСемейная = Норма;
							
						ИначеЕсли Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
							
							Норма = Факт;
							
							Начислено     = Выборка.Начислено;
							НормаСемейная = Выборка.Факт;
							
						Иначе
							
							КоличествоПоНормеЛьгота = ?(КоличествоПоНормеЛьгота = 0,1,КоличествоПоНормеЛьгота);
							Норма         = Факт/КоличествоПоНормеЛьгота;
							Начислено     = Выборка.Начислено/КоличествоПоНормеЛьгота;
							НормаСемейная = Выборка.Факт/ КоличествоПоНормеЛьгота;
							
						КонецЕсли;
						
					Иначе
						
						Если КоличествоПоНормеЛьгота = 0 Тогда
							Продолжить;
						КонецЕсли; 
						
						Факт    = Выборка.Факт;
						
						Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет 
							ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
							ИЛИ  Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению) И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
							Тогда
							
							Норма = Выборка.НаЛицевойСчет;
							
						Иначе
							
							Если КоличествоПоНормеЛьгота = 1 Тогда
								Норма = Выборка.НаОдного;
							ИначеЕсли КоличествоПоНормеЛьгота = 2 Тогда
								Норма = Выборка.НаДвоих;
							ИначеЕсли КоличествоПоНормеЛьгота = 3 Тогда
								Норма = Выборка.НаСемью;
							ИначеЕсли КоличествоПоНормеЛьгота = 4 Тогда
								Норма = Выборка.НаСемью4;
							ИначеЕсли КоличествоПоНормеЛьгота = 5 Тогда
								Норма = Выборка.НаСемью5;
							ИначеЕсли КоличествоПоНормеЛьгота > 5 Тогда
								Норма = Выборка.НаСемью6;
							КонецЕсли;
							
							Если Выборка.ИспользоватьДопНормуНаЛьготника Тогда
								
								Норма = Норма + Выборка.ДопНормаНаКаждого;
								
							КонецЕсли;
							
						КонецЕсли;
						
						лНорма = Норма;
						НормаСемейная = Норма;//!!!!!
						
						Если РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика
							И НЕ Выборка.Норма = 0 Тогда
							
							ОстатокЛьготы = СоответствиеОстаткаНормыЛьготника.Получить(Выборка.ФизЛицо);
							
							Если ОстатокЛьготы = Неопределено Тогда
								Норма = Мин(Норма, ФактПоУслуге);
								Если Выборка.ФизЛицо <> КэшФизЛицо Тогда
									
									КэшФизЛицо = Выборка.ФизЛицо;
									
									//Получить остаток факта
									кэшФактПоУслуге =  СоответОстатокФактаСчетчика.Получить(КэшСчетчик);
									Если кэшФактПоУслуге = Неопределено Тогда
										кэшФактПоУслуге = 0;
									КонецЕсли;
									
									//Получить остаток номы
									КэшЛьгота =  СоответОстатокНормыСчетчика.Получить(КэшСчетчик);
									Если КэшЛьгота = Неопределено Тогда
										КэшЛьгота = 0;
									КонецЕсли;
									
									//Обновление остатка по счетчику
									СоответОстатокНормыСчетчика.Вставить(КэшСчетчик, КэшЛьгота + лНорма - кэшФактПоУслуге);
									
									//Списать с остатка факта
									Если кэшФактПоУслуге - лНорма > 0 Тогда
										СоответОстатокФактаСчетчика.Вставить(КэшСчетчик, кэшФактПоУслуге - лНорма);
									Иначе
										СоответОстатокФактаСчетчика.Вставить(КэшСчетчик, 0);
									КонецЕсли;
									
									//Кэшируем доступную норму
									нстрОстатки = тз_остатки.Добавить();
									нстрОстатки.ФизЛИцо = Выборка.ФизЛИцо;
									нстрОстатки.Услуга	= Выборка.Услуга;
									нстрОстатки.Норма	= лНорма;
									
								КонецЕсли;
							Иначе
								
								Норма = Мин(Норма + ОстатокЛьготы, ФактПоУслуге);
								
								Если Выборка.ФизЛицо <> КэшФизЛицо Тогда
									
									КэшФизЛицо = Выборка.ФизЛицо;
									
									//Получить остаток факта
									кэшФактПоУслуге =  СоответОстатокФактаСчетчика.Получить(КэшСчетчик);
									Если кэшФактПоУслуге = Неопределено Тогда
										кэшФактПоУслуге = 0;
									КонецЕсли;
									
									//Получить остаток номы
									КэшЛьгота =  СоответОстатокНормыСчетчика.Получить(КэшСчетчик);
									Если КэшЛьгота = Неопределено Тогда
										КэшЛьгота = 0;
									КонецЕсли;
									
									//Обновление остатка по счетчику
									Разность = кэшФактПоУслуге - Норма;
									Если кэшФактПоУслуге <= 0 Тогда
										СоответОстатокФактаСчетчика.Вставить(КэшСчетчик, 0);
										СоответОстатокНормыСчетчика.Вставить(КэшСчетчик, КэшЛьгота - кэшФактПоУслуге);
									Иначе
										СоответОстатокФактаСчетчика.Вставить(КэшСчетчик, Разность);
										СоответОстатокНормыСчетчика.Вставить(КэшСчетчик, КэшЛьгота - Норма);
									КонецЕсли;
									
									////СоответОстатокНормыСчетчика.Вставить(КэшСчетчик, КэшЛьгота + лНорма - кэшФактПоУслуге);
									//СоответОстатокНормыСчетчика.Вставить(КэшСчетчик, КэшЛьгота - Норма);
									
									////Списать с остатка факта
									//Если кэшФактПоУслуге - лНорма > 0 Тогда
									//	СоответОстатокФактаСчетчика.Вставить(КэшСчетчик, кэшФактПоУслуге - лНорма);
									//Иначе
									//	СоответОстатокФактаСчетчика.Вставить(КэшСчетчик, 0);
									//КонецЕсли;
									
									//Кэшируем доступную норму
									нстрОстатки = тз_остатки.Добавить();
									нстрОстатки.ФизЛИцо = Выборка.ФизЛИцо;
									нстрОстатки.Услуга	= Выборка.Услуга;
									нстрОстатки.Норма	= лНорма + ОстатокЛьготы;
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						
						//НормаСемейная = Норма;
						
						// БИТ_ЖКХ 31.05.2018 16:29:52 Начало правки... Не нужно для многотарифных 
						//Если Выборка.ИспользоватьНормуНаОдного Тогда
						//	
						//	// БИТ_ЖКХ 22.12.2011
						//	// Попртавка льгота при использовании нормы на одного не уменьшать факт до фактического потребления.
						//	Норма = ?(Выборка.НаОдного > Факт , Факт, Выборка.НаОдного);
						//	Начислено = 0;
						//	
						//КонецЕсли;
						// БИТ_ЖКХ 31.05.2018 16:29:55 Конец правки. 
						
					КонецЕсли;
					
					
					НачислитьСуммуЛьготы = Истина;
					
					Если (НЕ Выборка.НачислятьПоНорме И Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме) Тогда
						НачислитьСуммуЛьготы = Ложь;
					ИначеЕсли НЕ Выборка.ПроживаниеВДанныйМомент И(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
						ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
						ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
						ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
						ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных) 
						И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим)) Тогда
						
						НачислитьСуммуЛьготы = Ложь;
						
					КонецЕсли; 
					
					Если Выборка.ЛичнаяСтавка <> 0  Тогда
						
						СуммаЛичной = ОКР(?(Начислено = 0,Норма * Выборка.Ставка,Начислено) * Выборка.ЛичнаяСтавка / 100, 4, РежимОкругления.Окр15как10);
						
						// БИТ_ЖКХ_07072015++
						Если Выборка.ЛьготнаяСтавка > 0 Тогда
							СуммаЛичной = ОКР(?(Начислено = 0,Норма * Выборка.ЛьготнаяСтавка, Начислено / Выборка.Ставка* Выборка.ЛьготнаяСтавка ) * Выборка.ЛичнаяСтавка / 100, 4, РежимОкругления.Окр15как10);
						КонецЕсли;	
						// БИТ_ЖКХ_07072015--
						
						//Если НЕ Выборка.ПроживаниеВДанныйМомент И(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
						//	ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
						//	ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных) 
						//	И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим)) Тогда
						//Иначе
						
						НоваяСтрока = тмпТаблицаЛьгот.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						
						НоваяСтрока.СуммаЛичной   = ?(НачислитьСуммуЛьготы,СуммаЛичной,0);
						НоваяСтрока.Приоритет     = 1;
						НоваяСтрока.ПравоНаЛьготы = Истина;
						НоваяСтрока.Норма         = ?(НачислитьСуммуЛьготы,Норма,0);
						// БИТ_ЖКХ 28.06.2013
						// #1
						//Если Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме Тогда
						НоваяСтрока.РасчетДолей   = ?(ПоПлощадям, Выборка.РасчетСУчетомДолейВладения, Ложь);
						//КонецЕсли;
						
						Если ПоПлощадям Тогда
							НоваяСтрока.ДоляПлощади = Выборка.ДоляПлощади;
						КонецЕсли; 
						
						НоваяСтрока.ВладелецЛьготы =  Выборка.ФизЛицо;
						
						НоваяСтрока.ПриоритетУслуги = Выборка.Услуга.Приоритет;
						
						Если  Выборка.НормативПотребленияПоКу <> 0 Тогда
							
							НоваяСтрока.Объем                   = Выборка.НормаЛьготы * Выборка.НормативПотребленияПоКу;
							НоваяСтрока.НормативПотребленияПоКу = Выборка.НормативПотребленияПоКу;
						Иначе
							НоваяСтрока.Объем = Выборка.НормаЛьготы;
							
						КонецЕсли;
						
					КонецЕсли;
					
					
					//Семейные ставки
					Если Выборка.СемейнаяСтавка <> 0  Тогда
						
						//Остаток семеной льготы
						КэшСеменыйСчетчик		= СоответствиеСчетчиков.Получить(Выборка.Услуга);
						КэшОстатокСеменойЛьготы =  СоответствиеОстатокСемейнойЛьготы.Получить(КэшСчетчик);
						Если КэшОстатокСеменойЛьготы = Неопределено Тогда
							КэшОстатокСеменойЛьготы = 0;
						КонецЕсли;
						
						Если Выборка.НормаЛьготы - Выборка.Норма > 0 Тогда
							Если КэшОстатокСеменойЛьготы = 0 Тогда
								СоответствиеОстатокСемейнойЛьготы.Вставить(КэшСеменыйСчетчик, Выборка.НормаЛьготы - Выборка.Норма);
							Иначе
								СоответствиеОстатокСемейнойЛьготы.Вставить(КэшСеменыйСчетчик, Выборка.НормаЛьготы - Выборка.Норма + КэшОстатокСеменойЛьготы);
							КонецЕсли;
						ИначеЕсли НормаСемейная = 0 И КэшОстатокСеменойЛьготы > 0 Тогда
							НормаСемейная = Мин(Выборка.Факт, КэшОстатокСеменойЛьготы)/?(Выборка.мКоличествоПоНормеЛьгота = 0, 1, Выборка.мКоличествоПоНормеЛьгота);
							КэшОстатокСеменойЛьготы = ?(КэшОстатокСеменойЛьготы - Выборка.Факт > 0 ,КэшОстатокСеменойЛьготы - Выборка.Факт, 0);
							СоответствиеОстатокСемейнойЛьготы.Вставить(КэшСеменыйСчетчик, КэшОстатокСеменойЛьготы);
						КонецЕсли;
						//Тестовы данные т1 150 т2 60 т3 110 , нормы 70 скидка 50%
						//Если НормаСемейная = 0 И ИспользовалиСемью = Ложь Тогда
						//	НормаСемейная = 130/4;
						//	ИспользовалиСемью = Истина;	
						//КонецЕсли;
						
						СуммаСемейной = ОКР(?(Начислено = 0,НормаСемейная * Выборка.Ставка,Начислено) * Выборка.СемейнаяСтавка / 100,4, РежимОкругления.Окр15как10);
						
						// БИТ_ЖКХ_07072015++
						Если Выборка.ЛьготнаяСтавка > 0 Тогда
							СуммаСемейной = ОКР(?(Начислено = 0,НормаСемейная * Выборка.ЛьготнаяСтавка, Начислено / Выборка.Ставка* Выборка.ЛьготнаяСтавка) * Выборка.СемейнаяСтавка / 100,4, РежимОкругления.Окр15как10);
						КонецЕсли;	
						// БИТ_ЖКХ_07072015--
						
						//Списываем все сумму на одного после Т1
						Если ВсеНаВладельцаСемейнойЛьготы Тогда
							СуммаСемейной = СуммаСемейной * ?(Выборка.мКоличествоПоНормеЛьгота = 0, 1, Выборка.мКоличествоПоНормеЛьгота);
						КонецЕсли;
						
						НоваяСтрока = ТаблицаЛьгот.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						
						НоваяСтрока.СуммаЛичной   = ?(НачислитьСуммуЛьготы,СуммаСемейной,0);
						НоваяСтрока.Приоритет     = 1;
						НоваяСтрока.ПравоНаЛьготы = Истина;
						НоваяСтрока.Норма         = ?(НачислитьСуммуЛьготы,НормаСемейная,0);
						Если ВсеНаВладельцаСемейнойЛьготы Тогда
							НоваяСтрока.Норма     = НоваяСтрока.Норма * ?(Выборка.мКоличествоПоНормеЛьгота = 0, 1, Выборка.мКоличествоПоНормеЛьгота);
						КонецЕсли;
						НоваяСтрока.РасчетДолей   = ?(ПоПлощадям, Выборка.РасчетСУчетомДолейВладения, Ложь);
						
						Если ПоПлощадям Тогда
							НоваяСтрока.ДоляПлощади = Выборка.ДоляПлощади;
						КонецЕсли; 
						
						НоваяСтрока.ВладелецЛьготы = Выборка.ФизЛицо; 
						НоваяСтрока.СемейнаяЛьгота = Истина;
						НоваяСтрока.ПриоритетУслуги = Выборка.Услуга.Приоритет;
						
						Если  Выборка.НормативПотребленияПоКу <> 0 Тогда
							НоваяСтрока.Объем                   = Выборка.НормаЛьготы * Выборка.НормативПотребленияПоКу;
							НоваяСтрока.НормативПотребленияПоКу = Выборка.НормативПотребленияПоКу;
						Иначе
							НоваяСтрока.Объем = Выборка.НормаЛьготы;
						КонецЕсли;
						
						Пока ВыборкаФизЛиц.Следующий() И НЕ ВсеНаВладельцаСемейнойЛьготы Цикл 
							
							НачислитьСуммуЛьготы = Истина;
							
							Если (НЕ ВыборкаФизЛиц.НачислятьПоНорме И Выборка.Распространение = Перечисления.бит_РаспространениеЛьготы.ПоНорме) Тогда
								НачислитьСуммуЛьготы = Ложь;
							ИначеЕсли НЕ ВыборкаФизЛиц.ПравоНаЛьготы Тогда
								НачислитьСуммуЛьготы = Ложь;
							ИначеЕсли НЕ ВыборкаФизЛиц.ПроживаниеВДанныйМомент И(Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим
								ИЛИ ((Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам
								ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам
								ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам
								ИЛИ Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных) 
								И Выборка.ОсновнойСпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим)) Тогда
								НачислитьСуммуЛьготы = Ложь;
							КонецЕсли;
							
							НоваяСтрока = ТаблицаЛьгот.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
							
							НоваяСтрока.ФизЛицо       = ВыборкаФизЛиц.ФизЛицо;
							НоваяСтрока.СуммаЛичной   = ?(НачислитьСуммуЛьготы,СуммаСемейной,0);
							НоваяСтрока.Приоритет     = 2;
							НоваяСтрока.ПравоНаЛьготы = ВыборкаФизЛиц.ПравоНаЛьготы;
							НоваяСтрока.Норма         = ?(НачислитьСуммуЛьготы,НормаСемейная,0);
							//Если НЕ ЕстьОстатокСемейнойНормы Тогда
							//	НоваяСтрока.Норма = 0;
							//КонецЕсли;
							НоваяСтрока.РасчетДолей   = ?(ПоПлощадям, Выборка.РасчетСУчетомДолейВладения, Ложь);
							
							Если ПоПлощадям Тогда
								НоваяСтрока.ДоляПлощади = Факт * ВыборкаФизЛиц.ДоляПлощади;
							КонецЕсли;
							
							НоваяСтрока.ВладелецЛьготы = Выборка.ФизЛицо;
							НоваяСтрока.СемейнаяЛьгота = Истина;
							
							НоваяСтрока.ПриоритетУслуги = Выборка.Услуга.Приоритет;
							
							Если  Выборка.НормативПотребленияПоКу <> 0 Тогда
								НоваяСтрока.Объем                   = Выборка.НормаЛьготы * Выборка.НормативПотребленияПоКу;
								НоваяСтрока.НормативПотребленияПоКу = Выборка.НормативПотребленияПоКу;
							Иначе
								НоваяСтрока.Объем = Выборка.НормаЛьготы;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
					
				КонецЦикла; //Льготники //Выборка
				
				
				ВсеНаВладельцаСемейнойЛьготы = Истина;
				
				
				// Начисление погрещности.
				Попытка
					НоваяСтрока.СуммаЛичной =  НоваяСтрока.СуммаЛичной  + Окр(ПогрешностьНачислений * СтавкаЛьготы / 100,4);
					НоваяСтрока.Норма       =  НоваяСтрока.Норма        + ПогрешностьФакта;
				Исключение
				КонецПопытки;
				
				//Поиск максимыльной льготы и остатка
				КэшФактПоУслуге = ФактПоУслуге;
				КэшФизЛицо = Неопределено;
				тмпТаблицаЛьгот.Сортировать("ФизЛицо Убыв,СуммаЛичной Убыв");
				Для Каждого тмпСтр Из тмпТаблицаЛьгот Цикл
					Если КэшФизЛицо <> тмпСтр.ФизЛицо Тогда
						
						КэшФизЛицо = тмпСтр.ФизЛицо;
						НСтр = ТаблицаЛьгот.Добавить();
						ЗаполнитьЗначенияСвойств(НСтр, тмпСтр);
						
						Отбор = Новый Структура;
						Отбор.Вставить("ФизЛицо", тмпСтр.ФизЛицо);
						Отбор.Вставить("Услуга" , тмпСтр.Услуга);
						СтрокиОстатки = тз_остатки.НайтиСтроки(Отбор);
						ДоступнаяНорма = 0;
						Если СтрокиОстатки.Количество() > 0 Тогда
							ДоступнаяНорма = СтрокиОстатки[0].Норма;
						КонецЕсли;
						
						КэшФактПоУслуге = КэшФактПоУслуге - ДоступнаяНорма;
						Если КэшФактПоУслуге >= 0 Тогда
							СоответствиеОстаткаНормыЛьготника.Вставить(тмпСтр.ФизЛицо, 0);
						Иначе
							СоответствиеОстаткаНормыЛьготника.Вставить(тмпСтр.ФизЛицо, - КэшФактПоУслуге);
							Норма = КэшФактПоУслуге + ДоступнаяНорма;
							НСтр.СуммаЛичной = ОКР(Норма/НСтр.Норма * НСтр.СуммаЛичной, 4, РежимОкругления.Окр15как10);
							
							НСтр.Норма = Норма;
							//НСтр.Норма = КэшФактПоУслуге + ДоступнаяНорма;
							КэшФактПоУслуге = 0;//факт погашен;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
				
			КонецЦикла; //Услуги //ВыборкаУслуга
			
		КонецЦикла;	//Лицевой счет //ВыборкаЛС
		
	КонецЕсли; //Многотарифные(Мосэнергосбыт)
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЛьготы.ЛицевойСчет,
	|	ТаблицаЛьготы.Услуга,
	|	ТаблицаЛьготы.ФизЛицо,
	|	ТаблицаЛьготы.Льгота,
	|	ТаблицаЛьготы.СуммаЛичной,
	|	ТаблицаЛьготы.Приоритет,
	|	ТаблицаЛьготы.ПравоНаЛьготы,
	|	ТаблицаЛьготы.Факт,
	|	ТаблицаЛьготы.Норма,
	|	ТаблицаЛьготы.КоличествоНосителей,
	|	ТаблицаЛьготы.ДоляПлощади,
	|	ТаблицаЛьготы.ПоНорме,
	|	ТаблицаЛьготы.ВладелецЛьготы,
	|	ТаблицаЛьготы.СемейнаяЛьгота,
	|	ТаблицаЛьготы.ПриоритетУслуги,
	// БИТ_ЖКХ_29112013_начало_изменений
	|	ТаблицаЛьготы.Объем,
	|	ТаблицаЛьготы.НормативПотребленияПоКу,
	// БИТ_ЖКХ_29112013_начало_изменений
	|	ТаблицаЛьготы.РасчетДолей
	|ПОМЕСТИТЬ ТабЛьгота
	|ИЗ
	|	&ТаблицаЛьготы КАК ТаблицаЛьготы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЛьгота.ЛицевойСчет КАК ЛицевойСчет,
	|	ТабЛьгота.Услуга КАК Услуга,
	|	ТабЛьгота.ФизЛицо КАК ФизЛицо,
	|	ТабЛьгота.Льгота,
	|	ТабЛьгота.СуммаЛичной КАК СуммаЛичной,
	|	ТабЛьгота.Приоритет КАК Приоритет,
	|	ТабЛьгота.ПравоНаЛьготы,
	|	ТабЛьгота.Факт,
	|	ТабЛьгота.Норма,
	|	ТабЛьгота.КоличествоНосителей,
	|	ТабЛьгота.ДоляПлощади,
	|	ТабЛьгота.ПоНорме,
	|	ТабЛьгота.ВладелецЛьготы,
	|	ТабЛьгота.СемейнаяЛьгота,
	|	ТабЛьгота.ПриоритетУслуги,
	// БИТ_ЖКХ_01122013_начало_изменений
	|	ТабЛьгота.Объем,
	|	ТабЛьгота.НормативПотребленияПоКу,
	// БИТ_ЖКХ_01122013_начало_изменений
	|	ТабЛьгота.РасчетДолей
	|ИЗ
	|	ТабЛьгота КАК ТабЛьгота
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет,
	|	СуммаЛичной УБЫВ,
	|	Приоритет,
	// БИТ_ЖКХ 11.02.2016 14:56:07 Начало правки... 
	|	ПриоритетУслуги
	// БИТ_ЖКХ 11.02.2016 14:56:08 Конец правки. 
	|ИТОГИ ПО
	|	ЛицевойСчет,
	|	Услуга,
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("ТаблицаЛьготы", ТаблицаЛьгот);
	
	//Выполнялка = Запрос.Выполнить();
	//Таб = Выполнялка.Выгрузить();
	ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаЛьгот.Очистить();
	Пока ВыборкаЛС.Следующий() Цикл
		
		ВыборкаУС = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУС.Следующий() Цикл
			
			ВыборкаФизЛицо = ВыборкаУС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаФизЛицо.Следующий() Цикл
				
				Выборка = ВыборкаФизЛицо.Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					НоваяСтрока = ТаблицаЛьгот.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.НормаЛьготы = Выборка.Норма;
					
					// БИТ_ЖКХ_02122013_начало_изменений
					Если  Выборка.НормативПотребленияПоКу <> 0 Тогда
						
						// БИТ_ЖКХ_01122013_начало_изменений
						НоваяСтрока.Объем       = Выборка.Норма * Выборка.НормативПотребленияПоКу;
						// БИТ_ЖКХ_01122013_окончание_изменений
						
					Иначе
						НоваяСтрока.Объем = НоваяСтрока.НормаЛьготы;
						
					КонецЕсли;
					// БИТ_ЖКХ_02122013_окончание_изменений
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЛьготы.ЛицевойСчет,
	|	ТаблицаЛьготы.Услуга,
	|	ТаблицаЛьготы.ФизЛицо,
	|	ТаблицаЛьготы.Льгота,
	|	ТаблицаЛьготы.СуммаЛичной,
	|	ТаблицаЛьготы.Приоритет,
	|	ТаблицаЛьготы.ПравоНаЛьготы,
	|	ТаблицаЛьготы.Факт,
	|	ТаблицаЛьготы.Норма,
	|	ТаблицаЛьготы.КоличествоНосителей,
	|	ТаблицаЛьготы.ДоляПлощади,
	|	ТаблицаЛьготы.ПоНорме,
	// БИТ_ЖКХ_01122013_начало_изменений
	|	ТаблицаЛьготы.Объем,
	|	ТаблицаЛьготы.НормативПотребленияПоКу,
	// БИТ_ЖКХ_01122013_начало_изменений
	|	ТаблицаЛьготы.ВладелецЛьготы,
	|	ТаблицаЛьготы.СемейнаяЛьгота,
	|	ТаблицаЛьготы.ПриоритетУслуги,
	|	ТаблицаЛьготы.РасчетДолей
	|ПОМЕСТИТЬ ТабЛьготы
	|ИЗ
	|	&ТаблицаЛьготы КАК ТаблицаЛьготы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЛьготы.ЛицевойСчет КАК ЛицевойСчет,
	|	ТабЛьготы.Услуга КАК Услуга,
	|	ТабЛьготы.ФизЛицо,
	|	ТабЛьготы.Льгота,
	|	ТабЛьготы.СуммаЛичной КАК СуммаЛичной,
	|	ТабЛьготы.Приоритет КАК Приоритет,
	|	ТабЛьготы.ПравоНаЛьготы,
	|	ТабЛьготы.Факт КАК Факт,
	|	ТабЛьготы.Норма КАК Норма,
	|	ТабЛьготы.КоличествоНосителей,
	|	ТабЛьготы.ДоляПлощади КАК ДоляПлощади,
	|	ТабЛьготы.ПоНорме,
	// БИТ_ЖКХ_01122013_начало_изменений
	|	ТабЛьготы.Объем,
	|	ТабЛьготы.НормативПотребленияПоКу,
	// БИТ_ЖКХ_01122013_начало_изменений
	|	ТабЛьготы.ВладелецЛьготы,
	|	ТабЛьготы.СемейнаяЛьгота,
	|	ТабЛьготы.ПриоритетУслуги,
	|	ТабЛьготы.РасчетДолей
	|ИЗ
	|	ТабЛьготы КАК ТабЛьготы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет,
	|	Приоритет,
	// БИТ_ЖКХ 11.02.2016 14:56:34 Начало правки... 
	|	ПриоритетУслуги,
	// БИТ_ЖКХ 11.02.2016 14:56:36 Конец правки. 
	|	СуммаЛичной УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Факт),
	|	СУММА(Норма),
	|	СУММА(ДоляПлощади)
	|ПО
	|	ЛицевойСчет,
	|	Услуга";
	Запрос.УстановитьПараметр("ТаблицаЛьготы", ТаблицаЛьгот);
	Выполнялка = Запрос.Выполнить();
	//Таб = Выполнялка.Выгрузить();
	ВыборкаЛС = Выполнялка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Отбор = Новый Структура("Приоритет", 2); 
	МассивСтрок = ТаблицаЛьгот.НайтиСтроки(Отбор);
	
	Для каждого Строка Из МассивСтрок Цикл
		
		ТаблицаЛьгот.Удалить(Строка);
		
	КонецЦикла; 
	
	ТаблицаСемейныхЛьгот = ТаблицаЛьгот.СкопироватьКолонки();
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ВыборкаУС = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУС.Следующий() Цикл
			
			Сумма = 0;
			НормаЛьготы = ВыборкаУС.Норма;
			Факт        = ВыборкаУС.Факт;
			
			ВыборкаФизЛицо = ВыборкаУС.Выбрать();
			
			//Пока ВыборкаФизЛицо.Следующий() Цикл
			//	
			//	Если НЕ ВыборкаФизЛицо.ПравоНаЛьготы Тогда
			//	
			//		НормаЛьготы = НормаЛьготы - Норма;
			//	
			//	КонецЕсли; 
			//	
			//КонецЦикла; 
			
			Норматив       = МИН(НормаЛьготы, Факт);
			НормативЛьготы = Норматив;
			//ВыборкаФизЛицо.Сбросить();
			// БИТ_ЖКХ 28.06.2013
			// #1
			//ДоляПлощади = ВыборкаУС.ДоляПлощади;
			//ДоляПлощади = Мин(Норматив, ДоляПлощади);
			
			//ЕстьДоля = НЕ ДоляПлощади = 0;
			
			Пока ВыборкаФизЛицо.Следующий() Цикл
				
				// БИТ_ЖКХ 28.06.2013
				// #1
				//РасчетДолей = (ВыборкаФизЛицо.РасчетДолей И ЕстьДоля);
				НормаЛьготы = ВыборкаФизЛицо.Норма;
				ДоляПлощади = Мин(НормаЛьготы, ВыборкаФизЛицо.ДоляПлощади);
				РасчетДолей = (ВыборкаФизЛицо.РасчетДолей И НЕ ДоляПлощади = 0);
				
				СуммаПеременная = 0;
				СуммаРасчет     = 0;
				
				Если  Норматив <= 0 Тогда
					// Удаляем лишние строки с приоритетом 1 
					Отбор = Новый Структура;
					Отбор.Вставить("ЛицевойСчет", ВыборкаФизЛицо.ЛицевойСчет);
					Отбор.Вставить("Услуга"     , ВыборкаФизЛицо.Услуга);
					Отбор.Вставить("ФизЛицо"    , ВыборкаФизЛицо.ФизЛицо);
					
					Строки = ТаблицаЛьгот.НайтиСтроки(Отбор);
					
					Для каждого Строка Из Строки Цикл
						
						ТаблицаЛьгот.Удалить(Строка);
						
					КонецЦикла;
					
					Продолжить;
					
				КонецЕсли;
				
				Если Норматив >= ВыборкаФизЛицо.Норма Тогда
					
					//Если РасчетДолей И ВыборкаФизЛицо.ПоНорме Тогда
					Если РасчетДолей Тогда
						
						Если ДоляПлощади >= ВыборкаФизЛицо.Норма Тогда
							СуммаПеременная = СуммаПеременная + ВыборкаФизЛицо.СуммаЛичной;
							// БИТ_ЖКХ 28.06.2013
							// #1
							//ДоляПлощади = ДоляПлощади - ВыборкаФизЛицо.Норма;
						ИначеЕсли ДоляПлощади < ВыборкаФизЛицо.Норма И НЕ ДоляПлощади <= 0 Тогда 
							СуммаРасчет = ОКР(ДоляПлощади * ВыборкаФизЛицо.СуммаЛичной / ВыборкаФизЛицо.Норма,4);
							СуммаПеременная = СуммаПеременная + СуммаРасчет;
							НормаЛьготы     = ДоляПлощади;
							ДоляПлощади     = 0;
						ИначеЕсли ДоляПлощади <= 0 Тогда
							НормаЛьготы     = 0;
						КонецЕсли; 
						
					Иначе
						СуммаПеременная = СуммаПеременная + ВыборкаФизЛицо.СуммаЛичной;
					КонецЕсли;
					
					// БИТ_ЖКХ 25.02.2016 18:34:28 Начало правки... 
					//// БИТ_ЖКХ 16.07.2014                           
					////Норматив    = Норматив    - ВыборкаФизЛицо.Норма;
					//Норматив    = Норматив    - Мин(НормаЛьготы,ВыборкаФизЛицо.Норма);
					//// БИТ_ЖКХ 16.07.2014
					////ДоляПлощади = ДоляПлощади - ВыборкаФизЛицо.Норма;
					Если Мосэнергосбыт2016 И ВыборкаФизЛицо.СемейнаяЛьгота И Дата >= Дата('20160101') Тогда
						ОбщаяСемейнаяЛьгота = Мин(НормаЛьготы,ВыборкаФизЛицо.Норма) * ?(ВыборкаФизЛицо.КоличествоНосителей = 0, 1, ВыборкаФизЛицо.КоличествоНосителей);
						// БИТ_ЖКХ 23.03.2016 14:50:20 Начало правки... 
						//Если Норматив >= ОбщаяСемейнаяЛьгота Тогда
						Если Норматив > ОбщаяСемейнаяЛьгота Тогда
						// БИТ_ЖКХ 23.03.2016 14:50:24 Конец правки. 	
							Норматив = Норматив - ОбщаяСемейнаяЛьгота;
						Иначе
							Норматив = Норматив - Мин(НормаЛьготы,ВыборкаФизЛицо.Норма);
						КонецЕсли;
					Иначе
						Норматив = Норматив - Мин(НормаЛьготы,ВыборкаФизЛицо.Норма);
					КонецЕсли;
					// БИТ_ЖКХ 25.02.2016 18:34:30 Конец правки.
					
					Если ВыборкаФизЛицо.Приоритет = 1 Тогда
						
						Отбор.Очистить();
						Отбор.Вставить("ЛицевойСчет", ВыборкаФизЛицо.ЛицевойСчет);
						Отбор.Вставить("Услуга"     , ВыборкаФизЛицо.Услуга);
						Отбор.Вставить("ФизЛицо"    , ВыборкаФизЛицо.ФизЛицо);
						
						МассивСтрок = ТаблицаЛьгот.НайтиСтроки(Отбор);
						
						Для каждого Строка Из МассивСтрок Цикл
							
							Строка.СуммаЛичной = СуммаПеременная;
							Строка.НормаЛьготы = НормаЛьготы;
							
							// БИТ_ЖКХ_02122013_начало_изменений
							Если  Строка.НормативПотребленияПоКу <> 0 Тогда
								
								// БИТ_ЖКХ_01122013_начало_изменений
								Строка.Объем = НормаЛьготы * Строка.НормативПотребленияПоКу;
								// БИТ_ЖКХ_01122013_окончание_изменений
								
							Иначе
								Строка.Объем = Строка.НормаЛьготы;
								
							КонецЕсли;
							// БИТ_ЖКХ_02122013_окончание_изменений
							
						КонецЦикла;
						
					КонецЕсли;
					
					Сумма = Сумма + СуммаПеременная;
					
					Если ВыборкаФизЛицо.СемейнаяЛьгота И ВыборкаФизЛицо.ФизЛицо <> ВыборкаФизЛицо.ВладелецЛьготы Тогда
						
						Отбор = Новый Структура;
						Отбор.Вставить("ЛицевойСчет", ВыборкаФизЛицо.ЛицевойСчет);
						Отбор.Вставить("Услуга"     , ВыборкаФизЛицо.Услуга);
						Отбор.Вставить("ФизЛицо"    , ВыборкаФизЛицо.ВладелецЛьготы);
						
						Строки = ТаблицаЛьгот.НайтиСтроки(Отбор);
						
						Для каждого Строка Из Строки Цикл
							
							//Строка.НачисленоСемейной = Строка.НачисленоСемейной + СуммаПеременная;
							//Строка.НормаЛьготы       = Строка.НормаЛьготы + ВыборкаФизЛицо.Норма;
							
							Если Строка.Льгота = ВыборкаФизЛицо.Льгота Тогда
								
								Если СуммаПеременная > 0 Тогда
									Строка.НачисленоСемейной = Строка.НачисленоСемейной + СуммаПеременная;
									Строка.НормаЛьготы       = Строка.НормаЛьготы       + НормаЛьготы;
									
									// БИТ_ЖКХ_02122013_начало_изменений
									Если  Строка.НормативПотребленияПоКу <> 0 Тогда
										
										// БИТ_ЖКХ_01122013_начало_изменений
										Строка.Объем             = Строка.Объем             + НормаЛьготы * Строка.НормативПотребленияПоКу;
										// БИТ_ЖКХ_01122013_окончание_изменений
										
									Иначе
										Строка.Объем = Строка.НормаЛьготы;
										
									КонецЕсли;
									// БИТ_ЖКХ_02122013_окончание_изменений
									
								КонецЕсли;
								
							Иначе
								
								Отбор.Вставить("Льгота", ВыборкаФизЛицо.Льгота);
								СтрокиСемейнойЛьготы = ТаблицаСемейныхЛьгот.НайтиСтроки(Отбор);
								
								Если НЕ СтрокиСемейнойЛьготы.Количество() = 0 Тогда
									
									Для каждого СтрокаСЛ Из СтрокиСемейнойЛьготы Цикл
										
										СтрокаСЛ.НачисленоСемейной = СтрокаСЛ.НачисленоСемейной + СуммаПеременная;
										СтрокаСЛ.НормаЛьготы       = СтрокаСЛ.НормаЛьготы       + ВыборкаФизЛицо.Норма;
										
										// БИТ_ЖКХ_02122013_начало_изменений
										Если  СтрокаСЛ.НормативПотребленияПоКу <> 0 Тогда
											
											// БИТ_ЖКХ_01122013_начало_изменений
											СтрокаСЛ.Объем             = СтрокаСЛ.Объем             + ВыборкаФизЛицо.Норма * СтрокаСЛ.НормативПотребленияПоКу;
											// БИТ_ЖКХ_01122013_окончание_изменений
											
										Иначе
											Строка.Объем = СтрокаСЛ.НормаЛьготы;
											
										КонецЕсли;
										// БИТ_ЖКХ_02122013_окончание_изменений
										
									КонецЦикла; 
									
								Иначе
									
									НоваяСтрокаСемЛьготы = ТаблицаСемейныхЛьгот.Добавить();
									ЗаполнитьЗначенияСвойств(НоваяСтрокаСемЛьготы, ВыборкаФизЛицо);
									НоваяСтрокаСемЛьготы.ФизЛицо           = ВыборкаФизЛицо.ВладелецЛьготы;
									НоваяСтрокаСемЛьготы.НачисленоСемейной = СуммаПеременная;
									НоваяСтрокаСемЛьготы.НормаЛьготы       = ВыборкаФизЛицо.Норма;
									НоваяСтрокаСемЛьготы.СуммаЛичной       = 0;
									
									// БИТ_ЖКХ_02122013_начало_изменений
									Если  ВыборкаФизЛицо.НормативПотребленияПоКу <> 0 Тогда
										
										// БИТ_ЖКХ_01122013_начало_изменений
										НоваяСтрокаСемЛьготы.Объем             = ВыборкаФизЛицо.Норма * ВыборкаФизЛицо.НормативПотребленияПоКу;
										// БИТ_ЖКХ_01122013_окончание_изменений
										
									Иначе
										НоваяСтрокаСемЛьготы.Объем = НоваяСтрокаСемЛьготы.НормаЛьготы;
										
									КонецЕсли;
									// БИТ_ЖКХ_02122013_окончание_изменений
									
								КонецЕсли; 
								
							КонецЕсли;
							
						КонецЦикла; 
						
						// БИТ_ЖКХ изменение кода. Конец. 14.02.2013}}
						// костыль для расчета с учетом долей владения.
						// при закрытии нормы в ноль нома льготы и сумма личной должны изменится.
						//ИначеЕсли Норматив = 0 И ВыборкаФизЛицо.ФизЛицо = ВыборкаФизЛицо.ВладелецЛьготы
						//	И РасчетДолей Тогда
						//	
						//	Отбор.Очистить();
						//	Отбор.Вставить("ЛицевойСчет", ВыборкаФизЛицо.ЛицевойСчет);
						//	Отбор.Вставить("Услуга"     , ВыборкаФизЛицо.Услуга);
						//	Отбор.Вставить("ФизЛицо"    , ВыборкаФизЛицо.ФизЛицо);
						//	
						//	МассивСтрок = ТаблицаЛьгот.НайтиСтроки(Отбор);
						//	
						//	Для каждого Строка Из МассивСтрок Цикл
						//		
						//		Строка.СуммаЛичной = СуммаПеременная;
						//		Строка.НормаЛьготы = ВыборкаФизЛицо.ДоляПлощади;
						//		
						//	КонецЦикла;
						
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				Если Норматив < ВыборкаФизЛицо.Норма Тогда
					
					//Если РасчетДолей И ВыборкаФизЛицо.ПоНорме Тогда
					Если РасчетДолей Тогда
						Если ДоляПлощади < ВыборкаФизЛицо.Норма И НЕ ДоляПлощади <= 0 Тогда 
							СуммаРасчет = ОКР(ДоляПлощади * ВыборкаФизЛицо.СуммаЛичной / ВыборкаФизЛицо.Норма,4);
							
							// БИТ_ЖКХ 15.07.2014	
						Иначе
							СуммаРасчет = ОКР(Норматив * ВыборкаФизЛицо.СуммаЛичной / ВыборкаФизЛицо.Норма,4);
							// БИТ_ЖКХ 15.07.2014	
							
						КонецЕсли;
					Иначе
						СуммаРасчет = ОКР(Норматив * ВыборкаФизЛицо.СуммаЛичной / ВыборкаФизЛицо.Норма,4);
					КонецЕсли;
					
					//НормаРасчет = ВыборкаФизЛицо.Норма - Норматив;
					//ДоляПлощади = 0;
					//Норматив    = 0;
					
					Если ВыборкаФизЛицо.Приоритет = 1 Тогда
						
						Отбор.Очистить();
						Отбор.Вставить("ЛицевойСчет", ВыборкаФизЛицо.ЛицевойСчет);
						Отбор.Вставить("Услуга"     , ВыборкаФизЛицо.Услуга);
						Отбор.Вставить("ФизЛицо"    , ВыборкаФизЛицо.ФизЛицо);
						
						МассивСтрок = ТаблицаЛьгот.НайтиСтроки(Отбор);
						
						Для каждого Строка Из МассивСтрок Цикл
							
							Строка.СуммаЛичной = СуммаРасчет;
							Строка.НормаЛьготы = Норматив;
							
							// БИТ_ЖКХ_02122013_начало_изменений
							Если  Строка.НормативПотребленияПоКу <> 0 Тогда
								
								// БИТ_ЖКХ_01122013_начало_изменений
								Строка.Объем       = Норматив * Строка.НормативПотребленияПоКу;
								// БИТ_ЖКХ_01122013_окончание_изменений
								
							Иначе
								Строка.Объем = Строка.НормаЛьготы;
								
							КонецЕсли;
							// БИТ_ЖКХ_02122013_окончание_изменений
							
						КонецЦикла;
						
					КонецЕсли;
					
					Сумма = Сумма + СуммаРасчет;
					
					Если ВыборкаФизЛицо.СемейнаяЛьгота И ВыборкаФизЛицо.ФизЛицо <> ВыборкаФизЛицо.ВладелецЛьготы Тогда
						
						Отбор = Новый Структура;
						Отбор.Вставить("ЛицевойСчет", ВыборкаФизЛицо.ЛицевойСчет);
						Отбор.Вставить("Услуга"     , ВыборкаФизЛицо.Услуга);
						Отбор.Вставить("ФизЛицо"    , ВыборкаФизЛицо.ВладелецЛьготы);
						
						Строки = ТаблицаЛьгот.НайтиСтроки(Отбор);
						
						Для каждого Строка Из Строки Цикл
							
							//Строка.НачисленоСемейной = Строка.НачисленоСемейной + СуммаРасчет;
							//Строка.НормаЛьготы       = Строка.НормаЛьготы       + Норматив;
							
							Если Строка.Льгота = ВыборкаФизЛицо.Льгота Тогда
								
								Строка.НачисленоСемейной = Строка.НачисленоСемейной + СуммаРасчет;
								Строка.НормаЛьготы       = Строка.НормаЛьготы + Норматив;
								
								// БИТ_ЖКХ_02122013_начало_изменений
								Если  Строка.НормативПотребленияПоКу <> 0 Тогда
									
									// БИТ_ЖКХ_01122013_начало_изменений
									Строка.Объем             = Строка.Объем       + Норматив * Строка.НормативПотребленияПоКу;
									// БИТ_ЖКХ_01122013_окончание_изменений
									
								Иначе
									Строка.Объем = Строка.НормаЛьготы;
									
								КонецЕсли;
								// БИТ_ЖКХ_02122013_окончание_изменений
								
							Иначе
								
								Отбор.Вставить("Льгота", ВыборкаФизЛицо.Льгота);
								СтрокиСемейнойЛьготы = ТаблицаСемейныхЛьгот.НайтиСтроки(Отбор);
								
								Если НЕ СтрокиСемейнойЛьготы.Количество() = 0 Тогда
									
									Для каждого СтрокаСЛ Из СтрокиСемейнойЛьготы Цикл
										
										СтрокаСЛ.НачисленоСемейной = СтрокаСЛ.НачисленоСемейной + СуммаРасчет;
										СтрокаСЛ.НормаЛьготы       = СтрокаСЛ.НормаЛьготы       + Норматив;
										
										// БИТ_ЖКХ_02122013_начало_изменений
										Если  СтрокаСЛ.НормативПотребленияПоКу <> 0 Тогда
											
											// БИТ_ЖКХ_01122013_начало_изменений
											СтрокаСЛ.Объем             = СтрокаСЛ.Объем             + Норматив * СтрокаСЛ.НормативПотребленияПоКу;
											// БИТ_ЖКХ_01122013_окончание_изменений
											
										Иначе
											СтрокаСЛ.Объем = СтрокаСЛ.НормаЛьготы;
											
										КонецЕсли;
										// БИТ_ЖКХ_02122013_окончание_изменений
										
									КонецЦикла; 
									
								Иначе
									
									НоваяСтрокаСемЛьготы = ТаблицаСемейныхЛьгот.Добавить();
									ЗаполнитьЗначенияСвойств(НоваяСтрокаСемЛьготы, ВыборкаФизЛицо);
									НоваяСтрокаСемЛьготы.ФизЛицо           = ВыборкаФизЛицо.ВладелецЛьготы;
									НоваяСтрокаСемЛьготы.НачисленоСемейной = СуммаРасчет;
									// БИТ_ЖКХ 01.07.2016 17:31:14 Начало правки... 
									//НоваяСтрокаСемЛьготы.НормаЛьготы       = ВыборкаФизЛицо.Норма;
									НоваяСтрокаСемЛьготы.НормаЛьготы       = Норматив;
									// БИТ_ЖКХ 01.07.2016 17:31:15 Конец правки. 
									НоваяСтрокаСемЛьготы.СуммаЛичной       = 0;
									
									// БИТ_ЖКХ_02122013_начало_изменений
									Если  ВыборкаФизЛицо.НормативПотребленияПоКу <> 0 Тогда
										
										// БИТ_ЖКХ 01.07.2016 17:31:34 Начало правки... 
										//// БИТ_ЖКХ_01122013_начало_изменений
										//НоваяСтрокаСемЛьготы.Объем             = ВыборкаФизЛицо.Норма * ВыборкаФизЛицо.НормативПотребленияПоКу;
										//// БИТ_ЖКХ_01122013_окончание_изменений
										НоваяСтрокаСемЛьготы.Объем             = Норматив * ВыборкаФизЛицо.НормативПотребленияПоКу;
										// БИТ_ЖКХ 01.07.2016 17:31:35 Конец правки. 
										
									Иначе
										НоваяСтрокаСемЛьготы.Объем = НоваяСтрокаСемЛьготы.НормаЛьготы;
										
									КонецЕсли;
									// БИТ_ЖКХ_02122013_окончание_изменений
									
								КонецЕсли; 
								
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли;
					
					ДоляПлощади = 0;
					Норматив    = 0;
					
					Продолжить;
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Отбор.Очистить();
			Отбор.Вставить("ЛицевойСчет", ВыборкаУС.ЛицевойСчет);
			Отбор.Вставить("Услуга"     , ВыборкаУС.Услуга);
			
			Для каждого Строка Из ТаблицаСемейныхЛьгот Цикл
				
				НоваяСтрока = ТаблицаЛьгот.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
			КонецЦикла;
			
			ТаблицаСемейныхЛьгот.Очистить();
			
			МассивСтрок = ТаблицаЛьгот.НайтиСтроки(Отбор);
			
			Для каждого Строка Из МассивСтрок Цикл
				
				Строка.Начислено   = Сумма;
				
			КонецЦикла;
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ОбъектСравнения = Новый СравнениеЗначений;
	ТаблицаЛьгот.Сортировать("ЛицевойСчет Возр, ПриоритетУслуги Возр", ОбъектСравнения);
	
КонецПроцедуры

// Процедура выполняет расчет начислений с учетом дней проживания.
//
Процедура РасчитатьНачисленияСУчетомДнейПроживания(Запрос, Дата, ТаблицаПроживающих)
	
	ТаблицаРасчета = Новый ТаблицаЗначений;
	ТаблицаРасчета.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаРасчета.Колонки.Добавить("ФизЛицо"                   , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	ТаблицаРасчета.Колонки.Добавить("КоличествоДней"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаРасчета.Колонки.Добавить("ПроживаниеВданныйМомент"   , Новый ОписаниеТипов("Булево"));
	
	Запрос.Текст = 
		
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации,
	|	ЕСТЬNULL(ТаблицаФизЛиц.ПроживаниеВДанныйМомент, ЛОЖЬ) КАК ПроживаниеВданныйМомент
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаФизЛиц КАК ТаблицаФизЛиц
	|		ПО бит_ПроживающиеПоЛС.ЛицевойСчет = ТаблицаФизЛиц.ЛицевойСчет
	|			И бит_ПроживающиеПоЛС.ФизЛицо = ТаблицаФизЛиц.ФизЛицо
	|ГДЕ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет В(&СписокЛС)
	|	И бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаФизЛиц.ЛицевойСчет,
	|	ТаблицаФизЛиц.ФизЛицо,
	|	ТаблицаФизЛиц.ДатаРегистрации,
	|	ТаблицаФизЛиц.ДатаСнятияСРегистрации,
	|	ТаблицаФизЛиц.ПроживаниеВДанныйМомент
	|ИЗ
	|	ТаблицаФизЛиц КАК ТаблицаФизЛиц
	|ГДЕ
	|	ТаблицаФизЛиц.ДатаРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет,
	|	ДатаРегистрации
	|ИТОГИ
	|	МАКСИМУМ(ПроживаниеВданныйМомент)
	|ПО
	|	ЛицевойСчет,
	|	ФизЛицо";
	
	Выполнялка = Запрос.Выполнить();
	ВыборкаЛС  = Выполнялка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КолДнейВМесяце = День(КонецМесяца(Дата));
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ВыборкаФизЛиц = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаФизЛиц.Следующий() Цикл
			
			Выборка = ВыборкаФизЛиц.Выбрать();
						
			КолДнейРасчет = 0;
			Пока Выборка.Следующий() Цикл
				
				НачалоПериода = ?(ЗначениеЗаполнено(Выборка.ДатаРегистрации) И Выборка.ДатаРегистрации > НачалоМесяца(Дата),Выборка.ДатаРегистрации,НачалоМесяца(Дата));
				КонецПериода  = ?(ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации),Выборка.ДатаСнятияСРегистрации,КонецМесяца(Дата));
				
				// БИТ_ЖКХ 03.10.2014
				Если Месяц(Дата) <> Месяц(КонецПериода) или Год(Дата) <> Год(КонецПериода) Тогда
					КолДнейРасчет = КолДнейРасчет + (День(КонецМесяца(Дата)) - День(НачалоПериода) + 1);
				Иначе
					КолДнейРасчет = КолДнейРасчет + (День(КонецПериода) - День(НачалоПериода) + 1);
				КонецЕсли;	
				// БИТ_ЖКХ 03.10.2014
				
				// БИТ_ЖКХ 30.09.2014
				// Если КолДнейРасчет >= КолДнейВМесяце Тогда.
				Если КолДнейРасчет > КолДнейВМесяце Тогда
					// БИТ_ЖКХ 30.09.2014
					
					КолДнейРасчет = 0;
					Прервать;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если  КолДнейРасчет > 0 Тогда
				
				НоваяСтрока = ТаблицаРасчета.Добавить();
				НоваяСтрока.ЛицевойСчет             = ВыборкаЛС.ЛицевойСчет;
				НоваяСтрока.ФизЛицо                 = ВыборкаФизЛиц.ФизЛицо;
				НоваяСтрока.КоличествоДней          = КолДнейРасчет;
				НоваяСтрока.ПроживаниеВданныйМомент = ВыборкаФизЛиц.ПроживаниеВданныйМомент;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	// БИТ_ЖКХ 05.09.2014
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица КАК СтатусФизЛица,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица.ПроживаниеВДанныйМомент
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|ГДЕ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет В(&ЛицевойСчет)
	|	И бит_ПроживающиеПоЛС.ФизЛицо В(&ФизЛицо)
	|	И бит_ПроживающиеПоЛС.Период >= ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	// БИТ_ЖКХ 29.09.2014
	|	И бит_ПроживающиеПоЛС.Период <= &Дата
	// БИТ_ЖКХ 29.09.2014
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛС.ЛицевойСчет,
	|	бит_ПроживающиеПоЛС.ФизЛицо,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица.ПроживаниеВДанныйМомент";
	
	// БИТ_ЖКХ 29.09.2014{{
	Запрос2.УстановитьПараметр("Дата", Дата);
	// БИТ_ЖКХ 29.09.2014}}
	
	Запрос2.УстановитьПараметр("ЛицевойСчет", Запрос.Параметры.СписокЛС);
	Запрос2.УстановитьПараметр("Удален", ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан"));
	СписокФизЛиц = Новый СписокЗначений;
	ФизЛица = ТаблицаРасчета.ВыгрузитьКолонку("ФизЛицо");
	СписокФизЛиц.ЗагрузитьЗначения(ФизЛица);
	
	Запрос2.УстановитьПараметр("ФизЛицо", СписокФизЛиц);
	
	ТЗ = Запрос2.Выполнить().выгрузить();
	ТЗ.Сортировать("ДатаСнятияСРегистрации Убыв");
	ТЗ.Индексы.Добавить("Физлицо");
	
	ТаблицаРасчета.Колонки.Добавить("ПроживалНаМоментНачисления");
	ТаблицаРасчета.Индексы.Добавить("Физлицо");
	ТаблицаРасчета.Индексы.Добавить("ЛицевойСчет");
	
	Для каждого Строка из ТЗ Цикл
		
		// БИТ_ЖКХ 30.10.2014{{
		// Если Строка.СтатусФизЛицаПроживаниеВДанныйМоМент  = Ложь Тогда.
		
		Отбор = Новый Структура();
		Отбор.Вставить("Физлицо",Строка.Физлицо);
		Строки = ТЗ.НайтиСтроки(Отбор);
		
		СтрокиПроживалНаМоментНачисления = ТаблицаРасчета.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаМассива из СтрокиПроживалНаМоментНачисления Цикл
			
			Если СтрокаМассива.ПроживаниеВДанныйМомент  = Ложь Тогда
				
				Шаг = 0;
				
				Для каждого СтрокаОтбора из Строки Цикл
					
					Шаг = Шаг + 1;	
					
					Если Шаг > 2 Тогда
						
						Прервать;
						
					КонецЕсли;	
					ПроживалНаМоментНачисления = Ложь;
					
					Если СтрокаОтбора.СтатусФизЛицаПроживаниеВДанныйМоМент Тогда
						
						ПроживалНаМоментНачисления = Истина;
						
						// БИТ_ЖКХ 23.09.2014{{	
						// СтрокиПроживалНаМоментНачисления = ТаблицаРасчета.НайтиСтроки(Отбор);.
						
						Для каждого СтрокаПроживалНаМоментНачисления из СтрокиПроживалНаМоментНачисления Цикл
							
							СтрокаПроживалНаМоментНачисления.ПроживалНаМоментНачисления = Истина;
							
						КонецЦикла;	
						// БИТ_ЖКХ 23.09.2014}}
						
						Прервать;
						
					КонецЕсли;	
					
				КонецЦикла;	
				
			КонецЕсли;	
			// БИТ_ЖКХ 30.10.2014}}
			
		КонецЦикла;	
		
	КонецЦикла;	
	// БИТ_ЖКХ 05.09.2014}}
	
	// БИТ_ЖКХ изменение кода. Конец. 13.01.2012}}
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНорм.ЛицевойСчет,
	|	ТаблицаНорм.Услуга,
	|	ТаблицаНорм.Ставка,
	|	ТаблицаНорм.СпособРасчета
	|ИЗ
	|	ТаблицаНорм КАК ТаблицаНорм
	|ГДЕ
	|	ТаблицаНорм.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура;
		отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		
		КолДнейМесяц = День(КонецМесяца(Дата));
		СтрокиПоиска = ТаблицаРасчета.НайтиСтроки(Отбор);
		
		Для каждого Строка Из СтрокиПоиска Цикл
			
			// БИТ_ЖКХ 19.03.2013
			// Добавлено условие проживания по ЛС.
			Если Строка.ПроживаниеВданныйМомент Тогда
				
				НоваяСтрока = ТаблицаПроживающих.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.Начислено = Окр((Строка.КоличествоДней*Выборка.Ставка)/КолДнейМесяц, 4);
				
				// БИТ_ЖКХ 29.09.2014{{
				// КонецЕсли;.
			ИначеЕсли Строка.ПроживалНаМоментНачисления = Истина Тогда
				
				НоваяСтрока = ТаблицаПроживающих.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.Начислено = Окр((Строка.КоличествоДней*Выборка.Ставка)/КолДнейМесяц, 4);
				
			КонецЕсли;
			// БИТ_ЖКХ 23.09.2014}}
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры // ()

// Процедура выполняет расчет начислений с учетом дней проживания.
//
Процедура РасчитатьНачисленияСУчетомДнейСобственности(Запрос, Дата, ТаблицаПроживающих)
	
	ТаблицаРасчета = Новый ТаблицаЗначений;
	ТаблицаРасчета.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаРасчета.Колонки.Добавить("ФизЛицо"                   , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	ТаблицаРасчета.Колонки.Добавить("КоличествоДней"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаРасчета.Колонки.Добавить("ПроживаниеВданныйМомент"   , Новый ОписаниеТипов("Булево"));
	
	// БИТ ЖКх 13.04.2020
	ЗапросВладельцев = новый Запрос;
	ЗапросВладельцев.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаПраваСобственности КАК ДатаПраваСобственности
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет В(&СписокЛС)
	|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &СтепеньРодства
	|	И бит_ПроживающиеПоЛССрезПоследних.ДатаПраваСобственности МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПраваСобственности УБЫВ";
	
	ЗапросВладельцев.УстановитьПараметр("СписокЛС", Запрос.Параметры.СписокЛС);
	ЗапросВладельцев.УстановитьПараметр("СтепеньРодства", справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
    ЗапросВладельцев.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	ЗапросВладельцев.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	
	табВладельцев = ЗапросВладельцев.Выполнить().Выгрузить();
	списокКвартир = новый массив;
	для каждого стрЛС из Запрос.Параметры.СписокЛС цикл  
	 списокКвартир.Добавить(стрЛС.Квартира);
	конеццикла; 
	
	// БИТ ЖКХ 21.04.2020
	
    запросКвартир = новый запрос;
	запросКвартир.Текст = "ВЫБРАТЬ
	                      |	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	                      |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	                      |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	                      |	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	                      |	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь
	                      |ИЗ
	                      |	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Период, ) КАК бит_СведенияОКвартиреСрезПоследних
	                      |ГДЕ
	                      |	бит_СведенияОКвартиреСрезПоследних.Квартира В(&СписокКвартир)";
	
    запросКвартир.УстановитьПараметр("СписокКвартир", списокКвартир);
	запросКвартир.УстановитьПараметр("Период", КонецМесяца(Дата));
	таблицаКвартир = запросКвартир.Выполнить().Выгрузить();
	
	ТаблицаРасчета.Колонки.Добавить("ОбщаяПлощадь");
	
	// БИТ ЖКХ 15.04.2020
	табЛС = табВладельцев.Скопировать();
	табЛС.Свернуть("ЛицевойСчет");
	
	ТаблицаРасчета.Очистить();
	КолДнейВМесяце = День(КонецМесяца(Дата));
	
	для каждого стрЛС из табЛС цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", стрЛС.ЛицевойСчет);
		
		Строки = табВладельцев.НайтиСтроки(Отбор);  
		для каждого стр из Строки цикл
			
		    если стр.ДатаСнятияСРегистрации <> '00010101000000' тогда
				КолДнейРасчет = День((КонецДня(стр.ДатаПраваСобственности))) - День(НачалоМесяца(Дата));
			иначе
				КолДнейРасчет = День(КонецМесяца(Дата))- День(стр.ДатаПраваСобственности);
			конецесли;	
			
			КолДнейРасчет = КолДнейРасчет + 1;
			Если КолДнейРасчет > КолДнейВМесяце Тогда			
				КолДнейРасчет = 0;                   					
			КонецЕсли; 			                     		 
				
			Если  КолДнейРасчет > 0 Тогда
				
				НоваяСтрока = ТаблицаРасчета.Добавить();
				НоваяСтрока.ЛицевойСчет             = стр.ЛицевойСчет;
				НоваяСтрока.ФизЛицо                 = стр.ФизЛицо;
				НоваяСтрока.КоличествоДней          = КолДнейРасчет;
				НоваяСтрока.ПроживаниеВданныйМомент = истина;//ВыборкаФизЛиц.ПроживаниеВданныйМомент;
				
				Отбор = Новый Структура;
				Отбор.Вставить("Квартира", стр.ЛицевойСчет.Квартира);
				
				если ЗначениеЗаполнено (таблицаКвартир) тогда
					ПоискСтрокиКвартир = таблицаКвартир.НайтиСтроки(Отбор);
					если ПоискСтрокиКвартир.Количество() > 0 тогда
					  НоваяСтрока.ОбщаяПлощадь = ПоискСтрокиКвартир[0].ОбщаяПлощадь;	
				    конецесли;
			    конецесли;
				
			КонецЕсли;

		конеццикла;
	конеццикла;	
	
	// БИТ_ЖКХ 05.09.2014
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица КАК СтатусФизЛица,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица.ПроживаниеВДанныйМомент
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|ГДЕ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет В(&ЛицевойСчет)
	|	И бит_ПроживающиеПоЛС.ФизЛицо В(&ФизЛицо)
	|	И бит_ПроживающиеПоЛС.Период >= ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	// БИТ_ЖКХ 29.09.2014
	|	И бит_ПроживающиеПоЛС.Период <= &Дата
	// БИТ_ЖКХ 29.09.2014
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛС.ЛицевойСчет,
	|	бит_ПроживающиеПоЛС.ФизЛицо,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица.ПроживаниеВДанныйМомент";
	
	// БИТ_ЖКХ 29.09.2014{{
	Запрос2.УстановитьПараметр("Дата", Дата);
	// БИТ_ЖКХ 29.09.2014}}
	
	Запрос2.УстановитьПараметр("ЛицевойСчет", Запрос.Параметры.СписокЛС);
	Запрос2.УстановитьПараметр("Удален", ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан"));
	СписокФизЛиц = Новый СписокЗначений;
	ФизЛица = ТаблицаРасчета.ВыгрузитьКолонку("ФизЛицо");
	СписокФизЛиц.ЗагрузитьЗначения(ФизЛица);
	
	Запрос2.УстановитьПараметр("ФизЛицо", СписокФизЛиц);
	
	ТЗ = Запрос2.Выполнить().выгрузить();
	ТЗ.Сортировать("ДатаСнятияСРегистрации Убыв");
	ТЗ.Индексы.Добавить("Физлицо");
	
	ТаблицаРасчета.Колонки.Добавить("ПроживалНаМоментНачисления");
	ТаблицаРасчета.Индексы.Добавить("Физлицо");
	ТаблицаРасчета.Индексы.Добавить("ЛицевойСчет");
	
	Для каждого Строка из ТЗ Цикл
		
		// БИТ_ЖКХ 30.10.2014{{
		// Если Строка.СтатусФизЛицаПроживаниеВДанныйМоМент  = Ложь Тогда.
		
		Отбор = Новый Структура();
		Отбор.Вставить("Физлицо",Строка.Физлицо);
		Строки = ТЗ.НайтиСтроки(Отбор);
		
		СтрокиПроживалНаМоментНачисления = ТаблицаРасчета.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаМассива из СтрокиПроживалНаМоментНачисления Цикл
			
			Если СтрокаМассива.ПроживаниеВДанныйМомент  = Ложь Тогда
				
				Шаг = 0;
				
				Для каждого СтрокаОтбора из Строки Цикл
					
					Шаг = Шаг + 1;	
					
					Если Шаг > 2 Тогда
						
						Прервать;
						
					КонецЕсли;	
					ПроживалНаМоментНачисления = Ложь;
					
					Если СтрокаОтбора.СтатусФизЛицаПроживаниеВДанныйМоМент Тогда
						
						ПроживалНаМоментНачисления = Истина;
						
						// БИТ_ЖКХ 23.09.2014{{	
						// СтрокиПроживалНаМоментНачисления = ТаблицаРасчета.НайтиСтроки(Отбор);.
						
						Для каждого СтрокаПроживалНаМоментНачисления из СтрокиПроживалНаМоментНачисления Цикл
							
							СтрокаПроживалНаМоментНачисления.ПроживалНаМоментНачисления = Истина;
							
						КонецЦикла;	
						// БИТ_ЖКХ 23.09.2014}}
						
						Прервать;
						
					КонецЕсли;	
					
				КонецЦикла;	
				
			КонецЕсли;	
			// БИТ_ЖКХ 30.10.2014}}
			
		КонецЦикла;	
		
	КонецЦикла;	
	// БИТ_ЖКХ 05.09.2014}}
	
	// БИТ_ЖКХ изменение кода. Конец. 13.01.2012}}
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНорм.ЛицевойСчет,
	|	ТаблицаНорм.Услуга,
	|	ТаблицаНорм.Ставка,
	|	ТаблицаНорм.СпособРасчета
	|ИЗ
	|	ТаблицаНорм КАК ТаблицаНорм
	|ГДЕ
	|	ТаблицаНорм.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|   ИЛИ ТаблицаНорм.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)   
	|   ИЛИ ТаблицаНорм.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)";
	
	//Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади
	//Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади
	//Перечисления.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади
	//
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	// БИТ ЖКХ 21.04.2020
	ТаблицаПроживающих.Колонки.Добавить("ОбщаяПлощадь");
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура;
		отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		
		КолДнейМесяц = День(КонецМесяца(Дата));
		СтрокиПоиска = ТаблицаРасчета.НайтиСтроки(Отбор);
		
		Для каждого Строка Из СтрокиПоиска Цикл
			
			// БИТ_ЖКХ 19.03.2013
			// Добавлено условие проживания по ЛС.
			Если Строка.ПроживаниеВданныйМомент Тогда
				
				НоваяСтрока = ТаблицаПроживающих.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				// БИТ ЖКХ 15.04.2020
				//НоваяСтрока.Начислено = Окр((Строка.КоличествоДней*Выборка.Ставка)/КолДнейМесяц, 4);
				НоваяСтрока.Начислено = Окр((Строка.КоличествоДней*Выборка.Ставка), 4);

				
				// БИТ_ЖКХ 29.09.2014{{
				// КонецЕсли;.
			ИначеЕсли Строка.ПроживалНаМоментНачисления = Истина Тогда
				
				НоваяСтрока = ТаблицаПроживающих.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				// БИТ ЖКХ 15.04.2020
				//НоваяСтрока.Начислено = Окр((Строка.КоличествоДней*Выборка.Ставка)/КолДнейМесяц, 4);
				НоваяСтрока.Начислено = Окр((Строка.КоличествоДней*Выборка.Ставка), 4);
				
			КонецЕсли;
			// БИТ_ЖКХ 23.09.2014}}
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры // ()

// БИТ ЖКХ 09.04.2020         
функция ОтветственноеЛицоНаЛСПоВладению(ЛицевойСчет, ФизЛицо, ПериодЗапроса)          	
	
	структураВозврата = новый СТруктура();
	
	запрос = новый Запрос;
	запрос.Текст = 
		
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаПраваСобственности КАК ДатаПраваСобственности,
	|	бит_ПроживающиеПоЛССрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&ПериодЗапроса, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = &ФизЛицо
	|	И бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет";
//	|	И бит_ПроживающиеПоЛС.СтатусФизЛица <> &СтатусФизЛица";
	
	запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодЗапроса));
	запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодЗапроса));
	запрос.УстановитьПараметр("СтатусФизЛица", справочники.бит_СтатусФизЛица.Выписан);
    запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	запрос.УстановитьПараметр("ПериодЗапроса", КонецМесяца(ПериодЗапроса));
	
	таблицаЗапроса = запрос.Выполнить().Выгрузить();
	
	если таблицаЗапроса.Найти(справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо, "СтепеньРодства") = неопределено тогда
	 структураВозврата.Вставить("ФизЛицо", таблицаЗапроса[0].ФизЛицо);
	 структураВозврата.Вставить("Ответственный", ложь);	
	 
	 возврат структураВозврата;
    конецесли;
	
	если таблицаЗапроса.Количество() > 0 тогда
		таблицаЗапроса.Сортировать("ДатаПраваСобственности Убыв");
		
		;
		// БИТ ЖКХ 10.04.2020 - сейчас ответственный?		
		если таблицаЗапроса[0].СтепеньРодства = справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда 
		  структураВозврата.Вставить("ФизЛицо", таблицаЗапроса[0].ФизЛицо);
		  если ДатаВПериоде (таблицаЗапроса[0].ДатаПраваСобственности, ПериодЗапроса) тогда
		   структураВозврата.Вставить("Ответственный", истина); 
	      иначе
		   структураВозврата.Вставить("Ответственный", истина); 
		  конецесли; 
		  структураВозврата.Вставить("ДатаСнятияСРегистрации", таблицаЗапроса[0].ДатаСнятияСРегистрации);
		  структураВозврата.Вставить("ДатаРегистрации", таблицаЗапроса[0].ДатаПраваСобственности);
		  
	    иначе	  
		  структураВозврата.Вставить("ФизЛицо", таблицаЗапроса[0].ФизЛицо);
	      структураВозврата.Вставить("Ответственный", ложь);	
	      возврат структураВозврата;
		конецесли;	         					 
    конецесли;			
 
	возврат структураВозврата; 
конецфункции

// БИТ ЖКХ 09.04.2020         
функция ОтветственноеЛицоНаЛСПоРегистрации(ФизЛицо, ПериодЗапроса)          	
	
	структураВозврата = новый СТруктура();
	
	запрос = новый Запрос;
	запрос.Текст = 
		
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица КАК СтатусФизЛица,
	|	бит_ПроживающиеПоЛС.СтепеньРодства КАК СтепеньРодства,
	|	бит_ПроживающиеПоЛС.СтатусПроживания КАК СтатусПроживания,
	|	бит_ПроживающиеПоЛС.ДатаПраваСобственности КАК ДатаПраваСобственности
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|ГДЕ
	|	бит_ПроживающиеПоЛС.ФизЛицо = &ФизЛицо";
	
	запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодЗапроса));
	запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодЗапроса));

	таблицаЗапроса = запрос.Выполнить().Выгрузить();
	
	если таблицаЗапроса.Найти(справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо, "СтепеньРодства") = неопределено тогда
	 структураВозврата.Вставить("ФизЛицо", таблицаЗапроса[0].ФизЛицо);
	 структураВозврата.Вставить("Ответственный", ложь);	
	 возврат структураВозврата;
    конецесли;
	
	если таблицаЗапроса.Количество() > 0 тогда
		таблицаЗапроса.Сортировать("ДатаРегистрации Убыв");
		
		// БИТ ЖКХ 10.04.2020 - сейчас ответственный?		
		если таблицаЗапроса[0].СтепеньРодства = справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда 
		  структураВозврата.Вставить("ФизЛицо", таблицаЗапроса[0].ФизЛицо);
		  если ДатаВПериоде (таблицаЗапроса[0].ДатаРегистрации, ПериодЗапроса) тогда
		   структураВозврата.Вставить("Ответственный", истина); 
	      иначе
		   структураВозврата.Вставить("Ответственный", истина); 
		  конецесли; 
		  структураВозврата.Вставить("ДатаСнятияСРегистрации", таблицаЗапроса[0].ДатаСнятияСРегистрации);
		  структураВозврата.Вставить("ДатаРегистрации", таблицаЗапроса[0].ДатаРегистрации);
		  
		  возврат структураВозврата; 
		конецесли;	         		
		
		// БИТ ЖКХ 10.04.2020 - когда был ответственным?
		датаСнятияСтатуса = НайтиДатуСнятияОтветственногоПоРегистрации (таблицаЗапроса);
		
		если ДатаВПериоде (датаСнятияСтатуса, ПериодЗапроса) тогда		
		 структураВозврата.Вставить("ФизЛицо", таблицаЗапроса[0].ФизЛицо);
		 структураВозврата.Вставить("Ответственный", истина); 
		 структураВозврата.Вставить("ДатаСнятияСРегистрации",датаСнятияСтатуса);
		 структураВозврата.Вставить("ДатаРегистрации", '00010101000000');		 
	    иначе
		 структураВозврата.Вставить("ФизЛицо", таблицаЗапроса[0].ФизЛицо);
	     структураВозврата.Вставить("Ответственный", ложь);
	 конецесли; 
	 
    конецесли;			
 
	возврат структураВозврата; 
конецфункции

функция НайтиДатуСнятияОтветственногоПоВладению (ФизЛицо, таблицаЗапроса) 
	
  датаСтатуса = таблицаЗапроса[0].ДатаПраваСобственности; 	
  
  для каждого стр из таблицаЗапроса цикл
	  
	если стр.СтепеньРодства = справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда  
	  возврат датаСтатуса;        	  
    иначе
	  датаСтатуса = стр.ДатаПраваСобственности; 
	конецесли;
		
  конеццикла;	  
  возврат датаСтатуса;
конецфункции	

функция НайтиДатуСнятияОтветственногоПоРегистрации (таблицаЗапроса) 
	
  датаСтатуса = таблицаЗапроса[0].ДатаРегистрации; 	
  
  для каждого стр из таблицаЗапроса цикл
	  
	если стр.СтепеньРодства = справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда  
	  возврат датаСтатуса;        	  
    иначе
	  датаСтатуса = стр.ДатаРегистрации; 
	конецесли;
		
  конеццикла;	  
  возврат датаСтатуса;
конецфункции

функция ДатаВпериоде (ДатаСтатуса, Период)
	
	если ДатаСтатуса >= НачалоМесяца(Период) и ДатаСтатуса <= КонецМесяца(Период) тогда
		возврат истина;
	иначе
		возврат ложь;
	конецесли;
	
конецфункции	

// Процедура выполняет расчет начислений по групповым счетчикам с наличием индивидуальных.
//
Процедура РасчитатьНачисленияПоОбщедомовымРасходам(Дата, НачалоПериода, КонецПериода,Организация, ТаблицаОбщедомовыеНачисления, УчитыватьНачисленияПоГрупповымСчетчикам = Ложь, УчитыватьПерерасчет = Ложь) Экспорт
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Таблица в которой хранится сведения о начилениях лицевого счета по услуге.
	// С учетом распределенного и не распределеного остатка общедомового счетчика.
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	ТаблицаРасчетов.Колонки.Добавить("ЛицевойСчет"            , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаРасчетов.Колонки.Добавить("Услуга"                 , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаРасчетов.Колонки.Добавить("СуммаНачислений"        , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРасчетов.Колонки.Добавить("НераспределенныйОстаток", ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	
	Запрос.УстановитьПараметр("Дата"         , КонецДня(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода" , КонецМесяца(КонецПериода));
	
	Запрос.УстановитьПараметр("УчитыватьНачисленияПоГрупповымСчетчикам", УчитыватьНачисленияПоГрупповымСчетчикам);
	Запрос.УстановитьПараметр("УчитыватьПерерасчет"                    , УчитыватьПерерасчет);
	
	Запрос.УстановитьПараметр("Организация"  , Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоНорма,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщиеНачисления,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые
	|ПОМЕСТИТЬ НачисленияНорм
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоСчетчикамОбороты.ЛицевойСчет,
	|	бит_НачисленияПоСчетчикамОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоСчетчикамОбороты.Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|				ТОГДА бит_НачисленияПоСчетчикамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоСчетчик,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоСчетчикамОбороты.Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	|					И бит_НачисленияПоСчетчикамОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ТОГДА бит_НачисленияПоСчетчикамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоГрупСчетчик
	|ПОМЕСТИТЬ НачисленияСчетчиков
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоСчетчикам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоСчетчикамОбороты
	|ГДЕ
	|	бит_НачисленияПоСчетчикамОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоСчетчикамОбороты.ЛицевойСчет,
	|	бит_НачисленияПоСчетчикамОбороты.УслугаЖКХ";
	
	Запрос.Выполнить();
	
	ТекстОтбор = 
	"ВЫБРАТЬ
	|	ПоказанийСчетчиков.Услуга,
	|	ПоказанийСчетчиков.Счетчик КАК Счетчик,
	|	ПоказанийСчетчиков.ЛицевойСчет,
	|	ЕСТЬNULL(НачисленоПоСчетчикам.НачисленоСчетчик, 0) КАК СуммаПоСчетчикамРасч,
	|	ЕСТЬNULL(НачисленияПоНорме.НачисленоНорма, 0) КАК СуммаНормативРасч,
	|	ЕСТЬNULL(НачисленоПоСчетчикам.НачисленоГрупСчетчик, 0) КАК СуммаНачисленоГрупСчетчик
	|ИЗ
	|	ПоказанийСчетчиков КАК ПоказанийСчетчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСчетчиков КАК НачисленоПоСчетчикам
	|		ПО ПоказанийСчетчиков.Услуга = НачисленоПоСчетчикам.Услуга
	|			И ПоказанийСчетчиков.ЛицевойСчет = НачисленоПоСчетчикам.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияНорм КАК НачисленияПоНорме
	|		ПО ПоказанийСчетчиков.Услуга = НачисленияПоНорме.Услуга
	|			И ПоказанийСчетчиков.ЛицевойСчет = НачисленияПоНорме.Лицевойсчет
	|ГДЕ
	|	НЕ ПоказанийСчетчиков.ЛицевойСчет В (&МассивИсключений)
	|	И ПоказанийСчетчиков.Услуга = &Услуга
	|	И ПоказанийСчетчиков.Счетчик = &Счетчик
	|ИТОГИ
	|	СУММА(СуммаПоСчетчикамРасч),
	|	СУММА(СуммаНормативРасч),
	|	СУММА(СуммаНачисленоГрупСчетчик)
	|ПО
	|	ОБЩИЕ";
	
	// БИТ_ЖКХ_01082013_изменен_текст_запроса
	// Добавлен расчет начислений с учетом ставки на услугу.	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Наименование КАК НаименованиеЛС,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет КАК ПриоритетСЧ,
	|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка КАК СтавкаСчетчика,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьСтавкуПоСчетчику,
	|	бит_СтавкиНаУслугиСрезПоследних.Тариф КАК ТарифСчетчика,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьПравилоУменьшения,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчетаУменьшения,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределенияУменьшения
	|ПОМЕСТИТЬ Счетчики
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных)
	|				И СпособРаспределения <> ЗНАЧЕНИЕ(Перечисление.бит_СпособыРаспределения.ПустаяСсылка)
	|				И ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
	|				И Объект.Организация = &Организация) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Дата, ) КАК бит_ГрупповыеСчетчикиСрезПоследних
	|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = бит_ГрупповыеСчетчикиСрезПоследних.Услуга
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&Дата, СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|			И (ВЫБОР
	|				КОГДА бит_СчетчикиНаУслугахОбщийСрезПоследних.РежимПотребления = ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.ПустаяСсылка)
	|					ТОГДА бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга.ОсновнойРежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|				ИНАЧЕ бит_СчетчикиНаУслугахОбщийСрезПоследних.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			КОНЕЦ)
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|	И бит_ГрупповыеСчетчикиСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счетчики.ЛицевойСчет,
	|	Счетчики.Услуга,
	|	Счетчики.Счетчик,
	|	Счетчики.СпособРаспределения,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ОтПоказаний,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0
	|				ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ, 0) КАК ДоПоказаний,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0
	|							ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|						ИНАЧЕ ВЫБОР
	|								КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0
	|									ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ, 0) - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
	|				ТОГДА ЕСТЬNULL(ВЫБОР
	|							КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|							ИНАЧЕ ВЫБОР
	|									КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0
	|										ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						КОНЕЦ, 0) - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВЫБОР
	|								КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0
	|									ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|								ИНАЧЕ ВЫБОР
	|										КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0
	|											ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							КОНЕЦ, 0) <> 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + ЕСТЬNULL(ВЫБОР
	|									КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0
	|										ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|									ИНАЧЕ ВЫБОР
	|											КОГДА НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0
	|												ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|											ИНАЧЕ 0
	|										КОНЕЦ
	|								КОНЕЦ, 0) + 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ, 0) * ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток, 0) КАК КоличествоЕдиниц,
	|	Счетчики.Услуга.Приоритет КАК Приоритет,
	|	Счетчики.ЛицевойСчет.Наименование КАК НаименованиеЛС,
	|	Счетчики.Объект КАК ВладелецСчетчика,
	|	Счетчики.ПриоритетСЧ,
	|	Счетчики.СтавкаСчетчика,
	|	Счетчики.ИспользоватьСтавкуПоСчетчику,
	|	Счетчики.ТарифСчетчика,
	|	Счетчики.СчетчикСЗависимымиУслугами,
	|	Счетчики.ОсновнаяУслуга,
	|	Счетчики.ИспользоватьПравилоУменьшения,
	|	Счетчики.СпособРасчетаУменьшения,
	|	Счетчики.СпособРаспределенияУменьшения
	|ПОМЕСТИТЬ ПоказанийСчетчиков
	|ИЗ
	|	Счетчики КАК Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&КонецПериода, ) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО Счетчики.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И Счетчики.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И Счетчики.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличчествоПоНорме,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ОсновнойРежимПотребления КАК ОсновнойРежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления
	|ПОМЕСТИТЬ СведенияПоУслугам
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияПоУслугам.Услуга КАК Услуга,
	|	СведенияПоУслугам.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка КАК СтавкаГрупСИнд,
	|	бит_СтавкиНаУслугиСрезПоследних.Тариф,
	|	ВЫБОР
	|		КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|			ТОГДА ЕСТЬNULL(СведенияПоУслугам.ОбщаяПлощадь, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|					ТОГДА ЕСТЬNULL(СведенияПоУслугам.ЖилаяПлощадь, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(СведенияПоУслугам.ОтапливаемаяПлощадь, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|									ТОГДА ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|											ТОГДА СведенияПоУслугам.КоличествоЕдиницПотребления
	|										ИНАЧЕ ВЫБОР
	|												КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|													ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0)
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ФактОтОсновного,
	|	ВЫБОР
	|		КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|			ТОГДА ЕСТЬNULL(СведенияПоУслугам.ОбщаяПлощадь, 0) * бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|					ТОГДА ЕСТЬNULL(СведенияПоУслугам.ЖилаяПлощадь, 0) * бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(СведенияПоУслугам.ОтапливаемаяПлощадь, 0) * бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка
	|						ИНАЧЕ ВЫБОР
	|								КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|									ТОГДА ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0) * бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка
	|								ИНАЧЕ ВЫБОР
	|										КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|											ТОГДА СведенияПоУслугам.КоличествоЕдиницПотребления * бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка
	|										ИНАЧЕ ВЫБОР
	|												КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|													ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) * бит_СтавкиНаУслугиСрезПоследних1.ОсновнаяСтавка
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ФактСУчетомСтавки,
	// БИТ_ЖКХ 11.05.2016 11:05:50 Начало правки... 
	|	ВЫБОР
	|		КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|			ТОГДА ЕСТЬNULL(СведенияПоУслугам.ОбщаяПлощадь, 0) * бит_СтавкиНаУслугиСрезПоследних2.ОсновнаяСтавка * ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних1.НормативОДН, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|					ТОГДА ЕСТЬNULL(СведенияПоУслугам.ЖилаяПлощадь, 0) * бит_СтавкиНаУслугиСрезПоследних2.ОсновнаяСтавка * ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних1.НормативОДН, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(СведенияПоУслугам.ОтапливаемаяПлощадь, 0) * бит_СтавкиНаУслугиСрезПоследних2.ОсновнаяСтавка * ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних1.НормативОДН, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|									ТОГДА ЕСТЬNULL(Проживающие.КоличчествоПоНорме, 0) * бит_СтавкиНаУслугиСрезПоследних2.ОсновнаяСтавка * ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних1.НормативОДН, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|											ТОГДА СведенияПоУслугам.КоличествоЕдиницПотребления * бит_СтавкиНаУслугиСрезПоследних2.ОсновнаяСтавка * ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних1.НормативОДН, 0)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА СведенияПоУслугам.ОсновнойСпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|													ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) * бит_СтавкиНаУслугиСрезПоследних2.ОсновнаяСтавка * ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних1.НормативОДН, 0)
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ФактСУчетомСтавкиОДН,
	// БИТ_ЖКХ 11.05.2016 11:06:01 Конец правки. 
	|	СведенияПоУслугам.ОбщаяПлощадь,
	|	СведенияПоУслугам.ЖилаяПлощадь,
	|	СведенияПоУслугам.ОтапливаемаяПлощадь,
	|	Проживающие.КоличчествоПоНорме КАК КолПроживающих,
	|	СведенияПоУслугам.КоличествоЕдиницПотребления,
	|	бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет
	|ПОМЕСТИТЬ ТаблицаНорм
	|ИЗ
	|	СведенияПоУслугам КАК СведенияПоУслугам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|				&Дата,
	|				СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|					И СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)
	|					И ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)) КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО СведенияПоУслугам.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И СведенияПоУслугам.ОсновнойРежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			И СведенияПоУслугам.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Дата, ) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО СведенияПоУслугам.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И СведенияПоУслугам.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И СведенияПоУслугам.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И СведенияПоУслугам.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|			И СведенияПоУслугам.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	// БИТ_ЖКХ 11.05.2016 18:47:39 Начало правки...
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Дата, ) КАК бит_НормыНаУслугиСрезПоследних1
	|		ПО СведенияПоУслугам.Услуга = бит_НормыНаУслугиСрезПоследних1.Услуга
	|			И СведенияПоУслугам.ОсновнойСпособРасчета = бит_НормыНаУслугиСрезПоследних1.СпособРасчетаПоУслуге
	|			И СведенияПоУслугам.РежимПотребления = бит_НормыНаУслугиСрезПоследних1.РежимПотребления
	|			И СведенияПоУслугам.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних1.СтатусКвартиры
	|			И СведенияПоУслугам.ТипКвартиры = бит_НормыНаУслугиСрезПоследних1.ТипКвартиры
	// БИТ_ЖКХ 11.05.2016 18:47:39 Конец правки.
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО СведенияПоУслугам.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|				&Дата,
	|				СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|					И СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)) КАК бит_СтавкиНаУслугиСрезПоследних1
	|		ПО СведенияПоУслугам.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних1.ТипКвартиры
	|			И СведенияПоУслугам.Услуга = бит_СтавкиНаУслугиСрезПоследних1.Услуга
	|			И СведенияПоУслугам.ОсновнойРежимПотребления = бит_СтавкиНаУслугиСрезПоследних1.РежимПотребления
	|			И СведенияПоУслугам.Поставщик = бит_СтавкиНаУслугиСрезПоследних1.Поставщик
	// БИТ_ЖКХ 11.05.2016 18:31:48 Начало правки... 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|				&Дата,
	|					СтатусКвартиры = ЗНАЧЕНИЕ(Справочник.бит_СтатусыКвартиры.Приватизированная)) КАК бит_СтавкиНаУслугиСрезПоследних2
	|		ПО СведенияПоУслугам.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних2.ТипКвартиры
	|			И СведенияПоУслугам.Услуга = бит_СтавкиНаУслугиСрезПоследних2.Услуга
	|			И СведенияПоУслугам.ОсновнойРежимПотребления = бит_СтавкиНаУслугиСрезПоследних2.РежимПотребления
	|			И СведенияПоУслугам.ОсновнойСпособРасчета = бит_СтавкиНаУслугиСрезПоследних2.СпособРасчета
	|			И СведенияПоУслугам.Поставщик = бит_СтавкиНаУслугиСрезПоследних2.Поставщик";
	// БИТ_ЖКХ 11.05.2016 18:31:51 Конец правки. 
	
	Запрос.Выполнить();
	
	// БИТ_ЖКХ_01082013_изменен_текст_запроса
	// Добавлены поля начисление с учетом ставки на услугу и ставка на услугу.	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоказанийСчетчиков.ЛицевойСчет,
	|	ПоказанийСчетчиков.Услуга КАК Услуга,
	|	ПоказанийСчетчиков.Счетчик КАК Счетчик,
	|	ПоказанийСчетчиков.СпособРаспределения КАК СпособРаспределения,
	|	ПоказанийСчетчиков.ОтПоказаний КАК ОтПоказаний,
	|	ПоказанийСчетчиков.ДоПоказаний КАК ДоПоказаний,
	|	ПоказанийСчетчиков.КоличествоЕдиниц КАК КоличествоЕдиниц,
	|	ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ВЫБОР
	|		КОГДА &УчитыватьПерерасчет
	// БИТ_ЖКХ 03.08.2017 17:02:19 Начало правки...
	|				И НЕ СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|				И НЕ СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению)
	// БИТ_ЖКХ 03.08.2017 17:02:20 Конец правки. 
	|			ТОГДА ЕСТЬNULL(НачисленияНорм.Разовые, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоНорма,
	|	ЕСТЬNULL(НачисленияСчетчиков.НачисленоСчетчик, 0) + ВЫБОР
	|		КОГДА &УчитыватьНачисленияПоГрупповымСчетчикам
	|			ТОГДА ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0)
	|		ИНАЧЕ 0
	// БИТ_ЖКХ 03.08.2017 17:03:37 Начало правки... 
	|	КОНЕЦ + ВЫБОР
	|		КОГДА &УчитыватьПерерасчет
	|				И (СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|				ИЛИ СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению))
	|			ТОГДА ЕСТЬNULL(НачисленияНорм.Разовые, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоСчетчик,
	// БИТ_ЖКХ 03.08.2017 17:03:38 Конец правки. 
	|	ПоказанийСчетчиков.Приоритет КАК Приоритет,
	|	ПоказанийСчетчиков.НаименованиеЛС КАК НаименованиеЛС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоказанийСчетчиков.ИспользоватьСтавкуПоСчетчику, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ПоказанийСчетчиков.СтавкаСчетчика, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаНорм.СтавкаГрупСИнд, 0)
	|	КОНЕЦ КАК СтавкаПоСчетчику,
	|	ЕСТЬNULL(ПоказанийСчетчиков.КоличествоЕдиниц, 0) * ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоказанийСчетчиков.ИспользоватьСтавкуПоСчетчику, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ПоказанийСчетчиков.СтавкаСчетчика, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаНорм.СтавкаГрупСИнд, 0)
	|	КОНЕЦ КАК СуммаПоСчетчику,
	|	ПоказанийСчетчиков.ВладелецСчетчика КАК ВладелецСчетчика,
	|	ТаблицаНорм.СпособРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоказанийСчетчиков.ИспользоватьСтавкуПоСчетчику, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ПоказанийСчетчиков.ТарифСчетчика, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаНорм.Тариф, 0)
	|	КОНЕЦ КАК Тариф,
	|	ЕСТЬNULL(ТаблицаНорм.ФактОтОсновного, 0) КАК Факт,
	|	ЕСТЬNULL(ТаблицаНорм.ФактСУчетомСтавки, 0) КАК ФактСУчетомСтавки,
	// БИТ_ЖКХ 11.05.2016 11:14:20 Начало правки... 
	|	ЕСТЬNULL(ТаблицаНорм.ФактСУчетомСтавкиОДН, 0) КАК ФактСУчетомСтавкиОДН,
	// БИТ_ЖКХ 11.05.2016 11:14:21 Конец правки. 
	|	ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ЕСТЬNULL(НачисленияСчетчиков.НачисленоСчетчик, 0) + ВЫБОР
	|		КОГДА &УчитыватьНачисленияПоГрупповымСчетчикам
	|			ТОГДА ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНачислений,
	|	ЕСТЬNULL(НачисленияНорм.ОбщиеНачисления, 0) КАК ОбщиеНачисления,
	|	ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0) КАК НачисленоГрупСчетчик,
	|	ПоказанийСчетчиков.ПриоритетСЧ КАК ПриоритетСЧ,
	|	ПоказанийСчетчиков.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
	|	ПоказанийСчетчиков.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения,
	|	ТаблицаНорм.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ТаблицаНорм.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	ТаблицаНорм.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	ТаблицаНорм.КолПроживающих КАК КолПроживающих,
	|	ТаблицаНорм.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	|	ВЫБОР
	|		КОГДА ТаблицаНорм.СпособРасчета = ПоказанийСчетчиков.СпособРасчетаУменьшения
	|			ТОГДА ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ЕСТЬNULL(НачисленияСчетчиков.НачисленоСчетчик, 0) + ВЫБОР
	|					КОГДА &УчитыватьНачисленияПоГрупповымСчетчикам
	|						ТОГДА ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленияПоСпособуУменьшения,
	|	ВЫБОР
	|		КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|			ТОГДА ЕСТЬNULL(ТаблицаНорм.ОбщаяПлощадь, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|					ТОГДА ЕСТЬNULL(ТаблицаНорм.ЖилаяПлощадь, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(ТаблицаНорм.ОтапливаемаяПлощадь, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|									ТОГДА ЕСТЬNULL(ТаблицаНорм.КолПроживающих, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|											ТОГДА ЕСТЬNULL(ТаблицаНорм.КоличествоЕдиницПотребления, 0)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|													ТОГДА ЕСТЬNULL(ТаблицаНорм.НаЛицевойСчет, 0)
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ФактОтУменьшения,
	|	ПоказанийСчетчиков.СпособРаспределенияУменьшения,
	|	ЕСТЬNULL(НачисленияНорм.Разовые, 0) КАК Разовые,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ВЫБОР
	|				КОГДА &УчитыватьПерерасчет
	|					ТОГДА ЕСТЬNULL(НачисленияНорм.Разовые, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ < 0
	|			ТОГДА ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ВЫБОР
	|					КОГДА &УчитыватьПерерасчет
	|						ТОГДА ЕСТЬNULL(НачисленияНорм.Разовые, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоНормаОтрицательная
	|ИЗ
	|	ПоказанийСчетчиков КАК ПоказанийСчетчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСчетчиков КАК НачисленияСчетчиков
	|		ПО ПоказанийСчетчиков.ЛицевойСчет = НачисленияСчетчиков.ЛицевойСчет
	|			И ПоказанийСчетчиков.Услуга = НачисленияСчетчиков.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияНорм КАК НачисленияНорм
	|		ПО ПоказанийСчетчиков.ЛицевойСчет = НачисленияНорм.ЛицевойСчет
	|			И ПоказанийСчетчиков.Услуга = НачисленияНорм.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНорм КАК ТаблицаНорм
	|		ПО ПоказанийСчетчиков.Услуга = ТаблицаНорм.Услуга
	|			И ПоказанийСчетчиков.ЛицевойСчет = ТаблицаНорм.ЛицевойСчет
	// БИТ_ЖКХ 03.08.2017 17:04:26 Начало правки...
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоУслугам КАК СведенияПоУслугам
	|		ПО ПоказанийСчетчиков.ЛицевойСчет = СведенияПоУслугам.ЛицевойСчет
	|			И ПоказанийСчетчиков.Услуга = СведенияПоУслугам.Услуга
	// БИТ_ЖКХ 03.08.2017 17:04:27 Конец правки. 
	|ГДЕ
	|	НЕ ПоказанийСчетчиков.СчетчикСЗависимымиУслугами
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ПриоритетСЧ,
	|	НаименованиеЛС
	|ИТОГИ
	|	МАКСИМУМ(ОтПоказаний),
	|	МАКСИМУМ(ДоПоказаний),
	|	МАКСИМУМ(КоличествоЕдиниц),
	|	СУММА(НачисленоНорма),
	|	СУММА(НачисленоСчетчик),
	|	МАКСИМУМ(СуммаПоСчетчику),
	|	СУММА(Факт),
	|	СУММА(ФактСУчетомСтавки),
	// БИТ_ЖКХ 11.05.2016 11:14:33 Начало правки... 
	|	СУММА(ФактСУчетомСтавкиОДН),
	// БИТ_ЖКХ 11.05.2016 11:14:34 Конец правки. 
	|	СУММА(СуммаНачислений),
	|	СУММА(ОбщиеНачисления),
	|	СУММА(НачисленоГрупСчетчик),
	|	МАКСИМУМ(ИспользоватьПравилоУменьшения),
	|	МАКСИМУМ(СпособРасчетаУменьшения),
	|	СУММА(ОбщаяПлощадь),
	|	СУММА(ЖилаяПлощадь),
	|	СУММА(ОтапливаемаяПлощадь),
	|	СУММА(КолПроживающих),
	|	СУММА(КоличествоЕдиницПотребления),
	|	СУММА(НачисленияПоСпособуУменьшения),
	|	СУММА(ФактОтУменьшения),
	|	СУММА(Разовые),
	|	СУММА(НачисленоНормаОтрицательная)
	|ПО
	|	Услуга,
	|	Счетчик";
	
	Результат = Запрос.Выполнить();
	ВыборкаУС = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаРасчетов.Индексы.Добавить("ЛицевойСчет,Услуга");
	
	Пока ВыборкаУС.Следующий() Цикл
		
		ВыборкаСч = ВыборкаУС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		МассивИсключений = Новый Массив;
		
		Пока ВыборкаСч.Следующий() Цикл
			
			СуммаПоСчетчику = ВыборкаСч.СуммаПоСчетчику; 
			
			Если СуммаПоСчетчику = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СуммаИтог = 0;
			СуммаНО   = 0;
			ОбъемИтог = 0;
			
			// Индекс строки содержащей максимальную сумму используется для определения погрешнисти.
			Индкес      = Неопределено;
			
			ОбщийФакт              = ВыборкаСЧ.Факт;
			ОбщийФактОтУменьшения  = ВыборкаСЧ.ФактОтУменьшения;
			ОбщиеНачисления        = ВыборкаСЧ.СуммаНачислений;
			// БИТ_ЖКХ_01082013_начало_изменения
			ОбщийФактСУчетомСтавки = ВыборкаСЧ.ФактСУчетомСтавки;
			// БИТ_ЖКХ_01082013_окончание_изменения
			
			ИспользоватьПравилоУменьшения = ВыборкаСч.ИспользоватьПравилоУменьшения;
			
			// БИТ_ЖКХ 26.06.2015{{
			// СЧНачисленоНорма       = ВыборкаСч.НачисленоНорма; 
			СЧНачисленоНорма       = ВыборкаСч.НачисленоНорма - ВыборкаСч.НачисленоНормаОтрицательная; 
			// БИТ_ЖКХ 26.06.2015}}
			
			СЧНачисленоСчетчик     = ВыборкаСч.НачисленоСчетчик;
			СЧНачисленоУменьшения  = ВыборкаСч.НачисленияПоСпособуУменьшения;
			
			Выборка = ВыборкаСч.Выбрать();
			
			КоличествоЛС = Выборка.Количество();
			
			НачисленоНорма   = 0;
			НачисленоСчетчик = 0;
			Остаток          = 0;
			
			Пока Выборка.Следующий() Цикл
				
				Если МассивИсключений.Найти(Выборка.ЛицевойСчет) = Неопределено Тогда
					
					МассивИсключений.Добавить(Выборка.ЛицевойСчет);
					
					НачисленоНорма   = НачисленоНорма   + Выборка.НачисленоНорма;
					НачисленоСчетчик = НачисленоСчетчик + Выборка.НачисленоСчетчик;
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Остаток = СуммаПоСчетчику - НачисленоНорма - НачисленоСчетчик;
			
			Выборка.Сбросить();
			ЛСОбработано = 0;
			
			Пока Выборка.Следующий() Цикл
				
				ЛСОбработано     = ЛСОбработано + 1;
				
				// Набор показателей по лс.
				СуммаНорматив     = Выборка.НачисленоНорма;
				СуммаСчетчик      = Выборка.НачисленоСчетчик;
				СуммаНачислений   = Выборка.СуммаНачислений;
				СуммаУменьшения   = Выборка.НачисленияПоСпособуУменьшения;
				Факт              = Выборка.Факт;
				ФактОтУменьшения  = Выборка.ФактОтУменьшения;
				// БИТ_ЖКХ_01082013_начало_изменения
				ФактСУчетомСтавки = Выборка.ФактСУчетомСтавки;
				// БИТ_ЖКХ_01082013_окончание_изменения
				
				Показатель      = 0;
				ОбщийПоказатель = 0;
				
				СпособРаспределения =  Выборка.СпособРаспределения;
				
				Если ИспользоватьПравилоУменьшения И Остаток < 0 Тогда
					
					Если ЗначениеЗаполнено(Выборка.СпособРаспределенияУменьшения) Тогда
						СпособРаспределения = Выборка.СпособРаспределенияУменьшения;
					Иначе
						СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления;
					КонецЕсли; 
					
				КонецЕсли;
				
				Если СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления Тогда
					
					// Начисления отрицательного отстатка по правилу уменьшения.
					// Репределние ведется на начисления по установленному способу расчета уменьшения.
					Показатель      = СуммаУменьшения;
					ОбщийПоказатель = СЧНачисленоУменьшения;
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаФакт Тогда
					
					// Начисления отрицательного отстатка по правилу уменьшения.
					// Репределние ведется на факт по установленному способу расчета уменьшения.
					Показатель      = ФактОтУменьшения;
					ОбщийПоказатель = ОбщийФактОтУменьшения;
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоНормативам Тогда
					
					// БИТ_ЖКХ 24.06.2015{{
					//Показатель      = СуммаНорматив;
					Если СуммаНорматив < 0 Тогда
						Показатель      = 0;
						//МинусоваяСумма = МинусоваяСумма + СуммаНорматив;
						//Показатель      = СуммаНорматив;
					Иначе
						Показатель      = СуммаНорматив;
					КонецЕсли;
					// БИТ_ЖКХ 24.06.2015}}
					
					ОбщийПоказатель = СЧНачисленоНорма;
					
				ИначеЕсли  СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСчетчикам Тогда
					
					Показатель      = СуммаСчетчик;
					ОбщийПоказатель = СЧНачисленоСчетчик;
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоОсновномуСпособуРасчета Тогда
					
					Показатель      = Факт;
					ОбщийПоказатель = ОбщийФакт;
					
					// БИТ_ЖКХ_01082013_начало_изменения	
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоОсновномуСпособуРасчетаС_УчетомСтавки Тогда
					
					Показатель      = ФактСУчетомСтавки;
					ОбщийПоказатель = ОбщийФактСУчетомСтавки;
					// БИТ_ЖКХ_01082013_окончание_изменения
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоНачислениям Тогда
					
					Показатель      = СуммаНачислений;
					ОбщийПоказатель = ОбщиеНачисления;
					
				КонецЕсли;
				
				Отбор = Новый Структура;
				Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
				Отбор.Вставить("Услуга"     , Выборка.Услуга);
				
				ПоискСтроки = ТаблицаРасчетов.НайтиСтроки(Отбор);
				
				СтрокаРасчета = Неопределено;
				
				Если ПоискСтроки.Количество() = 0 Тогда
					СтрокаРасчета = ТаблицаРасчетов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРасчета, Выборка);
				Иначе
					СтрокаРасчета = ПоискСтроки[0];
				КонецЕсли; 
				
				НоваяСтрока = ВыполнитьРасчетПоСтроке(ТаблицаОбщедомовыеНачисления, Выборка, Остаток, Показатель, ОбщийПоказатель, СтрокаРасчета);
				
				Если НЕ НоваяСтрока = Неопределено Тогда
					
					Сумма     = НоваяСтрока.Начислено;
					СуммаИтог = СуммаИтог + НоваяСтрока.Начислено;
					СуммаНО   = СуммаНО   + НоваяСтрока.НераспределенныйОстаток;
					
					Если Индкес = Неопределено Тогда
						Индкес = ТаблицаОбщедомовыеНачисления.Индекс(НоваяСтрока);
					Иначе
						
						СтрокаПоИндексу = ТаблицаОбщедомовыеНачисления.Получить(Индкес);
						
						Если Остаток > 0 Тогда
							Индкес      = ?(СтрокаПоИндексу.Начислено < Сумма И НЕ Сумма = 0, ТаблицаОбщедомовыеНачисления.Индекс(НоваяСтрока), Индкес);
						Иначе
							Индкес      = ?(СтрокаПоИндексу.Начислено > Сумма И НЕ Сумма = 0, ТаблицаОбщедомовыеНачисления.Индекс(НоваяСтрока), Индкес);
						КонецЕсли; 
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЛСОбработано = КоличествоЛС И СуммаИтог = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет начислений для распределения суммы : " + Остаток + " по счетчику : " + Выборка.Счетчик + " и услуге :" + Выборка.Услуга);
				КонецЕсли;
				
			КонецЦикла;
			
			Погрешность = Остаток - СуммаИтог - СуммаНО;
			
			Если Погрешность <> 0 И
				НЕ СтрокаПоИндексу = Неопределено И 
				НЕ Индкес = Неопределено Тогда
				
				СтрокаПоИндексу = ТаблицаОбщедомовыеНачисления.Получить(Индкес);
				
				Если Остаток < 0 И НЕ СуммаНО = 0 Тогда
					
					СтрокаПоИндексу.НераспределенныйОстаток = СтрокаПоИндексу.НераспределенныйОстаток + Погрешность;
					
					Отбор = Новый Структура;
					Отбор.Вставить("ЛицевойСчет", СтрокаПоИндексу.ЛицевойСчет);
					Отбор.Вставить("Услуга"     , СтрокаПоИндексу.Услуга);
					
					ПоискСтроки = ТаблицаРасчетов.НайтиСтроки(Отбор);
					Если ПоискСтроки.Количество() > 0 Тогда
						СтрокаРасчета = ПоискСтроки[0];
						СтрокаРасчета.НераспределенныйОстаток = СтрокаРасчета.НераспределенныйОстаток + Погрешность;
					КонецЕсли;
					
				Иначе
					
					СтрокаПоИндексу.Начислено            = СтрокаПоИндексу.Начислено + Погрешность;
					СтрокаПоИндексу.КоличествоЕдиницПоЛС = ОКР(?(СтрокаПоИндексу.Тариф = 0, 0 ,СтрокаПоИндексу.Начислено/СтрокаПоИндексу.Тариф),4);
					
					Отбор = Новый Структура;
					Отбор.Вставить("ЛицевойСчет", СтрокаПоИндексу.ЛицевойСчет);
					Отбор.Вставить("Услуга"     , СтрокаПоИндексу.Услуга);
					
					ПоискСтроки = ТаблицаРасчетов.НайтиСтроки(Отбор);
					Если ПоискСтроки.Количество() > 0 Тогда
						СтрокаРасчета = ПоискСтроки[0];
						СтрокаРасчета.СуммаНачислений = СтрокаРасчета.СуммаНачислений + Погрешность;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ТаблицаРасчетов.Очистить();
	
	// Исправлена ошибка в строке (9) задваивался показатель НачисленоНорма бит_akozlov_25072013.
	// БИТ_ЖКХ_01082013_изменен_текст_запроса
	// Добавлено поля начисление с учетом ставки на услугу.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоказанийСчетчиков.ЛицевойСчет,
	|	ПоказанийСчетчиков.Услуга КАК Услуга,
	|	ПоказанийСчетчиков.Счетчик КАК Счетчик,
	|	ПоказанийСчетчиков.СпособРаспределения КАК СпособРаспределения,
	|	ПоказанийСчетчиков.ОтПоказаний КАК ОтПоказаний,
	|	ПоказанийСчетчиков.ДоПоказаний КАК ДоПоказаний,
	|	ПоказанийСчетчиков.КоличествоЕдиниц КАК КоличествоЕдиниц,
	|	ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ВЫБОР
	|		КОГДА &УчитыватьПерерасчет
	// БИТ_ЖКХ 03.08.2017 17:06:46 Начало правки...
	|				И НЕ СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|				И НЕ СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению)
	// БИТ_ЖКХ 03.08.2017 17:06:47 Конец правки. 
	|			ТОГДА ЕСТЬNULL(НачисленияНорм.Разовые, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоНорма,
	|	ЕСТЬNULL(НачисленияСчетчиков.НачисленоСчетчик, 0) + ВЫБОР
	|		КОГДА &УчитыватьНачисленияПоГрупповымСчетчикам
	|			ТОГДА ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0)
	|		ИНАЧЕ 0
	// БИТ_ЖКХ 03.08.2017 17:18:15 Начало правки...
	|	КОНЕЦ + ВЫБОР
	|		КОГДА &УчитыватьПерерасчет
	|				И (СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|				ИЛИ СведенияПоУслугам.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению))
	|			ТОГДА ЕСТЬNULL(НачисленияНорм.Разовые, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоСчетчик,
	// БИТ_ЖКХ 03.08.2017 17:18:17 Конец правки. 
	|	ПоказанийСчетчиков.Приоритет КАК Приоритет,
	|	ПоказанийСчетчиков.НаименованиеЛС КАК НаименованиеЛС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоказанийСчетчиков.ИспользоватьСтавкуПоСчетчику, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ПоказанийСчетчиков.СтавкаСчетчика, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаНорм.СтавкаГрупСИнд, 0)
	|	КОНЕЦ КАК СтавкаПоСчетчику,
	|	ЕСТЬNULL(ПоказанийСчетчиков.КоличествоЕдиниц, 0) * ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоказанийСчетчиков.ИспользоватьСтавкуПоСчетчику, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ПоказанийСчетчиков.СтавкаСчетчика, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаНорм.СтавкаГрупСИнд, 0)
	|	КОНЕЦ КАК СуммаПоСчетчику,
	|	ПоказанийСчетчиков.ВладелецСчетчика,
	|	ТаблицаНорм.СпособРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоказанийСчетчиков.ИспользоватьСтавкуПоСчетчику, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ПоказанийСчетчиков.ТарифСчетчика, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаНорм.Тариф, 0)
	|	КОНЕЦ КАК Тариф,
	|	ЕСТЬNULL(ТаблицаНорм.ФактОтОсновного, 0) КАК Факт,
	|	ЕСТЬNULL(ТаблицаНорм.ФактСУчетомСтавки, 0) КАК ФактСУчетомСтавки,
	// БИТ_ЖКХ 11.05.2016 14:42:24 Начало правки... 
	|	ЕСТЬNULL(ТаблицаНорм.ФактСУчетомСтавкиОДН, 0) КАК ФактСУчетомСтавкиОДН,
	// БИТ_ЖКХ 11.05.2016 14:42:25 Конец правки. 
	|	ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ЕСТЬNULL(НачисленияСчетчиков.НачисленоСчетчик, 0) + ВЫБОР
	|		КОГДА &УчитыватьНачисленияПоГрупповымСчетчикам
	|			ТОГДА ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНачислений,
	|	ЕСТЬNULL(НачисленияНорм.ОбщиеНачисления, 0) КАК ОбщиеНачисления,
	|	ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0) КАК НачисленоГрупСчетчик,
	|	ПоказанийСчетчиков.ПриоритетСЧ КАК ПриоритетСЧ,
	|	ПоказанийСчетчиков.ОсновнаяУслуга КАК ОсновнаяУслуга,
	|	ПоказанийСчетчиков.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
	|	ПоказанийСчетчиков.СпособРаспределенияУменьшения,
	|	ПоказанийСчетчиков.СпособРасчетаУменьшения,
	|	ВЫБОР
	|		КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	|			ТОГДА ЕСТЬNULL(ТаблицаНорм.ОбщаяПлощадь, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади)
	|					ТОГДА ЕСТЬNULL(ТаблицаНорм.ЖилаяПлощадь, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади)
	|							ТОГДА ЕСТЬNULL(ТаблицаНорм.ОтапливаемаяПлощадь, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим)
	|									ТОГДА ЕСТЬNULL(ТаблицаНорм.КолПроживающих, 0)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления)
	|											ТОГДА ЕСТЬNULL(ТаблицаНорм.КоличествоЕдиницПотребления, 0)
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПоказанийСчетчиков.СпособРасчетаУменьшения = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет)
	|													ТОГДА ЕСТЬNULL(ТаблицаНорм.НаЛицевойСчет, 0)
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ФактОтУменьшения,
	|	ВЫБОР
	|		КОГДА ТаблицаНорм.СпособРасчета = ПоказанийСчетчиков.СпособРасчетаУменьшения
	|			ТОГДА ЕСТЬNULL(НачисленияНорм.НачисленоНорма, 0) + ЕСТЬNULL(НачисленияСчетчиков.НачисленоСчетчик, 0) + ВЫБОР
	|					КОГДА &УчитыватьНачисленияПоГрупповымСчетчикам
	|						ТОГДА ЕСТЬNULL(НачисленияСчетчиков.НачисленоГрупСчетчик, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленияПоСпособуУменьшения,
	|	ЕСТЬNULL(НачисленияНорм.Разовые, 0) КАК Разовые
	|ИЗ
	|	ПоказанийСчетчиков КАК ПоказанийСчетчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСчетчиков КАК НачисленияСчетчиков
	|		ПО ПоказанийСчетчиков.ЛицевойСчет = НачисленияСчетчиков.ЛицевойСчет
	|			И ПоказанийСчетчиков.Услуга = НачисленияСчетчиков.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияНорм КАК НачисленияНорм
	|		ПО ПоказанийСчетчиков.ЛицевойСчет = НачисленияНорм.ЛицевойСчет
	|			И ПоказанийСчетчиков.Услуга = НачисленияНорм.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНорм КАК ТаблицаНорм
	|		ПО ПоказанийСчетчиков.Услуга = ТаблицаНорм.Услуга
	|			И ПоказанийСчетчиков.ЛицевойСчет = ТаблицаНорм.ЛицевойСчет
	// БИТ_ЖКХ 03.08.2017 17:19:11 Начало правки...
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоУслугам КАК СведенияПоУслугам
	|		ПО ПоказанийСчетчиков.ЛицевойСчет = СведенияПоУслугам.ЛицевойСчет
	|			И ПоказанийСчетчиков.Услуга = СведенияПоУслугам.Услуга
	// БИТ_ЖКХ 03.08.2017 17:19:12 Конец правки. 
	|ГДЕ
	|	ПоказанийСчетчиков.СчетчикСЗависимымиУслугами
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновнаяУслуга,
	|	НаименованиеЛС
	|ИТОГИ
	|	МАКСИМУМ(ОтПоказаний),
	|	МАКСИМУМ(ДоПоказаний),
	|	МАКСИМУМ(КоличествоЕдиниц),
	|	СУММА(НачисленоНорма),
	|	СУММА(НачисленоСчетчик),
	|	МАКСИМУМ(СуммаПоСчетчику),
	|	СУММА(Факт),
	|	СУММА(ФактСУчетомСтавки),
	// БИТ_ЖКХ 11.05.2016 11:14:33 Начало правки... 
	|	СУММА(ФактСУчетомСтавкиОДН),
	// БИТ_ЖКХ 11.05.2016 11:14:34 Конец правки. 
	|	СУММА(СуммаНачислений),
	|	СУММА(ОбщиеНачисления),
	|	СУММА(НачисленоГрупСчетчик),
	|	МАКСИМУМ(ОсновнаяУслуга),
	|	МАКСИМУМ(ИспользоватьПравилоУменьшения),
	|	СУММА(ФактОтУменьшения),
	|	СУММА(НачисленияПоСпособуУменьшения),
	|	СУММА(Разовые)
	|ПО
	|	Счетчик,
	|	Услуга";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаСЧ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСч.Следующий() Цикл
		
		СуммаНачислени = ВыборкаСч.НачисленоНорма + ВыборкаСч.НачисленоСчетчик;
		
		ВыборкаУС = ВыборкаСЧ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУС.Следующий() Цикл
			
			Если НЕ ВыборкаУС.ОсновнаяУслуга ИЛИ ВыборкаУС.СуммаПоСчетчику = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаИтог = 0;
			ОбъемИтог = 0;
			СуммаНО   = 0;
			
			// Индекс строки содержащей максимальную сумму используется для определения погрешнисти.
			Индкес      = Неопределено;
			
			// БИТ_ЖКХ 06.10.2014
			СЧНачисленоСчетчик     = ВыборкаУС.НачисленоСчетчик;
			// БИТ_ЖКХ 06.10.2014
			
			ОбщийФакт              = ВыборкаУС.Факт;
			ОбщиеНачисления        = ВыборкаУС.СуммаНачислений;
			ОбщийФактОтУменьшения  = ВыборкаУС.ФактОтУменьшения;
			// БИТ_ЖКХ_01082013_начало_изменения
			ОбщийФактСУчетомСтавки = ВыборкаУС.ФактСУчетомСтавки;
			// БИТ_ЖКХ_01082013_окончание_изменения
			
			ИспользоватьПравилоУменьшения = ВыборкаСч.ИспользоватьПравилоУменьшения; 
			
			СЧНачисленоУменьшения  = ВыборкаУС.НачисленияПоСпособуУменьшения; 
			СуммаПоНормативуРасч   = ВыборкаУС.НачисленоНорма;
			СуммаПоИндСчетчкамРасч = ВыборкаУС.НачисленоСчетчик;
			
			Остаток = ВыборкаУС.СуммаПоСчетчику - СуммаНачислени;
			
			Выборка = ВыборкаУС.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				// Набор показателей по лс.
				СуммаНорматив     = Выборка.НачисленоНорма;
				СуммаСчетчик      = Выборка.НачисленоСчетчик;
				СуммаНачислений   = Выборка.СуммаНачислений;
				СуммаУменьшения   = Выборка.НачисленияПоСпособуУменьшения;
				Факт              = Выборка.Факт;
				ФактОтУменьшения  = Выборка.ФактОтУменьшения;
				// БИТ_ЖКХ_01082013_начало_изменения
				ФактСУчетомСтавки = Выборка.ФактСУчетомСтавки;
				// БИТ_ЖКХ_01082013_окончание_изменения
				
				Показатель      = 0;
				ОбщийПоказатель = 0;
				
				СпособРаспределения =  Выборка.СпособРаспределения;
				
				Если ИспользоватьПравилоУменьшения И Остаток < 0 Тогда
					
					Если ЗначениеЗаполнено(Выборка.СпособРаспределенияУменьшения) Тогда
						СпособРаспределения = Выборка.СпособРаспределенияУменьшения;
					Иначе
						СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления;
					КонецЕсли; 
					
				КонецЕсли;
				
				Если СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаНачисления Тогда
					
					// Начисления отрицательного отстатка по правилу уменьшения.
					// Репределние ведется на начисления по установленному способу расчета уменьшения.
					Показатель      = СуммаУменьшения;
					ОбщийПоказатель = СЧНачисленоУменьшения;
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСпособуРасчетаФакт Тогда
					
					// Начисления отрицательного отстатка по правилу уменьшения.
					// Репределние ведется на факт по установленному способу расчета уменьшения.
					Показатель      = ФактОтУменьшения;
					ОбщийПоказатель = ОбщийФактОтУменьшения;
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоНормативам Тогда
					
					// БИТ_ЖКХ 24.06.2015{{
					//Показатель      = СуммаНорматив;
					Если СуммаНорматив < 0 Тогда
						Показатель      = 0;
					Иначе
						Показатель      = СуммаНорматив;
					КонецЕсли;
					// БИТ_ЖКХ 24.06.2015}}
					
					ОбщийПоказатель = СЧНачисленоНорма;
					
				ИначеЕсли  СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоСчетчикам Тогда
					
					Показатель      = СуммаСчетчик;
					ОбщийПоказатель = СЧНачисленоСчетчик;
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоОсновномуСпособуРасчета Тогда
					
					Показатель      = Факт;
					ОбщийПоказатель = ОбщийФакт;
					
					// БИТ_ЖКХ_01082013_начало_изменения
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоОсновномуСпособуРасчетаС_УчетомСтавки Тогда
					
					Показатель      = ФактСУчетомСтавки;
					ОбщийПоказатель = ОбщийФактСУчетомСтавки;
					// БИТ_ЖКХ_01082013_окончание_изменения
					
				ИначеЕсли СпособРаспределения = Перечисления.бит_СпособыРаспределения.ПоНачислениям Тогда
					
					Показатель      = СуммаНачислений;
					ОбщийПоказатель = ОбщиеНачисления;
					
				КонецЕсли;
				
				Отбор = Новый Структура;
				Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
				Отбор.Вставить("Услуга"     , Выборка.Услуга);
				
				ПоискСтроки = ТаблицаРасчетов.НайтиСтроки(Отбор);
				
				СтрокаРасчета = Неопределено;
				
				Если ПоискСтроки.Количество() = 0 Тогда
					СтрокаРасчета = ТаблицаРасчетов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРасчета, Выборка);
				Иначе
					СтрокаРасчета = ПоискСтроки[0];
				КонецЕсли;
				
				НоваяСтрока = ВыполнитьРасчетПоСтроке(ТаблицаОбщедомовыеНачисления, Выборка, Остаток, Показатель, ОбщийПоказатель, СтрокаРасчета);
				
				Если НЕ НоваяСтрока = Неопределено Тогда
					
					Сумма     = НоваяСтрока.Начислено;
					СуммаИтог = СуммаИтог + НоваяСтрока.Начислено;
					СуммаНО   = СуммаНО   + НоваяСтрока.НераспределенныйОстаток;
					
					Если Индкес = Неопределено Тогда
						Индкес = ТаблицаОбщедомовыеНачисления.Индекс(НоваяСтрока);
					Иначе
						
						СтрокаПоИндексу = ТаблицаОбщедомовыеНачисления.Получить(Индкес);
						
						Если Остаток > 0 Тогда
							Индкес      = ?(СтрокаПоИндексу.Начислено < Сумма И НЕ Сумма = 0, ТаблицаОбщедомовыеНачисления.Индекс(НоваяСтрока), Индкес);
						Иначе
							Индкес      = ?(СтрокаПоИндексу.Начислено > Сумма И НЕ Сумма = 0, ТаблицаОбщедомовыеНачисления.Индекс(НоваяСтрока), Индкес);
						КонецЕсли; 
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Погрешность = Остаток - СуммаИтог - СуммаНО;
			
			Если Погрешность <> 0 И
				НЕ СтрокаПоИндексу = Неопределено И 
				НЕ Индкес = Неопределено Тогда
				
				СтрокаПоИндексу = ТаблицаОбщедомовыеНачисления.Получить(Индкес);
				
				Если Остаток < 0 И НЕ СуммаНО = 0 Тогда
					СтрокаПоИндексу.НераспределенныйОстаток = СтрокаПоИндексу.НераспределенныйОстаток + Погрешность;
					
					Отбор = Новый Структура;
					Отбор.Вставить("ЛицевойСчет", СтрокаПоИндексу.ЛицевойСчет);
					Отбор.Вставить("Услуга"     , СтрокаПоИндексу.Услуга);
					
					ПоискСтроки = ТаблицаРасчетов.НайтиСтроки(Отбор);
					
					Если ПоискСтроки.Количество() > 0 Тогда
						СтрокаРасчета = ПоискСтроки[0];
						СтрокаРасчета.НераспределенныйОстаток = СтрокаРасчета.НераспределенныйОстаток + Погрешность;
					КонецЕсли;
					
				Иначе
					
					СтрокаПоИндексу.Начислено            = СтрокаПоИндексу.Начислено + Погрешность;
					СтрокаПоИндексу.КоличествоЕдиницПоЛС = ОКР(?(СтрокаПоИндексу.Тариф = 0, 0 ,СтрокаПоИндексу.Начислено/СтрокаПоИндексу.Тариф),4);
					
					Отбор = Новый Структура;
					Отбор.Вставить("ЛицевойСчет", СтрокаПоИндексу.ЛицевойСчет);
					Отбор.Вставить("Услуга"     , СтрокаПоИндексу.Услуга);
					
					ПоискСтроки = ТаблицаРасчетов.НайтиСтроки(Отбор);
					
					Если ПоискСтроки.Количество() > 0 Тогда
						СтрокаРасчета = ПоискСтроки[0];
						СтрокаРасчета.СуммаНачислений = СтрокаРасчета.СуммаНачислений + Погрешность;
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	МВТ.Закрыть();
	
	// БИТ_ЖКХ 11.05.2016 16:20:16 Начало правки... Окончательный расчет Нераспределенного остатка с учетом ОДН
	Для Каждого Стр Из ТаблицаОбщедомовыеНачисления Цикл
		Если Стр.Начислено > 0 
			И Стр.НачислениеПоНормативуОДН > 0
			И Стр.Начислено > Стр.НачислениеПоНормативуОДН Тогда
			Стр.НераспределенныйОстаток = Стр.Начислено - Стр.НачислениеПоНормативуОДН;
			Стр.Начислено = Стр.НачислениеПоНормативуОДН;
		КонецЕсли;
	КонецЦикла; 
	// БИТ_ЖКХ 11.05.2016 16:20:16 Конец правки.
	
КонецПроцедуры

#КонецОбласти

#Область ФункцииФормированияТаблицЗначений

// Функция формирует таблицу значений для ведения расчетов начислений.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуНачислений() Экспорт
	
	ТаблицаНачислений = Новый ТаблицаЗначений;
	ТаблицаНачислений.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаНачислений.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	// БИТ_ЖКХ 14.07.2017 11:49:52 Начало правки...
	//ТаблицаНачислений.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	//19.12.2018 55
	ТаблицаНачислений.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСтавокНДС"));

	// БИТ_ЖКХ 14.07.2017 11:49:52 Конец правки.
	ТаблицаНачислений.Колонки.Добавить("Приоритет"                 , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	ТаблицаНачислений.Колонки.Добавить("СпособРасчета"             , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаНачислений.Колонки.Добавить("Ставка"                    , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("СверхномСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("ПлановаяСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("Норма"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("СверхНорма"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Норматив"                  , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("НормаЛьготы"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Поставщик"                 , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	ТаблицаНачислений.Колонки.Добавить("Факт"                      , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("ПолучательДенежныхСредств" , Новый ОписаниеТипов("СправочникСсылка.Контрагенты,СправочникСсылка.Организации"));
	ТаблицаНачислений.Колонки.Добавить("ДоговорКонтрагента"        , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаНачислений.Колонки.Добавить("СальдоНаНачало"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Сальдо"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("СальдоПени"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Оплата"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Разовые"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("ПереплатаНаначало"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Долг"                      , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Льгота"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("КОплате"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("Переплата"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНачислений.Колонки.Добавить("КОплатеЗаМесяц"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	
	ТаблицаНачислений.Колонки.Добавить("Объем"                     , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНачислений.Колонки.Добавить("Тариф"                     , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНачислений.Колонки.Добавить("НормативПотребленияПоКу"   , ОбщегоНазначения.ОписаниеТипаЧисло(16,6));
	
	// БИТ_ЖКХ_22082013_начало_изменений
	ТаблицаНачислений.Колонки.Добавить("ГруппаУслуги"              , Новый ОписаниеТипов("СправочникСсылка.бит_ГруппыУслуг"));
	ТаблицаНачислений.Колонки.Добавить("ПериодСравнения"           , Новый ОписаниеТипов("Дата"));
	ТаблицаНачислений.Колонки.Добавить("ТарифДо"                   , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНачислений.Колонки.Добавить("СтавкаДо"                  , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("СверхномСтавкаДо"          , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("ПредельныйИндекс"          , ОбщегоНазначения.ОписаниеТипаЧисло(6,4));
	ТаблицаНачислений.Колонки.Добавить("НачислятьПредельныйИндекс" , Новый ОписаниеТипов("Булево"));
	ТаблицаНачислений.Колонки.Добавить("НачисленоДо"               , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("ПлановаяСтавкаДо"          , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("ОбъемДо"                   , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНачислений.Колонки.Добавить("ЕдИзм"                     , Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаНачислений.Колонки.Добавить("МойПоставщик"              , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	// БИТ_ЖКХ_22082013_окончание_изменений
	
	Возврат ТаблицаНачислений;
	
КонецФункции // СформироватьТаблицуНачислений()

// Функция формирует таблицу значений для ведения расчетов начислений.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуСчетчиков() Экспорт
	
	ТаблицаСчетчиков = Новый ТаблицаЗначений;
	ТаблицаСчетчиков.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаСчетчиков.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	// БИТ_ЖКХ 14.07.2017 11:49:52 Начало правки...
	//ТаблицаСчетчиков.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	//19.12.2018 55
	ТаблицаСчетчиков.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСтавокНДС"));

	// БИТ_ЖКХ 14.07.2017 11:49:52 Конец правки.
	ТаблицаСчетчиков.Колонки.Добавить("Счетчик"                   , Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
	ТаблицаСчетчиков.Колонки.Добавить("Приоритет"                 , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	ТаблицаСчетчиков.Колонки.Добавить("СпособРасчета"             , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаСчетчиков.Колонки.Добавить("ОсновнойСпособРасчета"     , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаСчетчиков.Колонки.Добавить("Ставка"                    , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("СверхномСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("ПлановаяСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("Норма"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("СверхНорма"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Норматив"                  , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("НормаЛьготы"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Поставщик"                 , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	ТаблицаСчетчиков.Колонки.Добавить("Факт"                      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("ПолучательДенежныхСредств" , Новый ОписаниеТипов("СправочникСсылка.Контрагенты,СправочникСсылка.Организации"));
	ТаблицаСчетчиков.Колонки.Добавить("ДоговорКонтрагента"        , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаСчетчиков.Колонки.Добавить("СальдоНаНачало"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Сальдо"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("СальдоПени"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Оплата"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Разовые"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("ПереплатаНаначало"         , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Долг"                      , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Льгота"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("КОплате"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("Переплата"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("КОплатеЗаМесяц"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("ТекущееСостояние"          , ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ТаблицаСчетчиков.Колонки.Добавить("ОтПоказаний"               , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("ДоПоказаний"               , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("КоличествоЕдиниц"          , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("КоличествоЕдиницПоЛС"      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("ИсточникПоказаний"         , Новый ОписаниеТипов("ПеречислениеСсылка.бит_ИсточникПоказаний"));      
	ТаблицаСчетчиков.Колонки.Добавить("ВладелецСчетчика"          , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета,СправочникСсылка.бит_СписокЗданий"));
	ТаблицаСчетчиков.Колонки.Добавить("Доля"                      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("ДоляПоЛС"                  , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("Многотарифный"             , Новый ОписаниеТипов("Булево"));
	ТаблицаСчетчиков.Колонки.Добавить("Объем"                     , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("Тариф"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчетчиков.Колонки.Добавить("НормативПотребленияПоКу"   , ОбщегоНазначения.ОписаниеТипаЧисло(16,6));
	
	// БИТ_ЖКХ_22082013_начало_изменений
	ТаблицаСчетчиков.Колонки.Добавить("ГруппаУслуги"              , Новый ОписаниеТипов("СправочникСсылка.бит_ГруппыУслуг"));
	ТаблицаСчетчиков.Колонки.Добавить("ПериодСравнения"           , Новый ОписаниеТипов("Дата"));
	ТаблицаСчетчиков.Колонки.Добавить("ТарифДо"                   , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчетчиков.Колонки.Добавить("СтавкаДо"                  , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("СверхномСтавкаДо"          , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("ПредельныйИндекс"          , ОбщегоНазначения.ОписаниеТипаЧисло(6,4));
	ТаблицаСчетчиков.Колонки.Добавить("НачислятьПредельныйИндекс" , Новый ОписаниеТипов("Булево"));
	ТаблицаСчетчиков.Колонки.Добавить("НачисленоДо"               , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("ПлановаяСтавкаДо"          , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("ОбъемДо"                   , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчетчиков.Колонки.Добавить("ЕдИзм"                     , Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаСчетчиков.Колонки.Добавить("МойПоставщик"              , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	// БИТ_ЖКХ_22082013_окончание_изменений
	
	Возврат ТаблицаСчетчиков;
	
КонецФункции // СформироватьТаблицуНачислений()

// Функция формирует таблицу значений для ведения расчетов начислений.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуРаспредилений() Экспорт
	
	ТаблицаРаспределений = Новый ТаблицаЗначений;
	ТаблицаРаспределений.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаРаспределений.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	// БИТ_ЖКХ 14.07.2017 11:49:52 Начало правки...
	//ТаблицаРаспределений.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	//19.12.2018 55
	ТаблицаРаспределений.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСтавокНДС"));

	// БИТ_ЖКХ 14.07.2017 11:49:52 Конец правки.
	ТаблицаРаспределений.Колонки.Добавить("Распределение"             , Новый ОписаниеТипов("СправочникСсылка.бит_Распределения"));
	ТаблицаРаспределений.Колонки.Добавить("СпособРасчета"             , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаРаспределений.Колонки.Добавить("ОсновнойСпособРасчета"     , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаРаспределений.Колонки.Добавить("Ставка"                    , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаРаспределений.Колонки.Добавить("СверхномСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаРаспределений.Колонки.Добавить("ПлановаяСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаРаспределений.Колонки.Добавить("Норма"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("СверхНорма"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("Норматив"                  , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("НормаЛьготы"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("Поставщик"                 , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	ТаблицаРаспределений.Колонки.Добавить("ПолучательДенежныхСредств" , Новый ОписаниеТипов("СправочникСсылка.Контрагенты,СправочникСсылка.Организации"));
	ТаблицаРаспределений.Колонки.Добавить("ДоговорКонтрагента"        , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаРаспределений.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("КоличествоЕдиниц"          , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаРаспределений.Колонки.Добавить("КоличествоЕдиницПоЛС"      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаРаспределений.Колонки.Добавить("Приоритет"                 , ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	ТаблицаРаспределений.Колонки.Добавить("Факт"                      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаРаспределений.Колонки.Добавить("СальдоНаНачало"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("Сальдо"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("СальдоПени"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("Оплата"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("Разовые"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаРаспределений.Колонки.Добавить("Доля"                      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаРаспределений.Колонки.Добавить("ДоляПоЛС"                  , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаРаспределений.Колонки.Добавить("Объем"                     , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	
	Возврат ТаблицаРаспределений;
	
КонецФункции // СформироватьТаблицуНачислений()

// Функция формирует таблицу значений для ведения расчетов начислений.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуЛьготСтар() Экспорт
	
	ТаблицаЛьгот = Новый ТаблицаЗначений;
	ТаблицаЛьгот.Колонки.Добавить("ЛицевойСчет"  , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаЛьгот.Колонки.Добавить("Услуга"       , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаЛьгот.Колонки.Добавить("Льгота"       , Новый ОписаниеТипов("СправочникСсылка.бит_СписокЛьгот"));
	ТаблицаЛьгот.Колонки.Добавить("ФизЛицо"      , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	ТаблицаЛьгот.Колонки.Добавить("СуммаЛичной"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаЛьгот.Колонки.Добавить("Начислено"    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	
	Возврат  ТаблицаЛьгот;
	
КонецФункции // ()

// Функция формирует таблицу значений для ведения расчетов начислений.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуЛьгот() Экспорт
	
	ТаблицаЛьгот = Новый ТаблицаЗначений;
	ТаблицаЛьгот.Колонки.Добавить("ЛицевойСчет"        , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаЛьгот.Колонки.Добавить("Услуга"             , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаЛьгот.Колонки.Добавить("ФизЛицо"            , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	ТаблицаЛьгот.Колонки.Добавить("Льгота"             , Новый ОписаниеТипов("СправочникСсылка.бит_СписокЛьгот"));
	ТаблицаЛьгот.Колонки.Добавить("Начислено"          , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаЛьгот.Колонки.Добавить("СуммаЛичной"        , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаЛьгот.Колонки.Добавить("Приоритет"          , ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	ТаблицаЛьгот.Колонки.Добавить("ПравоНаЛьготы"      , Новый ОписаниеТипов("Булево"));
	ТаблицаЛьгот.Колонки.Добавить("Факт"               , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаЛьгот.Колонки.Добавить("Норма"              , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаЛьгот.Колонки.Добавить("КоличествоНосителей", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	ТаблицаЛьгот.Колонки.Добавить("ДоляПлощади"        , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаЛьгот.Колонки.Добавить("ПоНорме"            , Новый ОписаниеТипов("Булево"));
	ТаблицаЛьгот.Колонки.Добавить("НачисленоСемейной"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаЛьгот.Колонки.Добавить("ВладелецЛьготы"     , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	ТаблицаЛьгот.Колонки.Добавить("СемейнаяЛьгота"     , Новый ОписаниеТипов("Булево"));
	ТаблицаЛьгот.Колонки.Добавить("НормаЛьготы"        , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаЛьгот.Колонки.Добавить("ПриоритетУслуги"    , ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	ТаблицаЛьгот.Колонки.Добавить("РасчетДолей"        , Новый ОписаниеТипов("Булево"));
	// БИТ_ЖКХ_29112013_начало_изменений
	ТаблицаЛьгот.Колонки.Добавить("Объем"                  , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаЛьгот.Колонки.Добавить("НормативПотребленияПоКу", ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	// БИТ_ЖКХ_29112013_окончание_изменений
	
	// БИТ_ЖКХ 11.03.2014
	ТаблицаЛьгот.Колонки.Добавить("СуммаСумм"              , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	// БИТ_ЖКХ 11.03.2014
	
	Возврат  ТаблицаЛьгот;
	
КонецФункции // ()

// Функция формирует таблицу значений для ведения расчетов начислений.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуНорм()
	
	ТаблицаНорм = Новый ТаблицаЗначений;
	ТаблицаНорм.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаНорм.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	// БИТ_ЖКХ 14.07.2017 11:49:52 Начало правки...
//	ТаблицаНорм.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
//  19.12.2018 55
	ТаблицаНорм.Колонки.Добавить("СтавкаНДС"                 , Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСтавокНДС"));
	// БИТ_ЖКХ 14.07.2017 11:49:52 Конец правки.
	ТаблицаНорм.Колонки.Добавить("Приоритет"                 , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	ТаблицаНорм.Колонки.Добавить("РежимПотребления"          , Новый ОписаниеТипов("СправочникСсылка.бит_РежимыПотребленияУслуг"));
	ТаблицаНорм.Колонки.Добавить("ОсновнойРежимПотребления"  , Новый ОписаниеТипов("СправочникСсылка.бит_РежимыПотребленияУслуг"));
	ТаблицаНорм.Колонки.Добавить("СпособРасчета"             , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаНорм.Колонки.Добавить("ОсновнойСпособРасчета"     , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	ТаблицаНорм.Колонки.Добавить("Ставка"                    , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("СверхномСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	// БИТ_ЖКХ 07072015++
	ТаблицаНорм.Колонки.Добавить("ЛьготнаяСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	// БИТ_ЖКХ 07072015--
	ТаблицаНорм.Колонки.Добавить("ПлановаяСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("ОсновнаяСтавка"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("ОсновнаяСверхНормСтавка"   , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("ОсновнаяПлановаяСтавка"    , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("Норма"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	// БИТ_ЖКХ 16.05.2017 12:00:20 Начало правки...
	ТаблицаНорм.Колонки.Добавить("РасчетнаяНорма"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	// БИТ_ЖКХ 16.05.2017 12:00:20 Конец правки.
	ТаблицаНорм.Колонки.Добавить("СверхНорма"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("Норматив"                  , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("НормаЛьготы"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("Поставщик"                 , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	ТаблицаНорм.Колонки.Добавить("Факт"                      , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("ПолучательДенежныхСредств" , Новый ОписаниеТипов("СправочникСсылка.Контрагенты,СправочникСсылка.Организации"));
	ТаблицаНорм.Колонки.Добавить("ДоговорКонтрагента"        , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаНорм.Колонки.Добавить("СальдоНаНачало"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("Сальдо"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("СальдоПени"                , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("Оплата"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("Разовые"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("НаОдного"                  , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("НаДвоих"                   , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("НаСемью"                   , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("НаСемью4"                  , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("НаСемью5"                  , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("НаСемью6"                  , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("НаЛицевойСчет"             , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("ДопНормаНаСемью"           , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("ДопНормаНаКаждого"         , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	
	ТаблицаНорм.Колонки.Добавить("ИспользоватьДопНормуНаОдного"   , Новый ОписаниеТипов("Булево"));
	ТаблицаНорм.Колонки.Добавить("ИспользоватьДопНормуНаЛьготника", Новый ОписаниеТипов("Булево"));
	
	ТаблицаНорм.Колонки.Добавить("СтавкаГрупСИнд"            , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));   
	ТаблицаНорм.Колонки.Добавить("Тариф"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаНорм.Колонки.Добавить("ФактОтОсновного"           , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("Объем"                     , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("НормативПотребленияПоКу"   , ОбщегоНазначения.ОписаниеТипаЧисло(16,6));
	
	// БИТ_ЖКХ_22082013_начало_изменений
	ТаблицаНорм.Колонки.Добавить("ГруппаУслуги"              , Новый ОписаниеТипов("СправочникСсылка.бит_ГруппыУслуг"));
	ТаблицаНорм.Колонки.Добавить("ПериодСравнения"           , Новый ОписаниеТипов("Дата"));
	ТаблицаНорм.Колонки.Добавить("ТарифДо"                   , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаНорм.Колонки.Добавить("СтавкаДо"                  , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("СверхномСтавкаДо"          , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("ПредельныйИндекс"          , ОбщегоНазначения.ОписаниеТипаЧисло(6,4));
	ТаблицаНорм.Колонки.Добавить("НачислятьПредельныйИндекс" , Новый ОписаниеТипов("Булево"));
	ТаблицаНорм.Колонки.Добавить("ПлановаяСтавкаДо"          , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("ОбъемДо"                   , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаНорм.Колонки.Добавить("ЕдИзм"                     , Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаНорм.Колонки.Добавить("МойПоставщик"              , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	// БИТ_ЖКХ_22082013_окончание_изменений
	
	Возврат ТаблицаНорм;
	
КонецФункции // СформироватьТаблицуНорм()

// Функция формирует таблицу значений для ведения расчетов по проживающим.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуПроживающих() Экспорт
	
	ТаблицаПроживающих = Новый ТаблицаЗначений();
	ТаблицаПроживающих.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПроживающих.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПроживающих.Колонки.Добавить("ФизЛицо"                   , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	ТаблицаПроживающих.Колонки.Добавить("Ставка"                    , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаПроживающих.Колонки.Добавить("КоличествоДней"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПроживающих.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПроживающих.Колонки.Добавить("ПроживаниеВданныйМомент"   , Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаПроживающих;
	
КонецФункции // ()

// БИТ ЖКХ 08.04.2020
// Функция формирует таблицу значений для ведения расчетов по проживающим.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуПоДнямСобственности() Экспорт
	
	ТаблицаПроживающих = Новый ТаблицаЗначений();
	ТаблицаПроживающих.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаПроживающих.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаПроживающих.Колонки.Добавить("ФизЛицо"                   , Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
	ТаблицаПроживающих.Колонки.Добавить("Ставка"                    , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаПроживающих.Колонки.Добавить("КоличествоДней"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,0));
	ТаблицаПроживающих.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаПроживающих.Колонки.Добавить("ПроживаниеВданныйМомент"   , Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаПроживающих;
	
КонецФункции // ()

// Функция формирует таблицу значений для ведения расчетов по счетчикам групповым с наличием индивидуальных.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для ведения расчетов начислений.
//
Функция СформироватьТаблицуОбщедомовыхРасходов() Экспорт
	
	ТаблицаСчГрупСИнд = Новый ТаблицаЗначений;
	ТаблицаСчГрупСИнд.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаСчГрупСИнд.Колонки.Добавить("Здание"                    , Новый ОписаниеТипов("СправочникСсылка.бит_СписокЗданий"));
	ТаблицаСчГрупСИнд.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаСчГрупСИнд.Колонки.Добавить("Счетчик"                   , Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
	ТаблицаСчГрупСИнд.Колонки.Добавить("Приоритет"                 , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	ТаблицаСчГрупСИнд.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	// БИТ_ЖКХ 11.05.2016 10:40:57 Начало правки...
	ТаблицаСчГрупСИнд.Колонки.Добавить("НачислениеПоНормативуОДН"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	// БИТ_ЖКХ 11.05.2016 10:40:57 Конец правки.
	ТаблицаСчГрупСИнд.Колонки.Добавить("НераспределенныйОстаток"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТаблицаСчГрупСИнд.Колонки.Добавить("ОтПоказаний"               , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчГрупСИнд.Колонки.Добавить("ДоПоказаний"               , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчГрупСИнд.Колонки.Добавить("КоличествоЕдиниц"          , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчГрупСИнд.Колонки.Добавить("СтавкаПоСчетчику"          , ОбщегоНазначения.ОписаниеТипаЧисло(17,4));
	ТаблицаСчГрупСИнд.Колонки.Добавить("НаименованиеЛС"            , ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаСчГрупСИнд.Колонки.Добавить("СпособРаспределения"       , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРаспределения"));
	ТаблицаСчГрупСИнд.Колонки.Добавить("ВладелецСчетчика"          , Новый ОписаниеТипов("СправочникСсылка.бит_СписокЗданий"));
	ТаблицаСчГрупСИнд.Колонки.Добавить("ИсточникПоказаний"         , Новый ОписаниеТипов("ПеречислениеСсылка.бит_ИсточникПоказаний"));
	ТаблицаСчГрупСИнд.Колонки.Добавить("Факт"                      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчГрупСИнд.Колонки.Добавить("СпособРасчета"             , Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам"));
	
	ТаблицаСчГрупСИнд.Колонки.Добавить("КоличествоЕдиницПоЛС"      , ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	ТаблицаСчГрупСИнд.Колонки.Добавить("Тариф"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	
	Возврат ТаблицаСчГрупСИнд;
	
КонецФункции // ()

// БИТ_ЖКХ 13.10.2015 16:08:02 Начало правки... 

//Функция рассчитывает скорректированную сумму без НДС, в разрезе номенклатуры 
// Возвращаемое значение:
//   <СуммаБезНДС>   - Сумма за вычетом НДС, с учетом набегающей погрешности.
Функция CкорректированнаяCуммаНДС(ТЗНДС, Номенклатура, Начислено, НДССтавка) Экспорт
	
	ТЗНДС.Свернуть("Номенклатура", "СуммаНачислений, СуммаБезНДС");
	СтрТЗ = ТЗНДС.Найти(Номенклатура, "Номенклатура");
	
	Если СтрТЗ = Неопределено Тогда //Если первая запись о номенклатуре
		//НДС от общей суммы начислений
		СуммаПоНачислениямБезНДС = Начислено - (Начислено*(НДССтавка/(100+НДССтавка)));
		//Скорректированная суммма без НДС
		СуммаБезНДС = Окр(СуммаПоНачислениямБезНДС, 2);
	Иначе
		СуммаНачислений = СтрТЗ.СуммаНачислений + Начислено;
		//НДС от общей суммы начислений
		СуммаПоНачислениямБезНДС = СуммаНачислений - (СуммаНачислений*(НДССтавка/(100+НДССтавка)));
		//Скорректированная суммма без НДС
		СуммаБезНДС = Окр(СуммаПоНачислениямБезНДС, 2) - СтрТЗ.СуммаБезНДС;
	КонецЕсли;
	
	//Заполним ТЗ для расчета следующей суммы
	Строка = ТЗНДС.Добавить();
	Строка.Номенклатура =  Номенклатура;
	Строка.СуммаНачислений = Начислено;
	Строка.СуммаБезНДС = СуммаБезНДС;
	
	Возврат СуммаБезНДС;
	
КонецФункции
// БИТ_ЖКХ 13.10.2015 16:07:57 Конец правки.

#КонецОбласти

#Область ФункцииПоискаНачислений

// Функция выполняем поиск начислений по лс. 
//
// Параметры:
//  <Дата>         - <Тип.Дата>             - Дата ведения начислений.
//                 
//  <Организация>  - <Тип.СправочникСсылка> - Организация для которой ведеся расчет начислений.
//                 
//  <СписокЛС>     - <Тип.СписокЗначений>   - Список лицевых счетов.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначение>   - Таблица начислений по нормам.
//
Функция ПолучитьТаблицуНачислений(Дата, Организация, СписокЛС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.Норматив,
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.Начислено КАК Начислено,
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.ЛицевойСчет,
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.Услуга,
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.СпособРасчета,
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.Факт,
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.НормаЛьготы,  
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.Приоритет
	|ИЗ
	|	Документ.бит_НачислениеПоЛицевымСчетам.ЛицевыеСчета КАК НачислениеПоЛицевымСчетамЛицевыеСчета
	|ГДЕ
	|	НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.Организация = &Организация
	|	И НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ)
	|	И НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ)
	|	И (НЕ НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.ПометкаУдаления)
	|	И НачислениеПоЛицевымСчетамЛицевыеСчета.Ссылка.Проведен = ИСТИНА
	|	И НачислениеПоЛицевымСчетамЛицевыеСчета.ЛицевойСчет В (&СписокЛС)";
	
	Запрос.УстановитьПараметр("Момент"     , Дата       );
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокЛС"   , СписокЛС   );
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()

// Функция выполняем поиск начислений по счетчикам. 
//
// Параметры:
//  <Дата>         - <Тип.Дата>             - Дата ведения начислений.
//                 
//  <Организация>  - <Тип.СправочникСсылка> - Организация для которой ведеся расчет начислений.
//  
//  <СписокЛС>     - <Тип.СписокЗначений>   - Список лицевых счетов.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначение>   - Таблица начислений по нормам.
//
Функция ПолучитьТаблицуСчетчиков(Дата, Организация, СписокЛС);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикамНачисления.ЛицевойСчет КАК ЛицевойСчет,
	// БИТ_ЖКХ 02.03.2016 13:50:44 Начало правки... 
	|	бит_НачисленияПоСчетчикамНачисления.Счетчик,
	// БИТ_ЖКХ 02.03.2016 13:50:48 Конец правки. 
	|	бит_НачисленияПоСчетчикамНачисления.Услуга,
	|	бит_НачисленияПоСчетчикамНачисления.СпособРасчета,
	|	бит_НачисленияПоСчетчикамНачисления.Начислено КАК Начислено,
	|	бит_НачисленияПоСчетчикамНачисления.Норматив КАК Норматив,
	|	бит_НачисленияПоСчетчикамНачисления.НормаЛьготы КАК НормаЛьготы,
	|	бит_НачисленияПоСчетчикамНачисления.ОсновнаяСтавка КАК Ставка,
	|	бит_НачисленияПоСчетчикамНачисления.СверхНормативнаяСтавка КАК СверхномСтавка,
	|	бит_НачисленияПоСчетчикамНачисления.Факт КАК Факт,
	|	бит_НачисленияПоСчетчикамНачисления.Приоритет,
	|	бит_НачисленияПоСчетчикамНачисления.ВладелецСчетчика,
	|	бит_НачисленияПоСчетчикамНачисления.Норма,
	|	бит_НачисленияПоСчетчикамНачисления.Многотарифный
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикам.Начисления КАК бит_НачисленияПоСчетчикамНачисления
	|ГДЕ
	|	бит_НачисленияПоСчетчикамНачисления.Ссылка.Организация = &Организация
	|	И бит_НачисленияПоСчетчикамНачисления.Ссылка.Проведен
	|	И НЕ бит_НачисленияПоСчетчикамНачисления.Ссылка.ПометкаУдаления
	|	И бит_НачисленияПоСчетчикамНачисления.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ)
	|	И бит_НачисленияПоСчетчикамНачисления.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ)
	|	И бит_НачисленияПоСчетчикамНачисления.ЛицевойСчет В(&СпискоЛС)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет";
	
	Запрос.УстановитьПараметр("Момент"     , Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СпискоЛС"   , СписокЛС);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()

// Функция выполняем поиск начислений по распределениям. 
//
// Параметры:
//  <Дата>         - <Тип.Дата>             - Дата ведения начислений.
//                 
//  <Организация>  - <Тип.СправочникСсылка> - Организация для которой ведеся расчет начислений.
//  
//  <СписокЛС>     - <Тип.СписокЗначений>   - Список лицевых счетов.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначение>   - Таблица начислений по нормам.
//
Функция ПолучитьТаблицуРаспределений(Дата, Организация, СписокЛС);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикамРаспределения.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоСчетчикамРаспределения.Услуга КАК Услуга,
	|	бит_НачисленияПоСчетчикамРаспределения.СпособРасчета КАК СпособРасчета,
	|	бит_НачисленияПоСчетчикамРаспределения.Начисления КАК Начислено,
	|	бит_НачисленияПоСчетчикамРаспределения.Норматив КАК Норматив,
	|	бит_НачисленияПоСчетчикамРаспределения.НормаЛьготы КАК НормаЛьготы,
	|	бит_НачисленияПоСчетчикамРаспределения.ОсновнаяСтавка КАК Ставка,
	|	бит_НачисленияПоСчетчикамРаспределения.СверхНормативнаяСтавка КАК СверхНормСтавка,
	|	бит_НачисленияПоСчетчикамРаспределения.Факт КАК Факт,
	|	бит_НачисленияПоСчетчикамРаспределения.Приоритет
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикам.Распределения КАК бит_НачисленияПоСчетчикамРаспределения
	|ГДЕ
	|	бит_НачисленияПоСчетчикамРаспределения.Ссылка.Организация = &Организация
	|	И бит_НачисленияПоСчетчикамРаспределения.Ссылка.Проведен
	|	И (НЕ бит_НачисленияПоСчетчикамРаспределения.Ссылка.ПометкаУдаления)
	|	И бит_НачисленияПоСчетчикамРаспределения.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ)
	|	И бит_НачисленияПоСчетчикамРаспределения.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ)
	|	И бит_НачисленияПоСчетчикамРаспределения.ЛицевойСчет В(&СпискоЛС)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет";
	
	Запрос.УстановитьПараметр("Момент"     , Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СпискоЛС"   , СписокЛС);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()

// Функция выполняем поиск начислений по распределениям. 
//
// Параметры:
//  <Дата>         - <Тип.Дата>             - Дата ведения начислений.
//                 
//  <Организация>  - <Тип.СправочникСсылка> - Организация для которой ведеся расчет начислений.
//  
//  <СписокЛС>     - <Тип.СписокЗначений>   - Список лицевых счетов.
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначение>   - Таблица начислений по нормам.
//
Функция ПолучитьТаблицуПоГрупСИндСчетчиков(Дата, Организация, СписокЛС);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Услуга КАК Услуга,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Начислено
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Начисления КАК бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления
	|ГДЕ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка.Организация = &Организация
	|	И бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка.Проведен
	|	И (НЕ бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка.ПометкаУдаления)
	|	И бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ)
	|	И бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ)
	|	И бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ЛицевойСчет В(&СпискоЛС)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет";
	
	Запрос.УстановитьПараметр("Момент"     , Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СпискоЛС"   , СписокЛС);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Функция выполняет расчет нормы по услугам.
//
// Параметры:
//  Выборка  - ВыборкаИзРезультатаЗапроса.  - Входящие данные.
//
// Возвращаемое значение:
//   Число   - количество нормы на лс по услуге.
//
Функция ПолучитьНорму(Выборка)
	
	Норма = 0;
	
	// БИТ_ЖКХ 16.05.2017 14:31:38 Начало правки...
	//мКоличествоПроживающихДляРасчета = Выборка.мКоличествоПоНорме;
	Если Выборка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом Тогда
		мКоличествоПроживающихДляРасчета = Выборка.КоличествоПроживающихПоНорме;	
	Иначе
		мКоличествоПроживающихДляРасчета = Выборка.мКоличествоПоНорме;
	КонецЕсли;
	// БИТ_ЖКХ 16.05.2017 14:31:38 Конец правки.
	
	Если мКоличествоПроживающихДляРасчета = 1 тогда
		Норма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
	ИначеЕсли мКоличествоПроживающихДляРасчета = 2 тогда
		Норма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;
		// БИТ_ЖКХ изменение кода. Начало. 21.05.2012{{
		// ИначеЕсли мКоличествоПроживающихДляРасчета > 2 тогда.
	ИначеЕсли мКоличествоПроживающихДляРасчета = 3 тогда
		Норма  = Выборка.НаСемью * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
	ИначеЕсли мКоличествоПроживающихДляРасчета = 4 тогда
		Норма  = Выборка.НаСемью4 * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
	ИначеЕсли мКоличествоПроживающихДляРасчета = 5 тогда
		Норма  = Выборка.НаСемью5 * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
	ИначеЕсли мКоличествоПроживающихДляРасчета > 5 тогда
		Норма  = Выборка.НаСемью6 * мКоличествоПроживающихДляРасчета + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПроживающихДляРасчета;  
		// БИТ_ЖКХ изменение кода. Конец. 21.05.2012}}
	КонецЕсли;
	
	Возврат Окр(Норма, 4);
	
КонецФункции // ПполучитьНорму()

// Функция выполняет расчет нормы льготы по услуге.
//
// Параметры:
//  Выборка  - ВыборкаИзРезультатаЗапроса.  - Входящие данные.
//
// Возвращаемое значение:
//   Число   - количество нормы льготы на лс по услуге.
//
Функция ПолучитьНормуЛьготы(Выборка)
	
	НормаЛьготы = 0;
	
	мКоличествоПоНормеЛьгота = Выборка.мКоличествоПоНормеЛьгота;
	
	Если Выборка.мКоличествоПоНормеЛьгота = 1 Тогда 
		
		Если Выборка.ИспользоватьДопНормуНаЛьготника тогда
			НормаЛьготы = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
		иначе
			НормаЛьготы = Выборка.НаОдного; 	
		КонецЕсли;
		
	ИначеЕсли Выборка.мКоличествоПоНормеЛьгота = 2 Тогда 
		Если Выборка.ИспользоватьДопНормуНаЛьготника тогда
			НормаЛьготы  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;	
		иначе
			НормаЛьготы  = Выборка.НаДвоих * 2; 	
		КонецЕсли;
		// БИТ_ЖКХ изменение кода. Начало. 21.05.2012{{
		// ИначеЕсли Выборка.мКоличествоПоНормеЛьгота > 2 тогда.
	ИначеЕсли Выборка.мКоличествоПоНормеЛьгота = 3 тогда
		Если Выборка.ИспользоватьДопНормуНаЛьготника тогда
			НормаЛьготы = Выборка.НаСемью * мКоличествоПоНормеЛьгота + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПоНормеЛьгота;	
		иначе
			НормаЛьготы = Выборка.НаСемью * мКоличествоПоНормеЛьгота; 	
		КонецЕсли;
	ИначеЕсли Выборка.мКоличествоПоНормеЛьгота = 4 тогда
		Если Выборка.ИспользоватьДопНормуНаЛьготника тогда
			НормаЛьготы = Выборка.НаСемью4 * мКоличествоПоНормеЛьгота + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПоНормеЛьгота;	
		иначе
			НормаЛьготы = Выборка.НаСемью4 * мКоличествоПоНормеЛьгота; 	
		КонецЕсли;
	ИначеЕсли Выборка.мКоличествоПоНормеЛьгота = 5 тогда
		Если Выборка.ИспользоватьДопНормуНаЛьготника тогда
			НормаЛьготы = Выборка.НаСемью5 * мКоличествоПоНормеЛьгота + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПоНормеЛьгота;	
		иначе
			НормаЛьготы = Выборка.НаСемью5 * мКоличествоПоНормеЛьгота; 	
		КонецЕсли;
	ИначеЕсли Выборка.мКоличествоПоНормеЛьгота > 5 тогда
		Если Выборка.ИспользоватьДопНормуНаЛьготника тогда
			НормаЛьготы = Выборка.НаСемью6 * мКоличествоПоНормеЛьгота + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * мКоличествоПоНормеЛьгота;	
		иначе
			НормаЛьготы = Выборка.НаСемью6 * мКоличествоПоНормеЛьгота; 	
		КонецЕсли;
		// БИТ_ЖКХ изменение кода. Конец. 21.05.2012}}
	КонецЕсли;
	
	Возврат Окр(НормаЛьготы, 4);
	
КонецФункции // ПолучитьНормуЛьготы()

// Процедура добавляет колонки для бух учета.
//
Процедура ДобавитьКолонкиБухУчета(Таблица) Экспорт
	
	Таблица.Колонки.Добавить("СчетАбонента");
	Таблица.Колонки.Добавить("Субконто1");
	Таблица.Колонки.Добавить("Субконто2");
	Таблица.Колонки.Добавить("Субконто3");
	Таблица.Колонки.Добавить("СчетКУ");
	Таблица.Колонки.Добавить("СубконтоКУ1");
	Таблица.Колонки.Добавить("СубконтоКУ2");
	Таблица.Колонки.Добавить("СубконтоКУ3");
	
КонецПроцедуры

// БИТ_ЖКХ Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ВыполнитьРасчетПоСтроке(Приемник, Знач Источник, Знач Остаток, Знач Показатель, Знач ОбщийПоказатель, СтрокаРасчета)
	
	Если Показатель = 0 И ОбщийПоказатель = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = Приемник.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
	
	НераспределенныйОстаток = 0;
	тмпСумма                = ОКР((Показатель*Остаток)/ОбщийПоказатель,4);
	Сумма                   = тмпСумма;
	
	РазницаРаспределения = 0;
	
	// Отрицательная сумма не должна превышать сумму начислений. 
	Если тмпСумма < 0 Тогда
		
		Сумма                   = Мин(тмпСумма * -1, СтрокаРасчета.СуммаНачислений) * -1;
		НераспределенныйОстаток = тмпСумма - Сумма;
		
		СтрокаРасчета.НераспределенныйОстаток = СтрокаРасчета.НераспределенныйОстаток + НераспределенныйОстаток;
		
	ИначеЕсли НЕ СтрокаРасчета.НераспределенныйОстаток = 0 Тогда
		
		РазницаРаспределения = СтрокаРасчета.НераспределенныйОстаток + тмпСумма;
		
		Если РазницаРаспределения > 0 Тогда
			НераспределенныйОстаток = (СтрокаРасчета.НераспределенныйОстаток * -1);
			Сумма                   = РазницаРаспределения;
			
			СтрокаРасчета.НераспределенныйОстаток = 0;
		Иначе
			
			НераспределенныйОстаток = Сумма;
			СтрокаРасчета.НераспределенныйОстаток = РазницаРаспределения;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	СтрокаРасчета.СуммаНачислений = СтрокаРасчета.СуммаНачислений + Сумма;
	
	Объем = ОКР(?(Источник.Тариф = 0, 0 ,Сумма/Источник.Тариф),4);
	
	НоваяСтрока.НераспределенныйОстаток = НераспределенныйОстаток;
	НоваяСтрока.Здание                  = НоваяСтрока.ЛицевойСчет.Здание;
	НоваяСтрока.ИсточникПоказаний       = Перечисления.бит_ИсточникПоказаний.Инспектор;
	НоваяСтрока.Начислено               = Сумма;
	НоваяСтрока.КоличествоЕдиницПоЛС    = Объем;
	// БИТ_ЖКХ 11.05.2016 11:28:54 Начало правки...
	НоваяСтрока.НачислениеПоНормативуОДН= Источник.ФактСУчетомСтавкиОДН;
	// БИТ_ЖКХ 11.05.2016 11:28:54 Конец правки.
	
	
	Возврат НоваяСтрока;
	
КонецФункции // () 

// Процедура выставляет пометку на удаление у подчиненых документов.
//
// Параметры:
//  ДокументСтруктура  - <Тип.Структура>  - Содержит данные документа владельца(Имя,Ссылка, ПометкаУдаления).
//
//  Отказ              - <Тип.Булево>     - Фдлаг.
//                 
Процедура СинхронизацияПометкиНаУдалениеУСДокументамиРаспределенияРасходов(ДокументСтруктура, Отказ = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Док.ПометкаУдаления
	| ИЗ 
	//|      Документ." + ДокументОбъект.Метаданные().Имя + " КАК Док 
	|      Документ." + ДокументСтруктура.Имя + " КАК Док
	|     ГДЕ Док.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка" , ДокументСтруктура.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ДокументСтруктура.ПометкаУдаления = ?(Результат.Количество()>0,Результат[0].ПометкаУдаления, ложь) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК Документ,
		|	АктОбОказанииПроизводственныхУслуг.ПометкаУдаления
		|ИЗ
		|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
		|ГДЕ
		|	АктОбОказанииПроизводственныхУслуг.бит_ДокументОснование = &ДокументСсылка
		|	И АктОбОказанииПроизводственныхУслуг.ПометкаУдаления = &ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.ПометкаУдаления
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.бит_ДокументОснование = &ДокументСсылка
		|	И РеализацияТоваровУслуг.ПометкаУдаления = &ПометкаУдаления";
		Запрос.УстановитьПараметр("ПометкаУдаления", НЕ ДокументСтруктура.ПометкаУдаления);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Попытка
				
				ДокументРаспределения = Выборка.Документ.ПолучитьОбъект();
				
				ДокументРаспределения.УстановитьПометкуУдаления(ДокументСтруктура.ПометкаУдаления);
				
				Если ДокументСтруктура.ПометкаУдаления Тогда
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ <" + ДокументРаспределения + "> помечен на удаление.");
					
				Иначе
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("У документа <" + ДокументРаспределения + "> снята пометка на удаление.");
					
				КонецЕсли;
				
			Исключение
				Отказ = Истина;
			КонецПопытки;
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти