#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем заполнение обязательных реквизитов.
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено наименование. Элемент не может быть записан!",Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли