#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мРасчетСУчетомДолейВладения          Экспорт; // Хранит флаг настройки ЖКХ.
Перем мУменьшениеНормыЛьготыВПределахФакта Экспорт; // Хранит флаг настройки ЖКХ.
Перем мЛьготаПерсонифицированная           Экспорт; // Хранит флаг настройки ЖКХ.
Перем мНачислениеСУчетомДнейПроживания     Экспорт; // Хранит флаг настройки ЖКХ.

Перем мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Экспорт; // Хранит флаг настройки ЖКХ.

Перем мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика Экспорт; // Хранит флаг настройки ЖКХ.

Перем мНачислятьПениСУчетомПереплаты Экспорт; // Хранит флаг настройки ЖКХ.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

Процедура ОбновитьПараметрыЖКХ() Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты", Ложь);
	
	Если ОплатаПоПериоду И ЗначениеЗаполнено(КонецПериодаОплаты) Тогда
		мДата = КонецМесяца(КонецПериодаОплаты);
	Иначе
		мДата = Дата;
	КонецЕсли;
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(мДата), Организация, ПараметрыЖКХ);
	
	мРасчетСУчетомДолейВладения          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мУменьшениеНормыЛьготыВПределахФакта = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	мЛьготаПерсонифицированная           = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	мНачислениеСУчетомДнейПроживания     = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика  = ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика;
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика  = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	мНачислятьПениСУчетомПереплаты  = ПараметрыЖКХ.НачислятьПениСУчетомПереплаты;
	
КонецПроцедуры

Процедура УдалитьПустыеСтроки() Экспорт
	
	КоличествоЗаписей = СписокУслуг.Количество();
	
	Для Ном = 1 По КоличествоЗаписей Цикл
		
		ТекСтрока = СписокУслуг[КоличествоЗаписей - Ном];
		
		Если ТекСтрока.Сумма = 0 И ТекСтрока.СуммаПени = 0 Тогда
			
			СписокУслуг.Удалить(ТекСтрока);
			
		КонецЕсли;
		
	КонецЦикла;		
	
	//РаспределитьУслугиПоПериоду();
	
КонецПроцедуры

//Процедура РаспределитьУслугиПоПериоду()
//	
//	СписокУслугПоПериоду.Очистить();
//	
//	ТабВнесеннаяСумма = СписокУслуг.Выгрузить(,"ЛицевойСчет,Услуга,Сумма");
//	ТабВнесеннаяСумма.Свернуть("ЛицевойСчет,Услуга","Сумма");
//	
//	Если ОплатаПоПериоду И ЗначениеЗаполнено(КонецПериодаОплаты) Тогда
//		мДата = КонецМесяца(КонецПериодаОплаты);
//	Иначе
//		мДата = КонецМесяца(Дата);
//	КонецЕсли;
//	
//	// Список актуальных ЛС, по которым был расчет.
//	врТаб = СписокУслуг.Выгрузить(,"ЛицевойСчет");
//	врТаб.Свернуть("ЛицевойСчет");
//	ЛицевыеСчета = врТаб.ВыгрузитьКолонку("ЛицевойСчет");
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
//	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание КАК Здание,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район КАК Район,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок КАК Участок,
//	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств КАК ПолучательДенежныхСредств,
//	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
//	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
//	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.МОП КАК МОП,
//	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь
//	|ПОМЕСТИТЬ ПоставщикиИУслуги
//	|ИЗ
//	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода {(&КонецПериода)}, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_СведенияПоУслугамЛССрезПоследних
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
//	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
//	|			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_СведенияОКвартиреСрезПоследних
//	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//	|ГДЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
//	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок,
//	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
//	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
//	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
//	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.МОП,
//	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ) КАК Период,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.Приоритет КАК Приоритет,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Начисления,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Разовые,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
//	|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Оплата,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
//	|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Льгота,
//	|	СУММА(ВЫБОР
//	|			КОГДА (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
//	|					И НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК НачисленияИнд,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//	|					ИЛИ (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|						ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
//	|						ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
//	|						И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК НачисленияОбщеДом,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК СубсидияПИ
//	|ПОМЕСТИТЬ Обороты
//	|ИЗ
//	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
//	|			&НачалоПериода {(&НачалоПериода)},
//	|			&КонецПериода {(&КонецПериода)},
//	|			Регистратор,
//	|			ЛицевойСчет В
//	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|						ПоставщикиИУслуги.ЛицевойСчет
//	|					ИЗ
//	|						ПоставщикиИУслуги)
//	|				И УслугаЖКХ В
//	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|						ПоставщикиИУслуги.Услуга
//	|					ИЗ
//	|						ПоставщикиИУслуги)
//	|				И Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
//	|ГДЕ
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор <> &Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ),
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.Приоритет,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ КАК УслугаЖКХ,
//	|	СУММА(бит_НачисленияПоУслугамЖКХПоПериоду.Сумма) КАК СуммаОплаты
//	|ПОМЕСТИТЬ ОборотыОплата
//	|ИЗ
//	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду КАК бит_НачисленияПоУслугамЖКХПоПериоду
//	|ГДЕ
//	|	(бит_НачисленияПоУслугамЖКХПоПериоду.Регистратор ССЫЛКА Документ.бит_ОплатаКУ ИЛИ бит_НачисленияПоУслугамЖКХПоПериоду.Регистратор ССЫЛКА Документ.бит_РаспределениеАванса)
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.Регистратор <> &Ссылка
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов МЕЖДУ &НачалоПериода И &КонецПериода
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ПоставщикиИУслуги.ЛицевойСчет
//	|			ИЗ
//	|				ПоставщикиИУслуги)
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ПоставщикиИУслуги.Услуга
//	|			ИЗ
//	|				ПоставщикиИУслуги)
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.Организация = &Организация
//	|	И НЕ бит_НачисленияПоУслугамЖКХПоПериоду.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.бит_ВидНачисленияПоУслугамЖКХ.Аванс)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов, МЕСЯЦ),
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Обороты.ЛицевойСчет КАК ЛицевойСчет,
//	|	Обороты.Период КАК Период,
//	|	Обороты.УслугаЖКХ КАК УслугаЖКХ,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(Обороты.Разовые, 0) < 0
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЕСТЬNULL(Обороты.Начисления, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0) > 0
//	|						ТОГДА ЕСТЬNULL(Обороты.Начисления, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0)
//	|					ИНАЧЕ 0
//	|				КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0) > 0
//	|					ТОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0)
//	|				ИНАЧЕ 0
//	|			КОНЕЦ
//	|	КОНЕЦ КАК СуммаКОплате
//	|ИЗ
//	|	Обороты КАК Обороты
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыОплата КАК ОборотыОплата
//	|		ПО Обороты.Период = ОборотыОплата.ПериодВзаиморасчетов
//	|			И Обороты.ЛицевойСчет = ОборотыОплата.ЛицевойСчет
//	|			И Обороты.УслугаЖКХ = ОборотыОплата.УслугаЖКХ
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Период,
//	|	Обороты.Приоритет
//	|ИТОГИ
//	|	СУММА(СуммаКОплате)
//	|ПО
//	|	ЛицевойСчет,
//	|	Период";
//	
//	Запрос.УстановитьПараметр("ЛицевойСчет",	ЛицевыеСчета);
//	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериодаОплаты);
//	Запрос.УстановитьПараметр("КонецПериода",	мДата);
//	Запрос.УстановитьПараметр("Организация",	Организация);
//	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
//	
//	
//	// Обход по ЛС.
//	ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	Пока ВыборкаЛС.Следующий() Цикл
//		
//		Если ВыборкаЛС.СуммаКОплате <= 0 Тогда
//		 	Продолжить;
//		КонецЕсли;
//		
//		
//		// Обход по периодам.
//		ВыборкаПериод = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//		Пока ВыборкаПериод.Следующий() Цикл
//			
//			Если ВыборкаПериод.СуммаКОплате <= 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			
//			// Обход по услугам.
//			ВыборкаУслуга = ВыборкаПериод.Выбрать();
//			Пока ВыборкаУслуга.Следующий() Цикл
//				
//				Если ВыборкаУслуга.СуммаКОплате <= 0 Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				
//				// Находим остаток внесенной суммы.
//				Отбор = Новый Структура;
//				Отбор.Вставить("ЛицевойСчет", ВыборкаУслуга.ЛицевойСчет);
//				Отбор.Вставить("Услуга"     , ВыборкаУслуга.УслугаЖКХ);

//				МассивСтрок = ТабВнесеннаяСумма.НайтиСтроки(Отбор);

//				Если МассивСтрок.Количество() > 0 Тогда
//					
//					Если МассивСтрок[0].Сумма > 0 Тогда
//						НСтр = СписокУслугПоПериоду.Добавить();
//						НСтр.ЛицевойСчет		  = ВыборкаУслуга.ЛицевойСчет;
//						НСтр.Услуга				  = ВыборкаУслуга.УслугаЖКХ;
//						НСтр.ПериодВзаиморасчетов = КонецМесяца(ВыборкаУслуга.Период);
//						НСтр.Сумма				  = Мин(МассивСтрок[0].Сумма, ВыборкаУслуга.СуммаКОплате);
//						
//						// Списываем распределенный остаток.
//						НСтрВнесен = ТабВнесеннаяСумма.Добавить();
//						НСтрВнесен.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
//						НСтрВнесен.Услуга	   = ВыборкаУслуга.УслугаЖКХ;
//						НСтрВнесен.Сумма	   = -Мин(МассивСтрок[0].Сумма, ВыборкаУслуга.СуммаКОплате);
//						
//						ТабВнесеннаяСумма.Свернуть("ЛицевойСчет,Услуга","Сумма");
//					КонецЕсли;
//					
//				КонецЕсли;
//				
//				
//			КонецЦикла; // ВыборкаУслуга.
//			
//			
//		КонецЦикла; // ВыборкаПериод.
//		
//		
//	КонецЦикла; // ВыборкаЛС.
//	
//	// Начисление аванса.
//	Для Каждого Стр Из ТабВнесеннаяСумма Цикл
//		Если Стр.Сумма > 0 Тогда
//			НСтр = СписокУслугПоПериоду.Добавить();
//			НСтр.ЛицевойСчет		  = Стр.ЛицевойСчет;
//			НСтр.Услуга				  = Стр.Услуга;
//			НСтр.ВидНачисления		  = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс;
//			НСтр.Сумма				  = Стр.Сумма;
//		КонецЕсли;
//	КонецЦикла
//	
//КонецПроцедуры

// Процедура выполняет операции связанные с распределением суммы оплаты по услугам.
//
Процедура ВыполнитьРасчет(ТаблицаЛС = Неопределено, ОтборПоТекущейСтроке = Ложь)Экспорт
	
	ОбновитьПараметрыЖКХ();
	
	Если ТаблицаЛС = Неопределено Тогда
		ТаблицаЛС = СписокЛС.Выгрузить();
	КонецЕсли; 
	
	КоммунальныеУслуги = СписокУслуг.ВыгрузитьКолонки();
	
	Если ОплатаПоПериоду И ЗначениеЗаполнено(КонецПериодаОплаты) Тогда
		мДата = КонецПериодаОплаты;
	Иначе
		мДата = Дата;
	КонецЕсли;
	бит_ОбщегоНазначения.РаспределениеСуммПоОплате(мДата,
	Организация,
	ТаблицаЛС,
	КоммунальныеУслуги,
	мЛьготаПерсонифицированная,
	мРасчетСУчетомДолейВладения,
	мУменьшениеНормыЛьготыВПределахФакта,
	мНачислениеСУчетомДнейПроживания,
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
	мНачислятьПениСУчетомПереплаты,
	ОплатаПоПериоду,
	НачалоПериодаОплаты);
	
	СписокУслуг.Очистить();
	СписокУслуг.Загрузить(КоммунальныеУслуги);
	
КонецПроцедуры

// Процедура выполняет заполнение счетов и субконто табличной части.
//
Процедура ЗапролнитьСчета(ТабЛицевыеСчета = Неопределено) Экспорт
	
	Если ТабЛицевыеСчета=Неопределено тогда
		
		тмпСписокЛС = СписокЛС.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки     = СписокЛС.ВыгрузитьКолонки().Колонки;
		
		УдалитКолоку = Колонки.Найти("Услуга");
		
		Колонки.Удалить(УдалитКолоку);
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(СписокЛС, Колонки, тмпСписокЛС, Организация , Дата, ИсточникОплаты, Истина);
		
	Иначе
		
		тмпСписокЛС = ТабЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТабЛицевыеСчета.Колонки;
		
		УдалитКолоку = Колонки.Найти("Услуга");
		
		Колонки.Удалить(УдалитКолоку);
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТабЛицевыеСчета, Колонки, тмпСписокЛС, Организация , Дата, ИсточникОплаты, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

//16.04.2019
// Процедура выполняет операции связанные с распределением суммы оплаты по услугам.
//
Процедура ВыполнитьРасчетСУчетомНачисленийМесяца(ТаблицаЛС = Неопределено, ОтборПоТекущейСтроке = Ложь)Экспорт
	
	ОбновитьПараметрыЖКХ();
	
	Если ТаблицаЛС = Неопределено Тогда
		ТаблицаЛС = СписокЛС.Выгрузить();
	КонецЕсли; 
	
	КоммунальныеУслуги = СписокУслуг.ВыгрузитьКолонки();
	
	Если ОплатаПоПериоду И ЗначениеЗаполнено(КонецПериодаОплаты) Тогда
		мДата = КонецПериодаОплаты;
	Иначе
		мДата = Дата;
	КонецЕсли;
	
    мДата = КонецМесяца(мДата);	
	бит_ОбщегоНазначения.РаспределениеСуммПоОплате(мДата,
	Организация,
	ТаблицаЛС,
	КоммунальныеУслуги,
	мЛьготаПерсонифицированная,
	мРасчетСУчетомДолейВладения,
	мУменьшениеНормыЛьготыВПределахФакта,
	мНачислениеСУчетомДнейПроживания,
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
	мНачислятьПениСУчетомПереплаты,
	ОплатаПоПериоду,
	НачалоПериодаОплаты);
	
	СписокУслуг.Очистить();
	
	//19.04.2019
	Индекс = КоммунальныеУслуги.Количество() - 1; 
	Пока Индекс >= 0 Цикл 
		строкаКоммунальныеУслуги = КоммунальныеУслуги[Индекс];
		Если строкаКоммунальныеУслуги.Сумма = 0 Тогда 
			КоммунальныеУслуги.Удалить(Индекс); 
		конецесли; 
		Индекс = Индекс - 1; 
	КонецЦикла; 

	СписокУслуг.Загрузить(КоммунальныеУслуги);
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

//  Процедура выполняет проверку табличных частей при вводе оплаты вручную.
//
Процедура ПроверкаОплатыВведнойВРучную(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокЛС.ЛицевойСчет,
	|	СписокЛС.ШаблонИзвещений,
	|	СписокЛС.Сумма
	|ПОМЕСТИТЬ ЛицевыеСчета
	|ИЗ
	|	&СписокЛС КАК СписокЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокУслуг.ЛицевойСчет,
	|	СписокУслуг.ШаблонИзвещений,
	|	СписокУслуг.Сумма,
	|	СписокУслуг.СуммаПени
	|ПОМЕСТИТЬ СписокУслуг
	|ИЗ
	|	&СписокУслуг КАК СписокУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчета.ЛицевойСчет,
	|	ЛицевыеСчета.ШаблонИзвещений,
	|	ЕСТЬNULL(ЛицевыеСчета.Сумма, 0) КАК СуммаОплаты,
	|	ЕСТЬNULL(Услуги.Сумма, 0) КАК СуммаРаспределения,
	|	ЕСТЬNULL(Услуги.Пени, 0) КАК Пени
	|ИЗ
	|	ЛицевыеСчета КАК ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СписокУслуг.ЛицевойСчет КАК ЛицевойСчет,
	|			СписокУслуг.ШаблонИзвещений КАК ШаблонИзвещений,
	|			СУММА(СписокУслуг.Сумма) КАК Сумма,
	|			СУММА(СписокУслуг.СуммаПени) КАК Пени
	|		ИЗ
	|			СписокУслуг КАК СписокУслуг
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СписокУслуг.ЛицевойСчет,
	|			СписокУслуг.ШаблонИзвещений) КАК Услуги
	|		ПО ЛицевыеСчета.ЛицевойСчет = Услуги.ЛицевойСчет
	|			И ЛицевыеСчета.ШаблонИзвещений = Услуги.ШаблонИзвещений";
	
	Запрос.УстановитьПараметр("СписокЛС"   , СписокЛС);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	Выборка = Запрос.Выполнить().Выбрать() ;
	
	Текст = "Сумма оплаты не совпадает с распределенной суммой: ";
	
	Пока Выборка.Следующий() Цикл
		
		СуммаОплаты = Выборка.СуммаОплаты;
		СуммаРасп   = Выборка.СуммаРаспределения + Выборка.Пени;
		
		Если СуммаОплаты <> СуммаРасп Тогда
			
			Отказ = Истина;	
			Текст = Текст + "
			|Лицевой счет """+ Выборка.ЛицевойСчет +""", сумма оплаты: " + СуммаОплаты + ", распределенная сумма: " + СуммаРасп;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если Отказ Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	// Заменен вид операции.
	РеквизитыТабСписокУслуг = "ЛицевойСчет,Сумма"; // через запятую.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокЛС", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПараметрыПроведения = Документы.бит_ОплатаКУ.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если ВводВРучную Тогда
		
		ПроверкаОплатыВведнойВРучную(Отказ);
		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		бит_НачисленияЖКХ.СформироватьДвиженияОплатаНачисленияПоУслугамЖКХ(ПараметрыПроведения.Реквизиты.Организация, ПараметрыПроведения.СписокУслуг, ПараметрыПроведения.СписокУслугПоПериоду, ПараметрыПроведения.Реквизиты ,Движения, Отказ);
		бит_НачисленияЖКХ.СформироватьДвиженияОплатаХозрасчетный(ПараметрыПроведения.СписокУслуг,ПараметрыПроведения.СписокЛС,ПараметрыПроведения.Реквизиты,Движения,Отказ);
		бит_НачисленияЖКХ.СформироватьДвиженияПоИсполнительным(СписокЛС,ПараметрыПроведения.Реквизиты,Движения,Отказ); 
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" документа.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//++АнисимоваМВ 1бит восстановление после сбоя 08.11.2024
	УдалитьЛишниеСтрокиСпискаУслуг();
	//--АнисимоваМВ 1бит восстановление после сбоя 08.11.2024
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
	УдалитьПустыеСтроки(); 
	
	
	//+! Гаспирович ВВ. Если не бухсправка и не заполнена таблица распределения по периодам
	Если лб_ВидОплаты <> справочники.лб_ВидыОплат.НайтиПоКоду("000000004") и  СписокУслугПоПериоду.Количество()<>0 тогда 
		СписокУслугПоПериоду.Очистить();
	КонецЕсли;
	
		
КонецПроцедуры
	//++АнисимоваМВ 1бит восстановление после сбоя 08.11.2024
Процедура УдалитьЛишниеСтрокиСпискаУслуг()

	Запрос = Новый Запрос("
	| ВЫБРАТЬ * ПОМЕСТИТЬ СписокУслуг ИЗ &СписокУслуг КАК СписокУслуг;
	| ВЫБРАТЬ * ПОМЕСТИТЬ СписокЛС ИЗ &СписокЛС КАК СписокЛС;
	|ВЫБРАТЬ
	|	бит_ОплатаКУСписокУслуг.НомерСтроки КАК НомерСтроки,
	|	бит_ОплатаКУСписокУслуг.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	СписокУслуг КАК бит_ОплатаКУСписокУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокЛС КАК бит_ОплатаКУСписокЛС
	|		ПО (бит_ОплатаКУСписокУслуг.ЛицевойСчет = бит_ОплатаКУСписокЛС.ЛицевойСчет) 
	|		И  (бит_ОплатаКУСписокУслуг.лб_КлючСтроки = бит_ОплатаКУСписокЛС.лб_КлючСтроки)
	|ГДЕ 
	|	бит_ОплатаКУСписокЛС.НомерСтроки ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("СписокУслуг", ЭтотОбъект.СписокУслуг.Выгрузить());   
	Запрос.УстановитьПараметр("СписокЛС", ЭтотОбъект.СписокЛС.Выгрузить());   
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	МассивСтрок = Новый Массив();
	Пока Выборка.Следующий() Цикл
		МассивСтрок.Добавить(ЭтотОбъект.СписокУслуг[Выборка.НомерСтроки-1]);
	КонецЦикла;   
	Для Каждого Стр Из МассивСтрок Цикл    
		ЭтотОбъект.СписокУслуг.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры
	//--АнисимоваМВ 1бит восстановление после сбоя 08.11.2024

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ВидОперации = Перечисления.бит_ВидыОперацийОплатыКУ.НачислениеОплаты;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли