
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//КонтактнаяИнформацияПолеПочтовыйАдресЗдания = Объект.ПочтовыйАдрес;
	//ПочтовыйАдресЗданияЗапятые = Объект.ПочтовыйАдресЗапятые;
	
	НаборКонтактнойИнформацииНаФорме = РеквизитФормыВЗначение("НаборКонтактнойИнформации");
	
	РазместитьКонтактнуюИнформацию();
	
	ТЗТаблицаРасшифровки = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	
	ТЗТаблицаРасшифровки = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	
	ЗначениеВРеквизитФормы(ТЗТаблицаРасшифровки, "ТаблицаРасшифровки");
	
	ТЗТаблицаРасшифровкиРаспределений = РеквизитФормыВЗначение("ТаблицаРасшифровкиРаспределений");
	
	ТЗТаблицаРасшифровкиРаспределений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	
	ЗначениеВРеквизитФормы(ТЗТаблицаРасшифровкиРаспределений, "ТаблицаРасшифровкиРаспределений");
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Вызов механизма разделения прав доступа.
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ, СтандартнаяОбработка, СправочникОбъект, ЭтаФорма);	
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
	// БИТ_ЖКХ 07.10.2014
	ПолеКИ1           = ПолучитьДанныеИзКонтактнойИнформации("Адрес"                , "ПочтовыйАдресЗдания");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ПочтовыйАдрес) Тогда
		
		КонтактнаяИнформацияПолеПочтовыйАдресЗдания = Объект.ПочтовыйАдрес;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеПочтовыйАдресЗдания = ПолеКИ1;
		
	Иначе
		
		КонтактнаяИнформацияПолеПочтовыйАдресЗдания = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ1 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеПочтовыйАдресЗдания = Строки[0].Представление;
		
	КонецЕсли;	
	// БИТ_ЖКХ 07.10.2014
	
	//// БИТ_ЖКХ 20.10.2014
	//Отбор = Новый Структура();
	//Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания"));
	//
	//Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	//
	//Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ПочтовыйАдресЗапятые) Тогда
	//	
	//	ПочтовыйАдресЗданияЗапятые = Объект.ПочтовыйАдресЗапятые;
	//	
	//ИначеЕсли НЕ Строки.количество() = 0 Тогда
	//	
	//	ПочтовыйАдресЗданияЗапятые = Строки[0].ПредставлениеЗапятые;
	//	
	//КонецЕсли;	
	//// БИТ_ЖКХ 20.10.2014   
	
	// БИТ_ЖКХ 17.06.2016 11:38:49 Начало правки...
	Характеристики.Параметры.УстановитьЗначениеПараметра("ОбъектУчета", Объект.Ссылка);
	//НаборХарактеристик = РеквизитФормыВЗначение("Характеристики");
	//НаборХарактеристик.Отбор.ОбъектУчета.Установить(Объект.Ссылка);
	//НаборХарактеристик.Прочитать();
	//ЗначениеВРеквизитФормы(НаборХарактеристик, "Характеристики");
	// БИТ_ЖКХ 17.06.2016 11:38:49 Конец правки.
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//HD+
	// Для роли HD_ОтделПоРаботеСНаселением_Пользователь форма открывается без права изменения справочника.
	Если НЕ ПолучитьПравоДоступаИзменениеСписокЗданий()
		И НЕ HD_ТребуетсяОграничениеДоступаОтделаПоРаботеСНаселением() Тогда
	//HD-
		
		Отказ = Истина;
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), "Нарушение прав доступа!",10);
		Возврат;
		
	КонецЕсли;
	
	ПриОткрытииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(ДополнительныеПараметры) Экспорт
	
	ПриОткрытииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииФрагмент()
	
	УправлениеПометкамиКнопокКоманднойПанели();
	
	// БИТ_ЖКХ 22.06.2015{{
	Попытка
		Элементы.ИформацияОТСЖ.Видимость = Объект.ИмеетТСЖ;
	Исключение
	КонецПопытки;
	// БИТ_ЖКХ 22.06.2015}}
	
	ЗаполнитьОписания();
	
	Если НЕ ПолучитьПравоДоступаДобавлениеСписокЗданий() Тогда
		
		Элементы.КвартирыКоманднаяПанель.Доступность              = Ложь;
		Элементы.ГрупповыеСчетчикиКоманднаяПанель.Доступность     = Ложь;
		Элементы.ПредоставляемыеУслугиКоманднаяПанель.Доступность = Ложь;		
		Элементы.НежилыеПомещенияКоманднаяПанель.Доступность      = Ложь;
		
	КонецЕсли;
	
	НаДату              = НачалоМесяца(ТекущаяДата());
	СтрокаНачалоПериода = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(НаДату);
	
	ЗаполинтьДопСвойства();	
	УстановитьВидимость();
	
	HD_УстановитьТолькоПросмотрДляОтделаПоРаботеСНаселением();
	
КонецПроцедуры

//HD+
// Устанавливает режим только просмотра для роли HD_ОтделПоРаботеСНаселением_Пользователь.
//
&НаКлиенте
Процедура HD_УстановитьТолькоПросмотрДляОтделаПоРаботеСНаселением()
	
	Если НЕ HD_ТребуетсяОграничениеДоступаОтделаПоРаботеСНаселением() Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Истина;
	
	Для Каждого ЭлементФормы Из Элементы Цикл
		HD_ЗаблокироватьЭлементФормыДляПросмотра(ЭлементФормы);
	КонецЦикла;
	
КонецПроцедуры //HD-

//HD+
// Блокирует редактирование элемента формы, оставляя доступной только команду закрытия.
//
&НаКлиенте
Процедура HD_ЗаблокироватьЭлементФормыДляПросмотра(ЭлементФормы)
	
	ТипЭлемента = ТипЗнч(ЭлементФормы);
	
	Если ТипЭлемента = Тип("ПолеФормы") Тогда
		
		Если ЭлементФормы.Вид <> ВидПоляФормы.ПолеНадписи Тогда
			ЭлементФормы.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипЭлемента = Тип("ТаблицаФормы") Тогда
		
		ЭлементФормы.ТолькоПросмотр = Истина;
		
	ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") Тогда
		
		Если HD_ЭтоРазрешеннаяКомандаТолькоПросмотра(ЭлементФормы.Имя) Тогда
			Возврат;
		КонецЕсли;
		
		ЭлементФормы.Доступность = Ложь;
		
	ИначеЕсли ТипЭлемента = Тип("ГруппаФормы")
		И СтрЗаканчиваетсяНа(ЭлементФормы.Имя, "КоманднаяПанель") Тогда
		
		ЭлементФормы.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры //HD-

//HD+
// Определяет команды, доступные пользователю в режиме только просмотра.
//
&НаКлиенте
Функция HD_ЭтоРазрешеннаяКомандаТолькоПросмотра(ИмяКоманды)
	
	Возврат ИмяКоманды = "ФормаЗакрыть";
	
КонецФункции //HD-

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДляКвартиры" Или 
		ИмяСобытия = "ИзменениеКвартирыДляЛС" Тогда
		
		ЗаполнитьТаблицуКвартир();
		ЗаполнитьТаблицуНежилыхПомещений();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьИнформациюТСЖ" Тогда
		
		ЗначениеПолейТСЖ = Параметр;
		
		ОбновитьТСЖ();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	// БИТ_ЖКХ 24.11.2014{{
	Если ИмяСобытия = "ОбновитьКонтактыКонтролирующийОрган" Тогда
		
		Если ЗначениеЗаполнено(КонтролирующийОрган) Тогда
			
			АдресКО   = бит_ПаспортныйСтолСервер.ПолучитьАдресИзКонтактнойИнформации(КонтролирующийОрган, "Фактический");
			ТелефонКО = бит_ПаспортныйСтолСервер.ПолучитьТелефонИзКонтактнойИнформации(КонтролирующийОрган);
			СайтКО    = бит_ПаспортныйСтолСервер.ПолучитьВебСтраницуИзКонтактнойИнформации(КонтролирующийОрган);
			
		КонецЕсли; 
		
	КонецЕсли;	
	// БИТ_ЖКХ 24.11.2014}}
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//HD+
	Если HD_ТребуетсяОграничениеДоступаОтделаПоРаботеСНаселением() Тогда
		Отказ = Истина;
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Недостаточно прав для изменения здания.");
		Возврат;
	КонецЕсли;
	//HD-
	
	мКэшЗначений.ПочтовыйАдресЗдания = Элементы.КонтактнаяИнформацияПолеПочтовыйАдресЗдания.ТекстРедактирования;
	
	Если НЕ мКэшЗначений.ЭтоНовый И мКэшЗначений.мЛСИзменен Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Изменены ключевые реквизиты! Будут внесены изменения на лицевые счета 
		|закрепленые за зданием.");
			
		мКэшЗначений.Ответ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мКэшЗначений.ЭтоНовый = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	Если мКэшЗначений.Ответ Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛС
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Здание = &Здание";
		
		Запрос.УстановитьПараметр("Здание", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			
			НачатьТранзакцию();
			Попытка
				
				// Блокируем объект от изменения другими сеансами.
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("Справочник.бит_ЛицевыеСчета");
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.ЛС);
				Блокировка.Заблокировать();
				
				ЛицевойСчетОбъект = Выборка.ЛС.ПолучитьОбъект();
				
				// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
				Если ЛицевойСчетОбъект = Неопределено Тогда
					ОтменитьТранзакцию();
					Продолжить;
				КонецЕсли;
				
				ЛицевойСчетОбъект.Организация			= Объект.Организация;
				ЛицевойСчетОбъект.УлицаЛицевогоСчета	= Объект.Улица;
				
				ЛицевойСчетОбъект.Записать();
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ОтменитьТранзакцию();
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обновить информацию на лицевом счете: %1 по причине:
				|%2'
				|Перезапишите элемент вручную."),
				Строка(Выборка.ЛС), ТекстОшибки);
				
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.бит_ЛицевыеСчета, ТекстСообщения);
				
			КонецПопытки;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	НаборЗаписей = РегистрыСведений.бит_ЗначениеСвойствОбъектовУчета.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ОбъектУчета.Установить(Объект.Ссылка, Истина);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого ТекущаяСтрока Из СвойстваЗдания Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ОбъектУчета = Объект.Ссылка;
		НоваяЗапись.ВидСвойства = ТекущаяСтрока.ВидСвойства;
		НоваяЗапись.Значение    = ТекущаяСтрока.Значение;
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СвойстваОбъектовУчета.Ссылка КАК ВидСвойства
	|ИЗ
	|	ПланВидовХарактеристик.бит_СвойстваОбъектовУчета КАК бит_СвойстваОбъектовУчета
	|ГДЕ
	|	бит_СвойстваОбъектовУчета.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//++АнисимоваМВ  1бит исправление ошибки восстановление базы  25.10.2024  
			ИмяПВХ = ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ПолучитьИмяПредопределенного(Выборка.ВидСвойства);
		Если Элементы.Найти(ИмяПВХ) <> Неопределено Тогда  
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.ОбъектУчета = Объект.Ссылка;
			НоваяЗапись.ВидСвойства = Выборка.ВидСвойства;
			НоваяЗапись.Значение    = ЭтаФорма[ИмяПВХ];
		КонецЕсли;
		//НоваяЗапись.Значение    = Значение;  
		//--АнисимоваМВ  1бит исправление ошибки восстановление базы  25.10.2024
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
	Если Объект.ИмеетТСЖ Тогда
		
		ЗаписатьТСЖ();
		
	КонецЕсли;
	
	КэшИмеетТСЖ = Объект.ИмеетТСЖ;
	
	//Объект.ПочтовыйАдрес = мКэшЗначений.ПочтовыйАдресЗдания;	
	//ПочтовыйАдресЗдания = мКэшЗначений.ПочтовыйАдресЗдания;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//HD+
	Если HD_ТребуетсяОграничениеДоступаОтделаПоРаботеСНаселением() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//HD-
	
	ТекущийОбъект.ПочтовыйАдрес = мКэшЗначений.ПочтовыйАдресЗдания;
	
	//ТекущийОбъект.ПочтовыйАдресЗапятые = ПочтовыйАдресЗданияЗапятые;
	//
	//Для Каждого Строка из ТекущийОбъект.КонтактнаяИнформация Цикл
	//	
	//	Если Строка.Вид  = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ПочтовыйАдресЗдания") Тогда
	//		
	//		Строка.ПредставлениеЗапятые = ПочтовыйАдресЗданияЗапятые;
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	//// БИТ_ЖКХ 20.10.2014
	
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
    // БИТ ЖКХ 18.03.2021
	попытка 
	 новоеЗначение = строка(ТекущийОбъект.КонтактнаяИнформация[0].Значение);
	 ОбновитьКонтактнуюИнформациюБит(ЭтотОбъект, новоеЗначение);
	исключение 
	конецпопытки;
КонецПроцедуры

// БИТ ЖКХ 16.03.2021
Процедура ОбновитьКонтактнуюИнформациюБит (ЭтотОбъект, новоеЗначение)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	НаборЗаписей = РегистрыСведений.бит_КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СправочникОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	попытка
		КонтактJSON = новоеЗначение;//СправочникОбъект.КонтактнаяИнформация[0].Значение;
		ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(КонтактJSON, Перечисления.ТипыКонтактнойИнформации.Адрес);
		НаборЗаписей[0].Поле2 = строка(ДанныеАдреса.area + " " + ДанныеАдреса.areaType +".");
		НаборЗаписей[0].Поле6 = строка(ДанныеАдреса.street);   		
		НаборЗаписей[0].Поле4 = строка(ДанныеАдреса.city);
		НаборЗаписей[0].Поле3 = строка(ДанныеАдреса.district);
		НаборЗаписей[0].Поле7 = строка(ДанныеАдреса.houseNumber);
		НаборЗаписей.Записать(истина);
	исключение
	конецпопытки;	
	//|	КонтактнаяИнформация.Поле1 КАК Индекс,
	//|	КонтактнаяИнформация.Поле2 КАК Регион,
	//|	КонтактнаяИнформация.Поле3 КАК Район,
	//|	КонтактнаяИнформация.Поле4 КАК Город,
	//|	КонтактнаяИнформация.Поле5 КАК НасПункт,
	//|	КонтактнаяИнформация.Поле6 КАК Улица,
	//|	КонтактнаяИнформация.Поле7 КАК Дом,
	//|	КонтактнаяИнформация.Поле8 КАК Корпус,
	//|	КонтактнаяИнформация.Поле9 КАК Квартира,
	//|	КонтактнаяИнформация.Поле10 КАК Страна,
	//|	КонтактнаяИнформация.Комментарий,
	//|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	//|	КонтактнаяИнформация.ТипДома,
	//|	КонтактнаяИнформация.ТипКорпуса,
	//|	КонтактнаяИнформация.ТипКвартиры,
  	
КонецПроцедуры	

// БИТ_ЖКХ 07.10.2014
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем переменные формы.
	КэшированныеЗначения.Вставить("мЛСИзменен"                      , Ложь);
	КэшированныеЗначения.Вставить("ЭтоНовый"                        , ?(Параметры.Ключ.Пустая(), Истина, Ложь));
	КэшированныеЗначения.Вставить("Ответ"                           , Ложь);
	КэшированныеЗначения.Вставить("КоличествоКомнат"                , 0);
	КэшированныеЗначения.Вставить("Этаж"                            , 0);
	КэшированныеЗначения.Вставить("КоличествоКомнатНежилыхПомещений", 0);
	КэшированныеЗначения.Вставить("ЭтажНежилыхПомещений"            , 0);
	КэшированныеЗначения.Вставить("ПочтовыйАдресЗдания"             , Неопределено);
	// БИТ_ЖКХ 23.06.2016 16:57:17 Начало правки...
	КэшированныеЗначения.Вставить("Подъезд"							, ПредопределенноеЗначение("Справочник.бит_Подъезды.ПустаяСсылка"));
	КэшированныеЗначения.Вставить("ПодъездНежилыхПомещений"			, ПредопределенноеЗначение("Справочник.бит_Подъезды.ПустаяСсылка"));
	КэшированныеЗначения.Вставить("КадастровыйНомер"				, Неопределено);
	КэшированныеЗначения.Вставить("КадастровыйНомерНежилыхПомещений", Неопределено);
	// БИТ_ЖКХ 23.06.2016 16:57:17 Конец правки.
	// 
	КэшированныеЗначения.Вставить("ПочтовыйАдресЗданияJSON"         , Неопределено);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Управляет пометками кнопок командной панели.
//
&НаКлиенте
Процедура УправлениеПометкамиКнопокКоманднойПанели();
	
	Элементы.КвартирыДобавитьУдалитьГруппуКвартир.Пометка = ПоказыватьДиапазон;	
	Элементы.Группа28.Видимость                           = ?(ПоказыватьДиапазон, Истина, Ложь);
	
КонецПроцедуры

// Процедура заполняет данными закладку "Групповые счетчики".
//
&НаСервере
Процедура ЗаполнитьОписания()
	
	ПараметрыЖКХ = Новый Структура;
	
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(ТекущаяДата()), Объект.Организация, ПараметрыЖКХ);
	
	РасчетДолей = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	
	ТЗГрупповыеСчетчики = РеквизитФормыВЗначение("ГрупповыеСчетчики");
	
	ТЗГрупповыеСчетчики.Очистить();
	
	ТЗТаблицаРасшифровки = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	
	ТЗТаблицаРасшифровки.Очистить();	
	
	ТЗРаспределения = РеквизитФормыВЗначение("Распределения");
	
	ТЗРаспределения.Очистить();	
	
	ТЗТаблицаРасшифровкиРаспределений = РеквизитФормыВЗначение("ТаблицаРасшифровкиРаспределений");
	
	ТЗТаблицаРасшифровкиРаспределений.Очистить();	
	
	СписокЛС = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
	|	И бит_ЛицевыеСчета.Организация = &Организация";
	
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Объект.Улица);
	Запрос.УстановитьПараметр("Здание"            , Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация"       , Объект.Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
	СписокЗданий = Новый Массив;
	
	СписокЗданий.Добавить(Объект.Ссылка);
	
	ТЗТаблицаРасшифровки              = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТЗТаблицаРасшифровкиРаспределений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ТекущаяДата(), Объект.Организация, СписокЛС, СписокЗданий, , , , ТЗТаблицаРасшифровки, ТЗТаблицаРасшифровкиРаспределений, , Истина, , РасчетДолей);
	
	ТаблицаРасшифровки.Загрузить(ТЗТаблицаРасшифровки);
	ТаблицаРасшифровкиРаспределений.Загрузить(ТЗТаблицаРасшифровкиРаспределений);
	
	Запрос.Текст  = 
	"ВЫБРАТЬ
	|	ТаблицаСч.Счетчик,
	|	ТаблицаСч.Услуга,
	|	ТаблицаСч.СпособРасчета,
	|	ТаблицаСч.ОтПоказаний,
	|	ТаблицаСч.ДоПоказаний,
	|	ТаблицаСч.КоличествоЕдиниц,
	|	ТаблицаСч.ПлановаяСтавка,
	|	ТаблицаСч.Начислено
	|ПОМЕСТИТЬ ТабСч
	|ИЗ
	|	&ТаблицаСч КАК ТаблицаСч
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСч.Счетчик КАК Счетчик,
	|	ТабСч.Услуга,
	|	ТабСч.СпособРасчета,
	|	МАКСИМУМ(ТабСч.ОтПоказаний) КАК ОтПоказаний,
	|	МАКСИМУМ(ТабСч.ДоПоказаний) КАК ДоПоказаний,
	|	МАКСИМУМ(ТабСч.КоличествоЕдиниц) КАК КоличествоЕдиниц,
	|	МАКСИМУМ(ТабСч.ПлановаяСтавка) КАК Ставка,
	|	СУММА(ТабСч.Начислено) КАК Начислено
	|ИЗ
	|	ТабСч КАК ТабСч
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабСч.Счетчик,
	|	ТабСч.Услуга,
	|	ТабСч.СпособРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) = 0
	|			ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) = 0
	|					ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
	|				ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ > ВЫБОР
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|					ИНАЧЕ ВЫБОР
	|							КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|				ТОГДА ВЫБОР
	|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|							ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток = 0
	|							ТОГДА 0
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
	|									ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток > 0
	|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
	|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
	|								ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, 0) * бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток,
	|	0,
	|	0
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, Объект = &Объект) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать";
	
	Запрос.УстановитьПараметр("ТаблицаСч", ТЗТаблицаРасшифровки);
	Запрос.УстановитьПараметр("Дата"     , КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Объект"   , Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТЗГрупповыеСчетчики.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	ГрупповыеСчетчики.Загрузить(ТЗГрупповыеСчетчики);
	
	Запрос.Текст  = 
	"ВЫБРАТЬ
	|	ТаблицаРп.Распределение,
	|	ТаблицаРп.Услуга,
	|	ТаблицаРп.СпособРасчета,
	|	ТаблицаРп.КоличествоЕдиниц,
	|	ТаблицаРп.ПлановаяСтавка,
	|	ТаблицаРп.Начислено
	|ПОМЕСТИТЬ ТабРП
	|ИЗ
	|	&ТаблицаРп КАК ТаблицаРп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРП.Распределение ,
	|	ТабРП.Услуга,
	|	ТабРП.СпособРасчета,
	|	МАКСИМУМ(ТабРП.КоличествоЕдиниц) КАК КоличествоЕдиниц,
	|	МАКСИМУМ(ТабРП.ПлановаяСтавка) КАК ПлановаяСтавка,
	|	СУММА(ТабРП.Начислено) КАК Начислено
	|ИЗ
	|	ТабРП КАК ТабРП
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабРП.Распределение,
	|	ТабРП.Услуга,
	|	ТабРП.СпособРасчета";
	
	Запрос.УстановитьПараметр("ТаблицаРп", ТЗТаблицаРасшифровкиРаспределений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТЗРаспределения.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Распределения.Загрузить(ТЗРаспределения);
	
	// Заполнение таблицы "Предоставляемые услуги".	
	ТЗПредоставляемыеУслуги = РеквизитФормыВЗначение("ПредоставляемыеУслуги");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			&Момент,
	|			Здание = &Здание
	|				И Улица = &Улица) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Запрос.УстановитьПараметр("Здание", Объект.Ссылка);
	Запрос.УстановитьПараметр("Улица" , Объект.Улица);
	Запрос.УстановитьПараметр("Момент", ТекущаяДата());
	
	ТЗПредоставляемыеУслуги = Запрос.Выполнить().Выгрузить();
	
	ПредоставляемыеУслуги.Загрузить(ТЗПредоставляемыеУслуги);
	
	Если Объект.ИмеетТСЖ Тогда
		
		ЗаполнитьТСЖ();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.СтрокаНачалоПериода.ТолькоПросмотр = НЕ ИзменятьДатуРедактирования;
	Элементы.СтрокаНачалоПериода.ЦветФона       = ?(ИзменятьДатуРедактирования, ЦветаСтиля.ЦветФонаПоля, ЦветаСтиля.ЦветФонаФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПравоДоступаДобавлениеСписокЗданий()
	
	Возврат ПравоДоступа("Добавление", Метаданные.Справочники.бит_СписокЗданий);
	
КонецФункции

&НаСервере
Функция ПолучитьПравоДоступаИзменениеСписокЗданий()
	
	Возврат ПравоДоступа("Изменение", Метаданные.Справочники.бит_СписокЗданий);
	
КонецФункции

//HD+
// Возвращает Истина, если текущий пользователь относится к роли HD_ОтделПоРаботеСНаселением_Пользователь
// без полных прав и без роли администратора отдела.
//
&НаСервере
Функция HD_ТребуетсяОграничениеДоступаОтделаПоРаботеСНаселением()
	
	ИмяРолиПользователь = "HD_ОтделПоРаботеСНаселением_Пользователь";
	
	Если Метаданные.Роли.Найти(ИмяРолиПользователь) = Неопределено
		ИЛИ НЕ РольДоступна(ИмяРолиПользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяРолиАдминистратор = "HD_ОтделПоРаботеСНаселением_Администратор";
	Если Метаданные.Роли.Найти(ИмяРолиАдминистратор) <> Неопределено
		И РольДоступна(ИмяРолиАдминистратор) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции //HD-

&НаСервере
Функция ЗаписатьОбъектНаСервере()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	Попытка
		
		СправочникОбъект.Записать();
		
		Отказ = Ложь;
		
	Исключение
		
		Отказ = Истина;
		
	КонецПопытки;
	// БИТ_ЖКХ 25.03.2014
	Структура = Новый Структура;
	Попытка
		Структура.Вставить("Ссылка",СправочникОбъект.Ссылка);
	Исключение
		Структура.Вставить("Ссылка",Неопределено);
	КонецПопытки;
	
	Структура.Вставить("Отказ",Отказ);
	
	Возврат Структура;
	// Возврат Отказ;.
	// БИТ_ЖКХ 25.03.2014
	
КонецФункции

&НаСервере
Процедура СоздатьКвартирыНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_Квартиры.Ссылка,
	|	бит_Квартиры.НомерКвартиры
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|ГДЕ
	|	 бит_Квартиры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец",Объект.Ссылка);
	
	форКвартиры = Запрос.Выполнить().Выгрузить();
	
	Для Значение = НачКвартиры По КонКвартиры Цикл
		
		// Проверяем есть ли квартира с таким номером в списке.		
		Если НЕ форКвартиры.Найти(Строка(Значение),"НомерКвартиры") = Неопределено Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Квартира с номером: """ + Строка(Значение) + """ уже есть в списке!");
			
			Продолжить;
			
		Иначе
			
			НовыйЭлемент = Справочники.бит_Квартиры.СоздатьЭлемент();
			
			НовыйЭлемент.Владелец      = Объект.Ссылка;
			НовыйЭлемент.НомерКвартиры = Значение;
			НовыйЭлемент.Наименование  = Строка(Значение);
			
			СоздатьЗапись = Истина;
			
			Попытка
				
				НовыйЭлемент.Записать();
				
			Исключение
				
				СоздатьЗапись = Ложь;
				
			КонецПопытки;
			
			Если СоздатьЗапись Тогда
				
				НовыйНабор = РегистрыСведений.бит_СведенияОКвартире.СоздатьНаборЗаписей();
				
				НовыйНабор.Отбор.Квартира.Установить(НовыйЭлемент.Ссылка);
				
				НовыйНабор.Прочитать();
				
				НоваяЗапись = НовыйНабор.Добавить();
				
				НоваяЗапись.Период         = НаДату;
				НоваяЗапись.Квартира       = НовыйЭлемент.Ссылка;
				НоваяЗапись.СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Приватизированная;
				НоваяЗапись.ТипКвартиры    = Справочники.бит_ТипыКвартиры.Отдельная;
				
				Попытка
					
					НовыйНабор.Записать();
					
				Исключение
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКвартирыНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_Квартиры.Ссылка,
	|	бит_Квартиры.НомерКвартиры
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|ГДЕ
	|	 бит_Квартиры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	форКвартиры = Запрос.Выполнить().Выгрузить();
	
	Для Значение = НачКвартиры По КонКвартиры Цикл
		
		СтрокаУдаления = форКвартиры.Найти(Значение,"НомерКвартиры");
		
		Если СтрокаУдаления <> Неопределено Тогда
			
			ПолОбъект = СтрокаУдаления.Ссылка.ПолучитьОбъект();
			
			ПолОбъект.ПометкаУдаления = Истина;
			
			Попытка
				
				ПолОбъект.Записать();
				
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуРасшифровкиВХранилище()
	
	ПараметрыЖКХ = Новый Структура;
	
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(ТекущаяДата()), Объект.Организация, ПараметрыЖКХ);
	
	РасчетДолей = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	
	ТЗТаблицаРасшифровки = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	
	ТЗТаблицаРасшифровки.Очистить();
	
	СписокЛС = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
	|	И бит_ЛицевыеСчета.Организация = &Организация";
	
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Объект.Улица);
	Запрос.УстановитьПараметр("Здание"            , Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация"       , Объект.Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
	СписокЗданий = Новый Массив;
	
	СписокЗданий.Добавить(Объект.Ссылка);
	
	ТЗТаблицаРасшифровки              = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ТекущаяДата(), Объект.Организация, СписокЛС, СписокЗданий, , , , ТЗТаблицаРасшифровки, , , Истина, , РасчетДолей);
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТЗТаблицаРасшифровки, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуРасшифровкиРаспределенийВХранилище()
	
	ПараметрыЖКХ = Новый Структура;
	
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(ТекущаяДата()), Объект.Организация, ПараметрыЖКХ);
	
	РасчетДолей = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	
	ТЗТаблицаРасшифровки = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	
	ТЗТаблицаРасшифровки.Очистить();
	
	СписокЛС = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
	|	И бит_ЛицевыеСчета.Организация = &Организация";
	
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Объект.Улица);
	Запрос.УстановитьПараметр("Здание"            , Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация"       , Объект.Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
	СписокЗданий = Новый Массив;
	
	СписокЗданий.Добавить(Объект.Ссылка);
	
	ТЗТаблицаРасшифровкиРаспределений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ТекущаяДата(), Объект.Организация, СписокЛС, СписокЗданий, , , , , ТЗТаблицаРасшифровкиРаспределений, , Истина, , РасчетДолей);
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТЗТаблицаРасшифровкиРаспределений, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

&НаСервере
Процедура ЗаполинтьДопСвойства()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОбъектУчета", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства,
	|	бит_ЗначениеСвойствОбъектовУчета.Значение
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета = &ОбъектУчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидСвойства.Предопределенный Тогда
			
			ИмяПВХ = ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.ПолучитьИмяПредопределенного(Выборка.ВидСвойства);
			//
			Если Элементы.Найти(ИмяПВХ) <> Неопределено Тогда  
				
				ЭтаФорма[ИмяПВХ] = Выборка.Значение;
			КонецЕсли;
		Иначе
			
			НоваяСтрока = СвойстваЗдания.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура ОбновитьСтруктуруПолейТСЖ()
	
	ЗначениеПолейТСЖ = Новый Структура;
	
	ЗначениеПолейТСЖ.Вставить("ТСЖ"                , Неопределено);
	ЗначениеПолейТСЖ.Вставить("ДатаСоздания"       , Дата("00010101"));
	ЗначениеПолейТСЖ.Вставить("Председатель"       , Справочники.бит_Проживающие.ПустаяСсылка());
	ЗначениеПолейТСЖ.Вставить("КонтролирующийОрган", Справочники.бит_ОрганыФМС.ПустаяСсылка());
	
	ЗначениеПолейТСЖ.Вставить("Период", Дата("00010101"));
	
КонецПроцедуры // ()

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура ЗаполнитьТСЖ()
	
	ОбновитьСтруктуруПолейТСЖ();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Здание", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ,
	|	бит_ИнформацияТСЖСрезПоследних.ДатаСоздания КАК ДатаСоздания,
	|	бит_ИнформацияТСЖСрезПоследних.Председатель,
	|	бит_ИнформацияТСЖСрезПоследних.КонтролирующийОрган,
	|	бит_ИнформацияТСЖСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&период, Здание = &Здание) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания УБЫВ";
	
	Результат  = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	ЗначениеПолейТСЖ.ТСЖ                 = Выборка.ТСЖ;
	ЗначениеПолейТСЖ.ДатаСоздания        = Выборка.ДатаСоздания;
	ЗначениеПолейТСЖ.Председатель        = Выборка.Председатель;
	ЗначениеПолейТСЖ.КонтролирующийОрган = Выборка.КонтролирующийОрган;
	ЗначениеПолейТСЖ.Период              = Выборка.Период;
	
	ДатаСозданияПриОткрытии        = Выборка.ДатаСоздания; 
	ТСЖПриОткрытии                 = Выборка.ТСЖ; 
	ПредседательПриОткрытии        = Выборка.Председатель; 
	КонтролирующийОрганПриОткрытии = Выборка.КонтролирующийОрган; 
	ПериодПриОткрытии              = Выборка.Период; 
	
	ОбновитьТСЖ();
	
КонецПроцедуры // ()

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура ОбновитьТСЖ()
	
	ТСЖ                 = Неопределено;
	Председатель        = Неопределено;
	ДатаСоздания        = Неопределено;
	КонтролирующийОрган = Неопределено;
	Период              = Неопределено;
	
	АдресТСЖ   = "";
	ТелефонТСЖ = "";
	АдресКО    = "";
	ТелефонКО  = "";
	СайтКО     = "";
	
	ТСЖ                 = ЗначениеПолейТСЖ.ТСЖ;
	Председатель        = ЗначениеПолейТСЖ.Председатель;
	ДатаСоздания        = ЗначениеПолейТСЖ.ДатаСоздания;
	КонтролирующийОрган = ЗначениеПолейТСЖ.КонтролирующийОрган;
	Период              = ЗначениеПолейТСЖ.Период;
	
	Если ЗначениеЗаполнено(ТСЖ) Тогда
		
		АдресТСЖ   = бит_УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(ТСЖ, "Фактический");
		ТелефонТСЖ = бит_УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(ТСЖ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтролирующийОрган) Тогда
		
		АдресКО   = бит_ПаспортныйСтолСервер.ПолучитьАдресИзКонтактнойИнформации(КонтролирующийОрган, "Фактический");
		ТелефонКО = бит_ПаспортныйСтолСервер.ПолучитьТелефонИзКонтактнойИнформации(КонтролирующийОрган);
		СайтКО    = бит_ПаспортныйСтолСервер.ПолучитьВебСтраницуИзКонтактнойИнформации(КонтролирующийОрган);
		
	КонецЕсли; 
	
КонецПроцедуры // ()

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура ЗаписатьТСЖ(ЗакрытиеТСЖ = Ложь)
	
	Если НЕ ЗначениеЗаполнено(ТСЖ) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Отказ = Истина;
	
	Если (НЕ ТСЖ = ТСЖПриОткрытии
		ИЛИ  НЕ ДатаСоздания = ДатаСозданияПриОткрытии 
		ИЛИ  НЕ Председатель = ПредседательПриОткрытии 
		ИЛИ  НЕ КонтролирующийОрган = КонтролирующийОрганПриОткрытии
		
		ИЛИ  НЕ Период = ПериодПриОткрытии) ИЛИ ЗакрытиеТСЖ Тогда
		
		Отказ = Ложь;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Здание", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ,
	|	бит_ИнформацияТСЖСрезПоследних.ДатаСоздания КАК ДатаСоздания,
	|	бит_ИнформацияТСЖСрезПоследних.Председатель,
	|	бит_ИнформацияТСЖСрезПоследних.КонтролирующийОрган,
	|	бит_ИнформацияТСЖСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&период, Здание = &Здание) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	ЗаписьТСЖ = РегистрыСведений.бит_ИнформацияТСЖ.СоздатьМенеджерЗаписи();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЗаписьТСЖ, Выборка);
		
	Иначе
		
		ЗаписьТСЖ.Период = Период;
		ЗаписьТСЖ.Здание = Объект.Ссылка;
		
	КонецЕсли; 
	
	ЗаписьТСЖ.ТСЖ                 = ТСЖ;
	ЗаписьТСЖ.ДатаСоздания        = ДатаСоздания;
	ЗаписьТСЖ.КонтролирующийОрган = КонтролирующийОрган;
	ЗаписьТСЖ.Председатель        = Председатель;
	
	Если ЗакрытиеТСЖ Тогда
		
		ЗаписьТСЖ.ДатаЗакрытия = ТекущаяДата();
		
	КонецЕсли; 
	
	Попытка
		
		ЗаписьТСЖ.Записать(Истина);
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Неудалось записать информацию о ТСЖ.");
		
	КонецПопытки; 
	
КонецПроцедуры // ()

&НаСервере
Процедура ЗаполнитьТаблицуКвартир()
	
	Квартиры.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_Квартиры.Ссылка КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП КАК МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства КАК ТипЗапирающегоУстройства,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилоеПомещениеСпециализированногоЖилищногоФонда КАК ЖилоеПомещениеСпециализированногоЖилищногоФонда,
	|	бит_СведенияОКвартиреСрезПоследних.ПлощадьОДНСОИЭлектроснаб КАК ПлощадьОДНСОИЭлектроснаб,
	|	бит_СведенияОКвартиреСрезПоследних.ПлощадьОДНСОИВодоснаб КАК ПлощадьОДНСОИВодоснаб,
	|	бит_Квартиры.Наименование КАК Наименование,
	|	бит_Квартиры.Этаж КАК Этаж,
	|	бит_Квартиры.КоличествоКомнат КАК КоличествоКомнат,
	|	бит_Квартиры.НомерКвартиры КАК НомерКвартиры,
	|	бит_Квартиры.ПрефиксКвартиры КАК ПрефиксКвартиры,
	|	ВЫБОР
	|		КОГДА бит_Квартиры.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерКартинки,
	|	бит_Квартиры.Ссылка КАК Ссылка,
	|	бит_Квартиры.Подъезд КАК Подъезд,
	|	бит_Квартиры.КадастровыйНомер КАК КадастровыйНомер,
	|	бит_СведенияОКвартиреСрезПоследних.ВысотаПотолков КАК ВысотаПотолков
	|ПОМЕСТИТЬ Квартиры
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, Квартира.Владелец = &Владелец) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО (бит_СведенияОКвартиреСрезПоследних.Квартира = бит_Квартиры.Ссылка)
	|ГДЕ
	|	бит_Квартиры.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Квартиры.Квартира КАК Квартира,
	|	Квартиры.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	Квартиры.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	Квартиры.МОП КАК МОП,
	|	Квартиры.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	Квартиры.СовокупнаяПлощадь КАК СовокупнаяПлощадь,
	|	Квартиры.ТипКвартиры КАК ТипКвартиры,
	|	Квартиры.СтатусКвартиры КАК СтатусКвартиры,
	|	Квартиры.ТипПлиты КАК ТипПлиты,
	|	Квартиры.ТипЗапирающегоУстройства КАК ТипЗапирающегоУстройства,
	|	Квартиры.ЖилоеПомещениеСпециализированногоЖилищногоФонда КАК ЖилоеПомещениеСпециализированногоЖилищногоФонда,
	|	Квартиры.ПлощадьОДНСОИЭлектроснаб КАК ПлощадьОДНСОИЭлектроснаб,
	|	Квартиры.ПлощадьОДНСОИВодоснаб КАК ПлощадьОДНСОИВодоснаб,
	|	Квартиры.Наименование КАК Наименование,
	|	Квартиры.Этаж КАК Этаж,
	|	Квартиры.КоличествоКомнат КАК КоличествоКомнат,
	|	Квартиры.НомерКвартиры КАК НомерКвартиры,
	|	Квартиры.ПрефиксКвартиры КАК ПрефиксКвартиры,
	|	Квартиры.НомерКартинки КАК НомерКартинки,
	|	Квартиры.Ссылка КАК Ссылка,
	|	Квартиры.Подъезд КАК Подъезд,
	|	Квартиры.КадастровыйНомер КАК КадастровыйНомер,
	|	Квартиры.ВысотаПотолков КАК ВысотаПотолков
	|ИЗ
	|	Квартиры КАК Квартиры
	|ГДЕ
	|	Квартиры.ТипКвартиры <> ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.НежилоеПомещение)";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент"  , НаДату);
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаписей.Количество() > 0 Тогда 
		
		Квартиры.Загрузить(ТаблицаЗаписей);
		
	КонецЕсли;
	
	Квартиры.Сортировать("НомерКвартиры Возр, ПрефиксКвартиры Возр");
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьКоличествоКомнатНаСервере(Знач Ссылка, Знач КоличествоКомнат)
	
	ОбъектКвартиры = Ссылка.ПолучитьОбъект();
	
	ОбъектКвартиры.КоличествоКомнат = КоличествоКомнат;
	
	Попытка
		
		ОбъектКвартиры.Записать();
		
		Возврат Истина;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

// БИТ_ЖКХ 23.06.2016 17:04:55 Начало правки...
&НаСервере
Функция ИзменитьНомерПодъездаНаСервере(Знач Ссылка, Знач Подъезд)
	
	ОбъектКвартиры = Ссылка.ПолучитьОбъект();
	ОбъектКвартиры.Подъезд = Подъезд;
	
	Попытка
		ОбъектКвартиры.Записать();
		Возврат Истина;
	Исключение
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
// БИТ_ЖКХ 23.06.2016 17:04:55 Конец правки.

// БИТ_ЖКХ 29.06.2016 15:36:22 Начало правки...
&НаСервере
Функция ИзменитьКадастровыйНомерНаСервере(Знач Ссылка, Знач КадастровыйНомер)
	
	ОбъектКвартиры = Ссылка.ПолучитьОбъект();
	ОбъектКвартиры.КадастровыйНомер = КадастровыйНомер;
	
	Попытка
		ОбъектКвартиры.Записать();
		Возврат Истина;
	Исключение
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
// БИТ_ЖКХ 29.06.2016 15:36:22 Конец правки.

&НаСервере
Функция ИзменитьЭтажНаСервере(Знач Ссылка, Знач Этаж)
	
	ОбъектКвартиры = Ссылка.ПолучитьОбъект();
	
	ОбъектКвартиры.Этаж = Этаж;
	
	Попытка
		
		ОбъектКвартиры.Записать();
		
		Возврат Истина;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПометитьКвартируНаУдалениеНаСервере(Знач Ссылка)
	
	ОбъектКвартиры = Ссылка.ПолучитьОбъект();
	
	ОбъектКвартиры.ПометкаУдаления = Истина;
	
	Попытка
		
		ОбъектКвартиры.Записать();
		
		Возврат Истина;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция СнятьКвартируСПометкиНаУдалениеНаСервере(Знач Ссылка)
	
	ОбъектКвартиры = Ссылка.ПолучитьОбъект();
	
	ОбъектКвартиры.ПометкаУдаления = Ложь;
	
	Попытка
		
		ОбъектКвартиры.Записать();
		
		Возврат Истина;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНежилыхПомещений()
	
	НежилыеПомещения.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_Квартиры.Ссылка КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилоеПомещениеСпециализированногоЖилищногоФонда,
	|	бит_СведенияОКвартиреСрезПоследних.ПлощадьОДНСОИЭлектроснаб,
	|	бит_СведенияОКвартиреСрезПоследних.ПлощадьОДНСОИВодоснаб,
	|	бит_Квартиры.Наименование КАК Наименование,
	|	бит_Квартиры.Этаж КАК Этаж,
	|	бит_Квартиры.КоличествоКомнат КАК КоличествоКомнат,
	|	бит_Квартиры.НомерКвартиры КАК НомерКвартиры,
	|	бит_Квартиры.ПрефиксКвартиры КАК ПрефиксКвартиры,
	|	ВЫБОР
	|		КОГДА бит_Квартиры.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерКартинки,
	|	бит_Квартиры.Ссылка КАК Ссылка,
	//|	бит_Квартиры.НомерПодъезда,
	|	бит_Квартиры.Подъезд,
	|	бит_Квартиры.КадастровыйНомер
	|ПОМЕСТИТЬ Квартиры
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, Квартира.Владелец = &Владелец) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО (бит_СведенияОКвартиреСрезПоследних.Квартира = бит_Квартиры.Ссылка)
	|ГДЕ
	|	бит_Квартиры.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Квартиры.Квартира,
	|	Квартиры.ОбщаяПлощадь,
	|	Квартиры.ЖилаяПлощадь,
	|	Квартиры.МОП,
	|	Квартиры.ОтапливаемаяПлощадь,
	|	Квартиры.СовокупнаяПлощадь,
	|	Квартиры.ТипКвартиры,
	|	Квартиры.СтатусКвартиры,
	|	Квартиры.ТипПлиты,
	|	Квартиры.ТипЗапирающегоУстройства,
	|	Квартиры.ЖилоеПомещениеСпециализированногоЖилищногоФонда,
	|	Квартиры.ПлощадьОДНСОИЭлектроснаб,
	|	Квартиры.ПлощадьОДНСОИВодоснаб,
	|	Квартиры.Наименование,
	|	Квартиры.Этаж,
	|	Квартиры.КоличествоКомнат,
	|	Квартиры.НомерКвартиры,
	|	Квартиры.ПрефиксКвартиры,
	|	Квартиры.НомерКартинки,
	|	Квартиры.Ссылка,
	//|	Квартиры.НомерПодъезда,
	|	Квартиры.Подъезд,
	|	Квартиры.КадастровыйНомер
	|ИЗ
	|	Квартиры КАК Квартиры
	|ГДЕ
	|	Квартиры.ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.НежилоеПомещение)";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент"  , НаДату);
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаписей.Количество() > 0 Тогда 
		
		НежилыеПомещения.Загрузить(ТаблицаЗаписей);
		
	КонецЕсли;
	
	НежилыеПомещения.Сортировать("НомерКвартиры Возр, ПрефиксКвартиры Возр");
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДанныеОКвариреНаСервере(Знач Квартира, Знач НаДату, Знач Элемент, Знач Значение)
	
	Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	
	бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, Элемент, Значение);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	
	ЗаполнитьОписания();
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКвартиры(Команда)
	
	ЗаполнитьТаблицуКвартир();
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыРегистрСведенийбит_СведенияОКвартиреОткрытьПоЗначениюКвартира(Команда)
	
	// БИТ_ЖКХ 05.06.2014
	ТекущиеДанныеНежилыеПомещения = Элементы.НежилыеПомещения.ТекущиеДанные;
	ТекущиеДанныеКвартиры         = Элементы.Квартиры.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Если Элементы.Группа19.ТекущаяСтраница.Заголовок = "Паркинг/нежилые помещения" Тогда
		Попытка
			Отбор.Вставить("Квартира", ТекущиеДанныеНежилыеПомещения.Ссылка);
		Исключение
			Возврат
		КонецПопытки;
		
	КонецЕсли;
	Если Элементы.Группа19.ТекущаяСтраница.Заголовок = "Квартиры" Тогда
		Попытка
			Отбор.Вставить("Квартира", ТекущиеДанныеКвартиры.Ссылка);
		Исключение
			Возврат
		КонецПопытки;
		
	КонецЕсли;
	// БИТ_ЖКХ 05.06.2014
	
	ОткрытьФорму("РегистрСведений.бит_СведенияОКвартире.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУдалитьГруппуКвартир(Команда)
	
	ПоказыватьДиапазон = Не ПоказыватьДиапазон;
	
	УправлениеПометкамиКнопокКоманднойПанели();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Отказ = Ложь;
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьЗавершение", ЭтотОбъект), "Элемент еще не записан. Записать?", РежимДиалогаВопрос.ОКОтмена);
		Возврат;
		
	КонецЕсли;
	
	ДобавитьФрагмент(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		
		// БИТ_ЖКХ 25.03.2014
		// Отказ = ЗаписатьОбъектНаСервере();.
		Структура = ЗаписатьОбъектНаСервере();
		Отказ = Структура.Отказ;
		// БИТ_ЖКХ 25.03.2014
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
	
	ДобавитьФрагмент(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФрагмент(Знач Отказ)
	
	Если Не Отказ Тогда
		
		СоздатьКвартирыНаСервере();
		
	КонецЕсли;
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	УдалитьКвартирыНаСервере();
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвойстваКвартир(Команда)
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед заполнением свойств выполните запись.");
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ДатаСведений", НаДату);
	ПараметрыФормы.Вставить("Здание"      , Объект.Ссылка);
	
	ОткрытьФорму("Обработка.бит_ЗаполнениеСведенийПоКвартирам.Форма.ФормаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНежилыеПомещения(Команда)
	
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыРегистрСведенийбит_СведенияОКвартиреОткрытьПоЗначениюНежилоеПомещение(Команда)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Квартира", ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("РегистрСведений.бит_СведенияОКвартире.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетчик(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации"   , ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика"));
	ПараметрыФормы.Вставить("Организация"   , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"          , ТекущаяДата());
	ПараметрыФормы.Вставить("ТекущийЭлемент", "Счетчик");
	
	ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочника", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить_Удалить_лс_на_счетчик(Команда)
	
	ТекущаяСтрока = Элементы.ГрупповыеСчетчики.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЛицевыеСчетаНаСчетчик"));
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ПараметрыФормы.Вставить("Счетчик", ТекущаяСтрока.Счетчик);
		
	КонецЕсли;
	
	ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочника", ПараметрыФормы));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеУслугКЗданиям(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Здание", Объект.Ссылка);
	ПараметрыФормы.Вставить("Улица" , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ВыборВидаОперацииДокумента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУслугуНаЛС(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета"));
	ПараметрыФормы.Вставить("Здание"     , Объект.Ссылка);
	ПараметрыФормы.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Документ.бит_УстановкаИзменениеУслугПоЛС.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаСписокЗданий", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТСЖ(Команда)
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаРедактированиеИнформацииТСЖ", Новый Структура("ЗначенияПолей", ЗначениеПолейТСЖ), Этаформа);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТСЖ(Команда)
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗакрытьТСЖЗавершение", ЭтотОбъект), "ТСЖ будет ликвидировано. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТСЖЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ЗаписатьТСЖ(Истина);
	
	ОбновитьСтруктуруПолейТСЖ();
	
	ОбновитьТСЖ();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	мКэшЗначений.мЛСИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	Объект.Участок = Неопределено;
	
КонецПроцедуры

// БИТ_ЖКХ 24.03.2017 10:33:44 Начало правки... 
//&НаКлиенте
//Процедура УчастокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	Отбор = Новый Структура;
//	
//	Отбор.Вставить("Владелец", Объект.Район);
//	
//	ОткрытьФорму("Справочник.бит_ТехническиеУчастки.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УчастокОткрытие(Элемент, СтандартнаяОбработка)
//	
//	Если НЕ Объект.Район = Неопределено Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		Отбор = Новый Структура;
//		
//		Отбор.Вставить("Владелец", Объект.Район);
//		
//		ОткрытьФорму("Справочник.бит_ТехническиеУчастки.Форма.ФормаВыбораУправляемая", Отбор, Элемент);
//		
//	КонецЕсли;
//	
//КонецПроцедуры
// БИТ_ЖКХ 24.03.2017 10:33:46 Конец правки. 

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	мКэшЗначений.мЛСИзменен = Истина;
	
КонецПроцедуры

// БИТ_ЖКХ 09.09.2014
&НаКлиенте
Процедура СтрокаНачалоПериодаПриИзменении(Элемент)
	
	СтрокаНачалоПериода = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), 
	НачалоМесяца(НаДату), 
	КонецМесяца(НаДату));
	
	НаДату = НачалоМесяца(НаДату);	
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры
// БИТ_ЖКХ 09.09.2014

&НаКлиенте
Процедура СтрокаНачалоПериодаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ПериодРегистрации = бит_РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрацииФункция(СтрокаНачалоПериода, СтандартнаяОбработка, НаДату, ЭтаФорма);
	
	НаДату = ПериодРегистрации;
	
	СтрокаНачалоПериода = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(НаДату);
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаНачалоПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	НаДату = ДобавитьМесяц(НаДату, Направление);
	
	СтрокаНачалоПериода = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(НаДату);
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаНачалоПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаНачалоПериодаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	бит_РаботаСДиалогами.ДатаКакМесяцАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьДатуРедактированияПриИзменении(Элемент)
	
	УстановитьВидимость();
	
	Если НЕ ИзменятьДатуРедактирования Тогда
		
		НаДату               = ТекущаяДата();
		СтрокаНачалоПериода  = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(НаДату);
		
		ЗаполнитьТаблицуКвартир();
		ЗаполнитьТаблицуНежилыхПомещений();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмеетТСЖПриИзменении(Элемент)
	
	Элементы.ИформацияОТСЖ.Видимость = Объект.ИмеетТСЖ;
	
	Если Объект.ИмеетТСЖ Тогда
		
		ЗаполнитьТСЖ();
		
	КонецЕсли;
	
	КэшИмеетТСЖ = Объект.ИмеетТСЖ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПаспортнаяСлужбаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.бит_ОрганыФМС.Форма.ФормаВыбора", , Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭтажейПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПодъездовПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПлощадьЖилогоЗданияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПлощадьМестОбщегоПользованияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПлощадьНежилыхПомещенийПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПлощадьПридомовойТерриторииПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПлощадьГрунтаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьПринадлежащаяЧленамТСЖПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПочтовыйАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	// БИТ_ЖКХ 25.02.2015
//	бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура ПочтовыйАдресПриИзменении(Элемент)
//	
//	Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент);
//	
//КонецПроцедуры

&НаКлиенте
Процедура СтрокаНачалоПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// БИТ_ЖКХ 28.08.2015 13:52:28 Начало правки... 	
	//ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(НаДату), КонецМесяца(НаДату));
	ПараметрыОтбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(НаДату), КонецМесяца(НаДату));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыОтбора, Элементы.СтрокаНачалоПериода, , , , ОписаниеОповещения);
	//ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, Элементы.СтрокаНачалоПериода, , , , ОписаниеОповещения);
	// БИТ_ЖКХ 28.08.2015 13:52:33 Конец правки. 
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаНачалоПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// БИТ_ЖКХ 30.05.2016 16:53:35 Начало правки... 
&НаКлиенте
Процедура БанковскийСчетКапРемонтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКапРемонт) Тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораТипаВладельца", ЭтаФорма);
		СписокВладельцевБС = Новый СписокЗначений;
		СписокВладельцевБС.Добавить("Контрагент",  "Контрагент"); 
		СписокВладельцевБС.Добавить("Организация", "Организация"); 
		//СписокВладельцевБС.ПоказатьВыборЭлемента(Оповещение, "Выбор справочника владелеца."); 
		// БИТ ЖКХ 23.03.2020
   	    ПоказатьВыборИзСписка(Оповещение, СписокВладельцевБС);

	Иначе
		ВладелецСчета = ЗначениеРеквизитаНаСервере(Объект.БанковскийСчетКапРемонт, "Владелец");
		ПараметрыОтбора = Новый Структура("Владелец", ВладелецСчета);
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", Новый Структура("Отбор", ПараметрыОтбора),ЭтаФорма,,,, Новый ОписаниеОповещения("ЗавершениеВыбораБанковскогоСчета", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораТипаВладельца(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран владелец банковского счета.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбранныйЭлемент.Значение;
	
	Если ВыбранноеЗначение = "Контрагент" Тогда
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",,ЭтаФорма,,,, Новый ОписаниеОповещения("ЗавершениеВыбораВладельца", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли ВыбранноеЗначение = "Организация" Тогда
		ОткрытьФорму("Справочник.Организации.ФормаВыбора",,ЭтаФорма,,,, Новый ОписаниеОповещения("ЗавершениеВыбораВладельца", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораВладельца(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйЭлемент) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран владелец банковского счета.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Владелец", ВыбранныйЭлемент);
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", Новый Структура("Отбор", ПараметрыОтбора),ЭтаФорма,,,, Новый ОписаниеОповещения("ЗавершениеВыбораБанковскогоСчета", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораБанковскогоСчета(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйЭлемент) Тогда
		Объект.БанковскийСчетКапРемонт = ВыбранныйЭлемент;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Ссылка,Реквизит)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);	
	
КонецФункции
// БИТ_ЖКХ 30.05.2016 16:53:37 Конец правки.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляКвартиры

&НаКлиенте
Процедура КвартирыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		мКэшЗначений.КоличествоКомнат = ТекущиеДанные.КоличествоКомнат;
		мКэшЗначений.Этаж             = ТекущиеДанные.Этаж;
		// БИТ_ЖКХ 23.06.2016 17:09:31 Начало правки...
		мКэшЗначений.Подъезд		  = ТекущиеДанные.Подъезд;
		// БИТ_ЖКХ 23.06.2016 17:09:31 Конец правки.
		// БИТ_ЖКХ 29.06.2016 15:38:00 Начало правки...
		мКэшЗначений.КадастровыйНомер = ТекущиеДанные.КадастровыйНомер;
		// БИТ_ЖКХ 29.06.2016 15:38:00 Конец правки.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Ложь;
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала необходимо записать элемент!");
		
		Отказ = Истина;
		
		Возврат;
			
	КонецЕсли;
	
	ПараметрыФормы     = Новый Структура;
	ЗначенияЗаполнения = Новый Структура;
	
	Если Копирование Тогда
		
		ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
		
		ЗначенияЗаполнения.Вставить("Этаж"            , ТекущиеДанные.Этаж);
		ЗначенияЗаполнения.Вставить("КоличествоКомнат", ТекущиеДанные.КоличествоКомнат);
		ЗначенияЗаполнения.Вставить("НомерКвартиры"   , ТекущиеДанные.НомерКвартиры);
		ЗначенияЗаполнения.Вставить("ПрефиксКвартиры" , ТекущиеДанные.ПрефиксКвартиры);
		
		// БИТ_ЖКХ 02.04.2014
		КодПоБТИ = ПолучитьКодПоБТИНаСервере(ТекущиеДанные.Ссылка);
		
		//ЗначенияЗаполнения.Вставить("КодПоБТИ"        , ТекущиеДанные.Ссылка.КодПоБТИ);
		ЗначенияЗаполнения.Вставить("КодПоБТИ"        , КодПоБТИ);
		// БИТ_ЖКХ 02.04.2014
		
		// БИТ_ЖКХ 23.06.2016 17:10:05 Начало правки...
		ЗначенияЗаполнения.Вставить("Подъезд"		  , ТекущиеДанные.Подъезд);
		// БИТ_ЖКХ 23.06.2016 17:10:05 Конец правки.
		
		// БИТ_ЖКХ 29.06.2016 15:38:48 Начало правки...
		ЗначенияЗаполнения.Вставить("КадастровыйНомер"   , ТекущиеДанные.КадастровыйНомер);
		// БИТ_ЖКХ 29.06.2016 15:38:48 Конец правки.
	КонецЕсли;
	
	ЗначенияЗаполнения.Вставить("Владелец", Объект.Ссылка);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);		
	ПараметрыФормы.Вставить("НаДату"            , НаДату);
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаЭлементаУправляемая", ПараметрыФормы, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Если ТекущиеДанные.НомерКартинки = 1 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КвартирыПередУдалениемЗавершение1", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Пометить элемент на удаление?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КвартирыПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("Ответ, ТекущиеДанные", Ответ, ТекущиеДанные)), "Снять с элемента пометку на удаление?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыПередУдалениемЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = ПометитьКвартируНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 2;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = ДополнительныеПараметры.Ответ;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = СнятьКвартируСПометкиНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// БИТ_ЖКХ 04.02.2014
	//ЗаполнитьТаблицуКвартир();
	// БИТ_ЖКХ 04.02.2014
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	Элементы.Квартиры.Доступность = Ложь;
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаЭлементаУправляемая", Новый Структура("Ключ", Квартира), Элемент);
	
	Элементы.Квартиры.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыКоличествоКомнатПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Результат = ИзменитьКоличествоКомнатНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.КоличествоКомнат);
	
	Если Результат Тогда
		
		мКэшЗначений.КоличествоКомнат = ТекущиеДанные.КоличествоКомнат;
		
	Иначе
		
		ТекущиеДанные.КоличествоКомнат = мКэшЗначений.КоличествоКомнат;
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 23.06.2016 16:53:38 Начало правки... 
&НаКлиенте
Процедура КвартирыНомерПодъездаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	Результат = ИзменитьНомерПодъездаНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.Подъезд);
	
	Если Результат Тогда
		
		мКэшЗначений.Подъезд = ТекущиеДанные.Подъезд;
		
	Иначе
		
		ТекущиеДанные.Подъезд = мКэшЗначений.Подъезд;
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 23.06.2016 16:53:40 Конец правки.

// БИТ_ЖКХ 29.06.2016 15:39:22 Начало правки...
&НаКлиенте
Процедура КвартирыКадастровыйНомерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Результат = ИзменитьКадастровыйНомерНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.КадастровыйНомер);
	
	Если Результат Тогда
		
		мКэшЗначений.КадастровыйНомер = ТекущиеДанные.КадастровыйНомер;
		
	Иначе
		
		ТекущиеДанные.КадастровыйНомер = мКэшЗначений.КадастровыйНомер;
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 29.06.2016 15:39:22 Конец правки.

&НаКлиенте
Процедура КвартирыЭтажПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Результат = ИзменитьЭтажНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.Этаж);
	
	Если Результат Тогда
		
		мКэшЗначений.Этаж = ТекущиеДанные.Этаж;
		
	Иначе
		
		ТекущиеДанные.Этаж = мКэшЗначений.Этаж;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыОбщаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ОбщаяПлощадь", ТекущиеДанные.ОбщаяПлощадь);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ОбщаяПлощадь", ТекущиеДанные.ОбщаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыЖилаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ЖилаяПлощадь", ТекущиеДанные.ЖилаяПлощадь);	
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ЖилаяПлощадь", ТекущиеДанные.ЖилаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыМОППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "МОП", ТекущиеДанные.МОП);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "МОП", ТекущиеДанные.МОП);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыОтапливаемаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ОтапливаемаяПлощадь", ТекущиеДанные.ОтапливаемаяПлощадь);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ОтапливаемаяПлощадь", ТекущиеДанные.ОтапливаемаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыСовокупнаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "СовокупнаяПлощадь", ТекущиеДанные.СовокупнаяПлощадь);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "СовокупнаяПлощадь", ТекущиеДанные.СовокупнаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыТипКвартирыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ТипКвартиры", ТекущиеДанные.ТипКвартиры);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ТипКвартиры", ТекущиеДанные.ТипКвартиры);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыСтатусКвартирыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "СтатусКвартиры", ТекущиеДанные.СтатусКвартиры);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "СтатусКвартиры", ТекущиеДанные.СтатусКвартиры);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыТипПлитыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ТипПлиты", ТекущиеДанные.ТипПлиты);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ТипПлиты", ТекущиеДанные.ТипПлиты);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыТипЗапирающегоУстройстваПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ТипЗапирающегоУстройства", ТекущиеДанные.ТипЗапирающегоУстройства);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(Квартира, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ТипЗапирающегоУстройства", ТекущиеДанные.ТипЗапирающегоУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыЖилоеПомещениеСпециализированногоЖилищногоФондаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	
	Квартира = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ЖилоеПомещениеСпециализированногоЖилищногоФонда", ТекущиеДанные.ЖилоеПомещениеСпециализированногоЖилищногоФонда);
	
КонецПроцедуры

// БИТ_ЖКХ 25.04.2017 16:07:43 Начало правки...
&НаКлиенте
Процедура КвартирыПлощадьОДНСОИЭлектроснабПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	Квартира = ТекущиеДанные.Ссылка;
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ПлощадьОДНСОИЭлектроснаб", ТекущиеДанные.ПлощадьОДНСОИЭлектроснаб);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыПлощадьОДНСОИВодоснабПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Квартиры.ТекущиеДанные;
	Квартира = ТекущиеДанные.Ссылка;
	ИзменитьДанныеОКвариреНаСервере(Квартира, НаДату, "ПлощадьОДНСОИВодоснаб", ТекущиеДанные.ПлощадьОДНСОИВодоснаб);
	
КонецПроцедуры
// БИТ_ЖКХ 25.04.2017 16:07:43 Конец правки.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляНежилыеПомещения

&НаКлиенте
Процедура НежилыеПомещенияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		мКэшЗначений.КоличествоКомнатНежилыхПомещений = ТекущиеДанные.КоличествоКомнат;
		мКэшЗначений.ЭтажНежилыхПомещений             = ТекущиеДанные.Этаж;
		// БИТ_ЖКХ 23.06.2016 17:12:01 Начало правки...
		мКэшЗначений.ПодъездНежилыхПомещений		  = ТекущиеДанные.Подъезд;
		// БИТ_ЖКХ 23.06.2016 17:12:01 Конец правки.
		// БИТ_ЖКХ 29.06.2016 15:41:21 Начало правки...
		мКэшЗначений.КадастровыйНомерНежилыхПомещений = ТекущиеДанные.КадастровыйНомер;
		// БИТ_ЖКХ 29.06.2016 15:41:21 Конец правки.
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Ложь;
	
	Если мКэшЗначений.ЭтоНовый Тогда
	
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала необходимо записать элемент!");
		
		Отказ = Истина;
		
		Возврат;
			
	КонецЕсли;
	
	ПараметрыФормы     = Новый Структура;
	ЗначенияЗаполнения = Новый Структура;
	
	Если Копирование Тогда
		
		ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
		
		ЗначенияЗаполнения.Вставить("Этаж"            , ТекущиеДанные.Этаж);
		ЗначенияЗаполнения.Вставить("КоличествоКомнат", ТекущиеДанные.КоличествоКомнат);
		ЗначенияЗаполнения.Вставить("НомерКвартиры"   , ТекущиеДанные.НомерКвартиры);
		ЗначенияЗаполнения.Вставить("ПрефиксКвартиры" , ТекущиеДанные.ПрефиксКвартиры);
		
		// БИТ_ЖКХ 02.04.2014
		КодПоБТИ = ПолучитьКодПоБТИНаСервере(ТекущиеДанные.Ссылка);
		
		//ЗначенияЗаполнения.Вставить("КодПоБТИ"        , ТекущиеДанные.Ссылка.КодПоБТИ);
		ЗначенияЗаполнения.Вставить("КодПоБТИ"        , КодПоБТИ);
		// БИТ_ЖКХ 02.04.2014
		
		// БИТ_ЖКХ 23.06.2016 17:12:32 Начало правки...
		ЗначенияЗаполнения.Вставить("Подъезд", ТекущиеДанные.Подъезд);
		// БИТ_ЖКХ 23.06.2016 17:12:32 Конец правки.
		
		// БИТ_ЖКХ 29.06.2016 15:42:10 Начало правки...
		ЗначенияЗаполнения.Вставить("КадастровыйНомер", ТекущиеДанные.КадастровыйНомер);
		// БИТ_ЖКХ 29.06.2016 15:42:10 Конец правки.
		
	КонецЕсли;			
	
	ЗначенияЗаполнения.Вставить("Владелец", Объект.Ссылка);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);		
	ПараметрыФормы.Вставить("НаДату"            , НаДату);
	ПараметрыФормы.Вставить("НежилыеПомещения"  , ПредопределенноеЗначение("Справочник.бит_ТипыКвартиры.НежилоеПомещение"));
	
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаЭлементаУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодПоБТИНаСервере(Ссылка)
	
	Возврат Ссылка.КодПоБТИ;
	
КонецФункции	

&НаКлиенте
Процедура НежилыеПомещенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	Если ТекущиеДанные.НомерКартинки = 1 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("НежилыеПомещенияПередУдалениемЗавершение1", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Пометить элемент на удаление?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПоказатьВопрос(Новый ОписаниеОповещения("НежилыеПомещенияПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("Ответ, ТекущиеДанные", Ответ, ТекущиеДанные)), "Снять с элемента пометку на удаление?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияПередУдалениемЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = ПометитьКвартируНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 2;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = ДополнительныеПараметры.Ответ;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = СнятьКвартируСПометкиНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьТаблицуКвартир();
	ЗаполнитьТаблицуНежилыхПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	Элементы.НежилыеПомещения.Доступность = Ложь;
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаЭлементаУправляемая", Новый Структура("Ключ", НежилоеПомещение), Элемент);
	
	Элементы.НежилыеПомещения.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияКоличествоКомнатПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	Результат = ИзменитьКоличествоКомнатНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.КоличествоКомнат);
	
	Если Результат Тогда
		
		мКэшЗначений.КоличествоКомнатНежилыхПомещений = ТекущиеДанные.КоличествоКомнат;
		
	Иначе
		
		ТекущиеДанные.КоличествоКомнат = мКэшЗначений.КоличествоКомнатНежилыхПомещений;
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 23.06.2016 17:13:07 Начало правки...
&НаКлиенте
Процедура НежилыеПомещенияНомерПодъездаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	Результат = ИзменитьНомерПодъездаНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.Подъезд);
	
	Если Результат Тогда
		мКэшЗначений.ПодъездНежилыхПомещений = ТекущиеДанные.Подъезд;
	Иначе
		ТекущиеДанные.Подъезд = мКэшЗначений.ПодъездНежилыхПомещений;
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 23.06.2016 17:13:07 Конец правки.

// БИТ_ЖКХ 29.06.2016 15:43:41 Начало правки...
&НаКлиенте
Процедура НежилыеПомещенияКадастровыйНомерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	Результат = ИзменитьКадастровыйНомерНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.КадастровыйНомер);
	
	Если Результат Тогда
		мКэшЗначений.КадастровыйНомерНежилыхПомещений = ТекущиеДанные.КадастровыйНомер;
	Иначе
		ТекущиеДанные.КадастровыйНомер = мКэшЗначений.КадастровыйНомерНежилыхПомещений;
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 29.06.2016 15:43:41 Конец правки.

&НаКлиенте
Процедура НежилыеПомещенияЭтажПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	Результат = ИзменитьЭтажНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.Этаж);
	
	Если Результат Тогда
		
		мКэшЗначений.Этаж = ТекущиеДанные.Этаж;
		
	Иначе
		
		ТекущиеДанные.Этаж = мКэшЗначений.Этаж;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияОбщаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ОбщаяПлощадь", ТекущиеДанные.ОбщаяПлощадь);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ОбщаяПлощадь", ТекущиеДанные.ОбщаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияЖилаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ЖилаяПлощадь", ТекущиеДанные.ЖилаяПлощадь);	
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ЖилаяПлощадь", ТекущиеДанные.ЖилаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияМОППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "МОП", ТекущиеДанные.МОП);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "МОП", ТекущиеДанные.МОП);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияОтапливаемаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ОтапливаемаяПлощадь", ТекущиеДанные.ОтапливаемаяПлощадь);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ОтапливаемаяПлощадь", ТекущиеДанные.ОтапливаемаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияСовокупнаяПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "СовокупнаяПлощадь", ТекущиеДанные.СовокупнаяПлощадь);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "СовокупнаяПлощадь", ТекущиеДанные.СовокупнаяПлощадь);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияТипКвартирыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ТипКвартиры", ТекущиеДанные.ТипКвартиры);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ТипКвартиры", ТекущиеДанные.ТипКвартиры);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияСтатусКвартирыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "СтатусКвартиры", ТекущиеДанные.СтатусКвартиры);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "СтатусКвартиры", ТекущиеДанные.СтатусКвартиры);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияТипПлитыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ТипПлиты", ТекущиеДанные.ТипПлиты);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ТипПлиты", ТекущиеДанные.ТипПлиты);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияТипЗапирающегоУстройстваПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ТипЗапирающегоУстройства", ТекущиеДанные.ТипЗапирающегоУстройства);
	
	//Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКвартире(НежилоеПомещение, НаДату);
	//
	// бит_ОбщегоНазначения.ИзменитьДанныеОКвартире(Запись, "ТипЗапирающегоУстройства", ТекущиеДанные.ТипЗапирающегоУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияЖилоеПомещениеСпециализированногоЖилищногоФондаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ЖилоеПомещениеСпециализированногоЖилищногоФонда", ТекущиеДанные.ЖилоеПомещениеСпециализированногоЖилищногоФонда);
	
КонецПроцедуры

// БИТ_ЖКХ 25.04.2017 15:53:25 Начало правки...  
&НаКлиенте
Процедура НежилыеПомещенияПлощадьОДНСОИЭлектроснабПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ПлощадьОДНСОИЭлектроснаб", ТекущиеДанные.ПлощадьОДНСОИЭлектроснаб);
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПомещенияПлощадьОДНСОИВодоснабПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НежилыеПомещения.ТекущиеДанные;
	НежилоеПомещение = ТекущиеДанные.Ссылка;
	ИзменитьДанныеОКвариреНаСервере(НежилоеПомещение, НаДату, "ПлощадьОДНСОИВодоснаб", ТекущиеДанные.ПлощадьОДНСОИВодоснаб);
	
КонецПроцедуры
// БИТ_ЖКХ 25.04.2017 15:53:27 Конец правки.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляГрупповыеСчетчики

&НаКлиенте
Процедура ГрупповыеСчетчикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	АдресТаблицыРасшифровкиВХранилище = ПоместитьТаблицуРасшифровкиВХранилище();
	
	ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиВХранилище", АдресТаблицыРасшифровкиВХранилище);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаРасшифровкиУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповыеСчетчикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповыеСчетчикиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляРаспределения

&НаКлиенте
Процедура РаспределенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	АдресТаблицыРасшифровкиРаспределенийВХранилище = ПоместитьТаблицуРасшифровкиРаспределенийВХранилище();
	
	ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиРаспределенийВХранилище", АдресТаблицыРасшифровкиРаспределенийВХранилище);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаРасшифровкиРаспределенийУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределенияПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСвойстваЗдания

&НаКлиенте
Процедура СвойстваЗданияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗданияПередНачаломИзменения(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.СвойстваЗдания.ТекущиеДанные;
	
	//Если ЗначениеЗаполнено(ТекущаяСтрока.ВидСвойства) Тогда
	//	
	//	Элементы.СвойстваЗданияЗначение.ОграничениеТипа = ТекущаяСтрока.ВидСвойства.ТипЗначения;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗданияПослеУдаления(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗданияВидСвойстваПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СвойстваЗдания.ТекущиеДанные;
	
	//ТекущаяСтрока.Значение = ТекущаяСтрока.ВидСвойства.ТипЗначения.ПривестиЗначение();
	//
	//Элементы.СвойстваЗданияЗначение.ОграничениеТипа = ТекущаяСтрока.ВидСвойства.ТипЗначения;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗданияВидСвойстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Предопределенный", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗданияВидСвойстваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("ВидСвойства", ВыбранноеЗначение);
		
		Поиск = СвойстваЗдания.НайтиСтроки(Отбор);
		
		Если Поиск.Количество() > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗданияЗначениеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПодсистемыКонтактнаяИнформация

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
//        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
//КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	// БИТ_ЖКХ 16.08.2016 18:30:55 Начало правки... 
	//УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	МодульУправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	// БИТ_ЖКХ 16.08.2016 18:30:56 Конец правки. 
	
КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	//Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, , СтандартнаяОбработка);
//	Результат = бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
//	
//	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеОчистка(ЭтаФорма, Элемент.Имя);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
//	
//	Результат = УправлениеКонтактнойИнформациейКлиент.ПодключаемаяКоманда(ЭтаФорма, Команда.Имя);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВводаАдреса(ЭтаФорма, Результат);
//	
//КонецПроцедуры

//&НаСервере
//Функция ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
//	
//	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтаФорма, Объект, Результат);
//	
//КонецФункции

//// БИТ_ЖКХ 31.12.2015 11:30:28 Начало правки...
//&НаСервере
//Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
//	
//	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтаФорма, Объект, Результат);
//	
//КонецФункции
//// БИТ_ЖКХ 31.12.2015 11:30:28 Конец правки.

&НаСервере
Процедура РазместитьКонтактнуюИнформацию()
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИсключаемыеВиды = Новый Массив;
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
	
	ДополнительныеПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметрыКонтактнойИнформации.ОтложеннаяИнициализация = Ложь;
	ДополнительныеПараметрыКонтактнойИнформации.ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ДополнительныеПараметрыКонтактнойИнформации.ИсключаемыеВиды = ИсключаемыеВиды;
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметрыКонтактнойИнформации);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеИзКонтактнойИнформации(Тип, Вид)
	
	ТипВЗапросе = ПолучитьТипКонтактнойИнформации(Тип);
	ВидВЗапросе = ПолучитьВидКонтактнойИнформации(Вид);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|ГДЕ
	|	бит_КонтактнаяИнформация.Объект = &Объект
	|	И бит_КонтактнаяИнформация.Тип = &Тип
	|	И бит_КонтактнаяИнформация.Вид = &Вид");
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.УстановитьПараметр("Тип"   , ТипВЗапросе);
	Запрос.УстановитьПараметр("Вид"   , ВидВЗапросе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредставлениеАдреса = "";
	
	Если Выборка.Следующий() Тогда
		
		ПредставлениеАдреса = Выборка.Представление;
		
	КонецЕсли;
	
	Возврат ПредставлениеАдреса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипКонтактнойИнформации(Тип)
	
	Если Тип = "Адрес" Тогда
		
		ТипВЗапросе = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;
		
	КонецЕсли;
	
	Возврат ТипВЗапросе;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидКонтактнойИнформации(Вид)
	
	Если Вид = "ПочтовыйАдресЗдания" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания;
		
	КонецЕсли;
	
	Возврат ВидВЗапросе;
	
КонецФункции
// БИТ_ЖКХ 07.10.2014

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииПериода()
	
	// Обновляем представление периода на форме.
	СтрокаНачалоПериода = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"),
	НаДату, 
	КонецМесяца(НаДату));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаДату = РезультатВыбора.КонецПериода;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

// Процедура нажатия кнопки ДобавитьКомнаты на вкладке Квартиры табличной части.
&НаКлиенте
Процедура ДобавитьКомнаты(Команда)
	
	ТекДанные = Элементы.Квартиры.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Здание"	  , Объект.Ссылка);		
		ПараметрыФормы.Вставить("НаДату"	  , НаДату);
		ПараметрыФормы.Вставить("Организация" , Объект.Организация);
		ПараметрыФормы.Вставить("Квартира"	  , ТекДанные.Ссылка);
		
		ОткрытьФорму("Обработка.бит_ЗаполнениеКвартир.Форма", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

// Процедура нажатия кнопки ЗаполнениеКомнат на вкладке Квартиры табличной части.
&НаКлиенте
Процедура ЗаполнениеКомнат(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Здание"	  , Объект.Ссылка);		
	ПараметрыФормы.Вставить("НаДату"	  , НаДату);
	ПараметрыФормы.Вставить("Организация" , Объект.Организация);
	
	ОткрытьФорму("Обработка.бит_ЗаполнениеКвартир.Форма", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

#КонецОбласти