
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мНеСоздДокумент  Экспорт;  // Булево, признак созданного документа.
Перем мГрафаНачисления Экспорт;  // Хранит флаг настройки ЖКХ.
Перем мУчитыватьНачисленияПоГрупповымСчетчикам Экспорт; // Хранит флаг настройки ЖКХ.
Перем мУчитыватьПерерасчет                     Экспорт; // Хранит флаг настройки ЖКХ.

Перем мУчетДнейПроживания          Экспорт; // Хранит флаг настройки ЖКХ.
Перем мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Экспорт; // Хранит флаг настройки ЖКХ.

Перем мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика Экспорт; // Хранит флаг настройки ЖКХ.

Перем мТаблицаНачисленийЗаПредыдущиеПериоды;

Перем мТаблицаПоУслугамПеня;
#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

Процедура ОбновитьНастройкиЖКХ()  Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ОбщедомовыеРасходыВГрафеНачисления"      , Ложь);
	ПараметрыЖКХ.Вставить("УчитыватьНачисленияПоГрупповымСчетчикам" , Ложь);
	ПараметрыЖКХ.Вставить("УчитыватьПерерасчет"                     , Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, ПараметрыЖКХ);
	
	мГрафаНачисления                         = ПараметрыЖКХ.ОбщедомовыеРасходыВГрафеНачисления;
	мУчитыватьНачисленияПоГрупповымСчетчикам = ПараметрыЖКХ.УчитыватьНачисленияПоГрупповымСчетчикам;
	мУчитыватьПерерасчет                     = ПараметрыЖКХ.УчитыватьПерерасчет;
	
КонецПроцедуры

// Выполняет расчет разности дат в днях.
//
// Параметры::
//  Дата1  – Дата – Первая дата.
//                 
//  Дата2  – Дата – Вторая дата.
//                 
//
// Возвращаемое значение:
//   Число   – Разность дат в днях.
//
//
Функция РазностьДатВДнях(Дата1, Дата2) Экспорт 
	
	мДлинаСуток = 86400; // В секундах.
	
	Возврат  Окр((НачалоДня(Дата1) - НачалоДня(Дата2)) / мДлинаСуток) + 1;
	
КонецФункции

// Возвращает количество проживающих в квартире.
//
// Параметры:
//  ДатаРасчета  – Дата – дата получения данных.
//
// Возвращаемое значение:
//   Число   – количество человек.
//
//
Функция ПолучитьКолвоПроживающих(ДатаРасчета) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК Колво,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&ДатаРасчета, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ДатаРасчета" ,ДатаРасчета);
	Запрос.УстановитьПараметр("ЛицевойСчет" ,ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат  Выборка.Колво;
	Иначе 	  
		Возврат 1; 
	КонецЕсли;
	
КонецФункции	

// Возвращает способ расчета по услуге.
//
// Параметры:
//  УслугаРасчета  – СправочникСсылка.бит_УслугиЖКХ – Услуга ЖКХ.
//
//  ДатаРасчета  – Дата – дата получения данных.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам   – Способ расчета по услуге.
//
Функция ПолучитьСпособРасчета(УслугаРасчета,ДатаРасчета) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&ДатаРасчета,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	Запрос.УстановитьПараметр("ДатаРасчета" ,ДатаРасчета);
	Запрос.УстановитьПараметр("ЛицевойСчет" ,ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга"      ,УслугаРасчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат  Выборка.СпособРасчета;
	Иначе 	  
		Возврат Перечисления.бит_СпособыРасчетаПоУслугам.ПустаяСсылка(); 
	КонецЕсли;
	
КонецФункции	

// Возвращает способ расчета по услуге.
//
// Параметры:
//  УслугаРасчета  – СправочникСсылка.бит_УслугиЖКХ – Услуга ЖКХ.
//
//  ДатаРасчета  – Дата – дата получения данных.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам   – Способ расчета по услуге.
//
Функция ПолучитьИсточникФинансирования(Льгота) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ИсточникиФинансированияЛьготСрезПоследних.ИсточникФинансированияЛьгот КАК ИсточникФин
	|ИЗ
	|	РегистрСведений.бит_ИсточникиФинансированияЛьгот.СрезПоследних(&Дата, Льгота = &Льгота) КАК бит_ИсточникиФинансированияЛьготСрезПоследних";
	Запрос.УстановитьПараметр("Дата"   ,Дата);
	Запрос.УстановитьПараметр("Льгота" ,Льгота);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ИсточникФин.Контрагент;
	Иначе 
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
Конецфункции

// Процедура выполняет заполнение Счетов и Субконто.
//
Процедура ЗаполнениеСчетовКУ()Экспорт 
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг Тогда 
		
	Иначе 	
		СтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Организация,КонецМесяца(Дата));	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛСПоставщики.ЛицевойСчет,
		|	ЛСПоставщики.Услуга,
		|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
		|	бит_ПолучателиДенежныхСредствСрезПоследних.ДоговорКонтрагента
		|ИЗ
		|	(ВЫБРАТЬ
		|		бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|		бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
		|	ИЗ
		|		РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних) КАК ЛСПоставщики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Момент, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО ЛСПоставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|			И ЛСПоставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик";
		
		Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
		Запрос.УстановитьПараметр("Момент"      ,КонецМесяца(Дата));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Отбор = Новый Структура();
			Отбор.Вставить("Услуга"      ,Выборка.Услуга);
			Строки = СписокУслуг.НайтиСтроки(Отбор);
			Если ТипЗнч(Выборка.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Организации") тогда
				Если Строки.Количество() > 0 Тогда
					Строки[0].СчетАбонента = СтруктураСчетовЖКХ.СчетАбонента;
					
					СтрокаСубконта = Строки[0].СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета, "ВидСубконто");
					Если Не СтрокаСубконта = Неопределено тогда
						Строки[0]["Субконто"+СтрокаСубконта.НомерСтроки] = Выборка.ЛицевойСчет;
					КонецЕсли;	
					Если Строки[0].Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Эксплуатационная	Тогда 	
						Строки[0].СчетКУ       = СтруктураСчетовЖКХ.СчетСУЦС;
						СтрокаСубконтаКУ = Строки[0].СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств, "ВидСубконто");
						Если Не СтрокаСубконтаКУ = Неопределено тогда
							Строки[0]["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Строки[0].Услуга.ЦелевыеСредства;
						КонецЕсли;
						
						СтрокаСубконтаКУ = Строки[0].СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДвиженияЦелевыхСредств, "ВидСубконто");
						Если Не СтрокаСубконтаКУ = Неопределено тогда
							Строки[0]["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Строки[0].Услуга.ДвижениеЦС;
						КонецЕсли;
					ИначеЕсли Строки[0].Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Аренда	Тогда
						Строки[0].СчетКУ       = СтруктураСчетовЖКХ.СчетСУАренды;
						СтрокаСубконтаКУ = Строки[0].СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто");
						Если Не СтрокаСубконтаКУ = Неопределено тогда
							Строки[0]["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Строки[0].Услуга.НоменклатурнаяГруппа;
						КонецЕсли;
					Иначе 
						Строки[0].СчетКУ       = СтруктураСчетовЖКХ.СчетСУКУ;
						
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Выборка.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") тогда  
				Если Строки.Количество() > 0 Тогда
					Строки[0].СчетАбонента = СтруктураСчетовЖКХ.СчетАбонента;
					
					СтрокаСубконта = Строки[0].СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета, "ВидСубконто");
					Если Не СтрокаСубконта = Неопределено тогда
						Строки[0]["Субконто"+СтрокаСубконта.НомерСтроки] = Выборка.ЛицевойСчет;
					КонецЕсли;	
					Строки[0].СчетКУ = СтруктураСчетовЖКХ.СчетСторПКУ;
					
					СтрокаСубконтаКУ = Строки[0].СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
					Если Не СтрокаСубконтаКУ = Неопределено тогда
						Строки[0]["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Выборка.ПолучательДенежныхСредств;
					КонецЕсли;
					СтрокаСубконтаКУ = Строки[0].СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
					Если Не СтрокаСубконтаКУ = Неопределено тогда
						Если ЗначениеЗаполнено(Выборка.ДоговорКонтрагента)
							И Выборка.ДоговорКонтрагента.Организация = Организация Тогда  	
							Строки[0]["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Выборка.ДоговорКонтрагента;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	 
			
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры	

// Процедура выполняет вычесление данных и заполнение табличной части.
//
Процедура РассчитатьСуммыПересчета(Колонки = Неопределено) Экспорт 
	
	СписокЛС = ЛицевойСчет;
	СписокУС = Неопределено;
	Для каждого СтрокаСписокУслуг Из СписокУслуг Цикл
		СтрокаСписокУслуг.Сумма = 0;
	КонецЦикла; 
	Если Колонки = Неопределено Тогда
		
		Форма = ЭтотОбъект.ПолучитьФорму("ФормаДокументаУправляемая", Этотобъект,);
		Колонки = Форма.Элементы.СписокУслуг.ПодчиненныеЭлементы;	
		
	КонецЕсли; 	
	
	// БИТ ЖКХ 10.03.2020
	если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеЗаПрошлыеПериоды тогда
		  
		ТаблицаСбора = ПолучитьТаблицуНачисленийЗаВесьПериод(); 
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		
        ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаСбора);    
        СтрокаОтбора = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
        СтрокаОтбора.Значение = ЛицевойСчет;
        СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
        СтрокаОтбора.Использование = Истина;
        
        ПостроительЗапроса.Выполнить();
        ВыбрСтроки = ПостроительЗапроса.Результат.Выгрузить();   
		ВыбрСтроки.Свернуть("Услуга, Объем", "Начислено");		
		
		для каждого стр из СписокУслуг цикл
			
			Отбор = Новый Структура;
            Отбор.Вставить("Услуга", стр.Услуга);
            ВыбрСтрокиУслуг = ВыбрСтроки.НайтиСтроки(Отбор);
			
			если ВыбрСтрокиУслуг.Количество() > 0 тогда
				
				стр.Объем = ВыбрСтрокиУслуг[0].Объем; 
				стр.Сумма = ВыбрСтрокиУслуг[0].Начислено; 
				
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(КонецМесяца(КонПериода))> НачалоДня(КонПериода),КонПериода,КонецМесяца(КонПериода)),НачалоМесяца(НачПериода));
				КолвоДнейВМесяце = РазностьДатВДнях(КонецМесяца(КонПериода),НачалоМесяца(НачалоМесяца(НачПериода)));
				стр.Сумма  = стр.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце;

			конецесли;	
			
		конеццикла;	

		РассчитатьОбъем(СписокУслуг);

	конецесли;	
	
	// БИТ ЖКХ 10.03.2020
	если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды тогда
		
		ТаблицаСбора = ПолучитьТаблицуНачисленийЗаВесьПериод(); 
		
		СписокЛС = Новый ТаблицаЗначений;
		СписокЛС = СписокУслуг.Выгрузить();
		СписокЛС.Свернуть("ЛицевойСчет");
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		СписокЗначенийЛС = новый СписокЗначений;		
		массивЛС = СписокЛС.ВыгрузитьКолонку("ЛицевойСчет");
		СписокЗначенийЛС.ЗагрузитьЗначения(массивЛС);
		
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаСбора);    
        СтрокаОтбора = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
        СтрокаОтбора.ВидСравнения = ВидСравнения.ВСписке;
		СтрокаОтбора.Значение = СписокЗначенийЛС;
        СтрокаОтбора.Использование = Истина;	
		
        ПостроительЗапроса.Выполнить();
        ВыбрСтроки = ПостроительЗапроса.Результат.Выгрузить();   
		ВыбрСтроки.Свернуть("Услуга, Объем", "Начислено");		
		
		для каждого стр из СписокУслуг цикл
			
			Отбор = Новый Структура;
            Отбор.Вставить("Услуга", стр.Услуга);
            ВыбрСтрокиУслуг = ВыбрСтроки.НайтиСтроки(Отбор);
			
			если ВыбрСтрокиУслуг.Количество() > 0 тогда
				
				стр.Объем = ВыбрСтрокиУслуг[0].Объем; 
				стр.Сумма = ВыбрСтрокиУслуг[0].Начислено; 
				
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(КонецМесяца(КонПериода))> НачалоДня(КонПериода),КонПериода,КонецМесяца(КонПериода)),НачалоМесяца(НачПериода));
				КолвоДнейВМесяце = РазностьДатВДнях(КонецМесяца(КонПериода),НачалоМесяца(НачалоМесяца(НачПериода)));
				стр.Сумма  = стр.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце;

			конецесли;	
			
		конеццикла;	

		РассчитатьОбъем(СписокУслуг);

	конецесли;	

	
	// Операция ДоначисленияПоУслуге производит теже расчеты что и НедопоставкаУслуги со знаком "+".
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслуге  Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			СУММА(ЕСТЬNULL(ВЫБОР
		|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|					КОНЕЦ, 0)) КАК Сумма1
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ)) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.УслугаЖКХ
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУслуг);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();		
				
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
				КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
				НоваяСтрока = ТаблицаСбора.Добавить();
				НоваяСтрока.Услуга = Выборка.Услуга;
				НоваяСтрока.Сумма  = Выборка.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце;
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга,Объем","Сумма");
		
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл 
			НайденнаяСтрока = СписокУслуг.Найти(ТекСтрока.Услуга, "Услуга");
			Сумма = 0;
			Если Не НайденнаяСтрока = Неопределено Тогда
				// Операция ДоначисленияПоУслуге производит теже расчеты что и НедопоставкаУслуги со знаком "+".
				Сумма = ?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги, -ТекСтрока.Сумма, ТекСтрока.Сумма);
				
				Если ЗначениеЗаполнено(КолЧасовНедопоставки) Тогда
					
					Сумма = (Сумма * КолЧасовНедопоставки)/24;
					
				КонецЕсли; 
				
				НайденнаяСтрока.Сумма = Сумма;
				
			КонецЕсли; 
		КонецЦикла;
		
		РассчитатьОбъем(ТаблицаСбора);
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Льгота,
		|	ТаблицаНачислений.Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачислениеПоЛьготамОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачислениеПоЛьготамОбороты.Услуга КАК Услуга,
		|			бит_НачислениеПоЛьготамОбороты.Льгота КАК Льгота,
		|			бит_НачислениеПоЛьготамОбороты.ФизЛицо КАК ФизЛицо,
		|			ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.СуммаОборот, 0) КАК Сумма
		|		ИЗ
		|			РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(&НачПериода, &КонПериода, Месяц, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачислениеПоЛьготамОбороты) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.Услуга
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(ДокументОснование.НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(ДокументОснование.КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,ДокументОснование.СписокУслуг);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = ДокументОснование.НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		ТаблицаСбора.Колонки.Добавить("Льгота",Новый ОписаниеТипов("СправочникСсылка.бит_СписокЛьгот"));
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
				КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
				НоваяСтрока = ТаблицаСбора.Добавить();
				НоваяСтрока.Услуга = Выборка.Услуга;
				НоваяСтрока.Льгота = Выборка.Льгота;
				НоваяСтрока.Сумма  = Выборка.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце;
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга","Сумма");
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл 
			НайденнаяСтрока = СписокУслуг.Найти(ТекСтрока.Услуга, "Услуга");
			Если Не НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока.Сумма = ТекСтрока.Сумма;  
			КонецЕсли; 
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначислениеПоВременноПроживающим Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаНачислений.УслугаЖКХ КАК Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|		бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|		СУММА(ЕСТЬNULL(ВЫБОР
		|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|						ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|				КОНЕЦ, 0)) КАК Сумма1
		|	ИЗ
		|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
		|	
		|	СГРУППИРОВАТЬ ПО
		|		бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|		КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ)) КАК ТаблицаНачислений
		|ИТОГИ ПО
		|	ПериодНачисления";
		
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУслуг);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				СпособРасчета =  ПолучитьСпособРасчета(Выборка.Услуга,ВыборкаПоПериоду.ПериодНачисления);
				Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда 
					КолвоПроживающих =  ПолучитьКолвоПроживающих(ВыборкаПоПериоду.ПериодНачисления);
					КолвоЧел         = ?(КолвоЧеловек > КолвоПроживающих , КолвоПроживающих, КолвоЧеловек);
					КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
					КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
					НоваяСтрока = ТаблицаСбора.Добавить();
					НоваяСтрока.Услуга = Выборка.Услуга;
					НоваяСтрока.Сумма  = Выборка.Сумма *  КолвоЧел/КолвоПроживающих * КолвоДней/КолвоДнейВМесяце;
				КонецЕсли;
				
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга,Объем","Сумма");
		
		СписокУслуг.Загрузить(ТаблицаСбора);
		
		РассчитатьОбъем(ТаблицаСбора);
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоОтсутствующим тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаНачислений.УслугаЖКХ КАК Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|		бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|		СУММА(ЕСТЬNULL(ВЫБОР
		|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|						ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|				КОНЕЦ, 0)) КАК Сумма1
		|	ИЗ
		|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
		|	
		|	СГРУППИРОВАТЬ ПО
		|		бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|		КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ)) КАК ТаблицаНачислений
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодНачисления
		|ИТОГИ ПО
		|	ПериодНачисления";
		
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУслуг);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			Пока Выборка.Следующий()  Цикл 
				СпособРасчета =  ПолучитьСпособРасчета(Выборка.Услуга,ВыборкаПоПериоду.ПериодНачисления);
				Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда  
					КолвоПроживающих =  ПолучитьКолвоПроживающих(ВыборкаПоПериоду.ПериодНачисления);
					КолвоЧел         = ?(КолвоЧеловек > КолвоПроживающих , КолвоПроживающих, КолвоЧеловек);
					КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
					КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
					НоваяСтрока = ТаблицаСбора.Добавить();
					НоваяСтрока.Услуга = Выборка.Услуга;
					НоваяСтрока.Сумма  = -Выборка.Сумма *  КолвоЧел/КолвоПроживающих * КолвоДней/КолвоДнейВМесяце;
				КонецЕсли;  
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга,Объем","Сумма");
		СписокУслуг.Загрузить(ТаблицаСбора);
        
		РассчитатьОбъем(ТаблицаСбора);
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоОтсутствующим тогда
		СписокУслуг.Очистить();
		// БИТ ЖКХ 16.07.2020
        СписокУслугПеня.Очистить();
		МассивУслуг = ДокументОснование.СписокУслуг.ВыгрузитьКолонку("Услуга");
		Для Каждого ТекСтрока Из МассивУслуг Цикл 
			НоваяСтрока = СписокУслуг.Добавить();
			НоваяСтрока.Услуга = ТекСтрока;
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаНачислений.Услуга,
		|	ТаблицаНачислений.Льгота,
		|	СУММА(ТаблицаНачислений.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОНЕЦПЕРИОДА(бит_НачислениеПоЛьготамОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|		бит_НачислениеПоЛьготамОбороты.Услуга КАК Услуга,
		|		бит_НачислениеПоЛьготамОбороты.Льгота КАК Льгота,
		|		бит_НачислениеПоЛьготамОбороты.ФизЛицо КАК ФизЛицо,
		|		ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.СуммаОборот, 0) / ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.КоличествоНосителейОборот, 1) * ВЫБОР
		|			КОГДА &КолвоЧел > ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.КоличествоНосителейОборот, 1)
		|				ТОГДА ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.КоличествоНосителейОборот, 1)
		|			ИНАЧЕ &КолвоЧел
		|		КОНЕЦ КАК Сумма
		|	ИЗ
		|		РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(
		|				&НачПериода,
		|				&КонПериода,
		|				Месяц,
		|				ЛицевойСчет = &ЛицевойСчет
		|					И ФизЛицо В (&СписокФизлиц)) КАК бит_НачислениеПоЛьготамОбороты) КАК ТаблицаНачислений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНачислений.ПериодНачисления,
		|	ТаблицаНачислений.Услуга,
		|	ТаблицаНачислений.Льгота
		|ИТОГИ ПО
		|	ПериодНачисления";
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(ДокументОснование.НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(ДокументОснование.КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,ДокументОснование.СписокУслуг);
		Запрос.УстановитьПараметр("СписокФизлиц"          ,ФизЛица.ВыгрузитьКолонку("ФизЛицо"));
		Запрос.УстановитьПараметр("КолвоЧел"              ,ДокументОснование.КолвоЧеловек);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = ДокументОснование.НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		ТаблицаСбора.Колонки.Добавить("Льгота",Новый ОписаниеТипов("СправочникСсылка.бит_СписокЛьгот"));
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			Пока Выборка.Следующий()  Цикл 
				СпособРасчета =  ПолучитьСпособРасчета(Выборка.Услуга,ВыборкаПоПериоду.ПериодНачисления);
				Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоПроживающим Тогда  
					КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
					КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
					НоваяСтрока = ТаблицаСбора.Добавить();
					НоваяСтрока.Услуга = Выборка.Услуга;
					НоваяСтрока.Льгота = Выборка.Льгота;
					
					НоваяСтрока.Сумма  = Выборка.Сумма  * КолвоДней/КолвоДнейВМесяце;
				КонецЕсли;  
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга","Сумма");
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл 
			НайденнаяСтрока = СписокУслуг.Найти(ТекСтрока.Услуга, "Услуга");
			Если Не НайденнаяСтрока = Неопределено Тогда
				
				НайденнаяСтрока.Сумма = ТекСтрока.Сумма;  
			КонецЕсли; 
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое Тогда
		
		СписокУС = Новый ТаблицаЗначений;
		СписокУС = СписокУслуг.Выгрузить();
		СписокУС.Свернуть("Услуга");
		
		СписокЛС = Новый ТаблицаЗначений;
		СписокЛС = СписокУслуг.Выгрузить();
		СписокЛС.Свернуть("ЛицевойСчет");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаНачислений.ЛицевойСчет,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			СУММА(ЕСТЬNULL(ВЫБОР
		|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|					КОНЕЦ, 0)) КАК Сумма1
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
		|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.УслугаЖКХ
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода+200), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,СписокЛС);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУС);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
				КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
				
				НоваяСтрока = ТаблицаСбора.Добавить();
				
				НоваяСтрока.ЛицевойСчет = Выборка.ЛицевойСчет;
				НоваяСтрока.Услуга      = Выборка.Услуга;
				
				НоваяСтрока.Сумма       = ОКР(Выборка.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце,2);
				
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("ЛицевойСчет,Услуга,Объем","Сумма");
		
		Отбор = Новый Структура;
		
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл
			
			Отбор.Очистить();
			Отбор.Вставить("ЛицевойСчет", ТекСтрока.ЛицевойСчет);
			Отбор.Вставить("Услуга"     , ТекСтрока.Услуга);
			
			НайденныеСтроки = СписокУслуг.НайтиСтроки(Отбор);
			
			Для каждого Строка Из НайденныеСтроки Цикл
				
				Сумма = ?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое, -ТекСтрока.Сумма, ТекСтрока.Сумма);
				
				Если ЗначениеЗаполнено(КолЧасовНедопоставки) Тогда
					
					Сумма = (Сумма * КолЧасовНедопоставки)/24;
					
				КонецЕсли;
				
				Строка.Сумма = Сумма;
				
			КонецЦикла; 

		КонецЦикла;
		
		РассчитатьОбъем(ТаблицаСбора);
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое Тогда
		
		СписокУС = Новый ТаблицаЗначений;
		СписокУС = СписокУслуг.Выгрузить();
		СписокУС.Свернуть("Услуга");
		
		СписокЛС = Новый ТаблицаЗначений;
		СписокЛС = СписокУслуг.Выгрузить();
		СписокЛС.Свернуть("ЛицевойСчет");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаНачислений.ЛицевойСчет,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			СУММА(ЕСТЬNULL(ВЫБОР
		|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
		|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|					КОНЕЦ, 0)) КАК Сумма1
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
		|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.УслугаЖКХ
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,СписокЛС);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУС);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
				КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
				
				НоваяСтрока = ТаблицаСбора.Добавить();
				
				НоваяСтрока.ЛицевойСчет = Выборка.ЛицевойСчет;
				НоваяСтрока.Услуга      = Выборка.Услуга;
				
				НоваяСтрока.Сумма       = ОКР(Выборка.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце,2);
				
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("ЛицевойСчет,Услуга","Сумма");
		
		Отбор = Новый Структура;
		
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл
			
			Отбор.Очистить();
			Отбор.Вставить("ЛицевойСчет", ТекСтрока.ЛицевойСчет);
			Отбор.Вставить("Услуга"     , ТекСтрока.Услуга);
			
			НайденныеСтроки = СписокУслуг.НайтиСтроки(Отбор);
			
			Для каждого Строка Из НайденныеСтроки Цикл
				
				Сумма = ?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое, -ТекСтрока.Сумма, ТекСтрока.Сумма);
				
				Если ЗначениеЗаполнено(КолЧасовНедопоставки) Тогда
					
					Сумма = (Сумма * КолЧасовНедопоставки)/24;
					
				КонецЕсли;
				
				Строка.Сумма = Сумма;
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчику Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			СУММА(ЕСТЬNULL(ВЫБОР
		|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
		|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|					КОНЕЦ, 0)) КАК Сумма1
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ)) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.УслугаЖКХ
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУслуг);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
				КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
				НоваяСтрока = ТаблицаСбора.Добавить();
				НоваяСтрока.Услуга = Выборка.Услуга;
				НоваяСтрока.Сумма  = Выборка.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце;
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга,Объем","Сумма");
		
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл 
			НайденнаяСтрока = СписокУслуг.Найти(ТекСтрока.Услуга, "Услуга");
			Сумма = 0;
			Если Не НайденнаяСтрока = Неопределено Тогда
				Сумма = ?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика, -ТекСтрока.Сумма, ТекСтрока.Сумма);
				
				Если ЗначениеЗаполнено(КолЧасовНедопоставки) Тогда
					
					Сумма = (Сумма * КолЧасовНедопоставки)/24;
					
				КонецЕсли; 
				
				НайденнаяСтрока.Сумма = Сумма;
				
			КонецЕсли; 
		КонецЦикла;
		
		РассчитатьОбъем(ТаблицаСбора);
		
	КонецЕсли;
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(СписокУслуг, Колонки, СписокЛС, Организация , КонецМесяца(Дата));
	
КонецПроцедуры	

функция ПолучитьТаблицуНачисленийЗаВесьПериод()	
	
  ПервыйМесяц = НачалоМесяца(НачПериода); 	
  
  датаРасчета = КонецМесяца(НачПериода); 
  табВозврата = неопределено;
  
  пока датаРасчета <= КонецМесяца(КонПериода) цикл
	  
	  таблицаРасчета = ПолучитьТаблицуНачисленийЗаПрошлыйПериод(датаРасчета);
	  
	  если табВозврата = неопределено тогда
		 табВозврата = таблицаРасчета.Скопировать();
	  иначе
		  для каждого стр из таблицаРасчета цикл
			стрВ = табВозврата.Добавить();  
			ЗаполнитьЗначенияСвойств(стрВ, стр);
		  конеццикла;	  
	  конецесли;	  
	  датаРасчета = ДобавитьМесяц(датаРасчета, 1);
	  
  конеццикла;		
  
  возврат табВозврата;	
  
конецфункции	

функция ПолучитьТаблицуНачисленийЗаПрошлыйПериод(Период)	
	
	ДатаЗакрытияМ = КонецМесяца(Период);
	
	СтруктураНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Здание");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Улица");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументНачисления");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументПоСч");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДокументПоЛьготам");
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата"       , КонецМесяца(ДатаЗакрытияМ));
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", Организация);
	
	ДатаЗакрытия = ДатаЗакрытияМ;
	мДатаТекст = Формат(ДатаЗакрытияМ, "ДФ='ММММ гггг'");	
	мОтветственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"); 
	
	мКэшЗначений = ЗаполнитьКэшЗначенийМодуль();
	
	ВыполнитьНачисления = истина;
	ВыполнитьНачисленияПоНормам = истина;

//	СтруктураНастроек.КомпоновщикНастроек = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьФорму("ФормаУправляемая").КомпоновщикНастроек;
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ОсновныеНачисления";
	
	СтруктураРезультата = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	запрос = Новый Запрос;
	ТекстЛС = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Здание КАК Здание
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета";
		
	запрос.Текст = ТекстЛС;
	Результат = запрос.Выполнить().Выгрузить();
	Здания = Результат.Скопировать(); 
	Здания.Свернуть("Здание");
	СписокЗданий = Здания.ВыгрузитьКолонку("Здание");
	
	ЛС = Результат.Скопировать();
	ЛС.Свернуть("ЛицевойСчет");
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");


	ТаблицаНачислений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаСчетчиков  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТаблицаРаспред    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	ТаблицаПрожив     = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
		
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецМесяца(ДатаЗакрытияМ), 
		Организация, 
		СписокЛС, 
		СписокЗданий, 
		, 
		, 
		ТаблицаНачислений, 
		ТаблицаСчетчиков, 
		ТаблицаРаспред, 
		,
		,
		,
		мКэшЗначений.РасчетСУчетомДолейВладения,
		мКэшЗначений.УменьшениеНормыЛьготыВПределахФакта, 
		мКэшЗначений.НачислениеСУчетомДнейПроживания, 
		ТаблицаПрожив, 
		,
		мКэшЗначений.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
		мКэшЗначений.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);	

	возврат ТаблицаНачислений;
	
КонецФункции   

&НаСервере
функция ЗаполнитьКэшЗначенийМодуль()
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	
	КэшированныеЗначения.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	КэшированныеЗначения.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	КэшированныеЗначения.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	КэшированныеЗначения.Вставить("ОбщедомовыеРасходыВГрафеНачисления"                   , Ложь);
	КэшированныеЗначения.Вставить("СчетчикиПодкрутка"                                    , Ложь);
	КэшированныеЗначения.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	КэшированныеЗначения.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	КэшированныеЗначения.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	КэшированныеЗначения.Вставить("УчитыватьНачисленияПоГрупповымСчетчикам"              , Ложь);
	КэшированныеЗначения.Вставить("УчитыватьПерерасчет"                                  , Ложь);
	КэшированныеЗначения.Вставить("СчетАбонента"                                         , Неопределено);
	КэшированныеЗначения.Вставить("Контрагент"                                            , Неопределено);
	КэшированныеЗначения.Вставить("ФормироватьАктИРеализациюПоКонтрагенту"                , Ложь);
	КэшированныеЗначения.Вставить("ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц", Ложь);
	
	КэшированныеЗначения.Вставить("ДокументУчетаСобственныхУслуг", Неопределено);
	
	КэшированныеЗначения.Вставить("ПорядокРаспределенияРасходовНаОказаниеУслуг", Неопределено);
	
	КэшированныеЗначения.Вставить("ПоПлановымЦенамИВыручке", Перечисления.бит_ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенамИВыручке);
	
	КэшированныеЗначения.Вставить("ЗначениеДаты"                                         , Неопределено);
	
	возврат КэшированныеЗначения;
КонецФункции


функция ПересчитатьНачисления ()
	
	    Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			СУММА(ЕСТЬNULL(ВЫБОР
		|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|					КОНЕЦ, 0)) КАК Сумма1
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ)) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.УслугаЖКХ
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода+200), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУслуг);
		возврат  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");		
	
конецфункции
	
функция ПереСчитатьНачисленияГрупповые()
	СписокУС = Новый ТаблицаЗначений;
		СписокУС = СписокУслуг.Выгрузить();
		СписокУС.Свернуть("Услуга");
		
		СписокЛС = Новый ТаблицаЗначений;
		СписокЛС = СписокУслуг.Выгрузить();
		СписокЛС.Свернуть("ЛицевойСчет");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаНачислений.ЛицевойСчет,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Сумма1 КАК Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			СУММА(ЕСТЬNULL(ВЫБОР
		|						КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|							ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|					КОНЕЦ, 0)) КАК Сумма1
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачПериода, &КонПериода, Регистратор, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
		|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.УслугаЖКХ
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(КонПериода+200), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,СписокЛС);
		Запрос.УстановитьПараметр("СписокУслуг"           ,СписокУС);
		возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");

конецфункции	
// Процедура выполняет заполнение табличной части.
//
Процедура ЗаполнитьПоЧеку(Колонки = Неопределено) Экспорт
	
	ТабДляЗаполнения = ЧекККМ.Услуги.Выгрузить();
	СписокУслуг.Загрузить(ТабДляЗаполнения);
	
	Для каждого Строка Из СписокУслуг Цикл
		
		Строка.ЛицевойСчет = ЧекККМ.ЛицевойСчет;
		
	КонецЦикла; 
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(СписокУслуг, Колонки, ЧекККМ.ЛицевойСчет, Организация , КонецМесяца(Дата));
	
КонецПроцедуры

// Процедура выполняет заполнение табличной части.
//
Процедура ЗаполнитьПоОплате(Колонки = Неопределено) Экспорт
	
	СписокУслуг.Очистить();
	// БИТ ЖКХ 16.07.2020
    СписокУслугПеня.Очистить();
	ТабДляЗаполнения = ОплатаКУ.СписокУслуг.Выгрузить();
	
	Если НЕ ЛицевойСчет.Пустая() Тогда
		
		МассивСтрок = ТабДляЗаполнения.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			
			НоваяСтрока = СписокУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла; 
		
		МассивСтрок = ТабДляЗаполнения.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			
			НоваяСтрока = СписокУслугПеня.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла; 

	Иначе
		СписокУслуг.Загрузить(ТабДляЗаполнения);	
		// БИТ ЖКХ 15.07.2020
		СписокУслугПеня.Загрузить(ТабДляЗаполнения);
	КонецЕсли; 
	
	СписокЛС = СписокУслуг.ВыгрузитьКолонку("ЛицевойСчет");
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(СписокУслуг, Колонки, СписокЛС, Организация , КонецМесяца(Дата));
	// БИТ ЖКХ 17.07.2020
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(СписокУслугПеня, Колонки, СписокЛС, Организация , КонецМесяца(Дата));
	
	ЗаполнитьСубконтоКУ();
	// БИТ ЖКХ 21.07.2020
	ЗаполнитьСубконтоКУПеня();
	
КонецПроцедуры

// БИТ ЖКХ 21.07.2020
Процедура ЗаполнитьСубконтоКУПеня()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ОплатаКУСписокЛС.СубконтоКУ1,
	|	бит_ОплатаКУСписокЛС.СубконтоКУ2
	|ПОМЕСТИТЬ ВсеСубконтоКУ
	|ИЗ
	|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
	|ГДЕ
	|	бит_ОплатаКУСписокЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_ОплатаКУСписокЛС.Ссылка = &ОплатаКУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты
	|ПОМЕСТИТЬ ВТ_ТранзитныйСч
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Момент, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСубконтоКУ.СубконтоКУ1,
	|	ВсеСубконтоКУ.СубконтоКУ2,
	|	ВТ_ТранзитныйСч.ТранзитныйСчетОплаты
	|ИЗ
	|	ВсеСубконтоКУ КАК ВсеСубконтоКУ,
	|	ВТ_ТранзитныйСч КАК ВТ_ТранзитныйСч";
	
	ДатаЗаполнения = ?(ЗначениеЗаполнено(Дата), КонецМесяца(Дата), ТекущаяДата());
	
	Запрос.УстановитьПараметр("Момент",		  ДатаЗаполнения);
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет",  ЛицевойСчет);
	Запрос.УстановитьПараметр("ОплатаКУ",	  ОплатаКУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СоответствиеСубконтоКУ = Новый Соответствие;
	Если Выборка.Следующий() Тогда
		Для Каждого Стр Из СписокУслугПеня Цикл
			Стр.СчетКУ      = Выборка.ТранзитныйСчетОплаты;
			Стр.СубконтоКУ1 = Выборка.СубконтоКУ1;
			Стр.СубконтоКУ2 = Выборка.СубконтоКУ2;
			Стр.СубконтоКУ3 = Неопределено;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьСубконтоКУ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ОплатаКУСписокЛС.СубконтоКУ1,
	|	бит_ОплатаКУСписокЛС.СубконтоКУ2
	|ПОМЕСТИТЬ ВсеСубконтоКУ
	|ИЗ
	|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
	|ГДЕ
	|	бит_ОплатаКУСписокЛС.ЛицевойСчет = &ЛицевойСчет
	|	И бит_ОплатаКУСписокЛС.Ссылка = &ОплатаКУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты
	|ПОМЕСТИТЬ ВТ_ТранзитныйСч
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Момент, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСубконтоКУ.СубконтоКУ1,
	|	ВсеСубконтоКУ.СубконтоКУ2,
	|	ВТ_ТранзитныйСч.ТранзитныйСчетОплаты
	|ИЗ
	|	ВсеСубконтоКУ КАК ВсеСубконтоКУ,
	|	ВТ_ТранзитныйСч КАК ВТ_ТранзитныйСч";
	
	ДатаЗаполнения = ?(ЗначениеЗаполнено(Дата), КонецМесяца(Дата), ТекущаяДата());
	
	Запрос.УстановитьПараметр("Момент",		  ДатаЗаполнения);
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет",  ЛицевойСчет);
	Запрос.УстановитьПараметр("ОплатаКУ",	  ОплатаКУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СоответствиеСубконтоКУ = Новый Соответствие;
	Если Выборка.Следующий() Тогда
		Для Каждого Стр Из СписокУслуг Цикл
			Стр.СчетКУ      = Выборка.ТранзитныйСчетОплаты;
			Стр.СубконтоКУ1 = Выборка.СубконтоКУ1;
			Стр.СубконтоКУ2 = Выборка.СубконтоКУ2;
			Стр.СубконтоКУ3 = Неопределено;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Выполняет расчет начислений общедомовых расходов.
//
Процедура РачитатьОбщедомовыеРасходы() Экспорт
	
	ЛицевыеСчета.Очистить();
	
	ОбновитьНастройкиЖКХ();
	
	
	Если мГрафаНачисления Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для организации: " + Организация +" начисления общедомовых расходов ведутся в графе начисления.");
		
		Возврат;
		
	КонецЕсли; 
	
	ТаблицаОбщедомовыеНачисления = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуОбщедомовыхРасходов();
	
	бит_РасчетыПоКоммунальнымУслугам.РасчитатьНачисленияПоОбщедомовымРасходам(КонецДня(Дата)
	,НачПериода
	,КонПериода
	,Организация
	,ТаблицаОбщедомовыеНачисления
	,мУчитыватьНачисленияПоГрупповымСчетчикам
	,мУчитыватьПерерасчет);
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаОбщедомовыеНачисления);
	
	СписокЛС = ТаблицаОбщедомовыеНачисления.ВыгрузитьКолонку("ЛицевойСчет");
	Колонки  = ТаблицаОбщедомовыеНачисления.Колонки;
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТаблицаОбщедомовыеНачисления, Колонки, СписокЛС, Организация , Дата);
	
	Для каждого СтрокаТаблицы Из ТаблицаОбщедомовыеНачисления Цикл
		
		НоваяСтрока = ЛицевыеСчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Сумма = СтрокаТаблицы.Начислено;
		НоваяСтрока.Объем = ОКР(?(СтрокаТаблицы.Тариф = 0, 0 ,НоваяСтрока.Сумма/СтрокаТаблицы.Тариф),4);
		
	КонецЦикла; 
	
	РассчитатьОбъем(ТаблицаОбщедомовыеНачисления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры:: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ОбязательныеРеквизитыШапки = "Организация"+ ?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПоГрупповымСчетчикамСНаличиемИндивидуальных
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое 
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое
	// БИТ ЖКХ 10.03.2020
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
	// БИТ ЖКХ 12.03.2020
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов
	//Михайлов
	Или ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавки
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребленияГрупповое
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки
	//Конец работ
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое 
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков,"", ",ЛицевойСчет");
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ Тогда
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ",ЧекККМ";
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты ТОгда
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ",ОплатаКУ";
	КонецЕсли; 
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН Тогда
		ОбязательныеРеквизитыШапки = "Организация"; //Дорошенко А.Ю 22.02.2023
	КонецЕсли;
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	БылОтказ = Отказ;
	РеквизитыТабСписокУслуг = "Услуга"
	+?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое 
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое
	// БИТ ЖКХ 10.03.2020
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
	// БИТ ЖКХ 10.03.2020
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков,",ЛицевойСчет",""); // Через запятую.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокУслуг", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
	//18.07.2019
	Если УдалятьСтрокиСПустойСуммой = истина Тогда
		УдалитьСтроки();
	конецесли;
	
	Если Отказ Тогда
		
		Отказ = БылОтказ;
		Если УдалятьСтрокиСПустойСуммой = истина Тогда
		 УдалитьСтроки();	
		 бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Строки с пустыми реквизитами удалены");
		конецесли; 
				
	КонецЕсли; 
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧСумма(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	БылОтказ = Отказ;
	Для Каждого ТекСтр из СписокУслуг Цикл
		
		Если ТекСтр.Сумма = 0 И ТекСтр.СуммаПени = 0 Тогда
			
			Отказ = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	//18.07.2019
	Если УдалятьСтрокиСПустойСуммой = истина Тогда
		УдалитьСтроки();
	конецесли;
	
	Если Отказ Тогда
		
		Отказ = БылОтказ;
		Если УдалятьСтрокиСПустойСуммой = истина Тогда
		 УдалитьСтроки();	
		 бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Строки с пустой суммой удалены");
		конецесли; 		
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура Выполняет удаление строк с пустыми значенияями.
Процедура УдалитьСтроки()
	
	КолвоЭлементов = СписокУслуг.Количество();
	
	Для ОбратныйИндекс = 1  По КолвоЭлементов Цикл
		
		Строка = СписокУслуг[КолвоЭлементов - ОбратныйИндекс];
		
		Если (НЕ ЗначениеЗаполнено(Строка.Сумма) И НЕ ЗначениеЗаполнено(Строка.СуммаПени)) ИЛИ (Строка.Сумма = 0 И Строка.СуммаПени = 0) ИЛИ НЕ ЗначениеЗаполнено(Строка.Услуга) Тогда	
			
			СписокУслуг.Удалить(Строка);
			
		ИначеЕсли (ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое  
			ИЛИ	ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое 
			// БИТ ЖКХ 10.03.2020
			ИЛИ	ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды 
			ИЛИ	ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
			ИЛИ	ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое
			ИЛИ	ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН) 
			И (НЕ ЗначениеЗаполнено(Строка.ЛицевойСчет)) Тогда
			
			СписокУслуг.Удалить(Строка);
			
		КонецЕсли; 
		
	КонецЦикла; 	
	
КонецПроцедуры

// Процедура проверяет добли строк.
//
Процедура ПроверитьДублиУслуг(ТаблицаПоУслугам, Отказ, Заголовок)
	
	ТаблицаДублей = ТаблицаПоУслугам.Скопировать();
	
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1, "КоличествоПовторений");
	ТаблицаДублей.Свернуть(?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое 
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое
	// БИТ ЖКХ 10.03.2020
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
	// БИТ ЖКХ 10.03.2020
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов
	//Михайлов
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавки
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребленияГрупповое
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки
	// Конец работ
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков,"ЛицевойСчет,","")+"Услуга", "КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке. 
	
	Если ВидОперации <> Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН Тогда
		
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // Повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			МассивСтрок = ТаблицаПоУслугам.НайтиСтроки(?(ТаблицаПоУслугам.Колонки.Найти("ЛицевойСчет") = Неопределено
			,Новый Структура("Услуга", СтрокаТаблицыДублей.Услуга)
			,Новый Структура("ЛицевойСчет,Услуга", СтрокаТаблицыДублей.ЛицевойСчет,СтрокаТаблицыДублей.Услуга )));
			
			//Если Объект.ВидОперации
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			
			ТекстСообщенияОбОшибке = ?(ТаблицаПоУслугам.Колонки.Найти("ЛицевойСчет") = Неопределено
			,ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""Услуга"" указаны одни и те же."
			,ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""Лицевой счет"" указаны одни и те же.");
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет добли строк.
//
Процедура ПроверитьДублиЛС(ТаблицаПоЛС, Отказ, Заголовок)
	
	ТаблицаДублей = ТаблицаПоЛС.Скопировать();
	
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1, "КоличествоПовторений");
	ТаблицаДублей.Свернуть(?(ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПоГрупповымСчетчикамСНаличиемИндивидуальных 
	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков,
	"Услуга, Счетчик,","")+"ЛицевойСчет", "КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке.
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		// ТаблицаПоЦБ.Индексы.Добавить("Контрагент");.
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПоГрупповымСчетчикамСНаличиемИндивидуальных 
				ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков  Тогда
				
				МассивСтрок = ТаблицаПоЛС.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга, Счетчик", 
				СтрокаТаблицыДублей.ЛицевойСчет,
				СтрокаТаблицыДублей.Услуга,
				СтрокаТаблицыДублей.Счетчик ));
			Иначе
				
				МассивСтрок = ТаблицаПоЛС.НайтиСтроки(Новый Структура("ЛицевойСчет", СтрокаТаблицыДублей.ЛицевойСчет));
				
			КонецЕсли; 
			
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""ЛицевойСчет"" указаны одни и те же.";
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоЛС,Отказ, Заголовок)
	
	ДатаДока = Дата;
	НачислениеПоУсл = Движения.бит_НачисленияПоУслугамЖКХ;
	
	ОбъемПоУслугам      = Движения.бит_ОбъемыПоУслугамЖКХ;
	
	НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;
	
	ТаблицаРасчетаНДС = Новый ТаблицаЗначений;
	Колонки = ТаблицаРасчетаНДС.Колонки;
	Колонки.Добавить("Номенклатура",	);
	Колонки.Добавить("СуммаНачислений",	ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Колонки.Добавить("СуммаБезНДС",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков Тогда
		
		Для каждого СтрокаТЧ Из ТаблицаПоЛС Цикл
			
			мСумма = 0;
			Движение = НачислениеПоУсл.Добавить();
			Движение.Период = ДатаДока;
			
			Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
			
			Если СтрокаТЧ.Сумма > 0 Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				мСумма = СтрокаТЧ.Сумма;
			ИначеЕсли СтрокаТЧ.Сумма < 0 Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				мСумма = - СтрокаТЧ.Сумма;
			КонецЕсли; 
			
			Движение.Сумма       = мСумма;
			
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			
			ДвижениеУслПоПериоду					  = НачислениеПоУслПоПериоду.Добавить();
			ДвижениеУслПоПериоду.Период				  = ДатаДока;
			ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
			ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
			Если СтрокаТЧ.Сумма > 0 Тогда
				ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока); 
				ДвижениеУслПоПериоду.ВидДвижения		  = ВидДвиженияНакопления.Приход;
				мСумма = СтрокаТЧ.Сумма;
			ИначеЕсли СтрокаТЧ.Сумма < 0 Тогда
				ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока); 
				ДвижениеУслПоПериоду.ВидДвижения	      = ВидДвиженияНакопления.Расход;
				//ДвижениеУслПоПериоду.ВидНачисления	  = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс; 
				мСумма = - СтрокаТЧ.Сумма;
			КонецЕсли; 
			ДвижениеУслПоПериоду.Сумма				  = мСумма;
			
			ДвижениеОбъем = ОбъемПоУслугам.Добавить();
			ДвижениеОбъем.Период      = ДатаДока;
			ДвижениеОбъем.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
			ДвижениеОбъем.Объем       = СтрокаТЧ.Объем;
			
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда
				Если СтрокаТЧ.Сумма < 0 и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД и НЕ СторноПоСчетам тогда
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетДт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = мСумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
					
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
					конецесли;     
					
				ИначеЕсли СтрокаТЧ.Сумма < 0 и (СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					или СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД)  Тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Сумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
					
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
					конецесли; 

					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
					
				Иначе 
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Сумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
					
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				    конецесли;     
				  
					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли;
			
			Движение = Движения.бит_КолЕдПоСчетчикам.Добавить();
			
			Движение.Период = ДатаДока;
			Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
			Движение.Счетчик     = СтрокаТЧ.Счетчик;
			
			Движение.КоличествоЕдиницПоЛС =  СтрокаТЧ.КоличествоЕдиниц;
			
			// Движение по регистру накопления бит_КолЕдиницПоСчетчикам.
			ДвижениеЕд = Движения.бит_КолЕдиницПоСчетчикам.Добавить();
			ДвижениеЕд.Период = ДатаДока;
			ДвижениеЕд.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеЕд.УслугаЖКХ   = СтрокаТЧ.Услуга;
			ДвижениеЕд.Счетчик     = СтрокаТЧ.Счетчик;
			ДвижениеЕд.КоличествоЕдиницПоЛС =  СтрокаТЧ.КоличествоЕдиниц;
			
		КонецЦикла; 
		
	Иначе
		
		Для каждого СтрокаТЧ Из ТаблицаПоЛС Цикл
			
			//19.07.2019
			//ДвижениеОбъем = ОбъемПоУслугам.Добавить();
			//ДвижениеОбъем.Период      = ДатаДока;
			//ДвижениеОбъем.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			//ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
			//ДвижениеОбъем.Объем       = СтрокаТЧ.Объем;
			
			// БИТ ЖКХ 30.09.2020
			мСумма = 0;
			Если СтрокаТЧ.Сумма = 0 и УдалятьСтрокиСПустойСуммой = Истина Тогда
				Продолжить;
			КонецЕсли; 
			
			Движение = НачислениеПоУсл.Добавить();
			
			Если  СтрокаТЧ.Сумма < 0 Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				мСумма = - СтрокаТЧ.Сумма;
			ИначеЕсли СтрокаТЧ.Сумма > 0 Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				мСумма =  СтрокаТЧ.Сумма;
			КонецЕсли;
			
			//19.07.2019
			ДвижениеОбъем = ОбъемПоУслугам.Добавить();
			ДвижениеОбъем.Период      = ДатаДока;
			ДвижениеОбъем.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
			ДвижениеОбъем.Объем       = СтрокаТЧ.Объем;
			
			Движение.Период = ДатаДока;
			Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
			Движение.Сумма       = мСумма;
			
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			
			ДвижениеУслПоПериоду					  = НачислениеПоУслПоПериоду.Добавить();
			ДвижениеУслПоПериоду.Период				  = ДатаДока;
			ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
			ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
			Если СтрокаТЧ.Сумма < 0 Тогда
				ДвижениеУслПоПериоду.ВидДвижения	      = ВидДвиженияНакопления.Расход;
				ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока); 
				//ДвижениеУслПоПериоду.ВидНачисления	  = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс; 
				мСумма = - СтрокаТЧ.Сумма;
			ИначеЕсли СтрокаТЧ.Сумма > 0 Тогда
				ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока); 
				ДвижениеУслПоПериоду.ВидДвижения		  = ВидДвиженияНакопления.Приход;
				мСумма =  СтрокаТЧ.Сумма;
			КонецЕсли;
			ДвижениеУслПоПериоду.Сумма				  = мСумма;
			
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда  			 			

				Если СтрокаТЧ.Сумма < 0 и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД и НЕ СторноПоСчетам тогда
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетДт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = мСумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
					
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				    конецесли;     
				  
				ИначеЕсли СтрокаТЧ.Сумма < 0 и (СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					или СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД)  Тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Сумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
					
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				    конецесли;     
				  
					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
					
				Иначе 
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Сумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
					
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				    конецесли;     
				  
					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 		
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли; 
	
	// Показания счетчиков.
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПоГрупповымСчетчикамСНаличиемИндивидуальных Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка"        ,Ссылка);
		Запрос.УстановитьПараметр("КонецПериода"  ,КонецДня(КонПериода));
		Запрос.УстановитьПараметр("НачалоПериода" ,НачПериода);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Счетчик,
		|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	Документ.бит_РазовыеПоУслугамЖКХ.ЛицевыеСчета КАК бит_РазовыеПоУслугамЖКХЛицевыеСчета
		|ГДЕ
		|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Счетчик,
		|	бит_РазовыеПоУслугамЖКХЛицевыеСчета.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказанияОстаткиИОбороты.Объект,
		|	ПоказанияОстаткиИОбороты.Услуга,
		|	ПоказанияОстаткиИОбороты.Счетчик,
		|	ПоказанияОстаткиИОбороты.ОтПоказаний,
		|	ПоказанияОстаткиИОбороты.ДоПоказаний,
		|	ПоказанияОстаткиИОбороты.ИсточникПоказаний,
		|	ПоказанияОстатки.ПоследниеПоказанияОстаток КАК ПоследниеПоказания,
		|	ПоказанияОстатки.ТекущиеПоказанияИнспектораОстаток КАК ТекущиеПоказанияИнспектора,
		|	ПоказанияОстатки.ТекущиеПоказанияНаселенияОстаток КАК ТекущиеПоказанияНаселения,
		|	ПоказанияОстатки.ПоказанияПодкруткаОстаток КАК ПоказанияПодкрутка,
		|	ПоказанияОстатки.КоэффициентОстаток КАК Коэффициент,
		|	ПоказанияОстатки.Услуга КАК УслугаРасход,
		|	ПоказанияОстатки.Объект КАК ОбъектРасход,
		|	ПоказанияОстатки.Счетчик КАК СчетчикРасход
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		бит_ПоказанияСчетчиковОстаткиИОбороты.Услуга КАК Услуга,
		|		бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик КАК Счетчик,
		|		ЕСТЬNULL(ВЫБОР
		|				КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток, 0) = ЕСТЬNULL(ВЫБОР
		|							КОГДА ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|									ИНАЧЕ ВЫБОР
		|											КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток <> 0
		|												ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|											ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|										КОНЕЦ
		|								КОНЕЦ > ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|									ИНАЧЕ ВЫБОР
		|											КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток <> 0
		|												ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|											ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|										КОНЕЦ
		|								КОНЕЦ
		|								ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|							ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|						КОНЕЦ, 0)
		|					ТОГДА 0
		|				ИНАЧЕ ЕСТЬNULL(ВЫБОР
		|							КОГДА ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|									ИНАЧЕ ВЫБОР
		|											КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток <> 0
		|												ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|											ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|										КОНЕЦ
		|								КОНЕЦ > ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|									ИНАЧЕ ВЫБОР
		|											КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток <> 0
		|												ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|											ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|										КОНЕЦ
		|								КОНЕЦ
		|								ТОГДА ВЫБОР
		|										КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|											ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|										ИНАЧЕ ВЫБОР
		|												КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток <> 0
		|													ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток + 1
		|												ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|											КОНЕЦ
		|									КОНЕЦ
		|							ИНАЧЕ ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|									ИНАЧЕ ВЫБОР
		|											КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток <> 0
		|												ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток + 1
		|											ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ, 0)
		|			КОНЕЦ, 0) * бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.КоэффициентУмножения КАК КоличествоЕдиниц,
		|		ЕСТЬNULL(бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток, 0) КАК ОтПоказаний,
		|		ЕСТЬNULL(ВЫБОР
		|				КОГДА ВЫБОР
		|						КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|							ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|						ИНАЧЕ ВЫБОР
		|								КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток <> 0
		|									ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|								ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|							КОНЕЦ
		|					КОНЕЦ > ВЫБОР
		|						КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|							ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|						ИНАЧЕ ВЫБОР
		|								КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток <> 0
		|									ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|								ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|							КОНЕЦ
		|					КОНЕЦ
		|					ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВЫБОР
		|								КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|									ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|								ИНАЧЕ ВЫБОР
		|										КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток <> 0
		|											ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|										ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|									КОНЕЦ
		|							КОНЕЦ = ВЫБОР
		|								КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|									ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|								ИНАЧЕ ВЫБОР
		|										КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток <> 0
		|											ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|										ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|									КОНЕЦ
		|							КОНЕЦ
		|							ТОГДА ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток = бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|									ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|								КОНЕЦ
		|						ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|					КОНЕЦ
		|			КОНЕЦ, 0) КАК ДоПоказаний,
		|		ВЫБОР
		|			КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораОборот = 0
		|				ТОГДА 0
		|			ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|		КОНЕЦ КАК ПоказанияИнспектора,
		|		ВЫБОР
		|			КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияОборот = 0
		|				ТОГДА 0
		|			ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|		КОНЕЦ КАК ПоказанияНаселения,
		|		ВЫБОР
		|			КОГДА ВЫБОР
		|					КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|						ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|					ИНАЧЕ ВЫБОР
		|							КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток <> 0
		|								ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|							ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|						КОНЕЦ
		|				КОНЕЦ > ВЫБОР
		|					КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|						ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|					ИНАЧЕ ВЫБОР
		|							КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток <> 0
		|								ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|							ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|						КОНЕЦ
		|				КОНЕЦ
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Инспектор)
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВЫБОР
		|							КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|								ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|							ИНАЧЕ ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток <> 0
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|									ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток
		|								КОНЕЦ
		|						КОНЕЦ = ВЫБОР
		|							КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток >= 0
		|								ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|							ИНАЧЕ ВЫБОР
		|									КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток <> 0
		|										ТОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток + бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|									ИНАЧЕ бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияНаселенияКонечныйОстаток
		|								КОНЕЦ
		|						КОНЕЦ
		|						ТОГДА ВЫБОР
		|								КОГДА бит_ПоказанияСчетчиковОстаткиИОбороты.ТекущиеПоказанияИнспектораКонечныйОстаток = бит_ПоказанияСчетчиковОстаткиИОбороты.ПоследниеПоказанияКонечныйОстаток
		|									ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Инспектор)
		|								ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
		|							КОНЕЦ
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
		|				КОНЕЦ
		|		КОНЕЦ КАК ИсточникПоказаний,
		|		бит_ПоказанияСчетчиковОстаткиИОбороты.Объект КАК Объект
		|	ИЗ
		|		РегистрНакопления.бит_ПоказанияСчетчиков.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				,
		|				,
		|				Счетчик В
		|						(ВЫБРАТЬ
		|							Счетчики.Счетчик КАК Счетчик
		|						ИЗ
		|							Счетчики КАК Счетчики)
		|					И Услуга В
		|						(ВЫБРАТЬ
		|							Счетчики.Услуга КАК Услуга
		|						ИЗ
		|							Счетчики КАК Счетчики)) КАК бит_ПоказанияСчетчиковОстаткиИОбороты) КАК ПоказанияОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчик,
		|			бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
		|			СУММА(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток) КАК ПоследниеПоказанияОстаток,
		|			СУММА(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток) КАК ТекущиеПоказанияИнспектораОстаток,
		|			СУММА(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток) КАК ТекущиеПоказанияНаселенияОстаток,
		|			СУММА(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток) КАК ПоказанияПодкруткаОстаток,
		|			бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток КАК КоэффициентОстаток,
		|			бит_ПоказанияСчетчиковОстатки.Объект КАК Объект
		|		ИЗ
		|			РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
		|					&КонецПериода,
		|					Счетчик В
		|							(ВЫБРАТЬ
		|								Счетчики.Счетчик КАК Счетчик
		|							ИЗ
		|								Счетчики КАК Счетчики)
		|						И Услуга В
		|							(ВЫБРАТЬ
		|								Счетчики.Услуга КАК Услуга
		|							ИЗ
		|								Счетчики КАК Счетчики)) КАК бит_ПоказанияСчетчиковОстатки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_ПоказанияСчетчиковОстатки.Счетчик,
		|			бит_ПоказанияСчетчиковОстатки.Услуга,
		|			бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток,
		|			бит_ПоказанияСчетчиковОстатки.Объект) КАК ПоказанияОстатки
		|		ПО ПоказанияОстаткиИОбороты.Услуга = ПоказанияОстатки.Услуга
		|			И ПоказанияОстаткиИОбороты.Счетчик = ПоказанияОстатки.Счетчик
		|			И ПоказанияОстаткиИОбороты.Объект = ПоказанияОстатки.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счетчики";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если  Выборка.УслугаРасход <> Null тогда
				Движение = Движения.бит_ПоказанияСчетчиков.ДобавитьРасход();
				Движение.Период                     = Дата;
				Движение.Регистратор                = Ссылка;
				Движение.Объект                     = Выборка.ОбъектРасход;
				Движение.Услуга                     = Выборка.УслугаРасход;
				Движение.Счетчик                    = Выборка.СчетчикРасход;
				Движение.Коэффициент                = Выборка.Коэффициент;
				Движение.ПоследниеПоказания         = Выборка.ПоследниеПоказания;
				Движение.ТекущиеПоказанияИнспектора = Выборка.ТекущиеПоказанияИнспектора;
				Движение.ТекущиеПоказанияНаселения  = Выборка.ТекущиеПоказанияНаселения;
				Движение.ТекущиеПоказанияИнспектора = Выборка.ТекущиеПоказанияИнспектора;
				Движение.ТекущиеПоказанияНаселения  = Выборка.ТекущиеПоказанияНаселения;
				Если Выборка.ИсточникПОказаний = Перечисления.бит_ИсточникПоказаний.Подкрутка Тогда
					Движение.ПоказанияПодкрутка = Выборка.ДоПоказаний;
				КонецЕсли;
				
				Движение.ПоказанияПодкрутка         = Выборка.ПоказанияПодкрутка;
				
				Движение.Организация   = СтруктураШапкиДокумента.Организация;
				
			КонецЕсли;
			
			Движение = Движения.бит_ПоказанияСчетчиков.ДобавитьПриход();
			Движение.Период             = Дата;
			Движение.Регистратор        = Ссылка;
			Движение.Объект             = Выборка.Объект;
			Движение.Услуга             = Выборка.Услуга;
			Движение.Счетчик            = Выборка.Счетчик;
			Движение.Коэффициент        = Выборка.Счетчик.КоэффициентУмножения;
			Движение.ПоследниеПоказания = Выборка.ДоПоказаний;
			Если Выборка.ИсточникПоказаний = Перечисления.бит_ИсточникПоказаний.Инспектор Тогда
				Движение.ТекущиеПоказанияИнспектора = Выборка.ДоПоказаний;
			ИначеЕсли  Выборка.ИсточникПоказаний = Перечисления.бит_ИсточникПоказаний.Население Тогда
				Движение.ТекущиеПоказанияНаселения = Выборка.ДоПоказаний;
			ИначеЕсли Выборка.ИсточникПОказаний = Перечисления.бит_ИсточникПоказаний.Подкрутка Тогда
				Движение.ПоказанияПодкрутка = Выборка.ДоПоказаний;
			КонецЕсли;
			
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			
			// Регистр сведений "Источники показаний".
			ДвижениеИсточник = Движения.бит_ИсточникиПоказанийСчетчика.Добавить();
			ДвижениеИсточник.Период      = Дата;
			ДвижениеИсточник.Регистратор = Ссылка;
			ДвижениеИсточник.Объект      = Выборка.Объект;
			ДвижениеИсточник.Счетчик     = Выборка.Счетчик;
			ДвижениеИсточник.Услуга      = Выборка.Услуга;
			ДвижениеИсточник.Источник    = Выборка.ИсточникПоказаний; 
			ДвижениеИсточник.Показания   = Выборка.ДоПоказаний;
			
		КонецЦикла; 
		
		Для каждого Строка Из ЛицевыеСчета Цикл
			
			Движение = Движения.бит_КолЕдПоСчетчикам.Добавить();
			
			Движение.Период = ДатаДока;
			Движение.ЛицевойСчет = Строка.ЛицевойСчет;
			Движение.УслугаЖКХ   = Строка.Услуга;
			Движение.Счетчик     = Строка.Счетчик;
			
			Движение.КоличествоЕдиницПоЛС =  Строка.КоличествоЕдиниц;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ТаблицаРасчетаНДС.Очистить();
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл		
		
		//19.07.2019
		//ДвижениеОбъем = ОбъемПоУслугам.Добавить();
		//ДвижениеОбъем.Период      = ДатаДока;   		
		//ДвижениеОбъем.ЛицевойСчет = ?(ЗначениеЗаполнено(ЛицевойСчет),ЛицевойСчет,СтрокаТЧ.ЛицевойСчет);		
		//ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
		//ДвижениеОбъем.Объем       = СтрокаТЧ.Объем;
		
		Если СтрокаТЧ.Сумма = 0 и УдалятьСтрокиСПустойСуммой = Истина Тогда
			Продолжить;
		КонецЕсли; 
		
		Движение = НачислениеПоУсл.Добавить();
		Если СтрокаТЧ.Сумма < 0 тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			мСумма = - СтрокаТЧ.Сумма;
		иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			мСумма =  СтрокаТЧ.Сумма;
		КонецЕсли;	
		
		// БИТ ЖКХ 25.12.2020
		Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировкаПени Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			мСумма = СтрокаТЧ.Сумма;
		КонецЕсли;	 	
		
		//19.07.2019
		ДвижениеОбъем = ОбъемПоУслугам.Добавить();
		ДвижениеОбъем.Период      = ДатаДока;   		
		ДвижениеОбъем.ЛицевойСчет = ?(ЗначениеЗаполнено(ЛицевойСчет),ЛицевойСчет,СтрокаТЧ.ЛицевойСчет);		
		ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
		ДвижениеОбъем.Объем       = СтрокаТЧ.Объем;
		
		Движение.Период      = ДатаДока;
		Движение.ЛицевойСчет = ?(ЗначениеЗаполнено(ЛицевойСчет) 
		И (НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое 
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое
		// БИТ ЖКХ 10.03.2020
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН)
		,СтруктураШапкиДокумента.ЛицевойСчет,СтрокаТЧ.ЛицевойСчет);
		Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
		Движение.Сумма       = мСумма;
		
		Движение.Организация   = СтруктураШапкиДокумента.Организация;
		
		ДвижениеУслПоПериоду					  = НачислениеПоУслПоПериоду.Добавить();
		ДвижениеУслПоПериоду.Период				  = ДатаДока;
		ДвижениеУслПоПериоду.ЛицевойСчет = ?(ЗначениеЗаполнено(ЛицевойСчет) 
		И (НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое 
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое
		// БИТ ЖКХ 10.03.2020
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое
		ИЛИ НЕ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН)
		,СтруктураШапкиДокумента.ЛицевойСчет,СтрокаТЧ.ЛицевойСчет);
		ДвижениеУслПоПериоду.УслугаЖКХ   = СтрокаТЧ.Услуга;
		ДвижениеУслПоПериоду.Организация = СтруктураШапкиДокумента.Организация;
		Если СтрокаТЧ.Сумма < 0 тогда
			ДвижениеУслПоПериоду.ВидДвижения	      = ВидДвиженияНакопления.Расход;   
			ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока); 
			//ДвижениеУслПоПериоду.ВидНачисления	= Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс; 
			мСумма = - СтрокаТЧ.Сумма;
		иначе
			ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока); 
			ДвижениеУслПоПериоду.ВидДвижения		  = ВидДвиженияНакопления.Приход;
			мСумма = СтрокаТЧ.Сумма;
		КонецЕсли;	
		ДвижениеУслПоПериоду.Сумма       = мСумма;
		
		Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда  			 			
			Если СтрокаТЧ.Сумма < 0 и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
				и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД и НЕ СторноПоСчетам тогда
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Разовые по ЛС";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетДт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);	
				Проводка.Сумма = мСумма;
				
				//10.04.2019
				если Проводка.СчетДт.Количественный = Истина тогда 
				  Проводка.КоличествоДт = СтрокаТЧ.Объем;
				конецесли; 
					
				если Проводка.СчетКт.Количественный = Истина тогда 
				  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				конецесли;     
				  
			ИначеЕсли СтрокаТЧ.Сумма < 0 и (СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
				или СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД)  Тогда
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Разовые по ЛС";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
				Проводка.Сумма = СтрокаТЧ.Сумма;
				
				//10.04.2019
				если Проводка.СчетДт.Количественный = Истина тогда 
				  Проводка.КоличествоДт = СтрокаТЧ.Объем;
				конецесли; 
					
				если Проводка.СчетКт.Количественный = Истина тогда 
				  Проводка.КоличествоКт = СтрокаТЧ.Объем;
			    конецесли;     
			  
				Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
					Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
						НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
						Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
					КонецЕсли;
				КонецЕсли;
				
			Иначе 
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Разовые по ЛС";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
				Проводка.Сумма = СтрокаТЧ.Сумма;
				//10.04.2019
				если Проводка.СчетДт.Количественный = Истина тогда 
				  Проводка.КоличествоДт = СтрокаТЧ.Объем;
				конецесли; 				
				
				// БИТ ЖКХ 21.09.2020
				ЛС = Проводка.СубконтоДт.ЛицевыеСчета; 
				// БИТ ЖКХ 17.07.2020
				если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "ЛицевойСчет") = истина тогда
				  ЛС = СтрокаТЧ.ЛицевойСчет;	
				конецесли;	 
				
				Проводка.Сумма = Проводка.Сумма + ПеняПоУслугеНаЛС( ЛС, СтрокаТЧ.Услуга, Проводка.СчетКт);
				
				если Проводка.СчетКт.Количественный = Истина тогда 
				  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				конецесли;     
				Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
					Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
						НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
						Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 		
		КонецЕсли;	
		
	КонецЦикла;
	
	// БИТ ЖКХ 20.07.2020
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты Тогда
				// БИТ ЖКХ 17.07.2020
		Для каждого СтрокаТЧ Из мТаблицаПоУслугамПеня Цикл			
				
			Если СтрокаТЧ.Подсчитано = истина или (СтрокаТЧ.Сумма = 0 и УдалятьСтрокиСПустойСуммой = Истина) Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СтрокаТЧ.Сумма < 0 тогда
				мСумма = - СтрокаТЧ.Сумма;
			иначе
				мСумма =  СтрокаТЧ.Сумма;
			КонецЕсли;				
						
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда  			 			
				Если СтрокаТЧ.Сумма < 0 и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД и НЕ СторноПоСчетам тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетДт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = мСумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
						
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
					конецесли;     
					  
				ИначеЕсли СтрокаТЧ.Сумма < 0 и (СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					или СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД)  Тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Сумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
						
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				    конецесли;     
				  
					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
					
				Иначе 
					// second try
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Сумма;
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 					
					
					// БИТ ЖКХ 21.09.2020
					ЛС = Проводка.СубконтоДт.ЛицевыеСчета; 
					// БИТ ЖКХ 17.07.2020
					если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "ЛицевойСчет") = истина тогда
					  ЛС = СтрокаТЧ.ЛицевойСчет;	
					конецесли;
					// БИТ ЖКХ 17.07.2020
					Проводка.Сумма = Проводка.Сумма + ПеняПоУслугеНаЛС(СтрокаТЧ.ЛицевойСчет, СтрокаТЧ.Услуга, Проводка.СчетКт);
					
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
					конецесли;     
					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 		
			КонецЕсли;	
		
	  КонецЦикла;

	КонецЕсли;			

	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты Тогда
		
		НачисленияПени = Движения.бит_НачислениеПениПоУслугамЖКХ;
		
	//	Для каждого Строка Из ТаблицаПоУслугам Цикл
	    Для каждого Строка Из мТаблицаПоУслугамПеня Цикл
			
			Если Строка.СуммаПени <> 0 Тогда
				
				Движение = НачисленияПени.Добавить();
				
				СуммаПени = ?(Строка.СуммаПени > 0, Строка.СуммаПени, -Строка.СуммаПени);
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.ЛицевойСчет = Строка.ЛицевойСчет;
				Движение.УслугаЖКХ   = Строка.Услуга;
				Движение.СуммаПени   = СуммаПени;
				Движение.Организация   = СтруктураШапкиДокумента.Организация;
				
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 
	
	// БИТ ЖКХ 14.07.2020
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировкаПени Тогда
		
		НачисленияПени = Движения.бит_НачислениеПениПоУслугамЖКХ;
		
		Для каждого Строка Из мТаблицаПоУслугамПеня Цикл
			
			Если Строка.СуммаПени <> 0 Тогда
				
				Движение = НачисленияПени.Добавить();
				
				// БИТ ЖКХ 28.12.2020
				СуммаПени = ?(Строка.СуммаПени > 0, Строка.СуммаПени, -Строка.СуммаПени);
				Движение.Период = Дата;
				
				если Строка.СуммаПени > 0 тогда 
				 Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				иначе 
				 Движение.ВидДвижения = ВидДвиженияНакопления.Расход;	
				конецесли;
				// БИТ ЖКХ 28.12.2020				
				// БИТ ЖКХ 27.01.2021
				Движение.ЛицевойСчет = ЭтотОбъект.ЛицевойСчет;//Строка.Субконто1;//Строка.ЛицевойСчет;
				Движение.УслугаЖКХ   = Строка.Услуга;
				Движение.СуммаПени   = СуммаПени;
				Движение.Организация   = СтруктураШапкиДокумента.Организация;
				
			КонецЕсли; 
		КонецЦикла; 
		
		// БИТ ЖКХ 17.07.2020
		Для каждого СтрокаТЧ Из мТаблицаПоУслугамПеня Цикл			
				
			Если СтрокаТЧ.Подсчитано = истина или (СтрокаТЧ.Сумма = 0 и УдалятьСтрокиСПустойСуммой = Истина) Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СтрокаТЧ.Сумма < 0 тогда
				мСумма = - СтрокаТЧ.Сумма;
			иначе
				мСумма =  СтрокаТЧ.Сумма;
			КонецЕсли;				
						
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда  			 			
				Если СтрокаТЧ.Сумма < 0 и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					и НЕ СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД и НЕ СторноПоСчетам тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетДт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = мСумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
						
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
					конецесли;     
					  
				ИначеЕсли СтрокаТЧ.Сумма < 0 и (СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
					или СтрокаТЧ.СчетКУ  = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД)  Тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Сумма;
					
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
						
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				    конецесли;     
				  
					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
					
				Иначе 
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Разовые по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;					
										
					Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетКт = СтрокаТЧ.СчетКУ;
					// БИТ ЖКХ 28.12.2020
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
										
//					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто3);
//					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);	
					
//					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
//					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
//					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	

					Проводка.Сумма = СтрокаТЧ.Сумма;
					//10.04.2019
					если Проводка.СчетДт.Количественный = Истина тогда 
					  Проводка.КоличествоДт = СтрокаТЧ.Объем;
					конецесли; 
					
					// БИТ ЖКХ 21.09.2020
					ЛС = Проводка.СубконтоДт.ЛицевыеСчета; 
					// БИТ ЖКХ 17.07.2020
					если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "ЛицевойСчет") = истина тогда
					  ЛС = СтрокаТЧ.ЛицевойСчет;	
					конецесли;
					// БИТ ЖКХ 17.07.2020
					Проводка.Сумма = Проводка.Сумма + ПеняПоУслугеНаЛС(СтрокаТЧ.ЛицевойСчет, СтрокаТЧ.Услуга, Проводка.СчетКт);					
										
					если Проводка.СчетКт.Количественный = Истина тогда 
					  Проводка.КоличествоКт = СтрокаТЧ.Объем;
					конецесли;     
					Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
						Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
							НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
							Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Сумма, НДС_Ставка);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 		
			КонецЕсли;	
		
	  КонецЦикла;

		
	КонецЕсли; 

	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Льгота,
		|	ТаблицаНачислений.ФизЛицо,
		|	ТаблицаНачислений.Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачислениеПоЛьготамОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачислениеПоЛьготамОбороты.Услуга КАК Услуга,
		|			бит_НачислениеПоЛьготамОбороты.Льгота КАК Льгота,
		|			бит_НачислениеПоЛьготамОбороты.ФизЛицо КАК ФизЛицо,
		|			ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.СуммаОборот, 0) КАК Сумма
		|		ИЗ
		|			РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(&НачПериода, &КонПериода, Месяц, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачислениеПоЛьготамОбороты) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.Услуга
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(ДокументОснование.НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(ДокументОснование.КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,ДокументОснование.СписокУслуг);
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = ДокументОснование.НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		ТаблицаСбора.Колонки.Добавить("Льгота"  ,Новый ОписаниеТипов("СправочникСсылка.бит_СписокЛьгот"));
		// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
		ТаблицаСбора.Колонки.Добавить("ФизЛицо" ,Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
				КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
				НоваяСтрока = ТаблицаСбора.Добавить();
				НоваяСтрока.Услуга  = Выборка.Услуга;
				НоваяСтрока.Льгота  = Выборка.Льгота;
				НоваяСтрока.ФизЛицо = Выборка.ФизЛицо;
				НоваяСтрока.Сумма   = Выборка.Сумма  *  ПроцентНеДопоставки/100 * КолвоДней/КолвоДнейВМесяце;
				НоваяСтрока.Объем       = Выборка.Объем;
				
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга,Льгота,ФизЛицо","Сумма");
		НачислениеПоЛьготам = Движения.бит_НачислениеПоЛьготам;
		
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл 
			
			Движение = НачислениеПоЛьготам.Добавить();
			Движение.Период       = ДатаДока;
			Движение.ЛицевойСчет  = СтруктураШапкиДокумента.ЛицевойСчет;
			Движение.Услуга       = ТекСтрока.Услуга;
			Движение.Льгота       = ТекСтрока.Льгота;
			Движение.ФизЛицо      = ТекСтрока.ФизЛицо;
			Движение.СуммаРазовых = ТекСтрока.Сумма;
			
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоОтсутствующим Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУслуг.Услуга
		|ПОМЕСТИТЬ СписокУслуг
		|ИЗ
		|	&СписокУслуг КАК СписокУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокУслуг.Услуга,
		|	ТаблицаНачислений.Льгота,
		|	ТаблицаНачислений.ФизЛицо,
		|	ТаблицаНачислений.Сумма
		|ИЗ
		|	СписокУслуг КАК СписокУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОНЕЦПЕРИОДА(бит_НачислениеПоЛьготамОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
		|			бит_НачислениеПоЛьготамОбороты.Услуга КАК Услуга,
		|			бит_НачислениеПоЛьготамОбороты.Льгота КАК Льгота,
		|			бит_НачислениеПоЛьготамОбороты.ФизЛицо КАК ФизЛицо,
		|			ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.СуммаОборот, 0) / ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.КоличествоНосителейОборот, 1) * ВЫБОР
		|				КОГДА &КолвоЧел > ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.КоличествоНосителейОборот, 1)
		|					ТОГДА ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.КоличествоНосителейОборот, 1)
		|				ИНАЧЕ &КолвоЧел
		|			КОНЕЦ КАК Сумма
		|		ИЗ
		|			РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(
		|					&НачПериода,
		|					&КонПериода,
		|					Месяц,
		|					ЛицевойСчет = &ЛицевойСчет
		|						И ФизЛицо В (&СписокФизлиц)) КАК бит_НачислениеПоЛьготамОбороты) КАК ТаблицаНачислений
		|		ПО СписокУслуг.Услуга = ТаблицаНачислений.Услуга
		|ИТОГИ ПО
		|	ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокУслуг";
		
		Запрос.УстановитьПараметр("НачПериода"            ,Новый Граница(НачалоМесяца(ДокументОснование.НачПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"            ,Новый Граница(КонецМесяца(ДокументОснование.КонПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет"           ,ЛицевойСчет);
		Запрос.УстановитьПараметр("СписокУслуг"           ,ДокументОснование.СписокУслуг);
		Запрос.УстановитьПараметр("СписокФизлиц"          ,ФизЛица.ВыгрузитьКолонку("ФизЛицо"));
		Запрос.УстановитьПараметр("КолвоЧел"              ,ДокументОснование.КолвоЧеловек);
		
		ВыборкаПоПериоду =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПериодНачисления");
		НачРасПериода = ДокументОснование.НачПериода;
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = СписокУслуг.ВыгрузитьКолонки();
		ТаблицаСбора.Колонки.Добавить("Льгота"  ,Новый ОписаниеТипов("СправочникСсылка.бит_СписокЛьгот"));
		// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
		ТаблицаСбора.Колонки.Добавить("ФизЛицо" ,Новый ОписаниеТипов("СправочникСсылка.бит_Проживающие"));
		Пока ВыборкаПоПериоду.Следующий()  Цикл 
			
			Выборка = ВыборкаПоПериоду.Выбрать();
			НачРасПериода = ?(Месяц(НачРасПериода) = Месяц(ВыборкаПоПериоду.ПериодНачисления),НачРасПериода , НачалоМесяца(ВыборкаПоПериоду.ПериодНачисления));
			
			Пока Выборка.Следующий()  Цикл 
				КолвоДней        = РазностьДатВДнях(?(НачалоДня(ВыборкаПоПериоду.ПериодНачисления)> НачалоДня(КонПериода),КонПериода,ВыборкаПоПериоду.ПериодНачисления),НачРасПериода);
				КолвоДнейВМесяце = РазностьДатВДнях(ВыборкаПоПериоду.ПериодНачисления,НачалоМесяца(НачРасПериода));
				НоваяСтрока = ТаблицаСбора.Добавить();
				НоваяСтрока.Услуга  = Выборка.Услуга;
				НоваяСтрока.Льгота  = Выборка.Льгота;
				НоваяСтрока.ФизЛицо = Выборка.ФизЛицо;
				НоваяСтрока.Сумма   = Выборка.Сумма  *  КолвоДней/КолвоДнейВМесяце;
				
				НоваяСтрока.Объем       = Выборка.Объем;
				
			КонецЦикла;
			
			НачРасПериода =  НачалоМесяца(ДобавитьМесяц(НачРасПериода ,1));
			
		КонецЦикла;
		
		ТаблицаСбора.Свернуть("Услуга,Льгота,ФизЛицо","Сумма");
		НачислениеПоЛьготам = Движения.бит_НачислениеПоЛьготам;
		
		Для Каждого ТекСтрока Из  ТаблицаСбора  Цикл 
			
			Движение = НачислениеПоЛьготам.Добавить();
			Движение.Период       = ДатаДока;
			Движение.ЛицевойСчет  = СтруктураШапкиДокумента.ЛицевойСчет;
			Движение.Услуга       = ТекСтрока.Услуга;
			Движение.Льгота       = ТекСтрока.Льгота;
			Движение.ФизЛицо      = ТекСтрока.ФизЛицо;
			Движение.СуммаРазовых = ТекСтрока.Сумма;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


Функция ПеняПоУслугеНаЛС (ЛС, Услуга, СчетКУ)
	
  СуммаПени = 0;	
  Отбор = Новый Структура;
  Отбор.Вставить("ЛицевойСчет", ЛС);
  Отбор.Вставить("Услуга", Услуга);
  Отбор.Вставить("СчетКУ", СчетКУ);

  // БИТ ЖКХ 17.07.2020
  если мТаблицаПоУслугамПеня.Количество() > 0 тогда
   СтрокиПени = мТаблицаПоУслугамПеня.НайтиСтроки(Отбор);
   Для Каждого Стр Из СтрокиПени Цикл
     СуммаПени = СуммаПени + Стр.СуммаПени;
	 Стр.Подсчитано  = истина;
   КонецЦикла;	  
  конецесли;
  
  возврат СуммаПени;
КонецФункции
#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое 
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое
		// БИТ ЖКХ 10.03.2020
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
		// БИТ ЖКХ 12.03.2020
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов
		//Михайлов
	    ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавки
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребленияГрупповое
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки
	    //Конец работ
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков	Тогда
		
		
		СтруктураПолей.Вставить("ЛицевойСчет" ,"ЛицевойСчет");
		
	КонецЕсли;
	
	СтруктураПолей.Вставить("Услуга" ,"Услуга");
	СтруктураПолей.Вставить("Сумма"  ,"Сумма");
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	
	СтруктураПолей.Вставить("Объем"  ,"Объем");
	
	СтруктураПолейЛС = Новый Структура;
	
	СтруктураПолейЛС.Вставить("ЛицевойСчет"         , "ЛицевойСчет");
	СтруктураПолейЛС.Вставить("Счетчик"             , "Счетчик");
	
	Для каждого Элемент Из СтруктураПолей Цикл
		
		Если НЕ СтруктураПолейЛС.Свойство(Элемент.Ключ) Тогда
			
			СтруктураПолейЛС.Вставить(Элемент.Ключ, Элемент.Значение);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков Тогда
		
		СтруктураПолейЛС.Вставить("НачисленияЗаПериод" , "НачисленияЗаПериод");
		СтруктураПолейЛС.Вставить("КоличествоЕдиниц"   , "КоличествоЕдиниц");
		
	Иначе
		
		СтруктураПолейЛС.Вставить("СпособРаспределения" , "СпособРаспределения");
		
	КонецЕсли; 
	
	РезультатЗапросПоЛС       = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолейЛС);
	ТаблицаПоЛС               = РезультатЗапросПоЛС.Выгрузить();
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты Тогда
		
		СтруктураПолей.Вставить("СуммаПени"  ,"СуммаПени");
		
	КонецЕсли; 
	
	// БИТ ЖКХ 14.07.2020
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировкаПени Тогда
		
		СтруктураПолей.Вставить("СуммаПени"  ,"СуммаПени");
		СтруктураПолей.Вставить("ЛицевойСчет" , "ЛицевойСчет");		
		
	КонецЕсли; 

	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокУслуг", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	// БИТ ЖКХ 14.07.2020
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировкаПени 
		 ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты Тогда
		
		СтруктураПолей.Вставить("Подсчитано"  ,"Подсчитано");				
		
	КонецЕсли; 

	РезультатЗапросаПоУслугамПеня = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокУслугПеня", СтруктураПолей);
	мТаблицаПоУслугамПеня          = РезультатЗапросаПоУслугамПеня.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоУслугам, СтруктураШапкиДокумента,Отказ, Заголовок);
	ПроверкаРеквизитовТЧСумма(ТаблицаПоУслугам,СтруктураШапкиДокумента,Отказ, Заголовок);
	
	ПроверитьДублиУслуг(ТаблицаПоУслугам, Отказ, Заголовок);
	
	ПроверитьДублиЛС(ТаблицаПоЛС, Отказ, Заголовок);
	
			
	Если НЕ Отказ Тогда 
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоЛС, Отказ, Заголовок);
		
	КонецЕсли; 
	

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.бит_РазовыеПоУслугамЖКХ") Тогда
		Если НЕ (Основание.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги ИЛИ  Основание.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика ИЛИ
			Основание.ВидОперации =  Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоОтсутствующим) Тогда
			мНеСоздДокумент = Истина;
			Возврат;
		КонецЕсли;
		
		Организация         = Основание.Организация;
		ДокументОснование   = Основание;
		Дата                = Основание.Дата;
		ЛицевойСчет         = Основание.ЛицевойСчет;
		НачПериода          = Основание.НачПериода;
		КонПериода          = Основание.КонПериода;
		ПроцентНеДопоставки = Основание.ПроцентНеДопоставки;
		
		Если Основание.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги или Основание.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика Тогда 
			ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг;
			МассивУслуг = Основание.СписокУслуг.ВыгрузитьКолонку("Услуга");
			Для Каждого ТекСтрока Из МассивУслуг Цикл 
				НоваяСтрока = СписокУслуг.Добавить();
				НоваяСтрока.Услуга = ТекСтрока;
			КонецЦикла;	
			РассчитатьСуммыПересчета();
		ИначеЕсли Основание.ВидОперации =  Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоОтсутствующим Тогда 	
			ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоОтсутствующим;
			МассивУслуг = Основание.СписокУслуг.ВыгрузитьКолонку("Услуга");
			Для Каждого ТекСтрока Из МассивУслуг Цикл 
				НоваяСтрока = СписокУслуг.Добавить();
				НоваяСтрока.Услуга = ТекСтрока;
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	МассивИсключений = Новый Массив;
	
	МассивИсключений.Добавить("ВозвратПоСчетчикам");
	МассивИсключений.Добавить("КорректировкаПоказанийСчетчиков");
	МассивИсключений.Добавить("ПриУстановкеСчетчика");
	МассивИсключений.Добавить("ПриСнятииСчетчика");
	
	ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировка;
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги или ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика Тогда
		
		ПроцентНеДопоставки = 100;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
	СуммаДокумента = 0;
	Для Каждого Строка из СписокУслуг Цикл
		СуммаДокумента = СуммаДокумента + Строка.Сумма;
	КонецЦикла;
	
	//ВопросУдалятьПустыеСтроки(); 
КонецПроцедуры



//Процедура ВопросУдалятьПустыеСтроки() 
////  Оповещение = Новый ОписаниеОповещения("УдалятьСтрокиСПустойСуммой", ЭтотОбъект);
////  ПоказатьВопрос(ОписаниеОповещенияВопрос, "Удалять строки с пустой суммой?", РежимДиалогаВопрос.ДаНет);
//	
//КонецПроцедуры

&НаСервере
Процедура УдалятьСтрокиСПустойСуммой(Ответ, ОписаниеДействия) Экспорт	

	Если Ответ = "Да" Тогда
	КонецЕсли;	
		
КонецПроцедуры


Процедура РассчитатьОбъем(ТаблицаСбора)
	
	ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	
	ТаблицаПроживающих = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	ТабНачисления    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТабРаспределения = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	
	ОбновитьПараметрыЖКХ();
	
	СписокЛ     = Новый Массив;
	
	Если ЛицевойСчет = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое")		
		// БИТ ЖКХ 09.03.2020
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды")
		Тогда
		
		Для каждого СтрокаЛС из ТаблицаСбора Цикл
			
			СписокЛ.Добавить(СтрокаЛС.ЛицевойСчет);
			
		КонецЦикла;
	Иначе
		
		СписокЛ.Добавить(ЛицевойСчет);
		
	КонецЕсли;
	
	СписокЗданий = Новый Массив;
	
	Для каждого СтрокаЗ из СписокЛ Цикл
		
		СписокЗданий.Добавить(СтрокаЗ.Здание);
		
	КонецЦикла;
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчику") Тогда
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонПериода, 
		Организация, 
		СписокЛ, 
		СписокЗданий, 
		, 
		, 
		, 
		ТабНачисления,
		ТабРаспределения,
		,
		,
		,
		мУчетДнейПроживания,
		,
		,
		,
		,
		мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
		мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
		
	Иначе
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонПериода, Организация, СписокЛ, , , , ТабЛицевыеСчета,,,,,,,,,,,,,Истина);
		
	КонецЕсли;
	
	Массив = Новый Массив;
	
	ТаблицаСбора.Сортировать("Услуга Убыв");
	ТабНачисления.Сортировать("Услуга Убыв");
	ТабЛицевыеСчета.Сортировать("Услуга Убыв");
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчику") Тогда
		
		Для каждого СтрокаСбора из СписокУслуг Цикл
			
			Для каждого Строка из ТабНачисления Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						Для каждого СтрокаУслуг из СписокУслуг Цикл
							
							Если СтрокаУслуг.Услуга = Строка.Услуга Тогда
								
								Если НЕ СтрокаУслуг.Сумма = 0 Тогда
									СтрокаСбора.Объем = СтрокаУслуг.Сумма/Строка.Тариф;
								КонецЕсли; 
								
							КонецЕсли; 
							
						КонецЦикла;
						
					КонецЕсли; 
					
				КонецЕсли; 
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое") Тогда
		
		Для каждого СтрокаСбора из СписокУслуг Цикл
			
			Для каждого Строка из ТабНачисления Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						Для каждого СтрокаУслуг из СписокУслуг Цикл
							
							Если СтрокаУслуг.Услуга = Строка.Услуга Тогда
								
								Если НЕ СтрокаУслуг.Сумма = 0 Тогда
									СтрокаСбора.Объем = СтрокаУслуг.Сумма/Строка.Тариф;
								КонецЕсли;
								
							КонецЕсли; 
							
						КонецЦикла;
						
					КонецЕсли; 
					
				КонецЕсли; 
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое") 
		// БИТ ЖКХ 10.03.2020
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды")		
		Тогда
		
		// Корректирован код для увеличения быстродейтвия.
		Для каждого СтрокаУслуга из СписокУслуг Цикл
			
			Для каждого Строка из ТабЛицевыеСчета Цикл
				
				Если СтрокаУслуга.Услуга = Строка.Услуга и СтрокаУслуга.ЛицевойСчет = Строка.ЛицевойСчет Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						Если НЕ СтрокаУслуга.Сумма = 0 Тогда
							
							СтрокаУслуга.Объем = СтрокаУслуга.Сумма/Строка.Тариф;
							
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 
			КонецЦикла;
			
			Попытка 	
				// БИТ ЖКХ 11.03.2020
				// Массив.Добавить(СтрокаСбора.Объем);
				Массив.Добавить(СтрокаУслуга.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги") 
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслуге")
		// БИТ ЖКХ 10.03.2020
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеЗаПрошлыеПериоды")		
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоОтсутствующим")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначислениеПоВременноПроживающим")
		Тогда
		
		Для каждого СтрокаУслуга из СписокУслуг Цикл
			
			Для каждого Строка из ТабЛицевыеСчета Цикл
				
				Если СтрокаУслуга.Услуга = Строка.Услуга и ЛицевойСчет = Строка.ЛицевойСчет Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						Если НЕ СтрокаУслуга.Сумма = 0 Тогда
							
							СтрокаУслуга.Объем = СтрокаУслуга.Сумма/Строка.Тариф;
							
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 
			КонецЦикла;
			
			Попытка
				// БИТ ЖКХ 11.03.2020
				//Массив.Добавить(СтрокаСбора.Объем);
				Массив.Добавить(СтрокаУслуга.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;

		СписокУслуг.ЗагрузитьКолонку(Массив,"Объем");
	Иначе
		
		// Корректирован код для увеличения быстродейтвия.
		Для каждого СтрокаУслуга из СписокУслуг Цикл
			
			Для каждого Строка из ТабЛицевыеСчета Цикл
				
				Если СтрокаУслуга.Услуга = Строка.Услуга и СтрокаУслуга.ЛицевойСчет = Строка.ЛицевойСчет Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						Если НЕ СтрокаУслуга.Сумма = 0 Тогда
							
							СтрокаУслуга.Объем = СтрокаУслуга.Сумма/Строка.Тариф;
							
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		СписокУслуг.ЗагрузитьКолонку(Массив,"Объем");
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОбновитьПараметрыЖКХ() Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"         , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Организация, ПараметрыЖКХ);
	
	мРасчетСУчетомДолейВладения          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мУменьшениеНормыЛьготыВПределахФакта = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"         , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика"         , Ложь);
	
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика"         , Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Организация, ПараметрыЖКХ);
	

	мУчетДнейПроживания   = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика;
	
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	
КонецПроцедуры

Процедура ОчиститьСтрокиСПустойСуммой () Экспорт
	
	НоваяТаблицаУслуг = новый ТаблицаЗначений;
	
	ТаблицаУслуг= СписокУслуг.Выгрузить(); 	
	
	//27.11.2019
	если ЗначениеЗаполнено(ТаблицаУслуг) = истина тогда

		НоваяТаблицаУслуг = ТаблицаУслуг.СкопироватьКолонки();

		Для Каждого СтараяСтрока Из ТаблицаУслуг Цикл
		//27.11.2019	
		 если СтараяСтрока.Сумма <> 0 или СтараяСтрока.Объем <> 0 тогда 	
	      НоваяСтрока = НоваяТаблицаУслуг.Добавить();
	      ЗаполнитьЗначенияСвойств(НоваяСтрока, СтараяСтрока);
		 конецесли;	  
		КонецЦикла;   
		
		СписокУслуг.Загрузить(НоваяТаблицаУслуг); 	
				
	конецесли;
	
КонецПроцедуры	

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мНеСоздДокумент = Ложь;

#КонецОбласти

#КонецЕсли
