
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	Момент = ТекущаяДата();
    ЛетСлужбы = 16;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Попытка
		СформироватьНаСервере();
	Исключение	
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_СпискиГражданПодлежащихПостановкеНаВоинскиУчет"));
	РезультатЗапроса = СпискиГражданПодлежащихПостановкеНаВоинскийУчетИнициализация();
	
	ОтчетОбъект.СпискиГражданПодлежащихПостановкеНаВоинскийУчетВывести(Момент,ЛетСлужбы,Результат,РезультатЗапроса);
	
	
КонецПроцедуры

&НаСервере
Функция СпискиГражданПодлежащихПостановкеНаВоинскийУчетИнициализация()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол
	|ПОМЕСТИТЬ СписокПроживающих
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			,
	|			ФизЛицо.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
	|				И СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации <= &Момент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокПроживающих.ДатаРегистрации,
	|	СписокПроживающих.ФизЛицо КАК ФизЛицо,
	|	ФактАдрес.Представление КАК ФактАдрес,
	|	ЮрАдрес.Представление КАК ЮрАдрес,
	|	Телефон.Представление КАК Телефон,
	|	СписокПроживающих.ДатаРождения,
	|	СписокПроживающих.Фамилия,
	|	СписокПроживающих.Отчество,
	|	СписокПроживающих.Имя,
	|	СписокПроживающих.ДокументВид,
	|	СписокПроживающих.ДокументСерия,
	|	СписокПроживающих.ДокументНомер,
	|	СписокПроживающих.ДокументДатаВыдачи,
	|	СписокПроживающих.ДокументКемВыдан,
	|	СписокПроживающих.ФизЛицоПол
	|{ВЫБРАТЬ
	|	ДатаРегистрации,
	|	ФизЛицо.*,
	|	ФактАдрес,
	|	ЮрАдрес,
	|	Телефон,
	|	ДатаРождения,
	|	Фамилия,
	|	Отчество,
	|	Имя,
	|	ДокументВид.*,
	|	ДокументСерия,
	|	ДокументНомер,
	|	ДокументДатаВыдачи,
	|	ДокументКемВыдан,
	|	ФизЛицоПол.*}
	|ИЗ
	|	СписокПроживающих КАК СписокПроживающих
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_КонтактнаяИнформация.Объект КАК Объект,
	|			бит_КонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ГДЕ
	|			бит_КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Адрес)
	|			И бит_КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ФактАдресПроживающего)
	|			И бит_КонтактнаяИнформация.Объект ССЫЛКА Справочник.бит_Проживающие) КАК ФактАдрес
	|		ПО СписокПроживающих.ФизЛицо = ФактАдрес.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_КонтактнаяИнформация.Объект КАК Объект,
	|			бит_КонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ГДЕ
	|			бит_КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Адрес)
	|			И бит_КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего)
	|			И бит_КонтактнаяИнформация.Объект ССЫЛКА Справочник.бит_Проживающие) КАК ЮрАдрес
	|		ПО СписокПроживающих.ФизЛицо = ЮрАдрес.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_КонтактнаяИнформация.Объект КАК Объект,
	|			бит_КонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|		ГДЕ
	|			бит_КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Телефон)
	|			И бит_КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ТелефонПроживающего)
	|			И бит_КонтактнаяИнформация.Объект ССЫЛКА Справочник.бит_Проживающие) КАК Телефон
	|		ПО СписокПроживающих.ФизЛицо = Телефон.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокПроживающих";         
	
	
	Запрос.УстановитьПараметр("Момент",Момент);

	 РезультатЗапроса = Запрос.Выполнить();
	 
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти