
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФизЛицоПриОткрытии                  = РегистрСведенийМенеджерЗаписи.ФизЛицо;
	ПериодПриОткрытии             		= РегистрСведенийМенеджерЗаписи.Период;
	ДокументВидПриОткрытии        		= РегистрСведенийМенеджерЗаписи.ДокументВид;
	ДокументДатаВыдачиПриОткрытии 		= РегистрСведенийМенеджерЗаписи.ДокументДатаВыдачи;
	ДокументКемВыданПриОткрытии  		= РегистрСведенийМенеджерЗаписи.ДокументКемВыдан;
	ДокументКодПодразделенияПриОткрытии = РегистрСведенийМенеджерЗаписи.ДокументКодПодразделения;
	ДокументНомерПриОткрытии      		= РегистрСведенийМенеджерЗаписи.ДокументНомер;
	ДокументСерияПриОткрытии      		= РегистрСведенийМенеджерЗаписи.ДокументСерия;
	ДокументПричинаЗаменыПриОткрытии    = РегистрСведенийМенеджерЗаписи.ДокументПричинаЗамены;
	Заголовок                           = Заголовок + " " + РегистрСведенийМенеджерЗаписи.ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период
	Если РегистрСведенийМенеджерЗаписи.ФизЛицо.Пустая() Тогда
		
	    РегистрСведенийМенеджерЗаписи.ФизЛицо = ФизЛицоПриОткрытии;
		РегистрСведенийМенеджерЗаписи.Период  = ПериодПриОткрытии;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> РегистрСведенийМенеджерЗаписи.Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если ДокументВидПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументВид ИЛИ
			ДокументДатаВыдачиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументДатаВыдачи ИЛИ
			ДокументКемВыданПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументКемВыдан ИЛИ
			ДокументКодПодразделенияПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументКодПодразделения ИЛИ
			ДокументНомерПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументНомер ИЛИ
			ДокументСерияПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументСерия ИЛИ
			ДокументПричинаЗаменыПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументПричинаЗамены Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_ПаспортныеДанныеПроживающих.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Период                   = ПериодПриОткрытии;
			МенеджерЗаписи.ФизЛицо                  = РегистрСведенийМенеджерЗаписи.ФизЛицо;			
			МенеджерЗаписи.ДокументВид 				= ДокументВидПриОткрытии;
			МенеджерЗаписи.ДокументДатаВыдачи	    = ДокументДатаВыдачиПриОткрытии;
			МенеджерЗаписи.ДокументКемВыдан 	    = ДокументКемВыданПриОткрытии;
			МенеджерЗаписи.ДокументКодПодразделения = ДокументКодПодразделенияПриОткрытии;
			МенеджерЗаписи.ДокументНомер	    	= ДокументНомерПриОткрытии;
			МенеджерЗаписи.ДокументСерия 			= ДокументСерияПриОткрытии; 
			МенеджерЗаписи.ДокументПричинаЗамены    = ДокументПричинаЗаменыПриОткрытии;

			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "УдостоверениеЛичности"), РегистрСведенийМенеджерЗаписи.ФизЛицо);

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор          = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.бит_ПаспортныеДанныеПроживающих.Форма.ФормаЗаписиДополнительнаяУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
