
#Область ДействияКомандФормы

&НаКлиенте
Процедура СнятиеСчетчика(Команда)
	ОткрытьФормуНовогоДокумента(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛСНаСчетчик(Команда)
	ОткрытьФормуНовогоДокумента(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛССоСчетчика(Команда)
	ОткрытьФормуНовогоДокумента(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУслугиКСчетчику(Команда)
	ОткрытьФормуНовогоДокумента(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СнятьУслугиСоСчетчика(Команда)
	ОткрытьФормуНовогоДокумента(Команда.Имя);
КонецПроцедуры

// БИТ_ЖКХ 01.12.2015 18:08:02 Начало правки... 
&НаКлиенте
Процедура ДобавитьЗданияНаСчетчик(Команда)
	
	ОткрытьФормуНовогоДокумента(Команда.Имя);
	
КонецПроцедуры
// БИТ_ЖКХ 01.12.2015 18:08:04 Конец правки.

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОткрытьФормуНовогоДокумента(ИмяВидаОперации)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика." + ИмяВидаОперации);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации", ВидОперации));
	ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая", СтруктураПараметры, Элементы.Список);
	
КонецПроцедуры // () 

#КонецОбласти