////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции общего назначения:
// - для работы с данными в базе;
// - для работы с прикладными типами и коллекциями значений;
// - математические процедуры и функции;
// - для работы с внешним соединением;
// - для работы с формами;
// - для работы с типами, объектами метаданных и их строковыми представлениями;
// - функции определения типов объектов метаданных;
// - сохранение, чтение и удаление настроек из хранилищ;
// - для работы с табличными документами;
// - для работы с журналом регистрации;
// - версионирование программных интерфейсов;
// - вспомогательные процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура производит действия, которые необходимо выполнить при начале работы системы.
//
Функция ДействияПриНачалеРаботыСистемы(СтрПар) Экспорт
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если РольДоступна("бит_АдминистраторПравДоступа") Тогда
		
		бит_ПраваДоступа.ОбновитьОбъектыДоступа();
		
	КонецЕсли; 
	
	// БИТ_ЖКХ 17.02.2014{{
	
	РезСтр = Новый Структура;
	РезСтр.Вставить("ВыполненоОбновлениеИБ", Ложь);
	РезСтр.Вставить("ПротоколОбновлениеИБ", "");
	
	Если СтрПар.НеобходимоОбновитьИБ Тогда
		
		// Обновим информационную базу.
		РезОбновлениеИБ = ВыполнитьОбновлениеИнформационнойБазы(СтрПар);
		РезСтр.ВыполненоОбновлениеИБ = РезОбновлениеИБ.Выполнено;
		РезСтр.ПротоколОбновлениеИБ  = РезОбновлениеИБ.Протокол;
		
	КонецЕсли; 
	
	Возврат РезСтр;
	
	// БИТ_ЖКХ 17.02.2014}}
	
КонецФункции //ДействияПриНачалеРаботыСистемы()

// Выполняет обновление информационной базы при необходимости.
//
Функция ВыполнитьОбновлениеИнформационнойБазы(СтрПар) Экспорт
	
	Сведения             = СтрПар.Сведения;
	НомерРелизаБиТ       = СтрПар.НомерРелизаБИТ;
	КонстантаНомерРелиза = СтрПар.КонстантаНомерРелиза;
	ПервыйЗапуск         = СтрПар.ПервыйЗапуск;
	
	флВыполнять = СтрПар.НеобходимоОбновитьИБ;
	
	БазоваяПоставка = (Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0);
	// Установка монопольного режима для обновления информационной базы.
	Если НЕ БазоваяПоставка Тогда
		
		Попытка
			УстановитьМонопольныйРежим(Истина);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = 'Для обновления бит_ЖКХ перезапустите 1СПредприятие.
										|%2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			флВыполнять = Ложь;
		КонецПопытки;
		
	КонецЕсли; 
	
	Протокол = "";
	Если флВыполнять Тогда
		
		// Если включен режим разделения доступа на уровне базы его необходимо выключить на период обновления.
		флВключенМеханизмПрав = Ложь;
		Если Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы.Получить() Тогда
			
			флВключенМеханизмПрав = Истина;
			Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы.Установить(Ложь);
			
		КонецЕсли; 
		
		// Обновление или первоначальное заполнение информационной базы.
		ОбработкаОбновления = Обработки.бит_ОбновлениеИнформационнойБазы.Создать();
		Если ПервыйЗапуск Тогда
			ОбработкаОбновления.ПервоеЗаполнение();
		Иначе
			ОбработкаОбновления.ВыполнитьОбновление();		
		КонецЕсли;
		Протокол = ОбработкаОбновления.мПротокол;
		
		// Механизм прав был выключен на период обновления - следует его включить.
		Если  флВключенМеханизмПрав Тогда
			Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы.Установить(Истина);
		КонецЕсли;
		
	КонецЕсли; 
	
	// Откючение монопольного режима.
	Если НЕ БазоваяПоставка Тогда
		УстановитьМонопольныйРежим(Ложь);
	КонецЕсли; 	
	
	// Проверка выполнения обновления информационной базы.
	
	// БИТ_ЖКХ 19.02.2014
	
	// флВыполнено = (Константы.бит_НомерРелиза.Получить() = НомерРелизаБиТ);.
	флВыполнено = (Константы.бит_НомерВерсииКонфигурацииБИТ.Получить() = НомерРелизаБиТ);
	
	// БИТ_ЖКХ 19.02.2014
	
	РезСтр = Новый Структура("Выполнено, Протокол", флВыполнено, Протокол);
	
	Возврат РезСтр;
	
КонецФункции // ВыполнитьОбновлениеИнформационнойБазы

// Функция получает значение параметра сеанса.
//
Функция ПолучитьПараметрСеанса(Параметр) Экспорт
	
	ЗначениеПараметра = Неопределено;
	
	Возврат ЗначениеПараметра;
	
КонецФункции // ()

// Функция получает значение переменной.
//
// Параметры:
//  ИмяПеременной  - Строка.
//  
// Возвращаемое значение:
//   Произвольное значение.
//
Функция ПолучитьЗначениеПеременной(ИмяПеременной, Кэш = Неопределено) Экспорт
	
	ПолученноеЗначение = бит_ОбщиеПеременныеСервер.ЗначениеПеременной(ИмяПеременной);
	
	Возврат ПолученноеЗначение;
	
КонецФункции // ПолучитьЗначениеПеременной()

Функция ПолучитьИмяЗначенияПеречисления(ТекПеречисление,ЗначениеПеречисления) Экспорт
	
	ТекИндекс   = ТекПеречисление.Индекс(ЗначениеПеречисления);
	ИмяЗначения = ЗначениеПеречисления.Метаданные().ЗначенияПеречисления[ТекИндекс].Имя;
	
	Возврат ИмяЗначения;
КонецФункции // бит_ПолучитьИмяПоЗначениюПеречисления()

// Функция кэширует в структуру значения указанного перечисления. 
// Ключ имя значения перечисления, значение - ссылка.
// Используется для кэширования значений перечислений с целью передачи на клиент.
//
// Параметры:
//  ТекПеречисление  - ПеречислениеСсылка.
//
// Возвращаемое значение:
//   КэшЗначений     - Структура.
//
Функция КэшироватьЗначенияПеречисления(ТекПеречисление)  Экспорт
	
	КэшЗначений = Новый Структура;
	
	Для каждого ЗначениеПеречисления Из ТекПеречисление Цикл
		
		ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ТекПеречисление,ЗначениеПеречисления);
		КэшЗначений.Вставить(ИмяЗначения,ЗначениеПеречисления);
		
	КонецЦикла; 
	
	Возврат КэшЗначений;
	
КонецФункции // КэшироватьЗначенияПеречисления()

Процедура ЗаполнитьЭлементОтбора(ЭлементОтбораИсточник,ЭлементОтбораПриемник) Экспорт
	
	ЭлементОтбораПриемник.ВидСравнения = ЭлементОтбораИсточник.ВидСравнения;
	ЭлементОтбораПриемник.Значение     = ЭлементОтбораИсточник.Значение;
	ЭлементОтбораПриемник.ЗначениеС    = ЭлементОтбораИсточник.ЗначениеС;
	ЭлементОтбораПриемник.ЗначениеПо   = ЭлементОтбораИсточник.ЗначениеПо;
	ЭлементОтбораПриемник.Использование = ЭлементОтбораИсточник.Использование;
	ЭлементОтбораПриемник.Представление = ЭлементОтбораИсточник.Представление;
	
КонецПроцедуры // бит_ЗаполнитьЭлементОтбора()

// Возвращает разницу в днях между двумя датами.
//
Функция РазностьДатВДнях(Дата1, Дата2)  Экспорт
	
	мДлинаСуток = 86400; // В секундах.
	
	Возврат Окр((НачалоДня(Дата1) - НачалоДня(Дата2)) / мДлинаСуток);
	
КонецФункции

// Процедура проверяет уникальность элемента справочника по переданному набору реквизитов.
//
// Параметры:
//	Объект - объект записываемого справочника;
//	СтруктураРеквизитов - Структура, содержащая имена реквизитов, уникальность по которым надо проверить:
//						ключ - имя реквизита;
//						значение - представление реквизита;
//	Отказ - флаг отказа от записи.
Процедура ПроверитьУникальностьЭлементаПоЗначениюРеквизитов(Объект, СтруктураРеквизитов, Отказ) Экспорт
	
	ИмяОбъекта = Объект.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТекстУсловия = "";
	СтрокаИменРеквизитов = "";
	Для Каждого ТекЭлемент Из СтруктураРеквизитов Цикл
		ТекстУсловия = ТекстУсловия + " И " + ИмяОбъекта + "." + ТекЭлемент.Ключ + " = &" + ТекЭлемент.Ключ;
		Запрос.УстановитьПараметр(ТекЭлемент.Ключ, Объект[ТекЭлемент.Ключ]);
		СтрокаИменРеквизитов = СтрокаИменРеквизитов +" "+ ?(ЗначениеЗаполнено(ТекЭлемент.Значение), ТекЭлемент.Значение, ТекЭлемент.Ключ)+";";
	КонецЦикла;
	// Вместо справочника прописывать тип объекта метаданных.
	ТекстЗапроса = "ВЫБРАТЬ
	|	"+ИмяОбъекта+".Ссылка
	|ИЗ   
	|	Справочник."+ИмяОбъекта+" КАК "+ИмяОбъекта+"
	|ГДЕ
	|	"+ИмяОбъекта+".Ссылка <> &Ссылка"+"
	|"+ТекстУсловия;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда

		ТекстСообщения = НСтр("ru = 'Данный элемент не является уникальным по значениям реквизитов: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаИменРеквизитов);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет уникальность строки таб.части по переданному набору реквизитов.
//
// Параметры:
//	Объект - объект записываемого справочника;
//	ИмяТабличнойЧасти - строка, имя табличной части, строки которой проверяются.
//	СтруктураРеквизитов - Структура, содержащая имена реквизитов, уникальность по которым надо проверить:.
//						ключ - имя реквизита;.
//						значение - представление реквизита;.
//	Отказ - флаг отказа от записи.
//  Заголовок                   - строка, заголовок сообщения об ошибке проведения,
//                                по умолчанию пустая строка.
//
//  ПредставлениеТабличнойЧасти - строка, название табличной части для вывода пользователю,
//								  по умолчанию пустая строка.
Процедура ПроверитьДублированиеСтрокВТабЧастиПоНаборуРеквизитов(Объект, ИмяТабличнойЧасти, СтруктураРеквизитов, Отказ, 
	ПредставлениеТабличнойЧасти="",Заголовок="") Экспорт
	
	ПредставлениеТабЧасти = ?(ПредставлениеТабличнойЧасти = "",
	Объект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление(),
	ПредставлениеТабличнойЧасти);
	
	ТабличнаяЧасть      = Объект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты = Объект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
	
	СтрокаРеквизитов = "";
	Для Каждого ТекРеквизит Из СтруктураРеквизитов Цикл
		СтрокаРеквизитов = СтрокаРеквизитов +" "+ ?(ЗначениеЗаполнено(ТекРеквизит.Значение),ТекРеквизит.Значение,МетаданныеРеквизиты[ТекРеквизит.Ключ].Синоним)+",";
	КонецЦикла;
	СтрокаРеквизитов = Лев(СтрокаРеквизитов, СтрДлина(СтрокаРеквизитов)-1);
	
	ЗаголовокВывели = Ложь;
	Ошибки = Неопределено;
	Для Каждого ТекСтрока Из ТабличнаяЧасть Цикл
		СтруктураОтбора = Новый Структура;
		Для Каждого ТекРеквизит Из СтруктураРеквизитов Цикл
			СтруктураОтбора.Вставить(ТекРеквизит.Ключ, ТекСтрока[ТекРеквизит.Ключ]);
		КонецЦикла;
		СтрокиДублей = ТабличнаяЧасть.НайтиСтроки(СтруктураОтбора);
		
		// Дублей нет, т.е. в таб части присутствует только одна строка с таким набором значений реквизитов.
		Если СтрокиДублей.Количество() = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНомеровСтрок = "";
		Для Каждого ТекДубль Из СтрокиДублей Цикл
			СтрокаНомеровСтрок = СтрокаНомеровСтрок + " " + ТекДубль.НомерСтроки + ";";
			Отказ = Истина;
		КонецЦикла;
		
		Если НЕ ЗаголовокВывели Тогда
			ОшибкаПриПроведении("В табличной части """ + ПредставлениеТабЧасти + """, присутствуют дубли строк по значениям в колонках: """ + СтрокаРеквизитов + """ - в строках:", Отказ, Заголовок);
			ЗаголовокВывели = Истина;
		КонецЕсли;

		ТекстОшибки = НСтр("ru = 'Строка №%1: значения реквизитов из строки повторяются в строках №№%2.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ТекСтрока.НомерСтроки, СтрокаНомеровСтрок);
 		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки, "");
		
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);

КонецПроцедуры

// Процедура выполняет проверку доступности основных рабочих ролей.
//
Функция ПроверитьДоступностьОсновныхРолей() Экспорт
	
	Отмена = Истина;
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если РольДоступна("ПолныеПрава") Тогда
		Отмена = Ложь;
	КонецЕсли;
	
	Возврат Отмена;
	
КонецФункции // ()

// Процедура устанавливает свойство "доступность" элементов формы.
//
// Параметры:
//
//  Метаданные      – объект матаданных.
//  СписокЭлементов - массив.
//  ЭлементыФормы   - элементы формы.
//
Процедура УстановитьПраваДоступаКЭлементамФормы(Метаданные, СписокЭлементов, ЭлементыФормы) Экспорт
	
	ПравоИзменения = ПравоДоступа("Изменение", Метаданные);
	
	Для каждого Элемент Из СписокЭлементов Цикл
		
		ЭлементыФормы[Элемент].Доступность = ?(НЕ ПравоИзменения, Ложь, Истина);
		
	КонецЦикла; 
	
КонецПроцедуры

// БИТ_ЖКХ 27.05.2016 16:07:42 Начало правки...
// Предназначена для получения пустого значения заданного типа:
//	примитивного, или ссылочного. Используется
//
// Параметры:
//	ЗаданныйТип   - тип, пустое значение которого нужно получить
//
Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт

	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;

	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";

	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';

	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;

	Иначе
		Возврат Новый (ЗаданныйТип);

	КонецЕсли;

КонецФункции // ПустоеЗначениеТипа();

// Функция возвращает структуру с параметрами учетной политики на заданную дату для выгрузки на сайт ВДГБ.
// Параметры:
//  Дата                - Дата             - Дата на которую получить настройки, 
//  Организация         - СправочникСсылка - Огранизация по которой получить настройки,
//  Отказ        - Булево - показывает, возникали ли ошибки
// 
// Возвращаемое значение:
//  Структура - структура с параметрами учетной политики
//
Функция ПолучитьНастройкиЖКХ_СайтВДГБ(Дата, Организация, Отказ = Ложь) Экспорт
	
	СтруктураПараметрыЖКХ = Новый Структура();
	Ресурсы = Метаданные.РегистрыСведений.бит_НастройкаПараметровЖКХ.Ресурсы;
	Для Каждого ТекРесурс Из Ресурсы Цикл
		ПустоеЗначение = ПустоеЗначениеТипа(ТекРесурс.Тип.Типы().Получить(0));
		СтруктураПараметрыЖКХ.Вставить(ТекРесурс.Имя, ПустоеЗначение);
	КонецЦикла;

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Отказ = Истина;
		Возврат СтруктураПараметрыЖКХ;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Отказ = Истина;
		Возврат СтруктураПараметрыЖКХ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВариантПодкрутки,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВключатьВРасчетСуммыДолгаПени,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьЗависимыеЛС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьЗамечанияЖКХ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьЛьготыНаСчетИзвещение,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьСуммуБезУчетаПереплатПоУслугам,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ГруппироватьУслугиВЧеке,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ДатаНачалаВеденияПоКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ИспользоватьНомерПолучателяВШК,
	|	бит_НастройкаПараметровЖКХСрезПоследних.КодУслугиВСистемеГород,
	|	бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени,
	|	бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевПодкрутки,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Контрагент,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ЛьготаПерсонифицированная КАК НеУчитыватьЛьготыВоВзаиморасчетах,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислениеСУчетомДнейПроживания,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислятьПени,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислятьПениСУчетомПереплаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьДом,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьКвартира,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьКорпус,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьРайон,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьУлица,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеРаспределятьОплатуПослеВводаСуммы,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НомерПолучателяПоБанку,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ОбщедомовыеРасходыВГрафеНачисления,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПечатьПолучателейДС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПодкруткаНаЛС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксДом,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксКвартира,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксКорпус,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксРайон,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксУлица,
	|	бит_НастройкаПараметровЖКХСрезПоследних.РазбитьОплатуКУПоДатам,
	|	бит_НастройкаПараметровЖКХСрезПоследних.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
	|	бит_НастройкаПараметровЖКХСрезПоследних.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
	|	бит_НастройкаПараметровЖКХСрезПоследних.РасчетСУчетомДолейВладения,
	|	бит_НастройкаПараметровЖКХСрезПоследних.РежимРаботы,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СкидкаПоЛьготеСУчетомСверхНормы,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СкидкаПриНачисленииПоНормеНаСчетчики,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СколькоЭтажейНеПлатятЗаЛифт,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Субконто1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Субконто2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Субконто3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготСУ1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготСУ2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготСУ3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготУСО1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготУСО2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготУСО3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениСУ1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениСУ2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениСУ3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетАбонента,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетДохода,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетЛьготСторП,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетЛьготСУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетПениУСО,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСторПКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСторПКУОплата,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетчикиПодкрутка,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.УменьшениеНормыЛьготыВПределахФакта,
	|	бит_НастройкаПараметровЖКХСрезПоследних.УчитыватьНачисленияПоГрупповымСчетчикам,
	|	бит_НастройкаПараметровЖКХСрезПоследних.УчитыватьПерерасчет,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ФормироватьАктИРеализациюПоКонтрагенту,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ФормироватьАктИРеализациюПоКонтрагентуОтветственныхЛиц,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ИспользоватьСокращенноеНаименование,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ФорматДаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НазначениеПлатежа,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Мосэнергосбыт2016
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		
		Строка = Результат[0];
		Для Каждого Колонка Из Результат.Колонки  Цикл
			СтруктураПараметрыЖКХ.Вставить(Колонка.Имя, Строка[Колонка.Имя]);
		КонецЦикла;
		
	Иначе
		СообщитьОбОшибке("Не указаны параметры ЖКХ для организации """
						+ СокрЛП(Организация) + """ на " + Формат(Дата, "ДЛФ=DD"), Отказ);
	КонецЕсли; 
	
	Возврат СтруктураПараметрыЖКХ;
	
КонецФункции // ()
// БИТ_ЖКХ 27.05.2016 16:07:42 Конец правки.

// БИТ_ЖКХ 03.06.2016 12:10:27 Начало правки...
Функция ПолучитьСписокУслугКапремонта() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_УслугиЖКХ.Ссылка КАК УслугиЖКХ
	|ИЗ
	|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|ГДЕ
	|	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС = ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УслугиЖКХ");
	
	
КонецФункции
// БИТ_ЖКХ 03.06.2016 12:10:27 Конец правки.

// БИТ_ЖКХ 06.06.2016 14:10:28 Начало правки...
// Получает и помещает в менеджер временных таблиц таблицу контактной информации по заданному массиву объектов и видов контактной информации.
// Параметры:
//    МенеджерВременныхТаблиц     - МенеджерВременныхТаблиц запроса, в который необходимо поместить временную таблицу контактной информации.
//    МассивВидовКИ    - Массив - Массив видов контактной информации.
//    МассивОбъектов - Массив - Массив объектов.
//
Процедура СформироватьТаблицуКонтактнойИнформацииОбъектов(МенеджерВременныхТаблиц, МассивВидовКИ, МассивОбъектов = Неопределено) Экспорт
	
	МассивТиповКонтактнойИнформации = Новый Массив;
	МассивТиповКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Элемент = МассивВидовКИ.Получить(0);
	ИмяГруппыСправочника = Элемент.Родитель.ИмяПредопределенныхДанных;
	
	Если МассивОбъектов = Неопределено Тогда
		
		ИмяОбъектаМетаданных = Сред(ИмяГруппыСправочника, 11);
	ИначеЕсли МассивОбъектов.Количество() > 0 Тогда
		
		Ссылка = МассивОбъектов.Получить(0);
		ИмяОбъектаМетаданных = Ссылка.Метаданные().Имя;
	Иначе
		
		ИмяОбъектаМетаданных = Сред(ИмяГруппыСправочника, 11);
		
	КонецЕсли;
	
	ДопПолеПериода = "";
	//Если ИмяГруппыСправочника = "СправочникУПЖКХ_Жильцы" Тогда
	//	ДопПолеПериода = "	КонтактнаяИнформацияОбъекта.УПЖКХ_Период КАК Период,";
	//КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформацияОбъекта.Ссылка КАК Объект," + ДопПолеПериода + Символы.ПС +
		"	КонтактнаяИнформацияОбъекта.ЗначенияПолей КАК ЗначенияПолей
		|ИЗ
		|	Справочник." + ИмяОбъектаМетаданных + ".КонтактнаяИнформация КАК КонтактнаяИнформацияОбъекта
		|ГДЕ
		|	КонтактнаяИнформацияОбъекта.Тип В (&ТипыКИ) И
		|	КонтактнаяИнформацияОбъекта.Вид В (&ВидыКИ)"
		+ ?(Не МассивОбъектов = Неопределено, " И КонтактнаяИнформацияОбъекта.Ссылка В (&МассивОбъектов)", "");
	
	Если Не МассивОбъектов = Неопределено Тогда
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипыКИ", МассивТиповКонтактнойИнформации);
	Запрос.УстановитьПараметр("ВидыКИ", МассивВидовКИ);
	
	ВыборкаКонтактнойИнформации = Запрос.Выполнить().Выбрать();
	
	ТаблицаЗначенийПолей = ПолучитьПустуюТаблицуЗначенийПолей();
	
	Пока ВыборкаКонтактнойИнформации.Следующий() Цикл
		
		СтруктураПолей = Новый Структура;
		
		НоваяСтрока = ТаблицаЗначенийПолей.Добавить();
		НоваяСтрока.Объект = ВыборкаКонтактнойИнформации.Объект;
		
		ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(ВыборкаКонтактнойИнформации.ЗначенияПолей);
		
		СписокПолейАдреса = УправлениеКонтактнойИнформациейКлиентСервер.ПреобразоватьСтрокуВСписокПолей(ВыборкаКонтактнойИнформации.ЗначенияПолей);
		
		СписокПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтаруюСтруктуру(ДанныеАдреса).ЗначенияПолей;
		
		Для Каждого Поле Из СписокПолей Цикл
			СтруктураПолей.Вставить(Поле.Представление, Поле.Значение);
		КонецЦикла;
			
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПолей);
		
		НоваяСтрока.Комментарий = ДанныеАдреса.Комментарий;
		
		//// Поле "Период" заполняем, только если получаем контактную инофрмацию справочника "Жильцы".
		//Если ИмяГруппыСправочника = "СправочникУПЖКХ_Жильцы" Тогда
		//	НоваяСтрока.Период = ВыборкаКонтактнойИнформации.Период;
		//Иначе
		//	НоваяСтрока.Период = Дата(1,1,1);
		//КонецЕсли;
		НоваяСтрока.Период = Дата(1,1,1);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	| *
	|ПОМЕСТИТЬ втКонтактнаяИнформация
	|ИЗ
	|	&КонтактнаяИнформация КАК КонтактнаяИнформация";
	
	Запрос.УстановитьПараметр("КонтактнаяИнформация", ТаблицаЗначенийПолей);
	
	Запрос.Выполнить();
	
КонецПроцедуры // СформироватьТаблицуКонтактнойИнформацииОбъектов()

// Функция вовзращает пустую таблицу значений с колонками-составляющими адреса.
//
Функция ПолучитьПустуюТаблицуЗначенийПолей()
	
	ТаблицаПолей = Новый ТаблицаЗначений;
	
	МассивТиповОбъекта = Новый Массив;
	
	МассивТиповОбъекта.Добавить(Тип("СправочникСсылка.бит_СписокЗданий"));
	МассивТиповОбъекта.Добавить(Тип("СправочникСсылка.бит_ЛицевыеСчета"));
	МассивТиповОбъекта.Добавить(Тип("СправочникСсылка.бит_Проживающие"));
	
	ТаблицаПолей.Колонки.Добавить("Объект",          Новый ОписаниеТипов(МассивТиповОбъекта));
	
	// Только для адресов выбытия/прибытия жильца.
	ТаблицаПолей.Колонки.Добавить("Период",          ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	
	ТаблицаПолей.Колонки.Добавить("Страна",          ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Регион",          ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Район",           ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Город",           ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("НаселенныйПункт", ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Улица",           ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Дом",             ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("ТипКорпуса",      ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Корпус",          ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("ТипКвартиры",     ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Квартира",        ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Индекс",          ПолучитьОписаниеТиповСтроки(6));
	ТаблицаПолей.Колонки.Добавить("Представление",   ПолучитьОписаниеТиповСтроки(120));
	ТаблицаПолей.Колонки.Добавить("Комментарий",     ПолучитьОписаниеТиповСтроки(120));
	
	Возврат ТаблицаПолей;
	
КонецФункции // ПолучитьПустуюТаблицуЗначенийПолей()
// БИТ_ЖКХ 06.06.2016 14:10:28 Конец правки.

//  Функция возвращает стурктуру нстроект жкх.
//
Функция ПолучитьНастройкиЖКХ_Old(Дата, Организация) Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ДатаНачалаВеденияПоКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей,
	|	бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СколькоЭтажейНеПлатятЗаЛифт,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СкидкаПоЛьготеСУчетомСверхНормы,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ЛьготаПерсонифицированная,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислятьПени,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетчикиПодкрутка,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СкидкаПриНачисленииПоНормеНаСчетчики,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПодкруткаНаЛС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетАбонента,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетЛьготСУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСторПКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетЛьготСторП,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСторПКУОплата,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьЛьготыНаСчетИзвещение,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПечатьПолучателейДС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислениеСУчетомДнейПроживания,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьЗамечанияЖКХ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.РасчетСУчетомДолейВладения,
	|	бит_НастройкаПараметровЖКХСрезПоследних.УменьшениеНормыЛьготыВПределахФакта,
	|	бит_НастройкаПараметровЖКХСрезПоследних.РазбитьОплатуКУПоДатам,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ГруппироватьУслугиВЧеке,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксУлица,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьУлица,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксДом,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьДом,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксКорпус,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьКорпус,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксКвартира,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьКвартира,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПрефиксРайон,
	|	бит_НастройкаПараметровЖКХСрезПоследних.НеПечататьРайон,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьСуммуБезУчетаПереплатПоУслугам,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВключатьВРасчетСуммыДолгаПени,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ОбщедомовыеРасходыВГрафеНачисления,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ВыводитьЗависимыеЛС
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПараметрыЖКХ.Вставить("Организация"                            ,Выборка.Организация);	
		ПараметрыЖКХ.Вставить("ДатаНачалаВеденияПоКУ"                  ,Выборка.ДатаНачалаВеденияПоКУ);
		ПараметрыЖКХ.Вставить("ПоследнийДеньПриемаПлатежей"            ,Выборка.ПоследнийДеньПриемаПлатежей);	
		ПараметрыЖКХ.Вставить("КоличествоМесяцевОтсрочкиНачисленияПени",Выборка.КоличествоМесяцевОтсрочкиНачисленияПени);
		ПараметрыЖКХ.Вставить("СколькоЭтажейНеПлатятЗаЛифт"            ,Выборка.СколькоЭтажейНеПлатятЗаЛифт);	
		ПараметрыЖКХ.Вставить("СкидкаПоЛьготеСУчетомСверхНормы"        ,Выборка.СкидкаПоЛьготеСУчетомСверхНормы);
		ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"              ,Выборка.ЛьготаПерсонифицированная);	
		ПараметрыЖКХ.Вставить("НачислятьПени"                          ,Выборка.НачислятьПени);
		ПараметрыЖКХ.Вставить("СчетчикиПодкрутка"                      ,Выборка.СчетчикиПодкрутка);	
		ПараметрыЖКХ.Вставить("СкидкаПриНачисленииПоНормеНаСчетчики"   ,Выборка.СкидкаПриНачисленииПоНормеНаСчетчики);
		ПараметрыЖКХ.Вставить("ПодкруткаНаЛС"                          ,Выборка.ПодкруткаНаЛС);	
		ПараметрыЖКХ.Вставить("СчетАбонента"                           ,Выборка.СчетАбонента);
		ПараметрыЖКХ.Вставить("СчетСУКУ"                               ,Выборка.СчетСУКУ);	
		ПараметрыЖКХ.Вставить("СчетСУЦС"                               ,Выборка.СчетСУЦС);
		ПараметрыЖКХ.Вставить("СчетЛьготСУ"                            ,Выборка.СчетЛьготСУ);	
		ПараметрыЖКХ.Вставить("СчетСторПКУ"                            ,Выборка.СчетСторПКУ);
		ПараметрыЖКХ.Вставить("СчетЛьготСторП"                         ,Выборка.СчетЛьготСторП);	
		ПараметрыЖКХ.Вставить("ТранзитныйСчетОплаты"                   ,Выборка.ТранзитныйСчетОплаты);
		ПараметрыЖКХ.Вставить("СчетСУАренды"                           ,Выборка.СчетСУАренды);	
		ПараметрыЖКХ.Вставить("СчетСторПКУОплата"                      ,Выборка.СчетСторПКУОплата);
		ПараметрыЖКХ.Вставить("ПечатьПолучателейДС"                    ,Выборка.ПечатьПолучателейДС);
		ПараметрыЖКХ.Вставить("ВыводитьЛьготыНаСчетИзвещение"          ,Выборка.ВыводитьЛьготыНаСчетИзвещение);
		ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"        ,Выборка.НачислениеСУчетомДнейПроживания);
		ПараметрыЖКХ.Вставить("ВыводитьЗамечанияЖКХ"          		   ,Выборка.ВыводитьЗамечанияЖКХ);
		ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"             ,Выборка.РасчетСУчетомДолейВладения);
		ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"    ,Выборка.УменьшениеНормыЛьготыВПределахФакта);
		ПараметрыЖКХ.Вставить("РазбитьОплатуКУПоДатам"                 ,Выборка.РазбитьОплатуКУПоДатам);
		ПараметрыЖКХ.Вставить("ГруппироватьУслугиВЧеке"                ,Выборка.ГруппироватьУслугиВЧеке);
		// БИТ_ЖКХ добавление кода Начало: 17.08.2011 
		ПараметрыЖКХ.Вставить("ПрефиксУлица"   	            			,Выборка.ПрефиксУлица);
		ПараметрыЖКХ.Вставить("НеПечататьУлица"                			,Выборка.НеПечататьУлица);
		ПараметрыЖКХ.Вставить("ПрефиксДом"                				,Выборка.ПрефиксДом);
		ПараметрыЖКХ.Вставить("НеПечататьДом"                			,Выборка.НеПечататьДом);
		ПараметрыЖКХ.Вставить("ПрефиксКорпус"                			,Выборка.ПрефиксКорпус);
		ПараметрыЖКХ.Вставить("НеПечататьКорпус"                		,Выборка.НеПечататьКорпус);
		ПараметрыЖКХ.Вставить("ПрефиксКвартира"                			,Выборка.ПрефиксКвартира);
		ПараметрыЖКХ.Вставить("НеПечататьКвартира"                		,Выборка.НеПечататьКвартира);
		// БИТ_ЖКХ добавление кода конец : 17.08.2011
		// БИТ_ЖКХ добавление кода Начало: 30.08.2011 
		ПараметрыЖКХ.Вставить("ПрефиксРайон"                			,Выборка.ПрефиксРайон);
		ПараметрыЖКХ.Вставить("НеПечататьРайон"                			,Выборка.НеПечататьРайон);
		// БИТ_ЖКХ добавление кода конец : 30.08.2011
		// БИТ_ЖКХ добавление кода Начало: 24.10.2011 
		ПараметрыЖКХ.Вставить("ВыводитьСуммуБезУчетаПереплатПоУслугам"  ,Выборка.ВыводитьСуммуБезУчетаПереплатПоУслугам);
		ПараметрыЖКХ.Вставить("ВключатьВРасчетСуммыДолгаПени"           ,Выборка.ВключатьВРасчетСуммыДолгаПени);
		// БИТ_ЖКХ добавление кода конец : 24.10.2011
		// БИТ_ЖКХ добавление кода. Начало. 24.10.2011{{
		ПараметрыЖКХ.Вставить("ОбщедомовыеРасходыВГрафеНачисления"      ,Выборка.ОбщедомовыеРасходыВГрафеНачисления);
		// БИТ_ЖКХ добавление кода. Конец. 24.10.2011}}
		// БИТ_ЖКХ добавление кода Начало: 31.01.2012 
		ПараметрыЖКХ.Вставить("ВыводитьЗависимыеЛС"                		,Выборка.ВыводитьЗависимыеЛС);
		// БИТ_ЖКХ добавление кода конец : 31.01.2012
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат ПараметрыЖКХ;
	
КонецФункции // ()

//  Процедура выполняет получение настроек ЖКХ.
//
// Параметры: 
//  Дата                - Дата             - Дата на которую получить настройки, 
//  Организация         - СправочникСсылка - Огранизация по которой получить настройки,
//  СтруктураПараметров - Структура        - Заполненая структура Настроек жкх.
//                                           (Ключ - имя настройки, Значение - стандартное значение настройки),
// Возвращаемое значение:
//  СтруктураПараметров.
//
Процедура ПолучитьНастройкиЖКХ(Дата, Организация, СтруктураПараметров) Экспорт
	
	ТекстЗапроса = "";
	
	Для Каждого Настройка Из СтруктураПараметров Цикл
		
		ТекстЗапроса  = ТекстЗапроса + ",
		|	бит_НастройкаПараметровЖКХСрезПоследних." + СокрЛП(Настройка.Ключ);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|бит_НастройкаПараметровЖКХСрезПоследних.Организация " + ТекстЗапроса + "
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка); 
		
	Иначе
		
		Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Дата) Тогда

			ТекстСообщения = НСтр("ru = 'Настройки ЖКХ для организации: %1 на %2 не заданы!'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Организация), Формат(Дата, "ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	//Дата = КонецДня(Дата);
	//ДатаИзмененийНастроекЖКХ = бит_ОбщегоНазначенияПовтИсп.ПоследняяДатаИзмененийНастроекЖКХ(Организация);
	//Если ЗначениеЗаполнено(ДатаИзмененийНастроекЖКХ)
	//	И ДатаИзмененийНастроекЖКХ < Дата Тогда // Сокращаем число выполнений запросов с произвольной датой.
	//	ЗаполнитьЗначенияСвойств(СтруктураПараметров, бит_ОбщегоНазначенияПовтИсп.ПолучитьНастройкиЖКХ(КонецДня(ДатаИзмененийНастроекЖКХ) + 1, Организация));
	//Иначе
	//	ЗаполнитьЗначенияСвойств(СтруктураПараметров, бит_ОбщегоНазначенияПовтИсп.ПолучитьНастройкиЖКХ(Дата, Организация));
	//КонецЕсли;
	
КонецПроцедуры // ПолучитьНастройкиЖКХ()

// Процедура предназначена для заполнения общих реквизитов документов,
// Вызывается в обработчиках событий "ПриОткрытии" в модулех форм всех документов.
//
// Параметры:
//  ДокументОбъект            - объект редактируемого документа.
//  ТекПользователь           - ссылка на справочник, определяет текущего пользователя.
//  ПараметрОбъектКопирования - указывает что документ создан копированием.
//
//  ВидСтатьи        		  - Строка, вид статьи оборотов, по умолчанию "";
//                                      принимаемые значения: ПоступлениеБДДС/РасходованиеБДДС/.
//                                                            ПоступлениеБДР/РасходованиеБДР.
//
Процедура ЗаполнитьШапкуДокумента(ДокументОбъект, ТекПользователь, ПараметрОбъектКопирования = Неопределено) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента) 
		И НЕ ЗначениеЗаполнено(ДокументОбъект.ВидОперации)  Тогда
		ДокументОбъект.ВидОперации = Перечисления[ДокументОбъект.ВидОперации.Метаданные().Имя][0];
	КонецЕсли;	
	
	Если ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) 
		И (НЕ ЗначениеЗаполнено(ДокументОбъект.Организация)) Тогда
		
		// БИТ_ЖКХ 31.01.2014
		ДокументОбъект.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");//глЗначениеПеременной("ОсновнаяОрганизация");
		
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
		
		Попытка		
			
			ДокументОбъект.Ответственный = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
			
		Исключение
			
			ДокументОбъект.Ответственный = ТекПользователь;
			
		КонецПопытки;
		// БИТ_ЖКХ 31.01.2014
		
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("Касса", МетаданныеДокумента) Тогда
		ДокументОбъект.Ответственный = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяКассаККМ");
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

// БИТ_ЖКХ 01.04.2015{{
Функция ПолучитьКонстантуЗаголовокСистемы() Экспорт
	
	Возврат Строка(Константы.ЗаголовокСистемы.Получить());	
	
КонецФункции
// БИТ_ЖКХ 01.04.2015}}

// Функция определяет работает ли данный вид сравнения со списком или нет.
//
// Параметры:
//  ТекВидСравнения - ВидСравенения.
//
// Возвращаемое значение:
//  флДляСписка – Булево.
//
Функция ЭтоВидСравненияДляСписка(ТекВидСравения) Экспорт

	МассивВидовДляСписка = Новый Массив;
	МассивВидовДляСписка.Добавить(ВидСравнения.ВСписке);
	МассивВидовДляСписка.Добавить(ВидСравнения.НеВСписке);
	МассивВидовДляСписка.Добавить(ВидСравнения.ВСпискеПоИерархии);
	МассивВидовДляСписка.Добавить(ВидСравнения.НеВСпискеПоИерархии);
	
	Если МассивВидовДляСписка.Найти(ТекВидСравения) = Неопределено Тогда
	   флДляСписка = Ложь;
	Иначе	
	   флДляСписка = Истина;
	КонецЕсли; 

	Возврат флДляСписка;
	
КонецФункции // ЭтоВидСравненияДляСписка()

Функция СведенияОбАдресе(ЗначенияПолей, Поле = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначенияПолей) Тогда
		Возврат "";
	КонецЕсли;
	СтруктураПолейАдреса =  бит_ОбщегоНазначенияПовтИсп.СведенияОбАдресе(ЗначенияПолей);
	Если ЗначениеЗаполнено(Поле) Тогда
		
		Если Поле = "Дом" Тогда
			
			Возврат СтруктураПолейАдреса.Здание.Номер;
			
		ИначеЕсли Поле = "НаселенныйПункт" Тогда
				НаселенныйПункт = ?(ЗначениеЗаполнено(СтруктураПолейАдреса.Город), СтруктураПолейАдреса.Город + ", ", "") 
									+ ?(ЗначениеЗаполнено(СтруктураПолейАдреса.ВнутригородскойРайон), СтруктураПолейАдреса.ВнутригородскойРайон + ", ", "")
									+ ?(ЗначениеЗаполнено(СтруктураПолейАдреса.НаселенныйПункт), СтруктураПолейАдреса.НаселенныйПункт, "");
				НаселенныйПункт = СокрЛП(НаселенныйПункт);					
				Если ЗначениеЗаполнено(НаселенныйПункт) И СтрЗаканчиваетсяНа(НаселенныйПункт,",") Тогда // Убираем запятую.
					НаселенныйПункт = Лев(НаселенныйПункт, СтрДлина(НаселенныйПункт) - 1);
				КонецЕсли;					
									
			Возврат  СокрЛП(НаселенныйПункт);
			
		ИначеЕсли Поле = "Корпус" Тогда
			
			Если СтруктураПолейАдреса.Корпуса.Количество() > 0 Тогда
				Возврат СтруктураПолейАдреса.Корпуса[0].Номер;
			Иначе
				Возврат СтруктураПолейАдреса.Корпус;
			КонецЕсли; 
	
		Иначе
			
			Возврат СтруктураПолейАдреса[Поле];
			
		КонецЕсли;
		
	Иначе
		Возврат СтруктураПолейАдреса;
	КонецЕсли;
	
КонецФункции

//Функция НомерТелефонаКонтактнойИнформации(Знач XMLСтрока) Экспорт
//	
//	тт =  бит_ОбщегоНазначенияПовтИсп.НомерТелефонаКонтактнойИнформации(XMLСтрока);
//	Возврат "";
//	//Возврат  бит_ОбщегоНазначенияПовтИсп.НомерТелефонаКонтактнойИнформации(XMLСтрока);
//	
//КонецФункции

Функция БанковскиеРеквизитыДляПечати(СсылкаИлиОбъект) Экспорт

	БанковскиеРеквизиты = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СсылкаИлиОбъект);
	
	СтрокаБанковскиеРеквизиты = "";	
	Если ЗначениеЗаполнено(БанковскиеРеквизиты.НомерСчета)
		И ЗначениеЗаполнено(БанковскиеРеквизиты.БИК)
		И ЗначениеЗаполнено(БанковскиеРеквизиты.КоррСчет)
		И ЗначениеЗаполнено(БанковскиеРеквизиты.Банк) Тогда
		
		СтрокаБанковскиеРеквизиты = НСтр("ru = 'р/с: %1, БИК/Корр. счет: %2/%3, Банк: %4'");
		СтрокаБанковскиеРеквизиты = СтрШаблон(СтрокаБанковскиеРеквизиты, БанковскиеРеквизиты.НомерСчета, БанковскиеРеквизиты.БИК 
																		, БанковскиеРеквизиты.КоррСчет, БанковскиеРеквизиты.Банк);
	КонецЕсли;
	
	Возврат СтрокаБанковскиеРеквизиты;
	
КонецФункции

Функция ПолучитьЗначность(Значение) Экспорт
	
	Попытка
		Возврат СтрДлина(Строка(Значение));
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

// Дополняет строку символами слева или справа до заданной длины и возвращает ее.
// При этом удаляются незначащие символы слева и справа (подробнее про незначащие символы 
// см. синтаксис-помощник к методу платформы СокрЛП). 
// По умолчанию функция дополняет строку символами "0" (ноль) слева.
//
// Параметры:
//  Значение    - Строка - исходная строка, которую необходимо дополнить символами;
//  ДлинаСтроки - Число  - требуемая результирующая длина строки;
//  Символ      - Строка - символ, которым необходимо дополнить строку;
//  Режим       - Строка - "Слева" или "Справа" - вариант добавления символов к исходной строке.
// 
// Возвращаемое значение:
//  Строка - строка, дополненная символами.
//
// Пример:
//  1. Результат = СтроковыеФункцииКлиентСервер.ДополнитьСтроку("1234", 10, "0", "Слева");
//  Возвращает: "0000001234".
//
//  2. Результат = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(" 1234  ", 10, "#", "Справа");
//  Строка = " 1234  "; ДлинаСтроки = 10; Символ = "#"; Режим = "Справа"
//  Возвращает: "1234######".
//
Функция ДополнитьСтроку(Знач Значение, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева") Экспорт
	
	// Длина символа не должна превышать единицы.
	Символ = Лев(Символ, 1);
	
	// Удаляем крайние пробелы слева и справа строки.
	Значение = СокрЛП(Значение);
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Значение);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = СформироватьСтрокуСимволов(Символ, КоличествоСимволовНадоДобавить);
		Если ВРег(Режим) = "СЛЕВА" Тогда
			Значение = СтрокаДляДобавления + Значение;
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			Значение = Значение + СтрокаДляДобавления;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Формирует строку повторяющихся символов заданной длины.
//
// Параметры:
//  Символ      - Строка - символ, из которого будет формироваться строка.
//  ДлинаСтроки - Число  - требуемая длина результирующей строки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из повторяющихся символов.
//
Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФункцииОпределенияРешения

// Функция определяет, что текущее решение это "Бухгалтерия предприятия".
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоБухгалтерияПредприятия() Экспорт
	
	// Результат = Метаданные.Имя = "БухгалтерияПредприятия";.
	Сведения = ПолучитьСведенияОПрограмме();
	Имя_1С	 = Сведения.Имя_1С;
	
	Результат = (Имя_1С = "БухгалтерияПредприятия"
	Или Имя_1С = "ЭлитСтроительствоБухгалтерскийУчет"
	Или Имя_1С = "БухгалтерияПредприятияКОРП");
	
	Возврат Результат;
	
КонецФункции // ЭтоБухгалтерияПредприятия()

// Функция определяет, что текущее решение это "Бухгалтерия бюджетного учреждения".
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоБухгалтерияБюджетногоУчреждения() Экспорт
	
	// Результат = Метаданные.Имя = "БухгалтерияБюджетногоУчреждения";.
	Сведения  = ПолучитьСведенияОПрограмме();
	Результат = Сведения.Имя_1С = "БухгалтерияБюджетногоУчреждения";	
	
	Возврат Результат;
	
КонецФункции // ЭтоБухгалтерияБюджетногоУчреждения()

Функция ЭтоКОРП() Экспорт
	
	Сведения  = ПолучитьСведенияОПрограмме();
	Результат = Сведения.Имя_1С = "БухгалтерияПредприятияКОРП";
	
	Возврат Результат;
	
КонецФункции // ЭтоКОРП()

Функция ЭтоУТ() Экспорт
	
	Сведения  = ПолучитьСведенияОПрограмме();
	Результат = Сведения.Имя_1С = "УправлениеТорговлей";
	
	Возврат Результат;
	
КонецФункции // ЭтоСемействоУПП()

Функция ЭтоКомплекснаяАвтоматизация() Экспорт
	
	Сведения  = ПолучитьСведенияОПрограмме();
	Результат = Сведения.Имя_1С = "КомплекснаяАвтоматизация";
	
	Возврат Результат;
	
КонецФункции // ЭтоКомплекснаяАвтоматизация()

Функция ЭтоУПП() Экспорт
	
	Сведения  = ПолучитьСведенияОПрограмме();
	Результат = Сведения.Имя_1С = "УправлениеПроизводственнымПредприятием";
	
	Возврат Результат;
	
КонецФункции // ЭтоУПП()

Функция ЭтоСемействоУПП() Экспорт
	
	Результат = ЭтоУПП() ИЛИ ЭтоКомплекснаяАвтоматизация();
	
	Возврат Результат;
	
КонецФункции // ЭтоСемействоУПП()

Функция ЭтоИнтернационаяПоставка() Экспорт
	
	флЭтоИнт = ?(Метаданные.Языки.Найти("Английский") = Неопределено, Ложь, Истина);
	флЭтоИНТ = Ложь;
	
	Возврат флЭтоИнт;
	
КонецФункции // ЭтоИнтернационаяПоставка()

Функция ЭтоБП() Экспорт
	
	Сведения  = ПолучитьСведенияОПрограмме();
	Результат = Сведения.Имя_1С = "БухгалтерияПредприятия";
	
	Возврат Результат;
	
КонецФункции // ЭтоБП()

Функция ЭтоСемействоБП() Экспорт
	
	Результат = ЭтоБП();
	
	Возврат Результат;
	
КонецФункции // ЭтоСемействоБП()

Функция ПолучитьНаборЗаписейСОтбором(Регистр, СоответствиеОтбора, Прочитать = Ложь) Экспорт
	
	НаборЗаписей = Регистр.СоздатьНаборЗаписей();
	
	Для каждого Элемент Из СоответствиеОтбора Цикл
		
		ПолеОтбора = Элемент.Ключ;
		Значение   = Элемент.Значение;
		
		НаборЗаписей.Отбор[ПолеОтбора].Установить(Значение);
		
	КонецЦикла;
	
	Если Прочитать Тогда
		НаборЗаписей.Прочитать();	
	КонецЕсли; 
	
	Возврат НаборЗаписей;
	
КонецФункции // ПолучитьНаборЗаписейСОтбором()

#КонецОбласти

#Область ФункцииОпределенияРешенияБит

Функция ЭтоУУ() Экспорт
	
	// Получим литеру решения БИТ.
	Решение_БИТ = ОпределитьЛитеруРешения();
	
	Результат = (Решение_БИТ = "F");
	
	Возврат Результат;
	
КонецФункции // ЭтоУУ()

Функция ЭтоПРОФ() Экспорт
	
	// Получим литеру решения БИТ.
	Решение_БИТ = ОпределитьЛитеруРешения();
	
	Результат = (Решение_БИТ = "P");
	
	Возврат Результат;
	
КонецФункции // ЭтоПроф()

Функция ЭтоСтандарт() Экспорт
	
	// Получим литеру решения БИТ.
	Решение_БИТ = ОпределитьЛитеруРешения();
	
	Результат = (Решение_БИТ = "S");
	
	Возврат Результат;
	
КонецФункции // ЭтоСтандарт()

Функция ЭтоУДС() Экспорт
	
	// Получим литеру решения БИТ.
	Решение_БИТ = ОпределитьЛитеруРешения();
	
	Результат = (Решение_БИТ = "L");
	
	Возврат Результат;
	
КонецФункции // ЭтоУДС()

Функция ОпределитьЛитеруРешения()  Экспорт
	
	Литера = "F";
	Если Метаданные.ОбщиеМодули.Найти("бит_МеханизмХозяйственныхОпераций") <> Неопределено Тогда
		Литера = "F";
	Иначе	
		Если Метаданные.ОбщиеМодули.Найти("бит_БюджетированиеБалансовыйУчет") <> Неопределено Тогда
			Литера = "P";
		Иначе	
			Если Метаданные.Документы.Найти("бит_ФормаВводаБюджета") <> Неопределено Тогда
				Литера = "S";
			Иначе	
				Литера = "L";
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Литера;
	
КонецФункции // ОпределитьЛитеруРешения()

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСоСвойствамиИКатегориямиОбъектов

Функция ИзменитьПометкуНаУдалениеУОбъекта(ТекущийОбъект, ПометкаНаУдаление, Заголовок = "", 
	РежимСообщений = "Все", СтруктураПараметров = Неопределено) Экспорт
	
	ВыводитьОшибки     = (РежимСообщений = "Все" ИЛИ РежимСообщений = "Ошибки");
	ВыводитьИнформацию = РежимСообщений = "Все";
	
	Попытка
		
		ПометкаНаУдалениеУОбъекта = ТекущийОбъект.ПометкаУдаления;
		
		Если ПометкаНаУдалениеУОбъекта <> ПометкаНаУдаление Тогда
			
			УказанаСтруктураПараметров = ?(ТипЗнч(СтруктураПараметров) = Тип("Структура"), Истина, Ложь);
			
			Если УказанаСтруктураПараметров
				И СтруктураПараметров.Свойство("ОбъектПолучен") Тогда
				ПолученныйОбъект = ТекущийОбъект;
			Иначе
				ПолученныйОбъект = ТекущийОбъект.ПолучитьОбъект();
			КонецЕсли;
			
			Если УказанаСтруктураПараметров Тогда
				
				Если СтруктураПараметров.Свойство("ЭтоПометкаИзГрафикаПлатажей") Тогда
					ПолученныйОбъект.мПометкаИзГрафикаПлатажей = Истина;
				ИначеЕсли СтруктураПараметров.Свойство("ЭтоПометкаИзГрафикаНачислений") Тогда
					ПолученныйОбъект.мПометкаИзГрафикаНачислений = Истина;	
				КонецЕсли;
				
			КонецЕсли;
			
			ПолученныйОбъект.УстановитьПометкуУдаления(ПометкаНаУдаление);
			
			Если ВыводитьИнформацию Тогда
				
				Если ПометкаНаУдаление Тогда
					ТекстСообщения = "Объект «" + ТекущийОбъект.Ссылка + "» помечен на удаление.";
				Иначе
					ТекстСообщения = "У объекта «" + ТекущийОбъект.Ссылка + "» снята пометка на удаление.";
				КонецЕсли;
				
				СообщитьОбОшибке(ТекстСообщения, ,Заголовок, СтатусСообщения.Информация);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		Если ВыводитьОшибки Тогда
			
			Если ПометкаНаУдаление Тогда
				ТекстСообщения = "ru = 'Не удалось пометить на удаление объект «" + ТекущийОбъект.Ссылка + "».'";
			Иначе
				ТекстСообщения = "ru = 'Не удалось снять пометку на удаление у объекта «" + ТекущийОбъект.Ссылка + "».'";
			КонецЕсли;
			
			ТекстСообщения = НСтр(ТекстСообщения);
			
			Если УказанаСтруктураПараметров
				И СтруктураПараметров.Свойство("ОшибкуПодробно") Тогда
				ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
			КонецЕсли;
			
			СообщитьОбОшибке(ТекстСообщения,, Заголовок, СтатусСообщения.Важное);
			
		КонецЕсли;
		
	КонецПопытки;
	
	ДействиеВыполнено = ТекущийОбъект.ПометкаУдаления = ПометкаНаУдаление;
	
	Возврат ДействиеВыполнено;
	
КонецФункции // ИзменитьПометкуНаУдалениеУОбъекта()

//	Преобразует таблицу значений в массив.
//	Может использоваться для передачи на клиента данных,.
//  Полученных на сервере в виде таблицы значений в том случае, если таблица.
//	Значений содержит только такие значения, которые могут быть переданы на клиента.
//
//	Полученный массив содержит структуры, каждая из которых повторяет структуру колонок таблицы значений.
//
//	Не рекомендуется использовать для преобразования таблиц значений с большим количеством строк.
//
//	Параметры: ТаблицаЗначений.
//	Возвращаемое значение: Массив.
//
Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

Функция ПолучитьИмяОбъектаПоИмениФормы(ИмяФормы, ПолноеИмя = Истина) Экспорт
	
	МассивИмениФормы = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ИмяФормы, ".");
	Результат = ?(ПолноеИмя, МассивИмениФормы[0] + ".", "") + МассивИмениФормы[1];
	
	Возврат Результат;
	
КонецФункции // ПолучитьИмяОбъектаПоИмениФормы()

Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным, мКэшПраваДоступаКМетаданным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	ЕстьДоступКМетаданным = мКэшПраваДоступаКМетаданным.Получить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта);
	Если ЕстьДоступКМетаданным = неопределено Тогда
		Если Структура.ТипОбъекта = "Документ" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Документы[Структура.ВидОбъекта]);
		ИначеЕсли Структура.ТипОбъекта = "Задача" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Задачи[Структура.ВидОбъекта]);
		Иначе
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Справочники[Структура.ВидОбъекта]);
		КонецЕсли;
	КонецЕсли;                                                          
	
	Структура.Вставить("ЕстьДоступКМетаданным", ЕстьДоступКМетаданным);
	мКэшПраваДоступаКМетаданным.Вставить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта,ЕстьДоступКМетаданным);        
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

// Функция упаковывает таблицу значений для передачи через клиент.
//
// Параметры:
//  ТаблицаЗнч - Таблица значений.
//  
// Возвращаемое значение:
//   ХранилищеЗначений.
//
Функция УпаковатьТаблицуЗначений(ТаблицаЗнч) Экспорт
	
	УпакованнаяТаблица = Новый ХранилищеЗначения(ТаблицаЗнч);
	
	Возврат УпакованнаяТаблица;
	
КонецФункции // УпаковатьТаблицуЗначений()

// Функция распаковывает таблицу значений после передачи через клиент.
//
// Параметры:
//  УпакованнаяТаблица - Хранилище значений.
//  
// Возвращаемое значение:
//   Таблица значений.
//
Функция РаспаковатьТаблицуЗначений(УпакованнаяТаблица) Экспорт
	
	ТаблицаЗнч = УпакованнаяТаблица.Получить();
	
	Возврат ТаблицаЗнч;
	
КонецФункции // РаспаковатьТаблицуЗначений()

// Возвращает менеджер объекта по полному имени объекта метаданных.
//
// Не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя    - Строка, полное имя объекта метаданных,
//                 например, "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ...
// 
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	Перем КлассОМ, ИмяОМ, Менеджер;
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() = 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ  = ЧастиИмени[1];
	КонецЕсли;
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Менеджер = ПланыОбмена;
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Менеджер = Справочники;
		
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Менеджер = Документы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Менеджер = ЖурналыДокументов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Менеджер = Перечисления;
		
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Менеджер = Отчеты;
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Менеджер = Обработки;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Менеджер = РегистрыСведений;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Менеджер = РегистрыНакопления;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Менеджер = РегистрыБухгалтерии;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		Менеджер = РегистрыРасчета;
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Менеджер = БизнесПроцессы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Менеджер = Задачи;
		
	ИначеЕсли ВРег(КлассОМ) = "КОНСТАНТА" Тогда
		Менеджер = Константы;
		
	ИначеЕсли ВРег(КлассОМ) = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Менеджер = Последовательности;
	КонецЕсли;
	
	Если Менеджер <> Неопределено Тогда
		Попытка
			Возврат Менеджер[ИмяОМ];
		Исключение
			Менеджер = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Неизвестный тип объекта метаданных ""%1""'"), ПолноеИмя);
	
КонецФункции

#КонецОбласти

#Область ФункцииОпределенияСведений

// Функция получает сведения о текущей кофигурации.
//
//
// Возвращаемое значение:
//   Сведения - Структура.
//
Функция ПолучитьСведенияОПрограмме()  Экспорт
	
	Сведения = Новый Структура;
	
	ЗначенияПеречисления = Метаданные.Перечисления.бит_СведенияОПрограмме.ЗначенияПеречисления;
	
	Сведения.Вставить("Имя_1С"                  ,ЗначенияПеречисления.Имя_1С.Синоним);
	Сведения.Вставить("Синоним_1С"              ,ЗначенияПеречисления.Синоним_1С.Синоним);	
	Сведения.Вставить("НомерРелиза_1С"          ,ЗначенияПеречисления.НомерРелиза_1С.Синоним);
	Сведения.Вставить("Имя_БИТ"                 ,ЗначенияПеречисления.Имя_БИТ.Синоним);
	Сведения.Вставить("Синоним_БИТ"             ,ЗначенияПеречисления.Синоним_БИТ.Синоним);	
	Сведения.Вставить("НомерРелиза_БИТ"         ,ЗначенияПеречисления.НомерРелиза_БИТ.Синоним);
	Сведения.Вставить("Решение_БИТ"             ,ЗначенияПеречисления.Решение_БИТ.Синоним);
	Сведения.Вставить("Версия_АдаптерЗащиты"    ,ЗначенияПеречисления.Версия_АдаптерЗащиты.Синоним);
	Сведения.Вставить("Версия_КомпонентаЗащиты" ,ЗначенияПеречисления.Версия_КомпонентаЗащиты.Синоним);	
	
	Возврат Сведения;
	
КонецФункции // ПолучитьСведенияОПрограмме()

// Функция Проверяет наличие файла на носителе.
//
// Параметры:
// ПроверяемыйФайл - Строка - путь к файлу.
//
// Возвращаемое значение:
// Булево.
//
Функция ФайлСуществует(ПроверяемыйФайл) Экспорт;
	
	ФайлНаДиске = Новый Файл(ПроверяемыйФайл);
	
	Возврат ФайлНаДиске.Существует();
	
КонецФункции

// Функция получает версию файла посредством использования WMI.
//
// Параметры:
//  ИмяФайла  – Строка.
//  ВыводитьСообщения - Булево.
//
// Возвращаемое значение:
//   ВерсияФайла   – Строка.
//
Функция ПолучитьВерсиюФайла(ИмяФайла,ВыводитьСообщения=Истина) Экспорт
	
	ВерсияФайла = "";
	
	Locator = Неопределено;
	Попытка
		
		Locator = Новый COMОбъект("WbemScripting.SWbemLocator");
		
	Исключение
		
		Если ВыводитьСообщения Тогда
			
			ТекстСообщения = "Не удалось получить версию файла "+ИмяФайла+". Не удалось подключить локатор WMI.";
			СообщитьОбОшибке(ТекстСообщения,,,СтатусСообщения.Важное);
			
		КонецЕсли; 
		
	КонецПопытки; 
	
	Если Locator <> Неопределено Тогда
		
		Попытка
			
			ServicesSet = Locator.ConnectServer(".","root\cimv2");
			
			ТекстЗапроса = "SELECT * FROM CIM_DataFile WHERE NAME = '"+ИмяФайла+"'";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"\","\\");
			
			Items = ServicesSet.ExecQuery(ТекстЗапроса);
			
			// Получение по индексу не определено, поэтому делаем один шаг цикла.
			Для каждого Item Из Items Цикл
				
				ВерсияФайла = Item.Version;
				Прервать;
				
			КонецЦикла; 
			
		Исключение
			
			Если ВыводитьСообщения Тогда
				
				ТекстСообщения = "Не удалось получить версию файла "+ИмяФайла+". Не удалось выполнить запрос WMI.";
				СообщитьОбОшибке(ТекстСообщения,,,СтатусСообщения.Важное);
				
			КонецЕсли; 
			
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ВерсияФайла;
	
КонецФункции // ПолучитьВерсиюФайла()

// Функция определяет старше версия обновления или нет. 
// Версия представляет собой строку чисел с разделителем ".".
// Например "1.1.0.256". Сравнение выполняется по-разрядно начиная со старших разрядов. Если количество разрядов не. 
// Совпадает старшей считается версия с большим количеством разрядов.
//
// Параметры:
//  ТекущаяВерсия    – Строка.
//  ВерсияОбновление - Строка.
//
// Возвращаемое значение:
//   флРезультат   – Булево.
//
Функция ВерсияОбновленияСтарше(ТекущаяВерсия,ВерсияОбновления)  Экспорт
	
	флРезультат = Ложь;
	
	МассивТекущаяВерсия      = РазобратьСтрокуСРазделителями(ТекущаяВерсия,".");
	МассивВерсияОбновления   = РазобратьСтрокуСРазделителями(ВерсияОбновления,"."); 
	
	КоличествоТекущаяВерсия    = МассивТекущаяВерсия.Количество();
	КоличествоВерсияОбновления = МассивВерсияОбновления.Количество();
	
	Если КоличествоТекущаяВерсия = КоличествоВерсияОбновления Тогда
		
		ПреобразоватьМассивСтрокВЧисла(МассивТекущаяВерсия);
		ПреобразоватьМассивСтрокВЧисла(МассивВерсияОбновления);
		
		Для Значение = 1 По КоличествоТекущаяВерсия Цикл
			
			Если МассивВерсияОбновления[Значение-1] > МассивТекущаяВерсия[Значение-1] Тогда
				
				флРезультат = Истина;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Иначе	
		
		Если КоличествоВерсияОбновления > КоличествоТекущаяВерсия Тогда
			
			флРезультат = Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат флРезультат;
	
КонецФункции // ВерсияОбновленияСтарше()

// Функция получает имена папок специального назначения по идентификатору.
// Например, Application Data.
// Ид папок приведены в MSDN.
//
// Параметры:
//  ИдПапки  – Число,Строка.
//  ВыводитьСообщения  – Булево.
//
// Возвращаемое значение:
//   ИмяПапки   – Строка.
//
Функция ПолучитьИмяСпецПапки(ИдПапки,ВыводитьСообщения=Ложь)  Экспорт
	
	ИмяПапки = "";
	
	Попытка
		
		objShell = Новый COMОбъект("Shell.Application");
		objFolder = objShell.Namespace(ИдПапки);
		objFolderItem = objFolder.Self;
		ИмяПапки = objFolderItem.Path;
		
	Исключение
		
		Если ВыводитьСообщения Тогда
			
			СообщитьОбОшибке("Не удалось определить имя папки по ИД """+ИдПапки+"""!",,,СтатусСообщения.Важное);
			
		КонецЕсли; 
		
	КонецПопытки;
	
	Возврат ИмяПапки;
	
КонецФункции // ПолучитьИмяСпецПапки()

// Функция выполняет создание каталога.
//
// Параметры:
//  ИмяКаталога        – Строка.
//  РежимСообщений     – Строка.
//
// Возвращаемое значение:
//   ДействиеВыполнено   – Булево.
//
Функция ВыполнитьСозданиеКаталога(ИмяКаталога,РежимСообщений = "Все")  Экспорт
	
	ДействиеВыполнено = Ложь;
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	Попытка
		
		СоздатьКаталог(ИмяКаталога);
		ДействиеВыполнено = Истина;
		
		Если ВыводитьИнформацию Тогда
			
			СообщитьОбОшибке("Создан каталог """+ИмяКаталога+"""",,,СтатусСообщения.Информация);
			
		КонецЕсли; 
		
	Исключение
		
		Если ВыводитьОшибки Тогда
			
			СообщитьОбОшибке("Не удалось создать каталог """+ИмяКаталога+"""!",,,СтатусСообщения.Важное);
			
		КонецЕсли; 
		
	КонецПопытки;	
	
	Возврат ДействиеВыполнено;
	
КонецФункции // СоздатьПапку()

// Функция разбирает строку с разделителями и упаковывает значения в массив.
//
// Параметры:
//  ИсходнаяСтрока  – Строка.
//  Разделитель     - Строка.
//
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока,Разделитель) Экспорт
	
	РезМассив = Новый Массив;
	
	Стр = ИсходнаяСтрока;
	КоличествоРазделителей = СтрЧислоВхождений(Стр,Разделитель);
	Для Значение = 1 По КоличествоРазделителей+1 Цикл
		
		ПозицияРазделителя = Найти(Стр,Разделитель);
		Если ПозицияРазделителя >0 Тогда
			ТекущееИмя = Лев(Стр,ПозицияРазделителя-1);
			Стр = Сред(Стр,ПозицияРазделителя+1);
		Иначе
			ТекущееИмя = СокрЛП(Стр);
		КонецЕсли; 
		РезМассив.Добавить(ТекущееИмя);
		
	КонецЦикла;
	
	Возврат РезМассив;
	
КонецФункции //РазобратьСтрокуСРазделителями()

// Процедура преобразовывает массив строк в массив чисел. 
// В случае невозможности преобразования элемента, элементу присваивается -1.
//
// Параметры:
//  МассивСтрок  – Массив.
//
Процедура ПреобразоватьМассивСтрокВЧисла(МассивСтрок)
	
	Для Значение = 1 По МассивСтрок.Количество() Цикл
		
		Попытка
			
			МассивСтрок[Значение-1] = Число(МассивСтрок[Значение-1]);
			
		Исключение
			
			МассивСтрок[Значение-1] = -1;
			
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры //ПреобразоватьМассивСтрокВЧисла()

// Функция добавляет новую строку к строке. 
// Если исходная строка не пуста, вставляется разделитель.
//
// Параметры:
//  ИсходнаяСтрока    - Строка.
//  СтрокаДополнение  - Строка.
//  Разделитель       - Строка.
//
// ВозвращаемоеЗначение:
//  РезСтрока - Строка.
//
Функция ДобавитьСтрокуСРазделителем(ИсходнаяСтрока,СтрокаДополнение,Разделитель="") Экспорт
	
	РезСтрока = ИсходнаяСтрока+?(ПустаяСтрока(ИсходнаяСтрока),"",Разделитель)+СтрокаДополнение;
	
	Возврат РезСтрока;
	
КонецФункции // ДобавитьСтрокуСРазделителем()

Функция ПолучитьНомерРелиза_1С() Экспорт
	
	Возврат бит_ОбщегоНазначенияПовтИсп.ПолучитьНомерРелиза_1С();
	//Возврат Метаданные.Перечисления.бит_СведенияОПрограмме.ЗначенияПеречисления.НомерРелиза_1С.Синоним;
	
КонецФункции // ПолучитьНомерРелиза_1С()

// Функция получает номер релиза типовой конфигурации из перечисления бит_СведенияОПрограмме.
//
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьНомерРелиза_бит() Экспорт
	
	Возврат бит_ОбщегоНазначенияПовтИсп.ПолучитьНомерРелиза_бит();
	//Возврат Метаданные.Перечисления.бит_СведенияОПрограмме.ЗначенияПеречисления.НомерРелиза_БИТ.Синоним;
	
КонецФункции // ПолучитьНомерРелиза_1С()

#КонецОбласти

#Область ПроцедурыВыводыСообщенийИСостояний

Процедура бит_Состояние(ТекстСостояния) Экспорт
	
	#Если Клиент Тогда
		Если НЕ ПустаяСтрока(ТекстСостояния) Тогда
			Состояние(ТекстСостояния);	
		Иначе
			Состояние();
		КонецЕсли; 
	#КонецЕсли 	
	
КонецПроцедуры // бит_Состояние()

#КонецОбласти

#Область СведенияИзРегистровКвартирыКомнаты

// Функция возвращает менеджер записи регистра бит_СведенияОКвартире для изменения данных в этом месяце.
// Или создает новую запись, если данные в регистре не за текущий месяц.
//
// Параметры:
//  Квартира - Элемент справочника бит_Квартиры.
//
// Возвращаемое значение:
// Запись - менеджер записи, либо набор записей регитра сведений бит_СведенияОКвартире.
//
Функция ПолучитьСведенияОКвартире(Квартира, Дата) Экспорт
	
	// БИТ_ЖКХ 29.07.2010. 
	// Удалены закоментированые участки кода.
	
	ВыборкаРегистра = РегистрыСведений.бит_СведенияОКвартире.Выбрать(,Дата,Новый Структура ("Квартира",Квартира));
	Пока ВыборкаРегистра.Следующий() Цикл

		Если Год(ВыборкаРегистра.Период) <> Год(Дата) ИЛИ Месяц(ВыборкаРегистра.Период) <> Месяц(Дата)Тогда
			Запись = РегистрыСведений.бит_СведенияОКвартире.СоздатьНаборЗаписей();
			ЗаписьСтрока = Запись.Добавить();
			ЗаписьСтрока.Период         = Дата;
			ЗаписьСтрока.Квартира       = Квартира;
			ЗаписьСтрока.ТипКвартиры    = ВыборкаРегистра.ТипКвартиры;
			ЗаписьСтрока.СтатусКвартиры = ВыборкаРегистра.СтатусКвартиры;
			ЗаписьСтрока.ОбщаяПлощадь   = ВыборкаРегистра.ОбщаяПлощадь;
			ЗаписьСтрока.ЖилаяПлощадь   = ВыборкаРегистра.ЖилаяПлощадь;
			ЗаписьСтрока.ОтапливаемаяПлощадь = ВыборкаРегистра.ОтапливаемаяПлощадь;
			ЗаписьСтрока.СовокупнаяПлощадь   = ВыборкаРегистра.СовокупнаяПлощадь;
			ЗаписьСтрока.МОП                 = ВыборкаРегистра.МОП;
			ЗаписьСтрока.ТипЗапирающегоУстройства = ВыборкаРегистра.ТипЗапирающегоУстройства;
			ЗаписьСтрока.ТипПлиты                 = ВыборкаРегистра.ТипПлиты;
			// БИТ_ЖКХ_17012014_начало_изменений
			ЗаписьСтрока.ЖилоеПомещениеСпециализированногоЖилищногоФонда = ВыборкаРегистра.ЖилоеПомещениеСпециализированногоЖилищногоФонда;
			// БИТ_ЖКХ_17012014_окончание_изменений
			// БИТ_ЖКХ 02.05.2017 15:54:26 Начало правки...
			ЗаписьСтрока.ПлощадьОДНСОИЭлектроснаб	= ВыборкаРегистра.ПлощадьОДНСОИЭлектроснаб;
			ЗаписьСтрока.ПлощадьОДНСОИВодоснаб		= ВыборкаРегистра.ПлощадьОДНСОИЭлектроснаб;
			// БИТ_ЖКХ 02.05.2017 15:54:26 Конец правки.  
			//Мельник 30.01.25
			ЗаписьСтрока.лб_ПредставлениеКвартиры        = ВыборкаРегистра.лб_ПредставлениеКвартиры;
			ЗаписьСтрока.лб_ИгнорироватьСальдоСвоихУслуг = ВыборкаРегистра.лб_ИгнорироватьСальдоСвоихУслуг;
			ЗаписьСтрока.лб_НеВыводитьСтрокуДомофон      = ВыборкаРегистра.лб_НеВыводитьСтрокуДомофон;
			ЗаписьСтрока.лб_ПлощадьКапремонта            = ВыборкаРегистра.лб_ПлощадьКапремонта;
			
		Иначе
			Запись = ВыборкаРегистра.ПолучитьМенеджерЗаписи();
		КонецЕсли;
	КонецЦикла;
	
	// БИТ_ЖКХ изменение кода. Начало. 26.10.2011{{
	Если Запись = Неопределено Тогда
		
		Запись = РегистрыСведений.бит_СведенияОКвартире.СоздатьМенеджерЗаписи();
		Запись.Период   = Дата;
		Запись.Квартира = Квартира;
		
		Запись.Прочитать();
		
		Запись.Квартира = Квартира;
		Запись.Период   = Дата;
		
	КонецЕсли; 
	// БИТ_ЖКХ изменение кода. Конец. 26.10.2011}}
	
	Возврат Запись;
	
КонецФункции // битПолучитьСведенияОКвартире()

// Процедура изменяет данные о квартире в регистре сведений "бит_СведенияОКвартире".
//
// Параметры:
//   Запись - набор записей или менеджер записи регистра бит_СведенияОКвартире.
//   РесурсИзменения - ресурс, значение которого необходимо изменить в регистре.
//   Значение - новое значение ресурса, которое следует записать.
//
Процедура ИзменитьДанныеОКвартире(Запись,РесурсИзменения,Значение) Экспорт  
	Если ТипЗнч(Запись) = Тип("РегистрСведенийНаборЗаписей.бит_СведенияОКвартире") Тогда
		Если РесурсИзменения = "ОбщаяПлощадь" Тогда
			Запись[0].ОбщаяПлощадь = Значение;
			Если Запись[0].ОтапливаемаяПлощадь = 0 Тогда
				Запись[0].ОтапливаемаяПлощадь = Значение;
			КонецЕсли;
			
		ИначеЕсли РесурсИзменения = "ЖилаяПлощадь" Тогда
			Запись[0].ЖилаяПлощадь = Значение;
		ИначеЕсли РесурсИзменения = "ОтапливаемаяПлощадь" Тогда
			Запись[0].ОтапливаемаяПлощадь = Значение;
		ИначеЕсли РесурсИзменения = "МОП" Тогда
			Запись[0].МОП = Значение;
		ИначеЕсли РесурсИзменения = "СовокупнаяПлощадь" Тогда
			Запись[0].СовокупнаяПлощадь = Значение;
		ИначеЕсли РесурсИзменения = "СтатусКвартиры" Тогда
			Запись[0].СтатусКвартиры = Значение;
		ИначеЕсли РесурсИзменения = "ТипКвартиры" Тогда
			Запись[0].ТипКвартиры = Значение;
			// БИТ_ЖКХ добавление кода Начало: 12.08.2010 
		ИначеЕсли РесурсИзменения = "ТипПлиты" Тогда
			Запись[0].ТипПлиты = Значение;
		ИначеЕсли РесурсИзменения = "ТипЗапирающегоУстройства" Тогда
			Запись[0].ТипЗапирающегоУстройства = Значение;
			// БИТ_ЖКХ добавление кода конец : 12.08.2010
			// БИТ_ЖКХ_17012014_начало_изменений
		ИначеЕсли РесурсИзменения = "ЖилоеПомещениеСпециализированногоЖилищногоФонда" Тогда
			Запись[0].ЖилоеПомещениеСпециализированногоЖилищногоФонда = Значение;
			// БИТ_ЖКХ_17012014_окончание_изменений
		// БИТ_ЖКХ 25.04.2017 16:15:03 Начало правки...
		ИначеЕсли РесурсИзменения = "ПлощадьОДНСОИЭлектроснаб" Тогда
			Запись[0].ПлощадьОДНСОИЭлектроснаб = Значение;
		ИначеЕсли РесурсИзменения = "ПлощадьОДНСОИВодоснаб" Тогда
			Запись[0].ПлощадьОДНСОИВодоснаб = Значение;
		// БИТ_ЖКХ 25.04.2017 16:15:03 Конец правки.	
		КонецЕсли;
		Если Запись[0].ОбщаяПлощадь >= Запись[0].ЖилаяПлощадь Тогда 
			Запись.Записать(Ложь);
			
		Иначе 

			ТекстСообщения = НСтр("ru = 'Общая площадь меньше жилой площади.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;		
	Иначе
		Если РесурсИзменения = "ОбщаяПлощадь" Тогда
			Запись.ОбщаяПлощадь = Значение;
			Если Запись.ОтапливаемаяПлощадь = 0 Тогда
				Запись.ОтапливаемаяПлощадь = Значение;
			КонецЕсли;
		ИначеЕсли РесурсИзменения = "ЖилаяПлощадь" Тогда
			Запись.ЖилаяПлощадь = Значение;
		ИначеЕсли РесурсИзменения = "ОтапливаемаяПлощадь" Тогда
			Запись.ОтапливаемаяПлощадь = Значение;
		ИначеЕсли РесурсИзменения = "МОП" Тогда
			Запись.МОП = Значение;
		ИначеЕсли РесурсИзменения = "СовокупнаяПлощадь" Тогда
			Запись.СовокупнаяПлощадь = Значение;
		ИначеЕсли РесурсИзменения = "СтатусКвартиры" Тогда
			Запись.СтатусКвартиры = Значение;
		ИначеЕсли РесурсИзменения = "ТипКвартиры" Тогда
			Запись.ТипКвартиры = Значение;
			// БИТ_ЖКХ добавление кода Начало: 12.08.2010 
		ИначеЕсли РесурсИзменения = "ТипПлиты" Тогда
			Запись.ТипПлиты = Значение;
		ИначеЕсли РесурсИзменения = "ТипЗапирающегоУстройства" Тогда
			Запись.ТипЗапирающегоУстройства = Значение;
			// БИТ_ЖКХ добавление кода конец : 12.08.2010
			// БИТ_ЖКХ_17012014_начало_изменений
		ИначеЕсли РесурсИзменения = "ЖилоеПомещениеСпециализированногоЖилищногоФонда" Тогда
			Запись.ЖилоеПомещениеСпециализированногоЖилищногоФонда = Значение;
			// БИТ_ЖКХ_17012014_окончание_изменений
		// БИТ_ЖКХ 25.04.2017 16:15:45 Начало правки...
		ИначеЕсли РесурсИзменения = "ПлощадьОДНСОИЭлектроснаб" Тогда
			Запись.ПлощадьОДНСОИЭлектроснаб = Значение;
		ИначеЕсли РесурсИзменения = "ПлощадьОДНСОИВодоснаб" Тогда
			Запись.ПлощадьОДНСОИВодоснаб = Значение;
		// БИТ_ЖКХ 25.04.2017 16:15:45 Конец правки.	
		КонецЕсли;
		
		Если Запись.ОбщаяПлощадь >= Запись.ЖилаяПлощадь Тогда 
			Запись.Записать();
			
		Иначе 
			
			ТекстСообщения = НСтр("ru = 'Общая площадь меньше жилой площади.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

// Процедура изменяет данные о квартире в регистре сведений "бит_СведенияОКомнате".
//
// Параметры:
//   Запись - набор записей или менеджер записи регистра бит_СведенияОКомнате.
//   РесурсИзменения - ресурс, значение которого необходимо изменить в регистре.
//   Значение - новое значение ресурса, которое следует записать.
//
Процедура ИзменитьДанныеОКомнате(Запись,РесурсИзменения,Значение) Экспорт  
	Если ТипЗнч(Запись) = Тип("РегистрСведенийНаборЗаписей.бит_СведенияОКомнате") Тогда
		Если РесурсИзменения = "Высота" Тогда
			Запись[0].Высота = Значение;
		ИначеЕсли РесурсИзменения = "Площадь" Тогда
			Запись[0].Площадь = Значение;
		КонецЕсли;
		Запись.Записать(Ложь);
	Иначе
		Если РесурсИзменения = "Высота" Тогда
			Запись.Высота = Значение;
		ИначеЕсли РесурсИзменения = "Площадь" Тогда
			Запись.Площадь = Значение;
		КонецЕсли;
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры

// Функция возвращает менеджер записи регистра бит_СведенияОКомнате для изменения данных в этом месяце.
// Или создает новую запись, если данные в регистре не за текущий месяц.
//
// Параметры:
//  Комната - Элемент справочника бит_Комната.
//
// Возвращаемое значение:
// Запись - менеджер записи, либо набор записей регитра сведений бит_СведенияОКомнате.
//
Функция ПолучитьСведенияОКомнате(Комната, Дата) Экспорт
	
	ВыборкаРегистра = РегистрыСведений.бит_СведенияОКомнате.Выбрать(,Дата,Новый Структура ("Комната",Комната));
	Пока ВыборкаРегистра.Следующий() Цикл
		
		Если Год(ВыборкаРегистра.Период) <> Год(Дата) ИЛИ Месяц(ВыборкаРегистра.Период) <> Месяц(Дата)Тогда
			Запись = РегистрыСведений.бит_СведенияОКомнате.СоздатьНаборЗаписей();
			ЗаписьСтрока = Запись.Добавить();
			
			ЗаписьСтрока.Период         = Дата;
			ЗаписьСтрока.Комната       	= Комната;
			ЗаписьСтрока.Высота    		= ВыборкаРегистра.Высота;
			ЗаписьСтрока.Площадь 		= ВыборкаРегистра.Площадь;
		Иначе
			Запись = ВыборкаРегистра.ПолучитьМенеджерЗаписи();
		КонецЕсли;
	КонецЦикла;
	
	Если Запись = Неопределено Тогда
		
		Запись = РегистрыСведений.бит_СведенияОКомнате.СоздатьМенеджерЗаписи();
		Запись.Период   = Дата;
		Запись.Комната = Комната;
		
		Запись.Прочитать();
		
		Запись.Комната = Комната;
		Запись.Период   = Дата;
		
	КонецЕсли; 
	
	Возврат Запись;
	
КонецФункции // битПолучитьСведенияОКомнате()

#КонецОбласти

#Область ПроцедурыИФункцииИнтерфейсов

// Выполняет обновление сохраненых интерфесов. 
//
Процедура ОбновитьСохраненныеИнтерфейсыПользователя() Экспорт
	
	Обновить = Истина;	
	
КонецПроцедуры

// Процедура переключает интерфейс. 
//
Процедура ПереключитьИнтерфейсЖКХ() Экспорт
	
	#Если Клиент Тогда
		ГлавныйИнтерфейс.ПереключитьИнтерфейс("бит_ЖКХ,бит_Общий");
		
		Оповестить("ПереключениеИнтерфейса");
	#КонецЕсли
	
КонецПроцедуры // ()

// Процедура переключает интерфейс. 
// 
Процедура ПереключитьИнтерфейсЖКХПолный() Экспорт
	
	#Если Клиент Тогда
		ГлавныйИнтерфейс.ПереключитьИнтерфейс("Полный,бит_ЖКХ,бит_Общий");
		
		Оповестить("ПереключениеИнтерфейса");
	#КонецЕсли
	
КонецПроцедуры // ()

// Процедура переключает интерфейс. 
// 
Процедура ПереключитьИнтерфейсЖКХБухгалтер() Экспорт
	
	#Если Клиент Тогда
		ГлавныйИнтерфейс.ПереключитьИнтерфейс("бит_ЖКХ,бит_Общий");
		
		Оповестить("ПереключениеИнтерфейса");
	#КонецЕсли
	
КонецПроцедуры // ()

#КонецОбласти

#Область РаботаСКассовымиОрдерами

// БИТ_ЖКХ 02.10.2015 15:25:16 Начало правки... Есть в интерфейсе бит_Кассир, глКассаККМ определена на Клиенте, для этих процедур вызывает ошибку.
// Процедура открывает список документа ПКО.
//
Процедура ОткрытьСписокПКО() Экспорт
	
	//#Если Клиент Тогда
	//	Если ЗначениеЗаполнено(глКассаККМ) Тогда
	//		
	//		Форма = Документы.ПриходныйКассовыйОрдер.ПолучитьФормуСписка();
	//		
	//		Форма.Отбор.бит_КассаККМ.Использование = Истина;
	//		Форма.Отбор.бит_КассаККМ.ВидСравнения  = ВидСравнения.Равно;
	//		Форма.Отбор.бит_КассаККМ.Значение      = глКассаККМ;
	//		
	//		Форма.ЭлементыФормы.ДокументСписок.НастройкаОтбора.бит_КассаККМ.Доступность = Ложь;
	//		
	//		Форма.Открыть();
	//	Иначе

	//		ТекстСообщения = НСтр("ru = 'Не получается обнаружить кассу ККМ. Укажите кассу через АРМ кассира.'");
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//		
	//	КонецЕсли; 
	//#КонецЕсли
	
КонецПроцедуры

// Процедура открывает список документа РКО.
//
Процедура ОткрытьСписокРКО() Экспорт
	
	//#Если Клиент Тогда
	//	Если ЗначениеЗаполнено(глКассаККМ) Тогда
	//		
	//		Форма = Документы.РасходныйКассовыйОрдер.ПолучитьФормуСписка();
	//		
	//		Форма.Отбор.бит_КассаККМ.Использование = Истина;
	//		Форма.Отбор.бит_КассаККМ.ВидСравнения  = ВидСравнения.Равно;
	//		Форма.Отбор.бит_КассаККМ.Значение      = глКассаККМ;
	//		
	//		Форма.ЭлементыФормы.ДокументСписок.НастройкаОтбора.бит_КассаККМ.Доступность = Ложь;
	//		
	//		Форма.Открыть();
	//	Иначе

	//		ТекстСообщения = НСтр("ru = 'Не получается обнаружить кассу ККМ. Укажите кассу через АРМ кассира.'");
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//		
	//	КонецЕсли; 
	//#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ДействияСРегистрамиЗаписи

// Читает набор записей регистра сведений бит_УстановленныеВизы согласно установленного отбора.
//
// Параметры:
//   СтруктураОтбор  – Структура.
//   ИмяРегистра     - Строка.
//
// Возвращаемое значение:
//   НаборЗаписей   – РегистрСведенийНаборЗаписей.бит_УстановленныеВизы.
//
Функция ПрочитатьНаборЗаписейРегистраСведений(СтруктураОтбор,ИмяРегистра) Экспорт
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	Для каждого КлючИЗначение Из СтруктураОтбор Цикл
		
		ИмяПоля = КлючИЗначение.Ключ;
		ЗначениеПоля = КлючИЗначение.Значение;
		
		НаборЗаписей.Отбор[ИмяПоля].Использование = Истина;
		НаборЗаписей.Отбор[ИмяПоля].ВидСравнения = ВидСравнения.Равно;
		НаборЗаписей.Отбор[ИмяПоля].Значение     = ЗначениеПоля;		
		
	КонецЦикла; 
	
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей;
КонецФункции // ПрочитатьНаборЗаписейРегистраСведений()

// Функция записывет набор записей регистра сведений.
//
// Параметры:
//  НаборЗаписей   – РегистрСведенийНаборЗаписей.
//  РежимСообщений - Строка: "Нет","Все","Ошибки".
//
// Возвращаемое значение:
//   ДействиеВыполнено   – Булево.
//
Функция ЗаписатьНаборЗаписейРегистра(НаборЗаписей,РежимСообщений="Все") Экспорт
	
	ДействиеВыполнено  = Ложь;
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	Попытка
		НаборЗаписей.Записать();
		ДействиеВыполнено = Истина;
	Исключение
		ТекстСообщения = "Не удалось записать набор записей "+ОписаниеОшибки();
		СообщитьОбОшибке(ТекстСообщения,,,СтатусСообщения.Важное);
		ДействиеВыполнено = Ложь;
	КонецПопытки;
	
	Возврат ДействиеВыполнено;
	
КонецФункции //ЗаписатьНаборЗаписейРегистра()

// Функция удаляет набор записей регистра сведений.
//
// Параметры:
//  НаборЗаписей   – РегистрСведенийНаборЗаписей, МенеджерЗаписи.
//  РежимСообщений - Строка: "Нет", "Все", "Ошибки".
//
// Возвращаемое значение:
//   ДействиеВыполнено – Булево.
//
Функция УдалитьНаборЗаписейРегистра(НаборЗаписей, РежимСообщений = "Все") Экспорт
	
	ДействиеВыполнено  = Ложь;
	ВрегРежимСообщений = ВРег(РежимСообщений);
	
	ВыводитьОшибки     = (ВрегРежимСообщений = "ВСЕ" Или ВрегРежимСообщений = "ОШИБКИ");
	ВыводитьИнформацию = (ВрегРежимСообщений = "ВСЕ");
	
	Попытка
		НаборЗаписей.Удалить();
		ДействиеВыполнено = Истина;
	Исключение
		ТекстСообщения = "Не удалось удалить набор записей " + ОписаниеОшибки();
		СообщитьОбОшибке(ТекстСообщения,,, СтатусСообщения.Важное);
		ДействиеВыполнено = Ложь;
	КонецПопытки;
	
	Возврат ДействиеВыполнено;
	
КонецФункции // УдалитьНаборЗаписейРегистра()

#КонецОбласти

#Область ПроцедурыИФункцииПроверкиДублейЗначенийВТабличнойЧасти

// Процедура проверяет наличие дублей значений табличной части документа.
// Если значение какого-то из реквизтов, влияющего на проведение продублировано,.
// То выставляется флаг отказа в проведении.
//
// Параметры:
//  ДокументОбъект              - объект проводимого документа. 
//  ИмяТабличнойЧасти           - табличная часть документа, для проверки дублирования строк.
//  СтруктураОбязательныхПолей  - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                       - флаг отказа в проведении.
//  Заголовок                   - строка, заголовок сообщения об ошибке проведения, по умолчанию пустая строка.
//
//  ПредставлениеТабличнойЧасти - строка, название табличной части для вывода пользователю, по умолчанию пустая строка.
//
Процедура ПроверитьДублированиеЗначенийВТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, 
	Отказ, Заголовок = "", ПредставлениеТабличнойЧасти = "") Экспорт
	
	ПредставлениеТабЧасти = ?(ПредставлениеТабличнойЧасти = "",
	ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление(),
	ПредставлениеТабличнойЧасти);
	
	ТабличнаяЧасть      = ДокументОбъект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
	
	СписокТаблиц = Новый Структура;
	
	// Цикл по проверяемым полям.
	Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл
		
		ТекущийКлюч = КлючЗначение.Ключ;
		
		ТаблицаСтрок = Новый ТаблицаЗначений;
		ТаблицаСтрок.Колонки.Добавить("Значение");
		ТаблицаСтрок.Колонки.Добавить("НомераСтрок");
		
		МассивТекЗначений = Новый Массив;
		
		// Цикл по строкам табличной части.
		Для каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			
			Значение = СтрокаТаблицы[ТекущийКлюч];
			
			НайденноеЗначение = МассивТекЗначений.Найти(Значение);
			
			Если НайденноеЗначение = Неопределено Тогда
				МассивТекЗначений.Добавить(Значение);
			Иначе
				НовСтрока = ТаблицаСтрок.Добавить();
				НовСтрока.Значение    = Значение;
				НовСтрока.НомераСтрок = СтрокаТаблицы.НомерСтроки;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаСтрок.Количество() > 0 Тогда
			СписокТаблиц.Вставить(ТекущийКлюч, ТаблицаСтрок);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючЗначение ИЗ СписокТаблиц Цикл
		
		ТаблицаСДанными = КлючЗначение.Значение;
		
		// Получаем таблицу с данными для вывода пользователю на экран.
		ТаблицаДляВывода = ПроставитьНомераСтрокДляЗначений(ТаблицаСДанными);
		
		ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
		
		ОшибкаПриПроведении("В табличной части """ + ПредставлениеТабЧасти + """, дублируются значения колонки """ + ПредставлениеРеквизита + """ в строках:", Отказ, Заголовок);
		
		Ошибки = Неопределено;
		Для Каждого ТекСтрока Из ТаблицаДляВывода Цикл
			ТекстОшибки = НСтр("ru = '     ""%1"" - %2'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ТекСтрока.Значение, ТекСтрока.НомераСтрок);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки, "");
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);

	КонецЦикла;
	
КонецПроцедуры // ПроверитьДублированиеЗначенийВТабличнойЧасти()

// Функция возвращает таблицу для вывода.
// Функция относится к процедуре "ПроверитьДублированиеЗначенийВТабличнойЧасти".
//
// Параметры:
//  ТаблицаСДанными - Тип "ТаблицаЗначений". 
//
Функция ПроставитьНомераСтрокДляЗначений(ТаблицаСДанными)
	
	ТаблицаДляПеребора = ТаблицаСДанными.Скопировать();
	ТаблицаДляПеребора.Свернуть("Значение");
	
	ТаблицаДляВывода = ТаблицаСДанными.Скопировать();
	ТаблицаДляВывода.Очистить();
	
	Для Каждого ТекЗначение ИЗ ТаблицаДляПеребора Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Значение", ТекЗначение.Значение);
		
		НайденныеСтроки = ТаблицаСДанными.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			
			НомераСтрок = "№ ";
			
			Для Каждого ТекСтрока ИЗ НайденныеСтроки Цикл
				НомераСтрок = НомераСтрок + ?(НомераСтрок = "№ ", "", ", ") + ТекСтрока.НомераСтрок;
			КонецЦикла;
			
			НовСтрока = ТаблицаДляВывода.Добавить();
			НовСтрока.Значение    = ТекЗначение.Значение;
			НовСтрока.НомераСтрок = НомераСтрок;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДляВывода;
	
КонецФункции // ПроставитьНомераСтрокДляЗначений()

// Позволяет определить есть ли в табличной части документа.
// Строки с дублирующимеся значениями заданных реквизитов (всех одновременно).
// При нахождении дублей формирует сообщения пользователю.
//
// Параметры:
//  Объект            - Объект ссылочного типа.
//  ИмяТабличнойЧасти - Имя табличной части, в которой нужно искать дубли.
//  ПоляПроверки      - Структура с перечнем реквизитов, по которым нужно искать дубли.
//                      Ключ структуры - имя реквизита, значение - признак необходимости.
//                      Поиска дублей в том числе по пустым значениям. Истина - искать.
//                      Дубли по пустым значениям реквизита, любое другое значение -. 
//                      Игнорировать строки, в которых реквизит не заполнен.
//  Отказ             - Признак отказа от дальнейшей обработки. В случае нахождения дублей выставляется в Истина.
//
// Возвращаемое значение:
//   Булево - Истина - ошибок (дублей) не обнаружено, Ложь - в противном случае.
//
Функция ПроверитьОтсутствиеДублейВТабличнойЧасти(Объект, ИмяТабличнойЧасти, ПоляПроверки, Отказ) Экспорт
	
	СтруктураОтбора = Новый Структура;
	
	ПоляПроверкиСтрокой = "";
	Для Каждого КлючИЗначение Из ПоляПроверки Цикл
		ПоляПроверкиСтрокой = ПоляПроверкиСтрокой + ", " + КлючИЗначение.Ключ;
		СтруктураОтбора.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ПоляПроверкиСтрокой = Сред(ПоляПроверкиСтрокой, 3);
	
	НаборыЗначений = Объект[ИмяТабличнойЧасти].Выгрузить(, ПоляПроверкиСтрокой);
	НаборыЗначений.Колонки.Добавить("__КоличествоВхождений", ПолучитьОписаниеТиповЧисла(10));
	НаборыЗначений.ЗаполнитьЗначения(1, "__КоличествоВхождений");
	НаборыЗначений.Свернуть(ПоляПроверкиСтрокой, "__КоличествоВхождений");
	
	НайденыДубли = Ложь;
	
	Если ПоляПроверки.Количество() > 1 Тогда
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Значения %1 повторяются в строках %2.'");
	Иначе
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Значение %1 повторяется в строках %2.'");
	КонецЕсли;
	ТекстСообщения = "";
	
	Если НаборыЗначений.Количество() <> Объект[ИмяТабличнойЧасти].Количество() Тогда
		// Есть дубли.
		Для Каждого НаборЗначений Из НаборыЗначений Цикл
			Если НаборЗначений.__КоличествоВхождений = 1 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначенияСтрокой = "";
			
			ПропуститьНаборЗначений = Ложь;
			Для Каждого КлючИЗначение Из ПоляПроверки Цикл
				Если КлючИЗначение.Значение <> Истина Тогда
					Если НЕ ЗначениеЗаполнено(НаборЗначений[КлючИЗначение.Ключ]) Тогда
						ПропуститьНаборЗначений = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				ЗначенияСтрокой = ЗначенияСтрокой + ", """ + НаборЗначений[КлючИЗначение.Ключ] + """";
			КонецЦикла;
			Если ПропуститьНаборЗначений Тогда
				Продолжить;
			КонецЕсли;
			
			НайденыДубли = Истина;
			
			ЗначенияСтрокой = Сред(ЗначенияСтрокой, 3);
			
			НомераСтрок = "";
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, НаборЗначений);
			СтрокиДубли = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаДубль Из СтрокиДубли Цикл
				НомераСтрок = НомераСтрок + ", " + Формат(СтрокаДубль.НомерСтроки, "ЧГ=");
			КонецЦикла;
			НомераСтрок = Сред(НомераСтрок, 3);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщенияОбОшибке, ЗначенияСтрокой, НомераСтрок);
		КонецЦикла;
	КонецЕсли;
	
	Если НайденыДубли Тогда
		ПредставленияРеквизитов = "";
		МетаданныеТабличнойЧасти = Объект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти];
		Для Каждого КлючИЗначение Из ПоляПроверки Цикл
			ПредставленияРеквизитов = ПредставленияРеквизитов + ", """
			+ МетаданныеТабличнойЧасти.Реквизиты[КлючИЗначение.Ключ].Представление() + """";
		КонецЦикла;
		ПредставленияРеквизитов = Сред(ПредставленияРеквизитов, 3);
		
		Если ПоляПроверки.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("ru = 'Значения в колонках %1 не должны повторяться.'");
		Иначе
			ШаблонСообщения = НСтр("ru = 'Значения в колонке %1 не должны повторяться.'");
		КонецЕсли;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ПредставленияРеквизитов)
		+ ТекстСообщения;
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТекстСообщения("СПИСОК", "КОРРЕКТНОСТЬ", , ,
		МетаданныеТабличнойЧасти.Представление(), ТекстСообщения);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект, ИмяТабличнойЧасти);
		
		Отказ = Истина;
	КонецЕсли;
	
	Возврат НЕ НайденыДубли;
	
КонецФункции // ПроверитьОтсутствиеДублейВТабличнойЧасти()

#КонецОбласти

#Область ПроцедурыИФункцииПолученияКонтактнойИнформации

// Функция находит актуальное значение адреса в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
//  ТипАдреса - тип контактной информации из перечисления(Фактический, Регистрации,Юридический,.
//	Информирования, Иностранный, Прибытия, Убытия).
//  ПолныйСписок - выбор варианта запроса: вся информация из регистра или строка.
//
// Возвращаемое значение:
//  Строка или Структура - представление найденного адреса.
//
Функция ПолучитьАдресИзКонтактнойИнформацииФизЛица(Объект, ТипАдреса = "", ПолныйСписок = Ложь) Экспорт
	
	ОбъектКонтактнойИнформации = Объект;
	
	Если НЕ ЗначениеЗаполнено(ТипАдреса) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипАдреса="Фактический" Тогда
		Начало = "Факт";
	ИначеЕсли ТипАдреса="Регистрации"
		ИЛИ ТипАдреса="Юридический" Тогда
		Начало = "Юр";
		// БИТ_ЖКХ добавление кода Начало: 06.04.2012 
	ИначеЕсли ТипАдреса="Информирования" Тогда
		Начало = "Информ";
	ИначеЕсли ТипАдреса="Иностранный" Тогда
		Начало = "Иностр";
	Иначе
		Начало = "";
	КонецЕсли;
	
	Окончание = "Проживающего";
	
	Если ТипАдреса  = "Прибытия" Тогда
		Окончание = "Прибытия";
	ИначеЕсли ТипАдреса  = "Убытия" Тогда
		Окончание = "Убытия";
	КонецЕсли;
	
	Если Начало = "" и Окончание = "Проживающего" Тогда
		Возврат "";
	КонецЕсли;
	// БИТ_ЖКХ добавление кода конец : 06.04.2012
	
	ВидАдреса = Справочники.бит_ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", ОбъектКонтактнойИнформации);
	// БИТ_ЖКХ 01.12.2010. 
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид"   , ВидАдреса);
	
	// БИТ_ЖКХ добавление кода Начало: 13.04.2012 
	Если ПолныйСписок Тогда
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Поле1,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Поле4,
		|	КонтактнаяИнформация.Поле5,
		|	КонтактнаяИнформация.Поле6,
		|	КонтактнаяИнформация.Поле7,
		|	КонтактнаяИнформация.Поле8,
		|	КонтактнаяИнформация.Поле9,
		|	КонтактнаяИнформация.Поле10,
		|	КонтактнаяИнформация.ТипДома,
		|	КонтактнаяИнформация.ТипКорпуса,
		|	КонтактнаяИнформация.ТипКвартиры
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат "";
		Иначе
			СтрокаИзРегистра = РезультатЗапроса.Выгрузить()[0];
			СтруктураАдреса = Новый Структура();
			СтруктураАдреса.Вставить("Поле1",			СтрокаИзРегистра.Поле1);
			СтруктураАдреса.Вставить("Поле2",			СтрокаИзРегистра.Поле2);
			СтруктураАдреса.Вставить("Поле3",			СтрокаИзРегистра.Поле3);
			СтруктураАдреса.Вставить("Поле4",			СтрокаИзРегистра.Поле4);
			СтруктураАдреса.Вставить("Поле5",			СтрокаИзРегистра.Поле5);
			СтруктураАдреса.Вставить("Поле6",			СтрокаИзРегистра.Поле6);
			СтруктураАдреса.Вставить("Поле7",			СтрокаИзРегистра.Поле7);
			СтруктураАдреса.Вставить("Поле8",			СтрокаИзРегистра.Поле8);
			СтруктураАдреса.Вставить("Поле9",			СтрокаИзРегистра.Поле9);
			СтруктураАдреса.Вставить("Представление",	СтрокаИзРегистра.Представление);
			СтруктураАдреса.Вставить("ТипДома",			СтрокаИзРегистра.ТипДома);
			СтруктураАдреса.Вставить("ТипКорпуса",		СтрокаИзРегистра.ТипКорпуса);
			СтруктураАдреса.Вставить("ТипКвартиры",		СтрокаИзРегистра.ТипКвартиры);
			Возврат СтруктураАдреса;
		КонецЕсли;
		
	Иначе
		// БИТ_ЖКХ добавление кода конец : 13.04.2012
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И
		|	КонтактнаяИнформация.Тип = &Тип
		|	И
		|	КонтактнаяИнформация.Вид = &Вид
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат "";
		Иначе
			Возврат РезультатЗапроса.Выгрузить()[0].Представление;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции // ПолучитьАдресИзКонтактнойИнформации()

// Функция находит актуальное значение адреса в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//  ТипАдреса - тип контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного адреса.
//
Функция ПолучитьПолныйАдресИзКонтактнойИнформацииФизЛица(Объект, ТипАдреса = "") Экспорт
	
	ОбъектКонтактнойИнформации = Объект;
	
	Если НЕ ЗначениеЗаполнено(ТипАдреса) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипАдреса="Фактический" Тогда
		Начало = "Факт";
	ИначеЕсли ТипАдреса="Регистрации"
		ИЛИ ТипАдреса="Юридический" Тогда
		Начало = "Юр";
	Иначе
		Возврат "";
	КонецЕсли;
	Окончание = "ФизЛица";
	ВидАдреса = Справочники.ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", ОбъектКонтактнойИнформации);
	// БИТ_ЖКХ 01.12.2010. 
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид"   , ВидАдреса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Поле10 + "","" + КонтактнаяИнформация.Поле1 + "","" + КонтактнаяИнформация.Поле2 + "","" + КонтактнаяИнформация.Поле3 + "","" + КонтактнаяИнформация.Поле4 + "","" + КонтактнаяИнформация.Поле5 + "","" + КонтактнаяИнформация.Поле6 + "","" + КонтактнаяИнформация.Поле7 + "","" + КонтактнаяИнформация.Поле8 + "","" + КонтактнаяИнформация.Поле9 КАК Представление
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;
	
КонецФункции // ПолучитьАдресИзКонтактнойИнформации()

// Функция находит актуальное значение телефона в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного телефона.
//
Функция ПолучитьТелефонИзКонтактнойИнформацииФизЛица(Объект) Экспорт
	
	// БИТ_ЖКХ 04.12.2015 16:35:34 Начало правки... Старая функция обрабатывала только ТелефонПроживающего, в новой ничего не меняем
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.ТелефонПроживающего)";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТелефонПроживающего = "";
	Если Выборка.Следующий() Тогда
		ТелефонПроживающего = Выборка.Представление;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект)
		И ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		
		Отбор = Новый Структура();
		// 9.11.2018
//		Отбор.Вставить("Вид", Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонПроживающего);
		Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПроживающего);

		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если НЕ Строки.Количество() = 0 Тогда
			Возврат Строки[0].Представление;
		ИначеЕсли ЗначениеЗаполнено(Объект.ТелефонПроживающего) Тогда
			Возврат Объект.ТелефонПроживающего;
		Иначе
			Возврат ТелефонПроживающего	;
		КонецЕсли;
		
	КонецЕсли;

	Возврат ТелефонПроживающего	;
	

		
	//Окончание = "Проживающего";
	//
	//ВидТелефона = Справочники.бит_ВидыКонтактнойИнформации["Телефон" + Окончание];
	//
	//Факс = "";
	//
	//Запрос = Новый Запрос;
	//
	//Запрос.УстановитьПараметр("Объект", Объект);
	//// БИТ_ЖКХ 01.12.2010. 
	//// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	//Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Телефон);
	//Запрос.УстановитьПараметр("Вид"   , ВидТелефона);
	//
	//Если Окончание = "Организации" Тогда
	//	Если Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
	//		Запрос.УстановитьПараметр("Объект", Объект.ИндивидуальныйПредприниматель);
	//		Запрос.УстановитьПараметр("Вид"   , Справочники.бит_ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Запрос.Текст = "
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	КонтактнаяИнформация.Представление
	//|ИЗ
	//|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	//|ГДЕ
	//|	КонтактнаяИнформация.Объект = &Объект
	//|	И
	//|	КонтактнаяИнформация.Тип = &Тип
	//|	И
	//|	КонтактнаяИнформация.Вид = &Вид
	//|";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат "";
	//Иначе
	//	Возврат РезультатЗапроса.Выгрузить()[0].Представление + Факс;
	//КонецЕсли;
	// БИТ_ЖКХ 04.12.2015 16:51:03 Конец правки. 
	
КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()

#КонецОбласти

#Область ПроцедурыИФункцииОплатыКоммунальныхУслуг

// Процедура распределяет сумму документа по пени".
// Параметры:
// КоммунальныеУслуги - таб. часть документа.
// СуммаДокумента - сумма для распределения.
//
Процедура РаспределитьСуммуПоПени(КоммунальныеУслуги, СуммаДокумента, СуммаДляРаспределения
	// БИТ_ЖКХ 02.07.2014
	,НачислятьПениСУчетомПереплаты
	// БИТ_ЖКХ 02.07.2014
	
	// БИТ_ЖКХ 01.09.2014
	,ИтогОплата)
	// БИТ_ЖКХ 01.09.2014
	
	ИтогКОплате   = 0;
	Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
		
		// БИТ_ЖКХ 02.07.2014
		// ИтогКОплате = ИтогКОплате + ?(ТекСтрока.СальдоНаНачало > 0,Текстрока.СальдоНаНачало,0);. 
		Если НачислятьПениСУчетомПереплаты Тогда 
			ИтогКОплате = ИтогКОплате + ТекСтрока.СальдоНаНачало;
		Иначе
			ИтогКОплате = ИтогКОплате + ?(ТекСтрока.СальдоНаНачало > 0,Текстрока.СальдоНаНачало,0); 
		КонецЕсли;
		// БИТ_ЖКХ 02.07.2014
		
	КонецЦикла; 
	
	// БИТ_ЖКХ 01.09.2014
	ИтогКОплате = ИтогКОплате - ИтогОплата;
	// БИТ_ЖКХ 01.09.2014
	
	ИтогПени       = КоммунальныеУслуги.Итог("СальдоПени");
	НачислятьПеню = ?(СуммаДокумента > ИтогКОплате, Истина, Ложь);
	
	Если НачислятьПеню Тогда
		
		// БИТ_ЖКХ 03.07.2014		
		Если НачислятьПениСУчетомПереплаты Тогда
			
			Если СуммаДляРаспределения >= ИтогПени Тогда
				
				СуммаДляРаспределения = СуммаДляРаспределения - ИтогПени;
				
				Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
					
					ТекСтрока.СуммаПени = ТекСтрока.СальдоПени;
					
				КонецЦикла;
			Иначе
				
				Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
					
					Пени = ?(ИтогПени <= 0 , 0 , (СуммаДляРаспределения * ТекСтрока.СальдоПени)/ИтогПени);
					ТекСтрока.СуммаПени = Пени;
					
				КонецЦикла; 
				
				СуммаДляРаспределения = 0;
				
			КонецЕсли;
			// БИТ_ЖКХ 03.07.2014		
			
		ИначеЕсли СуммаДляРаспределения >= ИтогПени Тогда
			
			СуммаДляРаспределения = СуммаДляРаспределения - ИтогПени;
			
			Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
				
				ТекСтрока.СуммаПени = ТекСтрока.СальдоПени;
				
			КонецЦикла;
			
		Иначе
			
			Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
				
				Пени = ?(ИтогПени <= 0 , 0 , (СуммаДляРаспределения * ТекСтрока.СальдоПени)/ИтогПени);
				ТекСтрока.СуммаПени = Пени;
				
			КонецЦикла; 
			
			СуммаДляРаспределения = 0;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура распределяет сумму документа по таб. части "бит_КоммунальныеУслуги".
// Параметры:
// КоммунальныеУслуги - таб. часть документа.
// СуммаДокумента - сумма для распределения.
//
Процедура РаспределитьСуммуДокумента(КоммунальныеУслуги,ШаблонИзвещения,СуммаДокумента
	// БИТ_ЖКХ 02.07.2014
	,НачислятьПениСУчетомПереплаты
	// БИТ_ЖКХ 02.07.2014
	
	// БИТ_ЖКХ 01.09.2014
	,ИтогОплата 
	// БИТ_ЖКХ 01.09.2014
	// БИТ_ЖКХ 12.05.2016 15:04:21 Начало правки...
	,ДатаОплаты = Неопределено) Экспорт
	// БИТ_ЖКХ 12.05.2016 15:04:21 Конец правки.
	
	// БИТ_ЖКХ 08.02.2016 16:09:09 Начало правки...  Ошибка, не вносило сумму на новые ЛС (только подключеные услуги, без сальдо)
	//// БИТ_ЖКХ 10.12.2015 17:58:05 Начало правки... 
	//Если КоммунальныеУслуги.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	// БИТ_ЖКХ 08.02.2016 16:09:12 Конец правки. 
	
	НетПени = Ложь;
	СуммаДляРаспределения = СуммаДокумента;
	ИтогСальдо = 0;
	ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
	
	Если НачислятьПениСУчетомПереплаты Тогда
		
		Если ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам 
			Или ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугамБезСтрахования 
			Или (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) тогда
			
			БазоваяСумма = 0;
			Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
				БазоваяСумма = БазоваяСумма + ТекСтрока.Сальдо;
				ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
			КонецЦикла; 
			
			
			//Начисление (пропорциональное) Суммы по Сальдо, за вычетом переплаты.
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
				СуммаСписания = ?(ИтогСальдо = 0 ИЛИ БазоваяСумма < 0
				,0
				,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * Мин(СуммаДокумента, БазоваяСумма);
				
				ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
				СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
			КонецЦикла;
			
			Если СуммаДляРаспределения < 0 Тогда
				СуммаДляРаспределения = 0;
			КонецЕсли;	
			СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
			
			
			//Начисление СуммыПени по СальдоПени.
			Если КоммунальныеУслуги.Колонки.Найти("СальдоНаНачало") <> Неопределено ИЛИ КоммунальныеУслуги.Колонки.Найти("СальдоПени") <> Неопределено Тогда
				РаспределитьСуммуПоПени(КоммунальныеУслуги, СуммаДокумента,СуммаДляРаспределения,НачислятьПениСУчетомПереплаты,ИтогОплата);
			Иначе 
				НетПени = Истина;
			КонецЕсли;
			
			
			//Доначисление Суммы по Сальдо (остатки для закрытия Сальдо).
			ИтогСумма = КоммунальныеУслуги.Итог("Сумма");
			ИтогоОстаток = ИтогСальдо - ИтогСумма;
			Если СуммаДляРаспределения > 0 И ИтогоОстаток > 0 Тогда
				
				БазоваяСумма = СуммаДляРаспределения;
				Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл
					
					Остаток = ?(ТекСтрока.Сальдо - ТекСтрока.Сумма > 0
					,Мин((ТекСтрока.Сальдо - ТекСтрока.Сумма)*БазоваяСумма/ИтогоОстаток, ТекСтрока.Сальдо - ТекСтрока.Сумма)
					,0);
					
					ТекСтрока.Сумма = ТекСтрока.Сумма + Остаток;
					СуммаДляРаспределения = СуммаДляРаспределения - Остаток;
				КонецЦикла;	
				
			КонецЕсли;
			
			
			//Начисление Суммы по будущим Начислениям.
			Если  ИтогНачисления <> 0 И СуммаДляРаспределения <> 0 Тогда
				
				СписокКУОтбор = КоммунальныеУслуги.СкопироватьКолонки();
				Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
					Если ТекСтрока.Начислено > 0 И (ТекСтрока.Сальдо + ТекСтрока.Начислено) > 0 Тогда
						НоваяСтрока = СписокКУОтбор.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
						Если ТекСтрока.Сальдо < 0 Тогда
							НоваяСтрока.Начислено = НоваяСтрока.Начислено + ТекСтрока.Сальдо;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если СписокКУОтбор.Количество() > 0 Тогда
					
					ИтогНачисления = СписокКУОтбор.Итог("Начислено");
					Для Каждого ТекСтрока Из СписокКУОтбор Цикл 
						ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
					КонецЦикла;
					
					Для Каждого ТекСтрока Из СписокКУОтбор Цикл
						МассивСтрок = КоммунальныеУслуги.НайтиСтроки(Новый Структура("Услуга,ШаблонИзвещений",ТекСтрока.Услуга,ТекСтрока.ШаблонИзвещений));
						Если МассивСтрок.Количество() >0 тогда
							МассивСтрок[0].Сумма = ТекСтрока.Сумма; 
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
					Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
						ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0,0,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
					КонецЦикла; 
					
				КонецЕсли;
				
			КонецЕсли;
			
			
		ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да  И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) Тогда	// Для НачислятьПениСУчетомПереплаты
			
			БазоваяСумма = 0;
			Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
				БазоваяСумма = БазоваяСумма + ТекСтрока.Сальдо;
				ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
			КонецЦикла; 
			
			
			//Начисление (пропорциональное) Суммы по Сальдо, за вычетом переплаты.
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
				СуммаСписания = ?(ИтогСальдо = 0 ИЛИ БазоваяСумма < 0
				,0
				,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * Мин(СуммаДокумента, БазоваяСумма);
				
				ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
				СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
			КонецЦикла;
			
			Если СуммаДляРаспределения < 0 Тогда
				СуммаДляРаспределения = 0;
			КонецЕсли;	
			СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
			
			//Начисление СуммыПени по СальдоПени.
			Если КоммунальныеУслуги.Колонки.Найти("СальдоНаНачало")<> Неопределено ИЛИ КоммунальныеУслуги.Колонки.Найти("СальдоПени")<> Неопределено Тогда
				РаспределитьСуммуПоПени(КоммунальныеУслуги, СуммаДокумента,СуммаДляРаспределения,НачислятьПениСУчетомПереплаты,ИтогОплата);
			Иначе 
				НетПени = Истина
			КонецЕсли;
			
			
			//Доначисление Суммы по Сальдо (остатки для закрытия Сальдо).
			ИтогСумма = КоммунальныеУслуги.Итог("Сумма");
			ИтогоОстаток = ИтогСальдо - ИтогСумма;
			Если СуммаДляРаспределения > 0 И ИтогоОстаток > 0 Тогда
				
				БазоваяСумма = СуммаДляРаспределения;
				Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл
					
					Остаток = ?(ТекСтрока.Сальдо - ТекСтрока.Сумма > 0
					,Мин((ТекСтрока.Сальдо - ТекСтрока.Сумма)*БазоваяСумма/ИтогоОстаток, ТекСтрока.Сальдо - ТекСтрока.Сумма)
					,0);
					
					ТекСтрока.Сумма = ТекСтрока.Сумма + Остаток;
					СуммаДляРаспределения = СуммаДляРаспределения - Остаток;
				КонецЦикла;	
				
			КонецЕсли;
			
			
			//Начисление Суммы по будущим Начислениям.
			Если  ИтогНачисления <> 0 И СуммаДляРаспределения <> 0 Тогда
				Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
					ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
				КонецЦикла;
			КонецЕсли;
			
			
		ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) Тогда	// Для НачислятьПениСУчетомПереплаты
			
			ИтогСальдо     = КоммунальныеУслуги.Итог("Сальдо");
			ИтогНачисления = 0;
			
			
			//Начисление Суммы по будущим Начислениям.
			СписокКУОтбор = КоммунальныеУслуги.СкопироватьКолонки();
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл
				
				Если ТекСтрока.Начислено > 0 И (ТекСтрока.Сальдо + ТекСтрока.Начислено) > 0 Тогда
					НоваяСтрока = СписокКУОтбор.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
					Если ТекСтрока.Сальдо < 0 Тогда
						НоваяСтрока.Начислено = НоваяСтрока.Начислено + ТекСтрока.Сальдо;
					КонецЕсли;
				КонецЕсли;	
				
			КонецЦикла;
			
			Если СписокКУОтбор.Количество() > 0 Тогда
				
				ИтогНачисления = СписокКУОтбор.Итог("Начислено");
				Для Каждого ТекСтрокаКУ Из СписокКУОтбор Цикл 
					// БИТ_ЖКХ 11.12.2015 10:39:48 Начало правки... Решено распределять на все Услуги с положительным ТекСтрока.Сальдо + ТекСтрока.Начислено
					//Если ТекСтрокаКУ.Сальдо >= 0 Тогда
					//	ТекСтрокаКУ.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрокаКУ.Начислено/ИтогНачисления) * СуммаДокумента;
					//КонецЕсли;
					ТекСтрокаКУ.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрокаКУ.Начислено/ИтогНачисления) * СуммаДокумента;
					// БИТ_ЖКХ 11.12.2015 10:39:51 Конец правки. 
				КонецЦикла;
				КоммунальныеУслуги = СписокКУОтбор;
				
			Иначе
				
				ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
				Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
					ТекСтрока.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДокумента;
				КонецЦикла;
				
			КонецЕсли;
			
			
		ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) Тогда	// Для НачислятьПениСУчетомПереплаты
			
			НетПени		= Истина;
			ИтогСальдо  = КоммунальныеУслуги.Итог("Сальдо");
			
			
			//Начисление Суммы по будущим Начислениям.
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
				ТекСтрока.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДокумента;
			КонецЦикла;
			
		КонецЕсли;
		
		
		//Распределение погрешности округлений при распределении Суммы и СуммыПени.  // Для НачислятьПениСУчетомПереплаты
		Если КоммунальныеУслуги.Количество() > 0  Тогда
			
			СуммаПени = КоммунальныеУслуги.Итог("СуммаПени");
			СуммаПроверки = КоммунальныеУслуги.Итог("Сумма") + ?(НетПени, 0, СуммаПени);
			
			Если СуммаПроверки <> СуммаДокумента Тогда
				
				Если СуммаДокумента > 0 Тогда
					КоммунальныеУслуги.Сортировать("Сумма Убыв");
				Иначе
					КоммунальныеУслуги.Сортировать("Сумма Возр");
				КонецЕсли;
				
				Остаток = СуммаДокумента - СуммаПроверки;
				
				Если НЕ НетПени Тогда
					
					СальдоПени = КоммунальныеУслуги.Итог("СальдоПени");
					Если СуммаПени > 0 
						И СуммаПени < СальдоПени Тогда
						
						Для Каждого Стр Из КоммунальныеУслуги Цикл
							Если Стр.СуммаПени < Стр.СальдоПени Тогда
								СвободныйОстаток = Мин(Остаток, Стр.СальдоПени - Стр.СуммаПени); 
								Стр.СуммаПени = Стр.СуммаПени + СвободныйОстаток;
								Остаток = Остаток - СвободныйОстаток;
								Если Остаток = 0 ИЛИ  КоммунальныеУслуги.Итог("СальдоПени") =  КоммунальныеУслуги.Итог("СуммаПени") Тогда
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли; 
				
				Если Остаток <> 0 Тогда
					
					// БИТ_ЖКХ 12.05.2016 15:17:10 Начало правки... Адресуем остаток на не отключенную услугу
					Если НЕ ДатаОплаты = Неопределено Тогда
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	КоммунальныеУслуги.ЛицевойСчет КАК ЛицевойСчет,
						|	КоммунальныеУслуги.Услуга КАК Услуга
						|ПОМЕСТИТЬ ВТ_КоммунальныеУслуги
						|ИЗ
						|	&КоммунальныеУслуги КАК КоммунальныеУслуги
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
						|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
						|ИЗ
						|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
						|			&ДатаОплаты,
						|			(ЛицевойСчет, Услуга) В
						|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
						|					ВТ_КоммунальныеУслуги.ЛицевойСчет,
						|					ВТ_КоммунальныеУслуги.Услуга
						|				ИЗ
						|					ВТ_КоммунальныеУслуги)) КАК бит_СведенияПоУслугамЛССрезПоследних
						|ГДЕ
						|	НЕ бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.Нет)";
						
						Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплаты );
						Запрос.УстановитьПараметр("КоммунальныеУслуги", КоммунальныеУслуги);
						
						Результат = Запрос.Выполнить().Выгрузить();
						
						Если Результат.Количество() = 0 Тогда
							ТабЛСКоммунальныеУслуги = КоммунальныеУслуги.Скопировать(,"ЛицевойСчет");
							ТабЛСКоммунальныеУслуги.Свернуть("ЛицевойСчет");
							Ошибки = Неопределено;
							Для Каждого Стр Из ТабЛСКоммунальныеУслуги Цикл
								ТекстСообщения = НСтр("ru = 'Для всех услуг лицевого счета %1, отключен режим потребления.
															|Необходимо проверить автоматическое распределение суммы оплаты.'");
								ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Стр.ЛицевойСчет));
								ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстСообщения, "");
							КонецЦикла; 
							ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
						КонецЕсли;
						
						Если Остаток < 0 Тогда
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Если Стр.Сумма > 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 12.05.2016 16:14:07 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						Иначе	
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Отбор = Новый Структура;
								Отбор.Вставить("ЛицевойСчет", Стр.ЛицевойСчет);
								Отбор.Вставить("Услуга"		, Стр.Услуга);
								Если Результат.НайтиСтроки(Отбор).Количество() > 0 Тогда
									УслугаЖКХПодключена = Истина;	
								Иначе	
									УслугаЖКХПодключена = Ложь;
								КонецЕсли;
								
								Если Стр.Начислено > 0
									ИЛИ УслугаЖКХПодключена
									ИЛИ КоммунальныеУслуги.Итог("Сумма") = 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 12.05.2016 16:14:05 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						КонецЕсли;
						
					Иначе	
						
						// БИТ_ЖКХ 12.02.2016 15:06:59 Начало правки... 
						Если Остаток < 0 Тогда
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Если Стр.Сумма > 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 13.05.2016 15:54:11 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						Иначе	
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Если Стр.Начислено > 0
									ИЛИ КоммунальныеУслуги.Итог("Сумма") = 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 13.05.2016 15:54:17 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						КонецЕсли;
						//Для Каждого Стр Из КоммунальныеУслуги Цикл
						//	// БИТ_ЖКХ 08.02.2016 16:11:53 Начало правки...  Сбрасываем остаток, даже если услуги на лицевом счете только подключили
						//	//Если Стр.Сумма > 0 И Стр.Начислено > 0 Тогда
						//	Если (Стр.Сумма > 0 И Стр.Начислено > 0 )
						//		ИЛИ КоммунальныеУслуги.Итог("Сумма") = 0 Тогда
						//	// БИТ_ЖКХ 08.02.2016 16:11:56 Конец правки. 
						//		Стр.Сумма = Стр.Сумма + Остаток;
						//		Прервать;
						//	КонецЕсли;
						//КонецЦикла;
						// БИТ_ЖКХ 12.02.2016 15:07:02 Конец правки. 
					КонецЕсли;
				КонецЕсли;
				
				// БИТ_ЖКХ 13.05.2016 13:18:01 Начало правки... 
				Если Остаток <> 0 Тогда
					ТекстСообщения = НСтр("ru = 'Не получилось автоматически распределить переплату по услугам из шаблона, для лицевого счета %1.
												|Возможно услуги, на лицевом счете, отключены. Выполните корректировку суммы или распределите оплату в ручном режиме.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(КоммунальныеУслуги[0].ЛицевойСчет));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
				// БИТ_ЖКХ 13.05.2016 13:18:03 Конец правки. 
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
		// Для НЕ НачислятьПениСУчетомПереплаты  	
	Иначе
		
		Если ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам 
			ИЛИ ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугамБезСтрахования 
			ИЛИ (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) Тогда
			
			Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
				ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
			КонецЦикла; 
			
			//Начисление Суммы по Сальдо.
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
				СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
				ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
				СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
			КонецЦикла;
			СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
			
			
			//Начисление СуммыПени по СальдоПени.
			Если КоммунальныеУслуги.Колонки.Найти("СальдоНаНачало")<> Неопределено ИЛИ КоммунальныеУслуги.Колонки.Найти("СальдоПени")<> Неопределено Тогда
				РаспределитьСуммуПоПени(КоммунальныеУслуги, СуммаДокумента,СуммаДляРаспределения,НачислятьПениСУчетомПереплаты,ИтогОплата);
			Иначе 
				НетПени = Истина;
			КонецЕсли;
			
			
			//Начисление Суммы по будущим Начислениям.
			Если  ИтогНачисления <> 0 И СуммаДляРаспределения <> 0 Тогда
				
				СписокКУОтбор = КоммунальныеУслуги.СкопироватьКолонки();
				Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
					Если ТекСтрока.Начислено > 0 И (ТекСтрока.Сальдо + ТекСтрока.Начислено) > 0 Тогда
						НоваяСтрока = СписокКУОтбор.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
						Если ТекСтрока.Сальдо < 0 Тогда
							НоваяСтрока.Начислено = НоваяСтрока.Начислено + ТекСтрока.Сальдо;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если СписокКУОтбор.Количество() > 0 Тогда
					
					ИтогНачисления = СписокКУОтбор.Итог("Начислено");
					Для Каждого ТекСтрока Из СписокКУОтбор Цикл 
						ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
					КонецЦикла;
					
					Для Каждого ТекСтрока Из СписокКУОтбор Цикл
						МассивСтрок = КоммунальныеУслуги.НайтиСтроки(Новый Структура("Услуга,ШаблонИзвещений",ТекСтрока.Услуга,ТекСтрока.ШаблонИзвещений));
						Если МассивСтрок.Количество() >0 тогда
							МассивСтрок[0].Сумма = ТекСтрока.Сумма; 
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
					Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
						ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0,0,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
					КонецЦикла; 
					
				КонецЕсли;
				
			КонецЕсли;
			
			
		ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да  И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) Тогда // Для НЕ НачислятьПениСУчетомПереплаты
			
			Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
				ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
			КонецЦикла; 
			
			
			//Начисление Суммы по Сальдо.
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
				СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
				ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
				СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
			КонецЦикла;
			СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
			
			
			//Начисление СуммыПени по СальдоПени.
			Если КоммунальныеУслуги.Колонки.Найти("СальдоНаНачало")<> Неопределено ИЛИ КоммунальныеУслуги.Колонки.Найти("СальдоПени")<> Неопределено Тогда
				РаспределитьСуммуПоПени(КоммунальныеУслуги, СуммаДокумента,СуммаДляРаспределения,НачислятьПениСУчетомПереплаты,ИтогОплата);
			Иначе 
				НетПени = Истина
			КонецЕсли;
			
			Если  ИтогНачисления <> 0 И СуммаДляРаспределения <> 0 Тогда
				Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
					ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
				КонецЦикла;
			КонецЕсли;
			
			
		ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) Тогда  // Для НЕ НачислятьПениСУчетомПереплаты
			
			ИтогСальдо     = КоммунальныеУслуги.Итог("Сальдо");
			ИтогНачисления = 0;
			
			
			//Начисление Суммы по будущим Начислениям.
			СписокКУОтбор = КоммунальныеУслуги.СкопироватьКолонки();
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл
				
				Если ТекСтрока.Начислено > 0 И (ТекСтрока.Сальдо + ТекСтрока.Начислено) > 0 Тогда
					НоваяСтрока = СписокКУОтбор.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
					Если ТекСтрока.Сальдо < 0 Тогда
						НоваяСтрока.Начислено = НоваяСтрока.Начислено + ТекСтрока.Сальдо;
					КонецЕсли;
				КонецЕсли;	
				
			КонецЦикла;
			
			Если СписокКУОтбор.Количество() > 0 Тогда
				
				ИтогНачисления = СписокКУОтбор.Итог("Начислено");
				Для Каждого ТекСтрокаКУ Из СписокКУОтбор Цикл 
					Если ТекСтрокаКУ.Сальдо >= 0 Тогда
						ТекСтрокаКУ.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрокаКУ.Начислено/ИтогНачисления) * СуммаДокумента;
					КонецЕсли; 
				КонецЦикла;
				КоммунальныеУслуги = СписокКУОтбор;
				
			Иначе
				
				ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
				Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
					ТекСтрока.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДокумента;
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) Тогда  // Для НЕ НачислятьПениСУчетомПереплаты
			
			НетПени		= Истина;
			ИтогСальдо  = КоммунальныеУслуги.Итог("Сальдо");
			
			
			//Начисление Суммы по будущим Начислениям.
			Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
				ТекСтрока.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДокумента;
			КонецЦикла;
			
		КонецЕсли;
		
		
		//Распределение погрешности округлений при распределении Суммы и СуммыПени. // Для НЕ НачислятьПениСУчетомПереплаты
		Если КоммунальныеУслуги.Количество() > 0  Тогда
			
			СуммаПроверки = КоммунальныеУслуги.Итог("Сумма") + ?(НетПени, 0, КоммунальныеУслуги.Итог("СуммаПени"));
			
			Если СуммаПроверки <> СуммаДокумента Тогда
				
				Если СуммаДокумента > 0 Тогда
					КоммунальныеУслуги.Сортировать("Сумма Убыв");
				Иначе
					КоммунальныеУслуги.Сортировать("Сумма Возр");
				КонецЕсли;
				
				Остаток = СуммаДокумента - СуммаПроверки;
				
				Если НЕ НетПени Тогда
					
					СальдоПени = КоммунальныеУслуги.Итог("СальдоПени");
					Если СуммаДокумента > ИтогСальдо  
						И СуммаДокумента <  ИтогСальдо + СальдоПени Тогда
						
						Для Каждого Стр Из КоммунальныеУслуги Цикл
							Если Стр.СуммаПени < Стр.СальдоПени Тогда
								СвободныйОстаток = Мин(Остаток, Стр.СальдоПени - Стр.СуммаПени); 
								Стр.СуммаПени = Стр.СуммаПени + СвободныйОстаток;
								Остаток = Остаток - СвободныйОстаток;
								Если Остаток = 0 ИЛИ  КоммунальныеУслуги.Итог("СальдоПени") =  КоммунальныеУслуги.Итог("СуммаПени") Тогда
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Остаток <> 0 Тогда 
					
					// БИТ_ЖКХ 12.05.2016 15:17:10 Начало правки... Адресуем остаток на не отключенную услугу
					Если НЕ ДатаОплаты = Неопределено Тогда
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	КоммунальныеУслуги.ЛицевойСчет КАК ЛицевойСчет,
						|	КоммунальныеУслуги.Услуга КАК Услуга
						|ПОМЕСТИТЬ ВТ_КоммунальныеУслуги
						|ИЗ
						|	&КоммунальныеУслуги КАК КоммунальныеУслуги
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
						|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
						|ИЗ
						|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
						|			&ДатаОплаты,
						|			(ЛицевойСчет, Услуга) В
						|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
						|					ВТ_КоммунальныеУслуги.ЛицевойСчет,
						|					ВТ_КоммунальныеУслуги.Услуга
						|				ИЗ
						|					ВТ_КоммунальныеУслуги)) КАК бит_СведенияПоУслугамЛССрезПоследних
						|ГДЕ
						|	НЕ бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления = ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.Нет)";
						
						Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплаты );
						Запрос.УстановитьПараметр("КоммунальныеУслуги", КоммунальныеУслуги);
						
						Результат = Запрос.Выполнить().Выгрузить();
						
						Если Результат.Количество() = 0 Тогда
							ТабЛСКоммунальныеУслуги = КоммунальныеУслуги.Скопировать(,"ЛицевойСчет");
							ТабЛСКоммунальныеУслуги.Свернуть("ЛицевойСчет");
							Ошибки = Неопределено;
							Для Каждого Стр Из ТабЛСКоммунальныеУслуги Цикл
								ТекстОшибки = НСтр("ru = 'Для всех услуг лицевого счета %1, отключен режим потребления.
															|Необходимо проверить автоматическое распределение суммы оплаты.'");
								ТекстОшибки = СтрШаблон(ТекстОшибки, Строка(Стр.ЛицевойСчет));
								ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки, "");
							КонецЦикла; 
							ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
						КонецЕсли;
						
						Если Остаток < 0 Тогда
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Если Стр.Сумма > 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 12.05.2016 16:14:07 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						Иначе	
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Отбор = Новый Структура;
								Отбор.Вставить("ЛицевойСчет", Стр.ЛицевойСчет);
								Отбор.Вставить("Услуга"		, Стр.Услуга);
								Если Результат.НайтиСтроки(Отбор).Количество() > 0 Тогда
									УслугаЖКХПодключена = Истина;	
								Иначе	
									УслугаЖКХПодключена = Ложь;
								КонецЕсли;
								
								Если Стр.Начислено > 0
									ИЛИ УслугаЖКХПодключена
									ИЛИ КоммунальныеУслуги.Итог("Сумма") = 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 12.05.2016 16:14:05 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						КонецЕсли;
						
					Иначе	
						// БИТ_ЖКХ 12.05.2016 15:17:10 Конец правки.
						
						// БИТ_ЖКХ 12.02.2016 15:06:59 Начало правки... 
						Если Остаток < 0 Тогда
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Если Стр.Сумма > 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 12.05.2016 16:14:02 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						Иначе	
							
							Для Каждого Стр Из КоммунальныеУслуги Цикл
								Если Стр.Начислено > 0
									ИЛИ КоммунальныеУслуги.Итог("Сумма") = 0 Тогда
									Стр.Сумма = Стр.Сумма + Остаток;
									Остаток = 0; // БИТ_ЖКХ 12.05.2016 16:13:59 
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						КонецЕсли;
						//Для Каждого Стр Из КоммунальныеУслуги Цикл
						//	// БИТ_ЖКХ 08.02.2016 16:04:47 Начало правки... Сбрасываем остаток, даже если услуги на лицевом счете только подключили 
						//	//Если Стр.Сумма > 0 Тогда
						//	Если Стр.Сумма > 0 
						//		ИЛИ КоммунальныеУслуги.Итог("Сумма") = 0 Тогда
						//	// БИТ_ЖКХ 08.02.2016 16:04:50 Конец правки. 
						//		Стр.Сумма = Стр.Сумма + Остаток;
						//		Прервать;
						//	КонецЕсли;
						//КонецЦикла;
						// БИТ_ЖКХ 12.02.2016 15:07:02 Конец правки. 
					КонецЕсли
				КонецЕсли;
				
				Если Остаток <> 0 Тогда
					ТекстСообщения = НСтр("ru = 'Не получилось автоматически распределить переплату по услугам из шаблона, для лицевого счета %1.
												|Возможно услуги, на лицевом счете, отключены. Выполните корректировку суммы или распределите оплату в ручном режиме.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(КоммунальныеУслуги[0].ЛицевойСчет));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
	
	
	////
	////НетПени = Ложь;
	////
	////Если ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам 
	////	Или ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугамБезСтрахования 
	////	Или (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) тогда
	////	
	////	СуммаДляРаспределения = СуммаДокумента;
	////	НетПени    = Ложь;
	////	ИтогСальдо = 0;
	////	
	////	Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
	////		
	////		// БИТ_ЖКХ 02.07.2014
	////		// ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);.
	////		Если НачислятьПениСУчетомПереплаты Тогда 
	////			ИтогСальдо = ИтогСальдо + ТекСтрока.Сальдо;
	////		Иначе
	////			ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
	////		КонецЕсли;
	////		// БИТ_ЖКХ 02.07.2014
	////		
	////	КонецЦикла; 
	////	
	////	ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
	////	
	////	МинусовойИтогСальдо = 0;	
	////	
	////	// БИТ_ЖКХ 03.09.2014
	////	Если НачислятьПениСУчетомПереплаты Тогда 
	////		
	////		Если ИтогСальдо < 0 Тогда
	////			
	////			МинусовойИтогСальдо = ИтогСальдо;	
	////			
	////			ИтогСальдо = 0;
	////			
	////		КонецЕсли;	
	////		
	////		Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
	////			
	////			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
	////			ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
	////			
	////			Если ТекСтрока.Сальдо < 0 Тогда
	////				СуммаДляРаспределения = СуммаДляРаспределения - ТекСтрока.Сальдо; 
	////			Иначе
	////				СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
	////			КонецЕсли;
	////			
	////		КонецЦикла;
	////		
	////		// БИТ_ЖКХ 23.09.2014	
	////		Если МинусовойИтогСальдо < 0 Тогда
	////			
	////			СуммаДляРаспределения = СуммаДокумента; 
	////			
	////		КонецЕсли;	
	////		
	////		Если СуммаДляРаспределения < 0 Тогда
	////			
	////			СуммаДляРаспределения = 0;
	////			
	////		КонецЕсли;	
	////		// БИТ_ЖКХ 23.09.2014
	////		
	////	Иначе
	////		
	////		Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
	////			
	////			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
	////			ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
	////			СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
	////			
	////		КонецЦикла;
	////		
	////	КонецЕсли;
	////	// БИТ_ЖКХ 03.09.2014
	////	
	////	СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
	////	
	////	Если КоммунальныеУслуги.Колонки.Найти("СальдоНаНачало")<> Неопределено ИЛИ КоммунальныеУслуги.Колонки.Найти("СальдоПени")<> Неопределено Тогда
	////		
	////		РаспределитьСуммуПоПине(КоммунальныеУслуги, СуммаДокумента,СуммаДляРаспределения,НачислятьПениСУчетомПереплаты,ИтогОплата);
	////		
	////	Иначе 
	////		НетПени = Истина;
	////	КонецЕсли;
	////	
	////	Если  ИтогНачисления <> 0 И СуммаДляРаспределения <> 0 Тогда
	////		
	////		
	////		СписокКУОтбор = КоммунальныеУслуги.СкопироватьКолонки();
	////		
	////		Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
	////			
	////			Если ТекСтрока.Начислено > 0 И (ТекСтрока.Сальдо+ТекСтрока.Начислено) > 0 Тогда
	////				
	////				НоваяСтрока = СписокКУОтбор.Добавить();
	////				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
	////				Если ТекСтрока.Сальдо < 0 Тогда
	////					
	////					НоваяСтрока.Начислено = НоваяСтрока.Начислено + ТекСтрока.Сальдо;
	////					
	////				КонецЕсли;
	////				
	////			КонецЕсли;
	////			
	////		КонецЦикла;
	////		
	////		Если СписокКУОтбор.Количество() > 0 Тогда
	////			
	////			ИтогНачисления = СписокКУОтбор.Итог("Начислено");
	////			Для Каждого ТекСтрока Из СписокКУОтбор Цикл 
	////				ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
	////			КонецЦикла;
	////			
	////			Для Каждого ТекСтрока Из СписокКУОтбор Цикл
	////				
	////				МассивСтрок = КоммунальныеУслуги.НайтиСтроки(Новый Структура("Услуга,ШаблонИзвещений",ТекСтрока.Услуга,ТекСтрока.ШаблонИзвещений));
	////				Если МассивСтрок.Количество() >0 тогда
	////					МассивСтрок[0].Сумма = ТекСтрока.Сумма; 
	////				КонецЕсли;
	////				
	////			КонецЦикла;
	////			
	////		Иначе
	////			
	////			Если КоммунальныеУслуги.Количество() > 1 Тогда
	////				
	////				ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
	////				
	////				Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
	////					ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0,0,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
	////				КонецЦикла; 
	////				
	////			Иначе
	////				
	////			КонецЕсли;
	////			
	////		КонецЕсли; 
	////		
	////	иначе
	////		
	////	КонецЕсли;
	////	
	////ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да  И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) тогда
	////	
	////	СуммаДляРаспределения = СуммаДокумента; 
	////	
	////	НетПени = Ложь;
	////	ИтогСальдо = 0;
	////	Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
	////		
	////		// БИТ_ЖКХ 02.07.2014
	////		// ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);.
	////		Если НачислятьПениСУчетомПереплаты Тогда 
	////			ИтогСальдо = ИтогСальдо + ТекСтрока.Сальдо;
	////		Иначе
	////			ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
	////		КонецЕсли;
	////		// БИТ_ЖКХ 02.07.2014
	////		
	////	КонецЦикла; 
	////	
	////	ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
	////	
	////	// БИТ_ЖКХ 23.09.2014
	////	МинусовойИтогСальдо = 0;	
	////	
	////	Если НачислятьПениСУчетомПереплаты Тогда 
	////		
	////		Если ИтогСальдо < 0 Тогда
	////			
	////			МинусовойИтогСальдо = ИтогСальдо;	
	////			
	////			ИтогСальдо = 0;
	////			
	////		КонецЕсли;	
	////		
	////		Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
	////			
	////			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
	////			ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
	////			
	////			Если ТекСтрока.Сальдо < 0 Тогда
	////				СуммаДляРаспределения = СуммаДляРаспределения - ТекСтрока.Сальдо; 
	////			Иначе
	////				СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
	////			КонецЕсли;
	////			
	////		КонецЦикла;
	////		
	////		Если МинусовойИтогСальдо < 0 Тогда
	////			
	////			СуммаДляРаспределения = СуммаДокумента; 
	////			
	////		КонецЕсли;	
	////		
	////		Если СуммаДляРаспределения < 0 Тогда
	////			
	////			СуммаДляРаспределения = 0;
	////			
	////		КонецЕсли;	
	////		
	////	Иначе
	////		
	////		Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
	////			
	////			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
	////			ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
	////			СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
	////			
	////		КонецЦикла;
	////		
	////	КонецЕсли;
	////	// БИТ_ЖКХ 23.09.2014
	////	
	////	СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
	////	
	////	Если КоммунальныеУслуги.Колонки.Найти("СальдоНаНачало")<> Неопределено ИЛИ КоммунальныеУслуги.Колонки.Найти("СальдоПени")<> Неопределено Тогда
	////		
	////		РаспределитьСуммуПоПине(КоммунальныеУслуги, СуммаДокумента,СуммаДляРаспределения,НачислятьПениСУчетомПереплаты,ИтогОплата);
	////		
	////	Иначе 
	////		НетПени = Истина
	////	КонецЕсли;
	////	
	////	Если  ИтогНачисления <> 0 И СуммаДляРаспределения <> 0 тогда
	////		
	////		Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
	////			
	////			ТекСтрока.Сумма = ТекСтрока.Сумма + ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДляРаспределения;
	////			
	////		КонецЦикла;
	////		
	////	КонецЕсли;
	////	
	////ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) тогда
	////	СуммаДляРаспределения = СуммаДокумента; 
	////	ИтогСальдо     = КоммунальныеУслуги.Итог("Сальдо");
	////	ИтогНачисления = 0;
	////	
	////	СписокКУОтбор = КоммунальныеУслуги.СкопироватьКолонки();
	////	Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл
	////		
	////		Если ТекСтрока.Начислено > 0 И (ТекСтрока.Сальдо+ТекСтрока.Начислено) > 0 тогда
	////			
	////			НоваяСтрока = СписокКУОтбор.Добавить();
	////			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
	////			
	////			Если ТекСтрока.Сальдо < 0 Тогда
	////				
	////				НоваяСтрока.Начислено = НоваяСтрока.Начислено + ТекСтрока.Сальдо;
	////				
	////			КонецЕсли;
	////			
	////		КонецЕсли;	
	////	КонецЦикла;
	////	Если СписокКУОтбор.Количество() > 0 Тогда
	////		
	////		ИтогНачисления = СписокКУОтбор.Итог("Начислено");
	////		Для Каждого ТекСтрокаКУ Из СписокКУОтбор Цикл 
	////			Если ТекСтрокаКУ.Сальдо >= 0 тогда
	////				
	////				ТекСтрокаКУ.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрокаКУ.Начислено/ИтогНачисления) * СуммаДокумента;
	////			КонецЕсли; 
	////			
	////		КонецЦикла;
	////		
	////		КоммунальныеУслуги = СписокКУОтбор;
	////		
	////	Иначе
	////		
	////		ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
	////		
	////		Для каждого ТекСтрока Из КоммунальныеУслуги Цикл
	////			ТекСтрока.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДокумента;
	////		КонецЦикла;
	////		
	////	КонецЕсли;
	////	
	////ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) тогда
	////	
	////	НетПени = Истина;
	////	
	////	СуммаДляРаспределения = СуммаДокумента; 
	////	ИтогСальдо     = КоммунальныеУслуги.Итог("Сальдо");
	////	ИтогНачисления = КоммунальныеУслуги.Итог("Начислено");
	////	
	////	Для Каждого ТекСтрока Из КоммунальныеУслуги Цикл 
	////		
	////		ТекСтрока.Сумма = ?(ИтогНачисления = 0 ,0 ,ТекСтрока.Начислено/ИтогНачисления) * СуммаДокумента;
	////		
	////		
	////	КонецЦикла;
	////	
	////КонецЕсли;
	////
	////Если КоммунальныеУслуги.Количество() > 0  Тогда
	////	
	////	СуммаПроверки = КоммунальныеУслуги.Итог("Сумма") + ?(НетПени, 0, КоммунальныеУслуги.Итог("СуммаПени"));
	////	Индекс = 0;
	////	
	////	Если СуммаПроверки <> СуммаДокумента Тогда
	////		
	////		Если СуммаДокумента > 0 Тогда
	////			КоммунальныеУслуги.Сортировать("Сумма Убыв");
	////		Иначе
	////			КоммунальныеУслуги.Сортировать("Сумма Возр");
	////		КонецЕсли;
	////		
	////		Строка = КоммунальныеУслуги.Получить(Индекс);
	////		
	////		Если Строка <> Неопределено Тогда
	////			
	////			Остаток = СуммаДокумента - КоммунальныеУслуги.Итог("Сумма") - ?(НетПени, 0, КоммунальныеУслуги.Итог("СуммаПени"));
	////			Строка.Сумма = Строка.Сумма + Остаток;
	////			
	////			// БИТ_ЖКХ 23.09.2014		
	////			Если НачислятьПениСУчетомПереплаты Тогда 
	////				
	////				// БИТ_ЖКХ 04.09.2014	
	////				Если Строка.Сумма < 0 Тогда
	////					
	////					Остаток = Строка.Сумма;	
	////					
	////					Строка.Сумма = 0;
	////					
	////					Пока Остаток < 0 Цикл
	////						Индекс = Индекс + 1;	
	////						Строка = КоммунальныеУслуги.Получить(Индекс);
	////						
	////						Строка.Сумма = Строка.Сумма + Остаток;
	////						
	////						Остаток = Строка.Сумма;	
	////						Если Строка.Сумма < 0 Тогда
	////							
	////							Строка.Сумма = 0;
	////						КонецЕсли;
	////						
	////					КонецЦикла;	
	////					
	////				КонецЕсли;	
	////				// БИТ_ЖКХ 04.09.2014	
	////				
	////			КонецЕсли;	
	////			// БИТ_ЖКХ 23.09.2014
	////			
	////		КонецЕсли; 
	////		
	////	КонецЕсли;
	////КонецЕсли;
	// БИТ_ЖКХ 10.12.2015 17:58:12 Конец правки.
	
КонецПроцедуры	

// Процедура распределяет суммы документа.
// 
Процедура РаспределениеСуммПоОплате(Дата, Организация, ТаблицаЛС, КоммунальныеУслуги, ПараметрЛьготы = Ложь,
	РасчетДолей = Ложь, УменьшитьНормуЛьготы = Ложь, НачислениеСУчетомДнейПроживания = Ложь,
	РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = Ложь, РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = Ложь,
	НачислятьПениСУчетомПереплаты = Ложь, ОплатаПоПериоду = Ложь, НачалоПериодаОплаты = Неопределено) Экспорт
	
	КоммунальныеУслуги.Очистить();
	
	// БИТ_ЖКХ 31.03.2016 11:49:03 Начало правки...
	//Если ОплатаПоПериоду Тогда
	//	КоммунальныеУслуги.Колонки.Добавить("Оборот", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	//КонецЕсли;
	// БИТ_ЖКХ 31.03.2016 11:49:03 Конец правки.
	
	СписокЛС     = Новый Массив;
	СписокЗданий = НОвый Массив;
	
	Для каждого Строка Из ТаблицаЛС Цикл
		
		СписокЛС.Добавить(Строка.ЛицевойСчет);
		СписокЗданий.Добавить(Строка.ЛицевойСчет.Здание);
		
	КонецЦикла; 
	
	ТаблицаНачислений  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаСчетчиков   = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТаблицаРаспред     = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	ТаблицаПроживающих = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	ТаблицаЛьгот       = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецДня(Дата),
														Организация,
														СписокЛС,
														СписокЗданий, 
														ПараметрЛьготы, 
														Истина, 
														ТаблицаНачислений, 
														ТаблицаСчетчиков, 
														ТаблицаРаспред, 
														ТаблицаЛьгот,
														,
														Истина,
														РасчетДолей, 
														УменьшитьНормуЛьготы,
														НачислениеСУчетомДнейПроживания,
														ТаблицаПроживающих, 
														,
														РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
														РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
	
	// БИТ_ЖКХ 14.03.2016 14:56:38 Начало правки... скрыт будущий функционал
	ТаблицаЛС.Свернуть("ЛицевойСчет, ШаблонИзвещений","Сумма");
	//ТаблицаЛС.Свернуть("ЛицевойСчет, ШаблонИзвещений, Период","Сумма");
	// БИТ_ЖКХ 14.03.2016 14:56:40 Конец правки. 
	
	ТаблицаДляРасчета = КоммунальныеУслуги.СкопироватьКолонки();
	
	// БИТ_ЖКХ 31.03.2016 13:14:11 Начало правки...
	Если ОплатаПоПериоду Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание КАК Здание,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район КАК Район,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок КАК Участок,
		|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств КАК ПолучательДенежныхСредств,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.МОП КАК МОП,
		|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь
		|ПОМЕСТИТЬ ПоставщикиИУслуги
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода {(&КонецПериода)}, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок,
		|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.МОП,
		|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
		|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|		КОНЕЦ) КАК Начисления,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|		КОНЕЦ) КАК Разовые,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|		КОНЕЦ) КАК Оплата,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
		|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|		КОНЕЦ) КАК Льгота,
		|	СУММА(ВЫБОР
		|			КОГДА (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
		|					И НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|		КОНЕЦ) КАК НачисленияИнд,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
		|					ИЛИ (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|						ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
		|						И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|		КОНЕЦ) КАК НачисленияОбщеДом,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|		КОНЕЦ) КАК СубсидияПИ
		|ПОМЕСТИТЬ Обороты
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
		|			&НачалоПериода {(&НачалоПериода)},
		|			&КонецПериода {(&КонецПериода)},
		|			Регистратор,
		|			ЛицевойСчет В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПоставщикиИУслуги.ЛицевойСчет
		|					ИЗ
		|						ПоставщикиИУслуги)
		|				И УслугаЖКХ В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПоставщикиИУслуги.Услуга
		|					ИЗ
		|						ПоставщикиИУслуги)
		|				И Организация = &Организация
		|				И НЕ ВидНачисления = ЗНАЧЕНИЕ(Перечисление.бит_ВидНачисленияПоУслугамЖКХ.Аванс)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Обороты.ЛицевойСчет КАК ЛицевойСчет,
		|	Обороты.УслугаЖКХ КАК УслугаЖКХ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) > 0
		|			ТОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Начислено
		|ИЗ
		|	Обороты КАК Обороты";
		
		Запрос.УстановитьПараметр("ЛицевойСчет",	СписокЛС);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериодаОплаты);
		Запрос.УстановитьПараметр("КонецПериода",	Дата);
		Запрос.УстановитьПараметр("Организация",	Организация);
		
		ТаблицаОборотовЗаПриод = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	// БИТ_ЖКХ 31.03.2016 13:14:11 Конец правки.
	
	Для каждого СтрокаШаблона Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаШаблона.ЛицевойСчет);
		
		ТаблицаДляРасчета.Очистить();
		
		МассивСтрок = ТаблицаНачислений.НайтиСтроки(Отбор);
		Для каждого Строка Из МассивСтрок Цикл
			
			Если СтрокаШаблона.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам
				// БИТ_ЖКХ 01.04.2016 19:22:56 Начало правки...
				ИЛИ СтрокаШаблона.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемЗаМесяц
				// БИТ_ЖКХ 01.04.2016 19:22:56 Конец правки.
				ИЛИ СтрокаШаблона.ШаблонИзвещений.Услуги.Найти(Строка.Услуга, "Услуга") <> Неопределено 
				и НЕ СтрокаШаблона.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугамБезСтрахования Тогда
				
				НоваяСтрока = ТаблицаДляРасчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.ШаблонИзвещений = СтрокаШаблона.ШаблонИзвещений;
				НоваяСтрока.Долг            = НоваяСтрока.СальдоНаНачало + НоваяСтрока.СальдоПени;
				
				// БИТ_ЖКХ 31.03.2016 13:39:05 Начало правки... Проставляем обороты по таблице расчета
				Если ОплатаПоПериоду Тогда
					ОтборОборот = Новый Структура;
					ОтборОборот.Вставить("ЛицевойСчет",	СтрокаШаблона.ЛицевойСчет);
					ОтборОборот.Вставить("УслугаЖКХ",	Строка.Услуга);
					
					МассивОборотов = ТаблицаОборотовЗаПриод.НайтиСтроки(ОтборОборот);
					Начислено = 0;
					Для каждого Элт Из МассивОборотов Цикл
						Начислено = Начислено + Элт.Начислено;
					КонецЦикла;
					
					НоваяСтрока.Начислено = Начислено;
					
				КонецЕсли;
				// БИТ_ЖКХ 31.03.2016 13:39:05 Конец правки.
				
			ИначеЕсли СтрокаШаблона.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугамБезСтрахования Тогда
				
				Если Не Строка.Услуга.ТипУслуги =  ПредопределенноеЗначение("Перечисление.бит_ТипыУслуг.ВнешняяДобровольноеСтрахование") Тогда
					НоваяСтрока = ТаблицаДляРасчета.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					
					НоваяСтрока.ШаблонИзвещений = СтрокаШаблона.ШаблонИзвещений;
					НоваяСтрока.Долг            = НоваяСтрока.СальдоНаНачало + НоваяСтрока.СальдоПени;
					
					// БИТ_ЖКХ 31.03.2016 13:39:05 Начало правки... Проставляем обороты по таблице расчета
					Если ОплатаПоПериоду Тогда
						ОтборОборот = Новый Структура;
						ОтборОборот.Вставить("ЛицевойСчет",	СтрокаШаблона.ЛицевойСчет);
						ОтборОборот.Вставить("УслугаЖКХ",	Строка.Услуга);
						
						МассивОборотов = ТаблицаОборотовЗаПриод.НайтиСтроки(ОтборОборот);
						Начислено = 0;
						Для каждого Элт Из МассивОборотов Цикл
							Начислено = Начислено + Элт.Начислено;
						КонецЦикла;
						
						НоваяСтрока.Начислено = Начислено;
						
					КонецЕсли;
					// БИТ_ЖКХ 31.03.2016 13:39:05 Конец правки.

				КонецЕсли;
				
			КонецЕсли;

			
		КонецЦикла;
		
		// БИТ_ЖКХ 01.09.2014
		ИтогОплата = 0;
		Для каждого строкамассива из МассивСтрок Цикл
			ИтогОплата = ИтогОплата + строкамассива.Оплата;
		КонецЦикла;
		
		// РаспределитьСуммуДокумента(ТаблицаДляРасчета,СтрокаШаблона.ШаблонИзвещений,СтрокаШаблона.Сумма);.
		// БИТ_ЖКХ 13.05.2016 16:30:25 Начало правки... 
		РаспределитьСуммуДокумента(ТаблицаДляРасчета,СтрокаШаблона.ШаблонИзвещений,СтрокаШаблона.Сумма,НачислятьПениСУчетомПереплаты,ИтогОплата,Дата);
		//РаспределитьСуммуДокумента(ТаблицаДляРасчета,СтрокаШаблона.ШаблонИзвещений,СтрокаШаблона.Сумма,НачислятьПениСУчетомПереплаты,ИтогОплата);
		//// БИТ_ЖКХ 01.09.2014
		// БИТ_ЖКХ 13.05.2016 16:30:28 Конец правки. 
		
		ТаблицаДляРасчета.Сортировать("Приоритет Возр");
		
		Для каждого Строка Из ТаблицаДляРасчета Цикл
			
			НоваяСтрока = КоммунальныеУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			// БИТ_ЖКХ 14.03.2016 14:26:42 Начало правки... скрыт будущий функционал
			//НоваяСтрока.Период = СтрокаШаблона.Период;
			// БИТ_ЖКХ 14.03.2016 14:26:42 Конец правки.
			
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура распределяет суммы документа.
// 
Процедура РаспределениеСуммПоВводНачОстатков(Дата, Организация, ТаблицаЛС, КоммунальныеУслуги) Экспорт
	
	КоммунальныеУслуги.Очистить();
	
	СписокЛС     = Новый Массив;
	СписокЗданий = НОвый Массив;
	
	Для каждого Строка Из ТаблицаЛС Цикл
		
		СписокЛС.Добавить(Строка.ЛицевойСчет);
		СписокЗданий.Добавить(Строка.ЛицевойСчет.Здание);
		
	КонецЦикла;
	
	ПарамтерыЖКХ = Новый Структура;
	ПарамтерыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	// БИТ_ЖКХ_04102013_начало_изменений
	ПарамтерыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);	
	// БИТ_ЖКХ_04102013_окончание_изменений
	ПарамтерыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	
	ПолучитьНастройкиЖКХ(Дата, Организация, ПарамтерыЖКХ);
	
	ТаблицаНачислений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаСчетчиков  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
	ТаблицаРаспред    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
	ТаблицаПрож       = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецДня(Дата),
	Организация,
	СписокЛС,
	СписокЗданий,
	,
	Истина,
	ТаблицаНачислений,
	ТаблицаСчетчиков,
	ТаблицаРаспред,
	,
	,
	Истина,
	,
	,
	ПарамтерыЖКХ.НачислениеСУчетомДнейПроживания,
	ТаблицаПрож,
	,
	// БИТ_ЖКХ_04102013_начало_изменений
	// ПарамтерыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика);.
	ПарамтерыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
	ПарамтерыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
	// БИТ_ЖКХ_04102013_окончание_изменений
	
	ТаблицаЛС.Свернуть("ЛицевойСчет", "Сумма");
	
	ТаблицаДляРасчета = КоммунальныеУслуги.СкопироватьКолонки();
	
	Для каждого СтрокаШаблона Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаШаблона.ЛицевойСчет);
		
		ТаблицаДляРасчета.Очистить();
		
		МассивСтрок = ТаблицаНачислений.НайтиСтроки(Отбор);
		
		Для каждого Строка Из МассивСтрок Цикл
			
			НоваяСтрока = ТаблицаДляРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла;
		
		// БИТ_ЖКХ 01.09.2014
		ИтогОплата = 0;
		Для каждого строкамассива из МассивСтрок Цикл
			ИтогОплата = ИтогОплата + строкамассива.Оплата;
		КонецЦикла;
		
		// РаспределитьСуммуДокумента(ТаблицаДляРасчета,Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам,СтрокаШаблона.Сумма);.
		РаспределитьСуммуДокумента(ТаблицаДляРасчета,Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам,СтрокаШаблона.Сумма,Ложь,ИтогОплата);
		// БИТ_ЖКХ 01.09.2014
		
		ТаблицаДляРасчета.Сортировать("Приоритет Возр");
		
		Для каждого Строка Из ТаблицаДляРасчета Цикл
			
			НоваяСтрока = КоммунальныеУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииЗаписиИПроведения

// БИТ_ЖКХ
Функция ЗаписатьСправочник(ТекущийОбъект,Заголовок="",РежимСообщений="Все",РежимЗагрузки=Ложь) Экспорт
	
	ДействиеВыполнено  = Ложь;
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	Попытка
		Если РежимЗагрузки Тогда
			ТекущийОбъект.ОбменДанными.Загрузка = Истина;
		КонецЕсли; 
		ТекущийОбъект.Записать();
		ДействиеВыполнено = Истина;
		Если ВыводитьИнформацию Тогда
			ТекстСообщения = "Записан справочник """+ТекущийОбъект.Ссылка+""". ";
			СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Информация);
		КонецЕсли; 
	Исключение
		ДействиеВыполнено = Ложь;						
		Если ВыводитьОшибки Тогда
			ТекстСообщения = "Не удалось записать справочник """+ТекущийОбъект.Ссылка+""". "+ОписаниеОшибки();
			СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Важное);
		КонецЕсли; 
	КонецПопытки;
	
	Возврат ДействиеВыполнено;
КонецФункции //ЗаписатьПровестиДокумент()

// Процедура выполняет запись/проведение/отмену проведения документа.
//
// Параметры:
//  ТекущийОбъект  – ДокументОбъект,СправочникОбъект.
//  РежимЗаписи    - РежимЗаписиДокумента.
//  Заголовок      - Строка.
//  РежимСообщений - Строка: "Нет","Все","Ошибки".
//
// Возвращаемое значение:
//   ДействиеВыполнено   – Булево.
//
Функция ЗаписатьПровестиДокумент(ТекущийОбъект,РежимЗаписи,Заголовок="",РежимСообщений="Все") Экспорт
	
	ДействиеВыполнено  = Ложь;
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Попытка
			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = "Записан документ """+ТекущийОбъект.Ссылка+""". ";
				СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Информация);
			КонецЕсли; 
		Исключение
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = "Не удалось записать документ """+ТекущийОбъект.Ссылка+""". "+ОписаниеОшибки();
				СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Важное);
			КонецЕсли; 
		КонецПопытки;
		
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Попытка
			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = "Проведен документ """+ТекущийОбъект.Ссылка+""". ";
				СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Информация);
			КонецЕсли; 			
		Исключение
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = "Не удалось провести документ """+ТекущийОбъект.Ссылка+""". "+ОписаниеОшибки();
				СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Важное);
			КонецЕсли; 
		КонецПопытки;
		
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Попытка
			ТекущийОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = "Отменено проведение документа """+ТекущийОбъект.Ссылка+""". ";
				СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Информация);
			КонецЕсли; 			
		Исключение
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = "Не удалось отменить проведение документа """+ТекущийОбъект.Ссылка+""". "+ОписаниеОшибки();
				СообщитьОбОшибке(ТекстСообщения,,Заголовок,СтатусСообщения.Важное);
			КонецЕсли; 
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ДействиеВыполнено;
КонецФункции // ЗаписатьПровестиДокумент()

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСоСчетамиИСубконто

// Процедура выполняет заполнение бухгалтерских счетов и субконто в табличной части документа.
//
// Параметры:
//
// 		Таблица  - ДокументТабличнаяЧасти - Таблица для заполнения.
// 		Колонки  - КолонкиТабличногоПоля  - Колонки табличного поля, для отработки процедуры смены типов полей субконто.
//		ЛицевыеСчета - СправочникСсылка.бит_ЛицевыеСчета, Массив - Список Лицевых счетов.
//		Услуги       - Массив, Неопределено         - Список Услуг.
//		Организация  - СправочникСсылка.Организации - организация.
//		Дата         - ДатаВремя, Неопределено      - КонецМесяца.
//
Процедура ЗаполнениеСчетовКУ(Таблица, Колонки, ЛицевыеСчета, Организация , Дата = Неопределено
	, ИсточникОплаты = Неопределено, ЭтоОплата = Ложь, ЭтоПени = Ложь, ЭтоВводОстаков = Ложь,
	ЭтоНачислениеЛьгот = Ложь, ЭтоНачислениеРасчетаПредельногоИндекса = Ложь, ЭтоПереносОстатковРазовые = Ложь) Экспорт
	
	ЛС = Неопределено;
	
	Если ТипЗнч(ЛицевыеСчета) = Тип("СправочникСсылка.бит_ЛицевыеСчета") Тогда
		УсловиеЛС = " = &ЛицевыеСчета" ;
		ЛС        = ЛицевыеСчета;
	Иначе
		УсловиеЛС = " В (&ЛицевыеСчета)";
		
	КонецЕсли; 
	
	Дата = ?(Дата = Неопределено, ТекущаяДата(), Дата);
	
	СтруктураСчетовЖКХ = ПолучитьСчетаРасчетовЖКХ(Организация,КонецМесяца(Дата));
	
	Если СтруктураСчетовЖКХ.СчетАбонента = Неопределено Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	ЗапросКонтрагентов = Новый Запрос;
	ЗапросКонтрагентов.Текст = 

	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет "+УсловиеЛС+") КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И НЕ бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
	// БИТ_ЖКХ_01102013_начало_изменений
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ДоговорКонтрагента,
	// БИТ_ЖКХ_01102013_окончание_изменений
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент
	|ИЗ
	|	Проживающие КАК Проживающие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Дата, ЛицевойСчет "+УсловиеЛС+") КАК бит_ОтветственныеЛицаПоКУСрезПоследних
	|		ПО Проживающие.ЛицевойСчет = бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|			И Проживающие.ФизЛицо = бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
	// БИТ_ЖКХ_01102013_начало_изменений
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ДоговорКонтрагента,
	// БИТ_ЖКХ_01102013_окончание_изменений
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Проживающие";
	// БИТ_ЖКХ изменение кода. Конец. 23.07.2012}}
	
	ЗапросКонтрагентов.УстановитьПараметр("Дата"        , КонецМесяца(Дата));
	ЗапросКонтрагентов.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	
	ТаблицаКонтрагентов = ЗапросКонтрагентов.Выполнить().Выгрузить();
	
	// БИТ_ЖКХ 23.11.2010  Начало{
	Попытка
		Поставщик = Таблица[0].Поставщик;
		ЕстьКолонкаПоставщик = Истина;
	Исключение
		ЕстьКолонкаПоставщик = Ложь;
	КонецПопытки; 
	
	Попытка
		ДоговорПолучателя = Таблица[0].ДоговорКонтрагента;
		ЕстьКолонкаДоговорКонтрагента = Истина;
	Исключение
		ЕстьКолонкаДоговорКонтрагента = Ложь;
	КонецПопытки;
	
	Попытка
		ПолучательДенежныхСредств = Таблица[0].ПолучательДенежныхСредств;
		ЕстьКолонкаПолучательДенежныхСредств = Истина;
	Исключение
		ЕстьКолонкаПолучательДенежныхСредств = Ложь;
	КонецПопытки;
	
	СчетАбонента = СтруктураСчетовЖКХ.СчетАбонента;
	СтрокаСубконта = СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета, "ВидСубконто");
	если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоЛС = -1;
	иначе
		НомерСтрокиСубконтоЛС = СтрокаСубконта.НомерСтроки;
	конецЕСли;
	
	// БИТ_ЖКХ добавление кода. Начало. 29.06.2012{{
	СтрокаСубконта = СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.бит_УслугиЖКХ, "ВидСубконто");
	если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоУС = -1;
	иначе
		НомерСтрокиСубконтоУС = СтрокаСубконта.НомерСтроки;
	конецЕСли;
	// БИТ_ЖКХ добавление кода. Конец. 29.06.2012}}
	
	СтрокаСубконта = СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
	если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоКонтрагент = -1;
	Иначе
		НомерСтрокиСубконтоКонтрагент = СтрокаСубконта.НомерСтроки;
	конецЕСли;
	СтрокаСубконта = СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
	если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоДоговоры = -1;
	Иначе
		НомерСтрокиСубконтоДоговоры = СтрокаСубконта.НомерСтроки;
	конецЕСли;
	
	СчетСУЦС	= СтруктураСчетовЖКХ.СчетСУЦС;
	СтрокаСубконта = СчетСУЦС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств, "ВидСубконто");	
	если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоНазначениеЦСУЦС = -1;
	Иначе
		НомерСтрокиСубконтоНазначениеЦСУЦС = СтрокаСубконта.НомерСтроки;
	конецЕСли;		
	СтрокаСубконта = СчетСУЦС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДвиженияЦелевыхСредств, "ВидСубконто");	
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоДвижениеЦСУЦС = -1;
	Иначе
		НомерСтрокиСубконтоДвижениеЦСУЦС = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	
	СчетСУАренды	= СтруктураСчетовЖКХ.СчетСУАренды;
	СтрокаСубконта 	= СчетСУАренды.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто");
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоНомГруппыСУАренды = -1;
	Иначе
		НомерСтрокиСубконтоНомГруппыСУАренды = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	
	СчетСторПКУ = СтруктураСчетовЖКХ.СчетСторПКУ;
	СтрокаСубконта = СчетСторПКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоКонтрагентыПКУ = -1;
	Иначе
		НомерСтрокиСубконтоКонтрагентыПКУ = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	СтрокаСубконта = СчетСторПКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоДоговорыПКУ = -1;
	Иначе
		НомерСтрокиСубконтоДоговорыПКУ = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	
	ТранзтныйСчет = СтруктураСчетовЖКХ.ТранзитныйСчетОплаты;
	СтрокаСубконта = ТранзтныйСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоКонтрагентыТранз = -1;
	Иначе
		НомерСтрокиСубконтоКонтрагентыТранз = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	СтрокаСубконта = ТранзтныйСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоДоговорыТранз = -1;
	Иначе
		НомерСтрокиСубконтоДоговорыТранз = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	
	СчетПениСУ      = СтруктураСчетовЖКХ.СчетПениСУ;
	СубконтоПениСУ1 = СтруктураСчетовЖКХ.СубконтоПениСУ1;
	СубконтоПениСУ2 = СтруктураСчетовЖКХ.СубконтоПениСУ2;
	СубконтоПениСУ3 = СтруктураСчетовЖКХ.СубконтоПениСУ3;
	
	СчетПениУСО      = СтруктураСчетовЖКХ.СчетПениУСО;
	
	СубконтоПениУСО1 = СтруктураСчетовЖКХ.СубконтоПениУСО1;
	СубконтоПениУСО2 = СтруктураСчетовЖКХ.СубконтоПениУСО2;
	СубконтоПениУСО3 = СтруктураСчетовЖКХ.СубконтоПениУСО3;
	
	СтрокаСубконта = СчетПениУСО.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоКонтрагентыПениУСО = -1;
	Иначе
		НомерСтрокиСубконтоКонтрагентыПениУСО = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	СтрокаСубконта = СчетПениУСО.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
	Если СтрокаСубконта = Неопределено тогда
		НомерСтрокиСубконтоДоговорыПениУСО = -1;
	Иначе
		НомерСтрокиСубконтоДоговорыПениУСО = СтрокаСубконта.НомерСтроки;
	КонецЕсли;
	
	СчетЛьготСУ      = СтруктураСчетовЖКХ.СчетЛьготСУ;
	СубконтоЛьготСУ1 = СтруктураСчетовЖКХ.СубконтоЛьготСУ1;
	СубконтоЛьготСУ2 = СтруктураСчетовЖКХ.СубконтоЛьготСУ2;
	СубконтоЛьготСУ3 = СтруктураСчетовЖКХ.СубконтоЛьготСУ3;
	
	СчетЛьготСторП    = СтруктураСчетовЖКХ.СчетЛьготСторП;
	СубконтоЛьготУСО1 = СтруктураСчетовЖКХ.СубконтоЛьготУСО1;
	СубконтоЛьготУСО2 = СтруктураСчетовЖКХ.СубконтоЛьготУСО2;
	СубконтоЛьготУСО3 = СтруктураСчетовЖКХ.СубконтоЛьготУСО3;
	
	// БИТ_ЖКХ_28082013_начало_изменений	
	СчетРасчетПИСУ       = СтруктураСчетовЖКХ.СчетРасчетПИСУ;
	СубконтоРасчетПИСУ1  = СтруктураСчетовЖКХ.СубконтоРасчетПИСУ1;
	СубконтоРасчетПИСУ2  = СтруктураСчетовЖКХ.СубконтоРасчетПИСУ2;
	СубконтоРасчетПИСУ3  = СтруктураСчетовЖКХ.СубконтоРасчетПИСУ3;	
	СчетРасчетПИУСО      = СтруктураСчетовЖКХ.СчетРасчетПИУСО;
	СубконтоРасчетПИУСО1 = СтруктураСчетовЖКХ.СубконтоРасчетПИУСО1;
	СубконтоРасчетПИУСО2 = СтруктураСчетовЖКХ.СубконтоРасчетПИУСО2;
	СубконтоРасчетПИУСО3 = СтруктураСчетовЖКХ.СубконтоРасчетПИУСО3;	
	// БИТ_ЖКХ_28082013_начало_изменений
	
	СчетЛьготКапРемонта	 = СтруктураСчетовЖКХ.СчетЛьготКапРемонта;
	СубконтоЛьготКапРем1 = СтруктураСчетовЖКХ.СубконтоЛьготКапРем1;
	СубконтоЛьготКапРем2 = СтруктураСчетовЖКХ.СубконтоЛьготКапРем2;
	СубконтоЛьготКапРем3 = СтруктураСчетовЖКХ.СубконтоЛьготКапРем3;

	СчетПениКапРемонта	= СтруктураСчетовЖКХ.СчетПениКапРемонта;
	СубконтоПениКапРем1	= СтруктураСчетовЖКХ.СубконтоПениКапРем1;
	СубконтоПениКапРем2	= СтруктураСчетовЖКХ.СубконтоПениКапРем2;
	СубконтоПениКапРем3	= СтруктураСчетовЖКХ.СубконтоПениКапРем3;
	
	КолонкаУС = Колонки.Найти("Услуга");
	
	// БИТ_ЖКХ 11.03.2015{{
	Если КолонкаУС = Неопределено Тогда
		
		КолонкаУС = Колонки.Найти("ЛицевыеСчетаУслуга")	
		
	КонецЕсли;	
	// БИТ_ЖКХ 11.03.2015}}
	
	ТипОрганизации = Тип("СправочникСсылка.Организации");
	ТипКонтрагенты = Тип("СправочникСсылка.Контрагенты");
	// БИТ_ЖКХ 23.11.2010 }Конец
	
	Для каждого Строки Из Таблица Цикл
		
		// Очистим строки Субконто.
		
		Строки["Субконто1"] = Неопределено;
		Строки["Субконто2"] = Неопределено;
		Строки["Субконто3"] = Неопределено;
		
		// Заполним Счет Абонента.
		
		Строки.СчетАбонента = СчетАбонента;
		//17.06.2019  
		если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Строки.Услуга, "ГрафаОтчетаГЦЖС") = истина тогда
		 УслугаКапРемонт = ?(Строки.Услуга.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт, Истина, Ложь);
	    иначе 
		 УслугаКапРемонт =  Ложь; 
		конецесли;
		
		Если НомерСтрокиСубконтоЛС = -1 И НомерСтрокиСубконтоКонтрагент = -1 тогда
		ИначеЕсли НомерСтрокиСубконтоЛС = -1 тогда
			
			СтрокаПоиска = ТаблицаКонтрагентов.Найти(?(ЛС = Неопределено , Строки.ЛицевойСчет, ЛС), "ЛицевойСчет");
			
			Если СтрокаПоиска <> Неопределено Тогда
				
				Строки["Субконто"+НомерСтрокиСубконтоКонтрагент] = СтрокаПоиска.Контрагент;	
				
				Если НЕ ЗначениеЗаполнено(СтрокаПоиска.ДоговорКонтрагента) Тогда
					
					// БИТ_ЖКХ 11.01.2016 15:56:14 Начало правки... 
					Если НЕ НомерСтрокиСубконтоДоговоры = -1 Тогда
						
						ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
						РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,СтрокаПоиска.Контрагент,Организация);
						Если бит_рлс_ОбщегоНазначения.СсылкаДоступна(ОсновнойДоговорКонтрагента) Тогда
							Строки["Субконто"+НомерСтрокиСубконтоДоговоры] = ОсновнойДоговорКонтрагента;
						КонецЕсли;
						
					КонецЕсли;
					//Если НЕ НомерСтрокиСубконтоДоговоры = -1 И бит_рлс_ОбщегоНазначения.СсылкаДоступна(СтрокаПоиска.Контрагент.УдалитьОсновнойДоговорКонтрагента) Тогда
					//	
					//	Строки["Субконто"+НомерСтрокиСубконтоДоговоры] = СтрокаПоиска.Контрагент.УдалитьОсновнойДоговорКонтрагента;
					//	
					//КонецЕсли;
					// БИТ_ЖКХ 11.01.2016 15:56:16 Конец правки. 
					
				Иначе
					
					Если НЕ НомерСтрокиСубконтоДоговоры = -1 Тогда
						
						Строки["Субконто"+НомерСтрокиСубконтоДоговоры] = СтрокаПоиска.ДоговорКонтрагента;
						
					КонецЕсли;
					
				КонецЕсли;
				// БИТ_ЖКХ_01102013_окончание_изменений
				
			КонецЕсли; 
			
		Иначе
			Строки["Субконто"+НомерСтрокиСубконтоЛС] = ?(ЛС = Неопределено , Строки.ЛицевойСчет, ЛС);
		КонецЕсли;
		// БИТ_ЖКХ 23.11.2010 }Конец			
		
		// БИТ_ЖКХ добавление кода. Начало. 29.06.2012{{
		Если НЕ НомерСтрокиСубконтоУС = -1 И НЕ КолонкаУС = Неопределено Тогда
			
			Строки["Субконто"+НомерСтрокиСубконтоУС] = Строки.Услуга;
			
		КонецЕсли;
		// БИТ_ЖКХ добавление кода. Конец. 29.06.2012}}
		
		Если ЭтоВводОстаков Тогда
			
			Строки.СчетКУ = ПланыСчетов.Хозрасчетный.Вспомогательный;
			Продолжить;
			
		КонецЕсли; 
		
		// Изменения типа значения субконто. 
		ОбработкатьПоляСубконаАбонента(Строки, Организация);
		
		// БИТ_ЖКХ 23.11.2010  Начало{
		// КолонкаУС = Колонки.Найти("Услуга");.
		СтруктураИнформацияОбПолучателе = Неопределено;
		Если ЕстьКолонкаПоставщик Тогда
			СтруктураИнформацияОбПолучателе = ПолучитьПолучателяДСПоПоставщику(Дата, Строки.Поставщик, 
			?(КолонкаУС = Неопределено,Неопределено, Строки.Услуга));
		КонецЕсли; 
		
		Если СтруктураИнформацияОбПолучателе = Неопределено Тогда
			СтруктураИнформацияОбПолучателе =  ПолучитьПолучателяДС(Дата,?(ЛС = Неопределено , Строки.ЛицевойСчет, ЛС), 
			?(КолонкаУС = Неопределено,Неопределено, Строки.Услуга));
		КонецЕсли; 
		
		ПолучательДенежныхСредств = Неопределено;
		
		Если ЕстьКолонкаПолучательДенежныхСредств И ЛС = Неопределено тогда
			ПолучательДенежныхСредств = Строки.ПолучательДенежныхСредств;
		КонецЕсли;
		
		Если НЕ СтруктураИнформацияОбПолучателе = Неопределено И ПолучательДенежныхСредств = Неопределено Тогда
			ПолучательДенежныхСредств = СтруктураИнформацияОбПолучателе.Получатель;
		КонецЕсли;
		
		// БИТ_ЖКХ 23.11.2010 }Конец
		
		Если ПолучательДенежныхСредств = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДоговорПолучателя = Неопределено;
		
		Если ЕстьКолонкаДоговорКонтрагента И ЛС = Неопределено тогда
			ДоговорПолучателя =  Строки.ДоговорКонтрагента;
		КонецЕсли;
		
		Если НЕ СтруктураИнформацияОбПолучателе = Неопределено  Тогда
			ДоговорПолучателя = СтруктураИнформацияОбПолучателе.ДоговорКонтрагента;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДоговорПолучателя) И ТипЗнч(ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") Тогда
			// БИТ_ЖКХ 11.01.2016 15:52:49 Начало правки... 
			ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,ПолучательДенежныхСредств,Организация);
			ДоговорПолучателя = ОсновнойДоговорКонтрагента;
			//ДоговорПолучателя = ПолучательДенежныхСредств.УдалитьОсновнойДоговорКонтрагента;
			// БИТ_ЖКХ 11.01.2016 15:52:50 Конец правки. 
		КонецЕсли; 
		
		Строки["СубконтоКУ1"] = Неопределено;
		Строки["СубконтоКУ2"] = Неопределено;
		Строки["СубконтоКУ3"] = Неопределено;
		
		// Заполним Счет КУ.
		Если ИсточникОплаты <> Неопределено Тогда
			// БИТ_ЖКХ добавление кода Начало: 23.11.2010
			Строки.СчетКУ  = ТранзтныйСчет;
			
			Если Не НомерСтрокиСубконтоКонтрагентыТранз = -1 тогда
				Если ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.Контрагенты") Тогда
					Строки["СубконтоКУ"+НомерСтрокиСубконтоКонтрагентыТранз] = ИсточникОплаты;
				ИначеЕсли ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.бит_КассыККМ") Тогда
					
					Контрагент = ИсточникОплаты.Контрагент;
					
					Если ЗначениеЗаполнено(Контрагент) Тогда
						
						Строки["СубконтоКУ"+НомерСтрокиСубконтоКонтрагентыТранз] = Контрагент;
						
					КонецЕсли; 
				КОнецЕсли 
			КонецЕсли;
			
			Если Не НомерСтрокиСубконтоДоговорыТранз = -1 тогда
				
				// БИТ_ЖКХ 11.01.2016 15:35:25 Начало правки... 
				Если ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.Контрагенты") Тогда
					
					ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
					РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,ИсточникОплаты,Организация);
					Если бит_рлс_ОбщегоНазначения.СсылкаДоступна(ОсновнойДоговорКонтрагента) 
						И ОсновнойДоговорКонтрагента.Организация = Организация Тогда
						Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыТранз] = ОсновнойДоговорКонтрагента;
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.бит_КассыККМ") Тогда 
					
					Контрагент = ИсточникОплаты.Контрагент;
					Если ЗначениеЗаполнено(Контрагент) Тогда 
						
						ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
						РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,Контрагент,Организация);
						Если бит_рлс_ОбщегоНазначения.СсылкаДоступна(ОсновнойДоговорКонтрагента)
							И ОсновнойДоговорКонтрагента.Организация = Организация Тогда 
							Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыТранз] = ОсновнойДоговорКонтрагента;
						КонецЕсли;
					КонецЕсли;	
				
				КонецЕсли
				//Если ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.Контрагенты") И бит_рлс_ОбщегоНазначения.СсылкаДоступна(ИсточникОплаты.УдалитьОсновнойДоговорКонтрагента) Тогда
				//	Если ИсточникОплаты.УдалитьОсновнойДоговорКонтрагента.Организация = Организация Тогда  	
				//		Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыТранз] = ИсточникОплаты.УдалитьОсновнойДоговорКонтрагента;
				//	КонецЕсли;
				//ИначеЕсли ТипЗнч(ИсточникОплаты) = Тип("СправочникСсылка.бит_КассыККМ") Тогда 
				//	
				//	Контрагент = ИсточникОплаты.Контрагент;
				//	
				//	Если ЗначениеЗаполнено(Контрагент) И бит_рлс_ОбщегоНазначения.СсылкаДоступна(Контрагент.УдалитьОсновнойДоговорКонтрагента) Тогда
				//		Если Контрагент.УдалитьОсновнойДоговорКонтрагента.Организация = Организация Тогда 
				//			
				//			Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыТранз] = Контрагент.УдалитьОсновнойДоговорКонтрагента;
				//			
				//		КонецЕсли;
				//	КонецЕсли; 
				//	
				//КонецЕсли
				// БИТ_ЖКХ 11.01.2016 15:35:39 Конец правки. 
				
			КонецЕсли;
			// БИТ_ЖКХ добавление кода конец : 23.11.2010
			
		ИначеЕсли ТипЗнч(ПолучательДенежныхСредств) = Тип("СправочникСсылка.Организации") И НЕ ЭтоОплата тогда
			
			Если ЭтоПени Тогда
				
				Если УслугаКапРемонт Тогда
					Строки.СчетКУ      = СчетПениКапРемонта;
					Строки.СубконтоКУ1 = СубконтоПениКапРем1;
					Строки.СубконтоКУ2 = СубконтоПениКапРем2;
					Строки.СубконтоКУ3 = СубконтоПениКапРем3;
				Иначе
					Строки.СчетКУ      = СчетПениСУ;
					Строки.СубконтоКУ1 = СубконтоПениСУ1;
					Строки.СубконтоКУ2 = СубконтоПениСУ2;
					Строки.СубконтоКУ3 = СубконтоПениСУ3;
				КонецЕсли;
				
				// БИТ_ЖКХ добавление кода. Начало. 29.03.2013{{
			ИначеЕсли ЭтоНачислениеЛьгот Тогда
				
				
				Если УслугаКапРемонт Тогда
					Строки.СчетКУ      = СчетЛьготКапРемонта;
					Строки.СубконтоКУ1 = СубконтоЛьготКапРем1;
					Строки.СубконтоКУ2 = СубконтоЛьготКапРем2;
					Строки.СубконтоКУ3 = СубконтоЛьготКапРем3;
				Иначе
					Строки.СчетКУ      = СчетЛьготСУ;
					Строки.СубконтоКУ1 = СубконтоЛьготСУ1;
					Строки.СубконтоКУ2 = СубконтоЛьготСУ2;
					Строки.СубконтоКУ3 = СубконтоЛьготСУ3;
					// БИТ_ЖКХ добавление кода. Конец. 29.03.2013}}
				КонецЕсли;
				
				// БИТ_ЖКХ_28082013_начало_изменений
			ИначеЕсли ЭтоНачислениеРасчетаПредельногоИндекса Тогда
				
				Строки.СчетКУ      = СчетРасчетПИСУ;
				Строки.СубконтоКУ1 = СубконтоРасчетПИСУ1;
				Строки.СубконтоКУ2 = СубконтоРасчетПИСУ2;
				Строки.СубконтоКУ3 = СубконтоРасчетПИСУ3;
				// БИТ_ЖКХ_28082013_начало_изменений
				
			ИначеЕсли ЭтоПереносОстатковРазовые Тогда
				
				Строки.СчетКУ = СтруктураСчетовЖКХ.ТранзитныйСчетОплаты;
				
			Иначе
				
				Если Строки.Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Эксплуатационная ИЛИ 
					Строки.Услуга.ТипыНачислений = Перечисления.бит_бу_ТипыНачисленийПоЖКХ.Эксплуатационная Тогда
					// БИТ_ЖКХ изменения кода . 28.02.2012 конец	
					// БИТ_ЖКХ добавление кода конец :
					Строки.СчетКУ       = СтруктураСчетовЖКХ.СчетСУЦС;
					
					// БИТ_ЖКХ изменения кода . Начало:
					// ИначеЕсли Строки.Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Аренда Тогда.
				ИначеЕсли Строки.Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Аренда ИЛИ Строки.Услуга.ТипыНачислений = Перечисления.бит_бу_ТипыНачисленийПоЖКХ.Аренда Тогда
					// БИТ_ЖКХ добавление кода конец :
					Строки.СчетКУ       = СтруктураСчетовЖКХ.СчетСУАренды;
					
				Иначе 
					
					Строки.СчетКУ       = СтруктураСчетовЖКХ.СчетСУКУ;
					
				КонецЕсли;
				
				СтрокаСубконта = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДвиженияЦелевыхСредств, "ВидСубконто");
				Если НЕ СтрокаСубконта = Неопределено  Тогда
					
					Строки["СубконтоКУ"+СтрокаСубконта.НомерСтроки] = Строки.Услуга.ДвижениеЦС;
					
				КонецЕсли;
				
				СтрокаСубконта = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
				Если НЕ СтрокаСубконта = Неопределено  Тогда
					
					Строки["СубконтоКУ"+СтрокаСубконта.НомерСтроки] = ДоговорПолучателя;
					
				КонецЕсли;
				
				СтрокаСубконта = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств, "ВидСубконто");	
				Если НЕ СтрокаСубконта = Неопределено  Тогда
					
					Строки["СубконтоКУ"+СтрокаСубконта.НомерСтроки] = Строки.Услуга.ЦелевыеСредства;
					
				КонецЕсли;
				
				СтрокаСубконта = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто");	
				Если НЕ СтрокаСубконта = Неопределено  Тогда
					
					Строки["СубконтоКУ"+СтрокаСубконта.НомерСтроки] = Строки.Услуга.Номенклатура;
					
				КонецЕсли;
				
				СтрокаСубконта = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто");	
				Если НЕ СтрокаСубконта = Неопределено Тогда
					
					//19.12.2018 55
					//14.01.2018 59
					Строки["СубконтоКУ"+СтрокаСубконта.НомерСтроки] = Перечисления.СтавкиНДС.СтавкаНДС(Строки.Услуга.Номенклатура.ВидСтавкиНДС, Дата);
					
				КонецЕсли;
				
				СтрокаСубконта = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто");	
				Если НЕ СтрокаСубконта = Неопределено Тогда
					
					Строки["СубконтоКУ"+СтрокаСубконта.НомерСтроки] = Строки.Услуга.НоменклатурнаяГруппа;
					
				КонецЕсли;
			КонецЕсли; 
			
			// БИТ_ЖКХ 23.11.2010 }Конец
			// БИТ_ЖКХ изменения кода . Конец  09.03.2011
			
			// Изменения типа значения субконто КУ.
			ОбработатьПоляСубконтаКУ(Строки, Организация);
			
		ИначеЕсли ТипЗнч(ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") И НЕ ЭтоОплата  тогда  
			
			Если ЭтоПени Тогда
				
				Если УслугаКапРемонт Тогда
					Строки.СчетКУ      = СчетПениКапРемонта;
					Строки.СубконтоКУ1 = СубконтоПениКапРем1;
					Строки.СубконтоКУ2 = СубконтоПениКапРем2;
					Строки.СубконтоКУ3 = СубконтоПениКапРем3;
				Иначе	
					
					Строки.СчетКУ      = СчетПениУСО;
					// БИТ_ЖКХ изменение кода. Начало. 09.04.2012{{
					
					Если Не НомерСтрокиСубконтоКонтрагентыПениУСО = -1 тогда
						Строки["СубконтоКУ"+НомерСтрокиСубконтоКонтрагентыПениУСО] = ПолучательДенежныхСредств;
					КонецЕсли;
					
					// БИТ_ЖКХ 11.01.2016 15:19:50 Начало правки... 
					Если Не НомерСтрокиСубконтоДоговорыПениУСО = -1 Тогда
						
						ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
						РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,ПолучательДенежныхСредств,Организация);
						Если бит_рлс_ОбщегоНазначения.СсылкаДоступна(ОсновнойДоговорКонтрагента) Тогда
							Если ОсновнойДоговорКонтрагента.Организация = Организация Тогда
								Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПениУСО] = ОсновнойДоговорКонтрагента;
								Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПениУСО] = ДоговорПолучателя;
							КонецЕсли; 
						КонецЕсли;
						
					КонецЕсли;
					//Если Не НомерСтрокиСубконтоДоговорыПениУСО = -1 И бит_рлс_ОбщегоНазначения.СсылкаДоступна(ПолучательДенежныхСредств.УдалитьОсновнойДоговорКонтрагента) тогда
					//	Если ПолучательДенежныхСредств.УдалитьОсновнойДоговорКонтрагента.Организация = Организация Тогда
					//		Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПениУСО] = ПолучательДенежныхСредств.УдалитьОсновнойДоговорКонтрагента;
					//		Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПениУСО] = ДоговорПолучателя;
					//	КонецЕсли; 
					//КонецЕсли;
					// БИТ_ЖКХ 11.01.2016 15:19:53 Конец правки. 
					
					Если НомерСтрокиСубконтоКонтрагентыПениУСО = - 1 Тогда
						Строки.СубконтоКУ1 = СубконтоПениУСО1;
						Строки.СубконтоКУ2 = СубконтоПениУСО2;
						Строки.СубконтоКУ3 = СубконтоПениУСО3;
						
					КонецЕсли;
					
				КонецЕсли; 
				
				// БИТ_ЖКХ изменение кода. Конец. 09.04.2012}}
			ИначеЕсли ЭтоНачислениеЛьгот Тогда
				
				Если УслугаКапРемонт Тогда
					Строки.СчетКУ      = СчетЛьготКапРемонта;
					Строки.СубконтоКУ1 = СубконтоЛьготКапРем1;
					Строки.СубконтоКУ2 = СубконтоЛьготКапРем2;
					Строки.СубконтоКУ3 = СубконтоЛьготКапРем3;
				Иначе
					Строки.СчетКУ      = СчетЛьготСторП;
					Строки.СубконтоКУ1 = СубконтоЛьготУСО1;
					Строки.СубконтоКУ2 = СубконтоЛьготУСО2;
					Строки.СубконтоКУ3 = СубконтоЛьготУСО3;
				КонецЕсли;
				
				// БИТ_ЖКХ_28082013_начало_изменений
			ИначеЕсли ЭтоНачислениеРасчетаПредельногоИндекса Тогда
				
				Строки.СчетКУ      = СчетРасчетПИУСО;
				Строки.СубконтоКУ1 = СубконтоРасчетПИУСО1;
				Строки.СубконтоКУ2 = СубконтоРасчетПИУСО2;
				Строки.СубконтоКУ3 = СубконтоРасчетПИУСО3;
				// БИТ_ЖКХ_28082013_начало_изменений
				
			ИначеЕсли ЭтоПереносОстатковРазовые Тогда
				
				Строки.СчетКУ = СтруктураСчетовЖКХ.ТранзитныйСчетОплаты;
				
			Иначе
				
				Строки.СчетКУ = СтруктураСчетовЖКХ.СчетСторПКУ;
				
				// БИТ_ЖКХ 23.11.2010  Начало{
				Если Не НомерСтрокиСубконтоКонтрагентыПКУ = -1 тогда
					Строки["СубконтоКУ"+НомерСтрокиСубконтоКонтрагентыПКУ] = ПолучательДенежныхСредств;
				КонецЕсли;
				
				// БИТ_ЖКХ 11.01.2016 15:03:14 Начало правки... 
				Если Не НомерСтрокиСубконтоДоговорыПКУ = -1 Тогда
					
					ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
					РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ОсновнойДоговорКонтрагента,ПолучательДенежныхСредств,Организация);
					Если бит_рлс_ОбщегоНазначения.СсылкаДоступна(ОсновнойДоговорКонтрагента) Тогда
						Если ОсновнойДоговорКонтрагента.Организация = Организация Тогда
							Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПКУ] = ДоговорПолучателя;
						ИначеЕсли ОсновнойДоговорКонтрагента.Пустая() Тогда	
							Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПКУ] = ДоговорПолучателя;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				//Если Не НомерСтрокиСубконтоДоговорыПКУ = -1 И бит_рлс_ОбщегоНазначения.СсылкаДоступна(ПолучательДенежныхСредств.УдалитьОсновнойДоговорКонтрагента) тогда
				//	Если ПолучательДенежныхСредств.УдалитьОсновнойДоговорКонтрагента.Организация = Организация Тогда
				//		Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПКУ] = ДоговорПолучателя;
				//		
				//		// БИТ_ЖКХ 27.11.2014{{	
				//	ИначеЕсли ПолучательДенежныхСредств.УдалитьОсновнойДоговорКонтрагента.Ссылка.Пустая() Тогда	
				//		Строки["СубконтоКУ"+НомерСтрокиСубконтоДоговорыПКУ] = ДоговорПолучателя;
				//		// БИТ_ЖКХ 27.11.2014}}
				//		
				//	КонецЕсли; 
				//КонецЕсли;
				// БИТ_ЖКХ 11.01.2016 15:03:23 Конец правки. 
				
			КонецЕсли;
			
			// БИТ_ЖКХ 23.11.2010 }Конец
			
		КонецЕсли;
		
		// Изменения типа значения субконто КУ
		Если НЕ Строки.СчетКУ = Неопределено Тогда
			ОбработатьПоляСубконтаКУ(Строки, Организация);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет измнения типов значения полей субконто в табличной части документа.
// 
// Параметры:
//
//		Строка  - ДокументТабличнаяЧестьСтрока - Строка табличной части.
//		Колонки - Колонки табличного поля      - Колонки.
//		Организация - СправочникСсылка.Организации - Организация.
//
Процедура ОбработкатьПоляСубконаАбонента(Строка, Организация)
	
	ПриВыбореСчетаВТабличномПоле(Строка.СчетАбонента, 
	Строка.Субконто1, 
	Строка.Субконто2, 
	Строка.Субконто3); 							
	
	ПроверитьВладельцаСубконтоПодразделение(Строка, 
	
	// БИТ_ЖКХ 31.01.2014
	бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"),// глЗначениеПеременной("глТекущийПользователь"),. 
	// БИТ_ЖКХ 31.01.2014										
	Организация, 
	Новый Структура("НазваниеСубконтоБУ1, НазваниеСубконтоБУ2, НазваниеСубконтоБУ3, 
	|СубконтоБУ1, СубконтоБУ2, СубконтоБУ3",
	"Субконто1", "Субконто2", "Субконто3", 
	Строка.СубконтоКУ1, Строка.СубконтоКУ2, Строка.СубконтоКУ3));
	
КонецПроцедуры

// Процедура выполняет измнения типов значения полей субконто в табличной части документа.
// 
// Параметры:
//
//		Строка  - ДокументТабличнаяЧестьСтрока - Строка табличной части.
//		Колонки - Колонки табличного поля      - Колонки.
//		Организация - СправочникСсылка.Организации - Организация.
//
Процедура ОбработатьПоляСубконтаКУ(Строка, Организация)
	
	ПриВыбореСчетаВТабличномПоле(Строка.СчетКУ, 
	Строка.СубконтоКУ1,
	Строка.СубконтоКУ2,
	Строка.СубконтоКУ3);
	
	// БИТ_ЖКХ 31.01.2014							
	ПроверитьВладельцаСубконтоПодразделение(Строка, 
	бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"),//глЗначениеПеременной("глТекущийПользователь"), 
	// БИТ_ЖКХ 31.01.2014										
	
	Организация, 
	Новый Структура("НазваниеСубконтоБУ1, НазваниеСубконтоБУ2, НазваниеСубконтоБУ3, 
	|СубконтоБУ1, СубконтоБУ2, СубконтоБУ3",
	"СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3", 
	Строка.СубконтоКУ1, Строка.СубконтоКУ2, Строка.СубконтоКУ3));
	
КонецПроцедуры

// Функция возвращает получателя денежных средств.
//
функция ПолучитьПолучателяДС(Дата, ЛицевойСчет,Услуга = Неопределено)
	
	Если Услуга <> Неопределено Тогда
		УсловиеУС = "И Услуга =&Услуга";
	Иначе
		УсловиеУС = "";
	КонецЕсли; 
	
	Результат = Новый Структура("Получатель, ДоговорКонтрагента");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЛСПоставщики.ЛицевойСчет,
	|	ЛСПоставщики.Услуга,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ДоговорКонтрагента
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|		бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
	|	ИЗ
	|		РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет "+ УсловиеУС +") КАК бит_СведенияПоУслугамЛССрезПоследних) КАК ЛСПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Момент, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|		ПО ЛСПоставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
	|			И ЛСПоставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик";
	
	
	Запрос.УстановитьПараметр("ЛицевойСчет" ,ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга"       ,Услуга);
	Запрос.УстановитьПараметр("Момент"       ,КонецМесяца(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Поставщик = Неопределено;
	
	Если Выборка.Следующий() Тогда

		Результат.Получатель         = Выборка.ПолучательДенежныхСредств;
		Результат.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
	КонецЕсли;                              
	
	// БИТ_ЖКХ 18.08.2014 раскомментирован код.
	Если Поставщик = Неопределено и типзнч(Услуга) = тип("СправочникСсылка.бит_бу_БиллинговыеУслуги") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЛСПоставщики.ЛицевойСчет,
		|	ЛСПоставщики.Услуга,
		|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|		бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
		|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
		|	ИЗ
		|		РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет "+ УсловиеУС +") КАК бит_СведенияПоУслугамЛССрезПоследних) КАК ЛСПоставщики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_бу_ПолучателиДенежныхСредств.СрезПоследних(&Момент, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
		|		ПО ЛСПоставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
		|			И ЛСПоставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Поставщик = Выборка.ПолучательДенежныхСредств;
			Результат.Получатель = Выборка.ПолучательДенежныхСредств; // БИТ_ЖКХ добавлен получатель

		КонецЕсли;
		
	КонецЕсли; 
	// БИТ_ЖКХ 18.08.2014
	
	Возврат Результат;
	// БИТ_ЖКХ изменение кода. Конец. 14.11.2011}}
КонецФункции

// БИТ_ЖКХ 19.11.2010  Начало{
функция ПолучитьПолучателяДСПоПоставщику(Дата, Поставщик, Услуга = Неопределено)
	
	Результат = Новый Структура("Получатель, ДоговорКонтрагента");
	
	Если Услуга <> Неопределено Тогда
		УсловиеУС = "И Услуга =&Услуга";
	Иначе
		УсловиеУС = "";
	КонецЕсли; 
	// БИТ_ЖКХ изменение кода. Начало. 14.11.2011{{
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Услуга,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ДоговорКонтрагента
	|ИЗ
	|	РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(
	|			&Момент,
	|			Поставщик = &Поставщик "+ УсловиеУС +" ) КАК бит_ПолучателиДенежныхСредствСрезПоследних";
	
	Запрос.УстановитьПараметр("Поставщик"	,Поставщик);
	Запрос.УстановитьПараметр("Услуга"		,Услуга);
	Запрос.УстановитьПараметр("Момент"		,КонецМесяца(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Поставщик = Неопределено;
	
	Если Выборка.Следующий() Тогда

		Результат.Получатель         = Выборка.ПолучательДенежныхСредств;
		Результат.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
	КонецЕсли;
	
	Возврат Результат;
	// БИТ_ЖКХ изменение кода. Конец. 14.11.2011}}
КонецФункции
// БИТ_ЖКХ 19.11.2010 }Конец

// Функция возвращает возможные счета учета расчетов с контрагентом по видам взаиморасчетов. 
Функция ПолучитьСчетаРасчетовЖКХ(Организация,Дата) Экспорт
	
	// БИТ_ЖКХ 06.02.2012. 
	// В стурктуру добавлен счет пени.
	Результат = Новый Структура("СчетАбонента,
	|СчетСУКУ,
	|СчетСУЦС,
	|СчетЛьготСУ,
	|СчетСторПКУ,
	|СчетСторПКУОплата,
	|СчетЛьготСторП,
	|ТранзитныйСчетОплаты,
	|СчетСУАренды,
	|СчетДохода,
	|Субконто1,
	|Субконто2,
	|Субконто3,
	|СчетПениСУ,
	|СубконтоПениСУ1,
	|СубконтоПениСУ2,
	|СубконтоПениСУ3,
	|СчетПениУСО,
	|СубконтоПениУСО1,
	|СубконтоПениУСО2,
	|СубконтоПениУСО3,
	// БИТ_ЖКХ_28082013_начало_изменений
	|СчетРасчетПИСУ,
	|СубконтоРасчетПИСУ1,
	|СубконтоРасчетПИСУ2,
	|СубконтоРасчетПИСУ3,
	|СчетРасчетПИУСО,
	|СубконтоРасчетПИУСО1,
	|СубконтоРасчетПИУСО2,
	|СубконтоРасчетПИУСО3,
	// БИТ_ЖКХ_28082013_окончание_изменений
	|СубконтоЛьготСУ1,
	|СубконтоЛьготСУ2,
	|СубконтоЛьготСУ3,
	|СубконтоЛьготУСО1,
	|СубконтоЛьготУСО2,
	|СубконтоЛьготУСО3,
	|СчетЛьготКапРемонта,
	|СубконтоЛьготКапРем1,
	|СубконтоЛьготКапРем2,
	|СубконтоЛьготКапРем3,
	|СчетПениКапРемонта,
	|СубконтоПениКапРем1,
	|СубконтоПениКапРем2,
	|СубконтоПениКапРем3");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация" ,Организация);
	Запрос.УстановитьПараметр("Момент"		,Дата);
	
	ТекстЗапроса =
	// БИТ_ЖКХ 06.02.2012
	// В поля запроса добавлен счет пени.
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетАбонента,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУЦС,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетЛьготСУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСторПКУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетЛьготСторП,
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСУАренды,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетСторПКУОплата,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетДохода,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Субконто1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Субконто2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.Субконто3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениСУ1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениСУ2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениСУ3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетПениУСО,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО3,
	// БИТ_ЖКХ_28082013_начало_изменений
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетНачисленийРасчетаПредельногоИндексаСобственныхУслуг КАК СчетРасчетПИСУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями КАК СчетРасчетПИУСО,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг1 КАК СубконтоРасчетПИСУ1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг2 КАК СубконтоРасчетПИСУ2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСобственныхУслуг3 КАК СубконтоРасчетПИСУ3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями1 КАК СубконтоРасчетПИУСО1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями2 КАК СубконтоРасчетПИУСО2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоНачисленийРасчетаПредельногоИндексаСоСтороннимиОрганизациями3 КАК СубконтоРасчетПИУСО3,
	// БИТ_ЖКХ_28082013_окончание_изменений
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготСУ1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготСУ2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготСУ3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготУСО1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготУСО2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготУСО3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетЛьготКапРемонта,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготКапРем1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготКапРем2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоЛьготКапРем3,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетПениКапРемонта,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениКапРем1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениКапРем2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениКапРем3
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Момент, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСчетаРасчетовСКонтрагентом()

// Процедура установки типа и доступности субконто в зависимости от  выбранного счета.
//
Процедура ПриВыбореСчетаВТабличномПоле(Счет, Субконто1, Субконто2, Субконто3)
	
	ЭлементыСубконто = Новый Структура(
	"Субконто1,Субконто2,Субконто3", 
	Субконто1, Субконто2, Субконто3);
	
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		
		Если ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]) <> ЭлементыСубконто["Субконто" + Сч] Тогда
			ЭлементыСубконто["Субконто" + Сч] = ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Сч = (ЧислоАктивныхСубконто + 1) По 3 Цикл
		
		Если Не ЭлементыСубконто["Субконто" + Сч] = Неопределено Тогда
			ЭлементыСубконто["Субконто" + Сч] = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Субконто1 = ЭлементыСубконто.Субконто1 Тогда
		Субконто1 = ЭлементыСубконто.Субконто1;
	КонецЕсли;
	Если Не Субконто2 = ЭлементыСубконто.Субконто2 Тогда
		Субконто2 = ЭлементыСубконто.Субконто2;
	КонецЕсли;
	Если Не Субконто3 = ЭлементыСубконто.Субконто3 Тогда
		Субконто3 = ЭлементыСубконто.Субконто3;
	КонецЕсли;
	
КонецПроцедуры // ПриВыбореСчета()

// Процедура проверяет принадлежность реквизита типа ПодразделениеОрганизации выбранной организации.
//
// Параметры:
//  ДокументОбъект - объект документ, в форме которого произошло событие.
//  ТекПользователь - текущий пользователь, настройки которого используются по умолчанию.
//  НазваниеРеквизитаСубконто - название проверяемого реквизита.
//  Субконто     - значение проверяемого реквизита.
//
Процедура ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, НазваниеРеквизитаСубконто, Субконто)
	
	Если ТипЗнч(Субконто) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		ПодразделениеПоУмолчанию = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделениеОрганизации");
		
		// Если субконто не заполнено.
		Если НЕ ЗначениеЗаполнено(Субконто) Тогда
			
			// Если субконто соответствует выбранной организации, подставляем его.
			Если ПодразделениеПоУмолчанию.Владелец = Организация Тогда
				ДокументОбъект[НазваниеРеквизитаСубконто] = ПодразделениеПоУмолчанию;
			КонецЕсли;
			
		Иначе // Если ПодразделениеОрганизации заполнено.
			
			// Если ПодразделениеОрганизации не соответствует выбранной организации.
			Если НЕ Субконто.Владелец = Организация Тогда
				
				// Если ПодразделениеПоУмолчанию сооответствует выбранной организации, подставляем его.
				Если ПодразделениеПоУмолчанию.Владелец = Организация Тогда
					ДокументОбъект[НазваниеРеквизитаСубконто] = ПодразделениеПоУмолчанию;
				Иначе // Выбрана не основная организация. ПодразделениеОрганизации нужно очистить.
					ДокументОбъект[НазваниеРеквизитаСубконто] = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   // ПроверитьСубконтоПодразделение()

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
// Параметры:
//	ДокументОбъект - объект документ в форме которого произошло событие.
//  ТекПользователь - текущий пользователь, настройки которого используются по умолчанию.
//  СтруктураРеквизитов - структура с названиями и значениями реквизитов, которую необходимо проверить.
//
Процедура ПроверитьВладельцаСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов) Экспорт
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоБУ1") И СтруктураРеквизитов.Свойство("СубконтоБУ1") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоБУ1, СтруктураРеквизитов.СубконтоБУ1);
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоБУ2") И СтруктураРеквизитов.Свойство("СубконтоБУ2") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоБУ2, СтруктураРеквизитов.СубконтоБУ2);
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоБУ3") И СтруктураРеквизитов.Свойство("СубконтоБУ3") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоБУ3, СтруктураРеквизитов.СубконтоБУ3);
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоНУ1") И СтруктураРеквизитов.Свойство("СубконтоНУ1") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоНУ1, СтруктураРеквизитов.СубконтоНУ1);
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоНУ2") И СтруктураРеквизитов.Свойство("СубконтоНУ2") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоНУ2, СтруктураРеквизитов.СубконтоНУ2);
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоНУ3") И СтруктураРеквизитов.Свойство("СубконтоНУ3") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоНУ3, СтруктураРеквизитов.СубконтоНУ3);
	КонецЕсли;
	
КонецПроцедуры  // ПроверитьВладельцаПодразделения()

#КонецОбласти

#Область БлокПроцедурСкопированныхИзБухгалтерии

// Процедура удаления существующих движений документа при перепроведении (отмене проведения).
//
Процедура УдалитьДвиженияРегистратора(ДокументОбъект, Отказ, РучнаяКорректировка = Ложь, ВыборочноОчищатьРегистры = Истина) Экспорт
	
	Если РучнаяКорректировка Тогда
		ИзменитьАктивностьПоРегистратору(ДокументОбъект, Отказ, Ложь);
		возврат;
	КонецЕсли;
	
	Если ВыборочноОчищатьРегистры Тогда
		СписокРегистровДляОчисткиДвижений = Новый Массив;
		СписокРегистровДляОчисткиДвижений.Добавить(Тип("РегистрНакопленияНаборЗаписей.РасходыПриУСН"));
	КонецЕсли;
	
	// Очистка движений документа.
	Для Каждого Движение ИЗ ДокументОбъект.Движения Цикл
		
		Если ВыборочноОчищатьРегистры И (СписокРегистровДляОчисткиДвижений.Найти(ТипЗнч(Движение))<>неопределено) Тогда
			Продолжить;
		КонецЕсли;
		Движение.Очистить();
		
	КонецЦикла;
	
	// Запись пустых наборов движений в ИБ(очистка старых движений).	
	Для Каждого Движение ИЗ ДокументОбъект.Движения Цикл
		
		Если (ВыборочноОчищатьРегистры И (СписокРегистровДляОчисткиДвижений.Найти(ТипЗнч(Движение))<>неопределено))
			ИЛИ НЕ ВыборочноОчищатьРегистры Тогда
			
			Если Движение.Количество() > 0 Тогда
				ПозицияТочки = Найти(Строка(Движение), ".");
				ТипРегистра = Лев(Строка(Движение), ПозицияТочки - 13);
				ИмяРегистра = СокрП(Сред(Строка(Движение), ПозицияТочки + 1));
				
				ЕСли ТипРегистра = "РегистрНакопления" Тогда
					МетаданныеНабора = Метаданные.РегистрыНакопления[ИмяРегистра];
					Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
					
				ИначеЕсли ТипРегистра = "РегистрБухгалтерии" Тогда
					МетаданныеНабора = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
					Набор = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
					
				ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
					МетаданныеНабора = Метаданные.РегистрыСведений[ИмяРегистра];
					Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
					
				ИначеЕсли ТипРегистра = "РегистрРасчета" Тогда
					МетаданныеНабора = Метаданные.РегистрыРасчета[ИмяРегистра];
					Набор = РегистрыРасчета[ИмяРегистра].СоздатьНаборЗаписей();
					
				КонецЕсли;
				
				Если НЕ ПравоДоступа("Изменение", МетаданныеНабора) Тогда
					// Отсутствуют права на всю таблицу регистра.
					СообщитьОбОшибке("Нарушение прав доступа", Отказ, Строка(Движение));
					Возврат;
				КонецЕсли;
				
				Набор.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);			
				
			Иначе
				Набор = Движение;
			КонецЕсли;
			
			Попытка
				Набор.Записать();
			Исключение
				// Возможно «сработал» RLS или механизм даты запрета изменения.
				СообщитьОбОшибке(ОписаниеОшибки(), Отказ, Набор);
				ВызватьИсключение "Операция не выполнена";
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура включения активности движений при проведении документа, движения которого заданы вручную.
Процедура ИзменитьАктивностьПоРегистратору(ДокументОбъект, Отказ,ВключитьАктивность = Истина) Экспорт
	
	Для Каждого Набор ИЗ ДокументОбъект.Движения Цикл
		
		Набор.Прочитать();
		Набор.УстановитьАктивность(ВключитьАктивность);
		
		Попытка
			Набор.Записать();
		Исключение
			// Возможно «сработал» RLS или механизм даты запрета изменения.
			СообщитьОбОшибке(ОписаниеОшибки(), Отказ, Набор.Имя);
			ВызватьИсключение "Операция не выполнена";
		КонецПопытки;	
		
	КонецЦикла;	
	
КонецПроцедуры

// БИТ_ЖКХ 28.10.2011
//
Процедура СообщитьОбОшибке(Знач ТекстСообщения, Отказ = Ложь, Заголовок = "", Знач Статус = Неопределено, ВызыватьИсключение = Истина) Экспорт
	
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.Важное;
	КонецЕсли;
	
	ТекстСообщения = СформироватьТекстСообщения(ТекстСообщения);
	Отказ = Истина;
	
	#Если ВнешнееСоединение Тогда
		
		Если ВызыватьИсключение Тогда
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
				Заголовок = "";
			КонецЕсли;
			
			ВызватьИсключение (ТекстСообщения);
		КонецЕсли;
		
	#Иначе
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = Заголовок;
			Сообщение.Сообщить();
			
			Заголовок = "";
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
	#КонецЕсли
	
КонецПроцедуры // СообщитьОбОшибке()

// Функция убирает из текста сообщения служебную информацию.
//
// Параметры:
//  ТекстСообщения, Строка, исходный текст сообщения.
// Возвращаемое значение:
//   Строка.
//
Функция СформироватьТекстСообщения(Знач ТекстСообщения) Экспорт
	
	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	
	Если ОкончаниеСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения < ОкончаниеСлужебногоСообщения Тогда
		
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) +
		Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
		
	КонецЕсли;
	
	Возврат СокрЛП(ТекстСообщения);
	
КонецФункции // ()

// Формирует структуру, содержащую значения реквизитов шапки документа.
//
// Параметры: 
//  ДокументОбъект - объект документа для формирования структуры шапки, 
//
// Возвращаемое значение:
//  Сформированная структура.
//
Функция СформироватьСтруктуруШапкиДокумента(ДокументОбъект) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// Первоначальные данные о документе.
	СтруктураШапкиДокумента = Новый Структура;
	СтруктураШапкиДокумента.Вставить("Ссылка", ДокументОбъект.Ссылка);
	СтруктураШапкиДокумента.Вставить("Дата",   ДокументОбъект.Дата);
	СтруктураШапкиДокумента.Вставить("Номер",  ДокументОбъект.Номер);
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	СтруктураШапкиДокумента.Вставить("ВидДокумента",  МетаданныеДокумента.Имя);
	СтруктураШапкиДокумента.Вставить("ПредставлениеВидаДокумента",  МетаданныеДокумента.Представление());
	СтруктураШапкиДокумента.Вставить("ПредставлениеДокумента", СокрЛП(ДокументОбъект));
	
	Для каждого Реквизит из МетаданныеДокумента.Реквизиты Цикл
		СтруктураШапкиДокумента.Вставить(Реквизит.Имя, ДокументОбъект[Реквизит.Имя]);
	КонецЦикла;
	
	Если НЕ СтруктураШапкиДокумента.Свойство("ПодразделениеОрганизации") Тогда
		СтруктураШапкиДокумента.Вставить("ПодразделениеОрганизации", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	КонецЕсли;
	
	// Отображение обязательных данных о договоре.
	Если СтруктураШапкиДокумента.Свойство("ДоговорКонтрагента") Тогда
		
		Если ТипЗнч(СтруктураШапкиДокумента.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") тогда
			
			СтруктураШапкиДокумента.Вставить("ВалютаВзаиморасчетов",     СтруктураШапкиДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов);
			СтруктураШапкиДокумента.Вставить("РасчетыВУсловныхЕдиницах", СтруктураШапкиДокумента.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураШапкиДокумента;
	
КонецФункции // СформироватьСтруктуруШапкиДокумента()

// Формирует строку представления документа для сообщений при проведении.
//
// Параметры:
//  Документ - ссылка на проводимый документ.
//
// Возвращаемое значение:
//  Строка с представлением документа.
//
Функция ПредставлениеДокументаПриПроведении(Документ) Экспорт
	
	МетаданныеДокумента = Документ.Метаданные();
	
	ВидОперацииСтр = "";
	
	Если ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента) Тогда
		ВидОперацииСтр = " (" + Документ.ВидОперации + ")";
	КонецЕсли;
	
	Возврат "Проведение документа: " + СокрЛП(Документ) + ВидОперацииСтр;
	
КонецФункции // ПредставлениеДокументаПриПроведении()

// Функция проверка ручной корректировки.
//
Функция РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, ВыборочноОчищатьРегистры = Истина)  Экспорт
	
	Если РучнаяКорректировка Тогда
		ИзменитьАктивностьПоРегистратору(ЭтотОбъект, Отказ);
		ТекстСообщения = "Движения документа отредактированы вручную и не могут быть автоматически актуализированы.";
		СообщитьОбОшибке(ТекстСообщения, ,Заголовок);
		Возврат Истина;
	Иначе
		УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, Ложь, 
		ВыборочноОчищатьРегистры И НЕ ЭтотОбъект.ДополнительныеСвойства.ДатаДокументаСдвинутаВперед);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // РучнаяКорректировкаОбработкаПроведения()

// Функция позволяет определить есть ли среди реквизитов шапки документа реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеДокумента) Экспорт
	
	Возврат НЕ (МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено);
	
КонецФункции // ЕстьРеквизитДокумента()

// Функция возвращает ссылку на текущего пользователя базы данных,
// Установленного по учетной записи пользователя конфигурации.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи.
//
Функция ТекущийПользователь() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

// По переданной структуре полей формирует запрос по табличной части документа.
//
// Параметры: 
//  ДокументОбъект    - объект проводимого документа,. 
//  ИмяТабличнойЧасти - строка, имя табличной части,.
//  СтруктураПолей    - структура, ключ структуры содержит псевдоним поля запроса, значение - строку запроса,.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, СтруктураПолей) Экспорт
	
	ТекстЗапроса = "";
	
	Для Каждого Реквизит Из СтруктураПолей Цикл
		
		ТекстЗапроса  = ТекстЗапроса + ",
		|	Док." + Реквизит.Значение + " КАК " + СокрЛП(Реквизит.Ключ);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Док.НомерСтроки " + ТекстЗапроса + "
	|
	|ИЗ 
	|	Документ." + ДокументОбъект.Метаданные().Имя + "."+ СокрЛП(ИмяТабличнойЧасти) + " КАК Док
	|
	|ГДЕ
	|	Док.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|      НомерСтроки";
	
	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ДокументСсылка" , ДокументОбъект.Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоТабличнойЧасти()

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСоСтроками

// Функция "расщепляет" строку на подстроки, используя заданный	разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы. 
//		Считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр игнорируются.
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//	Возвращаемое значение:
//		Массив значений, элементы которого - подстроки.
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 
// БИТ_ЖКХ изменения кода: 04.04.2012

// БИТ_ЖКХ добавление кода. Начало. 08.06.2012{{
Функция ТекстРазделителяЗапросовПакета() Экспорт
	
	ТекстРазделителя =
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстРазделителя;
	
КонецФункции
// БИТ_ЖКХ добавление кода. Конец. 08.06.2012}}

// Функция определяет принадлежит ли тип переданного значения к примитивным типам.
//
// Параметры:
//	ТекущееЗначение - любое значение, ТипЗначение.
//
// Возвращаемое значение:
//	ПримитивныйТип - булево.
//
Функция ЭтоПримитивныйТип(ТекущееЗначение) Экспорт
	
	ПримитивныйТип = Ложь;
	
	Если ТипЗнч(ТекущееЗначение) = Тип("Тип") Тогда
		
		Если ТекущееЗначение = Тип("Строка") 
			ИЛИ ТекущееЗначение = Тип("Число") 
			ИЛИ ТекущееЗначение = Тип("Дата") 
			ИЛИ ТекущееЗначение = Тип("Булево") 
			ИЛИ ТекущееЗначение = Тип("ХранилищеЗначения") 
			ИЛИ ТекущееЗначение = Тип("NULL") 
			ИЛИ ТекущееЗначение = Тип("Неопределено") Тогда
			
			ПримитивныйТип = Истина;
			
		КонецЕсли; 
		
	Иначе	
		
		Если ТипЗнч(ТекущееЗначение) = Тип("Строка") 
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("Число")
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("Дата")
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("Булево")
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("ХранилищеЗначения")		 		 
			ИЛИ ТекущееЗначение = Неопределено
			ИЛИ ТекущееЗначение = NULL Тогда
			
			ПримитивныйТип = Истина;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ПримитивныйТип;
	
КонецФункции // ЭтоПримитивныйТип()

Функция УбитьЛишнее(ИсходнаяСтрока)  Экспорт
	
	ИнтересныйСимвол = Символ(160); 
	
	Результат =  СтрЗаменить(ИсходнаяСтрока,ИнтересныйСимвол,"");
	
	Результат =  СтрЗаменить(Результат," ","");
	
	Возврат Результат;
	
КонецФункции // УбитьПробелы()

// БИТ_ЖКХ 15.08.2012
//
Функция МодульЧисла(ВхЧисло) Экспорт
	
	Если ТипЗнч(ВхЧисло) = Тип("Число") Тогда
		
		Если ВхЧисло>0 Тогда
			Результат = ВхЧисло;
		Иначе
			Результат = -ВхЧисло;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // МодульЧисла()

// Дробит указанный текст на две части, длина первой из которых не превышает указанной длины.
//
// Параметры:
//  Строка       – Строка – исходный текст.
//  Длина        – Число – максимальная длина первой части.
//  Стр1         – Строка – первая часть текста.
//  Стр2         – Строка – вторая часть текста.
//
Процедура РазделитьТекстНаДвеСтроки(Строка, Длина, Стр1, Стр2) Экспорт
	
	Если СтрДлина(Строка) <= Длина Тогда
		Стр1 = Строка;
		Стр2 = "";
		Возврат;
	КонецЕсли;
	
	КонецСлова = Длина + 1;
	Пока Сред(Строка, КонецСлова, 1) <> " " И КонецСлова > 0  Цикл
		КонецСлова = КонецСлова - 1;
	КонецЦикла;
	Если КонецСлова <= Длина / 2 Тогда
		КонецСлова = 0;
	КонецЕсли;
	
	Перенос = Ложь;
	Если КонецСлова = 0 Тогда
		Перенос = Истина;
		КонецСлова = Длина;
	КонецЕсли;
	
	Стр1 = Лев(Строка, КонецСлова) + ?(Перенос, "-", "");
	Стр2 = Прав(Строка, СтрДлина(Строка) - КонецСлова);
	
КонецПроцедуры // РазделитьТекстНаДвеСтроки()

#КонецОбласти

#Если Клиент Тогда
	
#Область ПроцедурыИФункцииПечати
	
// Функция заполняет начальные параметры построителю отчета, который.
//  Используется для настройки отбора в механизме подключения внешних печатных форм.
//
// Параметры:
//  ИмяТаблицы     - Строка, имя таблицы БД к которой необходимо определить запрос.
//  СинонимТаблицы - Строка, синоним таблицы БД к которой необходимо определить запрос.
//
// Возвращаемое значение:
//   ПостроительОтчета.
//
Функция ИнициализироватьПостроительДопПечатныхФорм(ИмяТаблицы, СинонимТаблицы) Экспорт
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Объект.Ссылка КАК Ссылка
	|ИЗ
	|	" + ИмяТаблицы + " КАК Объект
	|ГДЕ
	|	Объект.Ссылка = &Ссылка
	|{ГДЕ
	|	Объект.Ссылка.*}
	|";
	
	ПолеОбъекта = ПостроительОтчета.ДоступныеПоля.Найти("Ссылка");
	ПолеОбъекта.Представление = ?(НЕ ЗначениеЗаполнено(СинонимТаблицы), ИмяТаблицы, СинонимТаблицы);
	
	Возврат ПостроительОтчета;
	
КонецФункции // ()

Функция ПолучитьСтрокуДереваМакетовПоУмолчанию(ИмяМетаданных,ДеревоКнопок)
	
	ИмяМакетаПоУмолчанию = ВосстановитьЗначение(ИмяМетаданных+ "МакетПечати");
	
	Если ИмяМакетаПоУмолчанию = Ложь или ДеревоКнопок.Строки.Количество() = 0 Тогда
		
		СтрокаПоУмолчанию = Неопределено;
		
	Иначе
		
		СтрокаПоУмолчанию = ДеревоКнопок.Строки.Найти(ИмяМакетаПоУмолчанию,"Текст");
		
		Если СтрокаПоУмолчанию = Неопределено Тогда
			
			СтрокаПоУмолчанию = ДеревоКнопок.Строки[0];
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаПоУмолчанию;
	
КонецФункции // ()

// Процедура формирует дерево кнопок для подменю "Печать".
//
Функция ПолучитьДеревоМакетовПечати(СсылкаОбъекта, ВнутренниеПечатныеФормы, Действие = Неопределено, ДействиеУстановитьПечатьПоУмолчанию = Неопределено) Экспорт
	
	ДеревоКнопок = ИнициализироватьДеревоДополнительныхКнопок();
	
	Если Не ВнутренниеПечатныеФормы = Неопределено Тогда
		ДобавитьВДеревоМакетовВстроенныеФормы(ДеревоКнопок, ВнутренниеПечатныеФормы, Действие);
		
	КонецЕсли;
	
	ДобавитьВДеревоМакетовДополнительныеФормы(ДеревоКнопок, СсылкаОбъекта, Действие);
	
	СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(СсылкаОбъекта.Метаданные().Имя ,ДеревоКнопок);
	
	Если Не СтрокаПоУмолчанию = Неопределено Тогда
		
		СтрокаПоУмолчанию.Пометка = Истина;
		
	КонецЕсли;
	
	Если ДеревоКнопок.Строки.Количество() > 0 Тогда
		
		ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, Строка(Новый УникальныйИдентификатор), ТипКнопкиКоманднойПанели.Разделитель);
		
		ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, "ПечатьПоУмолчанию", ТипКнопкиКоманднойПанели.Действие, "По умолчанию...", ДействиеУстановитьПечатьПоУмолчанию, "ПечатьПоУмолчанию");
		
	КонецЕсли; 
	
	
	Возврат ДеревоКнопок;
	
КонецФункции // ()

// Процедура Устанавливает кнопку "Печать по умолчанию".
//
Процедура УстановитьПечатьПоУмолчанию(ПечатьПоУмолчанию, КоманднаяПанель, ДеревоМакетов, ИмяМетаданных, ДействиеПечатьПоУмолчанию) Экспорт
	
	СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(ИмяМетаданных,ДеревоМакетов);
	
	
	Если Не СтрокаПоУмолчанию = Неопределено Тогда
		Если ПечатьПоУмолчанию = Неопределено Тогда
			
			ИмяКнопки = Строка (Новый УникальныйИдентификатор);
			
			Если КоманднаяПанель.ВыравниваниеКнопок = ВыравниваниеКнопокКоманднойПанели.Право Тогда
				КоманднаяПанель.Кнопки.Вставить(0,,ТипКнопкиКоманднойПанели.Разделитель);
				ПечатьПоУмолчанию = КоманднаяПанель.Кнопки.Вставить(0,ИмяКнопки,ТипКнопкиКоманднойПанели.Действие,"",ДействиеПечатьПоУмолчанию);
			Иначе
				КоманднаяПанель.Кнопки.Добавить(,ТипКнопкиКоманднойПанели.Разделитель);
				ПечатьПоУмолчанию = КоманднаяПанель.Кнопки.Добавить(ИмяКнопки,ТипКнопкиКоманднойПанели.Действие,"",ДействиеПечатьПоУмолчанию);
			КонецЕсли;
			
			ПечатьПоУмолчанию.Подсказка = "Печать по умолчанию";
			
		КонецЕсли; 
		
		ПечатьПоУмолчанию.Текст       = СтрокаПоУмолчанию.Текст;
		ПечатьПоУмолчанию.Доступность = Истина; 
		
	ИначеЕсли Не ПечатьПоУмолчанию = Неопределено Тогда
		
		ПечатьПоУмолчанию.Текст       = "Печать по умолчанию не назначена"; 
		ПечатьПоУмолчанию.Доступность = Ложь; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура устанавливает Подменю "Печать". 
// Параметры:
//    Форма       : Форма, вызвавшая процедуру.
//    ДополнительныеКнопки : Структура дополнительных кнопок.
Процедура УстановитьПодменюПечати(ПодменюПечати, КоманднаяПанель, СоздаватьПриНеобходимости) Экспорт
	
	Если Не ПодменюПечати = Неопределено или  Не СоздаватьПриНеобходимости Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяПодменю = Строка (Новый УникальныйИдентификатор);
	Если КоманднаяПанель.ВыравниваниеКнопок = ВыравниваниеКнопокКоманднойПанели.Право Тогда
		КоманднаяПанель.Кнопки.Вставить(0,,ТипКнопкиКоманднойПанели.Разделитель);
		ПодменюПечати = КоманднаяПанель.Кнопки.Вставить(0,ИмяПодменю,ТипКнопкиКоманднойПанели.Подменю,"Печать");
	Иначе
		КоманднаяПанель.Кнопки.Добавить(,ТипКнопкиКоманднойПанели.Разделитель);
		ПодменюПечати = КоманднаяПанель.Кнопки.Добавить(ИмяПодменю,ТипКнопкиКоманднойПанели.Подменю,"Печать");
	КонецЕсли;
	ПодменюПечати.Подсказка = "Меню выбора печатных форм";
	
	
КонецПроцедуры

// Процедура - обработчик нажатия любой из дополнительных кнопок печати.
// Параметры:
//    ДеревоМакетов: ДеревоЗначений, макетов печатных форм.
//    Объект       : ДокументОбъект, СправочникОбъект, из формы которого вызвана процедура.
//    Форма        : Форма, вызвавшая процедуру.
//    ТекстКнопки  : Строка, заголовок нажатой кнопки.
Процедура ПечатьПоДополнительнойКнопке(УдалитьДеревоМакетов, Объект, Форма = Неопределено, ТекстКнопки) Экспорт
	
	Если Не Форма = Неопределено Тогда		
		// БИТ_ЖКХ добавление кода. 13.11.2013}}
		
		// Если Не РаботаСДиалогами.ПроверитьМодифицированностьВФорме(Объект,Форма) Тогда.
		Если Не бит_РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(Объект,Форма) Тогда
			// БИТ_ЖКХ добавление кода. 13.11.2013}}    Конец
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	
	Попытка
		СтруктураВнутреннихПечатныхФорм = Объект.ПолучитьСтруктуруПечатныхФорм()
	Исключение
		СтруктураВнутреннихПечатныхФорм = Новый Структура;
	КонецПопытки;
	
	ДеревоМакетовПечати = ПолучитьДеревоМакетовПечати(Объект.Ссылка, СтруктураВнутреннихПечатныхФорм);
	
	СтрокаКнопки = ДеревоМакетовПечати.Строки.Найти(ТекстКнопки,"Текст");
	
	Если СтрокаКнопки = Неопределено Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПечатьПоДополнительнойКнопкеЗавершение1", бит_ОбщегоНазначения), "Печать не доступна. Изменился набор реквизитов!");
		Возврат;
		
	КонецЕсли;
	
	НаПринтер = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ПечатьДокументовБезПредварительногоПросмотра") = Истина;
	
	Расшифровка = СтрокаКнопки.Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		ТабДокумент = НапечататьВнешнююФорму(Объект.Ссылка, Расшифровка);
		
	Иначе
		Объект.Печать(СтрокаКнопки.Имя, 0, НаПринтер);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьПоДополнительнойКнопкеЗавершение1(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

Процедура ПечатьПоДополнительнойКнопкеЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;
	
КонецПроцедуры // ПечатьПоДополнительнойКнопке()

// Процедура назначает макет по умолчанию.
//
Функция НазначитьКнопкуПечатиПоУмолчанию(ДеревоМакетов, ИмяМетаданных) Экспорт
	
	СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(ИмяМетаданных,ДеревоМакетов);
	
	СписокМакетов = Новый СписокЗначений;
	
	Для каждого Строка Из ДеревоМакетов.Строки Цикл
		
		Если Строка.ТипКнопки = ТипКнопкиКоманднойПанели.Действие и Не Строка.Расшифровка = "ПечатьПоУмолчанию" Тогда
			
			СписокМакетов.Добавить(Строка.Текст,,СтрокаПоУмолчанию = Строка);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции

// Функция получает ТабличныйДокумент для печати из внешней печатной формы.
//
// Параметры:
//  Ссылка         - Ссылка, для которой необходимо напечатать документ.
//  ДвоичныеДанные - ДвоичныеДанные, внешняя обработка для печати.
//
// Возвращаемое значение:
//   ТабличныйДокумент.
//
Функция НапечататьВнешнююФорму(Ссылка, ИсточникМакета) Экспорт
	
	Перем ДополнительныеПараметры;
	
	ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.Принадлежность[ИсточникМакета.НомерСтроки - 1].ХранилищеВнешнейОбработки.Получить();
	
	// Получить дополнительные параметры внешней обработки.
	ИсточникМакета.Свойство("ДополнительныеПараметрыОбработки", ДополнительныеПараметры);
	
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Обработка.СсылкаНаОбъект = Ссылка;
		
		// Передать внешней обработке дополнительные параметры.
		Если ДополнительныеПараметры <> Неопределено Тогда
			
			// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение.
			Если НЕ Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
				Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент = Обработка.Печать();
		УдалитьФайлы(ИмяФайла);
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось сформировать внешнюю печатную форму!");
	КонецПопытки;
	
	Возврат ТабДокумент;
	
КонецФункции

// Процедура дополняет таблицу печатных форма (ТаблицаМакетов) объекта из справочника "Дополнительные печатные формы".
Процедура ДобавитьВДеревоМакетовДополнительныеФормы(ДеревоМакетов, СсылкаОбъекта, Действие)
	
	СтрокиДерева = ДеревоМакетов.Строки;
	Если ТипЗнч(СсылкаОбъекта) = Тип("ОбъектМетаданных") Тогда
		Возврат;
	КонецЕсли; 
	
	МетаданныеОбъекта = СсылкаОбъекта.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеОбработкиПринадлежность.Ссылка КАК Ссылка,
	|	ВнешниеОбработкиПринадлежность.ДополнительныеПараметрыОбработки КАК ДополнительныеПараметрыОбработки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВнешниеОбработкиПринадлежность.ПредставлениеКнопки, """") <> """"
	|			ТОГДА ВнешниеОбработкиПринадлежность.ПредставлениеКнопки
	|		ИНАЧЕ ВнешниеОбработкиПринадлежность.Ссылка.Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВнешниеОбработкиПринадлежность.Ссылка.ХранилищеВнешнейОбработки КАК СсылкаХранилищеВнешнейОбработки,
	|	ВнешниеОбработкиПринадлежность.НастройкиПостроителяДляОтбора КАК НастройкиПостроителяДляОтбора,
	|	ВнешниеОбработкиПринадлежность.ХранилищеВнешнейОбработки КАК ХранилищеВнешнейОбработки,
	|	ВнешниеОбработкиПринадлежность.ЗаменяемаяПечатнаяФорма КАК ЗаменяемаяПечатнаяФорма,
	|	ВнешниеОбработкиПринадлежность.НомерСтроки
	|ИЗ
	|	Справочник.ВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
	|ГДЕ
	|	(НЕ ВнешниеОбработкиПринадлежность.Ссылка.ПометкаУдаления)
	|	И ВнешниеОбработкиПринадлежность.СсылкаОбъекта = &Ссылка
	|	И ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки = &ВидОбработки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВнешниеОбработкиПринадлежность.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	ИмяТаблицыОбъекта = "";
	
	Запрос.УстановитьПараметр("ВидОбработки", Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма);
	
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("Ссылка", Документы[МетаданныеОбъекта.Имя].ПустаяСсылка());
		ИмяТаблицыОбъекта = "Документ." + МетаданныеОбъекта.Имя;
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("Ссылка", Справочники[МетаданныеОбъекта.Имя].ПустаяСсылка());
		ИмяТаблицыОбъекта = "Справочник." + МетаданныеОбъекта.Имя;
	Иначе
		Возврат;
	КонецЕсли;
	
	БылРазделитель = СтрокиДерева.Количество() = 0 ;
	ВыборкаСсылок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылок.Следующий() Цикл
		ПорядковыйНомер = 0;
		Выборка = ВыборкаСсылок.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяОбработка = Неопределено;
			ОбработкаСтроки = Выборка.ХранилищеВнешнейОбработки.Получить();
			Если ТипЗнч(ОбработкаСтроки) = Тип("ДвоичныеДанные") Тогда
				НоваяОбработка = ОбработкаСтроки;
			Иначе
				ОбработкаЭлемента = Выборка.СсылкаХранилищеВнешнейОбработки.Получить();
				Если ТипЗнч(ОбработкаЭлемента) = Тип("ДвоичныеДанные") Тогда
					НоваяОбработка = ОбработкаЭлемента;
				КонецЕсли; 
			КонецЕсли; 
			
			Если НоваяОбработка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураРасшифровки = Новый Структура("СсылкаНаВнешнююОбработку, НомерСтроки, ДополнительныеПараметрыОбработки", ВыборкаСсылок.Ссылка, Выборка.НомерСтроки, Выборка.ДополнительныеПараметрыОбработки.Получить());
			
			// Проверим, удовлетворяет ли подключаемый отчет указанным в нем условиям.
			НастройкиПостроителя = Выборка.НастройкиПостроителяДляОтбора.Получить();
			Если ТипЗнч(НастройкиПостроителя) = Тип("НастройкиПостроителяОтчета") Тогда
				ПостроительОтчета = ИнициализироватьПостроительДопПечатныхФорм(ИмяТаблицыОбъекта, МетаданныеОбъекта.Синоним);
				ПостроительОтчета.Параметры.Вставить("Ссылка", СсылкаОбъекта);
				ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя, Истина, Ложь, Ложь, Ложь, Ложь);
				ПостроительОтчета.Выполнить();
				Если ПостроительОтчета.Результат.Пустой() Тогда
					Продолжить;
				КонецЕсли;
				Подсказка = "Отбор";
			Иначе
				Подсказка = "";
			КонецЕсли;
			
			// Теперь проверим, надо ли заменять существующую печ.форму или нужно добавить новую.
			Если ЗначениеЗаполнено(Выборка.ЗаменяемаяПечатнаяФорма) Тогда
				
				Подсказка = "Печатная форма заменена подключаемой" + Подсказка;
				
				СтрокаДерева = СтрокиДерева.Найти(Выборка.ЗаменяемаяПечатнаяФорма, "Имя");
				
				Если СтрокаДерева = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаДерева.Расшифровка = СтруктураРасшифровки;
				СтрокаДерева.Подсказка = Подсказка;
				
				Продолжить;
				
			КонецЕсли; 
			
			// Только тут будем добавлять новую печ. форму в дополнение списка.
			Если Не БылРазделитель Тогда
				ДобавитьСтрокуВДеревоКнопок(ДеревоМакетов, Строка(Новый УникальныйИдентификатор), ТипКнопкиКоманднойПанели.Разделитель);
				БылРазделитель = Истина;
			КонецЕсли;
			
			Суффикс = ?(ПорядковыйНомер = 0 ,"" , "("+ПорядковыйНомер+")");
			ДобавитьСтрокуВДеревоКнопок(ДеревоМакетов, Строка(Новый УникальныйИдентификатор), ТипКнопкиКоманднойПанели.Действие, Выборка.Наименование + Суффикс, Действие ,СтруктураРасшифровки,);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет в дерево кнопок макетов встроенные печатные формы.
//
Процедура ДобавитьВДеревоМакетовВстроенныеФормы(ДеревоКнопок, ВнутренниеПечатныеФормы, Действие)
	
	Для каждого КлючИЗначение Из ВнутренниеПечатныеФормы Цикл
		Если КлючИЗначение.Значение = Неопределено Тогда
			
			ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, , ТипКнопкиКоманднойПанели.Разделитель);
			
		Иначе
			
			ДобавитьСтрокуВДеревоКнопок(ДеревоКнопок, КлючИЗначение.Ключ, ТипКнопкиКоманднойПанели.Действие, КлючИЗначение.Значение, Действие);
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция НапечататьДокументПоУмолчанию(Объект, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ЭтоДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	
	Попытка
		
		СтруктураВнутреннихПечатныхФорм = Объект.ПолучитьСтруктуруПечатныхФорм()
		
	Исключение
		
		СтруктураВнутреннихПечатныхФорм = Новый Структура;
		
	КонецПопытки;
	
	ДеревоМакетов = ПолучитьДеревоМакетовПечати(Объект.Ссылка, СтруктураВнутреннихПечатныхФорм);
	
	СтрокаПоУмолчанию = ПолучитьСтрокуДереваМакетовПоУмолчанию(Объект.Метаданные().Имя, ДеревоМакетов);
	
	Если СтрокаПоУмолчанию = Неопределено Тогда
		ТекстСообщения = НСтр("ru = '%1: Печать по умолчанию не определена!'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Объект));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли; 
	
	Если ТипЗнч(СтрокаПоУмолчанию.Расшифровка) = Тип("Структура") Тогда
		
		ТабДокумент = НапечататьВнешнююФорму(Объект.Ссылка, СтрокаПоУмолчанию.Расшифровка);
		
	Иначе
		
		Объект.Печать(СтрокаПоУмолчанию.Имя, КоличествоЭкземпляров, НаПринтер, НепосредственнаяПечать);
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ()

// Печатает документ полученный по нажатию кнопки в форме списка.
//
// Параметры:
//  Документ - документ,который нужно отпечатать.
//
Процедура НапечататьДокументИзФормыСписка(Ссылка) Экспорт
	
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // НапечататьДокументИзФормыСписка()

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСДополнительнымиКнопками

// Функция инициализирует дерево дополнительных кнопок.
//	Параметры:
//		Нет.
// Возвращаемое значение:
//		Тип: ДереваЗначений.
Функция ИнициализироватьДеревоДополнительныхКнопок() Экспорт
	
	ДеревоКнопок = Новый ДеревоЗначений;
	
	ДеревоКнопок.Колонки.Добавить("Имя");
	ДеревоКнопок.Колонки.Добавить("ТипКнопки");
	ДеревоКнопок.Колонки.Добавить("Текст");
	ДеревоКнопок.Колонки.Добавить("Подсказка");
	ДеревоКнопок.Колонки.Добавить("Картинка");
	ДеревоКнопок.Колонки.Добавить("Действие");
	ДеревоКнопок.Колонки.Добавить("Пометка");
	
	ДеревоКнопок.Колонки.Добавить("ИзменяетДанные");
	
	ДеревоКнопок.Колонки.Добавить("Расшифровка");
	
	Возврат ДеревоКнопок;
	
КонецФункции // ()

// Функция добавляет новую строку в дерево кнопок.
// Параметры:
//	< СтрокаПодменю > (обязательный).
//		Тип: Дерево или элемент дерева значений, в который необходимо добавить новое описание кнопки.
//	< Имя > (обязательный).
//		Тип: Строка. Имя создаваемой кнопки;
//	< ТипКнопки > (по умолчанию «Действие»).
//		Тип: ТипКнопкиКоманднойПанели. Тип создаваемой кнопки (Кнопка, разделитель, подменю);
//	< Текст > (по умолчанию пустая строка).
//		Тип: Строка. Текст кнопки.
//	< Текст > (по умолчанию пустая строка).
//		Тип: Строка. Текст кнопки.
//	< Действие > (по умолчанию «Не Определено»).
//		Тип: Действие. Действие кнопки (процедура должна быть описана в форме объекта, на который навешивается подменю).
//	< Расшифровка > (по умолчанию не определено).
//		Тип: Произвольный.
//	< Пометка > (по умолчанию «Ложь»).
//		Тип: Булево.
//	< Подсказка > (по умолчанию пустая строка).
//		Тип: Строка. Подсказка создаваемой кнопки.
//	< Картинка > (по умолчанию «Не Определено»).
//		Тип: Картинка. Картинка создаваемой кнопки.
// Возвращаемое значение:
//		Тип: СтрокаДереваЗначений.
Функция ДобавитьСтрокуВДеревоКнопок(СтрокаПодменю, Имя, Знач ТипКнопки = Неопределено ,Текст = "", Действие = Неопределено, Расшифровка = Неопределено, Пометка = Ложь, Подсказка = "", Картинка = Неопределено, ИзменяетДанные = Ложь)
	
	Если ТипКнопки = Неопределено Тогда
		
		ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
		
	КонецЕсли; 
	
	СтрокаКнопки             = СтрокаПодменю.Строки.Добавить();
	
	СтрокаКнопки.Имя         = Имя;
	СтрокаКнопки.ТипКнопки   = ТипКнопки;
	СтрокаКнопки.Текст       = Текст;
	СтрокаКнопки.Действие    = Действие;
	СтрокаКнопки.Картинка    = Картинка;
	СтрокаКнопки.Подсказка   = Подсказка;
	СтрокаКнопки.Пометка     = Пометка;
	
	СтрокаКнопки.ИзменяетДанные   = ИзменяетДанные;
	
	СтрокаКнопки.Расшифровка = Расшифровка;
	Возврат СтрокаКнопки;
	
КонецФункции

// Процедура формирует подменю по дереву значений.
// Параметры:
//	< СтрокаПодменю > (обязательный).
//		Тип: Дерево или элемент дерева значений, по данным которого необходимо построить подменю.
//	< Подменю> (обязательный).
//		Тип: Элемент командной панели «Кнопка» типа «Подменю». На которой необходимо сформировать новое подменю.
//	< Очищать> (по умолчанию «Ложь»).
//		Тип: булево. Определяет: следует ли очищать переданное подменю.
//	< ДобавлятьРазделительВНачало > (по умолчанию «Ложь»).
//		Тип: булево. Определяет: следует ли добавить в начало подменю разделитель.
Процедура СформироватьПодменю(СтрокаПодменю, Подменю, Очищать = Ложь, ДобавлятьРазделительВНачало = Ложь) Экспорт
	
	Строки = СтрокаПодменю.Строки;
	Кнопки = Подменю.Кнопки;
	
	Если Очищать Тогда
		Кнопки.Очистить();
		
	КонецЕсли; 
	
	Если ДобавлятьРазделительВНачало и Строки.Количество() > 0 Тогда
		Кнопки.Добавить(,ТипКнопкиКоманднойПанели.Разделитель);
		
	КонецЕсли; 
	
	Для каждого СтрокаКнопки Из Строки Цикл
		
		Кнопка = Кнопки.Добавить(СтрокаКнопки.Имя,СтрокаКнопки.ТипКнопки, СтрокаКнопки.Текст, СтрокаКнопки.Действие);
		
		Если СтрокаКнопки.Строки.Количество() > 0 Тогда
			
			СформироватьПодменю(СтрокаКнопки, Подменю, Ложь, Ложь)
			
		КонецЕсли; 
		
		Если Не СтрокаКнопки.Картинка = Неопределено Тогда
			
			Кнопка.Картинка  = СтрокаКнопки.Картинка;
			
		КонецЕсли; 
		
		Кнопка.Подсказка      = СтрокаКнопки.Подсказка;
		Кнопка.Пометка        = СтрокаКнопки.Пометка;
		
	КонецЦикла; 
	
КонецПроцедуры

// БИТ_ЖКХ_05082013_начало_изменений
Процедура  ОткрытьОтчетКопияФинансовоЛицевогоСчета() Экспорт
	ОтчетОбъект = Отчеты.бит_КопияФинансовоЛицевогоСчета.Создать();	
	ФормаОтчета = ОтчетОбъект.ПолучитьФорму("ФормаОтчета");		
	ФормаОтчета.Открыть();
	ОтчетОбъект.СформироватьОтчет(ФормаОтчета.ЭлементыФормы.ДокументРезультат);
КонецПроцедуры
// БИТ_ЖКХ_05082013_окончание_изменений	

#КонецОбласти

#КонецЕсли

#Область ПрочиеПроцедурыИФункции

Функция ОбъектПринадлежитКоллекцииМетаданных(ИмяКоллекции,ИмяОбъекта) Экспорт
	
	Если Метаданные[ИмяКоллекции].Найти(ИмяОбъекта) = Неопределено Тогда
		
		флПринадлежит = Ложь;
		
	Иначе
		
		флПринадлежит = Истина;
		
	КонецЕсли;
	
	Возврат флПринадлежит;
	
КонецФункции // ОбъектПринадлежитКоллекцииМетаданных()

// Служебная функция, предназначенная для получения описания типов числа, заданной разрядности.
// 
// Параметры:
//  Разрядность 			- число, разряд числа.
//  РазрядностьДробнойЧасти - число, разряд дробной части.
//  ЗнакЧисла				- ДопустимыйЗнак, знак числа.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для числа указанной разрядности.
//
Функция ПолучитьОписаниеТиповЧисла(Разрядность, РазрядностьДробнойЧасти = 0, ЗнакЧисла = Неопределено) Экспорт
	
	Если ЗнакЧисла = Неопределено Тогда
		КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность, РазрядностьДробнойЧасти);
	Иначе
		КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность, РазрядностьДробнойЧасти, ЗнакЧисла);
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов("Число", КвалификаторЧисла);
	
КонецФункции // ПолучитьОписаниеТиповЧисла()

// Служебная функция, предназначенная для получения описания типов строки, заданной длины.
// 
// Параметры:
//  ДлинаСтроки - число, длина строки.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для строки указанной длины.
//
Функция ПолучитьОписаниеТиповСтроки(ДлинаСтроки) Экспорт
	
	Массив = Новый Массив; 
	Массив.Добавить(Тип("Строка"));
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);
	
	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);
	
КонецФункции // ПолучитьОписаниеТиповСтроки()

// Служебная функция, предназначенная для получения описания типов даты.
// 
// Параметры:
//  ЧастиДаты - системное перечисление ЧастиДаты.
// 
Функция ПолучитьОписаниеТиповДаты(ЧастиДаты) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты);
	
	Возврат Новый ОписаниеТипов(Массив, , , КвалификаторДаты);
	
КонецФункции // ПолучитьОписаниеТиповДаты() 

// Формирует сообщение при ошибках проведения документов.
//
// Параметры: 
//  ТекстСообщения - Исходный текст, выводимого сообщения,.
//  Отказ          - Флаг отказа в проведении документа,.
//  Заголовок      - Заголовок начала серии сообщений об ошибках проведения (не обязательный).
//
Процедура ОшибкаПриПроведении(ТекстСообщения, Отказ, Заголовок="") Экспорт
	
	СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
	
КонецПроцедуры // ОшибкаПриПроведении()

// Функция формирует фамилию, имя и отчество одной строкой.
//
// Параметры:
//  Фамилия  - фамилия физ. лица.
//  Имя      - имя физ. лица.
//  Отчество - отчество физ. лица.
//  ФИОКратко    - Булево - если Истина (по умолчанию),. 
//  Представление физ.лица включает фамилию и инициалы,. 
//  Если Ложь - фамилию и полностью имя и отчество.
//
// Возвращаемое значение: 
//  Фамилия, имя, отчество одной строкой.
//
Функция ПолучитьФамилиюИмяОтчество(Фамилия = " ", Имя = " ", Отчество = " ", ФИОКратко = Истина) Экспорт
	
	Если ФИОКратко Тогда
		Возврат ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + 
		?(НЕ ПустаяСтрока(Отчество) , 
		Лев(Отчество,1)+".", ""), ""), "");
	Иначе
		Возврат ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Имя + 
		?(НЕ ПустаяСтрока(Отчество) , " " + Отчество, ""), ""), "");
	КонецЕсли;
	
КонецФункции // ПолучитьФамилиюИмяОтчество()

Функция ПолучитьРабочуюДату() Экспорт
	
	#Если Клиент Тогда
		Дата = РабочаяДата;
	#Иначе
		Дата = ТекущаяДата();
	#КонецЕсли
	
	Возврат Дата;
	
КонецФункции // ПолучитьРабочуюДату()

// Функция формирует представление заголовка документа.
//
// Возвращаемое значение:
//  Строка - представление номера документа.
//
Функция СформироватьЗаголовокДокумента(ДокументОбъект, НазваниеДокумента = "") Экспорт
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат "";
	Иначе
		
		Возврат ?(НЕ ЗначениеЗаполнено(НазваниеДокумента), ДокументОбъект.Метаданные().Синоним, НазваниеДокумента) + " № "
		+ " от " + Формат(ДокументОбъект.Дата, "ДФ='дд ММММ гггг'") + " г.";
		
	КонецЕсли;
	
КонецФункции // СформироватьЗаголовокДокумента()

Процедура ПередЗаписьюДокументаДляУдаленияДвиженийПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если  НЕ Источник.ЭтоНовый() 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И Источник.Проведен Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Док.Дата КАК Дата
		|ИЗ
		|	Документ.АвансовыйОтчет КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "Документ.АвансовыйОтчет", "Документ." + Источник.Метаданные().Имя);
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Источник.Дата > Выборка.Дата);
	Иначе
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет наличие в строке только цифр.
//
// Параметры:
//  СтрокаПроверки - Строка для проверки только цифр.
//
// Возвращаемое значение:
//   Булево.
//
Функция ТолькоЦифрыВСтроке(Знач СтрокаПроверки, УчитыватьЛидирующиеНули = Истина, УчитыватьПробелы = Истина) Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если НЕ УчитыватьПробелы Тогда
		СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
	КонецЕсли;
	
	Если НЕ УчитыватьЛидирующиеНули Тогда
		НомерПервойЦифры = 0;
		Для Значение = 1 По СтрДлина(СтрокаПроверки) Цикл
			НомерПервойЦифры = НомерПервойЦифры + 1;
			КодСимвола = КодСимвола(Сред(СтрокаПроверки, Значение, 1));
			Если КодСимвола <> 48 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки = Сред(СтрокаПроверки, НомерПервойЦифры);
	КонецЕсли;
	
	Для Значение = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Значение, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Истина;
	
КонецФункции

// Функция формирует фамилию и инициалы либо по наименованию элемента спр-ка ФизическиеЛица либо по переданным строкам.
//  Если передан Объект, то извлеченная из него строка считается совокупностью. 
//  Фамилия + Имя + Отчество, разделенными пробелами.
//
// Параметры:
//  Объект		- строка или ссылка или объект элемента спр-ка ФизическиеЛица.
//  Фамилия		- фамилия физ. лица.
//  Имя			- имя физ. лица.
//  Отчество	- отчество физ. лица.
//
// Возвращаемое значение: 
//  Фамилия и Инициалы одной строкой. Побочные эффекты - переданная целая строка. 
//  Побочные эффекты - переданная целая строка разбивается на подстроки, соответствующие.
//  Отдельным Фамилии,Имени и Отчеству.
//
Функция ФамилияИнициалыФизЛица(Объект = "", Фамилия = " ", Имя = " ", Отчество = " ") Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("Строка") Тогда
		ФИО = РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект)," ");
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") ИЛИ
		
		ТипОбъекта = Тип("СправочникСсылка.Сотрудники") или ТипОбъекта = Тип("СправочникОбъект.Сотрудники") Тогда
		
		ФИО = РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект.Наименование)," ");
		
	Иначе
		
		// Используем возможно переданные отдельные строки.
		Возврат ?(НЕ ПустаяСтрока(Фамилия), 
		Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
		"")
	КонецЕсли;
	
	КоличествоПодстрок = ФИО.Количество();
	Фамилия = ?(КоличествоПодстрок > 0,ФИО[0],"");
	Имя		= ?(КоличествоПодстрок > 1,ФИО[1],"");
	Отчество= ?(КоличествоПодстрок > 2,ФИО[2],"");
	
	Возврат ?(НЕ ПустаяСтрока(Фамилия), 
	Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
	"");
	
КонецФункции

// Функция применяется при необходимости получить сведения об учетной политике организации.
//
// Возвращаемое значение - таблица значений. Таблица, каждая строка которой соответствует записи регистра. 
//
Функция ЗаполнениеНастроекПрограммы() Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.бит_НастройкиПрограммы КАК УчетнаяПолитика";
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Сортировать("Период");
	
	Возврат ТаблицаРезультат;
	
КонецФункции // ЗаполнениеНастроекПрограммы();

// Получаем из полного номера версии конфигурации номер релиза без номера сборки.
//
// Параметры:
//  НомерВерсии  – Строка – полный номер версии.
//
// Возвращаемое значение:
//  Строка – номер релиза без номера сборки.
//
Функция ПолучитьНомерРелиза(НомерВерсии) Экспорт
	
	КоличествоТочек = 0;
	ДлинаОписанияНомераРелиза = 0;
	
	Для Значение = 1 По СтрДлина(НомерВерсии) Цикл
		
		Если Сред(НомерВерсии, Значение, 1) = "." Тогда
			КоличествоТочек = КоличествоТочек + 1;
		КонецЕсли;
		
		Если КоличествоТочек = 3 Тогда
			ДлинаОписанияНомераРелиза = Значение - 1;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Лев(НомерВерсии, ДлинаОписанияНомераРелиза);
	
КонецФункции // ПолучитьНомерРелиза()

// БИТ_ЖКХ 21.02.2014
Процедура ОбработкаПроверкиЗаполнения() Экспорт
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.EmailПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		EmailПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.EmailПроживающего"); 
		EmailПроживающегоОбъект = EmailПроживающегоСсылка.ПолучитьОбъект();
		EmailПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		EmailПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.АдресПодразделенияОрганизации.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресПодразделенияОрганизацииСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.АдресПодразделенияОрганизации"); 
		АдресПодразделенияОрганизацииОбъект = АдресПодразделенияОрганизацииСсылка.ПолучитьОбъект();
		АдресПодразделенияОрганизацииОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресПодразделенияОрганизацииОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.АдресПрибытия.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресПрибытияСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.АдресПрибытия"); 
		АдресПрибытияОбъект = АдресПрибытияСсылка.ПолучитьОбъект();
		АдресПрибытияОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресПрибытияОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.АдресПрибытияДрРегион.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресПрибытияДрРегионСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.АдресПрибытияДрРегион"); 
		АдресПрибытияДрРегионОбъект = АдресПрибытияДрРегионСсылка.ПолучитьОбъект();
		АдресПрибытияДрРегионОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресПрибытияДрРегионОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.АдресУбытия.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресУбытияСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.АдресУбытия"); 
		АдресУбытияОбъект = АдресУбытияСсылка.ПолучитьОбъект();
		АдресУбытияОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресУбытияОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ВебСтраницаОрганаФМС.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ВебСтраницаОрганаФМССсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ВебСтраницаОрганаФМС"); 
		ВебСтраницаОрганаФМСОбъект = ВебСтраницаОрганаФМССсылка.ПолучитьОбъект();
		ВебСтраницаОрганаФМСОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
		ВебСтраницаОрганаФМСОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ДругаяИнформацияПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ДругаяИнформацияПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ДругаяИнформацияПроживающего"); 
		ДругаяИнформацияПроживающегоОбъект = ДругаяИнформацияПроживающегоСсылка.ПолучитьОбъект();
		ДругаяИнформацияПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
		ДругаяИнформацияПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ИнострАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ИнострАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ИнострАдресПроживающего"); 
		ИнострАдресПроживающегоОбъект = ИнострАдресПроживающегоСсылка.ПолучитьОбъект();
		ИнострАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ИнострАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ИнформАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ИнформАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ИнформАдресПроживающего"); 
		ИнформАдресПроживающегоОбъект = ИнформАдресПроживающегоСсылка.ПолучитьОбъект();
		ИнформАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ИнформАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ПочтовыйАдресЗдания.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ПочтовыйАдресЗданияСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ПочтовыйАдресЗдания"); 
		ПочтовыйАдресЗданияОбъект = ПочтовыйАдресЗданияСсылка.ПолучитьОбъект();
		ПочтовыйАдресЗданияОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ПочтовыйАдресЗданияОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонОрганаФМС.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонОрганаФМССсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонОрганаФМС"); 
		ТелефонОрганаФМСОбъект = ТелефонОрганаФМССсылка.ПолучитьОбъект();
		ТелефонОрганаФМСОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонОрганаФМСОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонПодразделенияОрганизации.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонПодразделенияОрганизацииСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонПодразделенияОрганизации"); 
		ТелефонПодразделенияОрганизацииОбъект = ТелефонПодразделенияОрганизацииСсылка.ПолучитьОбъект();
		ТелефонПодразделенияОрганизацииОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонПодразделенияОрганизацииОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонПроживающего"); 
		ТелефонПроживающегоОбъект = ТелефонПроживающегоСсылка.ПолучитьОбъект();
		ТелефонПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонСлужебныйПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонСлужебныйПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ТелефонСлужебныйПроживающего"); 
		ТелефонСлужебныйПроживающегоОбъект = ТелефонСлужебныйПроживающегоСсылка.ПолучитьОбъект();
		ТелефонСлужебныйПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонСлужебныйПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ФактАдресОрганаФМС.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ФактАдресОрганаФМССсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ФактАдресОрганаФМС"); 
		ФактАдресОрганаФМСОбъект = ФактАдресОрганаФМССсылка.ПолучитьОбъект();
		ФактАдресОрганаФМСОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ФактАдресОрганаФМСОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ФактАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ФактАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ФактАдресПроживающего"); 
		ФактАдресПроживающегоОбъект = ФактАдресПроживающегоСсылка.ПолучитьОбъект();
		ФактАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ФактАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ЮрАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ЮрАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ЮрАдресПроживающего"); 
		ЮрАдресПроживающегоОбъект = ЮрАдресПроживающегоСсылка.ПолучитьОбъект();
		ЮрАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ЮрАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	// БИТ_ЖКХ 10.07.2014
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.ОткудаПрибылПредставление.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ОткудаПрибылПредставлениеСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.ОткудаПрибылПредставление"); 
		ОткудаПрибылПредставлениеОбъект = ОткудаПрибылПредставлениеСсылка.ПолучитьОбъект();
		ОткудаПрибылПредставлениеОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ОткудаПрибылПредставлениеОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.бит_ВидыКонтактнойИнформацииЖКХ.КудаВыписанПредставление.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		КудаВыписанПредставлениеСсылка = ПредопределенноеЗначение("Справочник.бит_ВидыКонтактнойИнформацииЖКХ.КудаВыписанПредставление"); 
		КудаВыписанПредставлениеОбъект = КудаВыписанПредставлениеСсылка.ПолучитьОбъект();
		КудаВыписанПредставлениеОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		КудаВыписанПредставлениеОбъект.Записать();
	КонецЕсли;
	// БИТ_ЖКХ 10.07.2014
	
	//15.11.2018
	Если Справочники.ВидыКонтактнойИнформации.EmailПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		EmailПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПроживающего"); 
		EmailПроживающегоОбъект = EmailПроживающегоСсылка.ПолучитьОбъект();
		EmailПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		EmailПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.АдресПодразделенияОрганизации.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресПодразделенияОрганизацииСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПодразделенияОрганизации"); 
		АдресПодразделенияОрганизацииОбъект = АдресПодразделенияОрганизацииСсылка.ПолучитьОбъект();
		АдресПодразделенияОрганизацииОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресПодразделенияОрганизацииОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.АдресПрибытия.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресПрибытияСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПрибытия"); 
		АдресПрибытияОбъект = АдресПрибытияСсылка.ПолучитьОбъект();
		АдресПрибытияОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресПрибытияОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.АдресПрибытияДрРегион.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресПрибытияДрРегионСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПрибытияДрРегион"); 
		АдресПрибытияДрРегионОбъект = АдресПрибытияДрРегионСсылка.ПолучитьОбъект();
		АдресПрибытияДрРегионОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресПрибытияДрРегионОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.АдресУбытия.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		АдресУбытияСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресУбытия"); 
		АдресУбытияОбъект = АдресУбытияСсылка.ПолучитьОбъект();
		АдресУбытияОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		АдресУбытияОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ВебСтраницаОрганаФМС.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ВебСтраницаОрганаФМССсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ВебСтраницаОрганаФМС"); 
		ВебСтраницаОрганаФМСОбъект = ВебСтраницаОрганаФМССсылка.ПолучитьОбъект();
		ВебСтраницаОрганаФМСОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
		ВебСтраницаОрганаФМСОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ДругаяИнформацияПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ДругаяИнформацияПроживающего"); 
		ДругаяИнформацияПроживающегоОбъект = ДругаяИнформацияПроживающегоСсылка.ПолучитьОбъект();
		ДругаяИнформацияПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
		ДругаяИнформацияПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ИнострАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ИнострАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ИнострАдресПроживающего"); 
		ИнострАдресПроживающегоОбъект = ИнострАдресПроживающегоСсылка.ПолучитьОбъект();
		ИнострАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ИнострАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ИнформАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ИнформАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ИнформАдресПроживающего"); 
		ИнформАдресПроживающегоОбъект = ИнформАдресПроживающегоСсылка.ПолучитьОбъект();
		ИнформАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ИнформАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ПочтовыйАдресЗданияСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания"); 
		ПочтовыйАдресЗданияОбъект = ПочтовыйАдресЗданияСсылка.ПолучитьОбъект();
		ПочтовыйАдресЗданияОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ПочтовыйАдресЗданияОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ТелефонОрганаФМС.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонОрганаФМССсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонОрганаФМС"); 
		ТелефонОрганаФМСОбъект = ТелефонОрганаФМССсылка.ПолучитьОбъект();
		ТелефонОрганаФМСОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонОрганаФМСОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ТелефонПодразделенияОрганизации.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонПодразделенияОрганизацииСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПодразделенияОрганизации"); 
		ТелефонПодразделенияОрганизацииОбъект = ТелефонПодразделенияОрганизацииСсылка.ПолучитьОбъект();
		ТелефонПодразделенияОрганизацииОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонПодразделенияОрганизацииОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ТелефонПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПроживающего"); 
		ТелефонПроживающегоОбъект = ТелефонПроживающегоСсылка.ПолучитьОбъект();
		ТелефонПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ТелефонСлужебныйПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего"); 
		ТелефонСлужебныйПроживающегоОбъект = ТелефонСлужебныйПроживающегоСсылка.ПолучитьОбъект();
		ТелефонСлужебныйПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТелефонСлужебныйПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ФактАдресОрганаФМС.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ФактАдресОрганаФМССсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресОрганаФМС"); 
		ФактАдресОрганаФМСОбъект = ФактАдресОрганаФМССсылка.ПолучитьОбъект();
		ФактАдресОрганаФМСОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ФактАдресОрганаФМСОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ФактАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ФактАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресПроживающего"); 
		ФактАдресПроживающегоОбъект = ФактАдресПроживающегоСсылка.ПолучитьОбъект();
		ФактАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ФактАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.ЮрАдресПроживающего.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ЮрАдресПроживающегоСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресПроживающего"); 
		ЮрАдресПроживающегоОбъект = ЮрАдресПроживающегоСсылка.ПолучитьОбъект();
		ЮрАдресПроживающегоОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ЮрАдресПроживающегоОбъект.Записать();
	КонецЕсли;
	
	// БИТ_ЖКХ 10.07.2014
	Если Справочники.ВидыКонтактнойИнформации.ОткудаПрибылПредставление.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		ОткудаПрибылПредставлениеСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ОткудаПрибылПредставление"); 
		ОткудаПрибылПредставлениеОбъект = ОткудаПрибылПредставлениеСсылка.ПолучитьОбъект();
		ОткудаПрибылПредставлениеОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ОткудаПрибылПредставлениеОбъект.Записать();
	КонецЕсли;
	
	Если Справочники.ВидыКонтактнойИнформации.КудаВыписанПредставление.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка") Тогда
		КудаВыписанПредставлениеСсылка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.КудаВыписанПредставление"); 
		КудаВыписанПредставлениеОбъект = КудаВыписанПредставлениеСсылка.ПолучитьОбъект();
		КудаВыписанПредставлениеОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		КудаВыписанПредставлениеОбъект.Записать();
	КонецЕсли;
	// БИТ_ЖКХ 10.07.2014
//---

	
КонецПроцедуры
// БИТ_ЖКХ 21.02.2014

// Функция получает текущего пользователя.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  ТекущийПользователь – СправочникСсылка.Пользователи.
//
Функция ПолучитьТекущегоПользователя() Экспорт
	
	ТекущийПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Возврат ТекущийПользователь;
	
КонецФункции // ПолучитьТекущегоПользователя()
// БИТ_ЖКХ 20.03.2014

Функция ПолучитьМенеджер(ИмяМенеджера,ИмяОбъекта = "")  Экспорт
	
	Менеджеры = Новый Соответствие;
	Менеджеры.Вставить("Справочники"            ,Справочники);
	Менеджеры.Вставить("Документы"              ,Документы);
	Менеджеры.Вставить("Перечисления"           ,Перечисления);	
	Менеджеры.Вставить("Обработки"              ,Обработки);
	Менеджеры.Вставить("Отчеты"                 ,Отчеты);
	Менеджеры.Вставить("РегистрыСведений"       ,РегистрыСведений);
	Менеджеры.Вставить("РегистрыНакопления"     ,РегистрыНакопления);
	Менеджеры.Вставить("РегистрыБухгалтерии"    ,РегистрыБухгалтерии);
	Менеджеры.Вставить("РегистрыРасчета"        ,РегистрыРасчета);
	Менеджеры.Вставить("ПланыСчетов"            ,ПланыСчетов);
	Менеджеры.Вставить("ПланыВидовХарактеристик",ПланыВидовХарактеристик);
	Менеджеры.Вставить("ПланыОбмена"            ,ПланыОбмена);
	Менеджеры.Вставить("ПланыВидовРасчета"      ,ПланыВидовРасчета);
	
	РезМенеджер = Менеджеры[ИмяМенеджера];
	
	Если НЕ ПустаяСтрока(ИмяОбъекта) Тогда
		
		Попытка
			
			РезМенеджер = РезМенеджер[ИмяОбъекта];
			
		Исключение
			
			РезМенеджер = Неопределено;
			
		КонецПопытки; 
		
	КонецЕсли; 
	
	Возврат РезМенеджер;
	
КонецФункции // ПолучитьМенеджер()

// БИТ_ЖКХ 30.07.2014
//
// Возвращаемое значение:
//  Имя – Строка.
//
Функция ИмяТабЧастиГруппыПользователей() Экспорт
	
	Имя = "Состав";
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Имя = "ПользователиГруппы";
		
	КонецЕсли; 
	
	Возврат Имя;
	
КонецФункции // ИмяТабЧастиГруппыПользователей()
// БИТ_ЖКХ 30.07.2014

// Функция получает имя типового справочника сохраненных настроек.
//
// Параметры:
//    
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьИмяСправочникаСохраненныхНастроек() Экспорт
	
	Если Метаданные.Справочники.Найти("СохраненныеНастройки") = Неопределено Тогда
		Результат = "УдалитьСохраненныеНастройки";
	Иначе
		Результат = "СохраненныеНастройки";	
	КонецЕсли; 	
	
	Возврат Результат;
	
КонецФункции // ПолучитьИмяСправочникаСохраненныхНастроек()
// БИТ_ЖКХ 10.10.2014

// БИТ_ЖКХ 25.11.2014{{
Функция ПолучитьПредставлениеМетаданные(Вид) Экспорт 
	
	Возврат Вид.Метаданные().Имя;	
	
КонецФункции
// БИТ_ЖКХ 25.11.2014}}

// Функция по массиву типов создает список выбора для быстрого выбора составного типа.
//
// Параметры:
//  МассивТипов  - Массив.
//
// Возвращаемое значение:
//   СписокВыбора  - СписокЗначений.
//
Функция ПодготовитьСписокВыбораТипа(МассивТипов) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого ТекТип Из МассивТипов Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТекТип);
		Если ОбъектМетаданных = Неопределено Тогда
			ТекПредставление = Строка(ТекТип);
		Иначе	
			ТекПредставление = ОбъектМетаданных.Синоним;
		КонецЕсли; 
		
		СписокВыбора.Добавить(ТекТип,ТекПредставление);
		
	КонецЦикла; 
	
	Возврат СписокВыбора;
	
КонецФункции // ПодготовитьСписокВыбораТипа()

// Функция возвращает таблицу значений, содержащую услуги и режимы потребления оказываемые по конкретному адресу.
//
// Параметры:
//	ДатаСреза - дата.
//	Улица - элемент справочника бит_СписокУлиц, либо Неопределено;.
//	Здание - элемент справочника бит_СписокЗданий, либо Неопределено;.
//
// Возвращаемое значение:
//	Таблица значений.
//
Функция ПолучитьШаблонУслугПоАдресу(ДатаСреза, Улица=Неопределено, Здание=Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Улица) 
		И ЗначениеЗаполнено(Здание) Тогда
		Улица = Здание.Улица;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ДатаСреза);
	Запрос.УстановитьПараметр("Улица", Улица);
	Запрос.УстановитьПараметр("Здание", Здание);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Улица,
	|	бит_ШаблоныУслугСрезПоследних.Здание,
	|	бит_ШаблоныУслугСрезПоследних.Услуга,
	|	бит_ШаблоныУслугСрезПоследних.Поставщик
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			&Период,
	|			Улица = &Улица
	|				И Здание = &Здание) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Шаблон = Результат.Выгрузить();
	
	Возврат Шаблон;
КонецФункции

// бит 31.01.2014
Функция ПустойОбработчик(ТекущийОбъект,РежимЗаписи,Заголовок="",РежимСообщений="Все") Экспорт
	
	Возврат Неопределено;
	
КонецФункции
// бит 31.01.2014

// бит 31.01.2014
Функция ПустойОбрабочик2(ИсходнаяСтрока,СтрокаДополнение,Разделитель="") Экспорт
	
	Возврат Неопределено;
	
КонецФункции
// бит 31.01.2014

// бит 31.01.2014
Функция ПустойОбработчик3(Организация, ДатаДокумента)Экспорт
	
	Возврат Неопределено;
	
КонецФункции
// бит 31.01.2014

Функция ПолучитьСтруктуруИзРезультатаЗапроса(РезультатЗапроса) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Для каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		СтруктураПараметров.Вставить(КолонкаРезультата.Имя, Выборка[КолонкаРезультата.Имя]);
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Функция формирует стркутуру значений содержащую данные об отвественных лицах организации.
//
// Параметры:
//  Организация    - СправочникСсылка - тек значение Организации.
//  ДатаДокумента  - Дата - Тек дата документа.
//
// Возвращаемое значение:
//   Структура   - Содержит данные  об отвественных лицах организации. 
// 
Функция бит_ОтветственныеЛица(Организация, ДатаДокумента)Экспорт 
	
	Результат = Новый Структура("Руководитель, РуководительДолжность, РуководительФИО, РуководительПредставление, 
	|ГлавныйБухгалтер, ГлавныйБухгалтерДолжность, ГлавныйБухгалтерФИО, ГлавныйБухгалтерПредставление,

	|Паспортист, ПаспортистДолжность, ПаспортистФИО, ПаспортистПредставление,
	|РуководительРасчетнойСлужбы, РуководительРасчетнойСлужбыДолжность, РуководительРасчетнойСлужбыФИО, РуководительРасчетнойСлужбыПредставление,
	|Специалист, СпециалистДолжность, СпециалистФИО, СпециалистПредставление");
	
	// Замена типовых объектов на объекты БИТ в тексте модуля.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&ДатаСреза, ФизЛицо ССЫЛКА Справочник.бит_Проживающие) КАК ФИОФизЛицСрезПоследних
	|		ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
	Запрос.УстановитьПараметр("ДатаСреза"   ,ДатаДокумента);
	Запрос.УстановитьПараметр("Организация" ,Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ФИО = Новый Структура("Фамилия, Имя, Отчество, Представление");
		Если НЕ (НЕ ЗначениеЗаполнено(Выборка.Фамилия) или Выборка.Фамилия = NULL) Тогда
			ФИО.Фамилия = Выборка.Фамилия;
		КонецЕсли;
		Если НЕ (НЕ ЗначениеЗаполнено(Выборка.Имя) или Выборка.Имя = NULL) Тогда
			ФИО.Имя = Выборка.Имя;
		КонецЕсли;
		Если НЕ (НЕ ЗначениеЗаполнено( Выборка.Отчество) или Выборка.Отчество = NULL) Тогда
			ФИО.Отчество =  Выборка.Отчество;
		КонецЕсли;
		Представление = ПолучитьФамилиюИмяОтчество(ФИО.Фамилия, ФИО.Имя, ФИО.Отчество);
		
		Если  Выборка.ОтветственноеЛицо      = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда
			Результат.Руководитель               = Выборка.ФизическоеЛицо;
			Результат.РуководительДолжность      = Выборка.Должность;
			Результат.РуководительФИО            = ФИО;
			Результат.РуководительПредставление  = Представление;
			
		ИначеЕсли Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда
			Результат.ГлавныйБухгалтер           = Выборка.ФизическоеЛицо;
			Результат.ГлавныйБухгалтерДолжность  = Выборка.Должность;
			Результат.ГлавныйБухгалтерФИО        = ФИО;
			Результат.ГлавныйБухгалтерПредставление  = Представление;
			
		ИначеЕсли  Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.бит_Паспортист Тогда
			Результат.Паспортист              = Выборка.ФизическоеЛицо;
			Результат.ПаспортистДолжность     = Выборка.Должность;
			Результат.ПаспортистФИО           = ФИО;
			Результат.ПаспортистПредставление = Представление;
			
			// БИТ_ЖКХ_05082013_начало_изменений
		ИначеЕсли  Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.бит_РуководительРасчетнойСлужбы Тогда
			Результат.РуководительРасчетнойСлужбы              = Выборка.ФизическоеЛицо;
			Результат.РуководительРасчетнойСлужбыДолжность     = Выборка.Должность;
			Результат.РуководительРасчетнойСлужбыФИО           = ФИО;
			Результат.РуководительРасчетнойСлужбыПредставление = Представление;
			
		ИначеЕсли  Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.бит_Специалист Тогда
			Результат.Специалист              = Выборка.ФизическоеЛицо;
			Результат.СпециалистДолжность     = Выборка.Должность;
			Результат.СпециалистФИО           = ФИО;
			Результат.СпециалистПредставление = Представление;	
			// БИТ_ЖКХ_05082013_окончание_изменений
			
		КонецЕсли;
		
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Функция возвращает дату Закрытия. 
//
//
// Возвращаемое значение:
//   Дата   - Дата Закрытия.
//
Функция ПолучитьДатуЗакрытия(ТекДата, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"        , КонецДня(ТекДата));
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|			ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|	КОНЕЦ КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Дата = НачалоДня(Результат.Получить(Результат.Количество()-1).Дата);
		
	Иначе
		
		Текст = "Для организации: """+Организация+""" не заполнена дата последнего платежа ЖКХ.
		| Дата установлена на конец месяца:"+ КонецМесяца(ТекДата) +" !!";
		СообщитьОбОшибке(Текст,,,СтатусСообщения.ОченьВажное);
		
		Дата = КонецМесяца(ТекДата);
		
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции // ()

// БИТ_ЖКХ 09.02.2011 19:01:26
// Формирует штрих код извещения.
функция СформируемШтрихКод(Сумма, НаименованиеЛС, НаименованиеШаблона, ИД, НомерПолучателяПоБанку, ИспользоватьНомерПолучателя = Ложь) Экспорт
	
	МногоНулей = "000000000000000000000000000000"; // Здесь их тридцать, будет мало - добавьте сами.
	// Под число отведено 11+2 символа.	
	СтрокаСумма = Строка( Формат(Окр(Сумма*100,0),"ЧДЦ=0") );
	СтрокаСумма = МногоНулей + УбитьЛишнее(СтрокаСумма);
	СтрокаСумма = Прав(СтрокаСумма, 13);
	
	СтрокаНаименованиеЛС = Прав(МногоНулей + Строка(СокрЛП(НаименованиеЛС)), 12);
	СтрокаНаименованиеШаблона = Прав(МногоНулей + Строка(СокрЛП(НаименованиеШаблона)), 9);
	
	// БИТ_ЖКХ добавление кода Начало: 16.03.2011 
	СтрокаИД = Прав(МногоНулей + Формат(ИД, "ЧГ=0"),6);
	// БИТ_ЖКХ добавление кода конец : 16.03.2011
	
	СтрокаСумма = СтрокаНаименованиеЛС + СтрокаНаименованиеШаблона + СтрокаИД + СтрокаСумма;
	
	КонтрольнаяСумма = 0;
	
	Попытка
		ПроверкаШК = Число(СтрокаСумма);
	Исключение
		Возврат "000000000000000000000000000000";
	КонецПопытки;
	
	Для Значение = 1 по СтрДлина(СтрокаСумма)-1 Цикл
		КонтрольнаяСумма = КонтрольнаяСумма +  Число(Лев(СтрокаСумма,Значение))*33;
	КонецЦикла;
	
	КонтрольнаяСумма = КонтрольнаяСумма%1000;
	
	НПБ = "";
	
	Если ИспользоватьНомерПолучателя Тогда
		НПБ = Прав(МногоНулей + Формат(НомерПолучателяПоБанку, "ЧГ=0"), 5);
	КонецЕсли; 
	
	// БИТ_ЖКХ 08.04.2015{{
	Если СтрДлина(КонтрольнаяСумма) = 2 Тогда
		
		СтрокаСумма = НПБ + СтрокаСумма + "0" + Строка(КонтрольнаяСумма);
		
	ИначеЕсли СтрДлина(КонтрольнаяСумма) = 1 Тогда
		
		СтрокаСумма = НПБ + СтрокаСумма + + "00" +Строка(КонтрольнаяСумма);
		
	Иначе	
		
		СтрокаСумма = НПБ + СтрокаСумма + Строка(КонтрольнаяСумма);
		
	КонецЕсли;
	// БИТ_ЖКХ 08.04.2015}}
	
	Возврат СтрокаСумма;
	
КонецФункции

// Функция упаковывает дерево значений для передачи через клиент.
//
// Параметры:
//  ДеревоЗнч - Дерево значений.
//  
// Возвращаемое значение:
//   ХранилищеЗначений.
//
Функция УпаковатьДеревоЗначений(ДеревоЗнч) Экспорт

	УпакованноеДерево = Новый ХранилищеЗначения(ДеревоЗнч);

	Возврат УпакованноеДерево;
	
КонецФункции // УпаковатьДеревоЗначений()

// Функция распаковывает дерево значений после передачи через клиент.
//
// Параметры:
//  УпакованнаяТаблица - Хранилище значений.
//  
// Возвращаемое значение:
//   Дерево значений.
//
Функция РаспаковатьДеревоЗначений(УпакованноеДерево) Экспорт

	ДеревоЗнч = УпакованноеДерево.Получить();
	
	Возврат ДеревоЗнч;
	
КонецФункции // РаспаковатьДеревоЗначений()

// Функция определяет режимы вывода сообщений.
//
// Параметры:
//  РежимСообщений  - Строка - "Нет","Все","Ошибки".
//
// Возвращаемое значение:
//   РежимыВывода   - Структура.
//
Функция ОпределитьРежимыВывода(РежимСообщений) Экспорт

	РежимыВывода       = Новый Структура("ВыводитьОшибки,ВыводитьИнформацию");
	
	РежимыВывода.ВыводитьОшибки     = ?(ВРег(РежимСообщений)=ВРег("Все") ИЛИ ВРег(РежимСообщений)=ВРег("Ошибки"),Истина,Ложь);
	РежимыВывода.ВыводитьИнформацию = ?(ВРег(РежимСообщений)=ВРег("Все"),Истина,Ложь);

	Возврат РежимыВывода;
	
КонецФункции // ОпределитьРежимВывода()

// Функция возвращает строковое представление описания типов.
//
// Параметры:
//  ТекОписание - ОписаниеТипов.
//
// Возвращаемое значение:
//  СтрТип – Строка.
//
Функция СтроковоеПредставлениеОписанияТипов(ТекОписание, СимволРазделитель = "/") Экспорт

	МассивТипов = ТекОписание.Типы();
	
	СтрТип = "";
	
	МассивТипов = ТекОписание.Типы();
	
	СтрТип = "";
	
	Если МассивТипов.Количество() = 0 Тогда
		
		СтрТип = СтрТип+"Строка";
		
	Иначе	
		
		Для каждого ТекТип Из МассивТипов Цикл
			
			Если бит_ОбщегоНазначения.ЭтоПримитивныйТип(ТекТип) Тогда
				
				Если ТекТип = Тип("Строка") Тогда
					
					Если ТекОписание.КвалификаторыСтроки.Длина = 0 Тогда
						
						СтрИмяТипа = "Строка";
						
					Иначе	
						
					   СтрИмяТипа = "Строка("+Формат(ТекОписание.КвалификаторыСтроки.Длина,"ЧРГ=")+")";
					   
					КонецЕсли; 
					
				ИначеЕсли ТекТип = Тип("Число") Тогда
					
					Если ТекОписание.КвалификаторыЧисла.Разрядность = 0 Тогда
						
						СтрИмяТипа = "Число";
						
					Иначе	
						
						СтрИмяТипа = "Число("
						              +Формат(ТекОписание.КвалификаторыЧисла.Разрядность,"ЧРГ=")
									  +","
									  +Формат(ТекОписание.КвалификаторыЧисла.РазрядностьДробнойЧасти,"ЧРГ=")
									  +")";
					КонецЕсли; 
					
				ИначеЕсли ТекТип = Тип("Дата") Тогда	
					
					Если ТекОписание.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
						СтрИмяТипа = "Дата(Время)";
					ИначеЕсли ТекОписание.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
						СтрИмяТипа = "Дата(Дата)";
					Иначе	
						СтрИмяТипа = "Дата";
					КонецЕсли; 
					
				ИначеЕсли ТекТип = Тип("Булево") Тогда	
					
					СтрИмяТипа = "Булево";
					
				ИначеЕсли ТекТип = Тип("Неопределено") Тогда	
					
					СтрИмяТипа = "Неопределено";
					
				ИначеЕсли ТекТип = Тип("ХранилищеЗначения") Тогда	
					
					СтрИмяТипа = "ХранилищеЗначения";
					
				ИначеЕсли ТекТип = Тип("Null") Тогда	
					
					СтрИмяТипа = "Null";
					
				КонецЕсли; 
				
				СтрТип = СтрТип+?(ПустаяСтрока(СтрТип),"","/")+СтрИмяТипа;				
				
			Иначе
				
				МетаОбъект = Метаданные.НайтиПоТипу(ТекТип);
				
				Если НЕ МетаОбъект = Неопределено Тогда
					
					ИмяПолное = МетаОбъект.ПолноеИмя();
					СтрИмена  = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПолное);
					СтрИмяТипа = СтрИмена.ИмяКласса+"Ссылка."+СтрИмена.ИмяОбъекта;
					СтрТип = СтрТип+?(ПустаяСтрока(СтрТип),"","/")+СтрИмяТипа;
					
				КонецЕсли; 
				
			КонецЕсли;	  
			
		КонецЦикла; //МассивТипов
		
	КонецЕсли; 
	
	Если ПустаяСтрока(СтрТип) Тогда
		
		СтрТип = "Строка";
		
	КонецЕсли; 

	Возврат СтрТип;
	
КонецФункции // СтроковоеПредставлениеОписанияТипов()

Функция ПолучитьРабочуюДатуУПЖКХ() Экспорт
	
	Возврат ОбщегоНазначения.ТекущаяДатаПользователя();
	
КонецФункции

Процедура РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, СуммаВключаетНДС = Ложь, ПрименяютсяСтавки4и2 = Ложь) Экспорт

	Если ТипЗнч(СтрокаТабличнойЧасти)=Тип("Структура") Тогда
		Если СтрокаТабличнойЧасти.Свойство("Сумма") И СтрокаТабличнойЧасти.Свойство("СтавкаНДС") Тогда
			СтрокаТабличнойЧасти.СуммаНДС = РассчитатьСуммуНДС(
												СтрокаТабличнойЧасти.Сумма - ?(СтрокаТабличнойЧасти.Свойство("СуммаСкидки"), СтрокаТабличнойЧасти.СуммаСкидки, 0),
												СуммаВключаетНДС,
												ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС, ПрименяютсяСтавки4и2));
		КонецЕсли;
	Иначе // Строка табличной части
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СуммаНДС = РассчитатьСуммуНДС(
												СтрокаТабличнойЧасти.Сумма,
												СуммаВключаетНДС,
												ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС, ПрименяютсяСтавки4и2));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма            - Число - сумма от которой надо рассчитывать налоги;
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму ("внутри" или "сверху");
//  СтавкаНДС        - Число - процентная ставка НДС.
//
// Возвращаемое значение:
//  Число - полученная сумма НДС.
//
Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС) Экспорт

	Если СуммаВключаетНДС Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;

	Если НЕ СуммаВключаетНДС Тогда
		СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
	КонецЕсли;
	
	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()

// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт

	Если СтавкаНДС = Перечисления.ВидыСтавокНДС.Общая Тогда
		Возврат 20;
	ИначеЕсли СтавкаНДС = Перечисления.ВидыСтавокНДС.Пониженная Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 2, 10);
		Возврат Ставка;
	ИначеЕсли СтавкаНДС = Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 4, 18);
		Возврат Ставка;
	//shevtsov 22/01/25 Начало
	ИначеЕсли СтавкаНДС = Перечисления.ВидыСтавокНДС.Повышенная Тогда
		Возврат 22;
	//shevtsov 22/01/25 Окончание
	КонецЕсли;

	Возврат 0;

КонецФункции

//14.01.2019 59
// Функция возвращает курс ставку НДС
//
// Параметры:
//  Перечисления.ВидыСтавокНДС
//
// Возвращаемое значение:
//	Перечисления.СтавкиНДС
//

Функция ПолучитьСтавкуНДСИзВидаСтавки(ВидСтавкиНДС, Период = неопределено) Экспорт

	если Период = неопределено тогда		
	  Период = ТекущаяДата();	
	конецесли;	
	
	Если ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая Тогда
		Если Период < '20260101' Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;
		//++ 1бит Феденков	
		Иначе
		Возврат Перечисления.СтавкиНДС.НДС22;
	    КонецЕсли;
	    //-- 1бит
	ИначеЕсли ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Пониженная Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная Тогда
		Возврат Перечисления.СтавкиНДС.НДС10_110;
	//19.09.2019	
	ИначеЕсли ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная Тогда
		Если Период < '20190101' Тогда
		  Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118");
		ИначеЕсли Период < '20260101'  Тогда
		  Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120");
		//++1бит феденков	
		Иначе 
		  Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122");
		//--1бит	
		КонецЕсли;
	ИначеЕсли ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС Тогда		
		Возврат Перечисления.СтавкиНДС.БезНДС;
	//shevtsov 22/01/25 Начало
	ИначеЕсли ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Повышенная Тогда		
		Возврат Перечисления.СтавкиНДС.НДС22;
	ИначеЕсли ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ПовышеннаяРасчетная Тогда		
		Возврат Перечисления.СтавкиНДС.НДС22_122;
	//shevtsov 22/01/25 Окончание
	КонецЕсли;                                       	
	
	Возврат 0;

КонецФункции


//13.08.2019
Процедура ЗаполнитьСписокУлицПоСпискуЗданий() Экспорт
	
  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ
                 |	бит_СписокУлиц.Ссылка КАК Ссылка
                 |ИЗ
                 |	Справочник.бит_СписокУлиц КАК бит_СписокУлиц
                 |ГДЕ
                 |	бит_СписокУлиц.Предопределенный = &Предопределенный
				 |	И бит_СписокУлиц.РайонГород = &РайонГород";
  
  запрос.УстановитьПараметр("Предопределенный", ложь); 
  запрос.УстановитьПараметр("РайонГород", справочники.бит_АдминистративныеОкруга.ПустаяСсылка());

  табУлиц = запрос.Выполнить().Выгрузить();
  
  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ
                 |	бит_СписокЗданий.Ссылка КАК Ссылка,
                 |	бит_СписокЗданий.Улица КАК Улица
                 |ИЗ
                 |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий";
  
  табЗданий = запрос.Выполнить().Выгрузить();

  для каждого стр из табУлиц цикл
	  
	 ПостроительЗапросаЗданий = Новый ПостроительЗапроса;
     ПостроительЗапросаЗданий.ИсточникДанных = Новый ОписаниеИсточникаДанных(табЗданий);
     т_Отбор = ПостроительЗапросаЗданий.Отбор.Добавить("Улица");
     т_Отбор.ВидСравнения = ВидСравнения.Равно;
     т_Отбор.Значение = стр.Ссылка;
     т_Отбор.Использование = Истина;
     ПостроительЗапросаЗданий.Выполнить();
     ТабРезультат = ПостроительЗапросаЗданий.Результат.Выгрузить();
	 
	 если ТабРезультат.Количество() > 0 тогда
		 
	  попытка	 
		объектУлицы = стр.Ссылка.ПолучитьОбъект();
		объектУлицы.РайонГород = ТабРезультат[0].Ссылка.Район;
		объектУлицы.Записать();
	   исключение	 		
	    ТекстОшибки = НСтр("ru = 'Не удалось заполнить %1 в справочнике бит_СписокУлиц'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, стр.Ссылка);		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( ТекстОшибки, ,,,);	  
	  конецпопытки;
	  
	 конецесли;	 
		 
  конеццикла;

КонецПроцедуры	

//25.10.2019
Функция УбратьНулиИзПоляТаблицы (таблица, ИмяПоля) Экспорт	
	
 если таблица.Количество() = 0 или ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(таблица[0], ИмяПоля) = ложь тогда
  возврат таблица;	
 конецесли;	 
	 
 для каждого стр из таблица цикл			 
			 			 
	   если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр, ИмяПоля) = истина и стр[ИмяПоля] = 0 тогда
		 стр[ИмяПоля] = "";
	   конецесли; 	 
			 
 конеццикла;	 
 
 возврат таблица;	
Конецфункции	

#КонецОбласти
