Функция Т1()
	ТекстЗ = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &Ответственный
		|				ТОГДА бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Наименование
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Ответственный,
		|	СУММА(ВЫБОР
		|			КОГДА бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ИСТИНА
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Собственники,
		|	СУММА(ВЫБОР
		|			КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = &НеПроживает
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Проживающие
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|			&КонецЯнваря,
		|			ДатаРегистрации <= &КонецЯнваря
		|				И (ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДатаСнятияСРегистрации >= &КонецЯнваря)) КАК бит_ПроживающиеПоЛССрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет"
КонецФункции	