
#Область ПроцедурыИФункцииОбщегоНазначения

// Добавляет строку в таблицу "Получатели письма" и заполняет ее согласно переданным параметрам.
//
// Параметры:
//  Адрес        - Строка - адрес электронной почты,
//  Наименование - Строка - Представление адресата,
//  Контакт      - СправочникСсылка - контакт получатель.
//
&НаКлиенте
Процедура ДобавитьПолучателя(Адрес, Наименование, Контакт,СписокАдресов = "")
	
	НоваяСтрока = ПолучателиПисьма.Добавить();
	НоваяСтрока.Адрес         = Адрес;
	НоваяСтрока.Представление = Наименование;
	НоваяСтрока.Контакт       = Контакт;
	НоваяСтрока.СписокАдресов = СписокАдресов;
	НоваяСтрока.Группа        = ГруппаПоУмолчанию;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период      = Параметры.Период;
	ЛицевойСчет = Параметры.ЛицевойСчет;
	
	ОбновитьСписокПроживающих();
	
	ГруппаПоУмолчанию = "Кому";
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ПолучателиПисьма Цикл
		Группа = ?(ПустаяСтрока(СтрокаТаблицы.Группа), "Кому", СтрокаТаблицы.Группа);
		Контакт = Новый Структура("Адрес, Представление, Контакт, Группа",
		СтрокаТаблицы.Адрес, СтрокаТаблицы.Представление, СтрокаТаблицы.Контакт, Группа);
		Результат.Добавить(Контакт);
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокПроживающих();
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ТекущиеДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЭлементаУправляемая", Новый Структура("Ключ", ТекущиеДанные.Проживающий), ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСписокПроживающих

&НаКлиенте
Процедура СписокПроживающихВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТкущиеДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	Результат = ПолучитьНаименованиеИАдресаЭлектроннойПочтыКонтакта(ТкущиеДанные.Проживающий);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Адрес = Результат.Адреса[0];
	//СписокАдресов = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Результат.Адреса, ";");
	МассивАдресов = Результат.Адреса.ВыгрузитьЗначения();
	СписокАдресов = СтрСоединить(МассивАдресов, ";");
	
	ДобавитьПолучателя(Адрес, Результат.Наименование, ВыбраннаяСтрока, СписокАдресов);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПроживающих()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , Период);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК Проживающий,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	СписокПроживающих.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Получает наименование и адреса электронной почты контакта.
//
// Параметры:
//  Контакт - Ссылка - контакт, для которого получаются данные.
//
// Возвращаемое значение:
//  Структура - содержит наименование контакта и список значений электронной почты контакта.
//
&НаСервере
Функция ПолучитьНаименованиеИАдресаЭлектроннойПочтыКонтакта(Контакт) Экспорт
	
	Если Не ЗначениеЗаполнено(Контакт) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка,
	|	бит_ПроживающиеКонтактнаяИнформация.Тип,
	|	бит_ПроживающиеКонтактнаяИнформация.Вид,
	|	бит_ПроживающиеКонтактнаяИнформация.Представление,
	|	бит_ПроживающиеКонтактнаяИнформация.АдресЭП
	|ИЗ
	|	Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
	|ГДЕ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка = &Контакт
	|	И бит_ПроживающиеКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И бит_ПроживающиеКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПроживающего)";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контакт", Контакт);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Адреса = Новый Структура("Наименование,Адреса", Выборка.Представление, Новый СписокЗначений);
	Адреса.Адреса.Добавить(Выборка.АдресЭП);
	
	Возврат Адреса;
	
КонецФункции

#КонецОбласти