
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФизЛицоПриОткрытии                         = Запись.ФизЛицо;
	ПериодПриОткрытии   					   = Запись.Период;
	НеИмеетПравоНаПенсиюПриОткрытии		       = Запись.НеИмеетПравоНаПенсию;
	НеЯвляетсяНалоговымРезидентомРФПриОткрытии = Запись.НеЯвляетсяНалоговымРезидентомРФ;
	СтранаПриОткрытии 						   = Запись.Страна;
	        
	Заголовок = Заголовок + " " + Запись.ФизЛицо;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период.
	Если Запись.ФизЛицо.Пустая() Тогда
	    Запись.ФизЛицо = ФизЛицоПриОткрытии;
		Запись.Период  = ПериодПриОткрытии;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Гражданство"), Запись.ФизЛицо);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> Запись.Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если НеИмеетПравоНаПенсиюПриОткрытии <> Запись.НеИмеетПравоНаПенсию ИЛИ
			НеЯвляетсяНалоговымРезидентомРФПриОткрытии <> Запись.НеЯвляетсяНалоговымРезидентомРФ ИЛИ
			СтранаПриОткрытии <> Запись.Страна Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_ГражданствоПроживающих.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период   = Запись.ПериодПриОткрытии;
			МенеджерЗаписи.ФизЛицо  = Запись.ФизЛицо;
			МенеджерЗаписи.НеИмеетПравоНаПенсию  		   = НеИмеетПравоНаПенсиюПриОткрытии;
			МенеджерЗаписи.НеЯвляетсяНалоговымРезидентомРФ = НеЯвляетсяНалоговымРезидентомРФПриОткрытии;
			МенеджерЗаписи.Страна						   = СтранаПриОткрытии;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	ФормаРегистра = ОткрытьФорму("РегистрСведений.бит_ГражданствоПроживающих.Форма.ФормаСпискаУправляемая");
	ФормаРегистра.Список.Отбор.ФизЛицо.Значение = Запись.ФизЛицо;
	ФормаРегистра.Список.Отбор.ФизЛицо.ВидСравнения = ВидСравнения.Равно;
	ФормаРегистра.Список.Отбор.ФизЛицо.Использование = Истина;
	ФормаРегистра.Элементы.Список.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;
	
КонецПроцедуры

#КонецОбласти