
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПаспортныеДанныеФизЛицСрезПоследних.Период,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументПричинаЗамены
		|ИЗ
		|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.Ключ.ФизЛицо);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;

	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаПроживающие") Тогда
		
	НаборЗаписей.Очистить();
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПаспортныеДанныеФизЛицСрезПоследних.Период,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументПричинаЗамены
		|ИЗ
		|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ЗаписьИзНабора = НаборЗаписей.Добавить();
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("ФизЛицо") Тогда
				
				ЗаписьИзНабора.ФизЛицо = Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо;
				
			КонецЕсли;
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("Период") Тогда
				
				ЗаписьИзНабора.Период = Параметры.ЗаполнитьИзСправочникаПроживающие.Период;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьИзНабора = НаборЗаписей[0];
	
	ДокументВид                         = ЗаписьИзНабора.ДокументВид;
	ДокументДатаВыдачи                  = ЗаписьИзНабора.ДокументДатаВыдачи;
	ДокументКемВыдан                    = ЗаписьИзНабора.ДокументКемВыдан;
	ДокументКодПодразделения            = ЗаписьИзНабора.ДокументКодПодразделения;
	ДокументНомер                       = ЗаписьИзНабора.ДокументНомер;
	ДокументСерия                       = ЗаписьИзНабора.ДокументСерия;
	ДатаРегистрацииПоМестуЖительства    = ЗаписьИзНабора.ДатаРегистрацииПоМестуЖительства;
	Период                              = ?(НЕ ЗначениеЗаполнено(ЗаписьИзНабора.Период), '19000101', ЗаписьИзНабора.Период);
	ФизЛицо                             = ЗаписьИзНабора.Физлицо; 
	ДокументПричинаЗамены               = ЗаписьИзНабора.ДокументПричинаЗамены;
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		
		Элементы.История.Видимость = Ложь;

	КонецЕсли;
	
	ДокументВидПриОткрытии = ДокументВид;
	ДокументСерияПриОткрытии = ДокументСерия;
	ДокументДатаВыдачиПриОткрытии = ДокументДатаВыдачи;
	ДокументКемВыданПриОткрытии = ДокументКемВыдан;
	ДокументКодПодразделенияПриОткрытии = ДокументКодПодразделения;
	ДокументНомерПриОткрытии = ДокументНомер;
	ДокументПричинаЗаменыПриОткрытии = ДокументПричинаЗамены;
	ДокументСерияПриОткрытии = ДокументСерия;
	ПериодПриОткрытии = Период;
	ФизЛицоПриОткрытии = ФизЛицо;
	
	//+bit_semenov.v_19.11.2021
	бит_ДоработатьФорму();
	бит_ЗаполнитьДокументКемВыдан();
	//-bit_semenov.v_19.11.2021
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы И Модифицированность Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ОтветНаВопрос = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ОтветНаВопрос = РезультатВопроса;
    
    Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
        
        ЗаписатьИзменения();
        
        Оповестить("ОбновитьУдостоверениеЛичности");
        
        ЭтаФорма.Закрыть();
        
    ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
        
        // Отказ = Истина;.
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьИзменения();
	
	Оповестить("ОбновитьУдостоверениеЛичности");
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор          = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", ФизЛицо);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.бит_ПаспортныеДанныеПроживающих.Форма.ФормаСпискаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура записывыает измнения.
//
&НаСервере
Процедура ЗаписатьИзменения()
	
	Набор = РегистрыСведений.бит_ПаспортныеДанныеПроживающих.СоздатьНаборЗаписей();
	Набор.Отбор.ФизЛицо.Установить(ФизЛицо);
	Набор.Прочитать();
	
	// Если что-то поменяли тогда запишем. 
	Если ДокументВидПриОткрытии <> ДокументВид ИЛИ
		ДокументДатаВыдачиПриОткрытии <> ДокументДатаВыдачи ИЛИ
		ДокументКемВыданПриОткрытии <> ДокументКемВыдан ИЛИ
		ДокументКодПодразделенияПриОткрытии <> ДокументКодПодразделения ИЛИ
		ДокументНомерПриОткрытии <> ДокументНомер ИЛИ
		ДатаРегистрацииПоМестуЖительства <> ДатаРегистрацииПоМестуЖительстваПриОткрытии ИЛИ
		ПериодПриОткрытии <> Период ИЛИ
		ДокументСерияПриОткрытии <> ДокументСерия ИЛИ
		ДокументПричинаЗаменыПриОткрытии <> ДокументПричинаЗамены  Тогда
 
    Если Набор.Количество() = 0 Тогда
        НовыйНабор = Набор.Добавить();
        НовыйНабор.Период = ТекущаяДата();
	ИначеЕсли Набор.Количество() > 0 и Период <> ПериодПриОткрытии Тогда
        НовыйНабор = Набор.Добавить();
		
        НовыйНабор.Период = Период;
	Иначе 
		
		Для каждого Строка из Набор Цикл
			
			Если Строка.Период = Период Тогда
				
				НовыйНабор = Строка;
				
			КонецЕсли;
			
		КонецЦикла;
		
    КонецЕсли;
 
		НовыйНабор.ДокументВид                      = ДокументВид;
		НовыйНабор.ДокументДатаВыдачи               = ДокументДатаВыдачи;
		НовыйНабор.ДокументКемВыдан                 = ДокументКемВыдан;
		НовыйНабор.ДокументКодПодразделения         = ДокументКодПодразделения;
		НовыйНабор.ДокументНомер                    = ДокументНомер;
		НовыйНабор.ДокументСерия                    = ДокументСерия;
		НовыйНабор.ДатаРегистрацииПоМестуЖительства = ДатаРегистрацииПоМестуЖительства;
		НовыйНабор.Период                           = Период; 
		НовыйНабор.ДокументПричинаЗамены            = ДокументПричинаЗамены;
		НовыйНабор.ФизЛицо                          = ФизЛицо;
		Набор.Записать();
		
	КонецЕсли;
	
	Модифицированность = Ложь;

КонецПроцедуры

//+bit_semenov.v_19.11.2021
&НаСервере
Процедура бит_ДоработатьФорму()
	
	Элементы.ДокументКемВыдан.Видимость = Ложь;
	//Элементы.ДокументКемВыдан.Доступность = Ложь;
	
	элКемВыдан = Элементы.Вставить("бит_КемВыдан", Тип("ПолеФормы"), ,Элементы.ДокументДатаВыдачи);
	элКемВыдан.Вид = ВидПоляФормы.ПолеВвода;
	элКемВыдан.ПутьКДанным = "бит_КемВыдан";
	элКемВыдан.Заголовок = "Кем выдан";
	элКемВыдан.УстановитьДействие("ПриИзменении", "бит_КемВыданПриИзменении");
	
КонецПроцедуры

&НаСервере
Процедура бит_ЗаполнитьДокументКемВыдан()

	бит_КемВыдан = Справочники.бит_ОрганыФМС.НайтиПоНаименованию(ДокументКемВыдан, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_КемВыданПриИзменении(Элемент)
	
	бит_КемВыданПриИзмененииСервер();

КонецПроцедуры 

Процедура бит_КемВыданПриИзмененииСервер()

	ДокументКемВыдан =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бит_КемВыдан, "Наименование");

КонецПроцедуры 

//-bit_semenov.v_19.11.2021

#КонецОбласти