
// МОДУЛЬ РАБОТЫ С ВНЕШНЕЙ БИБЛИОТЕКОЙ ПРОЦЕДУР

//	Модуль содержит процедуры и функции, являющиеся интерфейсом.
//  К внешней библиотеке, реализующей возможности отсутствующие в 1С.

#Область СлужебныеПроцедурыИФункцииРаботыСБиблиотекой

// Регистрирует внешнюю библиотеку для текущего пользователя системы.
// 
// Параметры: 
// 	ИмяБиблиотеки      	 -	Строка				   	 Имя объекта-библиотеки.
// 	УИД             	 -	Строка				   	 GUID для регистрации объекта в формате xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx.
// 	ПутьКФайлуБиблиотеки -	Строка				   	 Расположение файла библиотеки.
// Возвращаемое значение:
// 	Возврат ...        	 -	Булево                 	 Истина - библиотека успешно зарегистрирована;.
//													 Ложь - в противном случае.
//
Функция бит_ЗарегистрироватьВнешнююБиблиотеку(ИмяБиблиотеки, УИД, ПутьКФайлуБиблиотеки) Экспорт
	#Если Клиент Тогда
		ВремРегистратор = ПолучитьИмяВременногоФайла("exe");
		ВремДанныеРегистратора = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.бит_РегистраторВнешнихБиблиотек.Имя);
		ВремДанныеРегистратора.Записать(ВремРегистратор);
		Попытка
			ЗапуститьПриложение(ВремРегистратор + " """ + ИмяБиблиотеки + """ ""{" + УИД + "}"" """ + ПутьКФайлуБиблиотеки + """", , Истина);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	#Иначе
		Возврат Ложь;
	#КонецЕсли
КонецФункции // бит_ЗарегистрироватьВнешнююБиблиотеку()

// Получает объект внешней библиотеки.
// 
// Параметры: 
// 	ИмяБиблиотеки      	 -	Строка				   	 Имя объекта-библиотеки.
// 	УИД             	 -	Строка				   	 GUID для регистрации объекта в формате xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx.
// 	ПутьКФайлуБиблиотеки -	Строка				   	 Расположение файла библиотеки.
// Возвращаемое значение:
// 	Возврат ...        	 -	COMОбъект, Неопределено	 Загруженный объект библиотеки процедур;.
//													 Неопределено - не удалось загрузить объект.
//
Функция бит_ПолучитьБиблиотеку(ИмяБиблиотеки, УИД = "", ПутьКФайлуБиблиотеки = "") Экспорт
	ВремБиблиотека = Неопределено;
	Попытка
		ВремБиблиотека = Новый COMОбъект(ИмяБиблиотеки);
	Исключение
	КонецПопытки;
	
	Если ВремБиблиотека = Неопределено Тогда
		Если бит_Утилиты.бит_ЗарегистрироватьВнешнююБиблиотеку(ИмяБиблиотеки, УИД, ПутьКФайлуБиблиотеки) Тогда
			Попытка
				ВремБиблиотека = Новый COMОбъект(ИмяБиблиотеки);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат ВремБиблиотека;
КонецФункции // бит_ПолучитьБиблиотеку()

// Получает объект внешней библиотеки утилит БИТ (BITUtils.dll), хранимой в макете конфигурации.
// 
// Возвращаемое значение:
// 	Возврат ...        	 -	COMОбъект, Неопределено	 Загруженный объект библиотеки процедур;.
//													 Неопределено - не удалось загрузить объект.
//
Функция бит_ПолучитьБиблиотекуУтилит() Экспорт
	ВремФайл = Новый Файл(КаталогВременныхФайлов() + "\BIT\BITUtils.dll");
	Если НЕ ВремФайл.Существует() Тогда
		СоздатьКаталог(КаталогВременныхФайлов() + "\BIT");
		ВремФайлБиблиотеки = КаталогВременныхФайлов() + "\BIT\BITUtils.dll";	
		ВремДанныеБиблиотеки = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.бит_Утилиты.Имя);
		ВремДанныеБиблиотеки.Записать(ВремФайлБиблиотеки);
	КонецЕсли;
	Возврат бит_Утилиты.бит_ПолучитьБиблиотеку("BitUtils.Bit", "D6D3457D-A49A-41B9-938A-53BE4CAA3A87", ВремФайлБиблиотеки);
КонецФункции // бит_ПолучитьБиблиотекуУтилит()

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииРаботыСБуферомОбмена

// Проверяет наличие изображения в буфере обмена Windows.
// 
// Возвращаемое значение:
// 	Возврат ...        	 -	Булево                 	 Истина - в буфере обмена содержится изображение;.
//													 Ложь - в противном случае.
//
Функция ЕстьКартинкаВБуфереОбмена() Экспорт
	Библиотека = бит_ПолучитьБиблиотекуУтилит();
	Если Библиотека = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	КартинкаСтрокой = Библиотека.GetClipBrdImage();
	Если КартинкаСтрокой = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции // ЕстьКартинкаВБуфереОбмена()

// Помещает переданную картинку в буфер обмена Windows.
// 
// Параметры: 
// 	ПарамКартинка      	 -	Картинка,				 Данные картинки.
//							ДвоичныеДанные.
// Возвращаемое значение:
// 	Возврат ...        	 -	Булево                 	 Истина - картинка помещена в буфере обмена;.
//													 Ложь - в противном случае.
//
Функция ПоместитьКартинкуВБуферОбмена(ПарамКартинка) Экспорт
	Библиотека = бит_ПолучитьБиблиотекуУтилит();
	Если Библиотека = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(ПарамКартинка) = Тип("Картинка") Тогда
		ВремКартинка = ПарамКартинка;
	ИначеЕсли ТипЗнч(ПарамКартинка) = Тип("ДвоичныеДанные") Тогда
		ВремКартинка = Новый Картинка(ПарамКартинка);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Попытка
		ВремКартинка = ВремКартинка.Преобразовать(ФорматКартинки.BMP);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	КартинкаСтрокой = СтрЗаменить(Base64Строка(ВремКартинка.ПолучитьДвоичныеДанные()), Символы.ВК + Символы.ПС, "");
	Попытка
		Возврат Библиотека.SetClipBrdImage(КартинкаСтрокой);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
КонецФункции //ПоместитьКартинкуВБуферОбмена()

// Получает изображение из буфера обмена Windows.
// 
// Возвращаемое значение:
// 	Возврат ...        	 -	Картинка               	 Полученное изображение;.
//													 Неопределено - не удалось получить изображение.
//
Функция ПолучитьКартинкуИзБуфераОбмена() Экспорт
	Библиотека = бит_ПолучитьБиблиотекуУтилит();
	Если Библиотека = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВремКартинка = Неопределено;
	Попытка
		КартинкаСтрокой = Библиотека.GetClipBrdImage();
		ВремКартинка = Новый Картинка(Base64Значение(КартинкаСтрокой));
	Исключение
		ВремКартинка = Неопределено;
	КонецПопытки;
	Возврат ВремКартинка;
КонецФункции // ПолучитьКартинкуИзБуфераОбмена()

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииПолученияХэшаЗначений

// Получает хэш по алгоритму MD5 для переданной строки.
// 
// Параметры: 
// 	ПарамСтрока      	 -	Строка				   	 Строка, для которой требуется хэш.
// Возвращаемое значение:
// 	Возврат ...        	 -	Строка, Неопределено   	 Хэш строки;.
//													 Неопределено - ошибка получения хэша.
//
Функция ПолучитьХэшСтроки(ПарамСтрока) Экспорт
	Библиотека = бит_ПолучитьБиблиотекуУтилит();
	Если Библиотека = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВремХэш = Неопределено;
	Попытка
		ВремХэш = Библиотека.GetStringHash(ПарамСтрока);
	Исключение
	КонецПопытки;
	Возврат ВремХэш;
КонецФункции // ПолучитьХэшСтроки().

// Получает хэш по алгоритму MD5 для указанного файла или каталога.
// 
// Параметры: 
// 	ПутьКФайлу      	 -	Строка				   	 Путь к файлу/каталогу, для которого требуется получить хэш.
// Возвращаемое значение:
// 	Возврат ...        	 -	Строка, Неопределено   	 Хэш файла/каталога;.
//													 Неопределено - ошибка получения хэша.
//
Функция ПолучитьХэшФайла(ПутьКФайлу) Экспорт
	Библиотека = бит_ПолучитьБиблиотекуУтилит();
	Если Библиотека = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВремХэш = Неопределено;
	Попытка
		ВремХэш = Библиотека.GetFileHash(ПутьКФайлу);
	Исключение
	КонецПопытки;
	Возврат ВремХэш;
	
КонецФункции // ПолучитьХэшФайла()

//1.11.2018
Функция ПолучитьСвернутуюТаблицуДляОтчета (таблицаОтчета, списокПолейСвертки, списокПолейСуммирования, списокЗначенийСвертки) Экспорт
	
  попытка
		
   массивЗначенийСвертки = списокЗначенийСвертки.Значение.ВыгрузитьЗначения(); 
   массивПолейСвертки = списокПолейСвертки.Значение.ВыгрузитьЗначения();   
	
   Отбор = Новый Структура;
   Отбор.Вставить(массивПолейСвертки[0], массивЗначенийСвертки[0]);
             
   счетчикСтрок = 0;
   строкаСвертки = "";
   для каждого стр из массивПолейСвертки цикл
	 строкаСвертки = строкаСвертки + стр; 
	 
	 счетчикСтрок =  счетчикСтрок + 1;
	 если счетчикСтрок < массивПолейСвертки.Количество() тогда 
      строкаСвертки = строкаСвертки + ", "; 
	 конецесли; 
   конеццикла;	   
   
   массивЗначений = списокПолейСуммирования.Значение.ВыгрузитьЗначения();   
       
   счетчикСтрок = 0;
   строкаСуммирования = "";
   для каждого стр из массивЗначений цикл
	 строкаСуммирования = строкаСуммирования + стр; 
	 
	 счетчикСтрок =  счетчикСтрок + 1;
	 если счетчикСтрок < массивЗначений.Количество() тогда 
      строкаСуммирования = строкаСуммирования + ", "; 
	 конецесли; 
   конеццикла;	   
   
   таблицаСтрок = таблицаОтчета.Скопировать(Отбор);
   таблицаСтрок.Свернуть(строкаСвертки, строкаСуммирования);
   
   табВозврата = таблицаОтчета.СкопироватьКолонки();
     
   значениеСверткиЗаполнено = ложь;
   массивСчетовСвертки = новый массив;
   
   для каждого строкаТаблицыОтчета из таблицаОтчета цикл	 
	   
	  если строкаТаблицыОтчета[массивПолейСвертки[0]] = массивЗначенийСвертки[0] тогда
		 если массивСчетовСвертки.Найти(строкаТаблицыОтчета.ЛицевойСчет) = неопределено тогда   
		  строкаТаблицыВозврата = табВозврата.Добавить();
		  ЗаполнитьЗначенияСвойств(строкаТаблицыВозврата, строкаТаблицыОтчета); 
		  
		  Отбор = Новый Структура;
          Отбор.Вставить(массивПолейСвертки[1], строкаТаблицыОтчета[массивПолейСвертки[1]]);
          строкаТаблицы = таблицаСтрок.НайтиСтроки(Отбор);
		  
		  ЗаполнитьЗначенияСвойств(строкаТаблицыВозврата, строкаТаблицы[0]); 
		  массивСчетовСвертки.Добавить(строкаТаблицыОтчета.ЛицевойСчет);
		 конецесли; 
	  иначе	  
	   строкаТаблицыВозврата = табВозврата.Добавить();
	   ЗаполнитьЗначенияСвойств(строкаТаблицыВозврата, строкаТаблицыОтчета); 
	  конецесли; 
	   
   конеццикла;	      
 
   возврат табВозврата; 	
   
  исключение 
   
   	ТекстСообщения = НСтр("ru = 'Не удалось свернуть таблицу") + Символы.ПС + ОписаниеОшибки();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

   возврат таблицаОтчета; 
  конецпопытки
	
КонецФункции	
//---

//25.12.2019
// Возвращает тип хранения файлов.
// 
// Возвращаемое значение:
//  Булево. Истина, если указано хранить файлы в томах на диске.
//
Функция ХранениеФайловВТомахНаДиске() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранитьФайлыВТомахНаДиске = Константы.ХранитьФайлыВТомахНаДиске.Получить();
	
	Возврат ХранитьФайлыВТомахНаДиске;
	
КонецФункции


#КонецОбласти