
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаНастройкиОсновныеНастройки.Видимость = НЕ мСкрытьПанельНастроек;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала    = Отчет.НачалоПериода;
	Период.ДатаОкончания = Отчет.КонецПериода;
	
	ДиалогРедактированияПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактированияПериода.Период = Период;
	
	ДиалогРедактированияПериода.Показать(Новый ОписаниеОповещения("НастроитьПериодЗавершение", ЭтотОбъект, Новый Структура("ДиалогРедактированияПериода", ДиалогРедактированияПериода))); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериодЗавершение(Период1, ДополнительныеПараметры) Экспорт
    
    ДиалогРедактированияПериода = ДополнительныеПараметры.ДиалогРедактированияПериода;
    
    Если ЗначениеЗаполнено(Период1) Тогда
        
        Отчет.НачалоПериода = ДиалогРедактированияПериода.Период.ДатаНачала;
        Отчет.КонецПериода  = ДиалогРедактированияПериода.Период.ДатаОкончания;
        
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	мСкрытьПанельНастроек = НЕ мСкрытьПанельНастроек;
	Элементы.ГруппаНастройкиОсновныеНастройки.Видимость = НЕ мСкрытьПанельНастроек;
	
КонецПроцедуры

#КонецОбласти