
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЭлАдресОмск = Элементы.Добавить("лб_СоцЗащитаАдрес", Тип("ПолеФормы"), ЭтаФорма);    
	//ЭлАдресОмск.Вид=ВидПоляФормы.ПолеВвода;
	//ЭлАдресОмск.Заголовок="Соц.защита адрес (Омск)";  
	//ЭлАдресОмск.ПутьКДанным="Объект.лб_СоцЗащитаАдрес";  
	//
	//ЭлТелефонОмск = Элементы.Добавить("лб_СоцЗащитаТелефоны", Тип("ПолеФормы"), ЭтаФорма);    
	//ЭлТелефонОмск.Вид=ВидПоляФормы.ПолеВвода;
	//ЭлТелефонОмск.Заголовок="Соц.защита телефоны (Омск)";  
	//ЭлТелефонОмск.ПутьКДанным="Объект.лб_СоцЗащитаТелефоны";  
	
КонецПроцедуры
