#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПередЗаписью". 
//
Процедура ПередЗаписью(Отказ)
	
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// БИТ_ЖКХ 14.09.2016 17:00:31 Начало правки... 
	Если ДополнительныеСвойства.Свойство("Администрирование") Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 14.09.2016 17:00:33 Конец правки. 
	
	Если Не ЭтоНовый() тогда
		Если  Наименование <> Ссылка.Наименование
			ИЛИ Сальдо <> Ссылка.Сальдо 
			ИЛИ Кредит <> Ссылка.Кредит
			ИЛИ ПолучательПлатежа <> Ссылка.ПолучательПлатежа
			Тогда
			МассивДокументов = КритерииОтбора.бит_бу_ДокументыПоШаблонуИзвещений.Найти(Ссылка);
			ЕстьПроведенныеДокументы = Ложь;
			
			Для каждого Документ из МассивДокументов Цикл
				
				ЕстьПроведенныеДокументы = Документ.Проведен;
				
				Если ЕстьПроведенныеДокументы тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьПроведенныеДокументы Тогда

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют документы, проведенные по шаблону извещений """ + Ссылка.Наименование + """.
				|Реквизиты ""Сальдо"", ""Кредит"", ""Получатель платежа"" не могут быть изменены.
				|Элемент не записан.");
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли