
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	ЗначениеВРеквизитФормы(Параметры.РасшифровкаРазовых, "ТаблицаРасшифровки");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ТаблицаРасшифровкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.Имя = "ДоляОтГруппового" Тогда
		
		АдресТаблицыРасшифровкиВХранилище = ПоместитьТаблицуРасшифровкиВХранилище();
	
	    ПараметрыФормы = Новый Структура("АдресТаблицыРасшифровкиВХранилище", АдресТаблицыРасшифровкиВХранилище);
		
		ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаРасшифровкиКоличестваЕдиницУправляемая", ПараметрыФормы, Элемент);
				
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПоместитьТаблицуРасшифровкиВХранилище()
	
	ТаблицаРасшифровкиИзРеквизитаФормы = РеквизитФормыВЗначение("ТаблицаРасшифровки");
	
	АдресЛСВХранилище = ПоместитьВоВременноеХранилище(ТаблицаРасшифровкиИзРеквизитаФормы, УникальныйИдентификатор);
	
	Возврат АдресЛСВХранилище;
	
КонецФункции

#КонецОбласти