
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		Отбор = Список.Отбор.Элементы;
		
		УсловиеОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ответственный");
		УсловиеОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		
		// БИТ_ЖКХ 22.06.2015{{
		Попытка
			УсловиеОтбора.ПравоеЗначение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		Исключение
			УсловиеОтбора.ПравоеЗначение = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		КонецПопытки;
		// БИТ_ЖКХ 22.06.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
