
#Область РасчетыБиллинговахУслуг

Процедура РаспределитьОплатуБиллинговыхУслуг(Дата, Организация, ЛицевыеСчета, БиллинговыеУслуги) Экспорт

	БиллинговыеУслуги.Очистить();
	
	БиллинговыеУслуги.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	БиллинговыеУслуги.Колонки.Добавить("СальдоНаНачало"            , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	БиллинговыеУслуги.Колонки.Добавить("Сальдо"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	БиллинговыеУслуги.Колонки.Добавить("Оплата"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	БиллинговыеУслуги.Колонки.Добавить("Разовые"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	БиллинговыеУслуги.Колонки.Добавить("Долг"                      , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	СписокЛС     = Новый Массив;
	СписокЗданий = НОвый Массив;
	
	Для каждого Строка Из ЛицевыеСчета Цикл
	
		СписокЛС.Добавить(Строка.ЛицевойСчет);
		СписокЗданий.Добавить(Строка.ЛицевойСчет.Здание);
	
	КонецЦикла; 
	
	ЛицевыеСчета.Свернуть("ЛицевойСчет, ШаблонИзвещений","Сумма");
	
	ТаблицаНачислений = СформироватьТаблицуНачислений();
	
	РасчитатьНачисления(Дата, Организация, СписокЛС, СписокЗданий, ТаблицаНачислений);
	
	ТаблицаДляРасчета = БиллинговыеУслуги.СкопироватьКолонки();
	
	Для каждого СтрокаШаблона Из ЛицевыеСчета Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаШаблона.ЛицевойСчет);
		
		ТаблицаДляРасчета.Очистить();
		
		МассивСтрок = ТаблицаНачислений.НайтиСтроки(Отбор);
		Для каждого Строка Из МассивСтрок Цикл
			
			Если СтрокаШаблона.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам ИЛИ СтрокаШаблона.ШаблонИзвещений.Услуги.Найти(Строка.Услуга, "Услуга") <> Неопределено Тогда
				
				НоваяСтрока = ТаблицаДляРасчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.ШаблонИзвещений = СтрокаШаблона.ШаблонИзвещений;
				
			КонецЕсли;
			
		КонецЦикла;
		
		РаспределитьСуммуДокумента(ТаблицаДляРасчета,СтрокаШаблона.ШаблонИзвещений,СтрокаШаблона.Сумма);
		ТаблицаДляРасчета.Сортировать("Приоритет Возр");
		
		Для каждого Строка Из ТаблицаДляРасчета Цикл
			
			НоваяСтрока = БиллинговыеУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла; 
		
	КонецЦикла;

КонецПроцедуры

Процедура РасчитатьНачисления(Дата, Организация, СписокЛицевыхСчетов, СписокЗданий, ТаблицаНачислений = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("Момент"             , КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация"        , Организация);
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов", СписокЛицевыхСчетов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.ЛицевойСчет,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.РежимПотребления,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.КоличествоЕдиницПотребления,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ СведенияОБиллинговыхУслугах
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(
	|			&Момент,
	|			Организация = &Организация
	|				И ЛицевойСчет В (&СписокЛицевыхСчетов)) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|ГДЕ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_бу_НачисленияБиллинговыхУслугОстатки.ЛицевойСчет,
	|	бит_бу_НачисленияБиллинговыхУслугОстатки.Услуга,
	|	СУММА(бит_бу_НачисленияБиллинговыхУслугОстатки.СуммаОстаток) КАК Сальдо
	|ПОМЕСТИТЬ СальдоНаТекущийМомнет
	|ИЗ
	|	РегистрНакопления.бит_бу_НачисленияБиллинговыхУслуг.Остатки(
	|			&Момент,
	|			Организация = &Организация
	|				И ЛицевойСчет В (&СписокЛицевыхСчетов)) КАК бит_бу_НачисленияБиллинговыхУслугОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_НачисленияБиллинговыхУслугОстатки.ЛицевойСчет,
	|	бит_бу_НачисленияБиллинговыхУслугОстатки.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_бу_НачисленияБиллинговыхУслугОбороты.ЛицевойСчет,
	|	бит_бу_НачисленияБиллинговыхУслугОбороты.Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.Регистратор ССЫЛКА Документ.бит_бу_ОплатаБиллинговыхУслуг
	|				ТОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.Регистратор ССЫЛКА Документ.бит_бу_РазовыеПоБиллинговымУслугам
	|				ТОГДА бит_бу_НачисленияБиллинговыхУслугОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_бу_НачисленияБиллинговыхУслуг.Обороты(
	|			НАЧАЛОПЕРИОДА(&Момент, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Момент, МЕСЯЦ),
	|			Регистратор,
	|			Организация = &Организация
	|				И ЛицевойСчет В (&СписокЛицевыхСчетов)) КАК бит_бу_НачисленияБиллинговыхУслугОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_НачисленияБиллинговыхУслугОбороты.ЛицевойСчет,
	|	бит_бу_НачисленияБиллинговыхУслугОбороты.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОБиллинговыхУслугах.ЛицевойСчет,
	|	СведенияОБиллинговыхУслугах.Услуга,
	|	СведенияОБиллинговыхУслугах.РежимПотребления,
	|	СведенияОБиллинговыхУслугах.Поставщик,
	|	СведенияОБиллинговыхУслугах.КоличествоЕдиницПотребления,
	|	СальдоНаТекущийМомнет.Сальдо,
	|	Обороты.Оплата,
	|	Обороты.Разовые,
	|	СведенияОБиллинговыхУслугах.Приоритет
	|ИЗ
	|	СведенияОБиллинговыхУслугах КАК СведенияОБиллинговыхУслугах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО СведенияОБиллинговыхУслугах.ЛицевойСчет = Обороты.ЛицевойСчет
	|			И СведенияОБиллинговыхУслугах.Услуга = Обороты.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ СальдоНаТекущийМомнет КАК СальдоНаТекущийМомнет
	|		ПО СведенияОБиллинговыхУслугах.ЛицевойСчет = СальдоНаТекущийМомнет.ЛицевойСчет
	|			И СведенияОБиллинговыхУслугах.Услуга = СальдоНаТекущийМомнет.Услуга";

	Результат = Запрос.Выполнить();
	
	Если НЕ ТаблицаНачислений = Неопределено Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			НоваяСтрока = ТаблицаНачислений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		КонецЦикла; 
		
	КонецЕсли; 
	
	МВТ.Закрыть();
	
КонецПроцедуры

Процедура РаспределитьСуммуДокумента(БиллинговыеУслуги, ШаблонИзвещения, СуммаДокумента) Экспорт 
	
	Если ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам Или (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) тогда
		
		СуммаДляРаспределения = СуммаДокумента;
		ИтогСальдо = 0;
		
		Для каждого ТекСтрока Из БиллинговыеУслуги Цикл
			
			ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
			
		КонецЦикла; 
		
		ИтогНачисления = БиллинговыеУслуги.Итог("Начислено");
		
		Для Каждого ТекСтрока Из БиллинговыеУслуги Цикл 
			
			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
			ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
			СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
			
		КонецЦикла;
		
		СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
		
		// БИТ_ЖКХ 09.11.2011
		// Временная замена рапределению по текущим начислениям.
		Для каждого ТекСтрока Из БиллинговыеУслуги Цикл
		
			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДляРаспределения;
		    ТекСтрока.Сумма = ТекСтрока.Сумма + СуммаСписания;
			
		КонецЦикла; 
		
	ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Да  И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) тогда
		
		СуммаДляРаспределения = СуммаДокумента; 
		
		ИтогСальдо = 0;
		Для каждого ТекСтрока Из БиллинговыеУслуги Цикл
			
			ИтогСальдо = ИтогСальдо + ?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0);
			
		КонецЦикла; 
		
		ИтогНачисления = БиллинговыеУслуги.Итог("Начислено");
		
		Для Каждого ТекСтрока Из БиллинговыеУслуги Цикл 
			
			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДокумента;
			ТекСтрока.Сумма = ТекСтрока.Сумма + Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0));
			СуммаДляРаспределения = СуммаДляРаспределения - Мин(СуммаСписания,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)); 
			
		КонецЦикла;
		
		СуммаДляРаспределения = Окр(СуммаДляРаспределения,2);
		
		// БИТ_ЖКХ 09.11.2011
		// Временная замена рапределению по текущим начислениям.
		Для каждого ТекСтрока Из БиллинговыеУслуги Цикл
			
			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДляРаспределения;
			ТекСтрока.Сумма = ТекСтрока.Сумма + СуммаСписания;
			
		КонецЦикла; 

	ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Да) тогда
		
		СуммаДляРаспределения = СуммаДокумента; 
		ИтогСальдо     = БиллинговыеУслуги.Итог("Сальдо");
		ИтогНачисления = 0;
		
		// БИТ_ЖКХ 09.11.2011
		// Временная замена рапределению по текущим начислениям.
		Для каждого ТекСтрока Из БиллинговыеУслуги Цикл
			
			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДляРаспределения;
			ТекСтрока.Сумма = ТекСтрока.Сумма + СуммаСписания;
			
		КонецЦикла; 
		
	ИначеЕсли (ШаблонИзвещения.Сальдо = Перечисления.ДаНет.Нет И ШаблонИзвещения.Кредит = Перечисления.ДаНет.Нет) тогда
		
		СуммаДляРаспределения = СуммаДокумента; 
		ИтогСальдо     = БиллинговыеУслуги.Итог("Сальдо");
		ИтогНачисления = БиллинговыеУслуги.Итог("Начислено");
		
		// БИТ_ЖКХ 09.11.2011
		// Временная замена рапределению по текущим начислениям.
		Для каждого ТекСтрока Из БиллинговыеУслуги Цикл
		
			СуммаСписания = ?(ИтогСальдо = 0 ,0 ,?(ТекСтрока.Сальдо > 0 , ТекСтрока.Сальдо,0)/ИтогСальдо) * СуммаДляРаспределения;
		    ТекСтрока.Сумма = ТекСтрока.Сумма + СуммаСписания;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если БиллинговыеУслуги.Количество() > 0  Тогда
		
		СуммаПроверки = БиллинговыеУслуги.Итог("Сумма");
		Индекс = 0;
		Если СуммаПроверки <> СуммаДокумента Тогда
			
			БиллинговыеУслуги.Сортировать("Сумма Убыв");
			Строка = БиллинговыеУслуги.Получить(Индекс);
			
			Если Строка <> Неопределено Тогда
				
				Остаток = СуммаДокумента - БиллинговыеУслуги.Итог("Сумма");
				Строка.Сумма = Строка.Сумма + Остаток;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТаблицуНачислений()  Экспорт
	
	ТаблицаНачислений = Новый ТаблицаЗначений;
	ТаблицаНачислений.Колонки.Добавить("ЛицевойСчет"               , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаНачислений.Колонки.Добавить("Услуга"                    , Новый ОписаниеТипов("СправочникСсылка.бит_бу_БиллинговыеУслуги"));
	ТаблицаНачислений.Колонки.Добавить("Приоритет"                 , ОбщегоНазначения.ОписаниеТипаЧисло(2,0));
	ТаблицаНачислений.Колонки.Добавить("Поставщик"                 , Новый ОписаниеТипов("СправочникСсылка.бит_ПоставщикиУслуг"));
	ТаблицаНачислений.Колонки.Добавить("Начислено"                 , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаНачислений.Колонки.Добавить("Сальдо"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаНачислений.Колонки.Добавить("Оплата"                    , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаНачислений.Колонки.Добавить("Разовые"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Возврат ТаблицаНачислений;
	
КонецФункции // ()
 
#КонецОбласти 