
// Модуль содержит процедуры/функции механизма получения данных доступные как на клиенте так и на сервере.

#Область СлужебныеПроцедурыИФункции

// Функция выполняет поиск объекта по ИД в базе, подключенной через внешнее соединение.
//
// Параметры:
//  ЗначениеПоиска - Произвольный.
//  СтруктураИмен  - Структура.
//  Соединение     - ComObject.
//  ВыводитьОшибки - Булево.
//
// Возвращаемое значение:
//  НайденноеЗначение – Произвольный.
//
Функция НайтиПоИД(Соединение, СтруктураПараметров, СтруктураИмен, Режим = "ПоСсылке",  ВыводитьОшибки = Ложь) Экспорт
	
	НайденноеЗначение = Неопределено;	
	
	#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ Сервер Тогда
		
		ЗначениеПоиска   = СтруктураПараметров.ЗначениеПоиска;
		Направление      = СтруктураПараметров.Направление;		
		
		флПриемникВнешняя = ?(ВРег(Направление) = ВРег("ТекущаяВнешняя"),Истина,Ложь);
		
		
		Если Режим = "ПоИД" Тогда
			
			ИдСтр    = ЗначениеПоиска;
			
		Иначе
			
			Если флПриемникВнешняя Тогда
				
				ИдСтр    = Строка(ЗначениеПоиска.УникальныйИдентификатор());
				
			Иначе	
				
				ИдСтр    = Соединение.String(ЗначениеПоиска.УникальныйИдентификатор());
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если флПриемникВнешняя Тогда
			
			ИдПоиска = Соединение.NewObject("УникальныйИдентификатор",ИдСтр);
			
		Иначе
			
			ИдПоиска = Новый УникальныйИдентификатор(ИдСтр);
			
		КонецЕсли; 
		
		Попытка
			
			Если флПриемникВнешняя Тогда
				
				НайденноеЗначение = Соединение[СтруктураИмен.ИмяКоллекции][СтруктураИмен.ИмяОбъекта].ПолучитьСсылку(ИдПоиска);
				
				Если НЕ ПроверитьСсылку(НайденноеЗначение, Соединение) Тогда
				
					НайденноеЗначение = Неопределено;
				
				КонецЕсли; 
				
			Иначе
				
				Менеджер = бит_ОбщегоНазначения.ПолучитьМенеджер(СтруктураИмен.ИмяКоллекции);
				НайденноеЗначение = Менеджер[СтруктураИмен.ИмяОбъекта].ПолучитьСсылку(ИдПоиска);
				
			КонецЕсли; 
			
		Исключение
			
			Если ВыводитьОшибки Тогда
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ИмяОбъектаПолное = СтруктураИмен.ИмяКласса+"."+СтруктураИмен.ИмяОбъекта;
				ТекстСообщения = НСтр("ru = 'Ошибка поиска объекта ""%1"" по идентификатору!
											|%2'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяОбъектаПолное, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли; 
			
		КонецПопытки;
		
	#КонецЕсли 
	
	Возврат НайденноеЗначение;
	
КонецФункции // НайтиПоИД()

// Функция проверяет доступность ссылки.
//
// Параметры:
//  ЗначениеПроверки.
//
// Возвращаемое значение:
//  ЗначениеДоступно – Булево.
//
Функция ПроверитьСсылку(ЗначениеПроверки, Соединение) Экспорт
	
	ЗначениеДоступно = Истина;
	
	#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ Сервер Тогда	
		
		Если ТипЗнч(ЗначениеПроверки) = Тип("COMОбъект") Тогда
			
			 Попытка
			 
			 	СтрИД = Соединение.String(ЗначениеПроверки.УникальныйИдентификатор());
				Если НЕ ЗначениеЗаполнено(СтрИД) ИЛИ СтрИД = "00000000-0000-0000-0000-000000000000" Тогда
				
					ЗначениеДоступно = Ложь;
				
				КонецЕсли; 
			 
			 Исключение
				 
				 ЗначениеДоступно = Ложь;
				 
			 КонецПопытки;
			
		Иначе	
			
			// Проверка на "битые" ссылки.
			Если НЕ ЗначениеПроверки = Неопределено 
				И НЕ ЗначениеПроверки.Пустая() Тогда
				
				Попытка
					
					ТекОбъект = ЗначениеПроверки.ПолучитьОбъект();
					Если ТекОбъект = Неопределено Тогда
						
						ЗначениеДоступно = Ложь;
						
					КонецЕсли;
					
				Исключение
					
					ЗначениеДоступно = Ложь;
					
				КонецПопытки;
				
			КонецЕсли; 
			
			
		КонецЕсли; 	
	
	#КонецЕсли 	
	
	Возврат ЗначениеДоступно;
	
КонецФункции // ПроверитьСсылку()

// Функция возвращает строку признак обращения к встроенному REST сервису по протоколу OData.
//
// Возвращаемое значение:
//  РезСтрока – Строка.
//
Функция ПризнакОбращенияОДата() Экспорт

	РезСтрока = "/odata/standard.odata/";

	Возврат РезСтрока;
	
КонецФункции // ПризнакОбращенияОДата()

#КонецОбласти