
#Область ПеременныеМодуля

&НаКлиенте
Перем мПлатежныеСистемы; // Хранит список платежных систем.

&НаКлиенте
Перем мСписокКодировок;  // Хранит список кодировок.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СоставШК.Видимость = НастроитьСоставШК;
	Элементы.СтраницыОтбор.Видимость = (Объект.ЛицевыеСчета = "По выбору");
	
	Элементы.СтраницыОтборУслуг.Видимость = (Объект.Услуги = "По выбору");
	
	Элементы.ВидОперации.Доступность = ЗначениеЗаполнено(Объект.Организация);
	
	Элементы.РабочаяПанель.Видимость = ЗначениеЗаполнено(Объект.ВидОперации);
	
	Если Объект.ПлатежнаяСистема = "А-3" Тогда
		
		// Добавление элемента в список выбора.
		НайденныйЭлемент = Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению("Загрузка");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.ВидОперации.СписокВыбора.Добавить("Загрузка","Загрузка");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ФИО");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ФИО","ФИО");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Адрес");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("Адрес","Адрес");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ИдентификаторЛицевогоСчета");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ИдентификаторЛицевогоСчета","ИдентификаторЛицевогоСчета");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдо");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдо","НачальноеСальдо");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачислений");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачислений","СуммаНачислений");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомОплаты");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачисленийСУчетомОплаты","СуммаНачисленийСУчетомОплаты");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомОплатыИПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачисленийСУчетомОплатыИПени","СуммаНачисленийСУчетомОплатыИПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаОплаты");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаОплаты","СуммаОплаты");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоПени","НачальноеСальдоПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаПени","СуммаПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоСУчетомПени","НачальноеСальдоСУчетомПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("СуммаНачисленийСУчетомПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("СуммаНачисленийСУчетомПени","СуммаНачисленийСУчетомПени");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомОплаты");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоСУчетомОплаты","НачальноеСальдоСУчетомОплаты");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачальноеСальдоСУчетомОплатыИПени");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачальноеСальдоСУчетомОплатыИПени","НачальноеСальдоСУчетомОплатыИПени");
		КонецЕсли;
		Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодУслуги");
			Если НайденныйЭлемент <> Неопределено Тогда
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("КодУслуги","КодУслуги");
			КонецЕсли;
		Иначе
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодУслуги");
			Если НайденныйЭлемент <> Неопределено Тогда
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);;
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Услуга");
			Если НайденныйЭлемент <> Неопределено Тогда
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("Услуга","Услуга");
			КонецЕсли;
		Иначе
			НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("Услуга");
			Если НайденныйЭлемент <> Неопределено Тогда
				Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);;
			КонецЕсли;
		КонецЕсли;
		
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("НачалоПериода");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("НачалоПериода","НачалоПериода");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КодДополнения");
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("КодДополнения","КодДополнения");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("КолПроживающих"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("КолПроживающих","КолПроживающих");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ОбщаяПлощадь"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ОбщаяПлощадь","ОбщаяПлощадь");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ШтрихКод"); 
		Если НайденныйЭлемент = Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Добавить("ШтрихКод","ШтрихКод");
		КонецЕсли;
		НайденныйЭлемент = Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.НайтиПоЗначению("ФИОАдрес"); 
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.НастройкаПолейСтрокиРеестраСальдоИмяПоля.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
		
		Если Объект.ВидОперации = "Выгрузка" Тогда
			
			Элементы.РабочаяПанель.ТекущаяСтраница = Элементы.Выгрузка;
			
			Элементы.ГруппаВыводИнформации.Видимость = Истина;
			
		ИначеЕсли Объект.ВидОперации = "Загрузка" Тогда
			
			Элементы.РабочаяПанель.ТекущаяСтраница = Элементы.Загрузка;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Объект.Вручную = Ложь;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	
	
	КэшированныеЗначения.Вставить("мЛьготаПерсонифицированная", Неопределено);
	
	КэшированныеЗначения.Вставить("мВыводитьЛьготыНаСчетИзвещение", Неопределено);
	
	КэшированныеЗначения.Вставить("мРасчетСУчетомДолейВладения", Неопределено);
	
	КэшированныеЗначения.Вставить("мУменьшениеНормыЛьготыВПределахФакта", Неопределено);
	
	КэшированныеЗначения.Вставить("мНачислениеСУчетомДнейПроживания", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьУлица", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьДом", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьКорпус", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьКвартира", Неопределено);
	
	КэшированныеЗначения.Вставить("мНеПечататьРайон", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксУлица", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксДом", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксКорпус", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксКвартира", Неопределено);
	
	КэшированныеЗначения.Вставить("мПрефиксРайон", Неопределено);
	
	КэшированныеЗначения.Вставить("мНомерПолучателяПоБанку", Неопределено);
	
	КэшированныеЗначения.Вставить("мИспользоватьНомерПолучателяВШК", Неопределено);
	
	КэшированныеЗначения.Вставить("мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика", Неопределено);
	
	КэшированныеЗначения.Вставить("мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Неопределено);
	
	КэшированныеЗначения.Вставить("мСтруктураДанных", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПечати", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПечатиСчетчиков", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПерерасчетов", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаПени", Неопределено);
	
	КэшированныеЗначения.Вставить("мКолонка", Неопределено);
	
	КэшированныеЗначения.Вставить("мОбщаяПлощадь", Неопределено);
	
	КэшированныеЗначения.Вставить("мЖилаяПлощадь", Неопределено);
	
	КэшированныеЗначения.Вставить("мМОП", Неопределено);
	
	КэшированныеЗначения.Вставить("мОтапливаемаяПлощадь", Неопределено);
	
	КэшированныеЗначения.Вставить("мСовокупнаяПлощадь", Неопределено);
	
	КэшированныеЗначения.Вставить("мТаблицаСвойств", Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Услуги = "Все";
	
	Объект.ЛицевыеСчета = "Все";
	
	Объект.ВыводИнформации = "Без разбивки по услугам";
	Объект.ВводИнформации  = "Без разбивки по услугам";
	Объект.Вручную         = Ложь;
	
	Если НЕ ЗначениеЗаполнено(сг_ВспомогательныйСимвол) Тогда
		
		сг_ВспомогательныйСимвол = """";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(сг_СимволРазделения) Тогда
		
		сг_СимволРазделения = ";";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(сг_СимволПослеКодаДополнения) Тогда
		
		сг_СимволПослеКодаДополнения = ":";
		
	КонецЕсли; 
	
	сг_ИмяЛСВФайле = Элементы.сг_ВыгружатьЛС.СписокВыбора[0].Значение;
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	УправлениеЭлементамиФормы();
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	Массив.Добавить(Тип("Число"));
	Массив.Добавить(Тип("Дата"));
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(100);
	КД = Новый КвалификаторыДаты();
	
	Элементы.НастройкаПолейСтрокиРеестраСальдоТип.ДоступныеТипы         = Новый ОписаниеТипов(Массив, КЧ, КС,КД);
	Элементы.НастройкаПолейСтрокиРеестраСальдоТип.РазрешитьСоставнойТип = Ложь;
	
	Элементы.УсловиеОтбора.СписокВыбора.Добавить(ВидСравнения.ВСписке);
	Элементы.УсловиеОтбора.СписокВыбора.Добавить(ВидСравнения.НеВСписке);
	
	УсловиеОтбора = ВидСравнения.ВСписке;
	
	Элементы.УсловиеОтбораУслуг.СписокВыбора.Добавить(ВидСравнения.ВСписке);
	Элементы.УсловиеОтбораУслуг.СписокВыбора.Добавить(ВидСравнения.НеВСписке);
	
	УсловиеОтбораУслуг = ВидСравнения.ВСписке;
	
	Объект.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ПлатежнаяСистема = "А-3";
	
	Элементы.ПлатежнаяСистема.СписокВыбора.Добавить("А-3", "А-3", , );
	
	УправлениеЭлементамиФормы();
	
	Если Объект.ВыводИнформации = "Без разбивки по услугам" Тогда
		
		Элементы.ПростаяВыгрузка.Видимость = Истина;
		Элементы.ПолнаяВыгрузка.Видимость = Ложь;
		
	Иначе
		
		Элементы.ПростаяВыгрузка.Видимость = Ложь;
		Элементы.ПолнаяВыгрузка.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПлатежнаяСистемаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПриИзменении(Элемент)
	
	Элементы.СтраницыОтбор.Видимость = (Объект.ЛицевыеСчета = "По выбору");
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ИмяФайлаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                  = "Файл данных (*.xml)|*.xml";
	ДиалогВыбораФайла.Расширение              = "xml";
	ДиалогВыбораФайла.Заголовок               = "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра           = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла          = Объект.сг_ИмяФайлаВыгрузки;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.сг_ИмяФайлаВыгрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ИмяФайлаВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.сг_ИмяФайлаВыгрузки);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевыхСчетовЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок               = "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра           = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла          = сг_ФайлЗагрузки;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		сг_ФайлЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ФайлЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(сг_ФайлЗагрузки);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДатаОплаты_ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	
	Если НЕ ТекДанные.ПолучитьРодителя() = Неопределено  И ТекДанные.ПолучитьЭлементы().Количество() > 0 Тогда;
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Объект.Организация);
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор", Отбор),Элемент);
		
	ИначеЕсли НЕ ТекДанные.ПолучитьРодителя() = Неопределено  И ТекДанные.ПолучитьЭлементы().Количество() = 0 Тогда;
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",,Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыИсточникОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	
	СтандартнаяОбработка = ТекДанные.ПолучитьРодителя() = Неопределено 
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДокументОплатыОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДокументОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыДокументОплатыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	Если Тип(ТекущиеДанные.Тип) = Тип("Строка") Тогда
		
		Текст = "Нельзя назначить формат на поля с типом ""Строка""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли; 
	
	КонструкторФорматнойСтроки = Новый КонструкторФорматнойСтроки;
	КонструкторФорматнойСтроки.Текст = ТекущиеДанные.Формат;
	
	КонструкторФорматнойСтроки.Показать(Новый ОписаниеОповещения("НастройкаПолейСтрокиРеестраСальдоФорматНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("КонструкторФорматнойСтроки, ТекущиеДанные", КонструкторФорматнойСтроки, ТекущиеДанные))); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		
		ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
		
		Индекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(ТекущаяСтрока);
		
		ТекущаяСтрока.Использовать = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоИспользоватьВИтогахПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	Попытка
		
		Если НЕ Тип(ТекущаяСтрока.Тип) = Тип("Число") Тогда
			
			ТекущаяСтрока.ИспользоватьВИтогах = Ложь;
			
			Текст = "Тип поля " + ТекущаяСтрока.ИмяПоля + " не предназначен для расчета итогов.";
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			
		КонецЕсли;
		
	Исключение
		ТекущаяСтрока.ИспользоватьВИтогах = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип не назначен.");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоФорматОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	Если Тип(ТекущиеДанные.Тип) = Тип("Строка") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Текст = "Нельзя назначить формат на поля с типом ""Строка""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевыхСчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработатьВыбранныеЗначения(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводИнформацииПриИзменении(Элемент)
	
	Если Объект.ВыводИнформации = "Без разбивки по услугам" Тогда
		
		Элементы.ПростаяВыгрузка.Видимость = Истина;
		Элементы.ПолнаяВыгрузка.Видимость = Ложь;
		
	Иначе
		
		Элементы.ПростаяВыгрузка.Видимость = Ложь;
		Элементы.ПолнаяВыгрузка.Видимость = Истина;
		
	КонецЕсли;
	
	Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		ЗаполнитьНастройкиПолейРеестраСальдо();
	Иначе
		ЗаполнитьНастройкиПолейРеестраСальдоБезУслуг();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	
	ТриУровня = Ложь;
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	Для каждого СтрокаКорня Из Корень Цикл
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		Для Каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
			Если ТретийУровень.Количество() > 0 Тогда
				ТриУровня = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТриУровня Тогда
		Если ТекДанные.ПолучитьРодителя() <> Неопределено Тогда
			Родитель = ТекДанные.ПолучитьРодителя();
			КореньРодителя = Родитель.ПолучитьЭлементы();
			Итог = 0;
			Для каждого СтрокаКорня Из КореньРодителя Цикл
				Итог = Итог + СтрокаКорня.Сумма;
			КонецЦикла;
			Родитель.Сумма = Итог;
			РодительРодитель = ТекДанные.ПолучитьРодителя().ПолучитьРодителя();
			КореньРодительРодитель = РодительРодитель.ПолучитьЭлементы();
			ИтогРодителя = 0;
			Для каждого СтрокаКорня Из КореньРодительРодитель Цикл
				ИтогРодителя = ИтогРодителя + СтрокаКорня.Сумма;
			КонецЦикла;
			РодительРодитель.Сумма = ИтогРодителя;
		КонецЕсли;
	Иначе
		Если ТекДанные.ПолучитьРодителя() <> Неопределено Тогда
			Родитель = ТекДанные.ПолучитьРодителя();
			КореньРодителя = Родитель.ПолучитьЭлементы();
			Итог = 0;
			Для каждого СтрокаКорня Из КореньРодителя Цикл
				Итог = Итог + СтрокаКорня.Сумма;
			КонецЦикла;
			Родитель.Сумма = Итог;
		КонецЕсли;
	КонецЕсли;
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СуммаИтоИтогов = 0;
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИтогПоДокументу      = СтрокаКорня.Сумма;
		СуммаИтогПоДокументу = 0;
		
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		
		МассивЛС = Новый Массив;
		
		ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
		
		Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			
			Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
				
				ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
				СуммаИтогПоЛС = 0;
				
				ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
				
				Если ТретийУровень.Количество() = 0 Тогда
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
					
				Иначе
					
					Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
						
						Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
							
							СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
							
						КонецЕсли;
						
					КонецЦикла; 
					
					Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
						
						МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
						
					КонецЕсли; 
					
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
					
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла; 
		СуммаИтоИтогов = СуммаИтоИтогов + СуммаИтогПоДокументу;
	КонецЦикла; 
	Объект.ТекстИтогоДокумент = "Итого по дереву без учета процента: "+Строка(СуммаИтоИтогов);
	Объект.Вручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатыПриАктивизацииЯчейки(Элемент)
	
	ТекДанные = Элементы.ДеревоОплаты.ТекущиеДанные;
	ТекСтрока = Элементы.ДеревоОплаты.ТекущаяСтрока;
	
	ТриУровня = Ложь;
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	Для каждого СтрокаКорня Из Корень Цикл
		ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
		Для Каждого СтрокаВторогоУровня Из ВторойУровень Цикл
			ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
			Если ТретийУровень.Количество() > 0 Тогда
				ТриУровня = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТекДанные <> Неопределено Тогда	
		Если ТриУровня Тогда		
			Если ТекДанные.ПолучитьРодителя() = Неопределено Тогда
				Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
					Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
				КонецЕсли;
			Иначе
				Если ТекДанные.ПолучитьРодителя().ПолучитьРодителя() = Неопределено Тогда
					Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
						Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
					КонецЕсли;
				Иначе
					Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
						Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТекДанные.ПолучитьРодителя() = Неопределено Тогда
				Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
					Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
				КонецЕсли;
			Иначе
				Если Элемент.ТекущийЭлемент.Имя = "ДеревоОплатыСумма" Тогда
					Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НастроитьСоставШКПриИзменении(Элемент)
	Элементы.СоставШК.Видимость = НастроитьСоставШК;
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	Элементы.СтраницыОтборУслуг.Видимость = (Объект.Услуги = "По выбору");
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ВыбратьСтандартныйПериод(Команда)
	
	СтандартныйПериод.ДатаНачала         = Объект.сг_НачалоПериода;
	СтандартныйПериод.ДатаОкончания      = Объект.сг_КонецПериода;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = СтандартныйПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьСтандартныйПериодЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтандартныйПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если ЗначениеЗаполнено(Период) Тогда
		СтандартныйПериод = Диалог.Период;
		Объект.сг_НачалоПериода    = СтандартныйПериод.ДатаНачала;
		Объект.сг_КонецПериода     = СтандартныйПериод.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	Если НастройкаПолейСтрокиРеестраСальдо.Количество() = 0 Тогда
		
		Текст = "Формат реестра выгрузки не настроен!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли; 
	
	Текст = Новый ТекстовыйДокумент;
	
	Если Объект.ПлатежнаяСистема = "А-3" Тогда
		сгВыгрузить(Текст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПутьКАрхиватору7z) Тогда
		
		Если НЕ Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
			ИмяФайлаSA1 = Объект.а3_ИмяФайлаSA1_simp;
			ПутьКФайлуSA17z = Строка(Объект.а3_КаталогВыгрузкиSA1_simp + "\" + Объект.а3_ИмяФайлаSA1_simp + ".7z");
			ПутьКФайлуSA1 = Строка(Объект.а3_КаталогВыгрузкиSA1_simp + "\" + Объект.а3_ИмяФайлаSA1_simp + ".xml");
		Иначе
			ИмяФайлаSA1 = Объект.а3_ИмяФайлаSA1_full;
			ПутьКФайлуSA17z = Строка(Объект.а3_КаталогВыгрузкиSA1_full + "\" + Объект.а3_ИмяФайлаSA1_full + ".7z");
			ПутьКФайлуSA1 = Строка(Объект.а3_КаталогВыгрузкиSA1_full + "\" + Объект.а3_ИмяФайлаSA1_full + ".xml");
		КонецЕсли;	
		
		Если НЕ Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
			ИмяФайлаSL1 = Объект.а3_ИмяФайлаSL1_simp;
			ПутьКФайлуSL17z = Строка(Объект.а3_КаталогВыгрузкиSL1_simp + "\" + Объект.а3_ИмяФайлаSL1_simp + ".7z");
			ПутьКФайлуSL1 = Строка(Объект.а3_КаталогВыгрузкиSL1_simp + "\" + Объект.а3_ИмяФайлаSL1_simp + ".xml");
		Иначе
			ИмяФайлаSL1 = Объект.а3_ИмяФайлаSL1_full;
			ПутьКФайлуSL17z = Строка(Объект.а3_КаталогВыгрузкиSL1_full + "\" + Объект.а3_ИмяФайлаSL1_full + ".7z");
			ПутьКФайлуSL1 = Строка(Объект.а3_КаталогВыгрузкиSL1_full + "\" + Объект.а3_ИмяФайлаSL1_full + ".xml");
		КонецЕсли;
		
		Запаковать7Z(ИмяФайлаSA1,ПутьКФайлуSA1,ПутьКФайлуSA17z,ИмяФайлаSL1,ПутьКФайлуSL1,ПутьКФайлуSL17z);
	Иначе	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для запаковки в архивы 7z необходимо заполнить путь к архиватору!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры                                             

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	МассивОшибок = Новый Массив;
	
	ТекстФайл = Новый ТекстовыйДокумент;
	
	Попытка
		
		ТекстФайл.Прочитать(сг_ФайлЗагрузки, КодировкаТекста["UTF8"]);
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Неправильно задан путь к файлу или файл отсутствует!");
		
		Возврат;
	КонецПопытки;
	
	Отказ = Ложь;	
	
	Если Объект.ВводИнформации = "С разбивкой по услугам" Тогда
		сгПрочитатьФайл(МассивОшибок, ТекстФайл, Отказ);
	Иначе
		сгПрочитатьФайлБезРазбивкиПоУслугам(МассивОшибок, ТекстФайл, Отказ);
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		Для каждого Ошибка Из МассивОшибок Цикл
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Ошибка);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Элементы.ДеревоОплаты.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
	КоллекцияЭлементовДерева=ДеревоОплаты.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=СтрокаДерева.ПолучитьИдентификатор();
		Элементы.ДеревоОплаты.Развернуть(ИдентификаторСтроки);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиФорматаРеестра(Команда)
	
	Если Объект.ПлатежнаяСистема = "А-3" Тогда
		Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
			ЗаполнитьНастройкиПолейРеестраСальдо();
		Иначе
			ЗаполнитьНастройкиПолейРеестраСальдоБезУслуг();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	ТекИндекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(ТекущаяСтрока);
	
	Попытка
		НастройкаПолейСтрокиРеестраСальдо.Сдвинуть(ТекИндекс, -1);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	ТекущаяСтрока = Элементы.НастройкаПолейСтрокиРеестраСальдо.ТекущиеДанные;
	
	ТекИндекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(ТекущаяСтрока);
	
	Попытка
		НастройкаПолейСтрокиРеестраСальдо.Сдвинуть(ТекИндекс, 1);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , Объект.сг_КонецПериода);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, Элементы.ОтборЛицевыхСчетов, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОплаты(Команда)
	
	сг_СоздатьОплаты(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура сгВыгрузить(Текст)
	
	ИспользоватьНомерПолучателя = Ложь;
	НомерПолучателяПоБанку      = 0;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИспользоватьНомерПолучателяВШК", ИспользоватьНомерПолучателя);
	СтруктураПараметров.Вставить("НомерПолучателяПоБанку"        , НомерПолучателяПоБанку);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Объект.сг_КонецПериода), Объект.Организация, СтруктураПараметров);
	
	ИспользоватьНомерПолучателя = СтруктураПараметров.ИспользоватьНомерПолучателяВШК;
	НомерПолучателяПоБанку      = СтруктураПараметров.НомерПолучателяПоБанку;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	ПостроительЗапроса.Параметры.Вставить("НачалоПериода", НачалоДня(Объект.сг_НачалоПериода));
	ПостроительЗапроса.Параметры.Вставить("КонецПериода" , КонецДня(Объект.сг_КонецПериода));
	ПостроительЗапроса.Параметры.Вставить("Организация"  , Объект.Организация);
	
	Если Объект.ВыводИнформации  = "С разбивкой по услугам" Тогда
		ПостроительЗапроса.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальноеСальдо,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечноеСальдо,
		|	СУММА(0) КАК НачальноеСальдоПени,
		|	СУММА(0) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ,
		|	СУММА(Остатки.НачальноеСальдо) КАК НачальноеСальдо,
		|	СУММА(Остатки.КонечноеСальдо) КАК КонечноеСальдо,
		|	СУММА(Остатки.НачальноеСальдоПени) КАК НачальноеСальдоПени,
		|	СУММА(Остатки.КонечноеСальдоПени) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ ГрупОстатки
		|ИЗ
		|	Остатки КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНачислений,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОплаты,
		|	СУММА(0) КАК СуммаПени
		|ПОМЕСТИТЬ Обороты
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ,
		|	СУММА(Обороты.СуммаНачислений) КАК СуммаНачислений,
		|	СУММА(Обороты.СуммаОплаты) КАК СуммаОплаты,
		|	СУММА(Обороты.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ ГрупОбороты
		|ИЗ
		|	Обороты КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Приоритет
		|ПОМЕСТИТЬ СведенияПоУслугам
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.данет.да)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
		|	бит_ФИОПроживающихСрезПоследних.Фамилия,
		|	бит_ФИОПроживающихСрезПоследних.Имя,
		|	бит_ФИОПроживающихСрезПоследних.Отчество
		|ПОМЕСТИТЬ ОтветсвенныеЛица
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&КонецПериода, ) КАК бит_ФИОПроживающихСрезПоследних
		|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
		|ПОМЕСТИТЬ Проживающие
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира,
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
		|ПОМЕСТИТЬ СведенияОКвартре
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
		|			&КонецПериода,
		|			Квартира В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Таб.ЛицевойСчет.Квартира
		|				ИЗ
		|					СведенияПоУслугам КАК Таб)) КАК бит_СведенияОКвартиреСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ОтПоказаний,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|			ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|								ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|							КОНЕЦ
		|					КОНЕЦ > ВЫБОР
		|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|								ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|							КОНЕЦ
		|					КОНЕЦ
		|					ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
		|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|									КОНЕЦ
		|							КОНЕЦ = ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
		|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|									КОНЕЦ
		|							КОНЕЦ
		|							ТОГДА ВЫБОР
		|									КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) = ЕСТЬNULL(ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0), 0)
		|										ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|									ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|								КОНЕЦ
		|						ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ДоПоказаний,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) = ВЫБОР
		|					КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|						ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|					ИНАЧЕ ЕСТЬNULL(ВЫБОР
		|								КОГДА ВЫБОР
		|										КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|											ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|										ИНАЧЕ ВЫБОР
		|												КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|													ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|												ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|											КОНЕЦ
		|									КОНЕЦ > ВЫБОР
		|										КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|											ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|										ИНАЧЕ ВЫБОР
		|												КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|													ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|												ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|											КОНЕЦ
		|									КОНЕЦ
		|									ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|								ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|							КОНЕЦ, 0)
		|				КОНЕЦ
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|						ТОГДА ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
		|									ИЛИ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
		|								ТОГДА ЕСТЬNULL(ВЫБОР
		|											КОГДА ВЫБОР
		|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|													ИНАЧЕ ВЫБОР
		|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|														КОНЕЦ
		|												КОНЕЦ > ВЫБОР
		|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|													ИНАЧЕ ВЫБОР
		|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|														КОНЕЦ
		|												КОНЕЦ
		|												ТОГДА ВЫБОР
		|														КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|															ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|														ИНАЧЕ ВЫБОР
		|																КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|																	ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
		|																ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|															КОНЕЦ
		|													КОНЕЦ
		|											ИНАЧЕ ВЫБОР
		|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|													ИНАЧЕ ВЫБОР
		|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
		|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|														КОНЕЦ
		|												КОНЕЦ
		|										КОНЕЦ, 0)
		|							ИНАЧЕ бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, 0) * бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток КАК КоличествоЕдиниц,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	ВЫБОР
		|		КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Подкрутка)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Инспектор)
		|				ИНАЧЕ ВЫБОР
		|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
		|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ИсточникПоказаний,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&КонецПериода, ) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&КонецПериода, ) КАК бит_ПоказанияСчетчиковОстатки
		|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
		|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
		|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
		|	СведенияПоУслугам.ЛицевойСчет.Наименование КАК НаименованиеЛС,
		|	СведенияПоУслугам.ЛицевойСчет.Идентификатор КАК ИдентификаторЛицевогоСчета,
		|	СведенияПоУслугам.Услуга КАК Услуга,
		|	СведенияПоУслугам.Услуга.Код КАК КодУслуги,
		|	ОтветсвенныеЛица.ФизЛицо КАК ФИО,
		|	ОтветсвенныеЛица.Фамилия КАК Фамилия,
		|	ОтветсвенныеЛица.Имя КАК Имя,
		|	ОтветсвенныеЛица.Отчество КАК Отчество,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Район КАК Город,
		|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
		|	СведенияПоУслугам.ЛицевойСчет.Здание КАК Здание,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус КАК Корпус,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира КАК Квартира,
		|	ЕСТЬNULL(Проживающие.КолПроживающих, 0) КАК КолПроживающих,
		|	ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
		|	ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) КАК СуммаНачислений,
		|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) КАК СуммаОплаты,
		|	ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаПени,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) КАК НачальноеСальдо,
		|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0) КАК КонечноеСальдо,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоПени,
		|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) КАК КонечноеСальдоПени,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоСУчетомПени,
		|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) + ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0) КАК КонечноеСальдоСУчетомПени,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) КАК НачальноеСальдоСУчетомОплаты,
		|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоСУчетомОплатыИПени,
		|	ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаНачисленийСУчетомПени,
		|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) КАК СуммаНачисленийСУчетомОплаты,
		|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаНачисленийСУчетомОплатыИПени,
		|	Счетчики.Услуга КАК УслугаСчетчика,
		|	Счетчики.Счетчик КАК Счетчик,
		|	Счетчики.ОтПоказаний,
		|	Счетчики.ДоПоказаний,
		|	Счетчики.Многотарифный,
		|	СведенияПоУслугам.УслугаПриоритет КАК УслугаПриоритет,
		|	Счетчики.Услуга.Приоритет КАК УслугаСчетчикаПриоритет
		|ИЗ
		|	СведенияПоУслугам КАК СведенияПоУслугам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОстатки КАК ГрупОстатки
		|		ПО СведенияПоУслугам.ЛицевойСчет = ГрупОстатки.ЛицевойСчет
		|			И СведенияПоУслугам.Услуга = ГрупОстатки.УслугаЖКХ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОбороты КАК ГрупОбороты
		|		ПО СведенияПоУслугам.Услуга = ГрупОбороты.УслугаЖКХ
		|			И СведенияПоУслугам.ЛицевойСчет = ГрупОбороты.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветсвенныеЛица КАК ОтветсвенныеЛица
		|		ПО СведенияПоУслугам.ЛицевойСчет = ОтветсвенныеЛица.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
		|		ПО СведенияПоУслугам.ЛицевойСчет = Проживающие.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКвартре КАК СведенияОКвартре
		|		ПО СведенияПоУслугам.ЛицевойСчет.Квартира = СведенияОКвартре.Квартира
		|		ЛЕВОЕ СОЕДИНЕНИЕ Счетчики КАК Счетчики
		|		ПО СведенияПоУслугам.ЛицевойСчет = Счетчики.Объект
		|			И СведенияПоУслугам.Услуга = Счетчики.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеЛС,
		|	УслугаПриоритет
		|ИТОГИ
		|	СУММА(СуммаНачислений),
		|	СУММА(СуммаОплаты),
		|	СУММА(СуммаПени),
		|	СУММА(НачальноеСальдо),
		|	СУММА(КонечноеСальдо),
		|	СУММА(НачальноеСальдоПени),
		|	СУММА(КонечноеСальдоПени),
		|	СУММА(НачальноеСальдоСУчетомПени),
		|	СУММА(КонечноеСальдоСУчетомПени),
		|	СУММА(НачальноеСальдоСУчетомОплаты),
		|	СУММА(НачальноеСальдоСУчетомОплатыИПени),
		|	СУММА(СуммаНачисленийСУчетомПени),
		|	СУММА(СуммаНачисленийСУчетомОплаты),
		|	СУММА(СуммаНачисленийСУчетомОплатыИПени)
		|ПО
		|	ОБЩИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияПоУслугам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОтветсвенныеЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Проживающие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияОКвартре
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счетчики";
		
	Иначе
		ПостроительЗапроса.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальноеСальдо,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечноеСальдо,
		|	СУММА(0) КАК НачальноеСальдоПени,
		|	СУММА(0) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ,
		|	СУММА(Остатки.НачальноеСальдо) КАК НачальноеСальдо,
		|	СУММА(Остатки.КонечноеСальдо) КАК КонечноеСальдо,
		|	СУММА(Остатки.НачальноеСальдоПени) КАК НачальноеСальдоПени,
		|	СУММА(Остатки.КонечноеСальдоПени) КАК КонечноеСальдоПени
		|ПОМЕСТИТЬ ГрупОстатки
		|ИЗ
		|	Остатки КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.ЛицевойСчет,
		|	Остатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНачислений,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОплаты,
		|	СУММА(0) КАК СуммаПени
		|ПОМЕСТИТЬ Обороты
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот)
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ,
		|	СУММА(Обороты.СуммаНачислений) КАК СуммаНачислений,
		|	СУММА(Обороты.СуммаОплаты) КАК СуммаОплаты,
		|	СУММА(Обороты.СуммаПени) КАК СуммаПени
		|ПОМЕСТИТЬ ГрупОбороты
		|ИЗ
		|	Обороты КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.ЛицевойСчет,
		|	Обороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|ПОМЕСТИТЬ СведенияПоУслугам
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.данет.да)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
		|	бит_ФИОПроживающихСрезПоследних.Фамилия,
		|	бит_ФИОПроживающихСрезПоследних.Имя,
		|	бит_ФИОПроживающихСрезПоследних.Отчество
		|ПОМЕСТИТЬ ОтветсвенныеЛица
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&КонецПериода, ) КАК бит_ФИОПроживающихСрезПоследних
		|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
		|ПОМЕСТИТЬ Проживающие
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира,
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
		|ПОМЕСТИТЬ СведенияОКвартре
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
		|			&КонецПериода,
		|			Квартира В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Таб.ЛицевойСчет.Квартира
		|				ИЗ
		|					СведенияПоУслугам КАК Таб)) КАК бит_СведенияОКвартиреСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ОтПоказаний,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|			ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|								ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|							КОНЕЦ
		|					КОНЕЦ > ВЫБОР
		|						КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|							ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|								ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|							КОНЕЦ
		|					КОНЕЦ
		|					ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
		|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|									КОНЕЦ
		|							КОНЕЦ = ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
		|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|									КОНЕЦ
		|							КОНЕЦ
		|							ТОГДА ВЫБОР
		|									КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) = ЕСТЬNULL(ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0), 0)
		|										ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0)
		|									ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|								КОНЕЦ
		|						ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0)
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ДоПоказаний,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) = ВЫБОР
		|					КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|						ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|					ИНАЧЕ ЕСТЬNULL(ВЫБОР
		|								КОГДА ВЫБОР
		|										КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|											ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|										ИНАЧЕ ВЫБОР
		|												КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|													ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|												ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|											КОНЕЦ
		|									КОНЕЦ > ВЫБОР
		|										КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|											ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|										ИНАЧЕ ВЫБОР
		|												КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|													ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|												ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|											КОНЕЦ
		|									КОНЕЦ
		|									ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|								ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|							КОНЕЦ, 0)
		|				КОНЕЦ
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|						ТОГДА ВЫБОР
		|								КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) >= 0
		|									ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0) <> 0
		|											ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность, 0) - ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) + ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|										ИНАЧЕ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток, 0)
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток, 0) <> 0
		|									ИЛИ ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток, 0) <> 0
		|								ТОГДА ЕСТЬNULL(ВЫБОР
		|											КОГДА ВЫБОР
		|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|													ИНАЧЕ ВЫБОР
		|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|														КОНЕЦ
		|												КОНЕЦ > ВЫБОР
		|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|													ИНАЧЕ ВЫБОР
		|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|														КОНЕЦ
		|												КОНЕЦ
		|												ТОГДА ВЫБОР
		|														КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|															ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|														ИНАЧЕ ВЫБОР
		|																КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|																	ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток + 1
		|																ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|															КОНЕЦ
		|													КОНЕЦ
		|											ИНАЧЕ ВЫБОР
		|													КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток >= 0
		|														ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|													ИНАЧЕ ВЫБОР
		|															КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|																ТОГДА бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток + бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток + 1
		|															ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|														КОНЕЦ
		|												КОНЕЦ
		|										КОНЕЦ, 0)
		|							ИНАЧЕ бит_ПоказанияСчетчиковОстатки.Счетчик.Разрядность - бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, 0) * бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток КАК КоличествоЕдиниц,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	ВЫБОР
		|		КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Подкрутка)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Инспектор)
		|				ИНАЧЕ ВЫБОР
		|						КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток <> 0
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
		|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бит_ИсточникПоказаний.Население)
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ИсточникПоказаний,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&КонецПериода, ) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&КонецПериода, ) КАК бит_ПоказанияСчетчиковОстатки
		|		ПО (бит_ПоказанияСчетчиковОстатки.Объект = бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект)
		|			И (бит_ПоказанияСчетчиковОстатки.Услуга = бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга)
		|			И (бит_ПоказанияСчетчиковОстатки.Счетчик = бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик)
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
		|	СведенияПоУслугам.ЛицевойСчет.Наименование КАК НаименованиеЛС,
		|	СведенияПоУслугам.ЛицевойСчет.Идентификатор КАК ИдентификаторЛицевогоСчета,
		|	ОтветсвенныеЛица.ФизЛицо КАК ФИО,
		|	ОтветсвенныеЛица.Фамилия КАК Фамилия,
		|	ОтветсвенныеЛица.Имя КАК Имя,
		|	ОтветсвенныеЛица.Отчество КАК Отчество,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Район КАК Город,
		|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
		|	СведенияПоУслугам.ЛицевойСчет.Здание КАК Здание,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус КАК Корпус,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира КАК Квартира,
		|	СУММА(ЕСТЬNULL(Проживающие.КолПроживающих, 0)) КАК КолПроживающих,
		|	СУММА(ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0)) КАК ОбщаяПлощадь,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачислений,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0)) КАК СуммаОплаты,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0)) КАК НачальноеСальдо,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдо,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0)) КАК КонечноеСальдоПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) + ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0)) КАК КонечноеСальдоСУчетомПени,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0)) КАК НачальноеСальдоСУчетомОплаты,
		|	СУММА(ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0)) КАК НачальноеСальдоСУчетомОплатыИПени,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомПени,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0)) КАК СуммаНачисленийСУчетомОплаты,
		|	СУММА(ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0)) КАК СуммаНачисленийСУчетомОплатыИПени,
		|	Счетчики.Услуга КАК УслугаСчетчика,
		|	Счетчики.Счетчик КАК Счетчик,
		|	Счетчики.ОтПоказаний,
		|	Счетчики.ДоПоказаний,
		|	Счетчики.Многотарифный
		|ИЗ
		|	СведенияПоУслугам КАК СведенияПоУслугам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОстатки КАК ГрупОстатки
		|		ПО СведенияПоУслугам.ЛицевойСчет = ГрупОстатки.ЛицевойСчет
		|			И СведенияПоУслугам.Услуга = ГрупОстатки.УслугаЖКХ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОбороты КАК ГрупОбороты
		|		ПО СведенияПоУслугам.Услуга = ГрупОбороты.УслугаЖКХ
		|			И СведенияПоУслугам.ЛицевойСчет = ГрупОбороты.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветсвенныеЛица КАК ОтветсвенныеЛица
		|		ПО СведенияПоУслугам.ЛицевойСчет = ОтветсвенныеЛица.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
		|		ПО СведенияПоУслугам.ЛицевойСчет = Проживающие.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКвартре КАК СведенияОКвартре
		|		ПО СведенияПоУслугам.ЛицевойСчет.Квартира = СведенияОКвартре.Квартира
		|		ЛЕВОЕ СОЕДИНЕНИЕ Счетчики КАК Счетчики
		|		ПО СведенияПоУслугам.ЛицевойСчет = Счетчики.Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияПоУслугам.ЛицевойСчет,
		|	ОтветсвенныеЛица.ФизЛицо,
		|	ОтветсвенныеЛица.Фамилия,
		|	ОтветсвенныеЛица.Имя,
		|	ОтветсвенныеЛица.Отчество,
		|	СведенияПоУслугам.ЛицевойСчет.Наименование,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Район,
		|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета,
		|	СведенияПоУслугам.ЛицевойСчет.Здание,
		|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус,
		|	СведенияПоУслугам.ЛицевойСчет.Квартира,
		|	СведенияПоУслугам.ЛицевойСчет.Идентификатор,
		|	Счетчики.Услуга,
		|	Счетчики.Счетчик,
		|	Счетчики.ОтПоказаний,
		|	Счетчики.ДоПоказаний,
		|	Счетчики.Многотарифный
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеЛС,
		|	Счетчик,
		|	Счетчики.Услуга.Приоритет
		|ИТОГИ
		|	СУММА(СуммаНачислений),
		|	СУММА(СуммаОплаты),
		|	СУММА(СуммаПени),
		|	СУММА(НачальноеСальдо),
		|	СУММА(КонечноеСальдо),
		|	СУММА(НачальноеСальдоПени),
		|	СУММА(КонечноеСальдоПени),
		|	СУММА(НачальноеСальдоСУчетомПени),
		|	СУММА(КонечноеСальдоСУчетомПени),
		|	СУММА(НачальноеСальдоСУчетомОплаты),
		|	СУММА(НачальноеСальдоСУчетомОплатыИПени),
		|	СУММА(СуммаНачисленийСУчетомПени),
		|	СУММА(СуммаНачисленийСУчетомОплаты),
		|	СУММА(СуммаНачисленийСУчетомОплатыИПени)
		|ПО
		|	ОБЩИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ГрупОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияПоУслугам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОтветсвенныеЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Проживающие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияОКвартре
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счетчики";	
	КонецЕсли;
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если Объект.ОтборЛицевыхСчетов.Количество() > 0 Тогда
		
		ТабЛС    = Объект.ОтборЛицевыхСчетов.Выгрузить();
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(ТабЛС.ВыгрузитьКолонку("ЛицевойСчет"));
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = УсловиеОтбора;
		ОтборЛС.Значение      = Значение;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли;
	
	Если Объект.Услуги = "По выбору" и Объект.ВводИнформации = "С разбивкой по услугам" Тогда
		
		Если Объект.ОтборУслуг.Количество() > 0 Тогда
			
			ТабУслуг    = Объект.ОтборУслуг.Выгрузить();
			Значение = Новый СписокЗначений;
			Значение.ЗагрузитьЗначения(ТабУслуг.ВыгрузитьКолонку("Услуга"));
			
			ОтборУс = ПостроительЗапроса.Отбор.Добавить("Услуга");
			ОтборУс.ВидСравнения  = УсловиеОтбораУслуг;
			ОтборУс.Значение      = Значение;
			ОтборУс.Использование = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПостроительЗапроса.ВыбранныеПоля.Очистить();
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ЛицевойСчет");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("НаименованиеЛС");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ИдентификаторЛицевогоСчета");
	
	Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		ПостроительЗапроса.ВыбранныеПоля.Добавить("УслугаПриоритет");
		ПостроительЗапроса.ВыбранныеПоля.Добавить("УслугаСчетчикаПриоритет");
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
		
		Если СтрокаТаблицы.Использовать Тогда
			
			Если СтрокаТаблицы.имяПоля = "НачалоПериода" ИЛИ 
				СтрокаТаблицы.имяПоля = "КонецПериода" ИЛИ 
				СтрокаТаблицы.имяПоля = "КодДополнения" ИЛИ 
				СтрокаТаблицы.имяПоля = "ШтрихКод" ИЛИ 
				СтрокаТаблицы.имяПоля = "НаименованиеЛС" ИЛИ 
				СтрокаТаблицы.имяПоля = "ИдентификаторЛицевогоСчета" Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СтрокаТаблицы.имяПоля = "Адрес" Тогда
				
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Город");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Улица");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Здание");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Корпус");
				ПостроительЗапроса.ВыбранныеПоля.Добавить("Квартира");
				
				Продолжить;
				
			КонецЕсли;
			
			ПостроительЗапроса.ВыбранныеПоля.Добавить(СтрокаТаблицы.ИмяПоля);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("За данный периода - данные не найдены.");
		
		Возврат;
	КонецЕсли; 
	
	ВыборкаОбщ = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТЗСкопированная = ПостроительЗапроса.Результат.выгрузить().Скопировать();
	ТЗСкопированнаяСчетчики = ПостроительЗапроса.Результат.выгрузить().Скопировать();
	ТЗСкопированнаяУс = ПостроительЗапроса.Результат.выгрузить().Скопировать();
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Порядок","Value");
	НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
	
	Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
		
		ИмяПоляValue = НайденныеСтрокиРеестра[0].ИмяПоля;
		
	КонецЕсли;	
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Порядок","SaldoOut");
	НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
	
	Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
		
		ИмяПоляSaldoOut = НайденныеСтрокиРеестра[0].ИмяПоля;
		
	КонецЕсли;	
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Порядок","SaldoOutP");
	НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
	
	Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
		
		ИмяПоляSaldoOutP = НайденныеСтрокиРеестра[0].ИмяПоля;
		
	КонецЕсли;	
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Порядок","Balance");
	НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
	
	Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
		
		ИмяПоляBalance = НайденныеСтрокиРеестра[0].ИмяПоля;
		
	КонецЕсли;	
	
	Если НЕ Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		ТЗСкопированная.свернуть("ЛицевойСчет"+","+ИмяПоляValue+","+ИмяПоляSaldoOut+","+ИмяПоляSaldoOutP + "," + ИмяПоляBalance);
	Иначе
		ТЗСкопированная.свернуть("ЛицевойСчет,Услуга",""+ИмяПоляValue+","+ИмяПоляSaldoOut+","+ИмяПоляSaldoOutP+"");
		
		
		ТЗСкопированнаяСчетчики.свернуть("ЛицевойСчет,УслугаПриоритет,Счетчик,УслугаСчетчикаПриоритет,Многотарифный,УслугаСчетчика,ОтПоказаний");
		
		ТЗСкопированнаяСчетчики.Сортировать("ЛицевойСчет Возр,УслугаПриоритет Возр,Счетчик Возр,УслугаСчетчикаПриоритет Возр");
		
		Отбор = Новый Структура;
		Отбор.Вставить("Порядок","Value");
		НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
		
		Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
			
			ИмяПоля = НайденныеСтрокиРеестра[0].ИмяПоля;
			ТЗСкопированнаяУс.Свернуть("ЛицевойСчет,Услуга,УслугаПриоритет,"+ИмяПоля+","+ИмяПоляSaldoOut+","+ИмяПоляSaldoOutP +","+ ИмяПоляBalance);
		КонецЕсли;	
		
		ТЗСкопированнаяУс.Сортировать("ЛицевойСчет Возр, УслугаПриоритет Возр");
		
	КонецЕсли;                        	
	
	// Выгрузка файла SA1 в А-3.
	ЗаписьXML_SA1 = Новый ЗаписьXML;
	
	Если НЕ Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		
		ЗаписьXML_SA1.ОткрытьФайл(Строка(Объект.а3_КаталогВыгрузкиSA1_simp + "\" + Объект.а3_ИмяФайлаSA1_simp + ".xml"), "UTF-8");
	Иначе
		
		ЗаписьXML_SA1.ОткрытьФайл(Строка(Объект.а3_КаталогВыгрузкиSA1_full + "\" + Объект.а3_ИмяФайлаSA1_full + ".xml"), "UTF-8");
	КонецЕсли;	
	
	ЗаписьXML_SA1.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("A3_SK_XML");
	
	ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("A3_SK_Header");
	ЗаписьXML_SA1.ЗаписатьАтрибут("SK_ID","1234");
	ЗаписьXML_SA1.ЗаписатьАтрибут("ExchDate",Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	ЗаписьXML_SA1.ЗаписатьАтрибут("ExchType","SA");
	
	ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Accounts");
	
	НомерСтроки = 0;
	
	// Выгрузка файла SL1 в А-3.
	ЗаписьXML_SL1 = Новый ЗаписьXML;
	
	Если НЕ Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		
		ЗаписьXML_SL1.ОткрытьФайл(Строка(Объект.а3_КаталогВыгрузкиSL1_simp + "\" + Объект.а3_ИмяФайлаSL1_simp + ".xml"), "UTF-8");
	Иначе
		
		ЗаписьXML_SL1.ОткрытьФайл(Строка(Объект.а3_КаталогВыгрузкиSL1_full + "\" + Объект.а3_ИмяФайлаSL1_full + ".xml"), "UTF-8");
	КонецЕсли;	
	
	ЗаписьXML_SL1.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("A3_SK_XML");
	
	ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("A3_SK_Header");
	ЗаписьXML_SL1.ЗаписатьАтрибут("SK_ID","1234");
	ЗаписьXML_SL1.ЗаписатьАтрибут("ExchDate",Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	ЗаписьXML_SL1.ЗаписатьАтрибут("ExchType","SL");
	
	ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("Bills");
	
	ПредЛС = Неопределено;
	ПредУслуга = Неопределено;
	ПредСчетчик = Неопределено;
	
	КонечноеСальдоСУчетомПени = 0;
	КонечноеСальдо = 0;
	КонечноеСальдоПени = 0;
	
	Пока ВыборкаОбщ.Следующий() Цикл
		
		Выборка = ВыборкаОбщ.Выбрать();
		
		Итого = 0;
		
		Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
			
			Если СтрокаТаблицы.Использовать И СтрокаТаблицы.ИспользоватьВИтогах Тогда
				Попытка
					Итого = Итого + ВыборкаОбщ[СтрокаТаблицы.ИмяПоля];
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """+ СтрокаТаблицы.ИмяПоля+ """ не может учавствовать в итогах.");
				КонецПопытки;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		КоличествоПолей = НастройкаПолейСтрокиРеестраСальдо.Количество() - 1;
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = "";
			
			СимволРазделения = сг_СимволРазделения;
			
			Для каждого СтрокаТаблицы Из НастройкаПолейСтрокиРеестраСальдо Цикл
				
				Индекс = НастройкаПолейСтрокиРеестраСальдо.Индекс(СтрокаТаблицы);
				
				ПоследСтрока = (Индекс = КоличествоПолей);
				
				ЛицевойСчет = "";
				
				Если СтрокаТаблицы.Использовать И НЕ ПустаяСтрока(СтрокаТаблицы.ИмяПоля) Тогда
					
					// Поле лицевого счета заполняется по настройке либо наименованием либо идентификатором.
					Если СтрокаТаблицы.ИмяПоля = "ЛицевойСчет" Тогда
						
						ЛицевойСчет = СокрЛП(Выборка.НаименованиеЛС);
						
						НоваяСтрока  = НоваяСтрока + ЛицевойСчет;
						
						
						Если НЕ Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
							
							НомерСтроки = НомерСтроки + 1;	
							
							Если НЕ ЛицевойСчет = ПредЛС Тогда
								
								ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("Bill");
								
								СтрокаСумма = Строка(Формат(Окр(Макс(Выборка[ИмяПоляSaldoOut] + Выборка[ИмяПоляSaldoOutP],-(Выборка[ИмяПоляSaldoOut] + Выборка[ИмяПоляSaldoOutP]))*100,0),"ЧДЦ=0"));
								
								СтрокаСумма = бит_ОбщегоНазначения.УбитьЛишнее(СтрокаСумма);
								
								ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(Выборка.ЛицевойСчет.Идентификатор);
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("ID",ЛицевойСчетИдентификатор + Стрзаменить(Строка(Формат(Объект.сг_КонецПериода, "ДФ=dd.MM.yyyy")), ".", "") + СтрокаСумма);
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("AccountID",ЛицевойСчет);
								ЗаписьXML_SL1.ЗаписатьАтрибут("Type","0");                                                       
								ЗаписьXML_SL1.ЗаписатьАтрибут("Value",СтрЗаменить(УбитьЛишнее(Строка(Выборка[ИмяПоляValue])),",","."));        
								ЗаписьXML_SL1.ЗаписатьАтрибут("SaldoOut",СтрЗаменить(УбитьЛишнее(Строка(Выборка[ИмяПоляSaldoOut])),",","."));
								ЗаписьXML_SL1.ЗаписатьАтрибут("SaldoOutP",СтрЗаменить(УбитьЛишнее(Строка(Выборка[ИмяПоляSaldoOutP])),",","."));
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("Date",Строка(Формат(Объект.сг_КонецПериода, "ДФ=dd.MM.yyyy")));
								ЗаписьXML_SL1.ЗаписатьАтрибут("Comment",Строка("Счет за " + Строка(Формат(Объект.сг_НачалоПериода, "ДФ=MM.yyyy")) ));
								
								ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Bill.
								
								НомерСтроки = 1;	
								
								Если НЕ ПредЛС = Неопределено Тогда
									ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counters.
									ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Account.
								КонецЕсли;
								ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Account");
								ЗаписьXML_SA1.ЗаписатьАтрибут("AccountID",Строка(ЛицевойСчет));
								
								Если Выборка.ЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 Тогда
									
									Отбор = Новый Структура;
									Отбор.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
									НайденныеСтроки = Выборка.ЛицевойСчет.Здание.КонтактнаяИнформация.НайтиСтроки(Отбор);
									ПочтовыйАдресЗдания = НайденныеСтроки[0].Представление;
									
								КонецЕсли;
								
								ЗаписьXML_SA1.ЗаписатьАтрибут("Address",Строка(ПочтовыйАдресЗдания + " кв. " + Выборка.ЛицевойСчет.Квартира));  
								
								Отбор = Новый Структура;
								Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет);
								НайденныеСтроки = ТЗСкопированная.НайтиСтроки(Отбор);	
								ЗаписьXML_SA1.ЗаписатьАтрибут("Balance",СтрЗаменить(УбитьЛишнее(Строка(НайденныеСтроки[0][ИмяПоляBalance])),",","."));        
								
								Если Не ЗначениеЗаполнено(Выборка.Счетчик) Тогда
									ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counters");
									ПредЛС = ЛицевойСчет;
									
									Продолжить;
								КонецЕсли;	
								
								ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counters");
								
								Если Выборка.Многотарифный = Истина Тогда
									
									ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counter");
									
									ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(Выборка.ЛицевойСчет.Идентификатор);
									
									ЗаписьXML_SA1.ЗаписатьАтрибут("CounterID",Строка(ЛицевойСчетИдентификатор + Строка(Выборка.УслугаСчетчика.Код) + Строка(Выборка.Счетчик.Код)));
									ЗаписьXML_SA1.ЗаписатьАтрибут("Text",Строка(Выборка.УслугаСчетчика)+ " " + Строка(Выборка.Счетчик));
									ЗаписьXML_SA1.ЗаписатьАтрибут("NumDigit","13");
									ЗаписьXML_SA1.ЗаписатьАтрибут("Type",Строка(НомерСтроки));
									
									Показания = СтрЗаменить(УбитьЛишнее(Строка(Выборка.ОтПоказаний)),",",".");
									
									Если Найти(Показания,".") > 0 Тогда
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
										
									Иначе
										
										Показания = СтрЗаменить(Показания,Показания,Показания + ".00");
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
									КонецЕсли;
									
									ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counter.
									
									ПредСчетчик = Выборка.Счетчик;
									
								Иначе
									
									Если НЕ ПредСчетчик = Выборка.Счетчик Тогда
										
										ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counter");
										
										ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(Выборка.ЛицевойСчет.Идентификатор);
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("CounterID",Строка(ЛицевойСчетИдентификатор + Строка(Выборка.УслугаСчетчика.Код) + Строка(Выборка.Счетчик.Код)));
										ЗаписьXML_SA1.ЗаписатьАтрибут("Text",Строка(Выборка.УслугаСчетчика)+ " " + Строка(Выборка.Счетчик));
										ЗаписьXML_SA1.ЗаписатьАтрибут("NumDigit","13");
										ЗаписьXML_SA1.ЗаписатьАтрибут("Type",Строка(НомерСтроки));
										
										Показания = СтрЗаменить(УбитьЛишнее(Строка(Выборка.ОтПоказаний)),",",".");
										
										Если Найти(Показания,".") > 0 Тогда
											
											ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
											
										Иначе
											
											Показания = СтрЗаменить(Показания,Показания,Показания + ".00");
											
											ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
										КонецЕсли;
										
										ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counter.
										
									КонецЕсли;
									
									ПредСчетчик = Выборка.Счетчик;
								КонецЕсли;
								
								ПредЛС = ЛицевойСчет;
								
							Иначе
								Если Не ЗначениеЗаполнено(Выборка.Счетчик) Тогда
									ПредЛС = ЛицевойСчет;
									Продолжить;
								КонецЕсли;	
								
								Если Выборка.Многотарифный = Истина Тогда
									
									ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counter");
									
									ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(Выборка.ЛицевойСчет.Идентификатор);
									
									ЗаписьXML_SA1.ЗаписатьАтрибут("CounterID",Строка(ЛицевойСчетИдентификатор + Строка(Выборка.УслугаСчетчика.Код) + Строка(Выборка.Счетчик.Код)));
									ЗаписьXML_SA1.ЗаписатьАтрибут("Text",Строка(Выборка.УслугаСчетчика)+ " " + Строка(Выборка.Счетчик));
									ЗаписьXML_SA1.ЗаписатьАтрибут("NumDigit","13");
									ЗаписьXML_SA1.ЗаписатьАтрибут("Type",Строка(НомерСтроки));
									
									Показания = СтрЗаменить(УбитьЛишнее(Строка(Выборка.ОтПоказаний)),",",".");
									
									Если Найти(Показания,".") > 0 Тогда
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
										
									Иначе
										
										Показания = СтрЗаменить(Показания,Показания,Показания + ".00");
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
									КонецЕсли;
									
									ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counter.
									ПредСчетчик = Выборка.Счетчик;
								Иначе
									
									Если НЕ ПредСчетчик = Выборка.Счетчик Тогда
										
										ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counter");
										
										ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(Выборка.ЛицевойСчет.Идентификатор);
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("CounterID",Строка(ЛицевойСчетИдентификатор + Строка(Выборка.УслугаСчетчика.Код) + Строка(Выборка.Счетчик.Код)));
										ЗаписьXML_SA1.ЗаписатьАтрибут("Text",Строка(Выборка.УслугаСчетчика)+ " " + Строка(Выборка.Счетчик));
										ЗаписьXML_SA1.ЗаписатьАтрибут("NumDigit","13");
										ЗаписьXML_SA1.ЗаписатьАтрибут("Type",Строка(НомерСтроки));
										
										Показания = СтрЗаменить(УбитьЛишнее(Строка(Выборка.ОтПоказаний)),",",".");
										
										Если Найти(Показания,".") > 0 Тогда
											
											ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
											
										Иначе
											
											Показания = СтрЗаменить(Показания,Показания,Показания + ".00");
											
											ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
										КонецЕсли;
										
										ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counter.
										
									Иначе
										
										НомерСтроки = НомерСтроки - 1;	
										
									КонецЕсли;
									
									ПредСчетчик = Выборка.Счетчик;
									
								КонецЕсли;
								
								ПредЛС = ЛицевойСчет;
								
							КонецЕсли;
							
							
						Иначе
							
							Если НЕ ЛицевойСчет = ПредЛС Тогда
								
								Если НЕ ПредЛС = Неопределено Тогда
									
									ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Services.
									ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Bill.
									
								КонецЕсли;
								ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("Bill");
								
								СтрокаСумма = Строка(Формат(Окр(Макс(Выборка.КонечноеСальдоСУчетомПени,-Выборка.КонечноеСальдоСУчетомПени)*100,0),"ЧДЦ=0"));
								
								СтрокаСумма = бит_ОбщегоНазначения.УбитьЛишнее(СтрокаСумма);
								
								ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(Выборка.ЛицевойСчет.Идентификатор);
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("ID",Стрзаменить(ЛицевойСчетИдентификатор + Строка(Формат(Объект.сг_КонецПериода, "ДФ=dd.MM.yyyy")), ".", "") + СтрокаСумма);
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("AccountID",ЛицевойСчет);
								ЗаписьXML_SL1.ЗаписатьАтрибут("Type","0");       
								
								Отбор = Новый Структура;
								Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет);
								НайденныеСтроки = ТЗСкопированнаяУс.НайтиСтроки(Отбор);
								
								Value = 0;
								Индекс = -1;
								Для каждого строка из НайденныеСтроки цикл
									Индекс = Индекс+1;	
									Value = Value + НайденныеСтроки[Индекс][ИмяПоляValue];
								КонецЦикла;
								Индекс = 0;
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("Value",СтрЗаменить(УбитьЛишнее(Строка(Value)),",","."));
								
								SaldoOut = 0;
								Индекс = -1;
								Для каждого строка из НайденныеСтроки цикл
									Индекс = Индекс+1;	
									SaldoOut = SaldoOut + НайденныеСтроки[Индекс][ИмяПоляSaldoOut];
								КонецЦикла;
								Индекс = 0;
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("SaldoOut",СтрЗаменить(УбитьЛишнее(Строка(SaldoOut)),",","."));
								
								SaldoOutP = 0;
								Индекс = -1;
								Для каждого строка из НайденныеСтроки цикл
									Индекс = Индекс+1;	
									SaldoOutP = SaldoOutP + НайденныеСтроки[Индекс][ИмяПоляSaldoOutP];
								КонецЦикла;
								Индекс = 0;
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("SaldoOutP",СтрЗаменить(УбитьЛишнее(Строка(SaldoOutP)),",","."));
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("Date",Строка(Формат(Объект.сг_КонецПериода, "ДФ=dd.MM.yyyy")));
								ЗаписьXML_SL1.ЗаписатьАтрибут("Comment",Строка("Счет за " + Строка(Формат(Объект.сг_НачалоПериода, "ДФ=MM.yyyy")) ));
								
								ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("Services");
								
								ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("Service");
								
								ЗаписьXML_SL1.ЗаписатьАтрибут("Name",Строка(Выборка.Услуга));
								ЗаписьXML_SL1.ЗаписатьАтрибут("Number",Строка(Выборка.Услуга.Код));
								
								Отбор = Новый Структура;
								Отбор.Вставить("Порядок","Value");
								НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
								
								Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
									
									ИмяПоля = НайденныеСтрокиРеестра[0].ИмяПоля;
									
								КонецЕсли;	
								
								СуммаНачислений = СтрЗаменить(УбитьЛишнее(Строка(Выборка[ИмяПоля])),",",".");
								
								Если Найти(СуммаНачислений,".") > 0 Тогда
									
									ЗаписьXML_SL1.ЗаписатьАтрибут("ValueS",СуммаНачислений);
									
								Иначе
									
									Показания = СтрЗаменить(СуммаНачислений,СуммаНачислений,СуммаНачислений + ".00");
									
									ЗаписьXML_SL1.ЗаписатьАтрибут("ValueS",СуммаНачислений);
								КонецЕсли;
								
								ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Service.
								
								
								НомерСтроки = 0;	
								
								Если НЕ ПредЛС = Неопределено Тогда
									ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Account.
								КонецЕсли;
								ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Account");
								ЗаписьXML_SA1.ЗаписатьАтрибут("AccountID",Строка(ЛицевойСчет));
								
								Если Выборка.ЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 Тогда
									
									Отбор = Новый Структура;
									Отбор.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания);
									НайденныеСтроки = Выборка.ЛицевойСчет.Здание.КонтактнаяИнформация.НайтиСтроки(Отбор);
									ПочтовыйАдресЗдания = НайденныеСтроки[0].Представление;
									
								КонецЕсли;
								
								ЗаписьXML_SA1.ЗаписатьАтрибут("Address",Строка(ПочтовыйАдресЗдания + " кв. " + Выборка.ЛицевойСчет.Квартира));                                                       
								
								Отбор = Новый Структура;
								Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет);
								НайденныеСтроки = ТЗСкопированнаяУс.НайтиСтроки(Отбор);	
								
								Balance = 0;
								Индекс = -1;
								Для каждого строка из НайденныеСтроки цикл
									Индекс = Индекс+1;	
									Balance = Balance + (НайденныеСтроки[Индекс][ИмяПоляBalance]);
								КонецЦикла;
								Индекс = 0;
								
								ЗаписьXML_SA1.ЗаписатьАтрибут("Balance",СтрЗаменить(УбитьЛишнее(Строка(Balance)),",","."));        
								
								НайденныеСтрокиУс = ТЗСкопированнаяУс.НайтиСтроки(Отбор);	
								
								ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Services");
								
								Для Каждого Строка из НайденныеСтрокиУс Цикл
									
									ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Service");
									
									
									ЗаписьXML_SA1.ЗаписатьАтрибут("Name",Строка(Строка.Услуга));
									ЗаписьXML_SA1.ЗаписатьАтрибут("Number",Строка(Строка.Услуга.Код));
									
									Отбор = Новый Структура;
									Отбор.Вставить("Порядок","Value");
									НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
									
									Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
										
										ИмяПоля = НайденныеСтрокиРеестра[0].ИмяПоля;
										
									КонецЕсли;	
									
									
									СуммаНачислений = СтрЗаменить(УбитьЛишнее(Строка(Строка[ИмяПоля])),",",".");
									
									Если Найти(СуммаНачислений,".") > 0 Тогда
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("ValueS",СуммаНачислений);
										
									Иначе
										
										Показания = СтрЗаменить(СуммаНачислений,СуммаНачислений,СуммаНачислений + ".00");
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("ValueS",СуммаНачислений);
									КонецЕсли;
									
									ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Service.
									
								КонецЦикла;
								
								ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Services.
								
								ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counters");
								
								
								Отбор = Новый Структура;
								Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет);
								НайденныеСтрокиСч = ТЗСкопированнаяСчетчики.НайтиСтроки(Отбор);	
								
								СписокДобавленных = Новый СписокЗначений;
								
								Для Каждого Строка из НайденныеСтрокиСч Цикл
									
									Если НЕ ЗначениеЗаполнено(Строка.Счетчик) Тогда
										
										Продолжить;
										
									КонецЕсли;	
									
									НомерСтроки = НомерСтроки + 1;	
									
									Если Строка.Многотарифный = Истина Тогда
										
										ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counter");
										
										ЗаписьXML_SA1.ЗаписатьАтрибут("CounterID",Строка(Лев(Выборка.ЛицевойСчет.Идентификатор,3) + Прав(Выборка.ЛицевойСчет.Идентификатор,3)) + Строка(Строка.УслугаСчетчика.Код) + Строка(Строка.Счетчик.Код));
										ЗаписьXML_SA1.ЗаписатьАтрибут("Text",Строка(Строка.УслугаСчетчика)+ " " + Строка(Строка.Счетчик));
										ЗаписьXML_SA1.ЗаписатьАтрибут("NumDigit","13");
										ЗаписьXML_SA1.ЗаписатьАтрибут("Type",Строка(НомерСтроки));
										
										Показания = СтрЗаменить(УбитьЛишнее(Строка(Строка.ОтПоказаний)),",",".");
										
										Если Найти(Показания,".") > 0 Тогда
											
											ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
											
										Иначе
											
											Показания = СтрЗаменить(Показания,Показания,Показания + ".00");
											
											ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
										КонецЕсли;
										
										ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counter.
										
										ПредСчетчик = Строка.Счетчик;
									Иначе
										
										Если НЕ ПредСчетчик = Строка.Счетчик Тогда
											
											Если НЕ СписокДобавленных.НайтиПоЗначению(Строка.Счетчик) = Неопределено Тогда
												Продолжить;
											КонецЕсли;
											
											ЗаписьXML_SA1.ЗаписатьНачалоЭлемента("Counter");
											
											ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(Строка.ЛицевойСчет.Идентификатор);
											
											ЗаписьXML_SA1.ЗаписатьАтрибут("CounterID",Строка(ЛицевойСчетИдентификатор + Строка(Строка.УслугаСчетчика.Код) + Строка(Строка.Счетчик.Код)));
											ЗаписьXML_SA1.ЗаписатьАтрибут("Text",Строка(Строка.УслугаСчетчика)+ " " + Строка(Строка.Счетчик));
											ЗаписьXML_SA1.ЗаписатьАтрибут("NumDigit","13");
											ЗаписьXML_SA1.ЗаписатьАтрибут("Type",Строка(НомерСтроки));
											
											Показания = СтрЗаменить(УбитьЛишнее(Строка(Строка.ОтПоказаний)),",",".");
											
											Если Найти(Показания,".") > 0 Тогда
												
												ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
												
											Иначе
												
												Показания = СтрЗаменить(Показания,Показания,Показания + ".00");
												
												ЗаписьXML_SA1.ЗаписатьАтрибут("PrevValue",Показания);
											КонецЕсли;
											
											ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counter.
											
											СписокДобавленных.Добавить(Строка.Счетчик);
											
										Иначе
											
											НомерСтроки = НомерСтроки - 1;	
											
										КонецЕсли;
										
										ПредСчетчик = Строка.Счетчик;
										
									КонецЕсли;
									
								КонецЦикла;
								
								ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counters.
								
								ПредЛС = ЛицевойСчет;
							Иначе
								
								Если НЕ ПредУслуга = Выборка.Услуга Тогда
									
									ЗаписьXML_SL1.ЗаписатьНачалоЭлемента("Service");
									
									ЗаписьXML_SL1.ЗаписатьАтрибут("Name",Строка(Выборка.Услуга));
									ЗаписьXML_SL1.ЗаписатьАтрибут("Number",Строка(Выборка.Услуга.Код));
									
									Отбор = Новый Структура;
									Отбор.Вставить("Порядок","Value");
									НайденныеСтрокиРеестра = НастройкаПолейСтрокиРеестраСальдо.НайтиСтроки(Отбор);
									
									Если НайденныеСтрокиРеестра.Количество() > 0 Тогда
										
										ИмяПоля = НайденныеСтрокиРеестра[0].ИмяПоля;
										
									КонецЕсли;	
									
									СуммаНачислений = СтрЗаменить(УбитьЛишнее(Строка(Выборка[ИмяПоля])),",",".");
									
									Если Найти(СуммаНачислений,".") > 0 Тогда
										
										ЗаписьXML_SL1.ЗаписатьАтрибут("ValueS",СуммаНачислений);
										
									Иначе
										
										Показания = СтрЗаменить(СуммаНачислений,СуммаНачислений,СуммаНачислений + ".00");
										
										ЗаписьXML_SL1.ЗаписатьАтрибут("ValueS",СуммаНачислений);
									КонецЕсли;
									
									ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Service.
									
									ПредЛС = ЛицевойСчет;
									ПредУслуга = Выборка.Услуга;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;	
				Иначе
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла; 
	КонецЦикла;
	
	Если НЕ Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		
		ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Counters.
		
	КонецЕсли;
	
	ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Account.
	ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // Accounts.
	ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // A3_SK_Header.
	ЗаписьXML_SA1.ЗаписатьКонецЭлемента(); // A3_SK_XML.
	ЗаписьXML_SA1.Закрыть();
	
	Если Объект.ВыводИнформации = "С разбивкой по услугам" Тогда
		ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Services.
		ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Bill.
	КонецЕсли;
	
	ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // Bills.
	ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // A3_SK_Header.
	ЗаписьXML_SL1.ЗаписатьКонецЭлемента(); // A3_SK_XML.
	ЗаписьXML_SL1.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция УбитьЛишнее(ИсходнаяСтрока)
	
	ИнтересныйСимвол = Символ(160); 
	
	Результат =  СтрЗаменить(ИсходнаяСтрока,ИнтересныйСимвол,"");
	
	Результат =  СтрЗаменить(Результат," ","");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Запаковать7Z(ИмяФайлаSA1,ПутьКФайлуSA1,ПутьКФайлуSA17z,ИмяФайлаSL1,ПутьКФайлуSL1,ПутьКФайлуSL17z)
	
	#Если Не ВебКлиент Тогда
		
	ФайлSA1 = """"+""""+Объект.ПутьКАрхиватору7z+"\"+"7z.exe"+""""+" a -t7z """ + ПутьКФайлуSA17z+""""+" "+""""+ПутьКФайлуSA1+""""+" -mx=9"+"""";	
	
	Попытка
		КомандаСистемы(ФайлSA1);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Архив файла " + ИмяФайлаSA1 + ".7z сохранен." ;
		Сообщение.Сообщить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	ФайлSL1 = """"+""""+Объект.ПутьКАрхиватору7z+"\"+"7z.exe"+""""+" a -t7z """ + ПутьКФайлуSL17z+""""+" "+""""+ПутьКФайлуSL1+""""+" -mx=9"+"""";	
	
	Попытка
		КомандаСистемы(ФайлSL1);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Архив файла " + ИмяФайлаSL1 + ".7z сохранен." ;
		Сообщение.Сообщить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура сгПрочитатьФайл(МассивОшибок, ТекстФайл, Отказ)
	
	КоличествоСтрок = ТекстФайл.КоличествоСтрок();
	
	ИсправленныйТекстФайл = Новый ТекстовыйДокумент;
	
	Для Значение=1 По КоличествоСтрок Цикл
		
		Строка = ТекстФайл.ПолучитьСтроку(Значение);
		
		Если Найти(Строка,">") > 0 Тогда
			
			ИсправленнаяСтрока = Лев(Строка,Найти(Строка,">"));
			ИсправленныйТекстФайл.ДобавитьСтроку(ИсправленнаяСтрока);
			
			ОсталосьИсправить = Сред(Строка,Найти(Строка,">")+1,СтрДлина(Строка));	
			
			Пока ЗначениеЗаполнено(ОсталосьИсправить) Цикл
				
				ИсправленнаяСтрока = Лев(ОсталосьИсправить,Найти(ОсталосьИсправить,">"));
				ИсправленныйТекстФайл.ДобавитьСтроку(ИсправленнаяСтрока);
				
				ОсталосьИсправить = Сред(ОсталосьИсправить,СтрДлина(ИсправленнаяСтрока)+1,СтрДлина(ОсталосьИсправить));	
				
			КонецЦикла;	
			
		КонецЕсли;		
		
	КонецЦикла;
	
	КоличествоСтрок = ИсправленныйТекстФайл.КоличествоСтрок();
	
	Если КоличествоСтрок = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Файл пуст!");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		ТаблицаОплаты = Новый ТаблицаЗначений;
		ТаблицаОплаты.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
		ТаблицаОплаты.Колонки.Добавить("Услуга"     , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
		ТаблицаОплаты.Колонки.Добавить("Сумма"      , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТаблицаОплаты.Колонки.Добавить("СуммаСУчетомПроцента", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТаблицаОплаты.Колонки.Добавить("ДатаОплаты" , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
		
		ТаблицаУслуг.Очистить();
		ТаблицаВводПоказанийСчетчиков.Очистить();
		
		ТаблицаВводПоказаний =ДанныеФормыВЗначение(ТаблицаВводПоказанийСчетчиков,Тип("ТаблицаЗначений"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
		
		Номер = 0;
		СуммаКПеречислению = 0;
		НомерРеестра = 0;
		
		Для Значение=1 По КоличествоСтрок Цикл
			
			Строка = ИсправленныйТекстФайл.ПолучитьСтроку(Значение);
			
			Если Найти(Строка,"AccountID=") > 0 Тогда
				
				НачалоЛС = Найти(Строка,"AccountID=") + 11;	
				КонецЛС = Найти(Строка,"Type=") - 2;	
				РазницаЛС = КонецЛС - НачалоЛС;
				
				ЛС = Сред(Строка,НачалоЛС,РазницаЛС);
				
				НачалоСумма = Найти(Строка,"Value=") + 7;	
				КонецСумма = Найти(Строка,"ValueP=") - 2;	
				РазницаСумма = КонецСумма - НачалоСумма;
				
				Сумма = Сред(Строка,НачалоСумма,РазницаСумма);
				
				НачалоДата = Найти(Строка,"DateTime=") + 10;	
				КонецДата = Найти(Строка,">") - 1;	
				РазницаДата = КонецДата - НачалоДата;
				
				Дата = Сред(Строка,НачалоДата,РазницаДата);
				
			Иначе
				
				Если Найти(Строка,"CounterID=") > 0 Тогда
					
					НачалоСчетчик = Найти(Строка,"CounterID=") + 11;	
					КонецСчетчик = Найти(Строка,"CounterValue=") - 2;	
					РазницаСчетчик = КонецСчетчик - НачалоСчетчик;
					
					СчетчикИзФайла = Сред(Строка,НачалоСчетчик,РазницаСчетчик);
					
					
					ЛицевойСчет = Неопределено;
					
					ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(ЛС, Истина);
					
					ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(ЛицевойСчет.Идентификатор);
					
					Счетчик = Прав(СчетчикИзФайла,9); 
					Счетчик = Справочники.бит_Счетчики.НайтиПоКоду(Счетчик, Истина);
					
					Услуга = Лев(Прав(СчетчикИзФайла,18),9);
					
					УслугаСчетчика = Справочники.бит_УслугиЖКХ.НайтиПоКоду(Услуга, Истина);
					
					
					КолСимволов = стрдлина(строка);	
					
					НачалоТекущииеПоказания = Найти(Строка,"CounterValue=") + 13;
					
					ОтрезатьСлева = КолСимволов - НачалоТекущииеПоказания;
					
					НовСтрока = Прав(Строка,ОтрезатьСлева);	
					
					Кавычка = сг_ВспомогательныйСимвол;
					Кавычки = Найти(НовСтрока,Кавычка);
					
					ТекущииеПоказания = Лев(НовСтрока,Кавычки-1);
					
					НоваяСтрокаВводПоказаний = ТаблицаВводПоказаний.Добавить();
					
					НоваяСтрокаВводПоказаний.ЛицевойСчет = ЛицевойСчет;
					НоваяСтрокаВводПоказаний.Дата = Дата;					
					Счетчик = Справочники.бит_Счетчики.НайтиПоНаименованию(Счетчик, Истина);
					НоваяСтрокаВводПоказаний.Счетчик = Счетчик;
					НоваяСтрокаВводПоказаний.УслугаСчетчика = УслугаСчетчика;
					
					НоваяСтрокаВводПоказаний.ТекущиеПоказания = ТекущииеПоказания;
				Иначе
					
					Если Найти(Строка,"Service Number=") > 0 Тогда
						
						НачалоУслуга = Найти(Строка,"Service Number=") + 16;	
						КонецУслуга = Найти(Строка,"ValueS=") - 2;	
						РазницаУслуга = КонецУслуга - НачалоУслуга;
						
						УслугаИзФайла = Сред(Строка,НачалоУслуга,РазницаУслуга);
						
						Услуга = Неопределено;
						
						Услуга = Справочники.бит_УслугиЖКХ.НайтиПоКоду(УслугаИзФайла, Истина);
						
						НачалоСумма = Найти(Строка,"ValueS=") + 8;
						
						Если Найти(Строка," />") > 0 Тогда
							КонецСумма = Найти(Строка,">") - 3;	
						Иначе
							КонецСумма = Найти(Строка,">") - 2;	
						КонецЕсли;	
						
						РазницаСумма = КонецСумма - НачалоСумма;
						
						СуммаИзФайла = Сред(Строка,НачалоСумма,РазницаСумма);
						
						НоваяСтрокаТаблицаУслуг = ТаблицаУслуг.Добавить();
						
						НоваяСтрокаТаблицаУслуг.ЛицевойСчет = ЛицевойСчет;
						
						НоваяСтрокаТаблицаУслуг.Услуга = Услуга;
						НоваяСтрокаТаблицаУслуг.Сумма = число(СуммаИзФайла);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаОплаты.Добавить();
			
			ДлиннаСтроки = СтрДлина(Строка);
			
			Пока ДлиннаСтроки > 0 Цикл
				
				ЛицевойСчет = Неопределено;
				
				ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(ЛС, Истина);
				
				Если ЛицевойСчет.Пустая() Тогда
					
					Попытка
						Идентификатор =	 Число(ЛС);
					Исключение
						Возврат;
					КонецПопытки;
					
					Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
					
					Выборка = Запрос.Выполнить().Выбрать();
					
					Если Выборка.Следующий() Тогда
						
						ЛицевойСчет = Выборка.ЛицевойСчет;
						
					КонецЕсли;
					
				КонецЕсли; 
				
				НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
				
				Попытка
					НоваяСтрока.Сумма                = Число(Сумма);
					НоваяСтрока.СуммаСУчетомПроцента = Число(Сумма);
				Исключение
				КонецПопытки; 
				
				ДлиннаСтроки = 0;
				
				Попытка
					
					Дата = Дата("20"+Сред(Дата,9,2)+Сред(Дата,4,2)+Сред(Дата,0,2));
					
					
					НоваяСтрока.ДатаОплаты = Дата;
					
				Исключение
				КонецПопытки;
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		ЗначениеВДанныеФормы(ТаблицаВводПоказаний,ТаблицаВводПоказанийСчетчиков);
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.ЛицевойСчет,
		|	Таблица.Услуга,
		|	Таблица.Сумма,
		|	Таблица.ДатаОплаты,
		|	Таблица.СуммаСУчетомПроцента
		|ПОМЕСТИТЬ ТаблицаОплаты
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОплаты.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаОплаты.Услуга КАК Услуга,
		|	СУММА(ТаблицаОплаты.Сумма) КАК Сумма,
		|	ТаблицаОплаты.ДатаОплаты КАК ДатаОплаты,
		|	СУММА(ТаблицаОплаты.СуммаСУчетомПроцента) КАК СуммаСУчетомПроцента
		|ИЗ
		|	ТаблицаОплаты КАК ТаблицаОплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОплаты.ЛицевойСчет,
		|	ТаблицаОплаты.Услуга,
		|	ТаблицаОплаты.ДатаОплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОплаты,
		|	ЛицевойСчет,
		|	Услуга
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаСУчетомПроцента)
		|ПО
		|	ДатаОплаты,
		|	ЛицевойСчет";
		Запрос.УстановитьПараметр("Таблица", ТаблицаОплаты);
		
		ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Корень = ДеревоОплаты.ПолучитьЭлементы();
		Корень.Очистить();
		
		НеУказаноДат = 0;
		
		Пока ВыборкаДата.Следующий() Цикл
			
			СтрокаДерева = Корень.Добавить();
			СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаДата.ДатаОплаты;
			СтрокаДерева.Сумма                         = ВыборкаДата.Сумма;
			
			Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
				НеУказаноДат = НеУказаноДат + 1;
			КонецЕсли; 
			
			ВыборкаЛС = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ВторойУровень = СтрокаДерева.ПолучитьЭлементы();
			
			ИтогПоДокументу      = ВыборкаДата.Сумма;
			СуммаИтогПоДокументу = 0;
			
			МассивЛС = Новый Массив;
			
			НеНайденоЛС = 0;
			
			Пока ВыборкаЛС.Следующий() Цикл
				
				СтрокаВеткиДерева = ВторойУровень.Добавить();
				
				СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаЛС.ЛицевойСчет;
				СтрокаВеткиДерева.Сумма                         = ВыборкаЛС.Сумма;
				
				СтрокаВеткиДерева.СуммаСУчетомПроцента          = ВыборкаЛС.СуммаСУчетомПроцента;
				
				СтрокаДерева.СуммаСУчетомПроцента          = ВыборкаДата.СуммаСУчетомПроцента;
				
				СтруктураОплаты = НайтиДокументОплаты(ВыборкаДата.ДатаОплаты,НомерРеестра,ВыборкаЛС.ЛицевойСчет,ВыборкаЛС.Сумма);
				Если СтруктураОплаты.Свойство("Ссылка") Тогда
					СтрокаДерева.ДокументОплаты = СтруктураОплаты.Ссылка;
				КонецЕсли;
				
				СтруктураВводПоказаний = НайтиДокументВводПоказаний(ВыборкаЛС.ЛицевойСчет);
				Если СтруктураВводПоказаний.Свойство("Ссылка") Тогда
					СтрокаВеткиДерева.ВводПоказаний = СтруктураВводПоказаний.Ссылка;
				КонецЕсли;
				
				Если СтруктураОплаты.Свойство("ИсточникОплаты") Тогда
					СтрокаДерева.ИсточникОплаты = СтруктураОплаты.ИсточникОплаты;
				КонецЕсли;
				
				ИтокСуммаЛС = ВыборкаЛС.Сумма;
				ИтогПоЛС    = 0;
				
				ТретийУровень =  СтрокаВеткиДерева.ПолучитьЭлементы();
				Выборка = ВыборкаЛС.Выбрать();
				УслугВДОкументе = 0;
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.Услуга.Пустая() И Выборка.Количество() = 1 Тогда
						
						Отбор = Новый Структура;
						Отбор.Вставить("ЛицевойСчет",СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга);
						НайденныеСтрокиУслуг = ТаблицаУслуг.НайтиСтроки(Отбор);
						
						для каждого строка из НайденныеСтрокиУслуг цикл	
							
							Если не строка.Сумма = 0 Тогда
								СтрокаВеткиДерева2 = ТретийУровень.Добавить();
								СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга = строка.Услуга;
								СтрокаВеткиДерева2.Сумма                         = строка.Сумма;
								
								СтрокаВеткиДерева2.СуммаСУчетомПроцента          = строка.Сумма;
								
								Если ЗначениеЗаполнено(СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
									ИтогПоЛС = ИтогПоЛС + строка.Сумма;
									УслугВДОкументе = УслугВДОкументе + 1;
								КонецЕсли; 
							КонецЕсли; 
							
						КонецЦикла;	
						
					Иначе
						СтрокаВеткиДерева2 = ТретийУровень.Добавить();
						СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга = Выборка.Услуга;
						СтрокаВеткиДерева2.Сумма                         = Выборка.Сумма;
						
						СтрокаВеткиДерева2.СуммаСУчетомПроцента          = Выборка.СуммаСУчетомПроцента;
						
						Если ЗначениеЗаполнено(СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
							ИтогПоЛС = ИтогПоЛС + Выборка.Сумма;
							УслугВДОкументе = УслугВДОкументе + 1;
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла;
				
				Если УслугВДОкументе = 0 Тогда
					ИтогПоЛС = ИтогПоДокументу;
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтогПоЛС;
				Иначе
					НеНайденоЛС = НеНайденоЛС + 1;
				КонецЕсли; 
				
				Если ИтокСуммаЛС = ИтогПоЛС Тогда
					
					МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет.Наименование);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если НЕ СуммаИтогПоДокументу = ИтогПоДокументу Тогда
				
				Разница =  ИтогПоДокументу - СуммаИтогПоДокументу;
				
				Текст = "Оплаты от " + Формат(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга, "ДФ=dd.MM.yyyy") + " сумма документа("+СуммаИтогПоДокументу+") не сходится с суммой файла(" + ИтогПоДокументу + "), разница: " + Разница + ".";
				
				ТекстЛС = "Сумма не сходится по лицевым счетам: ";
				
				Если МассивЛС.Количество() > 0 Тогда
					
					Для каждого ЭлементМассива Из МассивЛС Цикл
						
						ТекстЛС = ТекстЛС + "" + ЭлементМассива + " ";
						
					КонецЦикла; 
					
					Текст = Текст + "
					|" + ТекстЛС;
					
				КонецЕсли;
				
				Если НеНайденоЛС > 0 Тогда
					
					Текст = Текст + "
					|Не найдено лицевых счетов: " + НеНайденоЛС;
					
				КонецЕсли; 
				
				МассивОшибок.Добавить(Текст);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если НеНайденоЛС > 0 Тогда
			
			МассивОшибок.Добавить("Не указанна дата у " + НеНайденоЛС + " позиций.");
			
		КонецЕсли; 
		
		Элементы.ДеревоОплаты.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		
		Корень = ДеревоОплаты.ПолучитьЭлементы();
		
		Если Корень.Количество() = 0 Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
			
			Возврат;
			
		КонецЕсли; 
		
		Если НЕ ПроверитьЗаполнение() Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		СуммаИтоИтогов = 0;
		
		Для каждого СтрокаКорня Из Корень Цикл
			
			Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
			
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ИтогПоДокументу      = СтрокаКорня.Сумма;
			СуммаИтогПоДокументу = 0;
			
			ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
			
			МассивЛС = Новый Массив;
			
			ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
			
			Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
				
				Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
					
					ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
					СуммаИтогПоЛС = 0;
					
					ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
					
					Если ТретийУровень.Количество() = 0 Тогда
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
						
					Иначе
						
						Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
							
							Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
								
								СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
								
							КонецЕсли;
							
						КонецЦикла; 
						
						Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
							
							МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
							
						КонецЕсли; 
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
						
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла; 
			СуммаИтоИтогов = СуммаИтоИтогов + СуммаИтогПоДокументу;
		КонецЦикла;
		
		Объект.ТекстИтогоДокумент = "Итого по дереву минус процент: "+Строка(СуммаИтоИтогов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура сгПрочитатьФайлБезРазбивкиПоУслугам(МассивОшибок, ТекстФайл, Отказ)
	
	КоличествоСтрок = ТекстФайл.КоличествоСтрок();
	
	ИсправленныйТекстФайл = Новый ТекстовыйДокумент;
	
	Для Значение=1 По КоличествоСтрок Цикл
		
		Строка = ТекстФайл.ПолучитьСтроку(Значение);
		
		Если Найти(Строка,">") > 0 Тогда
			
			ИсправленнаяСтрока = Лев(Строка,Найти(Строка,">"));
			ИсправленныйТекстФайл.ДобавитьСтроку(ИсправленнаяСтрока);
			
			ОсталосьИсправить = Сред(Строка,Найти(Строка,">")+1,СтрДлина(Строка));	
			
			Пока ЗначениеЗаполнено(ОсталосьИсправить) Цикл
				
				ИсправленнаяСтрока = Лев(ОсталосьИсправить,Найти(ОсталосьИсправить,">"));
				ИсправленныйТекстФайл.ДобавитьСтроку(ИсправленнаяСтрока);
				
				ОсталосьИсправить = Сред(ОсталосьИсправить,СтрДлина(ИсправленнаяСтрока)+1,СтрДлина(ОсталосьИсправить));	
				
			КонецЦикла;	
			
		КонецЕсли;		
		
	КонецЦикла;
	
	КоличествоСтрок = ИсправленныйТекстФайл.КоличествоСтрок();	
	Если КоличествоСтрок = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Файл пуст!");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		ТаблицаОплаты = Новый ТаблицаЗначений;
		ТаблицаОплаты.Колонки.Добавить("ЛицевойСчет"         , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
		ТаблицаОплаты.Колонки.Добавить("Услуга"              , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
		ТаблицаОплаты.Колонки.Добавить("Сумма"               , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТаблицаОплаты.Колонки.Добавить("СуммаСУчетомПроцента", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТаблицаОплаты.Колонки.Добавить("ДатаОплаты"          , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
		
		
		ТаблицаВводПоказанийСчетчиков.Очистить();
		
		ТаблицаВводПоказаний =ДанныеФормыВЗначение(ТаблицаВводПоказанийСчетчиков,Тип("ТаблицаЗначений"));
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Идентификатор = &Идентификатор";
		
		Номер = 0;
		СуммаКПеречислению = 0;
		НомерРеестра = 0;
		
		Для Значение=1 По КоличествоСтрок Цикл
			
			Строка = ИсправленныйТекстФайл.ПолучитьСтроку(Значение);
			
			Если Найти(Строка,"AccountID=") > 0 Тогда
				
				НачалоЛС = Найти(Строка,"AccountID=") + 11;	
				КонецЛС = Найти(Строка,"Type=") - 2;	
				РазницаЛС = КонецЛС - НачалоЛС;
				
				ЛС = Сред(Строка,НачалоЛС,РазницаЛС);
				
				НачалоСумма = Найти(Строка,"Value=") + 7;	
				КонецСумма = Найти(Строка,"ValueP=") - 2;	
				РазницаСумма = КонецСумма - НачалоСумма;
				
				Сумма = Сред(Строка,НачалоСумма,РазницаСумма);
				
				НачалоДата = Найти(Строка,"DateTime=") + 10;	
				КонецДата = Найти(Строка,">") - 1;	
				РазницаДата = КонецДата - НачалоДата;
				
				Дата = Сред(Строка,НачалоДата,РазницаДата);
				
			Иначе	
				
				Если Найти(Строка,"CounterID=") > 0 Тогда
					
					НачалоСчетчик = Найти(Строка,"CounterID=") + 11;	
					КонецСчетчик = Найти(Строка,"CounterValue=") - 2;	
					РазницаСчетчик = КонецСчетчик - НачалоСчетчик;
					
					СчетчикИзФайла = Сред(Строка,НачалоСчетчик,РазницаСчетчик);
					
					
					ЛицевойСчет = Неопределено;
					
					ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(ЛС, Истина);
					
					ЛицевойСчетИдентификатор = бит_ОбщегоНазначения.УбитьЛишнее(ЛицевойСчет.Идентификатор);
					
					Счетчик = Прав(СчетчикИзФайла,9); 
					Счетчик = Справочники.бит_Счетчики.НайтиПоКоду(Счетчик, Истина);
					
					Услуга = Лев(Прав(СчетчикИзФайла,18),9);
					
					УслугаСчетчика = Справочники.бит_УслугиЖКХ.НайтиПоКоду(Услуга, Истина);
					
					
					КолСимволов = стрдлина(строка);	
					
					НачалоТекущииеПоказания = Найти(Строка,"CounterValue=") + 13;
					
					ОтрезатьСлева = КолСимволов - НачалоТекущииеПоказания;
					
					НовСтрока = Прав(Строка,ОтрезатьСлева);	
					
					Кавычка = сг_ВспомогательныйСимвол;
					Кавычки = Найти(НовСтрока,Кавычка);
					
					ТекущииеПоказания = Лев(НовСтрока,Кавычки-1);
					
					НоваяСтрокаВводПоказаний = ТаблицаВводПоказаний.Добавить();
					
					НоваяСтрокаВводПоказаний.ЛицевойСчет = ЛицевойСчет;
					НоваяСтрокаВводПоказаний.Дата = Дата;
					Счетчик = Справочники.бит_Счетчики.НайтиПоНаименованию(Счетчик, Истина);
					НоваяСтрокаВводПоказаний.Счетчик = Счетчик;
					НоваяСтрокаВводПоказаний.УслугаСчетчика = УслугаСчетчика;
					
					НоваяСтрокаВводПоказаний.ТекущиеПоказания = ТекущииеПоказания;
					
				КонецЕсли;				
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаОплаты.Добавить();
			
			ДлиннаСтроки = СтрДлина(Строка);
			
			Пока ДлиннаСтроки > 0 Цикл
				
				ЛицевойСчет = Неопределено;
				
				ЛицевойСчет = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(ЛС, Истина);
				
				Если ЛицевойСчет.Пустая() Тогда
					
					Попытка
						Идентификатор =	 Число(ЛС);
					Исключение
						Возврат;
					КонецПопытки;
					
					Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
					
					Выборка = Запрос.Выполнить().Выбрать();
					
					Если Выборка.Следующий() Тогда
						
						ЛицевойСчет = Выборка.ЛицевойСчет;
						
					КонецЕсли;
					
				КонецЕсли; 
				
				НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
				
				Попытка
					НоваяСтрока.Сумма                = Число(Сумма);
					НоваяСтрока.СуммаСУчетомПроцента = Число(Сумма);
				Исключение
				КонецПопытки; 
				
				ДлиннаСтроки = 0;
				
				Попытка
					
					Дата = Дата("20"+Сред(Дата,9,2)+Сред(Дата,4,2)+Сред(Дата,0,2) + стрзаменить(Сред(Дата,12,5),":",""));
					
					НоваяСтрока.ДатаОплаты = Дата;
					
				Исключение
				КонецПопытки;
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		ЗначениеВДанныеФормы(ТаблицаВводПоказаний,ТаблицаВводПоказанийСчетчиков);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.ЛицевойСчет,
		|	Таблица.Услуга,
		|	Таблица.Сумма,
		|	Таблица.ДатаОплаты,
		|	Таблица.СуммаСУчетомПроцента
		|ПОМЕСТИТЬ ТаблицаОплаты
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОплаты.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаОплаты.Услуга КАК Услуга,
		|	СУММА(ТаблицаОплаты.Сумма) КАК Сумма,
		|	ТаблицаОплаты.ДатаОплаты КАК ДатаОплаты,
		|	СУММА(ТаблицаОплаты.СуммаСУчетомПроцента) КАК СуммаСУчетомПроцента
		|ИЗ
		|	ТаблицаОплаты КАК ТаблицаОплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОплаты.ЛицевойСчет,
		|	ТаблицаОплаты.Услуга,
		|	ТаблицаОплаты.ДатаОплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОплаты,
		|	ЛицевойСчет,
		|	Услуга
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаСУчетомПроцента)
		|ПО
		|	ДатаОплаты,
		|	ЛицевойСчет";
		Запрос.УстановитьПараметр("Таблица", ТаблицаОплаты);
		ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Корень = ДеревоОплаты.ПолучитьЭлементы();
		Корень.Очистить();
		
		НеУказаноДат = 0;
		
		Пока ВыборкаДата.Следующий() Цикл
			
			СтрокаДерева = Корень.Добавить();
			СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаДата.ДатаОплаты;
			СтрокаДерева.Сумма                         = ВыборкаДата.Сумма;
			СтрокаДерева.СуммаСУчетомПроцента          = ВыборкаДата.СуммаСУчетомПроцента;
			
			Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
				НеУказаноДат = НеУказаноДат + 1;
			КонецЕсли; 
			
			ВыборкаЛС = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ВторойУровень = СтрокаДерева.ПолучитьЭлементы();
			
			ИтогПоДокументу      = ВыборкаДата.СуммаСУчетомПроцента;
			СуммаИтогПоДокументу = 0;
			
			МассивЛС = Новый Массив;
			
			НеНайденоЛС = 0;
			
			Пока ВыборкаЛС.Следующий() Цикл
				
				СтрокаВеткиДерева = ВторойУровень.Добавить();
				СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга = ВыборкаЛС.ЛицевойСчет;
				СтрокаВеткиДерева.Сумма                         = ВыборкаЛС.Сумма;
				СтрокаВеткиДерева.СуммаСУчетомПроцента          = ВыборкаЛС.СуммаСУчетомПроцента;
				
				СтруктураОплаты = НайтиДокументОплаты(ВыборкаДата.ДатаОплаты,НомерРеестра,ВыборкаЛС.ЛицевойСчет,ВыборкаЛС.Сумма);
				Если СтруктураОплаты.Свойство("Ссылка") Тогда
					СтрокаДерева.ДокументОплаты = СтруктураОплаты.Ссылка;
				КонецЕсли;
				
				СтруктураВводПоказаний = НайтиДокументВводПоказаний(ВыборкаЛС.ЛицевойСчет);
				Если СтруктураВводПоказаний.Свойство("Ссылка") Тогда
					СтрокаВеткиДерева.ВводПоказаний = СтруктураВводПоказаний.Ссылка;
				КонецЕсли;
				
				Если СтруктураОплаты.Свойство("ИсточникОплаты") Тогда
					СтрокаДерева.ИсточникОплаты = СтруктураОплаты.ИсточникОплаты;
				КонецЕсли;
				
				ИтокСуммаЛС = ВыборкаЛС.СуммаСУчетомПроцента;
				ИтогПоЛС    = 0;
				
				ТретийУровень =  СтрокаВеткиДерева.ПолучитьЭлементы();
				Выборка = ВыборкаЛС.Выбрать();
				УслугВДОкументе = 0;
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.Услуга.Пустая() И Выборка.Количество() = 1 Тогда
						Продолжить;
					КонецЕсли; 
					
					СтрокаВеткиДерева2 = ТретийУровень.Добавить();
					СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга = Выборка.Услуга;
					СтрокаВеткиДерева2.Сумма                         = Выборка.Сумма;
					СтрокаВеткиДерева2.СуммаСУчетомПроцента          = Выборка.СуммаСУчетомПроцента;
					
					Если ЗначениеЗаполнено(СтрокаВеткиДерева2.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
						ИтогПоЛС = ИтогПоЛС + Выборка.СуммаСУчетомПроцента;
						УслугВДОкументе = УслугВДОкументе + 1;
					КонецЕсли; 
					
				КонецЦикла;
				
				Если УслугВДОкументе = 0 Тогда
					ИтогПоЛС = ИтогПоДокументу;
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрокаВеткиДерева.ДатаОплаты_ЛицевойСчет_Услуга) Тогда
					СуммаИтогПоДокументу = СуммаИтогПоДокументу + ИтокСуммаЛС;
				Иначе
					НеНайденоЛС = НеНайденоЛС + 1;
				КонецЕсли; 
				
				Если ИтокСуммаЛС = ИтогПоЛС Тогда
					
					МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет.Наименование);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если НЕ СуммаИтогПоДокументу = ИтогПоДокументу Тогда
				
				Разница =  ИтогПоДокументу - СуммаИтогПоДокументу;
				
				Текст = "Оплаты от " + Формат(СтрокаДерева.ДатаОплаты_ЛицевойСчет_Услуга, "ДФ=dd.MM.yyyy") + " сумма документа("+СуммаИтогПоДокументу+") не сходится с суммой файла(" + ИтогПоДокументу + "), разница: " + Разница + ".";
				
				ТекстЛС = "Сумма не сходится по лицевым счетам: ";
				
				Если МассивЛС.Количество() > 0 Тогда
					
					Для каждого ЭлементМассива Из МассивЛС Цикл
						
						ТекстЛС = ТекстЛС + "" + ЭлементМассива + " ";
						
					КонецЦикла; 
					
					Текст = Текст + "
					|" + ТекстЛС;
					
				КонецЕсли;
				
				Если НеНайденоЛС > 0 Тогда
					
					Текст = Текст + "
					|Не найдено лицевых счетов: " + НеНайденоЛС;
					
				КонецЕсли; 
				
				МассивОшибок.Добавить(Текст);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если НеНайденоЛС > 0 Тогда
			
			МассивОшибок.Добавить("Не указанна дата у " + НеНайденоЛС + " позиций.");
			
		КонецЕсли; 
		
		Элементы.ДеревоОплаты.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		
		Корень = ДеревоОплаты.ПолучитьЭлементы();
		
		Если Корень.Количество() = 0 Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
			
			Возврат;
			
		КонецЕсли; 
		
		Если НЕ ПроверитьЗаполнение() Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		СуммаИтоИтогов = 0;
		
		Для каждого СтрокаКорня Из Корень Цикл
			
			Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
			
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ИтогПоДокументу      = СтрокаКорня.Сумма;
			СуммаИтогПоДокументу = 0;
			
			ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
			
			МассивЛС = Новый Массив;
			
			ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
			
			Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
				
				Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
					
					ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
					СуммаИтогПоЛС = 0;
					
					ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
					
					Если ТретийУровень.Количество() = 0 Тогда
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
						
					Иначе
						
						Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
							
							Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
								
								СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
								
							КонецЕсли;
							
						КонецЦикла; 
						
						Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
							
							МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
							
						КонецЕсли; 
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
						
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла; 
			СуммаИтоИтогов = СуммаИтоИтогов + СуммаИтогПоДокументу;
		КонецЦикла; 
		
		Объект.ТекстИтогоДокумент = "Итого по дереву минус процент: "+Строка(СуммаИтоИтогов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиДокументОплаты(ДатаОплаты,НомерРеестра,ЛицевойСчет,Сумма)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_ОплатаКУ.ИсточникОплаты,
	|	бит_ОплатаКУ.Ссылка
	|ИЗ
	|	Документ.бит_ОплатаКУ КАК бит_ОплатаКУ
	|ГДЕ
	|	бит_ОплатаКУ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОплаты, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОплаты, ДЕНЬ)
	|	И бит_ОплатаКУ.НомерРеестра = &НомерРеестра");
	Запрос.УстановитьПараметр("ДатаОплаты",ДатаОплаты);
	Запрос.УстановитьПараметр("НомерРеестра",НомерРеестра);
	Выборка = Запрос.Выполнить().Выбрать();
	Структура = Новый Структура();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка.СписокЛС.Количество() > 0 и ЗначениеЗаполнено(ЛицевойСчет) Тогда
			Если Выборка.Ссылка.СписокЛС[0].ЛицевойСчет = ЛицевойСчет и Выборка.Ссылка.СписокЛС[0].Сумма = Сумма Тогда
				Структура.Вставить("ИсточникОплаты", Выборка.ИсточникОплаты);
				Структура.Вставить("Ссылка", Выборка.Ссылка);
				Продолжить;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	Возврат Структура;
КонецФункции

&НаСервере
Функция НайтиДокументВводПоказаний(ЛицевойСчет)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЛицевойСчет",ЛицевойСчет);
	НайденныеСтроки = ТаблицаВводПоказанийСчетчиков.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		ДатаВводаПоказаний = НайденныеСтроки[0].Дата;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	бит_ВводПоказанийПоСчетчикам.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бит_ВводПоказанийПоСчетчикам КАК бит_ВводПоказанийПоСчетчикам
		|ГДЕ
		|	бит_ВводПоказанийПоСчетчикам.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаВводаПоказаний, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаВводаПоказаний, ДЕНЬ)");
		Запрос.УстановитьПараметр("ДатаВводаПоказаний",ДатаВводаПоказаний);
		Выборка = Запрос.Выполнить().Выбрать();
		Структура = Новый Структура();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Ссылка.ПоказанияПоСчетчикам.Количество() > 0 и ЗначениеЗаполнено(ЛицевойСчет) Тогда
				Если Выборка.Ссылка.ПоказанияПоСчетчикам[0].ЛицевойСчет = ЛицевойСчет Тогда
					Структура.Вставить("Ссылка", Выборка.Ссылка);
					Продолжить;
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		Возврат Структура;
		
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура сг_СоздатьОплаты(ВводПоказаний)
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Если СтрокаКорня.ДокументОплаты <> Документы.бит_ОплатаКУ.ПустаяСсылка() Тогда
			
			Документ = СтрокаКорня.ДокументОплаты.ПолучитьОбъект();
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.ОтменаПроведения,,"Ошибки");
			
			Документ.ИсточникОплаты = СтрокаКорня.ИсточникОплаты;
			
			Документ.СписокЛС.Очистить();
			Документ.СписокУслуг.Очистить();
			
			Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
			
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ИтогПоДокументу      = СтрокаКорня.Сумма;
			
			СуммаИтогПоДокументу = 0;
			
			ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
			
			МассивЛС = Новый Массив;
			
			ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
			
			Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
				
				
				Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
					
					НоваяСтрокаЛС = Документ.СписокЛС.Добавить();
					НоваяСтрокаЛС.ЛицевойСчет     = СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга;
					НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
					
					ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
					СуммаИтогПоЛС = 0;
					
					ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
					
					Если ТретийУровень.Количество() = 0 Тогда
						
						Документ.ВводВРучную    = Объект.Вручную;
						
						НоваяСтрокаЛС.Сумма = СтрокаВторогоУровня.Сумма;
						
						ТаблицаЛС          = Документ.СписокЛС.Выгрузить();
						КоммунальныеУслуги = Документ.СписокУслуг.ВыгрузитьКолонки();
						
						бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Дата,
						Объект.Организация,
						ТаблицаЛС,
						КоммунальныеУслуги,
						ПараметрыЖКХ.ЛьготаПерсонифицированная,
						ПараметрыЖКХ.РасчетСУчетомДолейВладения,
						ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта,
						ПараметрыЖКХ.НачислениеСУчетомДнейПроживания,
						ПараметрыЖКХ.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
						ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
						ПараметрыЖКХ.НачислятьПениСУчетомПереплаты); 
						
						Документ.СписокУслуг.Очистить();
						Документ.СписокУслуг.Загрузить(КоммунальныеУслуги);
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
						
					Иначе
						
						Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
							
							Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
								
								НоваяСтрокаУС = Документ.СписокУслуг.Добавить();
								НоваяСтрокаУС.ЛицевойСчет     = НоваяСтрокаЛС.ЛицевойСчет;
								НоваяСтрокаУС.ШаблонИзвещений = НоваяСтрокаЛС.ШаблонИзвещений;
								НоваяСтрокаУС.Услуга          = СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга;
								НоваяСтрокаУС.Сумма           = СтрокаТретьегоУрованя.Сумма;
								
								СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
								
							КонецЕсли;
							
						КонецЦикла; 
						
						Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
							
							МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
							
						КонецЕсли; 
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
						НоваяСтрокаЛС.Сумма  = СуммаИтогПоЛС;
						
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла; 
			
			Документ.СуммаДокумента = СуммаИтогПоДокументу;
			
			Документ.ЗапролнитьСчета();
			
			Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
				
				СтрокаКорня.ДокументОплаты = Документ.Ссылка;
				
			КонецЕсли;
			
		Иначе
			
			Документ = Документы.бит_ОплатаКУ.СоздатьДокумент();
			
			Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
			
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Документ.Дата           = Дата;
			Документ.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
			Документ.Организация    = Объект.Организация;
			Документ.Ответственный  = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
			Документ.ИсточникОплаты = СтрокаКорня.ИсточникОплаты;
			Документ.ВводВРучную    = Объект.Вручную;
			Документ.НомерРеестра   = Объект.НомерРеестра;
			Документ.Комментарий    = "Документ создан автоматически из обработки ""Система А-3"".";
			
			ИтогПоДокументу      = СтрокаКорня.Сумма;
			СуммаИтогПоДокументу = 0;
			
			ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
			
			МассивЛС = Новый Массив;
			
			ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
			
			Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
				
				Если ЗначениеЗаполнено(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
					
					НоваяСтрокаЛС = Документ.СписокЛС.Добавить();
					НоваяСтрокаЛС.ЛицевойСчет     = СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга;
					НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
					
					ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
					СуммаИтогПоЛС = 0;
					
					ТретийУровень = СтрокаВторогоУровня.ПолучитьЭлементы();
					
					Если ТретийУровень.Количество() = 0 Тогда
						Документ.ВводВРучную    = Объект.Вручную;
						НоваяСтрокаЛС.Сумма = СтрокаВторогоУровня.Сумма;
						
						ТаблицаЛС          = Документ.СписокЛС.Выгрузить();
						КоммунальныеУслуги = Документ.СписокУслуг.ВыгрузитьКолонки();
						
						бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Дата,
						Объект.Организация,
						ТаблицаЛС,
						КоммунальныеУслуги,
						ПараметрыЖКХ.ЛьготаПерсонифицированная,
						ПараметрыЖКХ.РасчетСУчетомДолейВладения,
						ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта,
						ПараметрыЖКХ.НачислениеСУчетомДнейПроживания,
						ПараметрыЖКХ.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
						ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
						ПараметрыЖКХ.НачислятьПениСУчетомПереплаты); 
						
						Документ.СписокУслуг.Очистить();
						Документ.СписокУслуг.Загрузить(КоммунальныеУслуги);
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
						
					Иначе
						
						Для каждого СтрокаТретьегоУрованя Из ТретийУровень Цикл
							
							Если ЗначениеЗаполнено(СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга) И НЕ СтрокаТретьегоУрованя.Сумма = 0 Тогда
								
								НоваяСтрокаУС = Документ.СписокУслуг.Добавить();
								НоваяСтрокаУС.ЛицевойСчет     = НоваяСтрокаЛС.ЛицевойСчет;
								НоваяСтрокаУС.ШаблонИзвещений = НоваяСтрокаЛС.ШаблонИзвещений;
								НоваяСтрокаУС.Услуга          = СтрокаТретьегоУрованя.ДатаОплаты_ЛицевойСчет_Услуга;
								НоваяСтрокаУС.Сумма           = СтрокаТретьегоУрованя.Сумма;
								
								СуммаИтогПоЛС = СуммаИтогПоЛС + СтрокаТретьегоУрованя.Сумма;
								
							КонецЕсли;
							
						КонецЦикла; 
						
						Если НЕ СуммаИтогПоЛС = ИтогПоЛС Тогда
							
							МассивЛС.Добавить(СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
							
						КонецЕсли; 
						
						СуммаИтогПоДокументу = СуммаИтогПоДокументу + СуммаИтогПоЛС;
						НоваяСтрокаЛС.Сумма  = СуммаИтогПоЛС;
						
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла; 
			
			Документ.СуммаДокумента = СуммаИтогПоДокументу;
			
			Документ.ЗапролнитьСчета();
			
			Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
				
				СтрокаКорня.ДокументОплаты = Документ.Ссылка;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ВводПоказаний()
	
	Корень = ДеревоОплаты.ПолучитьЭлементы();
	
	Если Корень.Количество() = 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Таблица платежей не заполнена.");
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаКорня Из Корень Цикл
		
		Если СтрокаКорня.ДокументОплаты <> Документы.бит_ОплатаКУ.ПустаяСсылка() Тогда
			
			ВторойУровень = СтрокаКорня.ПолучитьЭлементы();
			
			МассивЛС = Новый Массив;
			Дата = СтрокаКорня.ДатаОплаты_ЛицевойСчет_Услуга;
			
			ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
			
			Для каждого СтрокаВторогоУровня Из ВторойУровень Цикл
				
				Если СтрокаВторогоУровня.ВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.ПустаяСсылка() Тогда
					
					Отбор = Новый Структура;
					Отбор.Вставить("ЛицевойСчет",СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга);
					НайденныеСтроки = ТаблицаВводПоказанийСчетчиков.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
						
						ДокументВводПоказаний.Организация = Объект.Организация;
						ДокументВводПоказаний.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
						
						ДокументВводПоказаний.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
						ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
						ДокументВводПоказаний.ПоказанияНаселения = Истина;
						ДокументВводПоказаний.Дата = Дата;
						
						ДокументВводПоказаний.Комментарий    = "Документ создан автоматически из обработки ""Система А-3"".";
						ДокументВводПоказаний.Ответственный    = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
						
						ДокументВводПоказаний.ЛицевойСчет = СтрокаВторогоУровня.ДатаОплаты_ЛицевойСчет_Услуга;
						
						Если НЕ ЗначениеЗаполнено(ДокументВводПоказаний.Улица) Тогда
							
							ДокументВводПоказаний.Улица = ПолучитьУлицуЛицевогоСчета(ДокументВводПоказаний.ЛицевойСчет);
							
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(ДокументВводПоказаний.Дом) Тогда
							
							ДокументВводПоказаний.Дом   = ПолучитьЗданиеЛицевогоСчета(ДокументВводПоказаний.ЛицевойСчет);
							
						КонецЕсли;
						
						ДокументВводПоказаний.ПоказанияПоСчетчикам.Очистить();
						
						ДокументВводПоказаний.ЗаполнитьТаблицуПоказаний();
						
						Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 0 Тогда
							
							Для Каждого Строка из ДокументВводПоказаний.ПоказанияПоСчетчикам Цикл
								
								Для Каждого СтрокаПоказания из НайденныеСтроки Цикл
									
									Если Строка.Счетчик = СтрокаПоказания.Счетчик и Строка.Услуга = СтрокаПоказания.УслугаСчетчика Тогда
										Строка.ТекущиеПоказания = СтрокаПоказания.ТекущиеПоказания;
										
										Разрядность = Строка.Счетчик.Разрядность;
										
										КонечныеПоказания   = Число(СтрокаПоказания.ТекущиеПоказания);
										
										Если КонечныеПоказания < Строка.ПредыдущиеПоказания Тогда
											Разность = Разрядность - Строка.ПредыдущиеПоказания + 1 + Число(СтрокаПоказания.ТекущиеПоказания);
											Строка.КоличествоЕдиницПоСчетчику = Разность;
											
											Если НЕ Строка.Многотарифный Тогда
												
												СтрокиПоиска = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик", Строка.Счетчик));
												
												Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
													
													СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
													СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Разность;
													
													Сообщение = Новый СообщениеПользователю;
													Сообщение.Текст = "Произошел переход через ноль, так как конечные показания "+ КонечныеПоказания + " меньше предыдущих " + Строка.ПредыдущиеПоказания;
													Сообщение.Сообщить();
													
												КонецЦикла;
												
											Иначе
												
												СтрокиПоиска = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик, Услуга", Строка.Счетчик, Строка.Услуга));
												
												Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
													
													СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
													СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Разность;
													
													Сообщение = Новый СообщениеПользователю;
													Сообщение.Текст = "Произошел переход через ноль, так как конечные показания "+ КонечныеПоказания + " меньше предыдущих " + Строка.ПредыдущиеПоказания;
													Сообщение.Сообщить();
													
												КонецЦикла;
												
											КонецЕсли;										
										Иначе
											Разность = КонечныеПоказания - Строка.ПредыдущиеПоказания;
											Строка.КоличествоЕдиницПоСчетчику = Разность;
										КонецЕсли;
										
										Если НЕ Строка.Многотарифный Тогда
											
											СтрокиПоиска = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик", Строка.Счетчик));
											
											Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
												
												СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
												СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Разность;
												
											КонецЦикла;
											
										Иначе
											
											СтрокиПоиска = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик, Услуга", Строка.Счетчик, Строка.Услуга));
											
											Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
												
												СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
												СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Разность;
												
											КонецЦикла;
											
										КонецЕсли;									
									КонецЕсли;	
									
								КонецЦикла;
								
							КонецЦикла;
								
								БезПоказаний = Новый Структура;
							БезПоказаний.Вставить("ТекущиеПоказания",0);
							
							СтрокиБезПоказаний = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(БезПоказаний);
							
							Если СтрокиБезПоказаний.Количество() > 0 Тогда
							
								Индекс = ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() - 1;
								
								Пока Индекс >=0 Цикл
									
									СтрокаТаблицы=ДокументВводПоказаний.ПоказанияПоСчетчикам.Получить(Индекс);
									
									Если СтрокаТаблицы.ТекущиеПоказания = 0 Тогда
										
										ДокументВводПоказаний.ПоказанияПоСчетчикам.удалить(СтрокаТаблицы);	
										
									КонецЕсли;
									Индекс = Индекс - 1;
									
								КонецЦикла;	
								
							КонецЕсли;
							
							ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
							
							СтрокаВторогоУровня.ВводПоказаний = ДокументВводПоказаний.Ссылка;
							
						КонецЕсли;	
						
					КонецЕсли;	
					
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьЗданиеЛицевогоСчета(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Здание;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУлицуЛицевогоСчета(ЛицевойСчет)
	
	Возврат ЛицевойСчет.УлицаЛицевогоСчета;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНастройкиПолейРеестраСальдо()
	
	НастройкаПолейСтрокиРеестраСальдо.Очистить();
	
	// Лицевой счет.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "ЛицевойСчет";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "AccountID";
	
	// Сальдо.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "НачальноеСальдоСУчетомПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "SaldoIn";
	НоваяСтрока.ИспользоватьВИтогах = Истина;
	
	// КодУслуги.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "КодУслуги";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(9);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "";
	
	// НачалоПериода.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "НачалоПериода";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат       = "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок      = "";
	
	// КонецПериода.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "КонецПериода";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат       = "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок      = "Date";
	
	// СуммаНачислений.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "СуммаНачисленийСУчетомПени";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат       = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок      = "Value";
	
	// Услуга.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "Услуга";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "Service Name";
	
	// Конечное Сальдо.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдо";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "SaldoOut";
	
	// Конечное Сальдо с пени.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдоСУчетомПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "Total";
	
	// Конечное Сальдо пени.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдоПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "SaldoOutP";
	
	// Счетчик.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "Счетчик";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "Counter";
	
	// Услуга счетчика.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "УслугаСчетчика";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "";
	
	// Предыдущие показания счетчика.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "ОтПоказаний";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат       = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок      = "CounterValue";
	
	// Многотарифный.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "Многотарифный";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "";
	
	// Конечное Сальдо с пени.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдоСУчетомПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "Balance";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПолейРеестраСальдоБезУслуг()
	
	НастройкаПолейСтрокиРеестраСальдо.Очистить();
	
	// Лицевой счет.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "ЛицевойСчет";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "AccountID";
	
	// Сальдо.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "НачальноеСальдоСУчетомПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "SaldoIn";
	НоваяСтрока.ИспользоватьВИтогах = Истина;
	
	// НачалоПериода.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "НачалоПериода";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат       = "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок      = "";
	
	// КонецПериода.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "КонецПериода";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	НоваяСтрока.Формат       = "ДФ=dd/MM/yyyy";
	НоваяСтрока.Порядок      = "Date";
	
	// СуммаНачислений.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "СуммаНачисленийСУчетомПени";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат       = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок      = "Value";
	
	// Конечное Сальдо.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдо";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "SaldoOut";
	
	// Конечное Сальдо с пени.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдоСУчетомПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "Total";
	
	// Конечное Сальдо пени.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдоПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "SaldoOutP";
	
	// Счетчик.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "Счетчик";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "Counter";
	
	// Услуга счетчика.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "УслугаСчетчика";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "";
	
	// Предыдущие показания счетчика.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "ОтПоказаний";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат       = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок      = "CounterValue";
	
	// Многотарифный.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать = Истина;
	НоваяСтрока.ИмяПоля      = "Многотарифный";
	НоваяСтрока.Тип          = бит_ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20);
	НоваяСтрока.Формат       = "";
	НоваяСтрока.Порядок      = "";
	
	// Конечное Сальдо с пени.
	НоваяСтрока = НастройкаПолейСтрокиРеестраСальдо.Добавить();
	НоваяСтрока.Использовать        = Истина;
	НоваяСтрока.ИмяПоля             = "КонечноеСальдоСУчетомПени";
	НоваяСтрока.Тип                 = бит_ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
	НоваяСтрока.Формат              = "ЧДЦ=2; ЧРД=.; ЧГ=0";
	НоваяСтрока.Порядок             = "Balance";	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоФорматНачалоВыбораЗавершение(Текст1, ДополнительныеПараметры) Экспорт
	
	КонструкторФорматнойСтроки = ДополнительныеПараметры.КонструкторФорматнойСтроки;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Текст1) Тогда
		ТекущиеДанные.Формат = КонструкторФорматнойСтроки.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыбранныеЗначения(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения данных из временного хранилища. Выполните подбор заново.");
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаЛС Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаЛС.ЛицевойСчет);
		
		Поиск = Объект.ОтборЛицевыхСчетов.НайтиСтроки(Отбор);
		
		Если Поиск.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.ОтборЛицевыхСчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЛС);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПараметрыЖКХ(Дата)
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты", Ложь); 
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Объект.Организация, ПараметрыЖКХ);
	
	Возврат ПараметрыЖКХ;
	
КонецФункции

&НаКлиенте
Процедура СформироватьНаименования(Команда)
	
	Месяц = Формат(ТекущаяДата(), "ДФ=MM");
	Год   = Лев(Строка(Год(ТекущаяДата())),1) + Прав(Строка(Год(ТекущаяДата())),3);
	День  = Формат(ТекущаяДата(), "ДФ=дд");
	
	Объект.а3_ИмяФайлаSA1_simp      = Год + Месяц + День + "SA1"; 
	Объект.а3_ИмяФайлаSL1_simp      = Год + Месяц + День + "SL1"; 
	Объект.а3_ИмяФайлаSA1_full      = Год + Месяц + День + "SA1"; 
	Объект.а3_ИмяФайлаSL1_full      = Год + Месяц + День + "SL1"; 
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSL1_simpНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог   = Объект[Элемент.Имя];
	Диалог.Заголовок = "Укажите каталог...";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя]  = Диалог.Каталог;
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSL1_simp1Открытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.а3_КаталогВыгрузкиSL1_simp);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSA1_simpНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог   = Объект[Элемент.Имя];
	Диалог.Заголовок = "Укажите каталог...";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя]  = Диалог.Каталог;
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSA1_simpОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.а3_КаталогВыгрузкиSA1_simp);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSA1_fullНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог   = Объект[Элемент.Имя];
	Диалог.Заголовок = "Укажите каталог...";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя]  = Диалог.Каталог;
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSL1_fullНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог   = Объект[Элемент.Имя];
	Диалог.Заголовок = "Укажите каталог...";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя]  = Диалог.Каталог;
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSA1_fullОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.а3_КаталогВыгрузкиSA1_full);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура а3_КаталогВыгрузкиSL1_fullОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.а3_КаталогВыгрузкиSL1_full);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоПриАктивизацииЯчейки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		
		Если Элемент.ТекущиеДанные.ИмяПоля = "НачальноеСальдо"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "НачальноеСальдоСУчетомПени"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "НачальноеСальдоПени"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "НачальноеСальдоСУчетомОплаты"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "НачальноеСальдоСУчетомОплатыИПени"
			
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "КонечноеСальдо"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "КонечноеСальдоСУчетомПени"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "КонечноеСальдоПени"
			
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "СуммаОплаты"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "СуммаПени"
			
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "СуммаНачислений"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "СуммаНачисленийСУчетомОплатыИПени"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "СуммаНачисленийСУчетомПени"
			ИЛИ Элемент.ТекущиеДанные.ИмяПоля = "СуммаНачисленийСУчетомОплаты" Тогда
			
			Элемент.ТолькоПросмотр = Ложь;
		Иначе
			Элемент.ТолькоПросмотр = Истина;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрокиРеестраСальдоИмяПоляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "НачальноеСальдо"
		ИЛИ ВыбранноеЗначение = "НачальноеСальдоСУчетомПени"
		ИЛИ ВыбранноеЗначение = "НачальноеСальдоПени"
		ИЛИ ВыбранноеЗначение = "НачальноеСальдоСУчетомОплаты"
		ИЛИ ВыбранноеЗначение = "НачальноеСальдоСУчетомОплатыИПени"
		
		ИЛИ ВыбранноеЗначение = "КонечноеСальдо"
		ИЛИ ВыбранноеЗначение = "КонечноеСальдоСУчетомПени"
		ИЛИ ВыбранноеЗначение = "КонечноеСальдоПени"
		
		ИЛИ ВыбранноеЗначение = "СуммаОплаты"
		ИЛИ ВыбранноеЗначение = "СуммаПени"
		
		ИЛИ ВыбранноеЗначение = "СуммаНачислений"
		ИЛИ ВыбранноеЗначение = "СуммаНачисленийСУчетомОплатыИПени"
		ИЛИ ВыбранноеЗначение = "СуммаНачисленийСУчетомПени" 
		ИЛИ ВыбранноеЗначение = "СуммаНачисленийСУчетомОплаты" Тогда
		
		
	Иначе
		ВыбранноеЗначение = Элемент.ТекстРедактирования;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо выбрать расчетное поле";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВводПоказаний(Команда)
	
	ВводПоказаний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКАрхиваторуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог   = Объект[Элемент.Имя];
	Диалог.Заголовок = "Укажите каталог...";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя]  = Диалог.Каталог;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКАрхиваторуОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.ПутьКАрхиватору7z);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

#КонецОбласти