
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НачалоПериода") Тогда
		Отчет.НачалоПериода = Параметры.НачалоПериода;
	КонецЕсли;
	
	Если Параметры.Свойство("КонецПериода") Тогда
		Отчет.КонецПериода = Параметры.КонецПериода;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала    = Отчет.НачалоПериода;
	Период.ДатаОкончания = Отчет.КонецПериода;
	
	ДиалогРедактированияПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактированияПериода.Период = Период;
	
	ДиалогРедактированияПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект, Новый Структура("ДиалогРедактированияПериода", ДиалогРедактированияПериода))); 
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период1, ДополнительныеПараметры) Экспорт
    
    ДиалогРедактированияПериода = ДополнительныеПараметры.ДиалогРедактированияПериода;
    
    Если ЗначениеЗаполнено(Период1) Тогда
        
        Отчет.НачалоПериода = ДиалогРедактированияПериода.Период.ДатаНачала;
        Отчет.КонецПериода  = ДиалогРедактированияПериода.Период.ДатаОкончания;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	Элементы.Настройки.Пометка = НЕ Элементы.Настройки.Пометка;
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Элементы.Настройки.Пометка;
	
КонецПроцедуры

#КонецОбласти
