
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Объект.ВидОперации);
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
	Элементы.СписокУслугГруппа2.ТолькоПросмотр              = Ложь;
	Элементы.СписокУслугГруппа3.ТолькоПросмотр              = Ложь;
	Элементы.СписокУслугЛицевойСчет.ТолькоПросмотр          = Ложь;
	Элементы.СписокУслугНомерСтроки.ТолькоПросмотр          = Ложь;
	Элементы.СписокУслугСубконто1.ТолькоПросмотр            = Ложь;
	Элементы.СписокУслугСубконто2.ТолькоПросмотр            = Ложь;
	Элементы.СписокУслугСубконто3.ТолькоПросмотр            = Ложь;
	Элементы.СписокУслугСубконтоКУ1.ТолькоПросмотр          = Ложь;
	Элементы.СписокУслугСубконтоКУ2.ТолькоПросмотр          = Ложь;
	Элементы.СписокУслугСубконтоКУ3.ТолькоПросмотр          = Ложь;
	Элементы.СписокУслугСумма.ТолькоПросмотр                = Ложь;
//	Элементы.СписокУслугСуммаПени.ТолькоПросмотр            = Ложь;
	Элементы.СписокУслугСчетАбонента.ТолькоПросмотр         = Ложь;
	Элементы.СписокУслугСчетКУ.ТолькоПросмотр               = Ложь;
	Элементы.СписокУслугПодбор.Видимость                    = Ложь;
	Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
	Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
	Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
	Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
	Элементы.Группа19.Видимость								= Ложь;
	Элементы.КонПериода.Заголовок = "по";
	Элементы.СписокУслугПодборЛС.Видимость					= Ложь;
	//Михайлов начало работ
	Элементы.СписокУслугУслуга.Видимость					= Ложь;//Добавлено
	Элементы.Сумма.Видимость								= Ложь;//Добавлено
	Элементы.Услуга.Видимость								= Ложь;//Добавлено
	Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
	Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
	Элементы.ВключаяРазовые.Видимость                       = ложь;//новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
	Элементы.ГруппаОДН.Видимость                            = Ложь;
    //конец работ
	
	// БИТ ЖКХ 14.07.2020
	Элементы.СписокУслугПеня.Видимость = ложь;
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги 
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслуге
		// БИТ ЖКХ 10.03.2020
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеЗаПрошлыеПериоды
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчику
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика Тогда 
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                 = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = Истина;
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                  = ?(Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг,Ложь,Истина); 
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Рассчитать";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначислениеПоВременноПроживающим Тогда 	
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Истина;
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа11;
		Элементы.КолвоДнейНедопоставки.Видимость                = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Истина;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021 
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоОтсутствующим Тогда 	
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Истина;
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа11;
		Элементы.КолвоДнейНедопоставки.Видимость                = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
	    Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021 
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоОтсутствующим Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Истина;
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа9;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Рассчитать";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
	    Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьгот Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Ложь;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.Группа8.Видимость                              = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь; 
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Рассчитать";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Ложь;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021   
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировка Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Ложь;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.Группа8.Видимость                              = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;			
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПоГрупповымСчетчикамСНаличиемИндивидуальных Тогда	
		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа17;
		Элементы.ДокументНаПерерасчет.Видимость                 = Ложь;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;
		Элементы.Группа8.Видимость                              = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Рассчитать";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Истина;
		Элементы.Группа7.Заголовок                              = "Лицевые счета";
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021 
		Элементы.ГруппаОДН.Видимость                            = Ложь;

			
        // конец работ

		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		ДокументОбъект.ОбновитьНастройкиЖКХ();
		
		Если ДокументОбъект.мГрафаНачисления Тогда
			
			Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Ложь;
			
		Иначе
			
			Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
			
		КонецЕсли;
		
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое
		// БИТ ЖКХ 10.03.2020 
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = Истина;
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Истина;
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.СписокУслугПодбор.Видимость                    = Истина;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;  //Добавлено
	    Элементы.Услуга.Видимость								= Ложь;  //Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;  //добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;  //добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;  //добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;  //Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь;  //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Ложь;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Ложь;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.Группа8.Видимость                              = Ложь;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;		
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;
		Элементы.ЛицевыеСчетаСпособРаспределения.Видимость      = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Истина;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Истина;
		Элементы.ЛицевыеСчетаКоманднаяПанель.Доступность        = Ложь;		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа17;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Лицевые счета";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ

		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Ложь;
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Ложь;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Истина;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа12;		
		Элементы.СписокУслуг.ТолькоПросмотр                     = Истина;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Ложь;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021 
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты Тогда		
		// БИТ ЖКХ 16.07.2020
		Элементы.Группа13.Видимость                             = истина;
		Элементы.Группа8.Видимость                              = истина;
		Элементы.ОплатаКУ.Видимость                             = истина;         
		Элементы.ДокументНаПерерасчет.Видимость                 = Ложь;
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Ложь;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Истина;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа13;
		Элементы.СписокУслугЛицевойСчет.ТолькоПросмотр          = Истина;
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Истина;
		Элементы.СписокУслугСумма.ТолькоПросмотр                = Ложь;
//		Элементы.СписокУслугСуммаПени.ТолькоПросмотр            = Истина;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Ложь;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021 
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ
		
        // БИТ ЖКХ 14.07.2020
		Элементы.СписокУслугПеня.Видимость = истина;

		
	// БИТ ЖКХ 13.03.2020 
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировкаПени Тогда
		
	    Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Ложь;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.Группа8.Видимость                              = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;			
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ

		

		// БИТ ЖКХ 14.07.2020
		Элементы.СписокУслугПеня.Видимость = истина;
		Элементы.СписокУслугПеняСумма.Видимость = ложь;
		Элементы.СписокУслугПеняЛицевойСчет.Видимость = ложь;
		 // БИТ ЖКХ 14.07.2020
		Элементы.Группа13.Видимость                             = ЛОЖЬ;
		Элементы.Группа8.Видимость                              = ЛОЖЬ;
		Элементы.ОплатаКУ.Видимость                             = ложь;         

	// БИТ ЖКХ 13.03.2020 

	
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков ИЛИ 
		       Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов Тогда
			   
		// БИТ ЖКХ 16.03.2020	   
		Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов тогда 	   
			
	  	  Элементы.УслугаНачисления.Видимость                   = ложь;
		  	
		конецесли;
		
		Элементы.Группа19.Видимость								= Истина;
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.Группа8.Видимость                              = Ложь;
		Элементы.Группа6.Видимость                              = Ложь;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                  = Ложь;			
		Элементы.ЛицевойСчет.Видимость                          = Ложь;
		Элементы.КонПериода.Заголовок							= "Период";
	
		// ТЧ Список услуг.
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.СписокУслугПодборЛС.Видимость					= Истина;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Истина;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		
		// ТЧ Лицевые счета.
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина; 
		
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ

	   //Михайлов Начало Работ
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавки Тогда
	
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = ложь;//изменено, везде проверено
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Истина;
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.СписокУслугПодбор.Видимость                    = Истина;//проверено, без изменений
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		Элементы.СписокУслугУслуга.Видимость					= Ложь;//Добавлено
		Элементы.Сумма.Видимость								= Истина;//Добавлено
		Элементы.Услуга.Видимость								= Истина;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021 
		Элементы.ГруппаОДН.Видимость                            = Ложь;

		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетВСвязиСИзменениемПлощади Тогда

		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                 = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = ложь; //изменено
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                  = ?(Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг,Ложь,Истина); 
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;//проверено, без изменений
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Рассчитать";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		Элементы.ПлощадьОбщая.Видимость                         = Истина;//добавлено
		Элементы.ПлощадьЖилая.Видимость                         = Истина;//добавлено
		Элементы.ПлощадьДляКапремонта.Видимость                 = Истина;//добавлено
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
		Элементы.Сумма.Видимость								= ложь;//Добавлено
		Элементы.Услуга.Видимость								= ложь;//Добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021

	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребления Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                 = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = ложь; //изменено
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Истина;
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                  = ?(Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг,Ложь,Истина); 
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;//проверено, без изменений
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Рассчитать";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		Элементы.ПлощадьОбщая.Видимость                         = ложь;//добавлено
		Элементы.ПлощадьЖилая.Видимость                         = ложь;//добавлено
		Элементы.ПлощадьДляКапремонта.Видимость                 = ложь;//добавлено
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
		Элементы.Сумма.Видимость								= ложь;//Добавлено
		Элементы.Услуга.Видимость								= Истина;//Добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Истина;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021

	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребленияГрупповое Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = ложь; //изменено
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Истина;
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.СписокУслугПодбор.Видимость                    = Истина;//проверено, без изменений
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Истина;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        //КонецРабот
		
		//Михайлов БИТ начало работ по ЛТ №52 
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки Тогда
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.НачПериода.Видимость                           = Истина;
		Элементы.КонПериода.Видимость                           = Истина;
		Элементы.НастройкаПериода.Видимость                     = Истина;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Истина;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь; //изменено 
		Элементы.Группа8.Видимость                              = Истина;
		Элементы.Группа8.ТекущаяСтраница                        = Элементы.Группа10;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;		
		Элементы.КолЧасовНедопоставки.Видимость                  = Истина;
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.СписокУслугПодбор.Видимость                    = Истина;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Добавлены элементы
		Элементы.СписокУслугУслуга.Видимость					= Истина;
	    Элементы.Сумма.Видимость								= Истина;
	    Элементы.Услуга.Видимость								= Истина;
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;
		Элементы.ВключаяРазовые.Видимость                       = Истина; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021  
		Элементы.ГруппаОДН.Видимость                            = Ложь;

        // конец работ по ЛТ №52
		
		ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН Тогда
		
		Элементы.Группа2.Видимость                              = Истина; 
		Элементы.ГруппаОДН.Видимость                            = Истина;
		Элементы.УслугиЖКХПеня.Видимость                        = Ложь;
		Элементы.Группа4.Видимость                              = Ложь;
		Элементы.Группа8.Видимость                              = Ложь;
		Элементы.Группа19.Видимость                             = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь; 
		Элементы.КолЧасовНедопоставки.Видимость                 = Ложь;
		Элементы.ДокументНаПерерасчет.Видимость                 = Истина;
		Элементы.СторноПоСчетам.Видимость                       = Ложь;
		Элементы.ВключаяРазовые.Видимость                       = Ложь; 
		Элементы.СписокУслугУслуга.Видимость                    = Истина;
		Элементы.СписокУслугПодбор.Видимость                    = Истина;
		Элементы.СписокУслугЛицевойСчет.Видимость               = Истина;
		Элементы.СписокУслугРассчитать.Видимость                = Ложь;
				
	Иначе
		
		Элементы.ДокументНаПерерасчет.Видимость                 = Ложь;
		Элементы.Группа8.Видимость                              = Ложь;
		Элементы.НачПериода.Видимость                           = Ложь;
		Элементы.КонПериода.Видимость                           = Ложь;
		Элементы.НастройкаПериода.Видимость                     = Ложь;
		Элементы.КолвоЧеловек.Видимость                         = Ложь;
		Элементы.КолвоДнейНедопоставки.Видимость                = Ложь;
		Элементы.ПроцентНеДопоставки.Видимость                  = Ложь;
		Элементы.ФизЛицаЭл.Видимость                            = Ложь;
		Элементы.ЛицевойСчет.Видимость                          = Ложь;		
		Элементы.СписокУслугЛицевойСчет.Видимость               = Ложь;
//		Элементы.СписокУслугСуммаПени.Видимость                 = Ложь;
		Элементы.ЛицевыеСчетаНачисленияЗаПериод.Видимость       = Ложь;
		Элементы.ЛицевыеСчетаКоличествоЕдиниц.Видимость         = Ложь;
		Элементы.КолЧасовНедопоставки.Видимость                  = Истина;		
		Элементы.Группа15.ТекущаяСтраница                       = Элементы.Группа16;
		Элементы.СписокУслугПодбор.Видимость                    = Ложь;
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Заголовок   = "Заполнить";
		Элементы.СписокУслугУслуга.ТолькоПросмотр               = Ложь;
		Элементы.СписокУслуг.ТолькоПросмотр                     = Ложь;
		Элементы.Группа7.Заголовок                              = "Услуги ЖКХ";
		Элементы.ЛицевыеСчетаРассчитатьЛицевыеСчета.Доступность = Истина;
		Элементы.СписокУслугОбъем.Видимость                     = Истина;
		//Михайлов начало работ
		Элементы.СписокУслугУслуга.Видимость					= Истина;//Добавлено
	    Элементы.Сумма.Видимость								= Ложь;//Добавлено
	    Элементы.Услуга.Видимость								= Ложь;//Добавлено
		Элементы.ПлощадьОбщая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьЖилая.Видимость                         = Ложь;//добавлено
	    Элементы.ПлощадьДляКапремонта.Видимость                 = Ложь;//добавлено
		Элементы.КоличествоЕдиницПотребления.Видимость			= Ложь;//Добавлено
		Элементы.ВключаяРазовые.Видимость                       = ложь; //новый элемент для ЛТ №52 Михайлов БИТ 27.04.2021
		//Конец работ

		
	КонецЕсли;
	
		
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков") Тогда
		
		СписокЛСИзХран             = ПолучитьИзВременногоХранилища(Параметры.ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков.СписокЛСАдресХран);			
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда			
			
			Объект.ВидОперации   = Параметры.ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков.ВидОперации;
			Объект.Дата          = Параметры.ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков.Дата;
			Объект.Ответственный = Параметры.ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков.Ответственный;
			Объект.Документ      = Параметры.ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков.Документ;
			
			СписокЛС             = СписокЛСИзХран;		
			
			МассивНачислений     = Параметры.ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков.МассивНачислений;
			
			Если МассивНачислений <> Неопределено Тогда
				
				Для каждого Строка Из МассивНачислений Цикл
					
					НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Элементы.Дата.Доступность = Ложь;
			
			Колонки = Новый Массив;
			
			Для Каждого Реквизит Из Метаданные.Документы.бит_РазовыеПоУслугамЖКХ.ТабличныеЧасти.ЛицевыеСчета.Реквизиты Цикл
				
				Колонки.Добавить(Реквизит.Имя);
				
			КонецЦикла;
			
			бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Объект.ЛицевыеСчета, Колонки, СписокЛС, Объект.Организация , Объект.Дата);
			
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда			
			
			// Заполнение из справочника ЛицевыеСчета.
			Объект.Организация      = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Организация;
			Объект.ЛицевойСчет      = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
			
			Колонки = Новый Массив;
			
			Для Каждого Реквизит Из Метаданные.Документы.бит_РазовыеПоУслугамЖКХ.ТабличныеЧасти.ЛицевыеСчета.Реквизиты Цикл
				
				Колонки.Добавить(Реквизит.Имя);
				
			КонецЦикла;
			
			бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Объект.ЛицевыеСчета, Колонки, СписокЛС, Объект.Организация , Объект.Дата);
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		НеСоздаватьДокумент = ДокументОбъект.мНеСоздДокумент;
		
		Если НеСоздаватьДокумент Тогда
			
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ") Тогда
		
		Состояние("Подключается сканер штрихкода...");	

		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьСканерШКЗавершение", ЭтотОбъект, Новый Структура("Форма", ЭтаФорма));
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, "СканерШтрихкода");

		
		
	КонецЕсли;
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	УправлениеЭлементамиФормы();
	
	ЗаполнитьОписанияФизЛиц();
	
	ЗаполнитьКолвоДнейНедопоставки();
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НЕ ИнтерфейсТакси Тогда
		
		Элементы.Группа7.Высота = 0;
		Элементы.Группа7.РастягиватьПоВертикали = Истина; 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьСканерШКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	СканерШтрихкода = РезультатВыполнения.Результат;
	Если СканерШтрихкода Тогда
		Состояние("Сканер штрихкода подключен");
	Иначе
		Состояние("Сканер штрихкода не подключен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если СканерШтрихкода Тогда
		ТипыПО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода");
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ОтключитьСканерШКЗавершение", ЭтотОбъект, Новый Структура("Форма", ЭтаФорма));
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ТипыПО);
	КонецЕсли;
	
	Оповестить("ИзменениеУслугПоЛС",Объект.ЛицевойСчет,ТипЗнч(Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если НЕ (ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая"
		ИЛИ ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая1"
		ИЛИ ИсточникВыбора.ИмяФормы = "Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаФизЛицУправляемая") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая"
		ИЛИ ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая1" Тогда
		
		ТаблицаЛСНаСервере(ВыбранноеЗначение.АдресЛСВХранилище);
				
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаФизЛицУправляемая" Тогда
		
		Отбор = Новый Структура;
		
		ТаблицаФизЛиц = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресФизЛицВХранилище);
		
		Для каждого Строка Из ТаблицаФизЛиц Цикл
			
			Отбор.Вставить("ФизЛицо"    , Строка.ФизЛицо);
			
			СтрокиПоиска = Объект.ФизЛица.НайтиСтроки(Отбор);
			
			Если СтрокиПоиска.Количество() > 0 Тогда
				
				Отбор.Удалить("ФизЛицо");
				
				Продолжить;
				
			КонецЕсли; 
			
			НоваяСтрока = Объект.ФизЛица.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			Отбор.Удалить("ФизЛицо");
			
		КонецЦикла;
		
		ЗаполнитьОписанияФизЛиц();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЛСНаСервере(АдресЛСВХранилище)
	
	Отбор = Новый Структура;
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(АдресЛСВХранилище);
	
	Для каждого Строка Из ТаблицаЛС Цикл
		
		Отбор.Вставить("Услуга"     , Строка.Услуга);
		Отбор.Вставить("ЛицевойСчет", Строка.ЛицевойСчет);
		
		СтрокиПоиска = Объект.СписокУслуг.НайтиСтроки(Отбор);
		
		Если СтрокиПоиска.Количество() > 0 Тогда
			
			Отбор.Удалить("Услуга");
			Отбор.Удалить("ЛицевойСчет");
			
			Продолжить;
			
		КонецЕсли; 
		
		НоваяСтрока = Объект.СписокУслуг.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Отбор.Удалить("Услуга");
		Отбор.Удалить("ЛицевойСчет");
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеФизЛиц" Тогда
		
		ЗаполнитьОписанияФизЛиц();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "Штрихкод" Тогда
		
		
		Попытка
			
			Массив = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(,,МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
			
			Для Каждого Стр из Массив Цикл
				Если Стр.ТипОборудования=ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СканерШтрихкода") Тогда
					Результат = бит_ОбработатьСобытиеСШК(Объект, Данные);
					
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			
		КонецПопытки;		
		  
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
		
		Отмена = Ложь;
		
		Отмена2 = ПроверитьЧекНаСтроно(Объект.ЧекККМ, Отмена);
		
		Если НЕ Отмена2 Тогда
			
			ЗаполнитьПоЧекуНаСервере();
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканерШКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При отключении оборудования произошла ошибка: ""%1"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		СканерШтрихкода = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СканерШтрихкода И ЗавершениеРаботы Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	Период = Новый СтандартныйПериод;
	
	Период.ДатаНачала    = Объект.НачПериода;
	Период.ДатаОкончания = Объект.КонПериода;
	
	ДиалогРедактированияПериода = Новый ДиалогРедактированияСтандартногоПериода;
	
	ДиалогРедактированияПериода.Период = Период;
	
	ДиалогРедактированияПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект, Новый Структура("ДиалогРедактированияПериода", ДиалогРедактированияПериода)));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период1, ДополнительныеПараметры) Экспорт
	
	ДиалогРедактированияПериода = ДополнительныеПараметры.ДиалогРедактированияПериода;
	
	Если ЗначениеЗаполнено(Период1) Тогда
		
		мДатаНачала    = ДиалогРедактированияПериода.Период.ДатаНачала;
		мДатаОкончания = ДиалогРедактированияПериода.Период.ДатаОкончания;
		
		Объект.НачПериода = мДатаНачала;
		Объект.КонПериода = мДатаОкончания;
		
	КонецЕсли;
	
	ЗаполнитьКолвоДнейНедопоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , Объект.Дата);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая1", ПараметрыФормы, ЭтаФорма, Этаформа);
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)

	 //Михайлов 03.02.2021
	//Штатные проверки табличной части документа 
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое")
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое") 
		// БИТ ЖКх 10.03.2020
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды") 
		// БИТ ЖКх 12.03.2020
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов") 
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое") 
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое") 
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков") 
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавки") 
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетВСвязиСИзменениемПлощади") 
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребления")
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки")
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребленияГрупповое")
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН") Тогда
		
		Для каждого Строка из Объект.СписокУслуг Цикл 
			
			Структура = Новый Структура;
			Структура.Вставить("Услуга",Строка.Услуга);
			
			НайденныеСтроки = Объект.СписокУслуг.НайтиСтроки(Структура);
			
			КоличествоЭлементов = НайденныеСтроки.Количество();
			
			Если КоличествоЭлементов > 1 Тогда
				
				//Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.битВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН") Тогда 
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нельзя рассчитывать с одинаковыми услугами!");    
				
				КонецЕсли;
				
				Возврат;
				
			//КонецЕсли;
			
		КонецЦикла;	
		
	Иначе
		Если не Объект.списокУслуг.количество() = 0 Тогда
			НеВозможностьРасчета = ОпределитьВозможностьРасчетаНаСервере();
			
			Если НеВозможностьРасчета Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нельзя рассчитывать с одинаковыми услугами!");
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Конец штатных проверок
	
	
	//бит +
	//Михайлов Начало Работ
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавки") Тогда
		    
	    Массив = ПерерасчетРанееПрименяемойСтавкиНаСервере();
		 		                   		
		ТекущаяСтрока = Элементы.СписокУслуг.ТекущиеДанные;
		
		Для Каждого ТекущаяСтрока Из Объект.СписокУслуг Цикл
		ТекущаяСтрока.Объем = 0;
		ТекущаяСтрока.Сумма = 0;
		ТекущаяСтрока.Услуга = объект.Услуга;
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Объект.СписокУслуг Цикл
			НомерЛС = ТекущаяСтрока.ЛицевойСчет;
			    Для Индекс = 0 По Массив.Количество() - 1 Цикл
					если Массив[Индекс]=НомерЛС ТОгда
					ТекущаяСтрока.Сумма = ТекущаяСтрока.Сумма + Массив[Индекс+2];
					КонецЕсли;
                КонецЦикла;  	
		КонецЦикла;
			Для Каждого ТкущаяСтрока из Объект.ЛицевыеСчета Цикл
				Для Индекс = 0 По Массив.Количество() - 1 Цикл
									
				    ТекущаяСтрока.ЛицевойСЧет = Массив[Индекс];
					Индекс = Индекс + 2;
                КонецЦикла;
			КонецЦикла;
	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетВСвязиСИзменениемПлощади") Тогда	
		
		Массив = ПерерасчетИзЗаИзмененияПлощадиНаСервере();
		
		Объект.СписокУслуг.Очистить();
		РазмерМассива = Массив.Количество()-1;
		Индекс = 0;
		Пока Индекс <=РазмерМассива Цикл
			СтрокаТЧ = Объект.СписокУслуг.Добавить();
			СтрокаТЧ.Услуга = Массив[индекс].Услуга;
			СтрокаТЧ.Сумма = Массив[индекс].СУмма;
			Индекс = Индекс+1;
		КонецЦикла;  	
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребления") Тогда	
		
		Массив = ПерерасчетПоЕдиницамПотребленияНаСервере();
		Объект.СписокУслуг.Очистить();
		Если Массив.Количество()=0 Тогда
			Сообщить ("нет данных");
		Иначе
		СтрокаТЧ = Объект.СписокУслуг.Добавить();
		СтрокаТЧ.Сумма = Массив[0].Сумма;
		СтрокаТЧ.Услуга = объект.Услуга;
		КонецЕсли;
							
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребленияГрупповое") Тогда	
		
		Массив = ПерерасчетПоЕдиницамПотребленияГрупповоеНаСервере();
		
		Объект.СписокУслуг.Очистить();
		РазмерМассива = Массив.Количество()-1;
		Индекс = 0;
		Пока Индекс <= РазмерМассива Цикл
			СтрокаТЧ = Объект.СписокУслуг.Добавить();
			СтрокаТЧ.Услуга = Массив[индекс].Услуга;
			СтрокаТЧ.ЛицевойСчет = Массив[индекс].ЛицевойСчет;
			СтрокаТЧ.Сумма = Массив[индекс].СУмма;
			Индекс = Индекс+1;
		КонецЦикла;
		
	//Михайлов БИТ начало работ по ЛТ №52
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки") Тогда	
		//Получаем результат расчета
		Массив = ПерерасчетРанееПрименяемойСтавкиЗаменаСтавкиНаСервере();
		//Чистим ТЧ 
		Объект.СписокУслуг.Очистить();
		//Орпеделяем количество строк в массиве
		РазмерМассива = Массив.Количество()-1;
		Индекс = 0;
		//Создаем строки в ТЧ и заполняем их данными из массива
		Пока Индекс <= РазмерМассива Цикл
			СтрокаТЧ = Объект.СписокУслуг.Добавить();
			//Добавляем услугу в ТЧ,нужно для проведения
			СтрокаТЧ.Услуга = объект.Услуга;
			СтрокаТЧ.ЛицевойСчет = Массив[индекс].ЛицевойСчет;
			СтрокаТЧ.Сумма = Массив[индекс].Сумма;
			Индекс = Индекс+1;
		КонецЦикла;

	//Конец работ по ЛТ №52
	
	Иначе
	Сообщить ("доп рассчет не требуется");	
	КонецЕсли;
    //КонецРабот
	//бит -
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоЧекуККМ") Тогда
		
		ЗаполнитьПоЧекуНаСервере();
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты") Тогда
		
		ЗаполнитьПоОплатеНаСервере();	

		
	// БИТ ЖКХ 12.03.2020	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов") Тогда
	
		Если НЕ ЗначениеЗаполнено(Объект.УслугаСписания) Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для расчета необходимо заполнить Услугу Начисления!");
			Возврат;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.КонПериода) Тогда	
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для расчета необходимо заполнить настройки периода!");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПереносОстатковСерверДолг();

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков") Тогда
	
		Если НЕ ЗначениеЗаполнено(Объект.УслугаНачисления)
			ИЛИ НЕ ЗначениеЗаполнено(Объект.УслугаСписания) Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для расчета необходимо заполнить настройки услуг переноса остатков!");
			Возврат;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.КонПериода) Тогда	
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для расчета необходимо заполнить настройки периода!");
			Возврат;
		ИначеЕсли Объект.УслугаСписания = Объект.УслугаНачисления Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Услуги для переноса остатков не должны совпадать!");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПереносОстатковСервер(); 
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН") Тогда 
		
		
		
	Иначе
		//Михайлов Начало Работ
		//РассчитатьСуммыПересчетаНаСервере();
		Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавки")
	    И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребления")
	    И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетПоЕдиницамПотребленияГрупповое")
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетВСвязиСИзменениемПлощади")
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки")
	    И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН")	Тогда
			РассчитатьСуммыПересчетаНаСервере();
		КонецЕсли;
		//КонецРабот
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РазностьДатМесяц(ДатаНачала,ДатаКонца)
	
	МесяцНачала = Месяц(ДатаНачала);
	МесяцКонца = Месяц(ДатаКонца);
	ЛетМеждуДатами = Год(ДатаКонца) - Год(ДатаНачала);
	РезультатВМесяцах = ЛетМеждуДатами * 12 - МесяцНачала + МесяцКонца;
	
	Возврат РезультатВМесяцах;

КонецФункции

&НаСервере
Функция ПолучитьРазницуПлощадей(УслугаЖКХ)
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_РазовыеПоУслугамЖКХ.ЛицевойСчет.Квартира КАК Квартира,
		|	бит_РазовыеПоУслугамЖКХ.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
		|ГДЕ
		|	бит_РазовыеПоУслугамЖКХ.ЛицевойСчет = &ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();   	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Квартира = Выборка.Квартира;
	КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
		|ГДЕ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира = &Квартира";
	
	Запрос.УстановитьПараметр("Квартира", Квартира);
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТипКвартиры = Выборка.ТипКвартиры;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот КАК СуммаОборот,
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|	ВложенныйЗапрос1.ОсновнаяСтавка КАК ОсновнаяСтавка,
		|	ВложенныйЗапрос.Квартира КАК Квартира,
		|	ВложенныйЗапрос1.ТипКвартиры КАК ТипКвартиры
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты КАК бит_НачисленияПоУслугамЖКХОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира
		|		ИЗ
		|			РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних) КАК ВложенныйЗапрос
		|		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = ВложенныйЗапрос.Квартира
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_СтавкиНаУслугиСрезПоследних.Услуга КАК Услуга,
		|			бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка КАК ОсновнаяСтавка,
		|			бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры КАК ТипКвартиры
		|		ИЗ
		|			РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних КАК бит_СтавкиНаУслугиСрезПоследних) КАК ВложенныйЗапрос1
		|		ПО бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ = ВложенныйЗапрос1.Услуга
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ = &УслугаЖКХ
		|	И бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет = &ЛицевойСчет
		|	И ВложенныйЗапрос1.ТипКвартиры = &ТипКвартиры";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("УслугаЖКХ", УслугаЖКХ);
	Запрос.УстановитьПараметр("ТипКвартиры", ТипКвартиры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	
	Возврат Таблица;
	
КонецФункции


&НаСервере
Функция ОпределитьВозможностьРасчетаНаСервере()
	
	Для каждого Строка из Объект.СписокУслуг Цикл 
		
		Структура = Новый Структура;
		Структура.Вставить("ЛицевойСчет",Строка.ЛицевойСчет);
		
		НайденныеСтроки = Объект.СписокУслуг.НайтиСтроки(Структура);
		
		КоличествоЭлементов = НайденныеСтроки.Количество();
		
		Если КоличествоЭлементов > 1 Тогда
			
			НоваяТЗ = Новый ТаблицаЗначений;
			НоваяТЗ.Колонки.Добавить("Услуга");
			
			Для каждого СтрокаОдногоЛС из НайденныеСтроки Цикл
				
				Новаястрока = НоваяТЗ.Добавить();
				НоваяСтрока.Услуга = СтрокаОдногоЛС.Услуга;
				
			КонецЦикла;	
			
			ВремТЗ = НоваяТЗ.Скопировать();
			
			Для каждого СтрокаТЗ из ВремТЗ Цикл
				
				Структура = Новый Структура;
				Структура.Вставить("Услуга",СтрокаТЗ.Услуга);
				
				НайденныеСтрокиТЗ = ВремТЗ.НайтиСтроки(Структура);
				
				КоличествоЭлементовТЗ = НайденныеСтрокиТЗ.Количество();
				
				Если КоличествоЭлементовТЗ > 1 Тогда
					
					Возврат Истина;
				Иначе
					Возврат Ложь;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		Возврат Ложь;
	КонецЦикла;	
	
КонецФункции

&НаКлиенте
Процедура РассчитатьЛицевыеСчета(Команда)
	
	РассчитатьОбщедомовыеРасходыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ФайлыЗавершение", ЭтотОбъект), "Сначала запишите документ.");
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Объект", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.бит_рз_ХранилищеДополнительнойИнформации.Форма.ФормаСпискаУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЛС(Команда)
	
	УсловияОтбора	  = Новый Структура("Организация", Объект.Организация);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, УсловияОтбора);
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокУслуг, УникальныйИдентификатор);

КонецПроцедуры
//бит +

&НаСервере
Функция ПерерасчетИзЗаИзмененияПлощадиНаСервере()

		ЛицевыеСчета = объект.ЛицевойСчет;
	
	    Услуги = объект.СписокУслуг.Выгрузить(,"Услуга");
        Услуги.Свернуть("Услуга",);
	
	Ставки = ПолучитьСтавкиНаУслугиНаСервере(ЛицевыеСчета,Услуги);
	Начисления = ПолучитьНачисленияПоУслугамЖКХНаСервере(ЛицевыеСчета,Услуги);
	ДолиПериода = ПолучитьДолюПериодаНаСервере();
	
	ИтогРасчета = Новый ТаблицаЗначений;
	ИтогРасчета.Колонки.Добавить("Услуга");
	ИтогРасчета.Колонки.Добавить("Сумма");
	 	
	Для Каждого Строка из Услуги Цикл
		//МенямНачалоМесяца На КонецМесяца и меняется алгоритм для следующего периода
		Период = КонецМесяца(Объект.НачПериода);
		Сумма = 0;
		Пока Период <= КонецМесяца(объект.КонПериода) Цикл
			Отбор = Новый Структура;                 
			    Отбор.Вставить("Услуга",Строка.Услуга);  
			    отбор.Вставить("ПериодВТ",Период);
			    СтрокаСтавка = Ставки.НайтиСтроки(Отбор);
			Если СтрокаСтавка.Количество()= 0 Тогда 
				сообщить("Нет ставок по "+строка.Услуга+" за "+период);
				Период = КонецМесяца(Период+1);
			Иначе	
			    Отбор = Новый Структура;                                     
			        Отбор.Вставить("Услуга",Строка.Услуга);                     
			        Отбор.Вставить("Период",НачалоМесяца(Период));                  
			        СтрокаНачислено = Начисления.НайтиСтроки(Отбор);
			    Если СтрокаНачислено.Количество()= 0 Тогда
			        сообщить("Нет начислений по "+строка.Услуга+" за "+период);
					Период = КонецМесяца(Период+1);
				Иначе
					Отбор = Новый Структура;                           
			            Отбор.Вставить("Период",Период);                     
			            СтрокаДоляПериода = ДолиПериода.НайтиСтроки(Отбор);				                                  
					СпособРасчета = СтрокаСтавка[0].СпособРасчета;       
					Ставка = СтрокаСтавка[0].ОсновнаяСтавка;              
					Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда  
						Площадь = объект.ПлощадьЖилая;                                                  
					ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда 
						Площадь = Объект.ПлощадьОбщая;                                                       
					ИначеЕсли СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления Тогда  
						Площадь = Объект.ПлощадьДляКапремонта; 
					Иначе
						Сообщить("Способ расчета для "+Строка.Услуга+"не подходит для данного документа");
					КонецЕсли;
						Начислено = СтрокаНачислено[0].СуммаОборот;           
						ДоляПериода = СтрокаДоляПериода[0].ДоляПериода;          
						Сумма = (Площадь*ставка-начислено)*доляПериода;       
						СтрокаНТ = ИтогРасчета.Добавить();      
						СтрокаНТ.Услуга = строка.Услуга;       
						СтрокаНТ.Сумма = Сумма;                 
						Период = КонецМесяца(Период+1);
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КоНецЦикла;
	
	ИтогРасчета.Свернуть("Услуга","Сумма");
		
	Массив = ОбщегоНазначения.ТаблицаЗначенийВМассив(ИтогРасчета);
	
	Возврат Массив;
		
КонецФункции

&НаСервере
Функция ПерерасчетПоЕдиницамПотребленияНаСервере()

		ЛицевыеСчета = объект.ЛицевойСчет;
		Услуги = Объект.Услуга;

	Ставки = ПолучитьСтавкиНаУслугиНаСервере(ЛицевыеСчета,Услуги);
	Начисления = ПолучитьНачисленияПоУслугамЖКХНаСервере(ЛицевыеСчета,Услуги);
	ДолиПериода = ПолучитьДолюПериодаНаСервере();
		
	ИтогРасчета = Новый ТаблицаЗначений;
	ИтогРасчета.Колонки.Добавить("Сумма");
	
	Период = КонецМесяца(Объект.НачПериода);
	Пока Период <= КонецМесяца(объект.Конпериода) Цикл 		
		Отбор = Новый Структура;      
			отбор.Вставить("ПериодВТ",Период);            
			СтрокаСтавка = Ставки.НайтиСтроки(Отбор);
		Если СтрокаСтавка.Количество()<>1 Тогда
			Сообщить ("Нет ставок для "+объект.Услуга);
			Период = КонецМесяца(Период+1);
		Иначе
			Отбор = Новый Структура;
			    Отбор.Вставить("Период", НачалоМесяца(Период));
				СтрокаНачисления = Начисления.НайтиСтроки(отбор);
			Если СтрокаНачисления.Количество() <>1 Тогда
				Начислено = 0;
			Иначе
				Начислено = строкаНачисления[0].СуммаОборот;
			КонецЕсли;
			Отбор = Новый Структура;
				Отбор.Вставить("Период", Период);
				СтрокаДолиПериода = ДолиПериода.НайтиСтроки(отбор);
			Ставка = СтрокаСтавка[0].СверхНормативнаяСтавка;
			ДоляПериода = СтрокаДолиПериода[0].ДоляПериода;
			СтрокаНТ = ИтогРасчета.Добавить();
			СтрокаНТ.Сумма = (объект.КоличествоЕдиницПотребления*Ставка - Начислено)*ДоляПериода;
			Период = КонецМесяца(Период+1);
		КонецЕсли;
	КонецЦикла;
	
	ИтогРасчета.Свернуть(,"Сумма");
	
	Массив = ОбщегоНазначения.ТаблицаЗначенийВМассив(ИтогРасчета);

Возврат Массив;   
	                      
КонецФункции

&НаСервере
Функция ПерерасчетПоЕдиницамПотребленияГрупповоеНаСервере()

	ЛицевыеСчета = объект.СписокУслуг.Выгрузить(,"ЛицевойСчет"); 
	ЛицевыеСчета.Свернуть("ЛицевойСчет",);
	
	Услуги = объект.СписокУслуг.Выгрузить(,"Услуга");
    Услуги.Свернуть("Услуга",);
	
	ДолиПериода = ПолучитьДолюПериодаНаСервере();    
	Ставки = ПолучитьСтавкиНаУслугиНаСервере(ЛицевыеСчета,Услуги);
	Начисления = ПолучитьНачисленияПоУслугамЖКХНаСервере(ЛицевыеСчета,Услуги);
	
		
	ИтогРасчета = Новый ТаблицаЗначений;
	ИтогРасчета.Колонки.Добавить("ЛицевойСчет");
	ИтогРасчета.Колонки.Добавить("Услуга");
	ИтогРасчета.Колонки.Добавить("Сумма");
	
	Для Каждого ТекущаяСтрока из объект.СписокУслуг Цикл
		Период = КонецМесяца(объект.НачПериода);
		ЛицевойСчет = ТекущаяСтрока.ЛицевойСчет;  
		Услуга = ТекущаяСтрока.Услуга;
	    Пока Период <= КонецМесяца(Объект.КонПериода) Цикл
		    Отбор = Новый Структура;
		        Отбор.Вставить("ПериодВТ",Период);
    			Отбор.Вставить("ЛицевойСчет",ЛицевойСчет);
    			Отбор.Вставить("Услуга",Услуга);
    			СтрокаСтавок = Ставки.НайтиСтроки(Отбор);
    		Если СтрокаСтавок.Количество()<>1 Тогда
    			Сообщить("Нет ставки за "+Период+" по услуге "+Услуга+" для Лицевого счета "+ЛицевойСчет);
    			Период = КонецМесяца(Период+1);
    		Иначе
    			Отбор = Новый Структура;
    			    Отбор.Вставить("Период",НачалоМесяца(Период));      
    				Отбор.Вставить("ЛицевойСчет",ЛицевойСчет); 
    				Отбор.Вставить("Услуга",Услуга);
    				СтрокаНачислений = Начисления.НайтиСтроки(Отбор);
    		    Если СтрокаНачислений.Количество()<>1 Тогда
    			    Сообщить("Нет начисления за "+Период+" по услуге "+Услуга+" для Лицевого счета "+ЛицевойСчет);
					Период = КонецМесяца(Период+1);
    			Иначе
    				Отбор = Новый Структура;
    				    Отбор.Вставить("Период",Период);
    					СтрокаДолейПериода = ДолиПериода.НайтиСтроки(Отбор);
    				Начислено = СтрокаНачислений[0].СуммаОборот;
    				Ставка = СтрокаСтавок[0].СверхНормативнаяСтавка;
    				Доляпериода = СтрокаДолейПериода[0].ДоляПериода;
    				СтрокаНТ = ИтогРасчета.Добавить();
    				СтрокаНТ.ЛицевойСчет = ЛицевойСчет;
    				СтрокаНТ.Услуга = Услуга;
    				СтрокаНТ.Сумма = (объект.КоличествоЕдиницПотребления*Ставка - Начислено)*ДоляПериода;
    				Период = КонецМесяца(Период+1);
    			КонецЕсли;
    		КонецЕсли;
    	КонецЦикла;
	КонецЦикла;
	
	ИтогРасчета.Свернуть("ЛицевойСчет,Услуга","Сумма");
	Массив = общегоНазначения.ТаблицаЗначенийВМассив(ИтогРасчета);
	Возврат Массив;
КонецФункции

//Михайлов БИТ начало работ по ЛТ №52

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляРасчетаНаСервере(ЛицевыеСчета,Услуги,НачалоПериода,КонецПериода,ВключаяРазовые,Организация,ДолиПериода)
	
	МВТ = Новый МенеджерВременныхТаблиц;

#Область ПроверкаСпособаРасчетаУслуги	
	СпособыРасчета = Новый Массив;
	СпособыРасчета.Добавить(Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади);
	СпособыРасчета.Добавить(Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади);
	СпособыРасчета.Добавить(Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления);
	РежимПотребления = Справочники.бит_РежимыПотребленияУслуг.НеНачислять;
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
#Область ТекстЗапроса
	Запрос.Текст = 	"ВЫБРАТЬ
	                //Получаем список периодов для которых нужны данные
	               	|	НАЧАЛОПЕРИОДА(ТаблицаПериодов.Период, МЕСЯЦ) КАК Период
	               	|ПОМЕСТИТЬ СписокПериодов
	               	|ИЗ
	               	|	&ТаблицаПериодов КАК ТаблицаПериодов
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Получаем комбинации Период+ЛС+Услуга зарегистрированные в календарном месяце
					|	бит_СведенияПоУслугамЛС.Период КАК Период,
	               	|	бит_СведенияПоУслугамЛС.ЛицевойСчет КАК ЛицевойСчет,
	               	|	НАЧАЛОПЕРИОДА(бит_СведенияПоУслугамЛС.Период, МЕСЯЦ) КАК НачалоМесяца,
	               	|	бит_СведенияПоУслугамЛС.Услуга КАК Услуга
	               	|ПОМЕСТИТЬ ВыборкаИзРегистра
	               	|ИЗ
	               	|	РегистрСведений.бит_СведенияПоУслугамЛС КАК бит_СведенияПоУслугамЛС
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_УстановкаИзменениеУслугПоЛС КАК бит_УстановкаИзменениеУслугПоЛС
	               	|		ПО бит_СведенияПоУслугамЛС.Регистратор = бит_УстановкаИзменениеУслугПоЛС.Ссылка
	               	|ГДЕ
	               	|	бит_СведенияПоУслугамЛС.Активность = &Активность
	               	|	И бит_СведенияПоУслугамЛС.ЛицевойСчет В(&ЛицевойСчет)
	               	|	И бит_СведенияПоУслугамЛС.Услуга В(&Услуга)
	               	|	И бит_СведенияПоУслугамЛС.Использовать = &Использовать
	               	|	И бит_СведенияПоУслугамЛС.РежимПотребления <> &РежимПотребления
	               	|	И ТИПЗНАЧЕНИЯ(бит_СведенияПоУслугамЛС.Регистратор.Ссылка) = ТИП(бит_УстановкаИзменениеУслугПоЛС)
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Получаем комбинации Период+ЛС+Услуга последние зарегистрированные в календарном месяце
	               	|	ВыборкаИзРегистра.ЛицевойСчет КАК ЛицевойСчет,
	               	|	ВыборкаИзРегистра.НачалоМесяца КАК НачалоМесяца,
	               	|	ВыборкаИзРегистра.Услуга КАК Услуга,
	               	|	МАКСИМУМ(ВыборкаИзРегистра.Период) КАК Период
	               	|ПОМЕСТИТЬ АктуальныйПериод
	               	|ИЗ
	               	|	ВыборкаИзРегистра КАК ВыборкаИзРегистра
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	ВыборкаИзРегистра.ЛицевойСчет,
	               	|	ВыборкаИзРегистра.НачалоМесяца,
	               	|	ВыборкаИзРегистра.Услуга
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Сопоставляем комбинации Период+ЛС+Услуга со списком периодов
					|	СписокПериодов.Период КАК Период,
	               	|	АктуальныйПериод.ЛицевойСчет КАК ЛицевойСчет,
	               	|	АктуальныйПериод.Услуга КАК Услуга,
	               	|	МАКСИМУМ(АктуальныйПериод.Период) КАК ПериодРегистра
	               	|ПОМЕСТИТЬ Маркеры
	               	|ИЗ
	               	|	СписокПериодов КАК СписокПериодов
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныйПериод КАК АктуальныйПериод
	               	|		ПО СписокПериодов.Период >= АктуальныйПериод.НачалоМесяца
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	СписокПериодов.Период,
	               	|	АктуальныйПериод.ЛицевойСчет,
	               	|	АктуальныйПериод.Услуга
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Выбираем из регистра данные для каждого календарного месяца
					|	бит_СведенияПоУслугамЛС.Период КАК Период,
	               	|	бит_СведенияПоУслугамЛС.ЛицевойСчет КАК ЛицевойСчет,
	               	|	НАЧАЛОПЕРИОДА(бит_СведенияПоУслугамЛС.Период, МЕСЯЦ) КАК НачалоМесяца,
	               	|	бит_СведенияПоУслугамЛС.Услуга КАК Услуга,
	               	|	бит_СведенияПоУслугамЛС.СпособРасчета КАК СпособРасчета,
	               	|	бит_СведенияПоУслугамЛС.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               	|ПОМЕСТИТЬ ВыборкаИзРегистраПолная
	               	|ИЗ
	               	|	РегистрСведений.бит_СведенияПоУслугамЛС КАК бит_СведенияПоУслугамЛС
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_УстановкаИзменениеУслугПоЛС КАК бит_УстановкаИзменениеУслугПоЛС
	               	|		ПО бит_СведенияПоУслугамЛС.Регистратор = бит_УстановкаИзменениеУслугПоЛС.Ссылка
	               	|ГДЕ
	               	|	бит_СведенияПоУслугамЛС.Активность = &Активность
	               	|	И бит_СведенияПоУслугамЛС.ЛицевойСчет В(&ЛицевойСчет)
	               	|	И бит_СведенияПоУслугамЛС.Услуга В(&Услуга)
	               	|	И бит_СведенияПоУслугамЛС.Использовать = &Использовать
	               	|	И бит_СведенияПоУслугамЛС.РежимПотребления <> &РежимПотребления
	               	|	И ТИПЗНАЧЕНИЯ(бит_СведенияПоУслугамЛС.Регистратор.Ссылка) = ТИП(бит_УстановкаИзменениеУслугПоЛС)
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Делаем проверку на способ расчета, если способ расчета не в списке, то коэффициент ставим 0 иначе 1
					//Нужно чтобы исключить из расчета услуги с другим способ расчета, в расчете будем результат расчета умножать на коэффициент
	               	|	Маркеры.Период КАК Период,
	               	|	Маркеры.ЛицевойСчет КАК ЛицевойСчет,
	               	|	Маркеры.Услуга КАК Услуга,
	               	|	ВыборкаИзРегистраПолная.СпособРасчета КАК СпособРасчета,
	               	|	ВыборкаИзРегистраПолная.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	               	|	ВЫБОР
	               	|		КОГДА ВыборкаИзРегистраПолная.СпособРасчета В (&СпособыРасчета)
	               	|			ТОГДА 1
	               	|		ИНАЧЕ 0
	               	|	КОНЕЦ КАК Коэффициент
	               	|ПОМЕСТИТЬ Коэффициенты
	               	|ИЗ
	               	|	Маркеры КАК Маркеры
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыборкаИзРегистраПолная КАК ВыборкаИзРегистраПолная
	               	|		ПО Маркеры.ЛицевойСчет = ВыборкаИзРегистраПолная.ЛицевойСчет
	               	|			И Маркеры.Услуга = ВыборкаИзРегистраПолная.Услуга
	               	|			И Маркеры.ПериодРегистра = ВыборкаИзРегистраПолная.Период
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Получаем список месяцев для выборки жилой/общей площади
	               	|	ТаблицаПериодов.Период КАК Период
	               	|ПОМЕСТИТЬ ВТ
	               	|ИЗ
	               	|	&ТаблицаПериодов КАК ТаблицаПериодов
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Получаем комбинации Период+ЛС последние зарегистрированные в календарном месяце и сопоставляем их с таблицей периодов
	               	|	МАКСИМУМ(бит_СведенияОКвартире.Период) КАК Период,
	               	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	               	|	ВТ.Период КАК ПериодВТ
	               	|ПОМЕСТИТЬ ВТ1
	               	|ИЗ
	               	|	ВТ КАК ВТ
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
	               	|			ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартире.Квартира
	               	|		ПО (ВТ.Период >= бит_СведенияОКвартире.Период)
	               	|ГДЕ
	               	|	бит_ЛицевыеСчета.Ссылка В(&ЛицевойСчет)
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	бит_ЛицевыеСчета.Ссылка,
	               	|	ВТ.Период
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Получаем Площади
					|	ВТ1.ЛицевойСчет КАК ЛицевойСчет,
	               	|	бит_СведенияОКвартире.ОбщаяПлощадь КАК ОБщаяПлощадь,
	               	|	бит_СведенияОКвартире.ЖилаяПлощадь КАК ЖилаяПлощадь,
	               	|	ВТ1.ПериодВТ КАК ПериодВТ,
	               	|	ВТ1.Период КАК Период,
	               	|	НАЧАЛОПЕРИОДА(ВТ1.ПериодВТ, МЕСЯЦ) КАК Поле1
	               	|ПОМЕСТИТЬ Площади
	               	|ИЗ
	               	|	ВТ1 КАК ВТ1
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
	               	|			ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартире.Квартира
	               	|		ПО (бит_СведенияОКвартире.Период = ВТ1.Период)
	               	|			И (бит_ЛицевыеСчета.Ссылка = ВТ1.ЛицевойСчет)
	               	|ГДЕ
	               	|	бит_ЛицевыеСчета.Ссылка В(&ЛицевойСчет)
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
					//Получаем СВодим все в одну таблицу
	               	|	Коэффициенты.Период КАК Период,
	               	|	Коэффициенты.ЛицевойСчет КАК ЛицевойСчет,
	               	|	Коэффициенты.Услуга КАК Услуга,
	               	|	Коэффициенты.СпособРасчета КАК СпособРасчета,
	               	|	Коэффициенты.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	               	|	Коэффициенты.Коэффициент КАК Коэффициент,
	               	|	Площади.ОБщаяПлощадь КАК ОБщаяПлощадь,
	               	|	Площади.ЖилаяПлощадь КАК ЖилаяПлощадь
	               	|ПОМЕСТИТЬ СпособРасчетаУслуги
	               	|ИЗ
	               	|	Коэффициенты КАК Коэффициенты
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ Площади КАК Площади
	               	|		ПО Коэффициенты.ЛицевойСчет = Площади.ЛицевойСчет
	               	|			И Коэффициенты.Период = Площади.Поле1
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
					//Убиваем все таблицы, кроме сводной.
	               	|УНИЧТОЖИТЬ СписокПериодов
	                |;
	               	|УНИЧТОЖИТЬ ВыборкаИзРегистра
					|;
	               	|УНИЧТОЖИТЬ АктуальныйПериод
					|;
	               	|УНИЧТОЖИТЬ Маркеры
					|;
	               	|УНИЧТОЖИТЬ ВыборкаИзРегистраПолная
					|;
	               	|УНИЧТОЖИТЬ Коэффициенты
					|;
	               	|УНИЧТОЖИТЬ ВТ
					|;
	               	|УНИЧТОЖИТЬ ВТ1";
	
	
#КонецОбласти
	Запрос.УстановитьПараметр("Активность", Истина);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевыеСчета);
	Запрос.УстановитьПараметр("ТаблицаПериодов", ДолиПериода);
    Запрос.УстановитьПараметр("Услуга", Услуги);
    Запрос.УстановитьПараметр("Использовать", перечисления.ДаНет.Да);
	Запрос.УстановитьПараметр("СпособыРасчета", СпособыРасчета);
	Запрос.УстановитьПараметр("РежимПотребления", РежимПотребления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
#КонецОбласти

#Область ПолучениеОбъемовНаСервере
	
    Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МВТ;

#Область ТекстЗапросаОбъемыПоНачислениям
    Запрос2.Текст = 	"ВЫБРАТЬ
	                    //Получаем список периодов для которых нужны данные
                    	|	НАЧАЛОПЕРИОДА(ТаблицаПериодов.Период, МЕСЯЦ) КАК Период,
						|   ТаблицаПериодов.ДоляПериода как ДоляПериода
                    	|ПОМЕСТИТЬ ВТ
                    	|ИЗ
                    	|	&ТаблицаПериодов КАК ТаблицаПериодов
                    	|;
                    	|
                    	|////////////////////////////////////////////////////////////////////////////////
                    	|ВЫБРАТЬ
						//Получаем объемы
						|	бит_ОбъемыПоУслугамЖКХ.ЛицевойСчет КАК ЛицевойСчет,
                    	|	бит_ОбъемыПоУслугамЖКХ.Услуга КАК Услуга,
                    	|	СУММА(бит_ОбъемыПоУслугамЖКХ.Объем) КАК Объем,
                    	|	НАЧАЛОПЕРИОДА(бит_ОбъемыПоУслугамЖКХ.Период, МЕСЯЦ) КАК Поле1
                    	|ПОМЕСТИТЬ ВТ1
                    	|ИЗ
                    	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ КАК бит_ОбъемыПоУслугамЖКХ
                    	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
                    	|		ПО бит_ОбъемыПоУслугамЖКХ.Регистратор = бит_РазовыеПоУслугамЖКХ.Ссылка
                    	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_НачислениеПоЛицевымСчетам КАК бит_НачислениеПоЛицевымСчетам
                    	|		ПО бит_ОбъемыПоУслугамЖКХ.Регистратор = бит_НачислениеПоЛицевымСчетам.Ссылка
                    	|ГДЕ
                    	|	бит_ОбъемыПоУслугамЖКХ.Период МЕЖДУ &НачалоПериода И &КонецПериода
                    	|	И бит_ОбъемыПоУслугамЖКХ.ЛицевойСчет В(&ЛицевойСчет)
                    	|	И бит_ОбъемыПоУслугамЖКХ.Услуга = &Услуга
                    	|	И ВЫБОР
                    	|			КОГДА &ВключаяРазовые
                    	|				ТОГДА ТИПЗНАЧЕНИЯ(бит_ОбъемыПоУслугамЖКХ.Регистратор.Ссылка) В (ТИП(бит_НачислениеПоЛицевымСчетам), ТИП(бит_РазовыеПоУслугамЖКХ))
                    	|			ИНАЧЕ ТИПЗНАЧЕНИЯ(бит_ОбъемыПоУслугамЖКХ.Регистратор.Ссылка) В (ТИП(бит_НачислениеПоЛицевымСчетам))
                    	|		КОНЕЦ
                    	|
                    	|СГРУППИРОВАТЬ ПО
                    	|	бит_ОбъемыПоУслугамЖКХ.Услуга,
                    	|	бит_ОбъемыПоУслугамЖКХ.ЛицевойСчет,
                    	|	НАЧАЛОПЕРИОДА(бит_ОбъемыПоУслугамЖКХ.Период, МЕСЯЦ)
                    	|;
                    	|
                    	|////////////////////////////////////////////////////////////////////////////////
                    	|ВЫБРАТЬ
						//Сопоставлеям объемы с таблицей периодов
                    	|	ВТ1.ЛицевойСчет КАК ЛицевойСчет,
                    	|	ВТ1.Услуга КАК Услуга,
                    	|	ВТ1.Объем КАК Объем,
                    	|	ВТ.Период КАК Период
                    	|ПОМЕСТИТЬ ОбъемыПоНачислениям
                    	|ИЗ
                    	|	ВТ КАК ВТ
                    	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
                    	|		ПО ВТ.Период = ВТ1.Поле1
                    	|;
                    	|
                    	|////////////////////////////////////////////////////////////////////////////////
						//УБиваем ненужные таблицы
                    	|УНИЧТОЖИТЬ ВТ1";
#КонецОбласти
                             
    Запрос2.УстановитьПараметр("ЛицевойСчет", ЛицевыеСчета);
    Запрос2.УстановитьПараметр("Услуга", Услуги);
	Запрос2.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос2.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос2.УстановитьПараметр("ВключаяРазовые", ВключаяРазовые);
	ЗАпрос2.УстановитьПараметр("ТаблицаПериодов", ДолиПериода);
 
    РезультатЗапроса2 = Запрос2.Выполнить();
#КонецОбласти

#Область ПолучитьНачисленияПоУслугамНаСервере
	
	Запрос3 = Новый Запрос();
	Запрос3.МенеджерВременныхТаблиц = МВТ;
#Область ТекстЗапроса
	ЗАпрос3.Текст = "ВЫБРАТЬ
	                |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
	                |	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ) КАК Период,
	                |	СУММА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот) КАК СуммаОборот
	                |ПОМЕСТИТЬ НачисленияпоУслугам
	                |ИЗ
	                |	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(, , Регистратор, ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	                |ГДЕ
	                |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет В(&ЛицевойСчет)
	                |	И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ В(&Услуги)
	                |	И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период МЕЖДУ &НачПериода И &КонПериода
	                |	И ВЫБОР
	                |			КОГДА &ВключаяРазовые
	                |				ТОГДА ТИПЗНАЧЕНИЯ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Ссылка) В (ТИП(Документ.бит_НачислениеПоЛицевымСчетам), ТИП(Документ.бит_РазовыеПоУслугамЖКХ))
	                |			ИНАЧЕ ТИПЗНАЧЕНИЯ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Ссылка) В (ТИП(Документ.бит_НачислениеПоЛицевымСчетам))
	                |		КОНЕЦ
	                |	И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Организация = &Организация
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет,
	                |	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ)";
#КонецОбласти
	
	Запрос3.УстановитьПараметр("ЛицевойСчет",ЛицевыеСчета);
	Запрос3.УстановитьПараметр("Услуги",Услуги);
	Запрос3.УстановитьПараметр("НачПериода",НачалоПериода);
	Запрос3.УстановитьПараметр("КонПериода",КонецПериода);
	Запрос3.УстановитьПараметр("ВключаяРазовые",ВключаяРазовые);
	Запрос3.УстановитьПараметр("Организация",Организация);
	РезультатЗапроса3 = Запрос3.Выполнить();
#КонецОбласти

#Область Содная
Запрос4 = новый Запрос();
Запрос4.МенеджерВременныхТаблиц = МВТ;
Запрос4.текст = "ВЫБРАТЬ
                //Собираем все данные в одну таблицу
                |	СпособРасчетаУслуги.Период КАК Период,
                |	СпособРасчетаУслуги.ЛицевойСчет КАК ЛицевойСчет,
                |	СпособРасчетаУслуги.Услуга КАК Услуга,
                |	СпособРасчетаУслуги.СпособРасчета КАК СпособРасчета,
                |	СпособРасчетаУслуги.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
                |	СпособРасчетаУслуги.Коэффициент КАК Коэффициент,
                |	СпособРасчетаУслуги.ОБщаяПлощадь КАК ОБщаяПлощадь,
                |	СпособРасчетаУслуги.ЖилаяПлощадь КАК ЖилаяПлощадь,
                |	ОбъемыПоНачислениям.Объем КАК Объем,
                |	НачисленияпоУслугам.СуммаОборот КАК СуммаОборот,
                |	ВТ.ДоляПериода КАК доляПериода
                |ИЗ
                |	СпособРасчетаУслуги КАК СпособРасчетаУслуги
                |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыПоНачислениям КАК ОбъемыПоНачислениям
                |		ПО СпособРасчетаУслуги.Период = ОбъемыПоНачислениям.Период
                |			И СпособРасчетаУслуги.ЛицевойСчет = ОбъемыПоНачислениям.ЛицевойСчет
                |		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияпоУслугам КАК НачисленияпоУслугам
                |		ПО СпособРасчетаУслуги.Период = НачисленияпоУслугам.Период
                |			И СпособРасчетаУслуги.ЛицевойСчет = НачисленияпоУслугам.ЛицевойСчет
                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
                |		ПО СпособРасчетаУслуги.Период = ВТ.Период";
				
Результат = Запрос4.Выполнить().Выгрузить();
#КонецОбласти
//Передаем данные для обработки
Возврат Результат;

КонецФункции

&НаСервере
Функция ПерерасчетРанееПрименяемойСтавкиЗАМЕНАСтавкиНаСервере()
	
	//готовим данные для передачи в функцию
	ЛицевыеСчета = объект.СписокУслуг.Выгрузить(,"ЛицевойСчет"); 
	ЛицевыеСчета.Свернуть("ЛицевойСчет",);
	Услуги = Объект.Услуга;
	ВключаяРазовые = объект.ВключаяРазовые;
	КонецПериода = КонецМесяца(объект.КонПериода);
	НачалоПериода = НачалоМесяца(Объект.НачПериода);
	Организация = объект.Организация;
	ДолиПериода = ПолучитьДолюПериодаНаСервере();
	//Данные нужные для расчета
	Ставка = объект.Сумма;
	//Получаем данные для расчета
	ДанныеДляРасчета = ПолучитьДанныеДляРасчетаНаСервере(ЛицевыеСчета,Услуги,НачалоПериода,КонецПериода,ВключаяРазовые,Организация,ДолиПериода);
	//Создаем таблицу значений в которую будем писать результат расчета 	
	РезультатРасчета = Новый ТаблицаЗначений;
	РезультатРасчета.Колонки.Добавить("ЛицевойСчет");
	РезультатРасчета.Колонки.Добавить("Сумма");
	//Для каждого лицевого счета из ТЧ формы определяем сумму
	Для Каждого ТекущаяСтрока из объект.СписокУслуг Цикл
		Период = НачалоМесяца(объект.НачПериода);
		ЛицевойСчет = ТекущаяСтрока.ЛицевойСчет;
		Сумма = 0;
		Индекс = 0;
		Пока Период <= КонецМесяца(Объект.КонПериода) Цикл
			//Ищем в полученной таблице данные по периоду и лицевому счету
		    Отбор = Новый Структура;
		        Отбор.Вставить("Период",Период);
    			Отбор.Вставить("ЛицевойСчет",ЛицевойСчет);
       			СтрокаДанных = ДанныеДляРасчета.НайтиСтроки(Отбор);
			//Делаем проверку, что в таблице есть только одна строка удовлетворяющая отбору, если их меньше значит нет данных, если их больше значит запрос написан неверно
    		Если СтрокаДанных.Количество()<>1 Тогда
    			Сообщить("Нет данных за "+Период+" для Лицевого счета "+ЛицевойСчет);
    			Период = добавитьмесяц(Период,1);
			Иначе
			//Определяем объем
			    Способ = СтрокаДанных[0].СпособРасчета;
				//Если объем равен нулю, тогда объем принимаем равным площади или количеству ед. измерения
			    Если СтрокаДанных[0].Объем = 0 или СтрокаДанных[0].Объем = null Тогда
				    Если Способ = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади ТОгда 
					   	Объем = СтрокаДанных[0].ОбщаяПлощадь;
			    	ИначеЕсли Способ = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади ТОгда 
				    	Объем = СтрокаДанных[0].ЖилаяПлощадь;
					ИначеЕсли Способ = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления ТОгда 
	    				Объем = СтрокаДанных[0].КоличествоЕдиницПотребления;
					Иначе
					//Если способ расчета не входит в группу, тогда объем принимаем равным нулю, чтобы в формуле был 0, а не null
						Объем = 0;
					КонецЕсли;
				Иначе
					Объем = СтрокаДанных[0].Объем;
				КонецЕсли;
				//Проверяем что начисление не равно null
				Если СтрокаДанных[0].СуммаОборот = null Тогда Начислено = 0 Иначе Начислено = СтрокаДанных[0].СуммаОборот КонецЕсли;
				//Накапливаем сумму по месяцам
			    Итог = (Объем * Ставка - Начислено) * СтрокаДанных[0].ДоляПериода * СтрокаДанных[0].Коэффициент;
				Сумма = сумма + итог;
			    Период = добавитьмесяц(Период,1);
			КонецЕсли;
		КонецЦикла;
		//ДОбавляем строку в ТЗ
		СтрокаНТ = РезультатРасчета.Добавить();
    		СтрокаНТ.ЛицевойСчет = ЛицевойСчет;
    		СтрокаНТ.Сумма = Сумма; 
		КонецЦикла;
	//Конвертируем ТЗ в Масив и отправляем на клиента
	Массив = общегоНазначения.ТаблицаЗначенийВМассив(РезультатРасчета);
	Возврат Массив;
		
КонецФункции
//Конец работ по ЛТ№52

//Начало Функции получения справочных данных 11.02.2021
&НаСервере
Функция ПолучитьНачисленияПоУслугамЖКХНаСервере(ЛицевыеСчета,Услуги)
	
	Запрос = Новый Запрос();
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Услуга,
	               |	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов, МЕСЯЦ) КАК Период,
	               |	СУММА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот) КАК СуммаОборот
	               |ИЗ
	               |	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(, , Регистратор, ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	               |ГДЕ
	               |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет В(&ЛицевойСчет)
	               |	И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ В(&Услуги)
	               |	И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов МЕЖДУ &НачПериода И &КонПериода
	               |	И (ТИПЗНАЧЕНИЯ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Ссылка) = ТИП(Документ.бит_НачислениеПоЛицевымСчетам)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Ссылка) = ТИП(Документ.бит_НачисленияПоСчетчикам)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Ссылка) = ТИП(Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными)
				   // задача 8140
				   //|			ИЛИ ТИПЗНАЧЕНИЯ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Ссылка) = ТИП(Документ.бит_РазовыеПоУслугамЖКХ)
				   // задача 8140
				   |		)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет,
	               |	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
	               |	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевыеСчета);
	Запрос.УстановитьПараметр("Услуги",Услуги);
	Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Объект.НачПериода));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Объект.КонПериода));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выгрузить();
	
	Возврат Выборка;
	
КонецФункции

//готов
&НаСервере
Функция ПолучитьДолюПериодаНаСервере()
	//Функция возвращает таблицу значений со столбцами период (1 число месяца) и доля периода (отношение дней попавших в месяц к количеству дней в месяце)
	ПоследнийДеньНачалаПериода = День(КонецМесяца(объект.НачПериода));
	ДоляВПервомПериоде = (ПоследнийДеньНачалаПериода-День(Объект.НачПериода)+1)/ПоследнийДеньНачалаПериода;
	ПервыйДеньКонцаПериода = День(НачалоМесяца(объект.КонПериода));
	ДоляВПоследнемПериоде = (день(объект.КонПериода) - ПервыйДеньКонцаПериода +1)/День(КонецМесяца(объект.КонПериода));
	ДоляВОбщемПериоде = (День(Объект.КонПериода)-День(Объект.НачПериода)+1)/день(КонецМесяца(Объект.НачПериода));
	
	ТаблицаДолейПериода = Новый ТаблицаЗначений;
	ТаблицаДолейПериода.Колонки.Добавить("Период",НОВЫЙ ОписаниеТипов("Дата"));
	ТаблицаДолейПериода.Колонки.Добавить("ДоляПериода", Новый ОписаниеТипов("Число"));

	Период = НачалоМесяца(объект.НачПериода);
	Пока Период <= объект.КонПериода Цикл
	    Если НачалоМесяца(объект.НачПериода) =  НачалоМесяца (объект.КонПериода) Тогда 
	    	ДоляПериода = ДоляВОбщемПериоде;
	    ИначеЕсли НЕ Период = НачалоМесяца(объект.НачПериода) И НЕ Период=НачалоМесяца(объект.КонПериода) Тогда
	    	ДоляПериода =1;
	    ИначеЕсли Период = НачалоМесяца(объект.НачПериода)Тогда
	    	ДоляПериода = ДоляВПервомПериоде; 
	    ИначеЕсли Период= НачалоМесяца(объект.КонПериода) Тогда
	    	ДоляПериода = ДоляВПоследнемПериоде;		
		КонецЕсли;
	Строка = ТаблицаДолейПериода.Добавить();
	Строка.ДоляПериода = ДоляПериода;
		//Михайлов17.02.2021
	//Строка.Период = Период;
	Строка.Период = КонецМесяца(Период);
	Период = ДобавитьМесяц(Период,1);
	КонецЦикла;
	
	Возврат ТаблицаДолейПериода;
КонецФункции

//готов
&НаСервере
Функция ПолучитьСтавкиНаУслугиНаСервере (ЛицевыеСчета,Услуги)
		
	Квартиры = ПолучитьРегистрСведенийКвартирыНаСервере(ЛицевыеСчета);
	СведенияПоУслугам = ПолучитьРегистрСведенийСведенияПоУслугамНаЛСНаСервере(ЛицевыеСчета,Услуги);
	СведенияОСтавках = ПолучитьРегистрСведенийСтавкиНаУслугиНаСервере(Услуги);
	
 Запрос = Новый Запрос;
 Запрос.Текст =   "ВЫБРАТЬ
 |    Квартиры.ЛицевойСчет КАК ЛицевойСчет,
 |    Квартиры.ПериодВТ КАК ПериодВТ,
 |    Квартиры.ТипКвартиры КАК ТипКвартиры,
 |    Квартиры.ОбщаяПлощадь КАК ОбщаяПлощадь, 
 |    Квартиры.ЖилаяПлощадь КАК ЖилаяПлощадь, 
 |    Квартиры.СтатусКвартиры КАК СтатусКвартиры
 |ПОМЕСТИТЬ ВТ
 |ИЗ
 |    &Квартиры КАК Квартиры
 |;
 |ВЫБРАТЬ
 |	  СведенияПоУслугам.ПериодВТ КАК ПериодВТ,
 |	  СведенияПоУслугам.ЛицевойСчет как ЛицевойСчет, 
 |	  СведенияПоУслугам.Услуга КАК Услуга,
 |    СведенияПоУслугам.РежимПотребления как РежимПотребления,
 |    СведенияПоУслугам.Поставщик как Поставщик,
 |	  СведенияПоУслугам.СпособРАсчета как СпособРасчета
 |    Поместить ВТ1
 |ИЗ
 |	  &СведенияПоУслугам КАК СведенияПоУслугам
 |;
 |ВЫБРАТЬ
 |	  СведенияОСтавках.ПериодВТ КАК ПериодВТ,
 |	  СведенияОСтавках.Услуга КАК Услуга, 
 |	  СведенияОСтавках.ТипКвартиры КАК ТипКвартиры,
 |	  СведенияОСтавках.СтатусКвартиры КАК СтатусКвартиры,
 |    СведенияОСтавках.РежимПотребления как РежимПотребления,
 |    СведенияОСтавках.Поставщик как Поставщик,
 |    СведенияОСтавках.СверхНормативнаяСтавка КАК СверхНормативнаяСтавка, 
 |    СведенияОСтавках.ПлановаяСтавка КАК ПлановаяСтавка, 
 |    СведенияОСтавках.ОсновнаяСтавка КАК ОсновнаяСтавка, 
 |	  СведенияОСтавках.СпособРАсчета как СпособРасчета
 |    Поместить ВТ2
 |ИЗ
 |	  &СведенияОСтавках КАК СведенияОСтавках
 |;
 |Выбрать
 |    ВТ.ЛицевойСчет как ЛицевойСчет,
 |    ВТ.ПериодВТ КАК ПериодВТ,
 |    ВТ.ТипКвартиры КАК ТипКвартиры,
 |    ВТ.СтатусКвартиры КАК СтатусКвартиры,
 |    ВТ.ОбщаяПлощадь КАК ОбщаяПлощадь, 
 |    ВТ.ЖилаяПлощадь КАК ЖилаяПлощадь, 
 |    ВТ1.Услуга КАК Услуга,
 |    ВТ1.Поставщик как Поставщик,
 |    ВТ1.РежимПотребления КАК РежимПотребления,
 |    ВТ1.СпособРасчета КАК СпособРасчета
 | Поместить ВТ3
 | ИЗ
 | ВТ КАК ВТ
 | ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
 | ВТ1 КАК ВТ1
 |ПО
 | ВТ.ЛИцевойСчет = ВТ1.ЛицевойСчет
 | И ВТ.ПериодВТ = ВТ1.ПериодВТ
 |;
 |ВЫБРАТЬ
 |    ВТ3.ЛицевойСчет как ЛицевойСчет,
 |    ВТ3.ПериодВТ КАК ПериодВТ,
 |    ВТ3.Услуга КАК Услуга,
 |    ВТ2.СверхНормативнаяСтавка КАК СверхНормативнаяСтавка, 
 |    ВТ2.ПлановаяСтавка КАК ПлановаяСтавка,
 |    ВТ2.СпособРАсчета как СпособРасчета,
 |    ВТ2.ОсновнаяСтавка КАК ОсновнаяСтавка
 | ИЗ
 | ВТ2 КАК ВТ2
 | ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
 | ВТ3 КАК ВТ3
 |ПО
 |    ВТ3.ТипКвартиры = ВТ2.ТипКвартиры
 |    И ВТ3.СтатусКвартиры = ВТ2.СтатусКвартиры
 |    И ВТ3.Услуга = ВТ2.Услуга
 |    И ВТ3.Поставщик = ВТ2.Поставщик
 |    И ВТ3.РежимПотребления = ВТ2.РежимПотребления
 |    И ВТ3.СпособРасчета = ВТ2.СпособРасчета
 |    И ВТ3.ПериодВТ = ВТ2.ПериодВТ
 |    И ВТ3.Услуга = ВТ2.Услуга";
 
    Запрос.УстановитьПараметр("Квартиры", Квартиры);
    Запрос.УстановитьПараметр("СведенияПоУслугам", СведенияПоУслугам);
	Запрос.УстановитьПараметр("СведенияОСтавках", СведенияОСтавках);
	
    Результат = Запрос.Выполнить();
	ДанныеОтбора = Результат.Выгрузить();
	
	Возврат ДанныеОтбора;
	КонецФункции

&НаСервере
Функция ПолучитьРегистрСведенийСтавкиНаУслугиНаСервере(Услуги)//готов

	
ТаблицаПериодов = ПолучитьДолюПериодаНаСервере();

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	ТаблицаПериодов.Период КАК Период
               |ПОМЕСТИТЬ ВТ
               |ИЗ
               |	&ТаблицаПериодов КАК ТаблицаПериодов
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	ВТ.Период КАК Период1,
               |	МАКСИМУМ(бит_СтавкиНаУслуги.Период) КАК Период,
               |	бит_СтавкиНаУслуги.Услуга КАК Услуга,
               |	бит_СтавкиНаУслуги.РежимПотребления КАК РежимПотребления,
               |	бит_СтавкиНаУслуги.Поставщик КАК Поставщик,
               |	бит_СтавкиНаУслуги.СпособРасчета КАК СпособРасчета,
               |	бит_СтавкиНаУслуги.СтатусКвартиры КАК СтатусКвартиры,
               |	бит_СтавкиНаУслуги.ТипКвартиры КАК ТипКвартиры
               |ПОМЕСТИТЬ ВТ2
               |ИЗ
               |	ВТ КАК ВТ
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги КАК бит_СтавкиНаУслуги
               |		ПО ВТ.Период >= бит_СтавкиНаУслуги.Период
               |ГДЕ
               |	бит_СтавкиНаУслуги.Услуга В(&Услуги)
               |
               |СГРУППИРОВАТЬ ПО
               |	ВТ.Период,
               |	бит_СтавкиНаУслуги.Услуга,
               |	бит_СтавкиНаУслуги.РежимПотребления,
               |	бит_СтавкиНаУслуги.Поставщик,
               |	бит_СтавкиНаУслуги.СпособРасчета,
               |	бит_СтавкиНаУслуги.СтатусКвартиры,
               |	бит_СтавкиНаУслуги.ТипКвартиры
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	бит_СтавкиНаУслуги.СверхНормативнаяСтавка КАК СверхНормативнаяСтавка,
               |	бит_СтавкиНаУслуги.ПлановаяСтавка КАК ПлановаяСтавка,
               |	бит_СтавкиНаУслуги.ОсновнаяСтавка КАК ОсновнаяСтавка,
               |	бит_СтавкиНаУслуги.ТипКвартиры КАК ТипКвартиры,
               |	бит_СтавкиНаУслуги.СтатусКвартиры КАК СтатусКвартиры,
               |	бит_СтавкиНаУслуги.Услуга КАК Услуга,
               |	бит_СтавкиНаУслуги.Поставщик КАК Поставщик,
               |	бит_СтавкиНаУслуги.РежимПотребления КАК РежимПотребления,
               |	бит_СтавкиНаУслуги.СпособРасчета КАК СпособРасчета,
               |	ВТ2.Период КАК Период,
               |	ВТ2.Период1 КАК ПериодВТ
               |ИЗ
               |	ВТ2 КАК ВТ2
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги КАК бит_СтавкиНаУслуги
               |		ПО ВТ2.Период = бит_СтавкиНаУслуги.Период
               |			И ВТ2.ТипКвартиры = бит_СтавкиНаУслуги.ТипКвартиры
               |			И ВТ2.СтатусКвартиры = бит_СтавкиНаУслуги.СтатусКвартиры
               |			И ВТ2.Услуга = бит_СтавкиНаУслуги.Услуга
               |			И ВТ2.Поставщик = бит_СтавкиНаУслуги.Поставщик
               |			И ВТ2.РежимПотребления = бит_СтавкиНаУслуги.РежимПотребления
               |			И ВТ2.СпособРасчета = бит_СтавкиНаУслуги.СпособРасчета
               |ГДЕ
               |	бит_СтавкиНаУслуги.Услуга В(&Услуги)";

Запрос.УстановитьПараметр("ТаблицаПериодов",ТаблицаПериодов);
Запрос.УстановитьПараметр("Услуги",Услуги);
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выгрузить();

Возврат Выборка;
КонецФункции

&НаСервере
Функция ПолучитьРегистрСведенийКвартирыНаСервере(ЛицевыеСчета)//готов
	
ТаблицаПериодов = ПолучитьДолюПериодаНаСервере();

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ТаблицаПериодов.Период КАК Период
|ПОМЕСТИТЬ ВТ
|ИЗ
|	&ТаблицаПериодов КАК ТаблицаПериодов
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	МАКСИМУМ(бит_СведенияОКвартире.Период) КАК Период,
|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
|	ВТ.Период КАК ПериодВТ
|ПОМЕСТИТЬ ВТ1
|ИЗ
|	ВТ КАК ВТ
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
|			ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартире.Квартира
|		ПО (ВТ.Период >= бит_СведенияОКвартире.Период)
|ГДЕ
|	бит_ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)
|
|СГРУППИРОВАТЬ ПО
|	бит_ЛицевыеСчета.Ссылка,
|	ВТ.Период
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ1.ЛицевойСчет КАК ЛицевойСчет,
|	бит_СведенияОКвартире.ТипКвартиры как ТипКвартиры,
|	бит_СведенияОКвартире.СтатусКвартиры как СтатусКвартиры,
|	бит_СведенияОКвартире.ОбщаяПлощадь как ОБщаяПлощадь,
|	бит_СведенияОКвартире.ЖилаяПлощадь как ЖилаяПлощадь,
|	ВТ1.ПериодВТ КАК ПериодВТ,
|	ВТ1.Период КАК Период
|ИЗ
|	ВТ1 КАК ВТ1
|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
|			ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартире.Квартира
|	По  (бит_СведенияОКвартире.Период = ВТ1.Период
|	И бит_ЛицевыеСчета.ССылка = ВТ1.ЛицевойСчет)
|ГДЕ
|	бит_ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)";

	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("ТаблицаПериодов", ТАблицаПериодов);
	Запрос.УстановитьПараметр("КонПериода", объект.КонПериода);
	Запрос.УстановитьПараметр("НачПериода", добавитьМесяц(Объект.НачПериода,-60));

	РезультатЗапроса = Запрос.Выполнить();   	
	Выборка = РезультатЗапроса.Выгрузить(); 
	
	Возврат Выборка;
	
КонецФункции

&НаСервере
ФУнкция ПолучитьРегистрСведенийСведенияПоУслугамНаЛСНаСервере(ЛицевыеСчета,Услуги)//готов
	
	ТаблицаПериодов = ПолучитьДолюПериодаНаСервере();

    Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
|	ТаблицаПериодов.Период КАК Период
|ПОМЕСТИТЬ ВТ
|ИЗ
|	&ТаблицаПериодов КАК ТаблицаПериодов
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	МАКСИМУМ(бит_СведенияПоУслугамЛС.Период) КАК Период,
|	бит_СведенияПоУслугамЛС.ЛицевойСчет КАК ЛицевойСчет,
|	бит_СведенияПоУслугамЛС.Услуга КАК Услуга,
|	бит_СведенияПоУслугамЛС.Использовать КАК Использовать,
|	бит_СведенияПоУслугамЛС.Активность КАК Активность,
|	ВТ.Период КАК ПериодВТ
|ПОМЕСТИТЬ ВТ1
|ИЗ
|	ВТ КАК ВТ
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС КАК бит_СведенияПоУслугамЛС
|		ПО ВТ.Период >= бит_СведенияПоУслугамЛС.Период
|ГДЕ
|	бит_СведенияПоУслугамЛС.Активность = &Активность
|	И бит_СведенияПоУслугамЛС.ЛицевойСчет В(&ЛицевойСчет)
|	И бит_СведенияПоУслугамЛС.Услуга В(&Услуга)
|	И бит_СведенияПоУслугамЛС.Использовать = &Использовать
|
|СГРУППИРОВАТЬ ПО
|	бит_СведенияПоУслугамЛС.ЛицевойСчет,
|	бит_СведенияПоУслугамЛС.Услуга,
|	бит_СведенияПоУслугамЛС.Использовать,
|	бит_СведенияПоУслугамЛС.Активность,
|	ВТ.Период
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ВТ1.ПериодВТ КАК ПериодВТ,
|	бит_СведенияПоУслугамЛС.Период КАК Период,
|	бит_СведенияПоУслугамЛС.ЛицевойСчет КАК ЛицевойСчет,
|	бит_СведенияПоУслугамЛС.Услуга КАК Услуга,
|	бит_СведенияПоУслугамЛС.РежимПотребления КАК РежимПотребления,
|	бит_СведенияПоУслугамЛС.Поставщик КАК Поставщик,
|	бит_СведенияПоУслугамЛС.СпособРасчета КАК СпособРасчета,
|	бит_СведенияПоУслугамЛС.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
|ИЗ
|	ВТ1 КАК ВТ1
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС КАК бит_СведенияПоУслугамЛС
|		ПО (ВТ1.Период = бит_СведенияПоУслугамЛС.Период
|				И бит_СведенияПоУслугамЛС.ЛицевойСчет = ВТ1.ЛицевойСчет
|				И бит_СведенияПоУслугамЛС.Услуга = ВТ1.Услуга
|				И бит_СведенияПоУслугамЛС.Использовать = ВТ1.Использовать
|				И бит_СведенияПоУслугамЛС.Активность = ВТ1.Активность)
|ГДЕ
|	бит_СведенияПоУслугамЛС.Активность = &Активность
|	И бит_СведенияПоУслугамЛС.ЛицевойСчет В(&ЛицевойСчет)
|	И бит_СведенияПоУслугамЛС.Услуга В(&Услуга)
|	И бит_СведенияПоУслугамЛС.Использовать = &Использовать";

	Запрос.УстановитьПараметр("Активность", Истина);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевыеСчета);
	ЗАпрос.УстановитьПараметр("ТаблицаПериодов", ТаблицаПериодов);
    Запрос.УстановитьПараметр("Услуга", Услуги);
    Запрос.УстановитьПараметр("Использовать", перечисления.ДаНет.Да);
 
	РезультатЗапроса = Запрос.Выполнить();   	
	Выборка = РезультатЗапроса.Выгрузить();
                                                                            
	Возврат Выборка;
	
	
КонецФункции
//Конец Функции для нескольких операций Михайлов 11.02.2021 

&НаСервере
Функция ПолучитьРазницуСуммПриИзмененииПлощадей()
	//Михайлов 07.02.2021  Начало Работ
	
	//Получаем данные по начисленниям по услугам
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
|	СУММА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот) КАК СуммаОборот,
|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов, МЕСЯЦ) КАК Период,
|	ВложенныйЗапрос.СпособРасчета КАК СпособРасчета
|ИЗ
|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(, , , ) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
|			бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
|			бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета
|		ИЗ
|			РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних КАК бит_СведенияПоУслугамЛССрезПоследних
|		ГДЕ
|			бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет
|			И (бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = &СпособРасчета
|					ИЛИ бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = &СпособРасчета1)) КАК ВложенныйЗапрос
|		ПО (ИСТИНА)
|ГДЕ
|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет = &ЛицевойСчет
|	И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов МЕЖДУ &НачалоПериода И &КонецПериода
|	И (ВложенныйЗапрос.СпособРасчета = &СпособРасчета
|			ИЛИ ВложенныйЗапрос.СпособРасчета = &СпособРасчета1)
|
|СГРУППИРОВАТЬ ПО
|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов, МЕСЯЦ),
|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет,
|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
|	ВложенныйЗапрос.СпособРасчета";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("СпособРасчета", Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади);
	Запрос.УстановитьПараметр("СпособРасчета1", Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.КонПериода);
		
	РезультатЗапроса = Запрос.Выполнить();	
	НачисленныеУслуги = РезультатЗапроса.Выгрузить();
	
	//Получаем данные о площадях
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
|	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
|	ВложенныйЗапрос.Период КАК Период,
|	ВложенныйЗапрос.ОбщаяПлощадь КАК ОбщаяПлощадь,
|	ВложенныйЗапрос.ЖилаяПлощадь КАК ЖилаяПлощадь
|ИЗ
|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			бит_СведенияОКвартире.Период КАК Период,
|			бит_СведенияОКвартире.Квартира КАК Квартира,
|			бит_СведенияОКвартире.ОбщаяПлощадь КАК ОбщаяПлощадь,
|			бит_СведенияОКвартире.ЖилаяПлощадь КАК ЖилаяПлощадь
|					ИЗ
|			РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
|		ГДЕ
|			бит_СведенияОКвартире.Квартира = &Квартира) КАК ВложенныйЗапрос
|		ПО (ИСТИНА)
|ГДЕ
|	бит_ЛицевыеСчета.Ссылка = &Ссылка
|УПОРЯДОЧИТЬ ПО
|	Период";
	
		Запрос.УстановитьПараметр("Ссылка", Объект.ЛицевойСчет);
		Запрос.УстановитьПараметр("Квартира", Объект.ЛицевойСчет.Квартира);
		
		РезультатЗапроса = Запрос.Выполнить();	
	    ДанныеПоПлощадям = РезультатЗапроса.Выгрузить();
		//ЗаполняемПустыеПериоды
				
		Площадь = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));

		Площади = новый таблицаЗначений;
		Площади.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
		Площади.Колонки.Добавить("ОбщаяПлощадь", Площадь);
		Площади.Колонки.Добавить("ЖилаяПлощадь", Площадь);
				
		Период = НачалоМесяца(Объект.НачПериода);
		ТекущаяДата = ДанныеПоПлощадям[0].Период;
		ТекущаяОбщаяПлощадь = ДанныеПоПлощадям[0].ОбщаяПлощадь;
		ТекущаяЖилаяПлощадь = ДанныеПоПлощадям[0].ЖилаяПлощадь;
		
		Пока Период <= НачалоМесяца(Объект.КонПериода) Цикл
			НайденнаяСтрока = ДанныеПоПлощадям.Найти(Период,"Период");
			Если НайденнаяСтрока <> неопределено Тогда НС=НайденнаяСтрока.Период	КонецЕсли;
			Если Период < ТекущаяДата Тогда
			    Строка = Площади.Добавить();
                Строка.Период = Период;
			    Строка.ОбщаяПлощадь = 0;
			    Строка.ЖилаяПлощадь = 0; 			    
			ИначеЕсли Период = НС Тогда
			    ТекущаяДата = Период;
		        ТекущаяОбщаяПлощадь = НайденнаяСтрока.ОбщаяПлощадь;
		        ТекущаяЖилаяПлощадь = НайденнаяСтрока.ЖилаяПлощадь;	
		        Строка = Площади.Добавить();
                Строка.Период = Период;
			    Строка.ОбщаяПлощадь = НайденнаяСтрока.ОбщаяПлощадь;
			    Строка.ЖилаяПлощадь = НайденнаяСтрока.ЖилаяПлощадь;
			ИначеЕсли Период > ТекущаяДата Тогда 
			    Строка = Площади.Добавить();
                Строка.Период = Период;
			    Строка.ОбщаяПлощадь = ТекущаяОбщаяПлощадь;
			    Строка.ЖилаяПлощадь = ТекущаяЖилаяПлощадь;
			КонецЕсли;
            Период = конецМесяца(Период)+1;
		КонецЦикла;
		
		
	//Создаем таблицу с результатом расчета
	ИтогРасчета = Новый ТаблицаЗначений;
	ИтогРасчета.Колонки.Добавить("Услуга");
	ИтогРасчета.Колонки.Добавить("Сумма");
	
	Для Каждого Строка Из НачисленныеУслуги Цикл
	    НайденнаяСтрока = Площади.Найти(Строка.Период);
		Если НайденнаяСтрока <> неопределено Тогда
			//определяем долю от крайних периодов
			ПосДНачалаПериода = День(КонецМесяца(объект.НачПериода));
		    ДоляВПервомПериоде = (ПосДНачалаПериода-День(Объект.НачПериода)+1)/ПосДНачалаПериода;
		    ПерДКонцаПериода = День(НачалоМесяца(объект.КонПериода));
		    ДоляВПоследнемПериоде = (день(объект.КонПериода) - ПерДКонцаПериода +1)/День(КонецМесяца(объект.КонПериода));		
		    Если месяц(Строка.Период)=месяц(объект.НачПериода)Тогда
		         ДоляПериода = ДоляВПервомПериоде; 
	        ИначеЕсли месяц(Строка.Период)=месяц(объект.КонПериода) Тогда
		         ДоляПериода = ДоляВПоследнемПериоде;
	        Иначе
		         ДоляПериода = 1;
		    КонецЕсли;
		    //РАссчитываем сумму для услуг от общей площади
			Если Строка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
			    Если НайденнаяСтрока.ОбщаяПлощадь >0 Тогда			
			    ОтношениеПлощадей = Объект.ПлощадьОбщая/НайденнаяСтрока.ОбщаяПлощадь;
				СтрокаИтогРасчета = ИтогРасчета.Добавить();
			    СтрокаИтогРасчета.Услуга = Строка.УслугаЖКХ;
			    СтрокаИтогРасчета.Сумма = (Строка.СуммаОборот*ОтношениеПлощадей-Строка.СуммаОборот)*ДоляПериода;
			    КонецЕсли;
			//Рассчитываем сумму для услуг от жилой площади
			ИначеЕсли Строка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади Тогда
			    Если НайденнаяСтрока.ЖилаяПлощадь >0 Тогда			
			    ОтношениеПлощадей = Объект.ПлощадьЖилая/НайденнаяСтрока.ЖилаяПлощадь;
				СтрокаИтогРасчета = ИтогРасчета.Добавить();
			    СтрокаИтогРасчета.Услуга = Строка.УслугаЖКХ;
			    СтрокаИтогРасчета.Сумма = (Строка.СуммаОборот*ОтношениеПлощадей-Строка.СуммаОборот)*ДоляПериода;
			    КонецЕсли;
			КонецЕсли
			
		КонецЕсли;
	КонецЦикла;
	Перменная="";	
		ИтогРасчета.Свернуть("Услуга", "Сумма");
		Массив = ОбщегоНазначения.ТаблицаЗначенийВМассив(ИтогРасчета);
	
	Возврат Массив;
	//КонецРабот
	
КонецФункции
	
&НаСервере
Функция ЗаполнитьТЧУслугами()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выгрузить();
	
	Возврат Выборка;
	
КонецФункции

&НаСервере
Функция ПерерасчетРанееПрименяемойСтавкиНаСервере()	
	
	ЛицевыеСчета = объект.СписокУслуг.Выгрузить(,"ЛицевойСчет");
	ЛицевыеСчета.Свернуть("ЛицевойСчет",);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_ОбъемыПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	               |	бит_ОбъемыПоУслугамЖКХОбороты.Период КАК Период,
	               |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	               |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	               |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь
	               |ИЗ
	               |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			ЛицевойСчет В (&ЛицевойСчет)
	               |				И УслугаЖКХ В (&Услуги)) КАК бит_ОбъемыПоУслугамЖКХОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода, ) КАК бит_СведенияОКвартиреСрезПоследних
	               |		ПО бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	               |				&КонецПериода,
	               |				ЛицевойСчет В (&ЛицевойСчет)
	               |					И Услуга В (&Услуги)) КАК бит_СведенияПоУслугамЛССрезПоследних
	               |		ПО бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	               |			И бит_ОбъемыПоУслугамЖКХОбороты.УслугаЖКХ = бит_СведенияПоУслугамЛССрезПоследних.Услуга
	               |ГДЕ
	               |	бит_ОбъемыПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ОбъемыПоУслугамЖКХОбороты.ЛицевойСчет,
	               |	бит_ОбъемыПоУслугамЖКХОбороты.УслугаЖКХ,
	               |	бит_ОбъемыПоУслугамЖКХОбороты.Период,
	               |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	               |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	               |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь";
	
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.КонПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевыеСчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.НачПериода));
	Запрос.УстановитьПараметр("Услуги", Объект.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выгрузить();
	ДолиПериода = ПолучитьДолюПериодаНаСервере();
	
	//Создаем массив в который записываем результат расчета
	//Массив из 1 столбца, данные лежат в порядке Номер ЛС, Объем, Сумма
	
	 Массив = Новый Массив;
 
	 Для Каждого Строка Из Выборка Цикл
		Период = КонецМесяца(Строка.Период);
		Отбор = Новый Структура;
		    Отбор.Вставить("Период", Период);
			СтрокаДолиПериода = ДолиПериода.НайтиСтроки(отбор);
		ДоляПериода = СтрокаДолиПериода[0].ДоляПериода;
	    Массив.Добавить(строка.ЛицевойСчет);
		//НовыйОбъем = строка.Объем * доляПериода;
		Массив.Добавить(Объект.Сумма);        
		//++АнисимоваМВ 12.11.2024 исправление ошибки заполнения без объема
		Площадь = ?(Строка.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади,Строка.ОбщаяПлощадь, Строка.ЖилаяПлощадь);
		ИтоговаяСумма = Объект.Сумма * Площадь * ДоляПериода;
		//--АнисимоваМВ 12.11.2024
		//НоваяСумма = строка.СуммаОборот * ДоляПериода;
		//ИтоговаяСумма = Объект.Сумма * НовыйОбъем - НоваяСумма;
		//ИтоговаяСумма = Объект.Сумма * НовыйОбъем;
		Массив.Добавить(ИтоговаяСумма);
	КонецЦикла;
	
    Возврат Массив;
	//Конец работ
		  
КонецФункции

&НаСервере
Функция ПолучитьПлощадиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
		|	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		//Михайлов 05.02.01 Начало работ
		|ГДЕ бит_ЛицевыеСчета.Ссылка =&Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЛицевойСчет); 
	
	
		
	РезультатЗапроса = Запрос.Выполнить();  	
	Выборка = РезультатЗапроса.Выгрузить();
		
	Массив = ОбщегоНазначения.ТаблицаЗначенийВМассив(Выборка);
	
    Возврат Массив;
	//Конец работ		
КонецФункции
//бит -

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги") Тогда 
		
		Объект.ПроцентНеДопоставки = 100;
		
	КонецЕсли;
	
	Объект.ЧекККМ      = Неопределено;
	Объект.ОплатаКУ    = Неопределено;
	Объект.ЛицевойСчет = Неопределено;
	
	Объект.СписокУслуг.Очистить();
    // БИТ ЖКХ 16.07.2020
	Объект.СписокУслугПеня.Очистить();
	
	Объект.ЛицевыеСчета.Очистить();
	Объект.ФизЛица.Очистить();
	
	УправлениеЭлементамиФормы();
	// Отобразить в заголовке формы вид операции.
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидыОпераций = ПолучитьСписокВыбораВидаОперацииНаСервере();
	
	ВыбранныйЭлемент = Неопределено;

	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВидОперацииНачалоВыбораЗавершение", ЭтотОбъект), ВидыОпераций, Элементы.ВидОперации);
	
	//30.04.2019
	СтандартнаяОбработка = истина;

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
        Объект.ВидОперации = ВыбранныйЭлемент.Значение;
        
    КонецЕсли;
    
    Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги") Тогда 
        
        Объект.ПроцентНеДопоставки = 100;
        
    КонецЕсли;
    
    Объект.ЧекККМ   = Неопределено;
    Объект.ОплатаКУ = Неопределено;
    
    Объект.СписокУслуг.Очистить();
	 // БИТ ЖКХ 16.07.2020
	Объект.СписокУслугПеня.Очистить();

    Объект.ЛицевыеСчета.Очистить();
    Объект.ФизЛица.Очистить();
    
    УправлениеЭлементамиФормы();
    // Отобразить в заголовке формы вид операции.
    УстановитьЗаголовокФормыДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.ЧекККМ      = Неопределено;
	Объект.ОплатаКУ    = Неопределено;
	Объект.ЛицевойСчет = Неопределено;
	
	Объект.СписокУслуг.Очистить();
	 // БИТ ЖКХ 16.07.2020
	Объект.СписокУслугПеня.Очистить();

	Объект.ЛицевыеСчета.Очистить();
	Объект.ФизЛица.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НачПериодаПриИзменении(Элемент)
	
	ЗаполнитьКолвоДнейНедопоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура КонПериодаПриИзменении(Элемент)
	
	ЗаполнитьКолвоДнейНедопоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицаЭлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивФизЛиц = ПолучитьМассивФизЛицНаСервере();
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Дата"        , Объект.Дата);
	ПараметрыФормы.Вставить("ЛицевойСчет" , Объект.ЛицевойСчет);
	ПараметрыФормы.Вставить("МассивФизЛиц", МассивФизЛиц);
	
	ОткрытьФорму("Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаФизЛицУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекККМПриИзменении(Элемент)
	
	Объект.ОплатаКУ    = Неопределено;
	Объект.ЛицевойСчет = Неопределено;
	
	Объект.СписокУслуг.Очистить();
	 // БИТ ЖКХ 16.07.2020
	Объект.СписокУслугПеня.Очистить();

	Объект.ЛицевыеСчета.Очистить();
	Объект.ФизЛица.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекККМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ЧекПробитНаККМ", Истина);
	ПараметрыФормы.Вставить("Архивный"      , Истина);
	
	ОткрытьФорму("Документ.бит_ЧекККМ.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекККМОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Отмена = Ложь;
		
		Отмена2 = ПроверитьЧекНаСтроно(ВыбранноеЗначение, Отмена);
		
		Если Отмена2 Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Если Объект.ЧекККМ <> ВыбранноеЗначение Тогда
			
			Если Объект.СписокУслуг.Количество() > 0 Тогда
				
				Ответ = Неопределено;
				
				ПоказатьВопрос(Новый ОписаниеОповещения("ЧекККМОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение)), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				Объект.ЧекККМ = ВыбранноеЗначение;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекККМОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ЧекККМ = ВыбранноеЗначение;
		
		Объект.СписокУслуг.Очистить();
		 // БИТ ЖКХ 16.07.2020
        Объект.СписокУслугПеня.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаКУПриИзменении(Элемент)
	
	Объект.ЧекККМ      = Неопределено;
	Объект.ЛицевойСчет = Неопределено;
	
	Объект.СписокУслуг.Очистить();
	 // БИТ ЖКХ 16.07.2020
	Объект.СписокУслугПеня.Очистить();

	Объект.ЛицевыеСчета.Очистить();
	Объект.ФизЛица.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Проведен"       , Истина);
	ПараметрыФормы.Вставить("ПометкаУдаления", Ложь);
	
	РезультатВыбора = ОткрытьФорму("Документ.бит_ОплатаКУ.Форма.ФормаВыбораУправляемая", Новый Структура("ТекущаяСтрока,ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", Объект.ОплатаКУ, ПараметрыФормы), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Объект.ЧекККМ   = Неопределено;
	
	Объект.СписокУслуг.Очистить();
	 // БИТ ЖКХ 16.07.2020
	Объект.СписокУслугПеня.Очистить();

	Объект.ЛицевыеСчета.Очистить();
	Объект.ФизЛица.Очистить();
	//Михайлов 05.02.2021 Начало работ
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетВСвязиСИзменениемПлощади") Тогда
		
		Объект.ПлощадьДляКапремонта = ПолучитьПощадьКапРемонт();
		
		Массив = ПолучитьПлощадиНаСервере();
		
		Попытка
		Объект.ПлощадьОбщая = Массив[0].ОбщаяПлощадь;
		Объект.ПлощадьЖилая = Массив[0].ЖилаяПлощадь;	
		Исключение
		Объект.ПлощадьОбщая = 0;
		Объект.ПлощадьЖилая = 0;	
		КонецПопытки;
		
		Массив = ПолучитьУслуги(Объект.Дата, Объект.ЛицевойСчет);
		Если Массив.Количество()>0 Тогда
		    Для Индекс = 0 По Массив.Количество() - 1 Цикл
                СтрокаТЧ = Объект.СписокУслуг.Добавить();
			    СтрокаТЧ.Услуга = Массив[Индекс].Услуга;
		        СтрокаТЧ.ЛицевойСчет = объект.ЛицевойСчет;
		     КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	//конец работ
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Ссылка",ВыгрузитьКолонкуЛицевойСчетОплатаКУСписокЛСНаСервере());
		
		ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КолЧасовНедопоставкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Число(Текст) > 24 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Кол-во часов не может превышать 24 часа.");
		
		Объект.КолЧасовНедопоставки = 24;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУслуги(Период, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|			&Период,
		|			ЛицевойСчет = &ЛицевойСчет
		|				И (СпособРасчета = &СпособРасчета
		|					ИЛИ СпособРасчета = &СпособРасчета0)) КАК бит_СведенияПоУслугамЛССрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СпособРасчета", Перечисления.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади);
	Запрос.УстановитьПараметр("СпособРасчета0", Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади);
	
	РезультатЗапроса = Запрос.Выполнить();
	//Михайлов 05.02.2021 Начало работ
	Выборка = РезультатЗапроса.Выгрузить(); 	
	
	Массив = ОбщегоНазначения.ТаблицаЗначенийВМассив(Выборка);
	
    Возврат Массив;
	//КонецРабот
КонецФункции

&НаСервере
Функция ПолучитьПощадьКапРемонт()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(, ) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга = &Услуга
		//Михайлов 05.02.2021 начало работ
		|   И бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет
		//Конец работ
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_СведенияПоУслугамЛССрезПоследних.Период УБЫВ";
		
	Запрос.УстановитьПараметр("Услуга", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008")); //Капитальный ремонт (мин)
	//Михайлов 05.02.2021 Начало работ
	Запрос.УстановитьПараметр("ЛицевойСчет", объект.ЛицевойСчет);
	//конец работ
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.КоличествоЕдиницПотребления;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура СписокУслугУслугаПриИзменении(Элемент)
	
	Массив = Новый Массив();
	
	Массив.Добавить("Услуга");
	
	ЗаполнениеСчетовКУНаСервере(Массив);
	
	СтрокаТЧ = Элементы.СписокУслуг.ТекущиеДанные;
	
	СтрокаТЧ.Сумма = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое")
		// БИТ ЖКХ 10.03.2020
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН")Тогда
		
		ТекСтрока = Элементы.СписокУслуг.ТекущиеДанные;
		
		ЛС = ТекСтрока.ЛицевойСчет;
		
	Иначе
		
		ЛС = Объект.ЛицевойСчет;
		
	КонецЕсли;
	
	СписокУслугОтбора = ПолучитьСписокУслугОтбораНаСервере(Объект.Дата, ЛС);
	
	Если Объект.СписокУслуг.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("СписокУслугОтбора", СписокУслугОтбора);
		
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугУслугаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Объект.Организация,КонецМесяца(Объект.Дата));
	
	ТекДанные = Элементы.СписокУслуг.ТекущиеДанные;
	
	ТекУслуга = ТекДанные.Услуга;
	
	ЗаполнитьСписокУслуг(ТекУслуга, СтруктураСчетовЖКХ);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСчетАбонентаПриИзменении(Элемент)
	
	СтрокаЭлемент = Элементы.СписокУслуг.ТекущийЭлемент;
	СтрокаПлатеж  = Элементы.СписокУслуг.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"Субконто1", "Субконто2", "Субконто3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСчетАбонентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.СписокУслуг.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоНачисления(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСчетКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконтоСписокУслуг(ЭтаФорма);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков") Тогда
		СтрокаПлатеж = Объект.СписокУслуг.НайтиПоИдентификатору(Элементы.СписокУслуг.ТекущаяСтрока);
		Если НЕ БылВопросПроСубконто И ЗначениеЗаполнено(СтрокаПлатеж.СубконтоКУ1) Тогда
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Установить контрагента ""%1"" для всех субконто?'"), СтрокаПлатеж.СубконтоКУ1);
			ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьСубконтоЗавершение", ЭтотОбъект, СтрокаПлатеж), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			УстановитьДоговораКонтрагентовСервер();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСубконтоЗавершение(Ответ, ДополнительныеПараметры) Экспорт // Временно.
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		БылВопросПроСубконто = Истина;
		УстановитьДоговораКонтрагентовСервер();
	Иначе
		УстановитьДоговораКонтрагентовСервер(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоговораКонтрагентовСервер(ДляВсех = Ложь)
	
	СтрокаПлатеж = Объект.СписокУслуг.НайтиПоИдентификатору(Элементы.СписокУслуг.ТекущаяСтрока);
	
	Если ДляВсех Тогда
		Для Каждого Строка Из Объект.СписокУслуг Цикл
				Строка.СубконтоКУ1 = СтрокаПлатеж.СубконтоКУ1;
				Строка.СубконтоКУ2 = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				Строка.СубконтоКУ3 = Неопределено;
				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Строка.СубконтоКУ2, Строка.СубконтоКУ1, Объект.Организация);
		КонецЦикла; 
		
	Иначе
		СтрокаПлатеж.СубконтоКУ2 = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		СтрокаПлатеж.СубконтоКУ3 = Неопределено;
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(СтрокаПлатеж.СубконтоКУ2, СтрокаПлатеж.СубконтоКУ1, Объект.Организация);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура СписокУслугСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокУслуг.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСубконтоКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокУслуг.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "СубконтоКУ%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетКУ);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Элт Из ВыбранноеЗначение Цикл
		Если Элт = Неопределено
			ИЛИ Элт = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка")
			ИЛИ Объект.СписокУслуг.НайтиСтроки(Новый Структура("ЛицевойСчет", Элт)).Количество() > 0 Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.СписокУслуг.Добавить();
		НоваяСтрока.ЛицевойСчет = Элт;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет описания физ лиц. 
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура ЗаполнитьОписанияФизЛиц()
	
	ЭтаФорма.ФизЛицаЭл = "";
	
	Для Каждого ТекСтрока Из Объект.ФизЛица Цикл
		
		ФизЛицаЭл = ФизЛицаЭл + ТекСтрока.ФизЛицо+"; ";
		
	КонецЦикла;
	
	ЭтаФорма.ФизЛицаЭл = ФизЛицаЭл;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораВидаОперацииНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    ВидыОпераций.Ссылка
	|ИЗ
	|    Перечисление.бит_ВидыОперацийРазовыеПоЖКХ КАК ВидыОпераций";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВыбора = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		СписокВыбора.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	МассивИсключений = Новый Массив;
	
	МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоСчетчикам);
	МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПриУстановкеСчетчика);
	МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПриСнятииСчетчика);
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("бит_Бухгалтер")) Тогда
		
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратПоОтсутствующим);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслуги);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначислениеПоВременноПроживающим);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьгот);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслуге);
		// БИТ ЖКХ 10.03.2020
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеЗаПрошлыеПериоды);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоОтсутствующим);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПоГрупповымСчетчикамСНаличиемИндивидуальных);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое);
		// БИТ ЖКХ 10.03.2020
        МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды);
		// БИТ ЖКХ 10.03.2020
        МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПриУстановкеСчетчика);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПриСнятииСчетчика);		
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчика);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчику);
		МассивИсключений.Добавить(Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков);
		
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивИсключений Цикл
		
		НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(ЭлементМассива);
		
		Если НайденныйЭлемент <> Неопределено Тогда
			
			СписокВыбора.Удалить(НайденныйЭлемент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКолвоДнейНедопоставки()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	КолвоДнейНедопоставки = Строка(ДокументОбъект.РазностьДатВДнях(Объект.КонПериода,Объект.НачПериода));
	
	ЭтаФорма.КолвоДнейНедопоставки = КолвоДнейНедопоставки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОплатеНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	МассивРеквизитовТабличнойЧастиСписокУслуг = Новый Массив;
	
	Для Каждого Реквизит Из Метаданные.Документы.бит_РазовыеПоУслугамЖКХ.ТабличныеЧасти.СписокУслуг.Реквизиты Цикл
		
		МассивРеквизитовТабличнойЧастиСписокУслуг.Добавить(Реквизит.Имя);
		
	КонецЦикла;
	
	ДокументОбъект.ЗаполнитьПоОплате(МассивРеквизитовТабличнойЧастиСписокУслуг);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПереносОстатковСервер()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	МассивЛС = Новый Массив;
	Если ДокументОбъект.СписокУслуг.Количество() > 0 Тогда
		МассивЛС = ДокументОбъект.СписокУслуг.ВыгрузитьКолонку("ЛицевойСчет");
		ДокументОбъект.СписокУслуг.Очистить();
		// БИТ ЖКХ 20.07.2020
		ДокументОбъект.СписокУслугПеня.Очистить();
	КонецЕсли;
	
	ТекстЗапрос =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация КАК Организация
	|ПОМЕСТИТЬ ПоставщикиИУслуги
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода {(&КонецПериода)}, Услуга = &УслугаСписания) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_УслугиНачисления
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода {(&КонецПериода)}, Услуга = &УслугаНачисления) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	|			&НачалоПериода {(&НачалоПериода)},
	|			&КонецПериода {(&КонецПериода)},
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПоставщикиИУслуги.Услуга КАК Услуга,
	|	ЕСТЬNULL(ВТ_УслугиНачисления.Услуга, ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)) КАК УслугаНачисления,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0) < 0
	|				ТОГДА -ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаКонечныйОстатокКт,
	|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоставщикиИУслуги.Организация
	|ИЗ
	|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК Остатки
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслугиНачисления КАК ВТ_УслугиНачисления
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = ВТ_УслугиНачисления.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоставщикиИУслуги.Услуга,
	|	ЕСТЬNULL(ВТ_УслугиНачисления.Услуга, ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)),
	|	ПоставщикиИУслуги.ЛицевойСчет,
	|	ПоставщикиИУслуги.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0) < 0
	|				ТОГДА -ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0";
	
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапрос);

	Если МассивЛС.Количество() > 0 Тогда
		
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет В (&ЛицевыеСчета)");

		ЗапросСхемы1	= СхемаЗапроса.ПакетЗапросов[1];
		ОператорВыбора1 = ЗапросСхемы1.Операторы[0];
		ОператорВыбора1.Отбор.Добавить("бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет В (&ЛицевыеСчета)");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Организация"		,ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода"	,ДокументОбъект.НачПериода);
	Запрос.УстановитьПараметр("КонецПериода"	,ДокументОбъект.КонПериода);
	Запрос.УстановитьПараметр("УслугаСписания"	,ДокументОбъект.УслугаСписания);
	Запрос.УстановитьПараметр("УслугаНачисления",ДокументОбъект.УслугаНачисления);
	Запрос.УстановитьПараметр("ЛицевыеСчета"	,МассивЛС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.УслугаНачисления) Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для лицевого счетета '" + Строка(Выборка.ЛицевойСчет) + "' отсутствует услуга начисления!");
			Продолжить;
		КонецЕсли;
		
		НСтр = ДокументОбъект.СписокУслуг.Добавить();
		НСтр.ЛицевойСчет = Выборка.ЛицевойСчет;
		НСтр.Услуга = Выборка.Услуга;
		НСтр.Сумма = Выборка.СуммаКонечныйОстатокКт;
		
		НСтр = ДокументОбъект.СписокУслуг.Добавить();
		НСтр.ЛицевойСчет = Выборка.ЛицевойСчет;
		НСтр.Услуга = Выборка.УслугаНачисления;
		НСтр.Сумма = -Выборка.СуммаКонечныйОстатокКт;
		
	КонецЦикла; 
	
	Если ДокументОбъект.СписокУслуг.Количество() = 0 Тогда
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Отсутствуют переплаты для выбранного набора лицевых счетов и услуг!");
		Возврат;	
	КонецЕсли;
	
	МассивЛС = ДокументОбъект.СписокУслуг.ВыгрузитьКолонку("ЛицевойСчет");
	МассивУслуг = Новый Массив();
	МассивУслуг.Добавить("Услуга");
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ДокументОбъект.СписокУслуг, МассивУслуг, МассивЛС
											, ДокументОбъект.Организация , КонецМесяца(ДокументОбъект.Дата),,,,,,, Истина);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	РассчитатьСуммыПересчетаНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПереносОстатковСерверДолг()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	МассивЛС = Новый Массив;
	Если ДокументОбъект.СписокУслуг.Количество() > 0 Тогда
		МассивЛС = ДокументОбъект.СписокУслуг.ВыгрузитьКолонку("ЛицевойСчет");
		ДокументОбъект.СписокУслуг.Очистить();
		// БИТ ЖКХ 20.07.2020
		ДокументОбъект.СписокУслугПеня.Очистить();
	КонецЕсли;
	
	ТекстЗапрос =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация КАК Организация
	|ПОМЕСТИТЬ ПоставщикиИУслуги
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода {(&КонецПериода)}, Услуга = &УслугаСписания) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_УслугиНачисления
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода {(&КонецПериода)}, Услуга = &УслугаНачисления) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга,
	|	ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	|			&НачалоПериода {(&НачалоПериода)},
	|			&КонецПериода {(&КонецПериода)},
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПоставщикиИУслуги.Услуга КАК Услуга,
	//|	ЕСТЬNULL(ВТ_УслугиНачисления.Услуга, ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)) КАК УслугаНачисления,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0) < 0
	|				ТОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)
	|			ИНАЧЕ Остатки.СуммаКонечныйОстаток
	|		КОНЕЦ) КАК СуммаКонечныйОстатокКт,
	|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоставщикиИУслуги.Организация
	|ИЗ
	|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК Остатки
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслугиНачисления КАК ВТ_УслугиНачисления
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = ВТ_УслугиНачисления.ЛицевойСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоставщикиИУслуги.Услуга,
	//|	ЕСТЬNULL(ВТ_УслугиНачисления.Услуга, ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)),
	|	ПоставщикиИУслуги.ЛицевойСчет,
	|	ПоставщикиИУслуги.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0) > 0
	|				ТОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)
	|			ИНАЧЕ Остатки.СуммаКонечныйОстаток
	|		КОНЕЦ) > 0";
	
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапрос);

	Если МассивЛС.Количество() > 0 Тогда
		
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет В (&ЛицевыеСчета)");

		ЗапросСхемы1	= СхемаЗапроса.ПакетЗапросов[1];
		ОператорВыбора1 = ЗапросСхемы1.Операторы[0];
		ОператорВыбора1.Отбор.Добавить("бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет В (&ЛицевыеСчета)");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Организация"		,ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода"	,ДокументОбъект.НачПериода);
	// БИТ ЖКХ 16.03.2020
	Запрос.УстановитьПараметр("КонецПериода"	,КонецДня(ДокументОбъект.КонПериода));
	Запрос.УстановитьПараметр("УслугаСписания"	,ДокументОбъект.УслугаСписания);
	Запрос.УстановитьПараметр("УслугаНачисления",ДокументОбъект.УслугаНачисления);
	Запрос.УстановитьПараметр("ЛицевыеСчета"	,МассивЛС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//Если НЕ ЗначениеЗаполнено(Выборка.УслугаНачисления) Тогда
		//	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для лицевого счетета '" + Строка(Выборка.ЛицевойСчет) + "' отсутствует услуга начисления!");
		//	Продолжить;
		//КонецЕсли;
		
		НСтр = ДокументОбъект.СписокУслуг.Добавить();
		НСтр.ЛицевойСчет = Выборка.ЛицевойСчет;
		НСтр.Услуга = Выборка.Услуга;
		НСтр.Сумма = -Выборка.СуммаКонечныйОстатокКт;
		
		//НСтр = ДокументОбъект.СписокУслуг.Добавить();
		//НСтр.ЛицевойСчет = Выборка.ЛицевойСчет;
		//НСтр.Услуга = Выборка.УслугаНачисления;
		//НСтр.Сумма = -Выборка.СуммаКонечныйОстатокКт;
		
	КонецЦикла; 
	
	Если ДокументОбъект.СписокУслуг.Количество() = 0 Тогда
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Отсутствует долг для выбранного набора лицевых счетов и услуг!");
		Возврат;	
	КонецЕсли;              	
				
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);       	
	РассчитатьСуммыПересчетаНаСервере();	
	
	// БИТ ЖКХ 16.03.2020	   
	таблицаЛС = Объект.СписокУслуг.Выгрузить();	   	
	Колонки = новый массив;	
	
	Для Каждого Реквизит Из Метаданные.Документы.бит_РазовыеПоУслугамЖКХ.ТабличныеЧасти.СписокУслуг.Реквизиты Цикл
		
		Колонки.Добавить(Реквизит.Имя);
		
	КонецЦикла;
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Объект.СписокУслуг, Колонки, таблицаЛС, ДокументОбъект.Организация , КонецМесяца(Объект.КонПериода));	
	для каждого стр из Объект.СписокУслуг цикл		
		стр.Субконто2 = стр.Услуга; 
	конеццикла;
	
КонецПроцедуры


&НаСервере
Процедура РассчитатьСуммыПересчетаНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	МассивРеквизитовТабличнойЧастиСписокУслуг = Новый Массив;
	
	Для Каждого Реквизит Из Метаданные.Документы.бит_РазовыеПоУслугамЖКХ.ТабличныеЧасти.СписокУслуг.Реквизиты Цикл
		
		МассивРеквизитовТабличнойЧастиСписокУслуг.Добавить(Реквизит.Имя);
		
	КонецЦикла;
	
	ДокументОбъект.РассчитатьСуммыПересчета(МассивРеквизитовТабличнойЧастиСписокУслуг);
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировка 
		// БИТ ЖКХ 17.07.2020
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ТехническаяКорректировкаПени
		 Или Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПриУстановкеСчетчика Тогда
		
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = Объект.СписокУслуг.Выгрузить();
		
		ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		
		ТаблицаПроживающих = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
		ТабНачисления    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
		ТабРаспределения = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
		
		СписокЛ     = Новый Массив;
		
		СписокЛ.Добавить(Объект.ЛицевойСчет);
		
		СписокЗданий = Новый Массив;
		
		Для каждого СтрокаЗ из СписокЛ Цикл
			
			СписокЗданий.Добавить(СтрокаЗ.Здание);
			
		КонецЦикла;
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(Объект.Дата, Объект.Организация, СписокЛ, СписокЗданий, , , ТабЛицевыеСчета,ТабНачисления,,,,,,,,);
		
		Массив = Новый Массив;
		
		Для каждого СтрокаСбора из ТаблицаСбора Цикл
			
			Для каждого Строка из ТабЛицевыеСчета Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						СтрокаСбора.Объем = СтрокаСбора.Сумма/Строка.Тариф;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
		Для каждого СтрокаСбора из ТаблицаСбора Цикл
			
			Для каждого Строка из ТабНачисления Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						СтрокаСбора.Объем = СтрокаСбора.Сумма/Строка.Тариф;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
		Объект.СписокУслуг.Загрузить(ТаблицаСбора);
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоСчетчикамГрупповое 
		Или Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаСчетчиковГрупповое Тогда
		
		Для Каждого Строка из ДокументОбъект.СписокУслуг Цикл
			Строка.Объем   = 0;
			
			Запрос2 = Новый Запрос;
			Запрос2.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
			|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры
			|ИЗ
			|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
			
			Запрос2.УстановитьПараметр("Момент"   ,КонецМесяца(ТекущаяДата()));
			Запрос2.УстановитьПараметр("Квартира" ,Строка.ЛицевойСчет.Квартира);
			
			Выборка = Запрос2.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				ТипКвартиры              = Выборка.ТипКвартиры;
				СтатусКвартиры           = Выборка.СтатусКвартиры;
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_СведенияПоУслугамЛССрезПоследних.Период,
			|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
			|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
			|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
			|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
			|	бит_СведенияПоУслугамЛССрезПоследних.Использовать,
			|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	бит_СтавкиНаУслугиСрезПоследних.Тариф,
			|	бит_СтавкиНаУслугиСрезПоследних.Период КАК Период,
			|	ВТ.Период КАК Период1,
			|	ВТ.ЛицевойСчет,
			|	ВТ.Услуга,
			|	ВТ.РежимПотребления,
			|	ВТ.Поставщик,
			|	ВТ.Использовать,
			|	ВТ.СпособРасчета
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&Дата, ) КАК бит_СтавкиНаУслугиСрезПоследних
			|		ПО бит_СтавкиНаУслугиСрезПоследних.Услуга = ВТ.Услуга
			|			И бит_СтавкиНаУслугиСрезПоследних.РежимПотребления = ВТ.РежимПотребления
			|			И бит_СтавкиНаУслугиСрезПоследних.СпособРасчета = ВТ.СпособРасчета
			|ГДЕ
			|	бит_СтавкиНаУслугиСрезПоследних.Услуга = &Услуга
			|	И бит_СтавкиНаУслугиСрезПоследних.СпособРасчета = &ПоСчетчикам
			|	И бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры = &Тип
			|	И бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры = &Статус
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
			
			Запрос.УстановитьПараметр("Дата", Объект.КонПериода);
			Запрос.УстановитьПараметр("Услуга", Строка.Услуга);
			Запрос.УстановитьПараметр("ЛицевойСчет", Строка.ЛицевойСчет);
			Запрос.УстановитьПараметр("ПоСчетчикам", ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам"));
			Запрос.УстановитьПараметр("Тип", ТипКвартиры);
			Запрос.УстановитьПараметр("Статус", СтатусКвартиры);
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если не ВыборкаДетальныеЗаписи.Тариф = 0 Тогда
					Строка.Объем   =  Строка.Сумма/ВыборкаДетальныеЗаписи.Тариф;
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое 
		// БИТ ЖКХ 10.03.2020
		ИЛИ Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды
		Или Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.НедопоставкаУслугиГрупповое Тогда
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
		Если Не Объект.списокуслуг.Количество()=0 Тогда
			Для каждого Строка из Объект.СписокУслуг Цикл
				
				Если Строка.Сумма = 0 Тогда
					Строка.Объем = 0; 
				КонецЕсли;	
				
			КонецЦикла;	
		КонецЕсли;	
		
    // БИТ ЖКХ 12.03.2020
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетСтраховыхДобровольныхВзносов Тогда	
		
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = Объект.СписокУслуг.Выгрузить();
		
		ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		
		ТаблицаПроживающих = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
		ТабНачисления    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
		ТабРаспределения = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
		
		СписокЛ = Объект.СписокУслуг.Выгрузить(,"ЛицевойСчет").ВыгрузитьКолонку("ЛицевойСчет");
		
		СписокЗданий = Новый Массив;
		
		Для каждого СтрокаЗ из СписокЛ Цикл
			
			СписокЗданий.Добавить(СтрокаЗ.Здание);
			
		КонецЦикла;
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(Объект.Дата, Объект.Организация, СписокЛ, СписокЗданий, , , ТабЛицевыеСчета,ТабНачисления,,,,,,,,);
		
		Массив = Новый Массив;
		
		Для каждого СтрокаСбора из ТаблицаСбора Цикл
			
			Для каждого Строка из ТабЛицевыеСчета Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						СтрокаСбора.Объем = СтрокаСбора.Сумма/Строка.Тариф;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
		Для каждого СтрокаСбора из ТаблицаСбора Цикл
			
			Для каждого Строка из ТабНачисления Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						СтрокаСбора.Объем = СтрокаСбора.Сумма/Строка.Тариф;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
		Объект.СписокУслуг.Загрузить(ТаблицаСбора);

		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ПереносОстатков Тогда
		
		ТаблицаСбора = Новый ТаблицаЗначений;
		ТаблицаСбора = Объект.СписокУслуг.Выгрузить();
		
		ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		
		ТаблицаПроживающих = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
		ТабНачисления    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
		ТабРаспределения = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
		
		СписокЛ = Объект.СписокУслуг.Выгрузить(,"ЛицевойСчет").ВыгрузитьКолонку("ЛицевойСчет");
		
		СписокЗданий = Новый Массив;
		
		Для каждого СтрокаЗ из СписокЛ Цикл
			
			СписокЗданий.Добавить(СтрокаЗ.Здание);
			
		КонецЦикла;
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(Объект.Дата, Объект.Организация, СписокЛ, СписокЗданий, , , ТабЛицевыеСчета,ТабНачисления,,,,,,,,);
		
		Массив = Новый Массив;
		
		Для каждого СтрокаСбора из ТаблицаСбора Цикл
			
			Для каждого Строка из ТабЛицевыеСчета Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						СтрокаСбора.Объем = СтрокаСбора.Сумма/Строка.Тариф;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
		Для каждого СтрокаСбора из ТаблицаСбора Цикл
			
			Для каждого Строка из ТабНачисления Цикл
				
				Если СтрокаСбора.Услуга = Строка.Услуга Тогда  
					
					Если НЕ Строка.Тариф = 0 Тогда
						
						СтрокаСбора.Объем = СтрокаСбора.Сумма/Строка.Тариф;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
			Попытка 	
				Массив.Добавить(СтрокаСбора.Объем);
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
		Объект.СписокУслуг.Загрузить(ТаблицаСбора);
	
	Иначе
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоНачисления(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
	"СписокУслугСубконто" + Постфикс + "1", 
	"СписокУслугСубконто" + Постфикс + "2", 
	"СписокУслугСубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	
	Для Индекс = 1 По 3 Цикл
		
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокУслугОтбораНаСервере(Знач Дата, Знач ЛС)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&ДатаРасчета,
	|			ЛицевойСчет = &ЛицевойСчет
	|				) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Запрос.УстановитьПараметр("ДатаРасчета" ,Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет" ,ЛС);
	
	СписокУслугОтбора = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокУслугОтбора.Добавить(Выборка.Услуга); 
		
	КонецЦикла;
	
	Возврат СписокУслугОтбора;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокУслуг(Услуга, СтруктураСчетовЖКХ)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	ЛСПоставщики.Услуга,
	|	ЛСПоставщики.ЛицевойСчет,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ДоговорКонтрагента
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|		бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик
	|	ИЗ
	|		РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|				&Момент,
	|				ЛицевойСчет = &ЛицевойСчет
	|					И Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних) КАК ЛСПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Момент, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|		ПО ЛСПоставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
	|			И ЛСПоставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга"     , Услуга);
	Запрос.УстановитьПараметр("Момент"     , КонецМесяца(Объект.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отбор = Новый Структура();
		
		Отбор.Вставить("Услуга", Выборка.Услуга);
		
		Строки = Объект.СписокУслуг.НайтиСтроки(Отбор);
		
		Если ТипЗнч(Выборка.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Организации") Тогда
			
			Если Строки.Количество() > 0 Тогда
				
				Строки[0].СчетАбонента = СтруктураСчетовЖКХ.СчетАбонента;
				
				СтрокаСубконта = Строки[0].СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета, "ВидСубконто");
				
				Если Не СтрокаСубконта = Неопределено Тогда
					
					Строки[0]["Субконто"+СтрокаСубконта.НомерСтроки] = Объект.ЛицевойСчет;
					
				КонецЕсли;
				
				Строки[0].СчетКУ = СтруктураСчетовЖКХ.СчетСУКУ;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Выборка.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Если Строки.Количество() > 0 Тогда
				
				Строки[0].СчетАбонента = СтруктураСчетовЖКХ.СчетАбонента;
				
				СтрокаСубконта = Строки[0].СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЛицевыеСчета, "ВидСубконто");
				
				Если Не СтрокаСубконта = Неопределено Тогда
					
					Строки[0]["Субконто"+СтрокаСубконта.НомерСтроки] = Объект.ЛицевойСчет;
					
				КонецЕсли;
				
				Строки[0].СчетКУ = СтруктураСчетовЖКХ.СчетСторПКУ;
				
				СтрокаСубконтаКУ = Строки[0].СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
				
				Если Не СтрокаСубконтаКУ = Неопределено Тогда
					
					Строки[0]["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Выборка.ПолучательДенежныхСредств;
				КонецЕсли;
				СтрокаСубконтаКУ = Строки[0].СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
				
				Если Не СтрокаСубконтаКУ = Неопределено Тогда
					
					Если ЗначениеЗаполнено(Выборка.ДоговорКонтрагента)
						И Выборка.ДоговорКонтрагента.Организация = Объект.Организация Тогда  	
						Строки[0]["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Выборка.ДоговорКонтрагента;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивФизЛицНаСервере()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ТаблицаЗначений.Колонки.Добавить("ФизЛицо");
	
	Для каждого Строка Из Объект.ФизЛица Цикл
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	МассивФизЛиц = бит_ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
	
	Возврат МассивФизЛиц;
	
КонецФункции

&НаСервере
Процедура РассчитатьОбщедомовыеРасходыНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.РачитатьОбщедомовыеРасходы();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// Процедура выполняет проверку был ли чек ккм сторнирован.
//
&НаСервере
Функция ПроверитьЧекНаСтроно(Чек, Отмена)
	
	Если НЕ Чек.Архивный Тогда
		
		Отмена = Истина;
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Чек не был архивирован, архивирование чеков происходит при закрытии кассовой смены.
		|Для возврата продаж заведите чек с видом операции ""Сторнирование оплаты услуг""!");
		
	Иначе
		
		Если Чек.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Продажа Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ЧекККМ.Ссылка
			|ИЗ
			|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
			|ГДЕ
			|	бит_ЧекККМ.ЧекОснование = &ЧекОснование
			|	И бит_ЧекККМ.Архивный
			|	И бит_ЧекККМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЧекККМ.Возврат)";
			
			Запрос.УстановитьПараметр("ЧекОснование", Чек);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Чек был сторнирован.");
				Отмена = Истина;
				
			КонецЕсли; 
			
		ИначеЕсли Чек.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("По чеку с видом операции ""Сторнирование оплаты услуг"", не возможно произвести возврат.");
			Объект.ЧекККМ = Документы.бит_ЧекККМ.ПустаяСсылка();
			
			Отмена = Истина;
			
		Иначе
			
			Отмена = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Отмена;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоЧекуНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	МассивРеквизитовТабличнойЧастиСписокУслуг = Новый Массив;
	
	Для Каждого Реквизит Из Метаданные.Документы.бит_РазовыеПоУслугамЖКХ.ТабличныеЧасти.СписокУслуг.Реквизиты Цикл
		
		МассивРеквизитовТабличнойЧастиСписокУслуг.Добавить(Реквизит.Имя);
		
	КонецЦикла;
	
	ДокументОбъект.ЗаполнитьПоЧеку(МассивРеквизитовТабличнойЧастиСписокУслуг);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);	
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьКолонкуЛицевойСчетОплатаКУСписокЛСНаСервере()
	
	Возврат Объект.ОплатаКУ.СписокЛС.ВыгрузитьКолонку("ЛицевойСчет");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконтоСписокУслуг(Форма)
	
	СтрокаПлатеж       = Форма.Объект.СписокУслуг.НайтиПоИдентификатору(Форма.Элементы.СписокУслуг.ТекущаяСтрока);
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "СписокУслугСубконто%Индекс%", ПараметрыДокумента);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "СписокУслугСубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСчетовКУНаСервере(Массив)
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Объект.СписокУслуг, Массив, Объект.ЛицевойСчет, Объект.Организация , КонецМесяца(Объект.Дата));
	
КонецПроцедуры
// БИТ ЖКХ 16.07.2020
&НаСервере
Процедура ЗаполнениеСчетовКУПениНаСервере(Массив)
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Объект.СписокУслугПеня, Массив, Объект.ЛицевойСчет, Объект.Организация , КонецМесяца(Объект.Дата));
	//Объект.ЗаполнитьСубконтоКУПеня();
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
		 
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		 
КонецПроцедуры

&НаКлиенте
Функция бит_ОбработатьСобытиеСШК(Клиент, ШК)
	
	Результат = Неопределено;
	
	Если ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_РазовыеПоУслугамЖКХ") Тогда
	Иначе
		возврат Результат;
	КонецЕсли;
	
	ДлинаШК = СтрДлина(ШК);
	
	ЧекККМ = ПредопределенноеЗначение("Документ.бит_ЧекККМ.ПустаяСсылка");
			
	Если ДлинаШК = 13 Тогда
		
		ЧекККМ = ЧекККМНаСервере(ШК);
		
	Иначе
		
		Возврат "Считанный штрих код не распознан!!!";
		
	КонецЕсли; 
	
	Если ТипЗнч(Клиент.Ссылка) = Тип("ДокументСсылка.бит_РазовыеПоУслугамЖКХ") Тогда
		
		Клиент.ЧекККМ = ЧекККМ;
		
		Возврат Результат;
		
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ЧекККМНаСервере(ШК)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЧекККМ.Ссылка
	|ИЗ
	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
	|ГДЕ
	|	бит_ЧекККМ.ШтрихКодФР = &ШтрихКодФР";
	Запрос.УстановитьПараметр("ШтрихКодФР", ШК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЧекККМ = Выборка.Ссылка;
		
	КонецЕсли;	
	
	Возврат ЧекККМ;	
	
КонецФункции

//16.07.2019
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
 ОчиститьСообщения(); 
 //26.11.2019
 
  Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН") Тогда // Добавление вида операции в условие Дорошенко 28.02.2022 

 Если ЕстьПустые() и ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ГрупповыеПерерасчетыОДН")// Добавление вида операции в условие Дорошенко 28.02.2022 
 тогда	
   Ответ = Вопрос("Удалять строки с пустой суммой и объемом?", РежимДиалогаВопрос.ДаНет);
   ОчиститьСообщения(); 
   Если Ответ = КодВозвратаДиалога.Да Тогда
     УдалятьСтрокиСПустойСуммой = истина;
	 УбратьПустые();   	
   иначе	
     УдалятьСтрокиСПустойСуммой = ложь;
   КонецЕсли;	
 иначе
	УдалятьСтрокиСПустойСуммой = ложь;
конецесли;

Иначе
   УдалятьСтрокиСПустойСуммой = ложь;
   
   КонецЕсли;
 ОчиститьСообщения();
 //26.11.2019
 УстановитьЗаголовокФормыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(Отказ)	
  //26.11.2019
 УстановитьЗаголовокФормыДокумента();
КонецПроцедуры


&НаСервере
Функция УбратьПустые()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ОчиститьСтрокиСПустойСуммой();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
конецФункции

 //26.11.2019
&НаСервере
Функция ЕстьПустые() 
 	
  ТаблицаУслуг = новый ТаблицаЗначений;
  ТаблицаУслуг = Объект.СписокУслуг.Выгрузить(); 	
  
  если ЗначениеЗаполнено(ТаблицаУслуг) = Ложь тогда
   возврат ложь;		
  конецесли;	
 
  Отбор = Новый Структура();
  Отбор.Вставить("Сумма", 0);
  //27.11.2019
  Отбор.Вставить("Объем", 0);
  Строки = ТаблицаУслуг.НайтиСтроки(Отбор);
  
  возврат (Строки.Количество() > 0);
конецФункции

// БИТ ЖКХ 16.07.2020                         СторноПоСчетам	Ложь	Булево
&НаКлиенте
Процедура СписокУслугПеняУслугаПриИзменении(Элемент)
	Массив = Новый Массив();
	
	Массив.Добавить("Услуга");
	
	ЗаполнениеСчетовКУПениНаСервере(Массив);
	ЗаполнитьСубконтоКУПеняПоНастройкамЖКХ();
	СтрокаТЧ = Элементы.СписокУслугПеня.ТекущиеДанные;
	
	
	СтрокаТЧ.Сумма = 0;

КонецПроцедуры

Процедура ЗаполнитьСубконтоКУПеняПоНастройкамЖКХ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
    "ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.ТранзитныйСчетОплаты КАК ТранзитныйСчетОплаты,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетПениСУ КАК СчетПениСУ,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СчетПениУСО КАК СчетПениУСО,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО1 КАК СубконтоПениУСО1,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО2 КАК СубконтоПениУСО2,
	|	бит_НастройкаПараметровЖКХСрезПоследних.СубконтоПениУСО3 КАК СубконтоПениУСО3
	|ПОМЕСТИТЬ ВТ_ТранзитныйСч
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Момент, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТранзитныйСч.ТранзитныйСчетОплаты КАК ТранзитныйСчетОплаты,
	|	ВТ_ТранзитныйСч.СчетПениСУ КАК СчетПениСУ,
	|	ВТ_ТранзитныйСч.СчетПениУСО КАК СчетПениУСО,
	|	ВТ_ТранзитныйСч.СубконтоПениУСО1 КАК СубконтоПениУСО1
	|ИЗ
	|	ВТ_ТранзитныйСч КАК ВТ_ТранзитныйСч";
	
	ДатаЗаполнения = ?(ЗначениеЗаполнено(Объект.Дата), КонецМесяца(Объект.Дата), ТекущаяДата());
	
	Запрос.УстановитьПараметр("Момент",		  Объект.Дата);
	Запрос.УстановитьПараметр("Организация",  Объект.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет",  Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("ОплатаКУ",	  Объект.ОплатаКУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	//СоответствиеСубконтоКУ = Новый Соответствие;
	Если Выборка.Следующий() Тогда
		Для Каждого Стр Из Объект.СписокУслугПеня Цикл
			Стр.СчетКУ      = Выборка.СчетПениСУ;
			//Стр.Субконто3   = Выборка.СубконтоПениУСО1;
			Стр.СубконтоКУ1 = Выборка.СубконтоПениУСО1;
			//Стр.СубконтоКУ2 = Выборка.СубконтоКУ2;
			//Стр.СубконтоКУ3 = Неопределено;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры


// БИТ ЖКХ 17.07.2020
&НаКлиенте
Процедура СписокУслугПеняУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокУслугОтбора = ПолучитьСписокУслугОтбораНаСервере(Объект.Дата, Объект.ЛицевойСчет);
	
	Если Объект.СписокУслуг.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("СписокУслугОтбора", СписокУслугОтбора);
		
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаРазовыеПоУслугамЖКХ", ПараметрыФормы), Элемент);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОДН(Команда)
	РассчитатьОДННаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьОДННаСервере()
	
	Выгрузка = Объект.СписокУслуг.Выгрузить(,"ЛицевойСчет");	
	мВыгрузка = Новый Массив; 	
	Для Каждого Строка Из Выгрузка Цикл  
   		мВыгрузка.Добавить(Строка); 	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛС", мВыгрузка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);	
	Запрос.УстановитьПараметр("УслугаОДН1", Объект.УслугаОДН1);
	Запрос.УстановитьПараметр("СуммаОДН1", Объект.СуммаОДН1);
	Запрос.УстановитьПараметр("УслугаОДН2", Объект.УслугаОДН2);
	Запрос.УстановитьПараметр("СуммаОДН2", Объект.СуммаОДН2);
	Запрос.УстановитьПараметр("УслугаОДН3", Объект.УслугаОДН3);
	Запрос.УстановитьПараметр("СуммаОДН3", Объект.СуммаОДН3);
	Запрос.УстановитьПараметр("УслугаОДН4", Объект.УслугаОДН4);
	Запрос.УстановитьПараметр("СуммаОДН4", Объект.СуммаОДН4);
	Запрос.УстановитьПараметр("ТЗ", Выгрузка);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ЛицевойСчет КАК ЛицевойСчет
	               |ПОМЕСТИТЬ ЛицевыеСчета
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК бит_ЛицевыеСчета,
	               |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	               |	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	               |	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	               |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета
	               |ПОМЕСТИТЬ ВТ_Площадь
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, ) КАК бит_СведенияОКвартиреСрезПоследних
	               |		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	               |				&Дата,
	               |				ЛицевойСчет В (&ЛС)
	               |					И Услуга.Наименование = ""ОДН Эл/эн"") КАК бит_СведенияПоУслугамЛССрезПоследних
	               |		ПО (бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Ссылка = бит_ЛицевыеСчета.Ссылка)
	               |ГДЕ
	               |	бит_ЛицевыеСчета.Ссылка В(&ЛС)
	               |	И бит_ЛицевыеСчета.Архивный = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВТ_Площадь.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	               |			ТОГДА &СуммаОДН1 * ВТ_Площадь.ОбщаяПлощадь
	               |		ИНАЧЕ &СуммаОДН1 * ВТ_Площадь.ЖилаяПлощадь
	               |	КОНЕЦ КАК Сумма1,
	               |	ВЫБОР
	               |		КОГДА ВТ_Площадь.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	               |			ТОГДА &СуммаОДН2 * ВТ_Площадь.ОбщаяПлощадь
	               |		ИНАЧЕ &СуммаОДН2 * ВТ_Площадь.ЖилаяПлощадь
	               |	КОНЕЦ КАК Сумма2,
	               |	ВЫБОР
	               |		КОГДА ВТ_Площадь.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	               |			ТОГДА &СуммаОДН3 * ВТ_Площадь.ОбщаяПлощадь
	               |		ИНАЧЕ &СуммаОДН3 * ВТ_Площадь.ЖилаяПлощадь
	               |	КОНЕЦ КАК Сумма3,
	               |	ВЫБОР
	               |		КОГДА ВТ_Площадь.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади)
	               |			ТОГДА &СуммаОДН4 * ВТ_Площадь.ОбщаяПлощадь
	               |		ИНАЧЕ &СуммаОДН4 * ВТ_Площадь.ЖилаяПлощадь
	               |	КОНЕЦ КАК Сумма4,
	               |	&УслугаОДН1 КАК УслугаОДН1,
	               |	&УслугаОДН2 КАК УслугаОДН2,
	               |	&УслугаОДН3 КАК УслугаОДН3,
	               |	&УслугаОДН4 КАК УслугаОДН4,
	               |	бит_РазовыеПоУслугамЖКХ.ЛицевойСчет КАК ЛицевойСчетСсылка
	               |ИЗ
	               |	ЛицевыеСчета КАК бит_РазовыеПоУслугамЖКХ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Площадь КАК ВТ_Площадь
	               |		ПО бит_РазовыеПоУслугамЖКХ.ЛицевойСчет = ВТ_Площадь.бит_ЛицевыеСчета";  
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Объект.СписокУслуг.Очистить();
	
	Пока Выборка.Следующий() Цикл
				
		Если ЗначениеЗаполнено(Выборка.Сумма1) Тогда			
		Строка = Объект.СписокУслуг.Добавить();			
		Строка.ЛицевойСчет = Выборка.ЛицевойСчетСсылка;
		Строка.Услуга = Выборка.УслугаОДН1;
		Строка.Сумма = Выборка.Сумма1;		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.Сумма2) Тогда		
		Строка = Объект.СписокУслуг.Добавить();		
		Строка.ЛицевойСчет = Выборка.ЛицевойСчетСсылка;
		Строка.Услуга = Выборка.УслугаОДН2;
		Строка.Сумма = Выборка.Сумма2;		
	КонецЕсли;  
	
		Если ЗначениеЗаполнено(Выборка.Сумма3) Тогда		
		Строка = Объект.СписокУслуг.Добавить();		
		Строка.ЛицевойСчет = Выборка.ЛицевойСчетСсылка;
		Строка.Услуга = Выборка.УслугаОДН3;
		Строка.Сумма = Выборка.Сумма3;		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.Сумма4) Тогда    		
		Строка = Объект.СписокУслуг.Добавить();	
		Строка.ЛицевойСчет = Выборка.ЛицевойСчетСсылка;
		Строка.Услуга = Выборка.УслугаОДН4;
		Строка.Сумма = Выборка.Сумма4;		
	КонецЕсли; 
	
КонецЦикла;

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |  Хозрасчетный.Ссылка КАК Ссылка
               |ИЗ
               |  ПланСчетов.Хозрасчетный КАК Хозрасчетный
               |ГДЕ
               |  Хозрасчетный.КодБыстрогоВыбора = ""76КУ""";

Выборка = Запрос.Выполнить().Выбрать();  
Если Выборка.Следующий() Тогда
  Для Каждого Строка из Объект.СписокУслуг Цикл
    Строка.СчетАбонента = Выборка.Ссылка;
	КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
