#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРаспознаваниеДокументов") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПолеПросмотра = РаспознаваниеДокументовСлужебный.МакетОтображенияКартинкиДокументаHTML();
	АдресКартинки = ПоместитьВоВременноеХранилище(Объект.Ссылка.ИсходноеИзображение.Получить(), УникальныйИдентификатор);
	
	ЮрФизЛицоПоОрганизационнойФорме = РаспознаваниеДокументовСлужебный.ЮрФизЛицоПоОрганизационнойФорме();
	
	СопоставлениеРеквизитов = Новый Структура("Шапка, Таблица");
	РаспознаваниеДокументов.ЗаполнитьТаблицуРеквизитовПоТипам(Объект.ТипДокумента, СопоставлениеРеквизитов.Шапка, СопоставлениеРеквизитов.Таблица);
	АдресСопоставленияРеквизитов = ПоместитьВоВременноеХранилище(СопоставлениеРеквизитов, УникальныйИдентификатор);
	
	Заголовок = Объект.Наименование;
	
	ЗаполнитьАдресаКартинок();
	СохранитьСоответствиеРеквизитовЭлементам();
	ЗаполнитьЭлементыИтогов();
	НастроитьЭлементыПоРеквизитам();
	
	НастроитьКолонкиТаблицы();
	ЗаполнитьТаблицуДокумента();
	
	Если Не УправлениеДоступом.ЧтениеРазрешено(Объект.РеквизитыДокумента[9].Значение) Тогда
		// Организация покупатель
		Объект.РеквизитыДокумента[9].Значение = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	Если Не УправлениеДоступом.ЧтениеРазрешено(Объект.РеквизитыДокумента[8].Значение) Тогда
		// Организация продавец
		Объект.РеквизитыДокумента[8].Значение = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	Если Не УправлениеДоступом.ЧтениеРазрешено(Объект.РеквизитыДокумента[6].Значение) Тогда
		// Договор
		Объект.РеквизитыДокумента[6].Значение = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ИнициализироватьСтруктуруСозданныеДокументы();
	
	Настройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	Если Настройки.ФормаОбработчикаПоказыватьИзображенияВШапке Тогда
		ДобавитьИзображенияРеквизитов(Настройки);
	КонецЕсли;
	ВариантСохраненияСоответствий = Настройки.ВариантСохраненияСоответствий;
	СоздатьСчетФактуру =  Настройки.СоздаватьСчетФактуруПриСозданииОснования;
	
	Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг Тогда
		Элементы.СуммаВключаетНДС.Видимость = Истина;
		Элементы.СтранаПроисхождения.Видимость = Ложь;
		Элементы.НомерГТД.Видимость = Ложь;
		
		Элементы.ФормаСоздатьПоступлениеТовары.Видимость = Ложь;
		Элементы.СоздатьРеализацияТовары.Видимость = Ложь;
		Элементы.СоздатьСчетФактуру.Видимость = Ложь;
		Элементы.КнопкаСоздатьСчетФактуру.Видимость = Ложь;
	Иначе
		Элементы.СуммаВключаетНДС.Видимость = Ложь;
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12 Тогда
			Элементы.СтранаПроисхождения.Видимость = Ложь;
			Элементы.НомерГТД.Видимость = Ложь;
			
			Элементы.ФормаСоздатьПоступлениеУслуги.Видимость = Ложь;
			Элементы.СоздатьРеализацияУслуги.Видимость = Ложь;
			Элементы.СоздатьСчетФактуру.Видимость = Ложь;
			Элементы.КнопкаСоздатьСчетФактуру.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьПоФункциональнымОпциям();
	
	ИзменитьИсточникиДляВыбораДоговора();
	РаспознаваниеДокументовСлужебный.ПересчитатьПроблемныеЭлементы(ЭтотОбъект);
	
	СвойстваОбработки = Новый Структура();
	СвойстваОбработки.Вставить("ИмяЭлементаТаблицы", "СписокНераспознаннойНоменклатуры");
	СвойстваОбработки.Вставить("ИмяЭлементаРеквизитовОбъекта", "ГруппаРеквизитыОбъекта");
	СвойстваОбработки.Вставить("ИмяПроцедурыПриИзменении", "Подключаемый_УстановитьЗначениеТаблицыСозданияНоменклатуры");
	СвойстваОбработки.Вставить("ИмяПроцедурыИзменениеФлажка", "Подключаемый_ПриИзмененииВыбораПоляНераспознаннойНоменклатуры");
	РаспознаваниеДокументовСлужебный.ДобавитьРеквизитыДляСозданияНоменклатуры(ЭтотОбъект, СвойстваОбработки);
	
	Для Каждого Колонка Из СписокНераспознаннойНоменклатуры.Выгрузить().Колонки Цикл
		ИменаКолонокНераспознаннойНоменклатуры.Добавить(Колонка.Имя);
	КонецЦикла;
	
	НайтиИЗаполнитьСозданныеДокументы();
	
	Если Параметры.Свойство("ЧастьКомплекта") И Параметры.ЧастьКомплекта Тогда
		ЧастьКомплекта = Истина;
	КонецЕсли;
	Если ЧастьКомплекта Тогда
		Элементы.ГруппаПодменюСозданиеДокумента.Видимость = Ложь;
		Элементы.СоздатьСчетФактуру.Видимость = Ложь;
		Элементы.Записать.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы.Записать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	СвойстваЯчеекТаблицы = РаспознаваниеДокументовСлужебный.СвойстваЯчеекТаблицы(Объект);
	
	УстановитьУсловноеОформление();
	
	РаспознаваниеДокументовПереопределяемый.ПриСозданииФормыРаспознаванияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Не востребована т.к. права на изменение не отличаются от прав на чтение
	// СтандартныеПодсистемы.УправлениеДоступом
	// УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МаксимальныйНомерСтроки = 0;
	Для Каждого СтрокаТЧ Из ТекущийОбъект.РеквизитыТабличныхЧастей Цикл
		Если СтрокаТЧ.НомерСтрокиТЧ > МаксимальныйНомерСтроки Тогда
			МаксимальныйНомерСтроки = СтрокаТЧ.НомерСтрокиТЧ;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ДанныеКомплекта <> Неопределено И Объект.Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыСозданныхДокументовРаспознаваниеДокументов.Новый") Тогда
		
		ПодключитьОбработчикОжидания("ПоказатьСозданиеКомплекта", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияЗакрытия", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.РаспознанныйДокумент.Форма.ФормаОбратнойСвязи" Тогда
		РаспознаваниеДокументовСлужебныйКлиент.ОбработкаВыбораОбратнойСвязи(ЭтотОбъект, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбранРеквизитФормыСоздания" Тогда
		ПриблизитьПоКоординатам(Параметр.Координаты, Параметр.ВысотаКартинки);
	ИначеЕсли ИмяСобытия = "ПрикрепленСканДокумента" Тогда
		НайтиИЗаполнитьСозданныеДокументы();
		ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПодключитьОбработчикОжидания("Подключаемый_ПослеЗаписи", 0.1, Истина)
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьЗначенияПередЗаписью();
	РаспознаваниеДокументовСлужебный.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	СохранитьСоответствиеРеквизитовЭлементам();
	
	РаспознаваниеДокументовПереопределяемый.ПослеЗаписиФормыРаспознаванияНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Не отработает, т.к. в процедуре РаспознаваниеДокументовСлужебный.ПередЗаписьюНаСервере всегда устанавливается
	// Отказ = Истина, а затем происходит программная запись (в некоторых случаях в привилегированном режиме)
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПослеЗаписи() Экспорт
	Оповестить("РаспознанныйДокумент_ОбновитьОтборФормыСписка", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияПередЗаписью()
	
	СохранитьИтоговыеЗначения();
	СохранитьЗначенияИзТаблицыДокумента();
	РаспознаваниеДокументовПереопределяемый.ПередЗаписьюРаспознанногоДокумента(Объект);
	ЗаписатьСоответствияРаспознанныхСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствияРаспознанныхСтрок()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СоответствияСтрок", НаборСоответствийРаспознанныхСтрок.Выгрузить(,"ТипЗначения,РаспознаннаяСтрока,СоответствующееЗначение,КоличествоПовторений"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияСтрок.ТипЗначения КАК ТипЗначения,
	|	СоответствияСтрок.РаспознаннаяСтрока КАК РаспознаннаяСтрока,
	|	СоответствияСтрок.СоответствующееЗначение КАК СоответствующееЗначение,
	|	СоответствияСтрок.КоличествоПовторений КАК КоличествоПовторений
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	&СоответствияСтрок КАК СоответствияСтрок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ТипЗначения КАК ТипЗначения,
	|	ДанныеДокумента.РаспознаннаяСтрока КАК РаспознаннаяСтрока,
	|	ДанныеДокумента.СоответствующееЗначение КАК СоответствующееЗначение,
	|	ДанныеДокумента.КоличествоПовторений + ЕСТЬNULL(ДанныеРегистра.КоличествоПовторений, 0) КАК КоличествоПовторений
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРаспознанныхСтрокРаспознаваниеДокументов КАК ДанныеРегистра
	|		ПО ДанныеДокумента.ТипЗначения = ДанныеРегистра.ТипЗначения
	|			И ДанныеДокумента.РаспознаннаяСтрока = ДанныеРегистра.РаспознаннаяСтрока
	|			И ДанныеДокумента.СоответствующееЗначение = ДанныеРегистра.СоответствующееЗначение
	|ГДЕ
	|	НЕ ЕСТЬNULL(ДанныеРегистра.ИзмененоВручную, ЛОЖЬ)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	АвторЗаписи = Пользователи.ТекущийПользователь();
	ДатаЗаписи = ТекущаяДатаСеанса();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.СоответствиеРаспознанныхСтрокРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Автор = АвторЗаписи;
		Запись.ДатаСоздания = ДатаЗаписи;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	СохранитьПривязкуДокумента(НовыйОбъект);
	Записать();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеПросмотраДокументСформирован(Элемент)
	
	Если Элемент.Документ.baseURI = "about:blank" Тогда
		Возврат;
	КонецЕсли;
	
	РаспознаваниеДокументовСлужебныйКлиент.ЗагрузитьКартинкуПоАдресу(Элементы.ПолеПросмотра, АдресКартинки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПросмотраПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element.id = "image_load_button" Тогда
		HTMLДокументСформирован = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	
	НаправлениеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачалоВыбораПоля(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяЭлемента = Элемент.Имя;
	Отбор = Новый Структура("ИмяЭлемента", ИмяЭлемента);
	НайденныеСтроки = Объект.РеквизитыДокумента.НайтиСтроки(Отбор);
	
	Если НЕ НайденныеСтроки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	КоординатыКартинки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПолучитьНаборКоординат(НайденныеСтроки[0]);
	ПриблизитьПоКоординатам(КоординатыКартинки, НайденныеСтроки[0].СтрокВИзображении);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСоздание(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ИсточникПоляДоговорКонтрагент) ИЛИ
		НЕ ЗначениеЗаполнено(ИсточникПоляДоговорОрганизация) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Перед созданием договора необходимо заполнить поля ""Контрагент"" и ""Организация""'");
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательОнЖеПриИзменении(Элемент)
	
	Подключаемый_НачалоВыбораПоля(Элементы.Грузополучатель, Неопределено, Истина);
	Элементы.Грузополучатель.Доступность = (ГрузополучательОнЖе = 0);
	Если ГрузополучательОнЖе Тогда
		Объект.РеквизитыДокумента[5].Значение = Новый(ТипЗнч(Объект.РеквизитыДокумента[5].Значение));
	КонецЕсли;
	
	ПриИзмененииПоляНаКлиенте(Элементы.Грузополучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительОнЖеПриИзменении(Элемент)
	
	Подключаемый_НачалоВыбораПоля(Элементы.Грузоотправитель, Неопределено, Истина);
	Элементы.Грузоотправитель.Доступность = (ГрузоотправительОнЖе = 0);
	Если ГрузоотправительОнЖе Тогда
		Объект.РеквизитыДокумента[4].Значение = Новый(ТипЗнч(Объект.РеквизитыДокумента[4].Значение));
	КонецЕсли;
	
	ПриИзмененииПоляНаКлиенте(Элементы.Грузоотправитель);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииПоля(Элемент)
	
	ПриИзмененииПоляНаКлиенте(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляНаКлиенте(Элемент)
	
	ПриИзмененииПоляНаСервере(Элемент.Имя);
	РаспознаваниеДокументовСлужебныйКлиент.ДобавитьСоответствиеРаспознаваемыхСтрок(
		Объект,
		ВариантСохраненияСоответствий,
		НаборСоответствийРаспознанныхСтрок,
		Элемент.Имя
	);
	
	ИмяПоля = Элемент.Имя;
	Если ДанныеКомплекта <> Неопределено И
		(ИмяПоля = "ИтогоВсегоБелый" Или ИмяПоля = "ИтогоВсегоКрасный" Или ИмяПоля = "ДатаДокумента"
		Или ИмяПоля = "Продавец" Или ИмяПоля = "ПокупательОрганизация"
		Или ИмяПоля = "Покупатель" ИЛИ ИмяПоля = "ПродавецОрганизация") Тогда
		
		ПоказатьСозданиеКомплекта();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПоляНаСервере(ИмяПоля)
	
	Отбор = Новый Структура("ИмяЭлемента", ИмяПоля);
	НайденныеСтроки = Объект.РеквизитыДокумента.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		Если НЕ НайденныеСтроки[0].ЗаполненоВручную Тогда
			НайденныеСтроки[0].ЗаполненоВручную = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "ИтогоВсегоБелый" ИЛИ ИмяПоля = "ИтогоВсегоКрасный"
		ИЛИ ИмяПоля = "НомерДокумента" ИЛИ ИмяПоля = "ДатаДокумента" Тогда
		ВыполнитьПоискСозданныхДокументов(ИмяПоля);
	ИначеЕсли ИмяПоля = "СуммаВключаетНДС" Тогда
		// Поле СуммаВключаетНДС на форме видно только у актов, а в них есть реквизит для хранения значения
		СуммаВключаетНДС = Объект.РеквизитыДокумента[17].Значение;
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
			РаспознаваниеДокументовСлужебныйКлиентСервер.ПриИзмененииСтавкаНДС(СтрокаТаблицы, СуммаВключаетНДС);
		КонецЦикла;
	ИначеЕсли ИмяПоля = "Продавец" ИЛИ ИмяПоля = "ПокупательОрганизация" Тогда
		// Поступление
		Если НЕ СозданныеДокументы.Поступление.СозданПоРаспознанномуДокументу Тогда
			СозданныеДокументы.Поступление.Ссылка = Неопределено;
			СозданныеДокументы.СчетФактураПолученный.Ссылка = Неопределено;
		КонецЕсли;
		ВыполнитьПоискСозданныхДокументов(ИмяПоля);
		ИзменитьИсточникиДляВыбораДоговора(ИмяПоля);
	ИначеЕсли ИмяПоля = "Покупатель" ИЛИ ИмяПоля = "ПродавецОрганизация" Тогда
		// Реализация
		Если НЕ СозданныеДокументы.Реализация.СозданПоРаспознанномуДокументу Тогда
			СозданныеДокументы.Реализация.Ссылка = Неопределено;
			СозданныеДокументы.СчетФактураВыданный.Ссылка = Неопределено;
		КонецЕсли;
		ВыполнитьПоискСозданныхДокументов(ИмяПоля);
		ИзменитьИсточникиДляВыбораДоговора(ИмяПоля);
	КонецЕсли;
	
	СохранитьИтоговыеЗначения();
	СохранитьЗначенияИзТаблицыДокумента();
	РаспознаваниеДокументовСлужебный.ПересчитатьПроблемныеЭлементы(ЭтотОбъект);
	
	НайтиИЗаполнитьСозданныеДокументы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискСозданныхДокументов(ИмяПоля)
	
	Если ИмяПоля = "ИтогоВсегоБелый" ИЛИ ИмяПоля = "ИтогоВсегоКрасный"
		ИЛИ ИмяПоля = "НомерДокумента" ИЛИ ИмяПоля = "ДатаДокумента" Тогда
		
		Если НЕ СозданныеДокументы.Поступление.СозданПоРаспознанномуДокументу Тогда
			СозданныеДокументы.Поступление.Ссылка = Неопределено;
			СозданныеДокументы.СчетФактураПолученный.Ссылка = Неопределено;
		КонецЕсли;
		Если НЕ СозданныеДокументы.Реализация.СозданПоРаспознанномуДокументу Тогда
			СозданныеДокументы.Реализация.Ссылка = Неопределено;
			СозданныеДокументы.СчетФактураВыданный.Ссылка = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ИзменитьОтображениеПоТипуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АвтоПодборПоля(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СтрЗаканчиваетсяНа(Элемент.Имя, "Белый") Тогда
		ИмяЭлемента = СтрЗаменить(Элемент.Имя, "Белый", "");
	ИначеЕсли СтрЗаканчиваетсяНа(Элемент.Имя, "Красный") Тогда
		ИмяЭлемента = СтрЗаменить(Элемент.Имя, "Красный", "");
	Иначе
		ИмяЭлемента = Элемент.Имя;
	КонецЕсли;
	
	Реквизит = РаспознаваниеДокументовСлужебныйКлиентСервер.РеквизитДокумента(Объект, ИмяЭлемента, Ложь);
	Если Реквизит = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоординатыКартинки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПолучитьНаборКоординат(Реквизит);
	ПриблизитьПоКоординатам(КоординатыКартинки, Реквизит.СтрокВИзображении);
	
	Если Элемент.Имя = "Договор" Тогда
		СтандартнаяОбработка = Ложь;
		Тип = Новый(ТипЗнч(Реквизит.Значение));
		ЗаполнитьСписокВыбораПоляНаСервере(Реквизит.РаспознанныйТекст, Тип, ДанныеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоляНаСервере(РаспознанныйТекст, Тип, ДанныеВыбора)
	РаспознаваниеДокументовСлужебный.ЗаполнитьСписокВыбораПоля(ЭтотОбъект, РаспознанныйТекст, Тип, ДанныеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаВыбораПоля(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		
		// По жалобам пользователей отключено, хочется, чтобы при выборе существующей номенклатуры 
		// в содержании сохранялся распознанный текст
		//
		//Если Элемент.Имя = "Номенклатура" Тогда
		//	Элементы.ТаблицаДокумента.ТекущиеДанные.Содержание = Строка(ВыбранноеЗначение);
		//КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ИмяЭлемента = Элемент.Имя;
	Если ИмяЭлемента = "ПродавецОрганизация" ИЛИ ИмяЭлемента = "ПокупательОрганизация" Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлемент = Элементы.ТаблицаДокумента Тогда
		НомерСтроки = Элементы.ТаблицаДокумента.ТекущиеДанные.НомерСтроки;
		Отбор = Новый Структура("НомерСтрокиТЧ", НомерСтроки);
		НаборДанных = Объект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Значение = Элементы.ТаблицаДокумента.ТекущиеДанные[ИмяЭлемента];
	Иначе
		НаборДанных = Объект.РеквизитыДокумента;
		Отбор = Новый Структура("ИмяЭлемента", ИмяЭлемента);
		ПодходящиеСтроки = Объект.РеквизитыДокумента.НайтиСтроки(Отбор);
		Если ПодходящиеСтроки.Количество() > 0 Тогда
			Значение = ПодходящиеСтроки[0].Значение;
		Иначе
			Значение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	НаборДанных = РаспознаваниеДокументовСлужебныйКлиент.НаборДанныхСозданияЭлемента(НаборДанных);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ЮрФизЛицоПоОрганизационнойФорме", ЮрФизЛицоПоОрганизационнойФорме);
	ДополнительныеДанные.Вставить("ВидДоговора", ИсточникПоляДоговорВидДоговора);
	
	РаспознаваниеДокументовСлужебныйКлиент.ОткрытьФормуСозданияЭлемента(
		ИмяЭлемента,
		НаборДанных,
		ДополнительныеДанные,
		Объект,
		Элемент,
		Значение
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьЗначениеТаблицыСозданияНоменклатуры(Элемент) Экспорт
	
	ИмяРеквизита = СтрЗаменить(Элемент.Имя, "ПолеСписокНераспознаннойНоменклатуры" , "");
	
	РедактируемаяСтрока = СтрокаПолейНераспознаннойНоменклатурыПоИмениРеквизита(ИмяРеквизита);
	Если РедактируемаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РедактируемаяСтрока.Выбран = Истина;
	ИзменитьДоступностьКнопкиУстановкиРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииВыбораПоляНераспознаннойНоменклатуры(Элемент) Экспорт
	
	ИзменитьДоступностьКнопкиУстановкиРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаГрупповоеСоздание" Тогда
		ОбновитьСтрокиНераспознаннойНоменклатуры();
	КонецЕсли;
	
	// Выделяем все строки
	Для Каждого СтрокаДобавления Из СписокНераспознаннойНоменклатуры Цикл
		Элементы.СписокНераспознаннойНоменклатуры.ВыделенныеСтроки.Добавить(СтрокаДобавления.ПолучитьИдентификатор());
	КонецЦикла;
	
	// Фокусируемся на первой строке
	Если СписокНераспознаннойНоменклатуры.Количество() Тогда
		ИдентификаторПервойСтроки = СписокНераспознаннойНоменклатуры[0].ПолучитьИдентификатор();
		Элементы.СписокНераспознаннойНоменклатуры.ТекущаяСтрока = ИдентификаторПервойСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	РаспознаваниеДокументовСлужебныйКлиент.ИзменитьТипДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДокумента

&НаКлиенте
Процедура ТаблицаДокументаПриИзменении(Элемент)
	
	ПорядокСтроки = 0;
	Для Каждого Строка Из ТаблицаДокумента Цикл
		ПорядокСтроки = ПорядокСтроки + 1;
		Если Строка.ПорядокСтроки <> ПорядокСтроки Тогда
			Строка.ПорядокСтроки = ПорядокСтроки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументаПриАктивизацииЯчейки(Элемент)
	
	ПриАктивизацииЯчейкиТаблицы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииЯчейкиТаблицы(Элемент)
	
	Если ТипЗнч(ТекущийЭлемент) <> Тип("ТаблицаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВыбранныйЭлемент = Элемент.ТекущийЭлемент;
	Если ТекущийВыбранныйЭлемент = Неопределено Или Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = ТекущийВыбранныйЭлемент.Имя;
	НомерСтрокиТЧ = Элемент.ТекущиеДанные.НомерСтроки;
	
	ЭлементКолонка = Элементы[ИмяРеквизита];
	ЭлементКолонка.СписокВыбора.Очистить();
	
	Ключ = РаспознаваниеДокументовСлужебныйКлиентСервер.КлючСвойстваЯчеекТаблицы(ИмяРеквизита, НомерСтрокиТЧ);
	
	Свойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваЯчеекТаблицы, Ключ);
	Если Свойства = Неопределено Тогда
		
		ДанныеПриближения = Новый Структура("Координаты, СтрокВИзображении", Неопределено, 0);
		ПодключитьОбработчикОжидания("Подключаемый_ПриблизитьПоКоординатам", 0.2, Истина);
		
		Возврат;
	КонецЕсли;
	
	ДанныеПриближения = Новый Структура("Координаты, СтрокВИзображении", Свойства.Координаты, Свойства.СтрокВИзображении);
	ПодключитьОбработчикОжидания("Подключаемый_ПриблизитьПоКоординатам", 0.2, Истина);
	
	НадписьОшибкаТЧ = Элемент.ТекущиеДанные[ИмяРеквизита + "ТекстОшибки"];
	
	Элементы.НадписьОшибкаТЧ.Видимость = Не ПустаяСтрока(НадписьОшибкаТЧ);
	
	СписокДляВыбора = РаспознаваниеДокументовСлужебныйКлиент.ПолучитьЗначенияСпискаВыбора(
		Свойства.РаспознанныйТекст, Свойства.ТипЗначения, Свойства.ЗначенияВыбора);
	
	Для Каждого ДанныеВыбора Из СписокДляВыбора Цикл
		ЭлементКолонка.СписокВыбора.Добавить(ДанныеВыбора.Значение, ДанныеВыбора.Представление, , ДанныеВыбора.Картинка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриблизитьПоКоординатам()
	ПриблизитьПоКоординатам(ДанныеПриближения.Координаты, ДанныеПриближения.СтрокВИзображении);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииКолонки(Элемент)
	
	ИдентификаторСтроки = Элементы["ТаблицаДокумента"].ТекущаяСтрока;
	
	ИмяРеквизита = Элемент.Имя;
	ТекущиеДанные = Элементы["ТаблицаДокумента"].ТекущиеДанные;
	НомерСтрокиТЧ = ТекущиеДанные.НомерСтроки;
	ВыбранноеЗначение = ТекущиеДанные[ИмяРеквизита];
	
	ТекущиеДанные[ИмяРеквизита + "ЗаполненоВручную"] = Истина;
	
	РаспознаваниеДокументовСлужебныйКлиентСервер.ПриИзмененииКолонки(
		Объект,
		ТекущиеДанные,
		ИмяРеквизита,
		ВыбранноеЗначение
	);
	
	РаспознаваниеДокументовСлужебныйКлиентСервер.ПересчитатьПроблемныеРеквизитыТаблицыДокумента(
		ЭтотОбъект,
		ТекущиеДанные
	);
	
	Отбор = Новый Структура("ИмяРеквизита, НомерСтроки", ИмяРеквизита, НомерСтрокиТЧ);
	НайденныеСтроки = ПроблемныеЭлементы.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		НадписьОшибкаТЧ = ТекущиеДанные[ИмяРеквизита + "ТекстОшибки"];
	Иначе
		НадписьОшибкаТЧ = "";
	КонецЕсли;
	
	Элементы.НадписьОшибкаТЧ.Видимость = НЕ ПустаяСтрока(НадписьОшибкаТЧ);
	
	Ключ = РаспознаваниеДокументовСлужебныйКлиентСервер.КлючСвойстваЯчеекТаблицы(ИмяРеквизита, НомерСтрокиТЧ);
	
	Свойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваЯчеекТаблицы, Ключ);
	
	РаспознаваниеДокументовСлужебныйКлиент.ДобавитьСоответствиеРаспознаваемыхСтрок(
		Объект,
		ВариантСохраненияСоответствий,
		НаборСоответствийРаспознанныхСтрок,
		ИмяРеквизита,
		ТекущиеДанные.НомерСтроки,
		ТекущиеДанные[ИмяРеквизита],
		Свойства
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументаПередУдалением(Элемент, Отказ)
	
	ТекущийНомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
	Отбор = Новый Структура("НомерСтроки", ТекущийНомерСтроки);
	НайденныеСтроки = ПроблемныеЭлементы.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ПроблемныеЭлементы.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументаПослеУдаления(Элемент)
	ТаблицаДокументаПослеУдаленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаДокументаПослеУдаленияНаСервере()
	
	СохранитьИтоговыеЗначения();
	СохранитьЗначенияИзТаблицыДокумента();
	РаспознаваниеДокументовСлужебный.ПересчитатьПроблемныеЭлементы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		НоваяСтрока = Элемент.ТекущиеДанные;
		НоваяСтрока.ПорядокСтроки = ТаблицаДокумента.Количество();
		
		ЗаполнитьКлючиНовойСтроки(НоваяСтрока, МаксимальныйНомерСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНераспознаннойНоменклатуры

&НаКлиенте
Процедура СписокНераспознаннойНоменклатурыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.СписокНераспознаннойНоменклатуры.ТекущиеДанные = Неопределено
		Или Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторИсходнойСтроки = Элемент.ТекущиеДанные.ИдентификаторИсходнойСтроки;
	СтрокаТаблицыДокумента = ТаблицаДокумента.НайтиПоИдентификатору(ИдентификаторИсходнойСтроки);
	Если СтрокаТаблицыДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "СписокНераспознаннойНоменклатуры", "");
	НомерСтроки = СтрокаТаблицыДокумента.НомерСтроки;
	
	ОбновлениеВыделенияРамкойПоляДокумента(ИмяЭлемента, НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНераспознаннойНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Для Каждого Реквизит Из ИменаКолонокНераспознаннойНоменклатуры Цикл
		Если Элементы.СписокНераспознаннойНоменклатуры.ТекущиеДанные = Неопределено Тогда
			УстановитьЗначениеДляРеквизитовБыстрогоРедактирования(Реквизит.Значение);
		Иначе
			ЗначениеЯчейки = Элементы.СписокНераспознаннойНоменклатуры.ТекущиеДанные[Реквизит.Значение];
			УстановитьЗначениеДляРеквизитовБыстрогоРедактирования(Реквизит.Значение, ЗначениеЯчейки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьРаспознанныйДокумент(Команда)
	
	Если ДанныеКомплекта <> Неопределено Тогда
		ОткрытьДокументПоСсылке(ДанныеКомплекта.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСозданныйДокумент(Команда)
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий") Тогда
		ОткрываемыйДокумент = СозданныеДокументы.Поступление.Ссылка;
		Если Не ЗначениеЗаполнено(ОткрываемыйДокумент) Тогда
			ОткрываемыйДокумент = СозданныеДокументы.Реализация.Ссылка;
		КонецЕсли;
	Иначе
		ОткрываемыйДокумент = СозданныеДокументы.Реализация.Ссылка;
		Если Не ЗначениеЗаполнено(ОткрываемыйДокумент) Тогда
			ОткрываемыйДокумент = СозданныеДокументы.Поступление.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьДокументПоСсылке(ОткрываемыйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРаспознаннуюСФ(Команда)
	
	// Видна только когда есть комплект
	ОткрытьДокументПоСсылке(ДанныеКомплекта.РаспознанныйДокументСФ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСозданнуюСФ(Команда)
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий") Тогда
		ОткрываемыйДокумент = СозданныеДокументы.СчетФактураПолученный.Ссылка;
		Если Не ЗначениеЗаполнено(ОткрываемыйДокумент) Тогда
			ОткрываемыйДокумент = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		КонецЕсли;
	Иначе
		ОткрываемыйДокумент = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		Если Не ЗначениеЗаполнено(ОткрываемыйДокумент) Тогда
			ОткрываемыйДокумент = СозданныеДокументы.СчетФактураПолученный.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьДокументПоСсылке(ОткрываемыйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеДубляДокументаОбщее(Команда)
	
	ИдДубля = СтрРазделить(СтрЗаменить(Команда.Имя, "ОткрытиеДокумент", ""), "Дубль", Ложь);
	ЭтотДубль = ДанныеДублей["Документ"+ИдДубля[0]][Число(ИдДубля[1])];
	ОткрытьДокументПоСсылке(ЭтотДубль.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеДубляСозданногоДокументаОбщее(Команда)
	
	ИдДубля = СтрРазделить(СтрЗаменить(Команда.Имя, "ОткрытиеСозданныйДокумент", ""), "Дубль", Ложь);
	ЭтотДубль = ДанныеСозданныхДублей["Документ"+ИдДубля[0]][Число(ИдДубля[1])];
	ОткрытьДокументПоСсылке(ЭтотДубль);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомплект(Команда)
	ПоказатьСозданиеКомплекта();
КонецПроцедуры

&НаКлиенте
Процедура ПожаловатьсяНаКачество(Команда)
	
	РаспознаваниеДокументовСлужебныйКлиент.ОткрытьФормуОбратнойСвязи(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацияОборудование(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Оборудование");
	ОткрытиеФормыДокумента("РеализацияТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацияОтгрузкаБезПереходаПраваСобственности(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности");
	ОткрытиеФормыДокумента("РеализацияТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацияПродажаКомиссия(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ПродажаКомиссия");
	ОткрытиеФормыДокумента("РеализацияТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацияТовары(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары");
	ОткрытиеФормыДокумента("РеализацияТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацияУслуги(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Услуги");
	ОткрытиеФормыДокумента("РеализацияТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеВПереработку(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеОборудование(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Оборудование");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеОбъектыСтроительства(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеОсновныеСредства(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеПокупкаКомиссия(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеТовары(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Товары");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеУслуги(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеУслугиЛизинга(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.УслугиЛизинга");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеУслугиФакторинга(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.УслугиФакторинга");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриобретениеЗемельныхУчастков(Команда)
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства");
	ОткрытиеФормыДокумента("ПоступлениеТоваровУслуг", ВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда)
	
	КлючеваяОперация = "РаспознаваниеДокументов.Перепроверить";
	Замер = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	Комментарий = Новый Структура;
	Комментарий.Вставить("ИдентификаторРезультата", Объект.ИдентификаторРезультата);
	
	ОценкаПроизводительностиКлиент.УстановитьКомментарийЗамера(Замер, Комментарий);
	
	ПерепроверитьНаСервере();
	
	ОбновитьСтрокиНераспознаннойНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	ПараметрыСоздаваемойНоменклатуры = Новый Массив;
	
	Для Каждого ВыбраннаяСтрока Из Элементы.СписокНераспознаннойНоменклатуры.ВыделенныеСтроки Цикл
		
		Данные = СписокНераспознаннойНоменклатуры.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		ПараметрыСоздания = Новый Структура();
		
		Для Каждого Колонка Из ИменаКолонокНераспознаннойНоменклатуры Цикл
			ИмяКолонки = Колонка.Значение;
			ПараметрыСоздания.Вставить(ИмяКолонки, Данные[ИмяКолонки]);
		КонецЦикла;
		
		ПараметрыСоздания.Вставить("Ссылка");
		
		ПараметрыСоздаваемойНоменклатуры.Добавить(ПараметрыСоздания);
		
	КонецЦикла;
	
	ВыполнитьСозданиеНоменклатуры(ПараметрыСоздаваемойНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗначенияСтрокНераспознаннойНоменклатуры(Команда)
	
	Для Каждого РеквизитТекущихСтрок Из ПоляНераспознаннойНоменклатуры Цикл
		Если РеквизитТекущихСтрок.Выбран = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьЗначениеДляВыделенныхСтрок(РеквизитТекущихСтрок.Значение, РеквизитТекущихСтрок.ИмяРеквизита);
	КонецЦикла;
	
	ИзменитьДоступностьКнопкиУстановкиРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсегоНайденные(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РаспознанныйДокумент", Объект.Ссылка);
	
	ОткрытьФорму(
		"Документ.РаспознанныйДокумент.Форма.ПрикрепитьИзображениеКНайденомуДокументу",
		ПараметрыОткрытия,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСозданныйДокументСчетФактура(Команда)
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
		ОткрытьДокументПоСсылке(СозданныеДокументы.СчетФактураВыданный.Ссылка);
	Иначе
		ОткрытьДокументПоСсылке(СозданныеДокументы.СчетФактураПолученный.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьСкан(Команда)
	
	ОтмеченоОбработанным = ПрикрепитьСканНаСервереИОтметитьОбработанным();
	
	Если ОтмеченоОбработанным Тогда
		СледующийДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрикрепитьСканНаСервереИОтметитьОбработанным()
	
	Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
		Кандидат = СозданныеДокументы.Поступление.Ссылка;
		Кандидат2 = СозданныеДокументы.СчетФактураПолученный.Ссылка;
	Иначе
		Кандидат = СозданныеДокументы.Реализация.Ссылка;
		Кандидат2 = СозданныеДокументы.СчетФактураВыданный.Ссылка;
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Если ЗначениеЗаполнено(Кандидат) И Объект.ТипДокумента <> Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
		РаспознаваниеДокументовСлужебный.ДобавитьПрисоединенныйФайл(Объект, Кандидат, АдресКартинки);
		РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(Кандидат, Объект.Ссылка, Ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(Кандидат2) И Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
		РаспознаваниеДокументовСлужебный.ДобавитьПрисоединенныйФайл(Объект, Кандидат2, АдресКартинки);
		РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(Кандидат2, Объект.Ссылка, Ложь);
	КонецЕсли;
	
	ТекущиеНастройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("ПрикрепилСкан");
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(Объект.ИдентификаторРезультата, Пакет);
	
	Если ТекущиеНастройки.ПомечатьДокументОбработаннымПриПрикреаленииИзображения Тогда
		Объект.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Обработан;
		Записать();
		
		РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Проведен");
		Пакет = Новый Структура("created", РезультатОбратнойСвязи);
		РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(Объект.ИдентификаторРезультата, Пакет);
		
		ОтмеченоОбработанным = Истина;
	Иначе
		ОтмеченоОбработанным = Ложь;
	КонецЕсли;
	
	НайтиИЗаполнитьСозданныеДокументы();
	
	Возврат ОтмеченоОбработанным;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьСозданиеКомплекта() Экспорт
	
	Если ЧастьКомплекта Тогда
		Возврат;
	КонецЕсли;
	ДанныеКомплекта.Вставить("ДанныеОбработки", РаспознаваниеДокументовСлужебныйКлиентСервер.НовыеДанныеОбработкиКомплектов());
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолученВариантСозданияКомплекта", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ПараметрыСоздания, СозданныеДокументы", ДанныеКомплекта, СозданныеДокументы);
	ОткрытьФорму("Обработка.РаспознаваниеДокументов.Форма.СозданиеКомплекта", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученВариантСозданияКомплекта(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать();
		Подключаемый_ПослеЗаписи();
	КонецЕсли;
	
	РаспознаваниеДокументовСлужебныйКлиентСервер.ОбработатьДокументыКомплекта(ЭтотОбъект, Результат);
	Если Результат.Свойство("УдалосьОбработать") И Результат.УдалосьОбработать Тогда
		СледующийДокумент();
	ИначеЕсли Результат.ДанныеОбработки <> Неопределено И Результат.ДанныеОбработки.КомплектовНеУдалосьОбработать <> 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Не удалось обработать комплект. Повторите операцию после исправления ошибок:'");
		ПараметрыФормы = Новый Структура("ОшибкиПроведения, ТекстПредупреждения, ОткрытыйДокумент", Результат.ДанныеОбработки.ОшибкиПроведения, ТекстПредупреждения, Объект.Ссылка);
		ОткрытьФорму("Обработка.РаспознаваниеДокументов.Форма.ОтчетПоОшибкам", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НаправлениеПриИзмененииНаСервере()
	
	ИзменитьИсточникиДляВыбораДоговора();
	СохранитьИтоговыеЗначения();
	СохранитьЗначенияИзТаблицыДокумента();
	РаспознаваниеДокументовСлужебный.ПересчитатьПроблемныеЭлементы(ЭтотОбъект);
	НайтиИЗаполнитьСозданныеДокументы();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПоФункциональнымОпциям()
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиУчетПоДоговорам") Тогда
		Элементы.ГруппаДоговор.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладовБухгалтерскийУчет") Тогда
		Элементы.ГруппаСклад.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОСозданииДокумента(ТипДокументаСтрокой, ВидОперации)
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТипДокументаСтрокой", ТипДокументаСтрокой);
	ДополнительныеПараметры.Вставить("ВидОперации", ВидОперации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолученРезультатОтветаНаВопрос", ЭтаФорма, ДополнительныеПараметры);
	
	СписокОбъектов = Новый СписокЗначений();
	СписокОбъектов.ЗагрузитьЗначения(ПолучитьСозданныеДокументыИзТекущего());
	
	ПараметрыФормы = Новый Структура("СписокОбъектов", СписокОбъектов);
	
	ОткрытьФорму("ОбщаяФорма.ВопросПриНаличииИмеющихсяДокументовБРД", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСозданныеДокументыИзТекущего()
	
	СвязанныеДокументы = РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ВсеСвязанныеДокументы(Объект.Ссылка);
	Возврат СвязанныеДокументы.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура СледующийДокумент()
	
	Результат = НайтиДокумент(Истина);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = НайтиДокумент(Ложь);
	КонецЕсли;
	
	ПерейтиНаДокумент(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаДокумент(Результат)
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ИмяФормыОбработчика = РаспознаваниеДокументовСлужебныйКлиентПовтИсп.ПолучитьИмяОткрываемойФормыПоТипу(Результат.ТипДокумента);
		Если Не ПустаяСтрока(ИмяФормыОбработчика) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Результат.Ссылка);
			ПараметрыФормы.Вставить("ОтборИзСписка", Параметры.ОтборИзСписка);
			ОткрытьФорму(ИмяФормыОбработчика, ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция НайтиДокумент(Следующий)
	
	ОтборДата = Ложь;
	ОтборОрганизация = Ложь;
	ОтборКонтрагент = Ложь;
	
	Если ЗначениеЗаполнено(Параметры.ОтборИзСписка) Тогда 
		
		Если ЗначениеЗаполнено(Параметры.ОтборИзСписка.ТекущаяДата) Тогда 
			
			ОтборДата = Истина;
			
			Если Параметры.ОтборИзСписка.ТекущаяДатаПериод = "День" Тогда
				НачалоПериода = НачалоДня(Параметры.ОтборИзСписка.ТекущаяДата);
				КонецПериода = КонецДня(Параметры.ОтборИзСписка.ТекущаяДата);
			ИначеЕсли Параметры.ОтборИзСписка.ТекущаяДатаПериод = "Месяц" Тогда
				НачалоПериода = НачалоМесяца(Параметры.ОтборИзСписка.ТекущаяДата);
				КонецПериода = КонецМесяца(Параметры.ОтборИзСписка.ТекущаяДата);
			КонецЕсли;
			
		КонецЕсли;
		
		ОтборОрганизация = ЗначениеЗаполнено(Параметры.ОтборИзСписка.ТекущаяОрганизация);
		ОтборКонтрагент = ЗначениеЗаполнено(Параметры.ОтборИзСписка.ТекущийКонтрагент);
		
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РаспознанныйДокумент.Ссылка КАК Ссылка,
		|	РаспознанныйДокумент.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	Документ.РаспознанныйДокумент КАК РаспознанныйДокумент
		|ГДЕ
		|	(РаспознанныйДокумент.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСозданныхДокументовРаспознаваниеДокументов.Новый)
		|			ИЛИ РаспознанныйДокумент.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСозданныхДокументовРаспознаваниеДокументов.Изменен))
		|	И НЕ РаспознанныйДокумент.ПометкаУдаления
		|	И РаспознанныйДокумент.Дата < &Дата
		|	И РаспознанныйДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РаспознанныйДокумент.Контрагент = &Контрагент
		|	И РаспознанныйДокумент.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	РаспознанныйДокумент.МоментВремени УБЫВ";
	
	Если Следующий Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " УБЫВ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<", ">=");
	КонецЕсли;
	
	Если ОтборДата Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РаспознанныйДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода", "");
	КонецЕсли;
	
	Если ОтборОрганизация Тогда
		Запрос.УстановитьПараметр("Организация", Параметры.ОтборИзСписка.ТекущаяОрганизация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РаспознанныйДокумент.Организация = &Организация", "");
	КонецЕсли;
	
	Если ОтборКонтрагент Тогда
		Запрос.УстановитьПараметр("Контрагент", Параметры.ОтборИзСписка.ТекущийКонтрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РаспознанныйДокумент.Контрагент = &Контрагент", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("Ссылка, ТипДокумента");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолученРезультатОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьСозданиеНовогоДокумента(ДополнительныеПараметры.ВидОперации, ДополнительныеПараметры.ТипДокументаСтрокой);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриблизитьПоКоординатам(Координаты, СтрокВИзображении)
	
	Если HTMLДокументСформирован Тогда
		Если РаспознаваниеДокументовКлиентСервер.ВсеКоординатыНулевые(Координаты) Тогда
			Элементы.ПолеПросмотра.Документ.defaultView.clean_bbox();
		Иначе
			Элементы.ПолеПросмотра.Документ.defaultView.zoom_to_bbox(Координаты[0], Координаты[1], Координаты[2], Координаты[3], СтрокВИзображении);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаКартинок()
	
	Для Каждого ДанныеРеквизита Из Объект.РеквизитыДокумента Цикл
		Если РаспознаваниеДокументовКлиентСервер.ВсеКоординатыНулевые(ДанныеРеквизита) Тогда
			Картинка = Неопределено;
		Иначе
			ИдентификаторРеквизита = ДанныеРеквизита.ИсходныйНомерСтроки - 1;
			Картинка = Объект.Ссылка.РеквизитыДокумента.Получить(ИдентификаторРеквизита).ОбластьИзображения.Получить();
			
			Если Картинка = Неопределено Или Картинка.Размер() = 0 Тогда
				Картинка = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если Картинка = Неопределено Тогда
			ДанныеРеквизита.СтрокВИзображении = 0;
		КонецЕсли;
		
		АдресТекущейКартинки = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
		ДанныеРеквизита.АдресКартинки = АдресТекущейКартинки;
	КонецЦикла;
	
	Для Каждого ДанныеРеквизита Из Объект.РеквизитыТабличныхЧастей Цикл
		Если РаспознаваниеДокументовКлиентСервер.ВсеКоординатыНулевые(ДанныеРеквизита) Тогда
			Картинка = Неопределено;
		Иначе
			ИдентификаторРеквизита = ДанныеРеквизита.ИсходныйНомерСтроки - 1;
			Картинка = Объект.Ссылка.РеквизитыТабличныхЧастей.Получить(ИдентификаторРеквизита).ОбластьИзображения.Получить();
			
			Если Картинка = Неопределено Или Картинка.Размер() = 0 Тогда
				Картинка = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если Картинка = Неопределено Тогда
			ДанныеРеквизита.СтрокВИзображении = 0;
		КонецЕсли;
		
		АдресТекущейКартинки = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
		ДанныеРеквизита.АдресКартинки = АдресТекущейКартинки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзображенияРеквизитов(Настройки, Родитель = Неопределено, ГруппаРеквизита = Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = Элементы.ГруппаРеквизиты;
	КонецЕсли;
	
	СоответствиеПолейИГрупп = Новый Соответствие;
	
	Для Каждого Поле Из Родитель.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Поле) = Тип("ГруппаФормы") Тогда
			ДобавитьИзображенияРеквизитов(Поле, ГруппаРеквизита);
			Продолжить;
		ИначеЕсли НЕ ТипЗнч(Поле) = Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаРеквизита = Элементы.Добавить("Группа" + Поле.Имя, Тип("ГруппаФормы"), Поле.Родитель);
		ГруппаРеквизита.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаРеквизита.ОтображатьЗаголовок = Ложь;
		СоответствиеПолейИГрупп.Вставить(Поле, ГруппаРеквизита);
		
	КонецЦикла;
	
	Для Каждого ДанныеСоответствия Из СоответствиеПолейИГрупп Цикл
		Элементы.Переместить(ДанныеСоответствия.Ключ, ДанныеСоответствия.Значение);
		ОтобразитьСвязаннуюКартинку(ДанныеСоответствия);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСвязаннуюКартинку(ДанныеСоответствия)
	
	Путь = ДанныеСоответствия.Ключ.ПутьКДанным;
	НачалоИдентификатора = СтрНайти(Путь, "[") ;
	Если НЕ НачалоИдентификатора Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРеквизита = Сред(Путь, НачалоИдентификатора + 1, СтрНайти(Путь, "]") - НачалоИдентификатора + 1);
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	ИдентификаторРеквизита = ОписаниеЧисла.ПривестиЗначение(ИдентификаторРеквизита);
	
	ПолеКартинки = Элементы.Добавить("КартинкаРеквизита" + ИдентификаторРеквизита, Тип("ПолеФормы"), ДанныеСоответствия.Значение);
	ПолеКартинки.Вид = ВидПоляФормы.ПолеКартинки;
	ПолеКартинки.Высота = Объект.РеквизитыДокумента[ИдентификаторРеквизита].СтрокВИзображении;
	ПолеКартинки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеКартинки.РазмерКартинки = РазмерКартинки.Пропорционально;
	ПолеКартинки.РастягиватьПоВертикали = Ложь;
	ПолеКартинки.АвтоМаксимальнаяВысота = Ложь;
	ПолеКартинки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	ПолеКартинки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ПолеКартинки.ПутьКДанным = "Объект.РеквизитыДокумента[" + ИдентификаторРеквизита + "].АдресКартинки";
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкиТаблицы()
	
	ДобавляемыеРеквизиты = Новый Массив;
	НастроитьКолонкиРекурсивно(ДобавляемыеРеквизиты, Элементы.ТаблицаДокумента);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	СоздатьЭлементыДобавленныхРеквизитов(ДобавляемыеРеквизиты, Элементы.ТаблицаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкиРекурсивно(ДобавляемыеРеквизиты, ЭлементыОбхода)
	
	Для Каждого ЭлементКолонка Из ЭлементыОбхода.ПодчиненныеЭлементы Цикл
		Если ЭлементКолонка.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
			НастроитьКолонкиРекурсивно(ДобавляемыеРеквизиты, ЭлементКолонка);
		ИначеЕсли ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЭлементКолонка.ВыбиратьТип = Ложь;
			ЭлементКолонка.БыстрыйВыбор = Ложь;
			ЭлементКолонка.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
			ЭлементКолонка.УстановитьДействие("ОбработкаВыбора", "Подключаемый_ОбработкаВыбораПоля");
			ЭлементКолонка.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииКолонки");
			
			Если ЭлементКолонка.Имя <> "ТаблицаДокументаПорядокСтроки"
				И Не СтрЗаканчиваетсяНа(ЭлементКолонка.Имя, "ТекстОшибки")
				И Не СтрЗаканчиваетсяНа(ЭлементКолонка.Имя, "ЗаполненоВручную") Тогда
				
				НовыйРеквизит = Новый РеквизитФормы(ЭлементКолонка.Имя + "ТекстОшибки", Новый ОписаниеТипов("Строка"));
				НовыйРеквизит.Путь = "ТаблицаДокумента";
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы(ЭлементКолонка.Имя + "ЗаполненоВручную", Новый ОписаниеТипов("Булево"));
				НовыйРеквизит.Путь = "ТаблицаДокумента";
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДобавленныхРеквизитов(ДобавляемыеРеквизиты, ЭлементРодитель)
	
	Для Каждого Реквизит Из ДобавляемыеРеквизиты Цикл 
		НовыйЭлемент = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), ЭлементРодитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ТаблицаДокумента." + Реквизит.Имя;
		НовыйЭлемент.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокумента()
	
	ТаблицаДокументаТЗ = РаспознаваниеДокументовСлужебный.ЗаполненнаяТаблицаДокумента(Объект);
	ТаблицаДокумента.Загрузить(ТаблицаДокументаТЗ);
	Если Объект.РеквизитыТабличныхЧастей.Количество() = 0 Тогда
		// РеквизитыТабличныхЧастей.Количество() = 0 - значит таблицы никогда не было, в ней нет колонок и
		// РаспознаваниеДокументовСлужебный.ЗаполненнаяТаблицаДокумента не сможет создать колонки
		НоваяСтрока = ТаблицаДокумента.Добавить();
		НоваяСтрока.ПорядокСтроки = 1;
		
		ЗаполнитьКлючиНовойСтроки(НоваяСтрока, МаксимальныйНомерСтроки);
		РаспознаваниеДокументовСлужебный.СохранитьТаблицуДокумента(Объект, ТаблицаДокумента.Выгрузить());
	КонецЕсли;
	
	Для Каждого Запись Из Объект.РеквизитыТабличныхЧастей Цикл
		Если Запись.СтрокаУдалена Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("НомерСтроки", Запись.НомерСтрокиТЧ);
		ИзменяемыеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);
		
		Если НЕ ИзменяемыеСтроки.Количество() Тогда
			ИзменяемаяСтрока = ТаблицаДокумента.Добавить();
			ИзменяемаяСтрока.НомерСтроки = Запись.НомерСтрокиТЧ;
		Иначе
			ИзменяемаяСтрока = ИзменяемыеСтроки[0];
		КонецЕсли;
		
		Если ИзменяемаяСтрока.Свойство(Запись.ИмяРеквизита + "ЗаполненоВручную") Тогда
			ИзменяемаяСтрока[Запись.ИмяРеквизита + "ЗаполненоВручную"] = Запись.ЗаполненоВручную;
		КонецЕсли;
		
		Если Запись.ИмяРеквизита = "Номенклатура" Тогда
			НомерСтрокиТаблицы = Запись.НомерСтрокиТЧ;
			ВыбранноеЗначение = ИзменяемаяСтрока[Запись.ИмяРеквизита];
			
			РаспознаваниеДокументовПереопределяемый.ПриИзмененииКолонкиНаСервере(
				Объект,
				ИзменяемаяСтрока,
				Запись.ИмяРеквизита,
				НомерСтрокиТаблицы,
				ВыбранноеЗначение);
			
			Элемент = УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
			
			ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокумента.НомерСтроки");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = ИзменяемаяСтрока.НомерСтроки;
			ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокумента.Номенклатура");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
			Элемент.Оформление.УстановитьЗначениеПараметра("Текст", СтрШаблон(НСтр("ru = 'Не сопоставлен: %1'"), Запись.РаспознанныйТекст));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКлючиНовойСтроки(НоваяСтрока, МаксимальныйНомерСтроки)
	
	МаксимальныйНомерСтроки = МаксимальныйНомерСтроки + 1;
	НоваяСтрока.НомерСтроки = МаксимальныйНомерСтроки;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыПоРеквизитам()
	
	ДанныеДляВыбораРеквизитов = РаспознаваниеДокументовСлужебный.ПолучитьДанныеДляСпискаВыбора(Объект.Ссылка);
	АдресЗначенияВыбораДляШапки = ПоместитьВоВременноеХранилище(ДанныеДляВыбораРеквизитов, УникальныйИдентификатор);
	
	Для Каждого РеквизитШапки Из Объект.РеквизитыДокумента Цикл
		
		Если ПустаяСтрока(РеквизитШапки.ИмяЭлемента) Тогда // Реквизит не отображается на форме
			Продолжить;
		КонецЕсли;
		
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг Тогда
			Если РеквизитШапки.ИмяЭлемента = "Склад" Тогда
				Элементы["Группа"+РеквизитШапки.ИмяЭлемента].Видимость = Ложь;
				Продолжить;
			ИначеЕсли РеквизитШапки.ИмяЭлемента = "Грузоотправитель"
				ИЛИ РеквизитШапки.ИмяЭлемента = "Грузополучатель" Тогда
				
				Элементы.ГруппаГрузоотправительИГрузополучатель.Видимость = Ложь;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если РеквизитШапки.ИмяЭлемента = "ИтогоСумма"
			Или РеквизитШапки.ИмяЭлемента = "ИтогоСуммаНДС"
			Или РеквизитШапки.ИмяЭлемента = "ИтогоВсего" Тогда
			
			ИзменяемыйЭлемент = Элементы[РеквизитШапки.ИмяЭлемента + "Белый"];
			НастроитьСвойстваЭлементаРеквизита(ИзменяемыйЭлемент);
			НастроитьИзменяемыйЭлемент(РеквизитШапки, ИзменяемыйЭлемент, ДанныеДляВыбораРеквизитов);
			
			ИзменяемыйЭлемент = Элементы[РеквизитШапки.ИмяЭлемента + "Красный"];
			НастроитьСвойстваЭлементаРеквизита(ИзменяемыйЭлемент);
			НастроитьИзменяемыйЭлемент(РеквизитШапки, ИзменяемыйЭлемент, ДанныеДляВыбораРеквизитов);
		Иначе
			ИзменяемыйЭлемент = Элементы[РеквизитШапки.ИмяЭлемента];
			Если РеквизитШапки.ИмяЭлемента = "Склад" Тогда
				НастроитьСвойстваЭлементаРеквизита(ИзменяемыйЭлемент, Истина);
			Иначе
				НастроитьСвойстваЭлементаРеквизита(ИзменяемыйЭлемент);
			КонецЕсли;
			НастроитьИзменяемыйЭлемент(РеквизитШапки, ИзменяемыйЭлемент, ДанныеДляВыбораРеквизитов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьИзменяемыйЭлемент(РеквизитШапки, ИзменяемыйЭлемент, ДанныеДляВыбораРеквизитов)
	
	ИзменяемыйЭлемент.Подсказка = Неопределено;
	РаспознанныйТекст = РеквизитШапки.РаспознанныйТекст;
	
	Если РеквизитШапки.ИмяЭлемента = "СуммаВключаетНДС" Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПримитивныйТип = РаспознаваниеДокументовКлиентСервер.ЭтоПримитивныйТип(ТипЗнч(РеквизитШапки.Значение));
	Если НЕ РеквизитШапки.ИмяЭлемента = "Склад" И НЕ РеквизитШапки.ИмяЭлемента = "Договор" Тогда
		Отбор = Новый Структура("ИмяРеквизита", РеквизитШапки.ИмяРеквизита);
		ПодходящиеЗначения = ДанныеДляВыбораРеквизитов.НайтиСтроки(Отбор);
		
		Если РеквизитШапки.ИмяЭлемента = "ПродавецОрганизация"
			Или РеквизитШапки.ИмяЭлемента = "ПокупательОрганизация"
			Или РеквизитШапки.ИмяЭлемента = "Исполнитель"
			Или ЭтоПримитивныйТип Тогда
			
			КартинкаСоздание = 2;
		Иначе
			КартинкаСоздание = 1;
		КонецЕсли;
		
		Если Не РаспознаваниеДокументовКлиентСервер.РаспознанныйТекстСодержитПустоеЗначениеПоля(РеквизитШапки.ИмяЭлемента, РаспознанныйТекст) Тогда
			СписокДляВыбора = РаспознаваниеДокументовСлужебныйКлиентСервер.ПолучитьСписокДляВыбораПользователем(РаспознанныйТекст, ПодходящиеЗначения, КартинкаСоздание);
			ИзменяемыйЭлемент.СписокВыбора.Очистить();
			Для Каждого ДанныеВыбора Из СписокДляВыбора Цикл
				Если ТипЗнч(ДанныеВыбора.Значение) = Тип("Структура") Тогда
					ИзменяемыйЭлемент.СписокВыбора.Добавить(ДанныеВыбора.Значение.Значение, ДанныеВыбора.Представление, , ДанныеВыбора.Картинка);
				Иначе
					Если ЭтоПримитивныйТип Тогда
						ИзменяемыйЭлемент.СписокВыбора.Добавить(ДанныеВыбора.Значение, ДанныеВыбора.Представление);
					Иначе
						ИзменяемыйЭлемент.СписокВыбора.Добавить(ДанныеВыбора.Значение, ДанныеВыбора.Представление, , ДанныеВыбора.Картинка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитШапки.Значение) Тогда
		Если РеквизитШапки.ИмяЭлемента = "Грузоотправитель" Тогда
			// Устанавливаем "Он же" и блокируем "Другой"
			ГрузоотправительОнЖе = 1;
			Элементы.Грузоотправитель.Доступность = Ложь;
			Возврат;
		ИначеЕсли РеквизитШапки.ИмяЭлемента = "Грузополучатель" Тогда
			// Устанавливаем "Он же" и блокируем "Другой"
			ГрузополучательОнЖе = 1;
			Элементы.Грузополучатель.Доступность = Ложь;
			Возврат;
		КонецЕсли;
		
		Если РеквизитШапки.ИмяЭлемента <> "ИтогоСумма" И РеквизитШапки.ИмяЭлемента <> "ИтогоСуммаНДС"
			И РеквизитШапки.ИмяЭлемента <> "ИтогоВсего" И РеквизитШапки.ИмяЭлемента <> "Склад" Тогда
			
			ИзменяемыйЭлемент.ПодсказкаВвода = СтрШаблон(НСтр("ru = 'Не сопоставлен: %1'"), РаспознанныйТекст);
		КонецЕсли;
		
		Если РеквизитШапки.ИмяЭлемента = "Склад" Тогда
			СкладПоУмолчанию = РаспознаваниеДокументовПереопределяемый.ПолучитьСкладПоУмолчанию();
			Если ЗначениеЗаполнено(СкладПоУмолчанию) Тогда
				РеквизитШапки.Значение = СкладПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСвойстваЭлементаРеквизита(ИзменяемыйЭлемент, РазрешитьБыстрыйВыбор = Ложь)
	
	ИзменяемыйЭлемент.БыстрыйВыбор = РазрешитьБыстрыйВыбор;
	ИзменяемыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	ИзменяемыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	ИзменяемыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииПоля");
	ИзменяемыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_АвтоПодборПоля");
	ИзменяемыйЭлемент.УстановитьДействие("ОбработкаВыбора", "Подключаемый_ОбработкаВыбораПоля");
	Если РазрешитьБыстрыйВыбор Тогда
		ИзменяемыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_НачалоВыбораПоля");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСоответствиеРеквизитовЭлементам()
	
	Для Каждого РеквизитДокумента Из Объект.РеквизитыДокумента Цикл
		Идентификатор = РеквизитДокумента.ПолучитьИдентификатор();
		ПутьКДанным = "Объект.РеквизитыДокумента[" + Идентификатор + "].Значение";
		
		Для Каждого ПроверяемыйЭлемент Из Элементы Цикл
			Если ТипЗнч(ПроверяемыйЭлемент) = Тип("ПолеФормы") И ПроверяемыйЭлемент.ПутьКДанным = ПутьКДанным Тогда
				РеквизитДокумента.ИмяЭлемента = ПроверяемыйЭлемент.Имя;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтображениеПоТипуДокумента()
	
	Элементы.Продавец.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
	Элементы.Покупатель.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий);
	
	Элементы.ПродавецОрганизация.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий);
	Элементы.ПокупательОрганизация.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
	
	Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
		ИмяСтруктурыСФ = "СчетФактураВыданный";
		ИмяСтруктурыДок = "Реализация";
	Иначе
		ИмяСтруктурыСФ = "СчетФактураПолученный";
		ИмяСтруктурыДок = "Поступление";
	КонецЕсли;
	
	Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД
		ИЛИ Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
		
		Элементы.ГруппаКнопкиПоступление.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
		Элементы.ГруппаКнопкиРеализация.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий);
		
		// Разрешаем создавать счет-фактуру командой для любого документа.
		//Если (НЕ ЗначениеЗаполнено(СозданныеДокументы[ИмяСтруктурыСФ].Ссылка)
		//	И ЗначениеЗаполнено(СозданныеДокументы[ИмяСтруктурыДок].Ссылка)) Или
		//		Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
		//	Элементы.КнопкаСоздатьСчетФактуру.Видимость = Истина;
		//Иначе
		//	Элементы.КнопкаСоздатьСчетФактуру.Видимость = Ложь;
		//КонецЕсли;
	ИначеЕсли Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12
		ИЛИ Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг Тогда
		
		Элементы.ГруппаКнопкиПоступление.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
		Элементы.ГруппаКнопкиРеализация.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьИсточникиДляВыбораДоговора(ИмяПоля = "")
	
	Договор = РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(Объект, "Договор",
		Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Владелец, Организация");
	
	ЗаполнитьИсточникиДляВыбораДоговора();
	
	ПерезаполнитьДоговор = 
		    ЗначениеЗаполнено(ИмяПоля)
		Или Не ЗначениеЗаполнено(Договор)
		Или РеквизитыДоговора.Владелец    <> ИсточникПоляДоговорКонтрагент
		Или РеквизитыДоговора.Организация <> ИсточникПоляДоговорОрганизация;
	
	Элементы.Договор.Доступность =
		  ЗначениеЗаполнено(ИсточникПоляДоговорОрганизация)
		И ЗначениеЗаполнено(ИсточникПоляДоговорКонтрагент);
	
	Если ПерезаполнитьДоговор Тогда
		РаспознаваниеДокументовСлужебный.ЗаполнитьДоговорКонтрагента(Объект);
	КонецЕсли;
	
	ИзменитьОтображениеПоТипуДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсточникиДляВыбораДоговора()
	
	ПараметрыВыбораДоговора = РаспознаваниеДокументовСлужебный.ПараметрыВыбораДоговора(Объект);
	
	ВидыДоговоров = Новый СписокЗначений;
	ВидыДоговоров.ЗагрузитьЗначения(ПараметрыВыбораДоговора.ВидыДоговоров);
	
	ИсточникПоляДоговорВидДоговора = ВидыДоговоров;
	ИсточникПоляДоговорКонтрагент = ПараметрыВыбораДоговора.Контрагент;
	ИсточникПоляДоговорОрганизация = ПараметрыВыбораДоговора.Организация;
	
	Элементы.ГрузополучательКонтрагент.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий);
	Элементы.ГрузополучательОрганизация.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
	Элементы.ГрузоотправительКонтрагент.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
	Элементы.ГрузоотправительОрганизация.Видимость = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФормыДокумента(ТипДокументаСтрокой, ВидОперации)
	
	Если ТипДокументаСтрокой = "РеализацияТоваровУслуг" Тогда
		СвязанныйДокумент = СозданныеДокументы.Реализация.Ссылка;
	ИначеЕсли ТипДокументаСтрокой = "ПоступлениеТоваровУслуг" Тогда
		СвязанныйДокумент = СозданныеДокументы.Поступление.Ссылка;
	КонецЕсли;
	
	Если ПолучитьСозданныеДокументыИзТекущего().Количество() Тогда
		ЗадатьВопросОСозданииДокумента(ТипДокументаСтрокой, ВидОперации);
		Возврат;
	КонецЕсли;
	
	ОбработатьСозданиеНовогоДокумента(ВидОперации, ТипДокументаСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСозданиеНовогоДокумента(ВидОперации, ТипДокументаСтрокой)
	
	ПараметрыЗаполнения = ПолучитьПараметрыОткрытияФормы(ВидОперации, ТипДокументаСтрокой);
	
	// Запрет редактирования
	ДатаДокумента = Объект.РеквизитыДокумента[1].Значение;
	РедактированиеЗапрещено = ЗапрещеноСозданиеДокументаВЗакрытомПериоде(ТипДокументаСтрокой, ДатаДокумента);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТипДокументаСтрокой", ТипДокументаСтрокой);
	ДополнительныеПараметры.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВопросаСменыДаты", ЭтотОбъект, ДополнительныеПараметры);
	
	Если РедактированиеЗапрещено Тогда
		ТекстВопроса = НСтр("ru = 'Дата документа находится в закрытом периоде.
		|Изменить дату документа на текущую?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		СоздатьДокументПоПараметрам(ТипДокументаСтрокой, ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапрещеноСозданиеДокументаВЗакрытомПериоде(Знач ТипДокументаСтрокой, Знач ДатаДокумента)
	
	ПроверяемыйДокумент = Документы[ТипДокументаСтрокой].СоздатьДокумент();
	ПроверяемыйДокумент.Дата = ДатаДокумента;
	РедактированиеЗапрещено = ДатыЗапретаИзменения.ИзменениеЗапрещено(ПроверяемыйДокумент);
	
	Возврат РедактированиеЗапрещено;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеВопросаСменыДаты(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = ДополнительныеПараметры.ПараметрыЗаполнения;
	ПараметрыЗаполнения.Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	СоздатьДокументПоПараметрам(ДополнительныеПараметры.ТипДокументаСтрокой, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПоПараметрам(ТипДокументаСтрокой, ПараметрыЗаполнения)
	
	Результат = СоздатьДокумент(ТипДокументаСтрокой, ПараметрыЗаполнения);
	СозданныйДокумент = Результат.СоздаваемыйДокумент;
	
	Если СозданныйДокумент <> Неопределено Тогда
		ОповеститьОбИзменении(Объект.Ссылка);
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СозданныйДокумент);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Создан документ'"), НавигационнаяСсылка, Строка(СозданныйДокумент));
		Оповестить("РаспознанныйДокумент_СтатусОбработан", , СозданныйДокумент);
		
		Если Результат.УдалосьПровести Тогда
			СледующийДокумент();
		Иначе
			ПоказатьЗначение(, СозданныйДокумент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокумент(ТипДокументаСтрокой, ПараметрыЗаполнения)
	
	КлючеваяОперация = "РаспознаваниеДокументов.СоздатьДокумент";
	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	
	УдалосьПровести = Ложь;
	
	СохранитьЗначенияПередЗаписью();
	ОбъектИзФормы = РеквизитФормыВЗначение("Объект");
	
	НачатьТранзакцию();
	Попытка
		// Изменения в документе "Распознанный документ"
		Модифицированность = Ложь;
		ОбъектИзФормы.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Обработан;
		ОбъектИзФормы.Записать();
		
		СоздаваемыйДокумент = РаспознаваниеДокументовСлужебный.СоздатьДокументНаОснованииРаспознанного(Объект.Ссылка, ТипДокументаСтрокой, ПараметрыЗаполнения);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Ошибка создания документа:'") + Символы.ПС
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
		
		Результат = Новый Структура;
		Результат.Вставить("СоздаваемыйДокумент", СоздаваемыйДокумент);
		Результат.Вставить("УдалосьПровести", УдалосьПровести);
		
		Возврат Результат;
		
	КонецПопытки;
	
	ЗначениеВРеквизитФормы(ОбъектИзФормы, "Объект");
	
	Попытка
		СоздаваемыйДокументОбъект = СоздаваемыйДокумент.ПолучитьОбъект();
		
		Если Не СоздаваемыйДокументОбъект.ПроверитьЗаполнение() Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка проверки заполнения основного документа.'");
		КонецЕсли;
		
		РаспознаваниеДокументовПереопределяемый.ПриПроведенииДокументаНаОснованииРаспознанного(СоздаваемыйДокументОбъект);
		
		СоздаваемыйДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		УдалосьПровести = Истина;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Ошибка проведения основного документа:'") + Символы.ПС
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
	КонецПопытки;
	
	СохранитьСоответствиеРеквизитовЭлементам();
	
	РаспознаваниеДокументовСлужебный.ДобавитьПрисоединенныйФайл(Объект, СоздаваемыйДокумент, АдресКартинки);
	
	Если СоздатьСчетФактуру Тогда
		СчетФактураСсылка = СоздатьСчетФактуруПоПараметрам(СоздаваемыйДокумент, ТипДокументаСтрокой, ПараметрыЗаполнения);
		Если СчетФактураСсылка = Неопределено Тогда 
			УдалосьПровести = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	НайтиИЗаполнитьСозданныеДокументы();
	
	ДанныеСозданногоДокумента = ПолучитьОбратнуюСвязьДляСозданногоДокумента(СоздаваемыйДокумент);
	
	Пакет = Новый Структура;
	Пакет.Вставить("created", ДанныеСозданногоДокумента);
	
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(Объект.ИдентификаторРезультата, Пакет);
	
	Комментарий = Новый Структура;
	Комментарий.Вставить("ИдентификаторРезультата", Объект.ИдентификаторРезультата);
	Комментарий.Вставить("УдалосьПровести", УдалосьПровести);
	Комментарий.Вставить("ТипДокумента", ТипДокументаСтрокой);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени(КлючеваяОперация, ВремяНачала, , Комментарий);
	
	Результат = Новый Структура;
	Результат.Вставить("СоздаваемыйДокумент", СоздаваемыйДокумент);
	Результат.Вставить("УдалосьПровести", УдалосьПровести);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьОбратнуюСвязьДляСозданногоДокумента(СоздаваемыйДокумент)
	
	Результат = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Проведен");
	Результат.IdСозданногоДокумента = Строка(СоздаваемыйДокумент.УникальныйИдентификатор());
	Результат.НомерРаспознанногоДокумента = Объект.Номер;
	Результат.ЭтоВходящийДокумент = (Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
	Результат.НомерДокумента = Объект.РеквизитыДокумента[0].Значение;
	Результат.ДатаДокумента = Объект.РеквизитыДокумента[1].Значение;
	Результат.СуммаДокумента = ИтогоВсего;
	Результат.Контрагент = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(ИсточникПоляДоговорКонтрагент);
	Результат.Организация = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(ИсточникПоляДоговорОрганизация);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СоздатьСчетФактуруПоПараметрам(ОснованиеСчетаФактуры, ТипДокументаСтрокой, ПараметрыЗаполнения)
	
	СчетФактураСсылка = Неопределено;
	
	НачатьТранзакцию();
	Попытка
		
		ПараметрыСоздания = Новый Структура;
		ПараметрыСоздания.Вставить("ТипДокументаСтрокой", ТипДокументаСтрокой);
		ПараметрыСоздания.Вставить("Основание", ОснованиеСчетаФактуры);
		ПараметрыСоздания.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
		
		РаспознаваниеДокументовПереопределяемый.ПриСозданииСчетФактуры(ПараметрыСоздания, СчетФактураСсылка);
		
		Если СчетФактураСсылка <> Неопределено Тогда
			РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(СчетФактураСсылка, Объект.Ссылка, Ложь);
			РаспознаваниеДокументовСлужебный.ДобавитьПрисоединенныйФайл(Объект, СчетФактураСсылка, АдресКартинки)
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Ошибка создания счета-фактуры:'") + Символы.ПС
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецПопытки;
	
	НайтиИЗаполнитьСозданныеДокументы();
	
	Возврат СчетФактураСсылка;
	
КонецФункции

&НаКлиенте
Процедура СоздатьСчетФактуру(Команда)
	
	Покупатель = Объект.РеквизитыДокумента[3].Значение;
	Продавец = Объект.РеквизитыДокумента[2].Значение;
	
	ОрганизацияПокупатель = Объект.РеквизитыДокумента[9].Значение;
	ОрганизацияПродавец = Объект.РеквизитыДокумента[8].Значение;
	
	ПараметрыЗаполнения = Новый Структура;
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
		ПараметрыЗаполнения.Вставить("Контрагент", Покупатель);
		ПараметрыЗаполнения.Вставить("Организация", ОрганизацияПродавец);
		
		ОснованиеСчетаФактуры = СозданныеДокументы.Реализация.Ссылка;
		ТипДокументаСтрокой = "РеализацияТоваровУслуг";
	Иначе
		ПараметрыЗаполнения.Вставить("Контрагент", Продавец);
		ПараметрыЗаполнения.Вставить("Организация", ОрганизацияПокупатель);
		
		ОснованиеСчетаФактуры = СозданныеДокументы.Поступление.Ссылка;
		ТипДокументаСтрокой = "ПоступлениеТоваровУслуг";
	КонецЕсли;
	
	ИмяРеквизитаНомерДокумента = ?(ОснованиеСчетаФактуры = Неопределено, "Номер", "НомерВходящегоДокумента");
	ИмяРеквизитаДатаДокумента = ?(ОснованиеСчетаФактуры = Неопределено, "Дата", "ДатаВходящегоДокумента");
	
	ПараметрыЗаполнения.Вставить(ИмяРеквизитаНомерДокумента, Объект.РеквизитыДокумента[0].Значение);
	ПараметрыЗаполнения.Вставить(ИмяРеквизитаДатаДокумента, Объект.РеквизитыДокумента[1].Значение);
	
	ОпределениеДействияДляСоздаваемойСчетФактуры(ОснованиеСчетаФактуры, ТипДокументаСтрокой, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруСозданныеДокументы()
	
	СозданныеДокументы = Новый Структура;
	СозданныеДокументы.Вставить("Поступление", Новый Структура("Ссылка, СозданПоРаспознанномуДокументу", Неопределено, Ложь));
	СозданныеДокументы.Вставить("Реализация", Новый Структура("Ссылка, СозданПоРаспознанномуДокументу", Неопределено, Ложь));
	СозданныеДокументы.Вставить("СчетФактураПолученный", Новый Структура("Ссылка, СозданПоРаспознанномуДокументу", Неопределено, Ложь));
	СозданныеДокументы.Вставить("СчетФактураВыданный", Новый Структура("Ссылка, СозданПоРаспознанномуДокументу", Неопределено, Ложь));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокКнопкиСозданныйДокумент()
	
	Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
		СозданноеПоступлениеРеализация = СозданныеДокументы.Поступление.Ссылка;
		Если Не ЗначениеЗаполнено(СозданноеПоступлениеРеализация) Тогда
			СозданноеПоступлениеРеализация = СозданныеДокументы.Реализация.Ссылка;
		КонецЕсли;
		СозданнаяСФ = СозданныеДокументы.СчетФактураПолученный.Ссылка;
		Если Не ЗначениеЗаполнено(СозданнаяСФ) Тогда
			СозданнаяСФ = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		КонецЕсли;
	Иначе
		СозданноеПоступлениеРеализация = СозданныеДокументы.Реализация.Ссылка;
		Если Не ЗначениеЗаполнено(СозданноеПоступлениеРеализация) Тогда
			СозданноеПоступлениеРеализация = СозданныеДокументы.Поступление.Ссылка;
		КонецЕсли;
		СозданнаяСФ = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		Если Не ЗначениеЗаполнено(СозданнаяСФ) Тогда
			СозданнаяСФ = СозданныеДокументы.СчетФактураПолученный.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СозданноеПоступлениеРеализация) Тогда
		Элементы.ГруппаСозданныйДокумент.Видимость = Истина;
		ЗаголовокСсылки = Строка(СозданноеПоступлениеРеализация);
		Элементы.ОткрытьСозданныйДокумент.Заголовок = 
			РаспознаваниеДокументовСлужебныйКлиентСервер.ОтрезатьВремяУДатыСтрокой(ЗаголовокСсылки);
	Иначе
		Элементы.ГруппаСозданныйДокумент.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКомплекта) Тогда
		Если ДанныеКомплекта.РаспознанныйДокументСФ = Объект.Ссылка Тогда
			ДанныеИмяСтатусТоргАкт = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеКомплекта.Ссылка, "ТипДокумента, НомерДокумента, ДатаДокумента, Статус, ПометкаУдаления");
			ДанныеИмяСтатусСФ = Объект;
		Иначе
			ДанныеИмяСтатусТоргАкт = Объект;
			ДанныеИмяСтатусСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеКомплекта.РаспознанныйДокументСФ, "ТипДокумента, НомерДокумента, ДатаДокумента, Статус, ПометкаУдаления");
		КонецЕсли;
		
		Элементы.ГруппаРаспознаннаяСФ.Видимость = Истина;
		Элементы.ОткрытьСозданнуюСФ.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
		
		СтатусРаспознаннойСФ = РаспознаваниеДокументовСлужебный.СтатусДокументаЧислом(ДанныеИмяСтатусСФ);
		Элементы.ОткрытьРаспознаннуюСФ.Заголовок = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"),
			ДанныеИмяСтатусСФ.ТипДокумента, СокрЛП(ДанныеИмяСтатусСФ.НомерДокумента), Формат(ДанныеИмяСтатусСФ.ДатаДокумента, "ДФ=dd.MM.yyyy"));
	Иначе
		ДанныеИмяСтатусТоргАкт = Объект;
		Элементы.ГруппаРаспознаннаяСФ.Видимость = Ложь;
		Элементы.ОткрытьСозданнуюСФ.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	СтатусРаспознанногоДокумента = РаспознаваниеДокументовСлужебный.СтатусДокументаЧислом(ДанныеИмяСтатусТоргАкт);
	Элементы.ОткрытьРаспознанныйДокумент.Заголовок = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"),
		ДанныеИмяСтатусТоргАкт.ТипДокумента, СокрЛП(ДанныеИмяСтатусТоргАкт.НомерДокумента), Формат(ДанныеИмяСтатусТоргАкт.ДатаДокумента, "ДФ=dd.MM.yyyy"));
	
	Если ТипЗнч(ДанныеИмяСтатусТоргАкт) = Тип("Структура") Тогда
		ЭлементДляЗаменыНадписью = Элементы.ОткрытьРаспознаннуюСФ;
		Элементы.ОткрытьРаспознанныйДокумент.Видимость = Истина;
		Элементы.ДекорацияЭтотДокумент.Видимость = Ложь;
		ЭлементЭтотДокумент = Элементы.ДекорацияЭтотДокументСФ;
	Иначе
		ЭлементДляЗаменыНадписью = Элементы.ОткрытьРаспознанныйДокумент;
		Элементы.ОткрытьРаспознаннуюСФ.Видимость = Истина;
		Элементы.ДекорацияЭтотДокументСФ.Видимость = Ложь;
		ЭлементЭтотДокумент = Элементы.ДекорацияЭтотДокумент;
	КонецЕсли;
	ЭлементДляЗаменыНадписью.Видимость = Ложь;
	ЭлементЭтотДокумент.Видимость = Истина;
	ЭлементЭтотДокумент.Заголовок = ЭлементДляЗаменыНадписью.Заголовок;
	
	Если ЗначениеЗаполнено(СозданнаяСФ) Тогда
		Элементы.ГруппаСозданнаяСФ.Видимость = Истина;
		
		ЗаголовокСсылки = Строка(СозданнаяСФ);
		Элементы.ОткрытьСозданнуюСФ.Заголовок = 
			РаспознаваниеДокументовСлужебныйКлиентСервер.ОтрезатьВремяУДатыСтрокой(ЗаголовокСсылки);
	Иначе
		Элементы.ГруппаСозданнаяСФ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеНоменклатуры(ПараметрыСоздаваемойНоменклатуры)
	
	ФоновоеЗадание = ЗапуститьФоновоеСозданиеНоменклатуры(ПараметрыСоздаваемойНоменклатуры, УникальныйИдентификатор);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Истина;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	НастройкиОжидания.ВыводитьСообщения = Истина;
	НастройкиОжидания.ТекстСообщения = НСтр("ru = 'Создание номенклатуры для заполнения...'");
	
	Обработчик = Новый ОписаниеОповещения("ЗаполнитьТаблицуСозданнойНоменклатурой", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьФоновоеСозданиеНоменклатуры(ПараметрыСоздаваемойНоменклатуры, УникальныйИдентификатор)
	
	ПараметрыВызоваСервера = Новый Массив;
	ПараметрыВызоваСервера.Добавить(ПараметрыСоздаваемойНоменклатуры);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Фоновое создание номенклатуры'");
	
	Обработчик = "РаспознаваниеДокументовСлужебный.ФоновоеСозданиеНоменклатуры";
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне(Обработчик, ПараметрыВызоваСервера, ПараметрыВыполнения);
	
	Возврат ФоновоеЗадание;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуСозданнойНоменклатурой(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьТаблицуСозданнойНоменклатуройНаСервере(Результат, ДополнительныеПараметры);
	
	КнопкаСозданияНоменклатуры = Элементы.СписокНераспознаннойНоменклатурыСоздатьНоменклатуру;
	КнопкаСозданияНоменклатуры.Доступность = СписокНераспознаннойНоменклатуры.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСозданнойНоменклатуройНаСервере(Результат, ДополнительныеПараметры) Экспорт
	
	ИнформацияОНоменклатуре = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ПолучитьСообщенияПользователю(Истина);
	Для Каждого Сообщение Из Результат.Сообщения Цикл
		Сообщение.Сообщить();
	КонецЦикла;
	
	Для Каждого Данные Из ИнформацияОНоменклатуре Цикл
		СтрокаЗаполнения = ТаблицаДокумента.НайтиПоИдентификатору(Данные.ИдентификаторИсходнойСтроки);
		СтрокаЗаполнения.Номенклатура = Данные.Номенклатура;
		
		РаспознаваниеДокументовПереопределяемый.ПриИзмененииКолонкиНаСервере(
			Объект,
			СтрокаЗаполнения,
			"Номенклатура",
			СтрокаЗаполнения.НомерСтроки,
			Данные.Номенклатура);
		
		Отбор = Новый Структура("ИдентификаторИсходнойСтроки", Данные.ИдентификаторИсходнойСтроки);
		НайденныеСтроки = СписокНераспознаннойНоменклатуры.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			УдаляемаяСтрока = НайденныеСтроки[0];
			СписокНераспознаннойНоменклатуры.Удалить(УдаляемаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьЗначенияИзТаблицыДокумента();
	РаспознаваниеДокументовСлужебный.ПересчитатьПроблемныеЭлементы(ЭтотОбъект);
	
	Если Не СписокНераспознаннойНоменклатуры.Количество() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТабличнаяЧасть;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НайтиИЗаполнитьСозданныеДокументы()
	
	// Комплекты
	ДанныеДокумента = Новый Структура("Ссылка, ПометкаУдаления, Статус, ТипДокумента, Направление, Организация, Контрагент, СуммаДокумента, НомерДокумента, ДатаДокумента",
		Объект.Ссылка, Объект.ПометкаУдаления, Объект.Статус, Объект.ТипДокумента, Объект.Направление, ИсточникПоляДоговорОрганизация,
		ИсточникПоляДоговорКонтрагент, ИтогоВсего, Объект.РеквизитыДокумента[0].Значение, Объект.РеквизитыДокумента[1].Значение);
	КомплектныеДокументы = РаспознаваниеДокументовСлужебный.НайтиКомплектныеДокументы(ДанныеДокумента);
	РаспознаваниеДокументовСлужебный.АктуализироватьОбъектыСвязанныеСРаспознаннымДокументом(Объект, КомплектныеДокументы);
	
	Связанные = РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ВсеСвязанныеДокументы(Объект.Ссылка);
	
	Для Каждого Связанный Из Связанные Цикл
		
		Если ТипЗнч(Связанный.Ссылка) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			СозданныеДокументы.СчетФактураПолученный.Ссылка = Связанный.Ссылка;
			СозданныеДокументы.СчетФактураПолученный.СозданПоРаспознанномуДокументу = Не Связанный.ПотенциальныйКандидат;
		КонецЕсли;
		
		Если ТипЗнч(Связанный.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			СозданныеДокументы.Поступление.Ссылка = Связанный.Ссылка;
			СозданныеДокументы.Поступление.СозданПоРаспознанномуДокументу = Не Связанный.ПотенциальныйКандидат;
		КонецЕсли;
		
		Если ТипЗнч(Связанный.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			СозданныеДокументы.СчетФактураВыданный.Ссылка = Связанный.Ссылка;
			СозданныеДокументы.СчетФактураВыданный.СозданПоРаспознанномуДокументу = Не Связанный.ПотенциальныйКандидат;
		КонецЕсли;
		
		Если ТипЗнч(Связанный.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СозданныеДокументы.Реализация.Ссылка = Связанный.Ссылка;
			СозданныеДокументы.Реализация.СозданПоРаспознанномуДокументу = Не Связанный.ПотенциальныйКандидат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КомплектныеДокументы.Количество() <> 1 Тогда
		ДанныеКомплекта = Неопределено;
	Иначе
		
		ПараметрыОперации = Неопределено;
		Для Каждого ГруппаКнопок Из Элементы.ГруппаПодменюСозданиеДокумента.ПодчиненныеЭлементы Цикл
			Если ГруппаКнопок = Элементы.ГруппаКнопкиКомплект Или ГруппаКнопок = Элементы.ГруппаКнопкиПрикрепитьСкан Тогда
				Продолжить;
			КонецЕсли;
			
			Если ГруппаКнопок.Видимость Тогда
				Для Каждого КнопокаСоздания Из ГруппаКнопок.ПодчиненныеЭлементы Цикл
					Если КнопокаСоздания.Видимость Тогда
						ПараметрыОперации = РаспознаваниеДокументовСлужебныйКлиентСервер.ТипДокументаИВидОперации(КнопокаСоздания.ИмяКоманды);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если ПараметрыОперации <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПараметрыОперации = Неопределено Тогда
			ДанныеКомплекта = Неопределено;
		Иначе
			
			ДанныеКомплекта = Новый Структура("ТипДокументаСтрокой, ВидОперации, ДанныеОбработки",
			ПараметрыОперации.ТипДокумента, ПараметрыОперации.ВидОперации, Неопределено);
			Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
				ДанныеТорг12Акт = Новый Структура("Ссылка, ТипДокумента", КомплектныеДокументы[0],
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КомплектныеДокументы[0], "ТипДокумента"));
				
				ДанныеКомплекта.Вставить("Ссылка", КомплектныеДокументы[0]);
				ДанныеКомплекта.Вставить("РаспознанныйДокументСФ", Объект.Ссылка);
			Иначе
				ДанныеТорг12Акт = Новый Структура("Ссылка, ТипДокумента", Объект.Ссылка, Объект.ТипДокумента);
				
				ДанныеКомплекта.Вставить("Ссылка", Объект.Ссылка);
				ДанныеКомплекта.Вставить("РаспознанныйДокументСФ", КомплектныеДокументы[0]);
			КонецЕсли;
			
			Если ДанныеТорг12Акт.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12 Тогда
				ДанныеКомплекта.Вставить("ТипКомплекта", "Торг12СчетФактура");
			Иначе
				ДанныеКомплекта.Вставить("ТипКомплекта", "АктСчетФактура");
			КонецЕсли;
			
			СвязанныеПоКомплекту = РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ВсеСвязанныеДокументы(КомплектныеДокументы[0]);
		КонецЕсли;
	КонецЕсли;
	
	Связанные = Связанные.ВыгрузитьКолонку("Ссылка");
	Если ДанныеКомплекта <> Неопределено Тогда
		Для Каждого Связанный Из СвязанныеПоКомплекту Цикл
			Если Связанные.Найти(Связанный.Ссылка) = Неопределено Тогда
				Связанные.Добавить(Связанный.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	УжеНаФорме = Новый Массив;
	УжеНаФорме.Добавить(СозданныеДокументы.СчетФактураПолученный.Ссылка);
	УжеНаФорме.Добавить(СозданныеДокументы.Поступление.Ссылка);
	УжеНаФорме.Добавить(СозданныеДокументы.СчетФактураВыданный.Ссылка);
	УжеНаФорме.Добавить(СозданныеДокументы.Реализация.Ссылка);
	
	КоличествоСвязанных = Связанные.Количество();
	Для Каждого Связанный Из УжеНаФорме Цикл
		ИдСвязанного = Связанные.Найти(Связанный);
		Если ИдСвязанного <> Неопределено Тогда
			Связанные.Удалить(ИдСвязанного);
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
		СозданнаяСФ = СозданныеДокументы.СчетФактураПолученный.Ссылка;
		Если Не ЗначениеЗаполнено(СозданнаяСФ) Тогда
			СозданнаяСФ = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		КонецЕсли;
	Иначе
		СозданнаяСФ = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		Если Не ЗначениеЗаполнено(СозданнаяСФ) Тогда
			СозданнаяСФ = СозданныеДокументы.СчетФактураПолученный.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СозданнаяСФ) Тогда
		ДанныеСозданныхДублей = Новый Структура("Документ0", Связанные);
	Иначе
		ДанныеСозданныхДублей = Новый Структура("Документ0, Документ1", Новый Массив, Новый Массив);
		Для Каждого Связанный Из Связанные Цикл
			Если ТипЗнч(Связанный) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
				Или ТипЗнч(Связанный) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				ДанныеСозданныхДублей.Документ0.Добавить(Связанный);
			Иначе
				ДанныеСозданныхДублей.Документ1.Добавить(Связанный);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	ИдДокумента = ДанныеСозданныхДублей.Количество();
	Пока ИдДокумента > 0 Цикл
		ИдДокумента = ИдДокумента - 1;
		
		Дубли = ДанныеСозданныхДублей["Документ"+ИдДокумента];
		ГруппаДобавления = Элементы["ГруппаСозданныйДокументДубли"+ИдДокумента];
		
		КоличествоДублей = Дубли.Количество();
		ИдНевидимого = ГруппаДобавления.ПодчиненныеЭлементы.Количество() - 1;
		Пока ИдНевидимого > КоличествоДублей Цикл
			// Нужно скрыть лишние элементы
			ИдНевидимого = ИдНевидимого - 1;
			СтрОбщийИд = "СозданныйДокумент"+ИдДокумента+"Дубль"+ИдНевидимого;
			Элементы[СтрОбщийИд].Видимость = Ложь;
		КонецЦикла;
		
		ИдДубля = -1;
		Для Каждого ЭтотДубль Из Дубли Цикл
			ИдДубля = ИдДубля + 1;
			СтрИдДубля = Формат(ИдДубля, "ЧГ=");
			
			СтрОбщийИд = "СозданныйДокумент"+ИдДокумента+"Дубль"+ИдДубля;
			ДубльУжеРазмещен = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы, СтрОбщийИд);
			
			// гиперссылка
			ИмяКомандыДубля = "Открытие" + СтрОбщийИд;
			Если Не ДубльУжеРазмещен Тогда
				КомандаОткрытиеДубля = Команды.Добавить(ИмяКомандыДубля);
				КомандаОткрытиеДубля.Действие = "ОткрытиеДубляСозданногоДокументаОбщее";
			КонецЕсли;
			
			Если ДубльУжеРазмещен Тогда
				КнопкаОткрытияДубля = Элементы[СтрОбщийИд];
				КнопкаОткрытияДубля.Видимость = Истина;
			Иначе
				КнопкаОткрытияДубля = Элементы.Добавить(СтрОбщийИд, Тип("КнопкаФормы"), ГруппаДобавления);
				КнопкаОткрытияДубля.ИмяКоманды = ИмяКомандыДубля;
				КнопкаОткрытияДубля.Вид = ВидКнопкиФормы.Гиперссылка;
			КонецЕсли;
			КнопкаОткрытияДубля.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ОтрезатьВремяУДатыСтрокой(Строка(ЭтотДубль));
		КонецЦикла;
	КонецЦикла;
	
	Элементы.ГруппаКнопкиКомплект.Видимость = (ДанныеКомплекта <> Неопределено);
	Элементы.ГруппаКнопкиПрикрепитьСкан.Видимость = Ложь;
	Если ДанныеКомплекта = Неопределено Тогда
		Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
			Кандидат = СозданныеДокументы.Поступление.Ссылка;
			Кандидат2 = СозданныеДокументы.СчетФактураПолученный.Ссылка;
		Иначе
			Кандидат = СозданныеДокументы.Реализация.Ссылка;
			Кандидат2 = СозданныеДокументы.СчетФактураВыданный.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Кандидат) И Объект.ТипДокумента <> Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура
			И Не РаспознаваниеДокументовСлужебный.СканУжеЕстьУВладельца(Объект, Кандидат, АдресКартинки) Тогда
			
			Элементы.ГруппаКнопкиПрикрепитьСкан.Видимость = Истина;
		КонецЕсли;
		
		Если Не Элементы.ГруппаКнопкиПрикрепитьСкан.Видимость И ЗначениеЗаполнено(Кандидат2)
			И Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура
			И Не РаспознаваниеДокументовСлужебный.СканУжеЕстьУВладельца(Объект, Кандидат2, АдресКартинки) Тогда
			
			Элементы.ГруппаКнопкиПрикрепитьСкан.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеКомплекта = Неопределено Тогда
		Документ0 = ДанныеДокумента;
	Иначе
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
			Документ0 = ДанныеКомплекта.Ссылка;
			Документ1 = ДанныеДокумента;
		Иначе
			Документ0 = ДанныеДокумента;
			Документ1 = ДанныеКомплекта.РаспознанныйДокументСФ;
		КонецЕсли;
		КоличествоСвязанных = КоличествоСвязанных + 1;
	КонецЕсли;
	
	ДанныеДублей = Новый Структура("Документ0", РаспознаваниеДокументовСлужебный.ДублиРаспознанногоДокумента(Документ0));
	КоличествоСвязанных = КоличествоСвязанных + ДанныеДублей.Документ0.Количество();
	Если ДанныеКомплекта = Неопределено Тогда
		Элементы.ГруппаДублейОбщая1.Видимость = Ложь;
	Иначе
		ДанныеДублей.Вставить("Документ1", РаспознаваниеДокументовСлужебный.ДублиРаспознанногоДокумента(Документ1));
		КоличествоСвязанных = КоличествоСвязанных + ДанныеДублей.Документ1.Количество();
	КонецЕсли;
	
	Если КоличествоСвязанных = 0 Тогда
		Элементы.ГруппаВсплывающаяСвязанныеДокументы.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаФормы;
		Элементы.ГруппаВсплывающаяСвязанныеДокументы.Доступность = Ложь;
		Элементы.ГруппаВсплывающаяСвязанныеДокументы.Заголовок = НСтр("ru = 'Нет связаных документов'");
	Иначе
		Элементы.ГруппаВсплывающаяСвязанныеДокументы.ЦветТекстаЗаголовка = ЦветаСтиля.ГиперссылкаЦвет;
		Элементы.ГруппаВсплывающаяСвязанныеДокументы.Доступность = Истина;
		Элементы.ГруппаВсплывающаяСвязанныеДокументы.Заголовок =
			СтрШаблон(НСтр("ru = 'Связанные документы (%1)'"), КоличествоСвязанных);
	КонецЕсли;
	
	ИдДокумента = ДанныеДублей.Количество();
	Пока ИдДокумента > 0 Цикл
		ИдДокумента = ИдДокумента - 1;
		
		Дубли = ДанныеДублей["Документ"+ИдДокумента];
		Если Дубли.Количество() = 0 Тогда
			Элементы["ГруппаДублейОбщая"+ИдДокумента].Видимость = Ложь;
		Иначе
			Элементы["ГруппаДублейОбщая"+ИдДокумента].Видимость = Истина;
			
			ГруппаДобавления = Элементы["ГруппаДублей"+ИдДокумента];
			
			КоличествоДублей = Дубли.Количество();
			Если ГруппаДобавления.ПодчиненныеЭлементы.Количество() > КоличествоДублей Тогда
				// Нужно скрыть лишние группы
				ИдНевидимого = ГруппаДобавления.ПодчиненныеЭлементы.Количество();
				Пока ИдНевидимого > КоличествоДублей Цикл
					ИдНевидимого = ИдНевидимого - 1;
					СтрОбщийИд = "Документ"+ИдДокумента+"Дубль"+ИдНевидимого;
					Элементы["Группа"+СтрОбщийИд].Видимость = Ложь;
				КонецЦикла;
			КонецЕсли;
			
			ИдДубля = -1;
			Для Каждого ЭтотДубль Из Дубли Цикл
				ИдДубля = ИдДубля + 1;
				СтрИдДубля = Формат(ИдДубля, "ЧГ=");
				
				СтрОбщийИд = "Документ"+ИдДокумента+"Дубль"+ИдДубля;
				ДубльУжеРазмещен = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы, "Группа"+СтрОбщийИд);
				
				Если ДубльУжеРазмещен Тогда
					Элементы["Группа"+СтрОбщийИд].Видимость = Истина;
					ГруппаСтатус = Элементы["Группа"+СтрОбщийИд];
				Иначе
					ГруппаСтатус = Элементы.Добавить("Группа" + СтрОбщийИд, Тип("ГруппаФормы"), ГруппаДобавления);
					ГруппаСтатус.Вид = ВидГруппыФормы.ОбычнаяГруппа;
					ГруппаСтатус.Отображение = ОтображениеОбычнойГруппы.Нет;
					ГруппаСтатус.ОтображатьЗаголовок = Ложь;
				КонецЕсли;
				
				// картинка статуса
				Если Не ДубльУжеРазмещен Тогда
					СтатусДубля = Новый РеквизитФормы("Статус"+СтрОбщийИд, Новый ОписаниеТипов("Число"));
					ДобавляемыеРеквизиты = Новый Массив;
					ДобавляемыеРеквизиты.Добавить(СтатусДубля);
					ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				КонецЕсли;
				
				Если ДубльУжеРазмещен Тогда
					ПолеСтатусДубля = Элементы["Статус"+СтрОбщийИд];
				Иначе
					ПолеСтатусДубля = Элементы.Добавить("Статус" + СтрОбщийИд, Тип("ПолеФормы"), ГруппаСтатус);
					ПолеСтатусДубля.Вид = Элементы.СтатусРаспознанногоДокумента.Вид;
					ЗаполнитьЗначенияСвойств(ПолеСтатусДубля, Элементы.СтатусРаспознанногоДокумента, , "Вид, ПутьКДанным");
					ПолеСтатусДубля.ПутьКДанным = "Статус"+СтрОбщийИд;
				КонецЕсли;
				ЭтотОбъект["Статус"+СтрОбщийИд] = РаспознаваниеДокументовСлужебный.СтатусДокументаЧислом(ЭтотДубль);
				
				// гиперссылка
				ИмяКомандыДубля = "Открытие" + СтрОбщийИд;
				Если Не ДубльУжеРазмещен Тогда
					КомандаОткрытиеДубля = Команды.Добавить(ИмяКомандыДубля);
					КомандаОткрытиеДубля.Действие = "ОткрытиеДубляДокументаОбщее";
				КонецЕсли;
				
				Если ДубльУжеРазмещен Тогда
					КнопкаОткрытияДубля = Элементы[ИмяКомандыДубля];
				Иначе
					КнопкаОткрытияДубля = Элементы.Добавить(ИмяКомандыДубля, Тип("КнопкаФормы"), ГруппаСтатус);
					КнопкаОткрытияДубля.ИмяКоманды = ИмяКомандыДубля;
					КнопкаОткрытияДубля.Вид = ВидКнопкиФормы.Гиперссылка;
				КонецЕсли;
				КнопкаОткрытияДубля.Заголовок = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"),
					ЭтотДубль.ТипДокумента, СокрЛП(ЭтотДубль.НомерДокумента), Формат(ЭтотДубль.ДатаДокумента, "ДФ=dd.MM.yyyy"));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	// Комплекты
	
	ОбновитьЗаголовокКнопкиСозданныйДокумент();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОткрытияФормы(Знач ВидОперации, Знач ТипДокументаСтрокой)
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Основание", Объект.Ссылка);
	ПараметрыЗаполнения.Вставить("ВидОперации", ВидОперации);
	ПараметрыЗаполнения.Вставить("НомерВходящегоДокумента", Объект.РеквизитыДокумента[0].Значение);
	ПараметрыЗаполнения.Вставить("ДатаВходящегоДокумента", Объект.РеквизитыДокумента[1].Значение);
	
	Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура
		ИЛИ Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД Тогда
		
		ПараметрыЗаполнения.Вставить("НомерВходящегоДокументаСчетаФактуры", Объект.РеквизитыДокумента[0].Значение);
		ПараметрыЗаполнения.Вставить("ДатаВходящегоДокументаСчетаФактуры", Объект.РеквизитыДокумента[1].Значение);
		
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("Дата", Объект.РеквизитыДокумента[1].Значение);
	ПараметрыЗаполнения.Вставить("ДоговорКонтрагента", Объект.РеквизитыДокумента[6].Значение);
	
	Для Каждого ДанныеРеквизита Из Объект.РеквизитыДокумента Цикл
		ПараметрыЗаполнения.Вставить(ДанныеРеквизита.ИмяРеквизита, ДанныеРеквизита.Значение);
	КонецЦикла;
	
	Если ТипДокументаСтрокой = "ПоступлениеТоваровУслуг" Тогда
		ПараметрыЗаполнения.Вставить("Организация", ПараметрыЗаполнения.ПокупательОрганизация);
		ПараметрыЗаполнения.Вставить("Контрагент", ПараметрыЗаполнения.Продавец);
		
		ОтражениеВУСН = ПоступлениеТоваровУслугФормыКлиентСервер.ОтражениеВУСН(ВидОперации, Ложь);
	Иначе
		ПараметрыЗаполнения.Вставить("Организация", ПараметрыЗаполнения.ПродавецОрганизация);
		ПараметрыЗаполнения.Вставить("Контрагент", ПараметрыЗаполнения.Покупатель);
		
		ПараметрыЗаполнения.Вставить("Номер", Объект.РеквизитыДокумента[0].Значение);
	КонецЕсли;
	
	СтрокиТаблицыТовары = Новый Массив;
	СтрокиТаблицыУслуги = Новый Массив;
	
	КолонкиТаблицы = ПолучитьРеквизиты("ТаблицаДокумента");
	Для Каждого СтрокаТаблицыДокумента Из ТаблицаДокумента Цикл
		ДанныеСтрокиТаблицы = Новый Структура();
		Для Каждого Колонка Из КолонкиТаблицы Цикл
			Если Колонка.Имя = "ЕдиницаИзмерения" Тогда
				ДанныеСтрокиТаблицы.Вставить(Колонка.Имя,
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицыДокумента.Номенклатура, "ЕдиницаИзмерения"));
			Иначе
				ДанныеСтрокиТаблицы.Вставить(Колонка.Имя, СтрокаТаблицыДокумента[Колонка.Имя]);
			КонецЕсли;
		КонецЦикла;
		
		Если ТипДокументаСтрокой = "ПоступлениеТоваровУслуг" Тогда
			ДанныеСтрокиТаблицы.Вставить("ОтражениеВУСН", ОтражениеВУСН);
		КонецЕсли;
		
		Если СтрокаТаблицыДокумента.Номенклатура.Услуга Тогда
			СтрокиТаблицыУслуги.Добавить(ДанныеСтрокиТаблицы);
		Иначе
			ДанныеСтрокиТаблицы.Вставить("Коэффициент", 1);
			СтрокиТаблицыТовары.Добавить(ДанныеСтрокиТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗаполнения.Вставить("Товары", СтрокиТаблицыТовары);
	ПараметрыЗаполнения.Вставить("Услуги", СтрокиТаблицыУслуги);
	
	Если ПараметрыЗаполнения.Основание.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура
		ИЛИ ПараметрыЗаполнения.Основание.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД Тогда
		
		ПараметрыЗаполнения.Вставить("СуммаВключаетНДС", Ложь);
		
	ИначеЕсли ПараметрыЗаполнения.Свойство("ИтогоВсего")
		И ПараметрыЗаполнения.Свойство("ИтогоСумма") Тогда
		
		Если ПараметрыЗаполнения.ИтогоВсего <> 0
			И ПараметрыЗаполнения.ИтогоСумма <> 0 Тогда
			
			ПараметрыЗаполнения.Вставить("СуммаВключаетНДС", (ПараметрыЗаполнения.ИтогоВсего = ПараметрыЗаполнения.ИтогоСумма));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаСервере
Процедура ПерепроверитьНаСервере()
	
	СохранитьЗначенияПередЗаписью();
	
	ТаблицаДокумента.Очистить();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	РаспознаваниеДокументов.ЗаполнитьСпискиВыбораНаСервере(ДокументОбъект, Объект.Ссылка, Истина);
	Документы.РаспознанныйДокумент.ЗаполнитьЗначенияРаспознанногоДокумента(ДокументОбъект, ДокументОбъект.Ссылка);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ЗаполнитьАдресаКартинок();
	СохранитьСоответствиеРеквизитовЭлементам();
	
	НастроитьЭлементыПоРеквизитам();
	ЗаполнитьТаблицуДокумента();
	
	Если Не УправлениеДоступом.ЧтениеРазрешено(Объект.РеквизитыДокумента[9].Значение) Тогда
		// Организация покупатель
		Объект.РеквизитыДокумента[9].Значение = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	Если Не УправлениеДоступом.ЧтениеРазрешено(Объект.РеквизитыДокумента[8].Значение) Тогда
		// Организация продавец
		Объект.РеквизитыДокумента[8].Значение = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	Если Не УправлениеДоступом.ЧтениеРазрешено(Объект.РеквизитыДокумента[6].Значение) Тогда
		// Договор
		Объект.РеквизитыДокумента[6].Значение = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ИзменитьИсточникиДляВыбораДоговора();
	РаспознаваниеДокументовСлужебный.ПересчитатьПроблемныеЭлементы(ЭтотОбъект);
	РаспознаваниеДокументовСлужебный.ВосстановитьТекстыОшибок(ЭтотОбъект);
	
	НайтиИЗаполнитьСозданныеДокументы();
	
	СвойстваЯчеекТаблицы = РаспознаваниеДокументовСлужебный.СвойстваЯчеекТаблицы(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоступление(Команда)
	Если ЗначениеЗаполнено(СозданныеДокументы.Поступление.Ссылка) Тогда
		ОткрытьДокументПоСсылке(СозданныеДокументы.Поступление.Ссылка);
	Иначе
		ОткрытьДокументПоСсылке(СозданныеДокументы.СчетФактураПолученный.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРеализацию(Команда)
	Если ЗначениеЗаполнено(СозданныеДокументы.Реализация.Ссылка) Тогда
		ОткрытьДокументПоСсылке(СозданныеДокументы.Реализация.Ссылка);
	Иначе
		ОткрытьДокументПоСсылке(СозданныеДокументы.СчетФактураВыданный.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументПоСсылке(ДокументСсылка)
	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ДокументСсылка));
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияИзТаблицыДокумента()
	
	ТаблицаДокументаТЗ = РеквизитФормыВЗначение("ТаблицаДокумента");
	
	// Удаляем колонки, которые не нужно сохранять
	ТаблицаДокументаТЗ.Колонки.Удалить("Отступ");
	ТаблицаДокументаТЗ.Колонки.Удалить("Услуга");
	ИдКолонки = ТаблицаДокументаТЗ.Колонки.Количество();
	Пока ИдКолонки > 0 Цикл
		ИдКолонки = ИдКолонки - 1;
		Если СтрЗаканчиваетсяНа(ТаблицаДокументаТЗ.Колонки[ИдКолонки].Имя, "ТекстОшибки") Тогда
			
			ТаблицаДокументаТЗ.Колонки.Удалить(ИдКолонки);
		КонецЕсли;
	КонецЦикла;
	
	РаспознаваниеДокументовСлужебный.СохранитьТаблицуДокумента(Объект, ТаблицаДокументаТЗ);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИтоговыеЗначения()
	
	Объект.РеквизитыДокумента[10].Значение = ИтогоСумма;
	Объект.РеквизитыДокумента[11].Значение = ИтогоСуммаНДС;
	Объект.РеквизитыДокумента[12].Значение = ИтогоВсего;
	Объект.КоличествоОшибок = ОсталосьОшибок;
	Объект.КоличествоОшибокВТаблицах = ОсталосьОшибок - ПроблемныеЭлементы.Выгрузить(Новый Структура("НомерСтроки", 0), "ИмяРеквизита").Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭлементыИтогов()
	
	ИтогоСумма = Объект.РеквизитыДокумента[10].Значение;
	ИтогоСуммаНДС = Объект.РеквизитыДокумента[11].Значение;
	ИтогоВсего = Объект.РеквизитыДокумента[12].Значение;
	
	Объект.РеквизитыДокумента[10].ИмяЭлемента = "ИтогоСумма";
	Объект.РеквизитыДокумента[11].ИмяЭлемента = "ИтогоСуммаНДС";
	Объект.РеквизитыДокумента[12].ИмяЭлемента = "ИтогоВсего";
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределениеДействияДляСоздаваемойСчетФактуры(ОснованиеСчетаФактуры, ТипДокументаСтрокой, ПараметрыЗаполнения)
	
	Если ОснованиеСчетаФактуры = Неопределено Тогда
		
		Если ТипДокументаСтрокой = "РеализацияТоваровУслуг" Тогда
			ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный");
		Иначе
			ТипДокумента = Тип("ДокументСсылка.СчетФактураПолученный");
		КонецЕсли;
		
		МодульПереопределения = РаспознаваниеДокументовКлиентПереопределяемый;
		МодульПереопределения.ОткрытиеФормыСоздаваемогоДокумента(ТипДокумента, ПараметрыЗаполнения, ЭтотОбъект);
		
		Возврат;
	КонецЕсли;
	
	СчетФактураСсылка = СоздатьСчетФактуруПоПараметрам(ОснованиеСчетаФактуры, ТипДокументаСтрокой, ПараметрыЗаполнения);
	
	Если СчетФактураСсылка <> Неопределено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Создан документ'"), ПолучитьНавигационнуюСсылку(СчетФактураСсылка), Строка(СчетФактураСсылка));
		СледующийДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеВыделенияРамкойПоляДокумента(ИмяРеквизита, НомерСтроки)
	
	ДанныеТаблицы = СтрокаТаблицыДокументаПоПараметрам(НомерСтроки, ИмяРеквизита);
	Если ДанныеТаблицы = Неопределено Тогда
		ДанныеТаблицы = СтрокаТаблицыДокументаПоПараметрам(НомерСтроки, "Номенклатура");
		Если ДанныеТаблицы = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Координаты = РаспознаваниеДокументовСлужебныйКлиентСервер.ПолучитьНаборКоординат(ДанныеТаблицы);
	ДанныеПриближения = Новый Структура("Координаты, СтрокВИзображении", Координаты, ДанныеТаблицы.СтрокВИзображении);
	ПодключитьОбработчикОжидания("Подключаемый_ПриблизитьПоКоординатам", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеДляВыделенныхСтрок(Значение, ИмяКолонки)
	
	ИдентификаторыВыделенныхСтрок = Элементы.СписокНераспознаннойНоменклатуры.ВыделенныеСтроки;
	Для Каждого ИдентификаторСтроки Из ИдентификаторыВыделенныхСтрок Цикл
		ИзменяемаяСтрока = СписокНераспознаннойНоменклатуры.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИзменяемаяСтрока[ИмяКолонки] = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокиНераспознаннойНоменклатуры()
	
	СтрокиПустойНоменклатуры = Новый Массив;
	
	ПорогДобавления = РаспознаваниеДокументовСлужебныйВызовСервера.ПорогНоменклатурыДляГрупповогоСоздания();
	Для Каждого СтрокаНоменклатуры Из ТаблицаДокумента Цикл
		Если СтрокаНоменклатуры.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
			СтрокиПустойНоменклатуры.Добавить(СтрокаНоменклатуры);
			Продолжить;
		КонецЕсли;
		
		ИмеющиесяДанные = СтрокаТаблицыДокументаПоПараметрам(СтрокаНоменклатуры.НомерСтроки, "Номенклатура");
		Если ИмеющиесяДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ИмеющиесяДанные.ЗаполненоВручную
			И СтрокаНоменклатуры.Номенклатура = ИмеющиесяДанные.НайденноеЗначение
			И ИмеющиесяДанные.УверенностьНайденногоЗначения <= ПорогДобавления Тогда
			
			СтрокиПустойНоменклатуры.Добавить(СтрокаНоменклатуры);
		КонецЕсли;
	КонецЦикла;
	
	ИдентификаторыИсходныхСтрок = Новый Соответствие();
	Для Каждого СтрокаПустойНоменклатуры Из СтрокиПустойНоменклатуры Цикл
		ИдентификаторыИсходныхСтрок.Вставить(СтрокаПустойНоменклатуры.ПолучитьИдентификатор(), СтрокаПустойНоменклатуры);
	КонецЦикла;
	
	// Удаление исправленных значений
	Индекс = СписокНераспознаннойНоменклатуры.Количество();
	Пока Индекс > 0 Цикл
		Индекс = Индекс - 1;
		ИдентификаторТекущейСтроки = СписокНераспознаннойНоменклатуры[Индекс].ИдентификаторИсходнойСтроки;
		НайденноеЗначение = ИдентификаторыИсходныхСтрок.Получить(ИдентификаторТекущейСтроки);
		Если НайденноеЗначение = Неопределено Тогда
			СписокНераспознаннойНоменклатуры.Удалить(Индекс);
		Иначе // Отключение ранее добавленных строк
			ИндексУдаляемойСтроки = СтрокиПустойНоменклатуры.Найти(НайденноеЗначение);
			Если Не ИндексУдаляемойСтроки = Неопределено Тогда
				СтрокиПустойНоменклатуры.Удалить(ИндексУдаляемойСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	// Добавление новых
	Для Каждого СтрокаПустойНоменклатуры Из СтрокиПустойНоменклатуры Цикл
		СвойстваНераспознаннойНоменклатуры = СписокНераспознаннойНоменклатуры.Добавить();
		СвойстваНераспознаннойНоменклатуры.ИдентификаторИсходнойСтроки = СтрокаПустойНоменклатуры.ПолучитьИдентификатор();
		
		Отбор = Новый Структура("НомерСтрокиТЧ", СтрокаПустойНоменклатуры.НомерСтроки);
		СвязанныеСтрокиОбъекта = Объект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		
		ДанныеЗаполнения = РаспознаваниеДокументовСлужебныйКлиент.ДанныеЗаполненияДляНовогоЭлемента(СвязанныеСтрокиОбъекта);
		ЗаполнитьЗначенияСвойств(СвойстваНераспознаннойНоменклатуры, ДанныеЗаполнения);
	КонецЦикла;
	
	КнопкаСозданияНоменклатуры = Элементы.СписокНераспознаннойНоменклатурыСоздатьНоменклатуру;
	КнопкаСозданияНоменклатуры.Доступность = СписокНераспознаннойНоменклатуры.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеДляРеквизитовБыстрогоРедактирования(ИмяРеквизита, Значение = Неопределено)
	
	РедактируемаяСтрока = СтрокаПолейНераспознаннойНоменклатурыПоИмениРеквизита(ИмяРеквизита);
	Если РедактируемаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РедактируемаяСтрока.Выбран Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Неопределено Тогда
		Тип = ТипЗнч(РедактируемаяСтрока.Значение);
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(Тип);
		ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
		Значение = ОписаниеТипа.ПривестиЗначение();
	КонецЕсли;
	
	РедактируемаяСтрока.Значение = Значение;
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаПолейНераспознаннойНоменклатурыПоИмениРеквизита(ИмяРеквизита)
	
	Отбор = Новый Структура("ИмяРеквизита", ИмяРеквизита);
	НайденныеСтроки = ПоляНераспознаннойНоменклатуры.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		Возврат НайденныеСтроки[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СтрокаТаблицыДокументаПоПараметрам(НомерСтроки, ИмяРеквизита)
	
	Отбор = Новый Структура("НомерСтрокиТЧ, ИмяРеквизита", НомерСтроки, ИмяРеквизита);
	НайденныеСтроки = Объект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		Возврат НайденныеСтроки[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СохранитьПривязкуДокумента(СсылкаСоздаваемого)
	
	РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(СсылкаСоздаваемого, Объект.Ссылка, Ложь);
	Объект.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Обработан;
	
	НайтиИЗаполнитьСозданныеДокументы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьКнопкиУстановкиРеквизитов()
	
	Отбор = Новый Структура("Выбран", Истина);
	ВыбранныеЭлементы = ПоляНераспознаннойНоменклатуры.НайтиСтроки(Отбор);
	
	Элементы.ИзменитьЗначенияСтрокНераспознаннойНоменклатуры.Доступность = ВыбранныеЭлементы.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияЗакрытия(Результат, Контекст) Экспорт
	
	Записать();
	Подключаемый_ПослеЗаписи();
	
	КлючеваяОперация = "РаспознаваниеДокументов.ЗакрытиеФормы." + ИмяФормы;
	Замер = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	Комментарий = Новый Структура;
	Комментарий.Вставить("ИдентификаторРезультата", Объект.ИдентификаторРезультата);
	
	ОценкаПроизводительностиКлиент.УстановитьКомментарийЗамера(Замер, Комментарий);
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Оформление ячеек с ошибками
	
	ТаблицаДокументаТЗ = РеквизитФормыВЗначение("ТаблицаДокумента");
	КолонкиТаблицыДокумента = ТаблицаДокументаТЗ.Колонки;
	
	Для Каждого Колонка Из КолонкиТаблицыДокумента Цикл
		
		Если СтрЗаканчиваетсяНа(Колонка.Имя, "ТекстОшибки") Тогда
			
			ИмяКолонкиОригинал = СтрЗаменить(Колонка.Имя, "ТекстОшибки", "");
			
			ЭлементОформления = УсловноеОформление.Элементы.Добавить();
			
			ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокумента." + Колонка.Имя);
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиОригинал);
			
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(251, 212, 212));
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
