
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем переменные формы.
	КэшированныеЗначения.Вставить("ЭтоНовый"                , ?(Параметры.Ключ.Пустая(), Истина, Ложь));
	КэшированныеЗначения.Вставить("мФормаВводаМестаРождения", Ложь);
	КэшированныеЗначения.Вставить("ЮрАдресПроживающего", Неопределено);
	КэшированныеЗначения.Вставить("ФактАдресПроживающего", Неопределено);
	КэшированныеЗначения.Вставить("ТелефонПроживающего", Неопределено);
	КэшированныеЗначения.Вставить("ИнформАдресПроживающего", Неопределено);
	
	КэшированныеЗначения.Вставить("ИнострАдресПроживающего", Неопределено);
	КэшированныеЗначения.Вставить("ТелефонСлужебныйПроживающего", Неопределено);
	КэшированныеЗначения.Вставить("EmailПроживающего", Неопределено);
	КэшированныеЗначения.Вставить("ДругаяИнформацияПроживающего", Неопределено);
	КэшированныеЗначения.Вставить("АдресПрибытияДрРегион", Неопределено);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// БИТ_ЖКХ 24.02.2014
	РазместитьКонтактнуюИнформацию();
	// БИТ_ЖКХ 24.02.2014
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ФизЛицо", Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СвидетельстваОСмерти.ФизЛицо,
	|	бит_СвидетельстваОСмерти.ДатаВыдачи,
	|	бит_СвидетельстваОСмерти.ДатаСмерти,
	|	бит_СвидетельстваОСмерти.ДатаСоставления,
	|	бит_СвидетельстваОСмерти.КемВыдано,
	|	бит_СвидетельстваОСмерти.Номер,
	|	бит_СвидетельстваОСмерти.НомерСвидетельства,
	|	бит_СвидетельстваОСмерти.СерияСвидетельства
	|ИЗ
	|	РегистрСведений.бит_СвидетельстваОСмерти КАК бит_СвидетельстваОСмерти
	|ГДЕ
	|	бит_СвидетельстваОСмерти.ФизЛицо = &ФизЛицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейСвидетельстваОСмерти.Добавить(), Выборка);
		
	КонецЕсли; 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортныеДанныеФизЛицСрезПоследних.Период,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументПричинаЗамены
	|ИЗ
	|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейДокументаУдостоверяющегоЛичность.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГражданствоФизЛицСрезПоследних.Период,
	|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
	|	ГражданствоФизЛицСрезПоследних.Страна
	|ИЗ
	|	РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейГражданство.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ВоинскийУчетСрезПоследних.Период КАК Период,
	|	бит_ВоинскийУчетСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскомуУчету,
	|	бит_ВоинскийУчетСрезПоследних.КатегорияЗапаса,
	|	бит_ВоинскийУчетСрезПоследних.Звание,
	|	бит_ВоинскийУчетСрезПоследних.Состав,
	|	бит_ВоинскийУчетСрезПоследних.ВУС,
	|	бит_ВоинскийУчетСрезПоследних.Годность,
	|	бит_ВоинскийУчетСрезПоследних.Военкомат,
	|	бит_ВоинскийУчетСрезПоследних.НаличиеМобпредписания,
	|	бит_ВоинскийУчетСрезПоследних.НомерКомандыПартии,
	|	бит_ВоинскийУчетСрезПоследних.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	бит_ВоинскийУчетСрезПоследних.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	бит_ВоинскийУчетСрезПоследних.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета
	|ИЗ
	|	РегистрСведений.бит_ВоинскийУчет.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ВоинскийУчетСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейВоинскийУчет.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.Период,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ФизЛицо,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.МестоРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.НачалоРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ОкончаниеРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.Должность,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.КурсКласс,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ВидыЗанятости,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.РодЗанятий
	|ИЗ
	|	РегистрСведений.бит_ТрудоваяДеятельностьПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ТрудоваяДеятельностьПроживающихСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейТрудоваяДеятельность.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Период,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.СерияСправки,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.НомерСправки,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.ДатаВыдачи,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.ГруппаИнвалидности,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.СрокДействияСправки
	|ИЗ
	|	РегистрСведений.бит_СведенияОбИнвалидностиПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК СведенияОбИнвалидностиФизлицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейИнвалидность.Добавить(), Выборка);
		
	КонецЕсли;
	
	// Заполнить ЮрАдресПроживающего.
	ПолеКИ1           = ПолучитьДанныеИзКонтактнойИнформации("Адрес"                , "АдресПоПрописке");
	
	// БИТ_ЖКХ 06.10.2014
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ЮрАдресПроживающего) Тогда
		
		КонтактнаяИнформацияПолеЮрАдресПроживающего = Объект.ЮрАдресПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеЮрАдресПроживающего = ПолеКИ1;
		
	Иначе
		
		КонтактнаяИнформацияПолеЮрАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ1 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеЮрАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;	
	
	// Заполнить ФактАдресПроживающего.
	ПолеКИ2           = ПолучитьДанныеИзКонтактнойИнформации("Адрес"                , "АдресПроживания");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ФактАдресПроживающего) Тогда
		
		КонтактнаяИнформацияПолеФактАдресПроживающего = Объект.ФактАдресПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеФактАдресПроживающего = ПолеКИ2;
		
	Иначе
		
		КонтактнаяИнформацияПолеФактАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ2 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеФактАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;	
	
	// Заполнить ТелефонПроживающего.
	ПолеКИ3           = ПолучитьДанныеИзКонтактнойИнформации("Телефон"              , "Телефон");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ТелефонПроживающего) Тогда
		
		КонтактнаяИнформацияПолеТелефонПроживающего = Объект.ТелефонПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеТелефонПроживающего = ПолеКИ3;
		
	Иначе
		
		КонтактнаяИнформацияПолеТелефонПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ3 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеТелефонПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	// Заполнить ИнформАдресПроживающего.
	ПолеКИ4           = ПолучитьДанныеИзКонтактнойИнформации("Адрес"                , "АдресДляИнформирования");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ИнформАдресПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ИнформАдресПроживающего) Тогда
		
		КонтактнаяИнформацияПолеИнформАдресПроживающего = Объект.ИнформАдресПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеИнформАдресПроживающего = ПолеКИ4;
		
	Иначе
		
		КонтактнаяИнформацияПолеИнформАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ4 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеИнформАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	// Заполнить ИнострАдресПроживающего.
	ПолеКИ5           = ПолучитьДанныеИзКонтактнойИнформации("Адрес"                , "АдресЗапределамиРФ");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ИнострАдресПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ИнострАдресПроживающего) Тогда
		
		КонтактнаяИнформацияПолеИнострАдресПроживающего = Объект.ИнострАдресПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеИнострАдресПроживающего = ПолеКИ5;
		
	Иначе
		
		КонтактнаяИнформацияПолеИнострАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ5 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеИнострАдресПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	// Заполнить ТелефонСлужебныйПроживающего.
	ПолеКИ6           = ПолучитьДанныеИзКонтактнойИнформации("Телефон"              , "ТелефонСлужебный");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ТелефонСлужебныйПроживающего) Тогда
		
		КонтактнаяИнформацияПолеТелефонСлужебныйПроживающего = Объект.КонтактнаяИнформацияПолеТелефонСлужебныйПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеТелефонСлужебныйПроживающего = ПолеКИ6;
		
	Иначе
		
		КонтактнаяИнформацияПолеТелефонСлужебныйПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ6 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеТелефонСлужебныйПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	// Заполнить EmailПроживающего.
	ПолеКИ7           = ПолучитьДанныеИзКонтактнойИнформации("АдресЭлектроннойПочты", "Email");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.EmailПроживающего) Тогда
		
		КонтактнаяИнформацияПолеEmailПроживающего = Объект.EmailПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеEmailПроживающего = ПолеКИ7;
		
	Иначе
		
		КонтактнаяИнформацияПолеEmailПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ7 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеEmailПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	// Заполнить АдресПрибытияИзДругогоРегиона.
	ПолеКИ8           = ПолучитьДанныеИзКонтактнойИнформации("Адрес"                , "АдресПрибытияИзДругогоРегиона");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПрибытияДрРегион"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.АдресПрибытияДрРегион) Тогда
		
		КонтактнаяИнформацияПолеАдресПрибытияДрРегион = Объект.АдресПрибытияДрРегион;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеАдресПрибытияДрРегион = ПолеКИ8;
		
	Иначе
		
		КонтактнаяИнформацияПолеАдресПрибытияДрРегион = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеКИ8 = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеАдресПрибытияДрРегион = Строки[0].Представление;
		
	КонецЕсли;		
	
	// Заполнить ДругаяИнформацияПроживающего.
	ПолеВводаПрочаяКИ = ПолучитьДанныеИзКонтактнойИнформации("Другое"               , "ДругаяИнформация");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ДругаяИнформацияПроживающего"));
	
	Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Строки.количество() = 0 и ЗначениеЗаполнено(Объект.ДругаяИнформацияПроживающего) Тогда
		
		КонтактнаяИнформацияПолеДругаяИнформацияПроживающего = Объект.ДругаяИнформацияПроживающего;
		
	ИначеЕсли Строки.количество() = 0 Тогда	
		
		КонтактнаяИнформацияПолеДругаяИнформацияПроживающего = ПолеВводаПрочаяКИ;
		
	Иначе
		
		КонтактнаяИнформацияПолеДругаяИнформацияПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	
	Если ПолеВводаПрочаяКИ = "" и НЕ Строки.количество() = 0 Тогда
		
		КонтактнаяИнформацияПолеДругаяИнформацияПроживающего = Строки[0].Представление;
		
	КонецЕсли;		
	// БИТ_ЖКХ 06.10.2014
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	мКэшРеквизитовФормы.Вставить("ПолеКИ3"          , ПолеКИ3);
	мКэшРеквизитовФормы.Вставить("ПолеКИ6"          , ПолеКИ6);
	мКэшРеквизитовФормы.Вставить("ПолеКИ7"          , ПолеКИ7);
	мКэшРеквизитовФормы.Вставить("ПолеВводаПрочаяКИ", ПолеВводаПрочаяКИ);
	
	//07.03.2019
	для каждого стр из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов цикл		
	  если стр.Тип = Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка() тогда 	
		стр.Значение = "";
      конецесли;
	конеццикла;	
	//-----------

	//Отбор = Новый Структура();
	//Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресПроживающего"));
	//
	//Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	//
	//Если НЕ Строки.количество() = 0 Тогда
	//	
	//	ЮрАдресПроживающегоЗапятые = Строки[0].ПредставлениеЗапятые;
	//	
	//КонецЕсли;	
	//
	//Отбор = Новый Структура();
	//Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПрибытияДрРегион"));
	//
	//Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
	//
	//Если НЕ Строки.количество() = 0 Тогда
	//	
	//	АдресПрибытияДрРегионЗапятые = Строки[0].ПредставлениеЗапятые;
	//	
	//КонецЕсли;
	
	//+bit_semenov.v_19.11.2021
	бит_ДоработатьФорму();
	//бит_ЗаполнитьТЧПРедставителиДети();
	//-bit_semenov.v_19.11.2021
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мКэшЗначений.ЭтоНовый = Ложь;
	
	Оповестить("ОбновитьДанныеОФизлице", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставлениеЭлемента("Гражданство");
	ОбновитьПредставлениеЭлемента("УдостоверениеЛичности");
	ОбновитьПредставлениеЭлемента("ФИО");
	ОбновитьПредставлениеЭлемента("ВоинскийУчет");
	ОбновитьПредставлениеЭлемента("ТрудоваяДеятельность");
	ОбновитьПредставлениеЭлемента("Инвалидность");
	ОбновитьПредставлениеЭлемента("СвидетельствоОСмерти");
	
	Модифицированность = Ложь;
	
	ПериодДопДанных = ТекущаяДата();
	
	бит_ДобавлениеСпискаДопДанных(ДопДанныеПроживающих, Объект.Ссылка, ПериодДопДанных);	
	
	// Место рождения.
	ПрочитатьМестоРождения();
	
	Заголовок = "Личные данные проживающего: " + Объект.Наименование;
	
	HD_УстановитьДоступностьЭлементовДляОтделаПоРаботеСНаселением();
	
КонецПроцедуры

//HD+
// Ограничивает редактирование формы для роли HD_ОтделПоРаботеСНаселением_Пользователь:
// доступны только телефон проживающего и страховой номер ПФР.
//
&НаКлиенте
Процедура HD_УстановитьДоступностьЭлементовДляОтделаПоРаботеСНаселением()
	
	Если НЕ HD_ТребуетсяОграничениеДоступаОтделаПоРаботеСНаселением() Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Ложь;
	
	РазрешенныеЭлементы = HD_РазрешенныеЭлементыФормыОтделаПоРаботеСНаселением();
	
	Для Каждого ЭлементФормы Из Элементы Цикл
		
		Разрешен = (РазрешенныеЭлементы.Получить(ЭлементФормы.Имя) <> Неопределено);
		HD_УстановитьДоступностьЭлементаФормы(ЭлементФормы, Разрешен);
		
	КонецЦикла;
	
КонецПроцедуры //HD-

//HD+
// Возвращает соответствие разрешенных для редактирования элементов формы.
//
&НаКлиенте
Функция HD_РазрешенныеЭлементыФормыОтделаПоРаботеСНаселением()
	
	РазрешенныеЭлементы = Новый Соответствие;
	РазрешенныеЭлементы.Вставить("КонтактнаяИнформацияПолеТелефонПроживающего", Истина);
	РазрешенныеЭлементы.Вставить("СтраховойНомерПФР", Истина);
	РазрешенныеЭлементы.Вставить("КомандаКонтактнаяИнформацияПолеТелефонПроживающего", Истина);
	
	Возврат РазрешенныеЭлементы;
	
КонецФункции //HD-

//HD+
// Устанавливает доступность элемента формы в режиме ограниченного редактирования.
//
&НаКлиенте
Процедура HD_УстановитьДоступностьЭлементаФормы(ЭлементФормы, Разрешен)
	
	ТипЭлемента = ТипЗнч(ЭлементФормы);
	
	Если Разрешен Тогда
		
		Если ТипЭлемента = Тип("ПолеФормы")
			И ЭлементФормы.Вид <> ВидПоляФормы.ПолеНадписи Тогда
			ЭлементФормы.ТолькоПросмотр = Ложь;
			ЭлементФормы.Доступность = Истина;
		ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") Тогда
			ЭлементФормы.Доступность = Истина;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЭлемента = Тип("ПолеФормы") Тогда
		
		Если ЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи Тогда
			
			Если ЭлементФормы.Гиперссылка Тогда
				ЭлементФормы.Доступность = Ложь;
			КонецЕсли;
			
		Иначе
			ЭлементФормы.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипЭлемента = Тип("ТаблицаФормы") Тогда
		
		ЭлементФормы.ТолькоПросмотр = Истина;
		
	ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") Тогда
		
		Если HD_ЭтоСтандартнаяКомандаЗаписиФормы(ЭлементФормы.Имя) Тогда
			Возврат;
		КонецЕсли;
		
		ЭлементФормы.Доступность = Ложь;
		
	ИначеЕсли ТипЭлемента = Тип("ГруппаФормы")
		И СтрЗаканчиваетсяНа(ЭлементФормы.Имя, "КоманднаяПанель")
		И ЭлементФормы.Имя <> "ФормаКоманднаяПанель" Тогда
		
		ЭлементФормы.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры //HD-

//HD+
// Определяет, является ли кнопка стандартной командой записи или закрытия формы.
//
&НаКлиенте
Функция HD_ЭтоСтандартнаяКомандаЗаписиФормы(ИмяКоманды)
	
	Если ИмяКоманды = "ФормаЗаписать"
		ИЛИ ИмяКоманды = "ФормаЗаписатьИЗакрыть"
		ИЛИ ИмяКоманды = "ФормаЗакрыть" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат СтрНачинаетсяС(ИмяКоманды, "ФормаЗапис");
	
КонецФункции //HD-

//HD+
// Возвращает Истина, если для текущего пользователя нужно ограничить форму проживающего.
//
&НаСервере
Функция HD_ТребуетсяОграничениеДоступаОтделаПоРаботеСНаселением()
	
	ИмяРолиПользователь = "HD_ОтделПоРаботеСНаселением_Пользователь";
	
	Если Метаданные.Роли.Найти(ИмяРолиПользователь) = Неопределено
		ИЛИ НЕ РольДоступна(ИмяРолиПользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяРолиАдминистратор = "HD_ОтделПоРаботеСНаселением_Администратор";
	Если Метаданные.Роли.Найти(ИмяРолиАдминистратор) <> Неопределено
		И РольДоступна(ИмяРолиАдминистратор) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции //HD-

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_Проживающие.Форма.ФормаВводаМестаРожденияУправляемая" Тогда
		
		Объект.МестоРождения = ВыбранноеЗначение;
		
		// Представление места рождения.
		МестоРожденияФизЛица = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Объект.МестоРождения);
		
		Если Не ЗначениеЗаполнено(МестоРожденияФизЛица) Тогда
			
			МестоРожденияФизЛица = "Ввести место рождения";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьФорму" и (Источник = Объект.Ссылка или (ТипЗнч(Источник) = Тип("СправочникСсылка.бит_Проживающие") и Источник.Пустая())) Тогда
		
		ИмяОбновляемогоЭлемента = Параметр.ИмяЭлемента;
		
		Если ИмяОбновляемогоЭлемента = "КонтактнаяИнформация" Тогда
			
			Подключаемый_ОбновитьКонтактнуюИнформацию(Параметр.СтруктураЭлемента);
			
		Иначе
			
			ОбновитьПредставлениеЭлемента(ИмяОбновляемогоЭлемента);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбновитьТрудоваяДеятельность" Тогда
		
		ОбновитьПредставлениеЭлемента("ТрудоваяДеятельность");
		
	ИначеЕсли ИмяСобытия = "ОбновитьСвидетельствоОСмерти" Тогда
		
		ОбновитьПредставлениеЭлемента("СвидетельствоОСмерти");
		
	ИначеЕсли ИмяСобытия = "ОбновитьВоинскийУчет" Тогда
		
		ОбновитьПредставлениеЭлемента("ВоинскийУчет");
		
	ИначеЕсли ИмяСобытия = "ОбновитьУдостоверениеЛичности" Тогда
		
		ОбновитьПредставлениеЭлемента("УдостоверениеЛичности");
		
	ИначеЕсли ИмяСобытия = "ОбновлениеЗначенийСвойств" И Источник = Объект.Ссылка Тогда	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЮрАдресПроживающего = мКэшЗначений.ЮрАдресПроживающего;
	ТекущийОбъект.ФактАдресПроживающего = мКэшЗначений.ФактАдресПроживающего;
	ТекущийОбъект.ТелефонПроживающего = мКэшЗначений.ТелефонПроживающего;
	ТекущийОбъект.ИнформАдресПроживающего = мКэшЗначений.ИнформАдресПроживающего;
	
	ТекущийОбъект.ИнострАдресПроживающего = мКэшЗначений.ИнострАдресПроживающего;
	ТекущийОбъект.ТелефонСлужебныйПроживающего = мКэшЗначений.ТелефонСлужебныйПроживающего;
	ТекущийОбъект.EmailПроживающего = мКэшЗначений.EmailПроживающего;
	ТекущийОбъект.ДругаяИнформацияПроживающего = мКэшЗначений.ДругаяИнформацияПроживающего;
	ТекущийОбъект.АдресПрибытияДрРегион = мКэшЗначений.АдресПрибытияДрРегион;
	
	
	//// БИТ_ЖКХ 20.10.2014
	//// ТекущийОбъект.ОткудаПрибылАдресЗапятые = ОткудаПрибылПредставлениеЗапятые;.
	//Для Каждого Строка из ТекущийОбъект.КонтактнаяИнформация Цикл
	//	
	//	Если Строка.Вид  = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресПроживающего") Тогда
	//		
	//		Строка.ПредставлениеЗапятые = ЮрАдресПроживающегоЗапятые;
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	//// БИТ_ЖКХ 20.10.2014
	//
	//// БИТ_ЖКХ 21.10.2014
	//// ТекущийОбъект.ОткудаПрибылАдресЗапятые = ОткудаПрибылПредставлениеЗапятые;.
	//Для Каждого Строка из ТекущийОбъект.КонтактнаяИнформация Цикл
	//	
	//	Если Строка.Вид  = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПрибытияДрРегион") Тогда
	//		
	//		Строка.ПредставлениеЗапятые = АдресПрибытияДрРегионЗапятые;
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	//// БИТ_ЖКХ 21.10.2014
	//
	//// БИТ_ЖКХ 31.10.2014
	//// ТекущийОбъект.ОткудаПрибылАдресЗапятые = ОткудаПрибылПредставлениеЗапятые;.
	//Для Каждого Строка из ТекущийОбъект.КонтактнаяИнформация Цикл
	//	
	//	Если Строка.Вид  = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресПроживающего") Тогда
	//		
	//		Строка.ПредставлениеЗапятые = ФактАдресПроживающегоЗапятые;
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	//// БИТ_ЖКХ 31.10.2014
	
	Если ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		// БИТ_ЖКХ 10.02.2014
		// Если РегламентированнаяОтчетность.ИННСоответствуетТребованиям(Объект.ИНН, Перечисления.ЮрФизЛицо.ФизЛицо) Тогда.
		Если РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Объект.ИНН, ЛОЖЬ,"") Тогда
			
			// БИТ_ЖКХ 10.02.2014			
			ТекстЗаписиИНН = ОбновитьИННОрганизаций();
			
			Если НЕ ПустаяСтрока(ТекстЗаписиИНН) Тогда

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстЗаписиИНН + Символы.ПС + "Элемент не записан!");
				
				Отказ = Истина;
				
			КонецЕсли;
			
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("ИНН физического лица задан неверно!");
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мКэшЗначений.ЮрАдресПроживающего = Элементы.КонтактнаяИнформацияПолеЮрАдресПроживающего.ТекстРедактирования;
	мКэшЗначений.ФактАдресПроживающего = Элементы.КонтактнаяИнформацияПолеФактАдресПроживающего.ТекстРедактирования;
	мКэшЗначений.ТелефонПроживающего = Элементы.КонтактнаяИнформацияПолеТелефонПроживающего.ТекстРедактирования;
	мКэшЗначений.ИнформАдресПроживающего = Элементы.КонтактнаяИнформацияПолеИнформАдресПроживающего.ТекстРедактирования;
	
	мКэшЗначений.ИнострАдресПроживающего = Элементы.КонтактнаяИнформацияПолеИнострАдресПроживающего.ТекстРедактирования;
	мКэшЗначений.ТелефонСлужебныйПроживающего = Элементы.КонтактнаяИнформацияПолеТелефонСлужебныйПроживающего.ТекстРедактирования;
	мКэшЗначений.EmailПроживающего = Элементы.КонтактнаяИнформацияПолеEmailПроживающего.ТекстРедактирования;
	мКэшЗначений.ДругаяИнформацияПроживающего = Элементы.КонтактнаяИнформацияПолеДругаяИнформацияПроживающего.ТекстРедактирования;
	мКэшЗначений.АдресПрибытияДрРегион = Элементы.КонтактнаяИнформацияПолеАдресПрибытияДрРегион.ТекстРедактирования;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОпределениеПола();
	ЗаписатьДанныеФИО();
	
	бит_ЗащитаПерсональнойИнформации.ЗаписатьДанныеФИОВРегистр(Объект.Ссылка, Фамилия, Имя, Отчество);
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_Проживающие"));
	
	СправочникОбъект.СинхронизироватьНаименованияСотрудников(Объект.Ссылка);
	
	ЗначениеВДанныеФормы(СправочникОбъект, Объект);
	
	// Проведение заполненнных данных со страницы Дополнительные сведения. 
	// В периодический регистр бит_ДопСведенияОПроживающих.
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ДопСведенияОПроживающихСрезПоследних.ВидСведений КАК ВидСведений,
	|	ЕСТЬNULL(бит_ДопСведенияОПроживающихСрезПоследних.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
	|ИЗ
	|	РегистрСведений.бит_ДопСведенияОПроживающих.СрезПоследних(&Период, Проживающий.Ссылка = &Ссылка) КАК бит_ДопСведенияОПроживающихСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ПериодДопДанных);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();                                
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("ВидСведений");
	ТЗ.Колонки.Добавить("Значение");
	
	Для каждого ТекСтрока Из ДопДанныеПроживающих Цикл
		
		НайденнаяСтрока = Результат.Найти(ТекСтрока.ВидСведений, "ВидСведений");
		
		Если НайденнаяСтрока = Неопределено Тогда 
			
			Если ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
				
				НоваяСтрока = ТЗ.Добавить();
				
				НоваяСтрока.ВидСведений = ТекСтрока.ВидСведений;
				НоваяСтрока.Значение    = ТекСтрока.Значение;
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока = ТЗ.Добавить();
			
			НоваяСтрока.ВидСведений = ТекСтрока.ВидСведений;
			НоваяСтрока.Значение    = ТекСтрока.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТЗ.Количество()<> 0 Тогда
		
		Для каждого Строка Из ТЗ Цикл
			
			Запись = РегистрыСведений.бит_ДопСведенияОПроживающих.СоздатьМенеджерЗаписи();
			
			Запись.Проживающий = Объект.Ссылка;
			Запись.Период      = ПериодДопДанных;
			Запись.ВидСведений = Строка.ВидСведений;
			Запись.Значение    = Строка.Значение;
			
			Запись.Записать(Истина);
			
		КонецЦикла; 
		
	КонецЕсли;
	
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	//+bit_semenov.v_19.11.2021
	бит_ЗаполнитьТЧПРедставителиДети();
	//-bit_semenov.v_19.11.2021
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура ДанныеПоФизЛицу(Команда)
	
	ТабличныйДокумент = ПечатьДанныхПоФизлицуНаСервере();
	
	ТабличныйДокумент.Показать("Данные по: " + Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура Подробнее(Команда)
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала запишите элемент");
		
		Возврат;
		
	КонецЕсли;
	
	ПодробнееФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееФрагмент()
	
	Перем КлючЗаписиРегистра, ПараметрыМассив, ПередаваемыеПараметры, СтруктураРегистра;
	
	СтруктураРегистра = ПолучитьСтруктуруРегистраСведеенийФИОПроживающихНаСервере(Объект.Ссылка, Объект.Наименование);
	
	ПередаваемыеПараметры = Новый Структура;
	
	ПередаваемыеПараметры.Вставить("Период" , СтруктураРегистра.Период);
	ПередаваемыеПараметры.Вставить("ФизЛицо", Объект.Ссылка);
	
	Если КлючЗаписиФИОПроживающихСуществует(ПередаваемыеПараметры) Тогда
		
		ПараметрыМассив = Новый Массив;
		
		ПараметрыМассив.Добавить(ПередаваемыеПараметры); 
		
		КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.бит_ФИОПроживающих", ПараметрыМассив); 
		
		ОткрытьФорму("РегистрСведений.бит_ФИОПроживающих.Форма.ФормаЗаписиДополнительнаяУправляемая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,, Новый ОписаниеОповещения("ПодробнееЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		ПередаваемыеПараметры.Вставить("Фамилия" , СтруктураРегистра.Фамилия);
		ПередаваемыеПараметры.Вставить("Имя"     , СтруктураРегистра.Имя);
		ПередаваемыеПараметры.Вставить("Отчество", СтруктураРегистра.Отчество);
		
		ОткрытьФорму("РегистрСведений.бит_ФИОПроживающих.Форма.ФормаЗаписиДополнительнаяУправляемая", Новый Структура("ЗаполнитьИзСправочникаПроживающие", ПередаваемыеПараметры), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ФИО = Объект.Наименование;
	
	Если ПустаяСтрока(Фамилия) ИЛИ мКэшЗначений.ЭтоНовый Тогда
		
		Фамилия  = ВыделитьСлово(ФИО);
		Имя      = ВыделитьСлово(ФИО);
		Отчество = ВыделитьСлово(ФИО);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВозможныхНаименований = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Фамилия) Тогда
		
		СписокВозможныхНаименований.Добавить(Фамилия);
		
		Если ЗначениеЗаполнено(Имя) Тогда
			
			СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + СокрЛП(Имя));
			СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + Лев(Имя,1) + ".");
			
			Если ЗначениеЗаполнено(Отчество) Тогда
				
				СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество));
				СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + Лев(Имя,1) + ". " + Лев(Отчество,1) + ".");
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Имя) Тогда
			
			СписокВозможныхНаименований.Добавить(Имя);
			
			Если ЗначениеЗаполнено(Отчество) Тогда
				
				СписокВозможныхНаименований.Добавить(СокрЛП(Имя) + " " + СокрЛП(Отчество));
				СписокВозможныхНаименований.Добавить(СокрЛП(Имя) + ". " + Лев(Отчество,1) + ".");
				
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Отчество) Тогда
				
				СписокВозможныхНаименований.Добавить(Отчество);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранныйЭлемент = Неопределено;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("НаименованиеНачалоВыбораЗавершение", ЭтотОбъект), СписокВозможныхНаименований, Элементы.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
        Объект.Наименование = ВыбранныйЭлемент.Значение;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияФизЛицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("МестоРожденияСтрокой", Объект.МестоРождения);
	ПараметрыФормы.Вставить("ЗаголовокФормы"      , "Место рождения проживающего: " + Объект.Наименование);
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВводаМестаРожденияУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдостоверениеЛичностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПередаваемыеПараметры = Новый Структура;
		
		Если мНаборЗаписейДокументаУдостоверяющегоЛичность.Количество() > 0 Тогда
			
			ПередаваемыеПараметры.Вставить("Период" , мНаборЗаписейДокументаУдостоверяющегоЛичность[0].Период);
			ПередаваемыеПараметры.Вставить("ФизЛицо" , мНаборЗаписейДокументаУдостоверяющегоЛичность[0].ФизЛицо);
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаРедактированияДокументаУдостоверяющегоЛичностьУправляемая", Новый Структура("Ключ", ПередаваемыеПараметры),Этаформа,,,, Новый ОписаниеОповещения("УдостоверениеЛичностиНачалоВыбораЗавершение1", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе	
			
			ПередаваемыеПараметры.Вставить("ФизЛицо", Объект.Ссылка);
			ПередаваемыеПараметры.Вставить("Период", ТекущаяДата());
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаРедактированияДокументаУдостоверяющегоЛичностьУправляемая", Новый Структура("ЗаполнитьИзСправочникаПроживающие", ПередаваемыеПараметры),Этаформа,,,, Новый ОписаниеОповещения("УдостоверениеЛичностиНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдостоверениеЛичностиНачалоВыбораЗавершение1(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдостоверениеЛичностиНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПередаваемыеПараметры = Новый Структура;
		
		Если мНаборЗаписейГражданство.Количество() > 0 Тогда
			
			ПередаваемыеПараметры.Вставить("Период" , мНаборЗаписейГражданство[0].Период);
			ПередаваемыеПараметры.Вставить("ФизЛицо" , мНаборЗаписейГражданство[0].ФизЛицо);
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиГражданствоУправляемая", Новый Структура("Ключ", ПередаваемыеПараметры),Этаформа,,,, Новый ОписаниеОповещения("ГражданствоНачалоВыбораЗавершение1", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе	
			
			ПередаваемыеПараметры.Вставить("ФизЛицо", Объект.Ссылка);
			ПередаваемыеПараметры.Вставить("Период", ТекущаяДата());
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиГражданствоУправляемая", Новый Структура("ЗаполнитьИзСправочникаПроживающие", ПередаваемыеПараметры),Этаформа,,,, Новый ОписаниеОповещения("ГражданствоНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
	Иначе

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоНачалоВыбораЗавершение1(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвалидностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПередаваемыеПараметры = Новый Структура;
		
		Если мНаборЗаписейИнвалидность.Количество() > 0 Тогда
			
			ПередаваемыеПараметры.Вставить("Период" , мНаборЗаписейИнвалидность[0].Период);
			ПередаваемыеПараметры.Вставить("ФизЛицо" , мНаборЗаписейИнвалидность[0].ФизЛицо);
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиСведенияОбИнвалидностиУправляемая", Новый Структура("Ключ", ПередаваемыеПараметры),Этаформа,,,, Новый ОписаниеОповещения("ИнвалидностьНачалоВыбораЗавершение1", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе	
			
			ПередаваемыеПараметры.Вставить("ФизЛицо", Объект.Ссылка);
			ПередаваемыеПараметры.Вставить("Период", ТекущаяДата());
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиСведенияОбИнвалидностиУправляемая", Новый Структура("ЗаполнитьИзСправочникаПроживающие", ПередаваемыеПараметры),Этаформа,,,, Новый ОписаниеОповещения("ИнвалидностьНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвалидностьНачалоВыбораЗавершение1(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвалидностьНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура КодИМНСПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		Объект.ИНН = Объект.КодИМНС;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.КодИМНС) Тогда
		
		Объект.КодИМНС = Лев(Объект.ИНН, 4);
		
	КонецЕсли;
	
КонецПроцедуры


//&НаКлиенте
//Процедура ПолеКИ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//			
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПолеКИ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПолеКИ4НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПолеКИ5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПолеКИ8НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ВоинскийУчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПередаваемыеПараметры = Новый Структура;
		
		ПередаваемыеПараметры.Вставить("ФизЛицо", Объект.Ссылка);
		
		Если мНаборЗаписейВоинскийУчет.Количество() > 0 Тогда
			
			ПередаваемыеПараметры.Вставить("Период" , мНаборЗаписейВоинскийУчет[0].Период);
			
		КонецЕсли;
		
		Если КлючЗаписиВоинскийУчетСуществует(ПередаваемыеПараметры) Тогда
			
			ПараметрыМассив = Новый Массив;
			
			ПараметрыМассив.Добавить(ПередаваемыеПараметры);
			
			КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.бит_ВоинскийУчет", ПараметрыМассив);
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиВоинскийУчетУправляемая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,, Новый ОписаниеОповещения("ВоинскийУчетНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиВоинскийУчетУправляемая", Новый Структура("ЗаполнитьИзСправочникаПроживающие", ПередаваемыеПараметры), ЭтаФорма); 
			
		КонецЕсли;
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВоинскийУчетНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудоваяДеятельностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПередаваемыеПараметры = Новый Структура;
		
		ПередаваемыеПараметры.Вставить("ФизЛицо", Объект.Ссылка);
		
		Если мНаборЗаписейТрудоваяДеятельность.Количество() > 0 Тогда
			
			ПередаваемыеПараметры.Вставить("Период" , мНаборЗаписейТрудоваяДеятельность[0].Период);
			
		КонецЕсли;
		
		Если КлючЗаписиТрудоваяДеятельностьПроживающихСуществует(ПередаваемыеПараметры) Тогда
			
			ПараметрыМассив = Новый Массив;
			
			ПараметрыМассив.Добавить(ПередаваемыеПараметры);
			
			КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.бит_ТрудоваяДеятельностьПроживающих", ПараметрыМассив);
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиТрудовойДеятельностиУправляемая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,, Новый ОписаниеОповещения("ТрудоваяДеятельностьНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаЗаписиТрудовойДеятельностиУправляемая", Новый Структура("ЗаполнитьИзСправочникаПроживающие", ПередаваемыеПараметры), ЭтаФорма); 
			
		КонецЕсли;
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудоваяДеятельностьНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СвидетельствоОСмертиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПередаваемыеПараметры = Новый Структура;
		
		ПередаваемыеПараметры.Вставить("ФизЛицо", Объект.Ссылка);
		
		Если КлючЗаписиСвидетельствоОСмертиСуществует(ПередаваемыеПараметры) Тогда
			
			ПараметрыМассив = Новый Массив;
			
			ПараметрыМассив.Добавить(ПередаваемыеПараметры);
			
			КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.бит_СвидетельстваОСмерти", ПараметрыМассив);
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаРедактированиеСвидетельстваОСмертиУправляемая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,, Новый ОписаниеОповещения("СвидетельствоОСмертиНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			
			ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаРедактированиеСвидетельстваОСмертиУправляемая", Новый Структура("ЗаполнитьИзСправочникаПроживающие", ПередаваемыеПараметры), ЭтаФорма); 
			
		КонецЕсли;
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвидетельствоОСмертиНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДопДанныхПриИзменении(Элемент)
	
	бит_ДобавлениеСпискаДопДанных(ДопДанныеПроживающих, Объект.Ссылка, ПериодДопДанных);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ТелефонПроживающегоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		Попытка
//			
//			бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//			
//		Исключение
//			
//			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала измените данные");
//			
//		КонецПопытки;
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ТелефонСлужебныйПроживающегоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		Попытка
//			
//			бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//			
//		Исключение
//			
//			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала измените данные");
//			
//		КонецПопытки;
//		
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура EmailПроживающегоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДругаяИнформацияПроживающегоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		
//		бит_УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//		
//	Иначе
//		
//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед изменением значения реквизита формы запишите элемент справочника, пожалуйста!");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

// БИТ_ЖКХ 09.10.2014 
// Меняем тип значения на Перечисление.ПолФизическогоЛица.
&НаКлиенте
Процедура ПолОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(ВыбранноеЗначение) = ТипЗнч(ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской")) Тогда
		СоответствиеПола = Новый Соответствие;
		
		СоответствиеПола.Вставить(ПредопределенноеЗначение("Перечисление.УдалитьПолФизическихЛиц.Мужской")      , ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"));
		СоответствиеПола.Вставить(ПредопределенноеЗначение("Перечисление.УдалитьПолФизическихЛиц.Женский")      , ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский"));
		СоответствиеПола.Вставить(ПредопределенноеЗначение("Перечисление.УдалитьПолФизическихЛиц.ПустаяСсылка") , ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.ПустаяСсылка"));
		
		ВыбранноеЗначение = СоответствиеПола[ВыбранноеЗначение];
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Пол = Новый СписокЗначений;
	Пол.Вставить(0,ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"),"Мужской");
	Пол.Вставить(1,ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский"),"Женский");
	
	ВыбранныйЭлемент = Неопределено;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПолНачалоВыбораЗавершение", ЭтотОбъект), Пол, Элементы.Пол);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		Объект.Пол = ВыбранныйЭлемент.Значение;
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 09.10.2014

// БИТ_ЖКХ 21.11.2014{{
&НаКлиенте
Процедура ЮрАдресПроживающегоОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Зайдите в форму ввода адреса чтобы очистить адрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ФактАдресПроживающегоОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Зайдите в форму ввода адреса чтобы очистить адрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформАдресПроживающегоОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Зайдите в форму ввода адреса чтобы очистить адрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнострАдресПроживающегоОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Зайдите в форму ввода адреса чтобы очистить адрес");
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПрибытияДрРегионОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Зайдите в форму ввода адреса чтобы очистить адрес");
	
КонецПроцедуры
// БИТ_ЖКХ 21.11.2014}}

#КонецОбласти

#Область ПроцедурыИФункцииПодсистемыКонтактнаяИнформация

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
    // 11.03.2019
    для каждого стр из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов цикл
	   если стр.Значение <> "" тогда 
		 если ПроверитьАдрес(стр.Значение) = ложь тогда
			стр.Значение = "";   
		 конецесли;	   
	   иначе
	   конецесли;	
	конеццикла;
	//-------------
	
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

 // 11.03.2019
Функция ЭтоМуниципальныйАдрес(ТипАдреса)
	Возврат СтрСравнить(ТипАдреса, "Муниципальный") = 0;
КонецФункции

&НаСервере
Функция ПроверитьАдрес (стр)
	
	    ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(стр, Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Сервис = АдресныйКлассификаторПовтИсп.СервисКлассификатора1С();
//      05.07.2019  !!!	
		ПрефиксВерсииЗапроса = АдресныйКлассификаторСлужебный.ПрефиксВерсииЗапроса();

	    HTTPЗапрос = Новый HTTPЗапрос(ПрефиксВерсииЗапроса + "verify");
	    ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	
	    АдресДляПроверки = Новый Структура();
		АдресДляПроверки.Вставить("key", "result");
		АдресДляПроверки.Вставить("typeToVerify", ?(ЭтоМуниципальныйАдрес(ДанныеАдреса.addressType), "MUNICIPAL", "ADMINISTRATIVE"));
		АдресДляПроверки.Вставить("addressToVerify", ДанныеАдреса);
		ДанныеЗапроса = Новый Массив;
		ДанныеЗапроса.Добавить(АдресДляПроверки);
		ДанныеДляЗапроса = Новый Структура("requests", ДанныеЗапроса);
		
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		HTTPЗапрос.Заголовки.Вставить("X-1C-Request-UID", ИдентификаторЗапроса);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтруктураВСтрокуJSON(ДанныеДляЗапроса));
		
		Попытка
			РезультатПроверки = Сервис.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			Результат = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		если РезультатПроверки.КодСостояния = 200 тогда
		   возврат истина;	
		иначе
		   возврат ложь;	
		конецесли	
	   
конецфункции	

Функция СтруктураВСтрокуJSON(Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Значение,, "АдаптацияПолейКонтактнойИнформации", АдресныйКлассификаторСлужебный);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции
//----------------------------------

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
//	
//	// БИТ_ЖКХ 16.08.2016 18:30:25 Начало правки... 
//	//УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
//	МодульУправлениеКонтактнойИнформациейКлиент =
//		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
//	
//	МодульУправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
//	// БИТ_ЖКХ 16.08.2016 18:30:27 Конец правки. 
//	 
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, , СтандартнаяОбработка);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
//	
//	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеОчистка(ЭтаФорма, Элемент.Имя);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
//	
//	Результат = УправлениеКонтактнойИнформациейКлиент.ПодключаемаяКоманда(ЭтаФорма, Команда.Имя);
//	ОбновитьКонтактнуюИнформацию(Результат);
//	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВводаАдреса(ЭтаФорма, Результат);
//	
//КонецПроцедуры

//&НаСервере
//Функция ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
//	
//	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтаФорма, Объект, Результат);
//	
//КонецФункции

//// БИТ_ЖКХ 31.12.2015 11:29:37 Начало правки...
//&НаСервере
//Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
//	
//	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтаФорма, Объект, Результат);
//	
//КонецФункции
//// БИТ_ЖКХ 31.12.2015 11:29:37 Конец правки.

&НаСервере
Процедура РазместитьКонтактнуюИнформацию()
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИсключаемыеВиды = Новый Массив;
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПроживающего);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ИнформАдресПроживающего);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресПроживающего);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресПроживающего);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ИнострАдресПроживающего);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.АдресУбытия);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПрибытия);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПрибытияДрРегион);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияПроживающего);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонПроживающего);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего);
	
	ДополнительныеПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметрыКонтактнойИнформации.ОтложеннаяИнициализация = Ложь;
	ДополнительныеПараметрыКонтактнойИнформации.ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ДополнительныеПараметрыКонтактнойИнформации.ИсключаемыеВиды = ИсключаемыеВиды;
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметрыКонтактнойИнформации);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	//// БИТ_ЖКХ 19.01.2015{{
	//// бит_УправлениеКонтактнойИнформациейБП.ПриСозданииНаСервере(ЭтаФорма, Объект, "Группа11", "", ТаблицаРазмещенияКИ);.
	//бит_УправлениеКонтактнойИнформациейНовый.бит_ПриСозданииНаСервере(ЭтаФорма, Объект, "Группа11", "");
	//// БИТ_ЖКХ 19.01.2015}}
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура считывает место рождения физлица.
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
&НаСервере
Процедура ПрочитатьМестоРождения()
	
	МестоРожденияФизЛица = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Объект.МестоРождения);
	
	Если Не ЗначениеЗаполнено(МестоРожденияФизЛица) Тогда
		
		МестоРожденияФизЛица = "Ввести место рождения";
		
	КонецЕсли;
	
КонецПроцедуры // ПрочитатьМестоРождения

// Процедура считывает ФИО физлица.
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
&НаСервере
Процедура ПрочитатьФИО()
	
	ФИОСрез = РегистрыСведений.бит_ФИОПроживающих.ПолучитьПоследнее( ,Новый Структура("ФизЛицо", Объект.Ссылка));
	
	Фамилия  = ФИОСрез.Фамилия;
	Имя      = ФИОСрез.Имя;
	Отчество = ФИОСрез.Отчество;
	
КонецПроцедуры // ПрочитатьМестоРождения

// Процедура записи ФИО.
//
&НаСервере
Процедура ЗаписатьДанныеФИО()
	
	ФИОСрез = РегистрыСведений.бит_ФИОПроживающих.ПолучитьПоследнее( ,Новый Структура("ФизЛицо", Объект.Ссылка));
	
	СтрокаСреза = ФИОСрез.Фамилия + ФИОСрез.Имя + ФИОСрез.Отчество;
	
	Если СтрокаСреза <> (Фамилия + Имя + Отчество) Тогда
		
		МенеджерЗаписи = РегистрыСведений.бит_ФИОПроживающих.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ФизЛицо = Объект.Ссылка;
		
		Если ПустаяСтрока(СтрокаСреза) Тогда
			
			МенеджерЗаписи.Период = '19000101';
			
		Иначе
			
			МенеджерЗаписи.Период = ТекущаяДата();
			
		КонецЕсли;
		
		МенеджерЗаписи.Фамилия  = Фамилия;
		МенеджерЗаписи.Имя      = Имя;
		МенеджерЗаписи.Отчество = Отчество;
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция обработки строки.
//
&НаСервере
Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер              = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		
		ИсходнаяСтрока = "";
		
		Возврат Буфер;
		
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока  = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

// БИТ_ЖКХ добавление кода Начало: 31.01.2011 
// БИТ_ЖКХ 31.01.2011 Процедура <Описание процедуры>.
// Формирование списка вида сведений на странице "дополнительные сведения".
&НаСервере
Процедура бит_ДобавлениеСпискаДопДанных(Знач ТабЗнач, Знач Ссылка, Знач ПериодДопДанных)
	
	СписокИсключений = Новый Массив;
	
	СписокИсключений.Добавить(ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.Должность);
	СписокИсключений.Добавить(ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.КогдаИОткудаПрибыл);
	СписокИсключений.Добавить(ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.МестоРаботы);
	СписокИсключений.Добавить(ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.ОтношениеКВоеннойСлужбе);
	СписокИсключений.Добавить(ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.РодЗанятий);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ДополнительныеДанныеОПроживающих.Ссылка КАК ВидСведений,
	|	ЕСТЬNULL(бит_ДопСведенияОПроживающихСрезПоследних.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих КАК бит_ДополнительныеДанныеОПроживающих
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДопСведенияОПроживающих.СрезПоследних(&Период, Проживающий.Ссылка = &Ссылка) КАК бит_ДопСведенияОПроживающихСрезПоследних
	|		ПО (бит_ДопСведенияОПроживающихСрезПоследних.ВидСведений = бит_ДополнительныеДанныеОПроживающих.Ссылка)
	|ГДЕ
	|	НЕ бит_ДополнительныеДанныеОПроживающих.Ссылка В (&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСведений";
	
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	Запрос.УстановитьПараметр("Период"          , ПериодДопДанных);
	Запрос.УстановитьПараметр("Ссылка"          , Ссылка);
	
	ТабЗначВрем = Запрос.Выполнить().Выгрузить();
	
	ДопДанныеПроживающих.Очистить();
	
	ДопДанныеПроживающих.Загрузить(ТабЗначВрем); 
	
КонецПроцедуры //битДобавлениеСпискаДопДанных()                        

// Процедура обновляет представления элемента.
//
&НаСервере
Процедура ОбновитьПредставлениеЭлемента(ИмяОбновляемогоЭлемента);
	
	ОбновитьНаборыЗаписейНаСервере();
	
	Если ИмяОбновляемогоЭлемента = "Гражданство" Тогда
		
		Если мНаборЗаписейГражданство.Количество() > 0 Тогда
			
			Гражданство       = "" + СокрЛП(мНаборЗаписейГражданство[0].Страна);
			ГражданствоСтрана = "" + мНаборЗаписейГражданство[0].Страна;
			
			Модифицированность = Истина;
			
		Иначе
			
			Гражданство = "Ввести данные о гражданстве";
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбновляемогоЭлемента = "ТрудоваяДеятельность" Тогда
		
		Если мНаборЗаписейТрудоваяДеятельность.Количество() > 0 Тогда
			
			СтруктураТрудоваяДеятельность = мНаборЗаписейТрудоваяДеятельность[0];
			
			Если СтруктураТрудоваяДеятельность.ВидыЗанятости = Перечисления.бит_ВидыЗанятостиПроживающих.Учащийся Тогда
				
				ТрудоваяДеятельность = "" + СтруктураТрудоваяДеятельность.ВидыЗанятости + " "
				+ СтруктураТрудоваяДеятельность.МестоРаботы + ", курс/ класс: "
				+ СтруктураТрудоваяДеятельность.КурсКласс;
				
				
			Иначе
				
				ТрудоваяДеятельность = "" + СтруктураТрудоваяДеятельность.ВидыЗанятости + " "
				+ СтруктураТрудоваяДеятельность.МестоРаботы + " с "
				+ Формат(СтруктураТрудоваяДеятельность.НачалоРаботы, "ДФ='дд ММММ гггг';ДП='...'") +  " по "
				+ Формат(СтруктураТрудоваяДеятельность.ОкончаниеРаботы, "ДФ='дд ММММ гггг';ДП='...'") + ", в должности : "
				+ СтруктураТрудоваяДеятельность.Должность;
				
			КонецЕсли; 
			
			ТрудоваяДеятельность = СтрЗаменить(ТрудоваяДеятельность,"Не указано","...");
			
			Модифицированность = Истина;
			
		Иначе
			
			ТрудоваяДеятельность = "Ввести данные о трудовой деятельности";
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбновляемогоЭлемента = "ВоинскийУчет" Тогда
		
		Если мНаборЗаписейВоинскийУчет.Количество() > 0 Тогда
			
			СтруктураВоинскийУчет = мНаборЗаписейВоинскийУчет[0];
			
			Если СтруктураВоинскийУчет.ОтношениеКВоинскойОбязанности = Перечисления.бит_ОтношениеКВоинскойОбязанности.НеВоеннообязанный Тогда
				
				ВоинскийУчет 	= СтруктураВоинскийУчет.ОтношениеКВоинскойОбязанности;
				
			Иначе
				
				ВоинскийУчет 	= "" + СтруктураВоинскийУчет.ОтношениеКВоинскойОбязанности
				+ ", Категория: " + СтруктураВоинскийУчет.КатегорияЗапаса
				+ ", Звание: " + СтруктураВоинскийУчет.Звание 
				+ ", Состав: " + СтруктураВоинскийУчет.Состав
				+ ", ВУС: " + СтруктураВоинскийУчет.ВУС + ", Годность: " 
				+ СтруктураВоинскийУчет.Годность + ", Военкомат: " 
				+ СтруктураВоинскийУчет.Военкомат 
				+ ", " + СтруктураВоинскийУчет.ОтношениеКВоинскомуУчету 
				+ ?(СтруктураВоинскийУчет.НаличиеМобпредписания, ", имеет мобпредписание", "")
				+", № команды: " + СтруктураВоинскийУчет.НомерКомандыПартии;
				
			КонецЕсли;
			
			ЭтаФорма.Модифицированность = Истина;
			
		Иначе 
			
			ЭтаФорма.ВоинскийУчет = "Ввести данные о воинском учете";
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбновляемогоЭлемента = "СвидетельствоОСмерти" Тогда
		
		Если мНаборЗаписейСвидетельстваОСмерти.Количество() > 0 Тогда
			
			Свидетельство = мНаборЗаписейСвидетельстваОСмерти[0];
			
			СвидетельствоОСмерти = "а/з " + Свидетельство.Номер + ", от " + Формат(Свидетельство.ДатаСоставления, "ДФ='дд ММММ гггг'; ДП='Не указано'") + ", " 
			+ ", свидетельство о смерти " + Свидетельство.СерияСвидетельства
			+ ", №" + Свидетельство.НомерСвидетельства + ", " + Свидетельство.КемВыдано 
			+ ", от " + Формат(Свидетельство.ДатаВыдачи, "ДФ='дд ММММ гггг'; ДП='Не указано'");
			
			СвидетельствоОСмерти = СтрЗаменить(СвидетельствоОСмерти,"Не указано","...");
			
			Модифицированность = Истина;
			
		Иначе
			
			СвидетельствоОСмерти = "Ввести данные об свидетельстве о смерти";
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбновляемогоЭлемента = "УдостоверениеЛичности" Тогда
		
		Если мНаборЗаписейДокументаУдостоверяющегоЛичность.Количество() > 0 Тогда
			
			Паспорт = мНаборЗаписейДокументаУдостоверяющегоЛичность[0];
			
			УдостоверениеЛичности = "" + Паспорт.ДокументВид + ", серия: " + Паспорт.ДокументСерия + ", № " + Паспорт.ДокументНомер 
			+ ", выдан: " + Формат(Паспорт.ДокументДатаВыдачи, "ДФ='дд ММММ гггг'; ДП='Не указано'") + " года, " 
			+ Паспорт.ДокументКемВыдан + ", № подр. " + Паспорт.ДокументКодПодразделения 
			+ Символы.Таб + "Дата регистрации по месту жительства: " + Формат(Паспорт.ДатаРегистрацииПоМестуЖительства, "ДФ='дд ММММ гггг'; ДП='Не указано'");
			
			УдостоверениеЛичности = СтрЗаменить(УдостоверениеЛичности, "Не указано", "...");
			
			Модифицированность = Истина;
			
		Иначе
			
			УдостоверениеЛичности = "Ввести данные об удостоверении личности";
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбновляемогоЭлемента = "ФИО" Тогда
		
		ПрочитатьФИО();
		
	ИначеЕсли ИмяОбновляемогоЭлемента = "Инвалидность" Тогда
		
		Если мНаборЗаписейИнвалидность.Количество() > 0 Тогда
			
			ЗаписьИзНабора = мНаборЗаписейИнвалидность[0];
			
			Если ЗаписьИзНабора.Инвалидность Тогда
				
				Инвалидность = 	"инвалид: " + ЗаписьИзНабора.ГруппаИнвалидности + " группы" 
				+ ", справка серия: " + ЗаписьИзНабора.СерияСправки + ", номер: " + ЗаписьИзНабора.НомерСправки 
				+ ", выдана: "  + Формат(ЗаписьИзНабора.ДатаВыдачи, "ДФ='дд ММММ гггг';ДП='...'") + " года "
				+ ", срок действия: " + Формат(ЗаписьИзНабора.СрокДействияСправки, "ДФ='дд ММММ гггг';ДП='...'") + " года ";
				
			Иначе
				
				Инвалидность = "Не является инвалидом";
				
			КонецЕсли;
			
			Модифицированность = Истина;
			
		Иначе
			
			Инвалидность = "Ввести данные об инвалидности";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура одновления ИНН организации.
//
&НаСервере
Функция ОбновитьИННОрганизаций()
	
	ТекстСообщения = "";
	
	ЗапросОрганизации = Новый Запрос;
	
	ЗапросОрганизации.УстановитьПараметр("ИндивидуальныйПредприниматель", Объект.Ссылка);
	ЗапросОрганизации.УстановитьПараметр("ИНН"                          , Объект.ИНН);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|ГДЕ
	|	Организации.ИндивидуальныйПредприниматель = &ИндивидуальныйПредприниматель И
	|	Организации.ИНН <> &ИНН";
	
	ЗапросОрганизации.Текст = ТекстЗапроса;
	
	ВыборкаЗапроса = ЗапросОрганизации.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ЗависимаяОрганизация = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		
		Если ВладелецФормы <> Неопределено И ТипЗнч(ВладелецФормы) = Тип("Форма") И ВладелецФормы.ЭтотОбъект.Ссылка = ЗависимаяОрганизация.Ссылка Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			
			ЗависимаяОрганизация.Заблокировать();
			
		Исключение
			
			ТекстСообщения = "Организация: " + ВыборкаЗапроса.Ссылка + " - объект заблокирован.";
			
			Возврат ТекстСообщения;
			
		КонецПопытки;
		
	КонецЦикла;	    
	
	ВыборкаЗапроса.Сбросить(); 
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ЗависимаяОрганизация = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		
		Если ВладелецФормы <> Неопределено И ТипЗнч(ВладелецФормы) = Тип("Форма") И ВладелецФормы.ЭтотОбъект.Ссылка = ЗависимаяОрганизация.Ссылка Тогда
			
			ВладелецФормы.ИНН = Объект.ИНН;
			
			Продолжить;
			
		КонецЕсли;
		
		ЗависимаяОрганизация.ИНН = Объект.ИНН;
		
		ЗависимаяОрганизация.Записать();
		
	КонецЦикла; 
	
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Функция ЗаписатьОбъектНаСервере()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	Попытка
		
		СправочникОбъект.Записать();
		
		Отказ = Ложь;
		
	Исключение
		
		Отказ = Истина;
		
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруРегистраСведеенийФИОПроживающихНаСервере(Знач Ссылка, Знач ФИО);
	
	ТаблицаРегистра = РегистрыСведений.бит_ФИОПроживающих.СрезПоследних( , Новый Структура("ФизЛицо", Ссылка));
	
	СтруктураРегистра = Новый Структура;
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
		
		СтруктураРегистра.Вставить("Период"  , ТаблицаРегистра[0].Период);
		СтруктураРегистра.Вставить("Фамилия" , ТаблицаРегистра[0].Фамилия);
		СтруктураРегистра.Вставить("Имя"     , ТаблицаРегистра[0].Имя);
		СтруктураРегистра.Вставить("Отчество", ТаблицаРегистра[0].Отчество);
		
	Иначе
		
		СтруктураРегистра.Вставить("Период"  , '19000101');
		СтруктураРегистра.Вставить("Фамилия" , ВыделитьСлово(ФИО));
		СтруктураРегистра.Вставить("Имя"     , ВыделитьСлово(ФИО));
		СтруктураРегистра.Вставить("Отчество", ВыделитьСлово(ФИО));
		
	КонецЕсли;
	
	Возврат СтруктураРегистра;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеИзКонтактнойИнформации(Тип, Вид)
	
	ТипВЗапросе = ПолучитьТипКонтактнойИнформации(Тип);
	ВидВЗапросе = ПолучитьВидКонтактнойИнформации(Вид);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
	|ГДЕ
	|	бит_КонтактнаяИнформация.Объект = &Объект
	|	И бит_КонтактнаяИнформация.Тип = &Тип
	|	И бит_КонтактнаяИнформация.Вид = &Вид");
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.УстановитьПараметр("Тип"   , ТипВЗапросе);
	Запрос.УстановитьПараметр("Вид"   , ВидВЗапросе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредставлениеАдреса = "";
	
	Если Выборка.Следующий() Тогда
		
		ПредставлениеАдреса = Выборка.Представление;
		
	КонецЕсли;
	
	Возврат ПредставлениеАдреса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипКонтактнойИнформации(Тип)
	
	Если Тип = "Адрес" Тогда
		
		ТипВЗапросе = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;
		
	ИначеЕсли Тип = "Телефон" Тогда
		
		ТипВЗапросе = Перечисления.бит_ТипыКонтактнойИнформации.Телефон;
		
	ИначеЕсли Тип = "АдресЭлектроннойПочты" Тогда
		
		ТипВЗапросе = Перечисления.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		
	ИначеЕсли Тип = "Другое" Тогда
		
		ТипВЗапросе = Перечисления.бит_ТипыКонтактнойИнформации.Другое;
		
	КонецЕсли;
	
	Возврат ТипВЗапросе;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидКонтактнойИнформации(Вид)
	
	Если Вид = "АдресПоПрописке" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего;
		
	ИначеЕсли Вид = "АдресПроживания" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ФактАдресПроживающего;
		
		
	ИначеЕсли Вид = "Телефон" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ТелефонПроживающего;
		
		
	ИначеЕсли Вид = "АдресДляИнформирования" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ИнформАдресПроживающего;
		
		
	ИначеЕсли Вид = "АдресЗапределамиРФ" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ИнострАдресПроживающего;
		
		
	ИначеЕсли Вид = "ТелефонСлужебный" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего;
		
		
	ИначеЕсли Вид = "Email" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.EmailПроживающего;
		
		
	ИначеЕсли Вид = "АдресПрибытияИзДругогоРегиона" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытияДрРегион;
		
		
	ИначеЕсли Вид = "ДругаяИнформация" Тогда
		
		ВидВЗапросе = Справочники.бит_ВидыКонтактнойИнформации.ДругаяИнформацияПроживающего;
		
	КонецЕсли;
	
	Возврат ВидВЗапросе;
	
КонецФункции

&НаСервере
Функция ПечатьДанныхПоФизлицуНаСервере()
	
	СтруктураДанных            = Новый Структура; 
	СтруктураДанныхОрганизации = Новый Структура; 
	
	Подробно = Истина;
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо"         , Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяСтрока"    , "");
	Запрос.УстановитьПараметр("ПустаяДата"      , Дата('00010101'));
	Запрос.УстановитьПараметр("Проведен"        ,Истина);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.ДатаРождения,
	|	ФизическиеЛица.МестоРождения,
	|	ФизическиеЛица.ИНН,
	|	ФизическиеЛица.Код,
	|	ФизическиеЛица.КодИМНС,
	|	ФизическиеЛица.Пол,
	|	ФизическиеЛица.СтраховойНомерПФР,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.Представление КАК ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ИЗ
	|	Справочник.бит_Проживающие КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО (ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &ФизЛицо";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДляПроверок = Результат.Выбрать();
	
	ВыборкаДляПроверок.Следующий();
	
	СтруктураДанных.Вставить("ФизическиеЛица", Результат.Выбрать());
	
	Если ВыборкаДляПроверок.ДокументВид <> Null Тогда
		
		СтруктураДанных.Вставить("ПаспортныеДанныеФизЛиц", Результат.Выбрать());
		
	КонецЕсли;
	
	// БИТ_ЖКХ 26.03.2015{{
	Если Объект.Ссылка.КонтактнаяИнформация.Количество() > 0 Тогда
		
		// Контактная информация.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеКонтактнаяИнформация.Тип КАК Тип,
		|	бит_ПроживающиеКонтактнаяИнформация.Вид КАК ВидКИ,
		|	бит_ПроживающиеКонтактнаяИнформация.Представление КАК ПредставлениеКИ
		|ИЗ
		|	Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
		|ГДЕ
		|	бит_ПроживающиеКонтактнаяИнформация.Ссылка = &ФизЛицо";
		
		Запрос.УстановитьПараметр("ФизЛицо", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СтруктураДанных.Вставить("КонтактнаяИнформация", ВыборкаДетальныеЗаписи);
		
	Иначе	
		
		// Контактная информация.
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	ВЫБОР КОГДА КонтактнаяИнформация.Вид ССЫЛКА Справочник.бит_ВидыКонтактнойИнформации ТОГДА
		|		КонтактнаяИнформация.Вид.Представление
		|	ИНАЧЕ
		|		КонтактнаяИнформация.Вид
		|	КОНЕЦ КАК ВидКИ,
		|	КонтактнаяИнформация.Представление КАК ПредставлениеКИ
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &ФизЛицо
		|УПОРЯДОЧИТЬ ПО
		|	Тип
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		СтруктураДанных.Вставить("КонтактнаяИнформация", Запрос.Выполнить().Выбрать());
		
	КонецЕсли;
	// БИТ_ЖКХ 26.03.2015}}	
	
	СтруктураДанных.Вставить("КонтактнаяИнформация", Запрос.Выполнить().Выбрать());
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ВыводитьНаПечать = Истина;
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ФизическиеЛица_ДанныеПоФизлицу";
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	Макет = СправочникОбъект.ПолучитьМакет("ДанныеПоФизлицу");
	
	Для Каждого СекцияДанных Из СтруктураДанных Цикл
		
		ИмяСекции = СекцияДанных.Ключ;
		
		УсловиеВыводаРаскрытойГруппы = ИмяСекции = "ФизическиеЛица";
		
		Выборка = СекцияДанных.Значение;
		
		Если ИмяСекции = "КонтактнаяИнформация" И НЕ Выборка.Количество() = 0 Тогда
			
			СекцияЗаголовка = Макет.ПолучитьОбласть("КонтактнаяИнформация_Заголовок");
			
			ТабДокумент.Вывести(СекцияЗаголовка);
			
			ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, , ТабДокумент.ВысотаТаблицы, ).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
			
			ТабДокумент.НачатьГруппуСтрок("", Ложь);
			
			Отбивка = Макет.ПолучитьОбласть("Отбивка");
			
			СекцияТипаКИ = Макет.ПолучитьОбласть("КонтактнаяИнформация_Тип");
			
			Пока Выборка.СледующийПоЗначениюПоля("Тип") Цикл
				
				ТабДокумент.Вывести(Отбивка);
				
				СекцияТипаКИ.Параметры.ТипКИ = Строка(Выборка.Тип) + ":";
				
				ТабДокумент.Вывести(СекцияТипаКИ);
				
				СекцияКИ = Макет.ПолучитьОбласть("КонтактнаяИнформация_Данные");
				
				Пока Выборка.СледующийПоЗначениюПоля("ВидКИ") Цикл
					
					СекцияКИ.Параметры.Заполнить(Выборка);
					
					ТабДокумент.Вывести(СекцияКИ);
					
				КонецЦикла;
				
			КонецЦикла; 
			
			ТабДокумент.Вывести(Отбивка);
			
			ТабДокумент.ЗакончитьГруппуСтрок();
			
		ИначеЕсли Макет.Области.Найти(ИмяСекции + "_Заголовок") <> Неопределено и Выборка.Следующий() Тогда
			
			Отбивка = ?(Макет.Области.Найти(ИмяСекции + "_Отбивка") <> Неопределено, Макет.ПолучитьОбласть(ИмяСекции + "_Отбивка"), Макет.ПолучитьОбласть("Отбивка"));
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Заголовок");
			
			Если ОбластьМакета.Области.Количество() = 1 Тогда
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, , ТабДокумент.ВысотаТаблицы, ).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
				
				ТабДокумент.НачатьГруппуСтрок("", УсловиеВыводаРаскрытойГруппы);
				
				ТабДокумент.Вывести(Отбивка);
				
			Иначе
				
				ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Заголовок_ПерваяСтрока");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, , ТабДокумент.ВысотаТаблицы, ).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
				
				ТабДокумент.НачатьГруппуСтрок("", УсловиеВыводаРаскрытойГруппы);
				
				ТабДокумент.Вывести(Отбивка);
				
				ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Заголовок_Остальное");
				
				Если ОбластьМакета.Параметры.Количество() = 0 Тогда // раскрашиваем заголовок без выведенных данных
					
					ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
					
				Иначе
					
					ОбластьМакета.Параметры.Заполнить(Выборка);
					
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ОбластьМакета.Параметры.Количество() = 0 Тогда // раскрашиваем заголовок без выведенных данных
					
					ТабДокумент.Область(ТабДокумент.ВысотаТаблицы - ОбластьМакета.ВысотаТаблицы + 1, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Данные");
			
			ОбластьМакета.Параметры.Заполнить(Выборка);
			
			Если ИмяСекции = "ФизическиеЛица" и НЕ ЗначениеЗаполнено(Выборка.Фамилия) Тогда
				
				Фамилия  = " "; 
				Имя      = " "; 
				Отчество = " ";
				
				бит_ОбщегоНазначения.ФамилияИнициалыФизЛица(СправочникОбъект, Фамилия, Имя, Отчество);
				
				ОбластьМакета.Параметры.Фамилия  = Фамилия;
				ОбластьМакета.Параметры.Имя      = Имя;
				ОбластьМакета.Параметры.Отчество = Отчество;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Пока Выборка.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(Выборка);
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			ТабДокумент.Вывести(Отбивка);
			
			ТабДокумент.ЗакончитьГруппуСтрок();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("СправочникОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаСервереБезКонтекста
Функция КлючЗаписиФИОПроживающихСуществует(ПередаваемыеПараметры)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ФИОПроживающих.Фамилия,
	|	бит_ФИОПроживающих.Имя,
	|	бит_ФИОПроживающих.Отчество
	|ИЗ
	|	РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
	|ГДЕ
	|	бит_ФИОПроживающих.Период = &Период
	|	И бит_ФИОПроживающих.ФизЛицо = &ФизЛицо");
	
	Запрос.УстановитьПараметр("Период" , ПередаваемыеПараметры.Период);
	Запрос.УстановитьПараметр("ФизЛицо", ПередаваемыеПараметры.ФизЛицо);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ОбновитьНаборыЗаписейНаСервере()
	
	мНаборЗаписейСвидетельстваОСмерти.Очистить();
	мНаборЗаписейДокументаУдостоверяющегоЛичность.Очистить();
	мНаборЗаписейГражданство.Очистить();
	мНаборЗаписейВоинскийУчет.Очистить();
	мНаборЗаписейТрудоваяДеятельность.Очистить();
	мНаборЗаписейИнвалидность.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ФизЛицо", Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СвидетельстваОСмерти.ФизЛицо,
	|	бит_СвидетельстваОСмерти.ДатаВыдачи,
	|	бит_СвидетельстваОСмерти.ДатаСмерти,
	|	бит_СвидетельстваОСмерти.ДатаСоставления,
	|	бит_СвидетельстваОСмерти.КемВыдано,
	|	бит_СвидетельстваОСмерти.Номер,
	|	бит_СвидетельстваОСмерти.НомерСвидетельства,
	|	бит_СвидетельстваОСмерти.СерияСвидетельства
	|ИЗ
	|	РегистрСведений.бит_СвидетельстваОСмерти КАК бит_СвидетельстваОСмерти
	|ГДЕ
	|	бит_СвидетельстваОСмерти.ФизЛицо = &ФизЛицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейСвидетельстваОСмерти.Добавить(), Выборка);
		
	КонецЕсли; 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортныеДанныеФизЛицСрезПоследних.Период,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументПричинаЗамены
	|ИЗ
	|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейДокументаУдостоверяющегоЛичность.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГражданствоФизЛицСрезПоследних.Период,
	|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
	|	ГражданствоФизЛицСрезПоследних.Страна
	|ИЗ
	|	РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейГражданство.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ВоинскийУчетСрезПоследних.Период КАК Период,
	|	бит_ВоинскийУчетСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскомуУчету,
	|	бит_ВоинскийУчетСрезПоследних.КатегорияЗапаса,
	|	бит_ВоинскийУчетСрезПоследних.Звание,
	|	бит_ВоинскийУчетСрезПоследних.Состав,
	|	бит_ВоинскийУчетСрезПоследних.ВУС,
	|	бит_ВоинскийУчетСрезПоследних.Годность,
	|	бит_ВоинскийУчетСрезПоследних.Военкомат,
	|	бит_ВоинскийУчетСрезПоследних.НаличиеМобпредписания,
	|	бит_ВоинскийУчетСрезПоследних.НомерКомандыПартии,
	|	бит_ВоинскийУчетСрезПоследних.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	бит_ВоинскийУчетСрезПоследних.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	бит_ВоинскийУчетСрезПоследних.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета
	|ИЗ
	|	РегистрСведений.бит_ВоинскийУчет.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ВоинскийУчетСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейВоинскийУчет.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.Период,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ФизЛицо,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.МестоРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.НачалоРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ОкончаниеРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.Должность,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.КурсКласс,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ВидыЗанятости,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.РодЗанятий
	|ИЗ
	|	РегистрСведений.бит_ТрудоваяДеятельностьПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ТрудоваяДеятельностьПроживающихСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейТрудоваяДеятельность.Добавить(), Выборка);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Период,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.СерияСправки,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.НомерСправки,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.ДатаВыдачи,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.ГруппаИнвалидности,
	|	СведенияОбИнвалидностиФизлицСрезПоследних.СрокДействияСправки
	|ИЗ
	|	РегистрСведений.бит_СведенияОбИнвалидностиПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК СведенияОбИнвалидностиФизлицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(мНаборЗаписейИнвалидность.Добавить(), Выборка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиСвидетельствоОСмертиСуществует(ПередаваемыеПараметры)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СвидетельстваОСмерти.ФизЛицо,
	|	бит_СвидетельстваОСмерти.ДатаВыдачи,
	|	бит_СвидетельстваОСмерти.ДатаСмерти,
	|	бит_СвидетельстваОСмерти.ДатаСоставления,
	|	бит_СвидетельстваОСмерти.КемВыдано,
	|	бит_СвидетельстваОСмерти.Номер,
	|	бит_СвидетельстваОСмерти.НомерСвидетельства,
	|	бит_СвидетельстваОСмерти.СерияСвидетельства
	|ИЗ
	|	РегистрСведений.бит_СвидетельстваОСмерти КАК бит_СвидетельстваОСмерти
	|ГДЕ
	|	бит_СвидетельстваОСмерти.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ПередаваемыеПараметры.ФизЛицо);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция КлючЗаписиВоинскийУчетСуществует(ПередаваемыеПараметры)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ВоинскийУчетСрезПоследних.Период КАК Период,
	|	бит_ВоинскийУчетСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскомуУчету,
	|	бит_ВоинскийУчетСрезПоследних.КатегорияЗапаса,
	|	бит_ВоинскийУчетСрезПоследних.Звание,
	|	бит_ВоинскийУчетСрезПоследних.Состав,
	|	бит_ВоинскийУчетСрезПоследних.ВУС,
	|	бит_ВоинскийУчетСрезПоследних.Годность,
	|	бит_ВоинскийУчетСрезПоследних.Военкомат,
	|	бит_ВоинскийУчетСрезПоследних.НаличиеМобпредписания,
	|	бит_ВоинскийУчетСрезПоследних.НомерКомандыПартии,
	|	бит_ВоинскийУчетСрезПоследних.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	бит_ВоинскийУчетСрезПоследних.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	|	бит_ВоинскийУчетСрезПоследних.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета
	|ИЗ
	|	РегистрСведений.бит_ВоинскийУчет.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ВоинскийУчетСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ПередаваемыеПараметры.ФизЛицо);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция КлючЗаписиТрудоваяДеятельностьПроживающихСуществует(ПередаваемыеПараметры)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.Период,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ФизЛицо,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.МестоРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.НачалоРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ОкончаниеРаботы,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.Должность,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.КурсКласс,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ВидыЗанятости,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.РодЗанятий
	|ИЗ
	|	РегистрСведений.бит_ТрудоваяДеятельностьПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ТрудоваяДеятельностьПроживающихСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ПередаваемыеПараметры.ФизЛицо);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    // СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	//+bit_semenov.v_19.11.2021
	бит_ЗаполнитьТЧПРедставителиДети();
	//-bit_semenov.v_19.11.2021

КонецПроцедуры

#КонецОбласти

//+bit_semenov.v_19.11.2021
&НаСервере
Процедура бит_ДоработатьФорму()
	
	Элементы.КонтактнаяИнформацияПолеЮрАдресПроживающего.Заголовок = "Адрес регистрации проживающего";
	Элементы.КонтактнаяИнформацияПолеФактАдресПроживающего.Заголовок = "Адрес фактического проживания";
	
	элАдресаСовпадают= Элементы.Добавить("бит_АдресаСовпадают", Тип("ПолеФормы"), Элементы.ГруппаКонтактнаяИнформацияПолеЮрАдресПроживающего);
	элАдресаСовпадают.Вид = ВидПоляФормы.ПолеФлажка;
    элАдресаСовпадают.Заголовок = "Адреса совпадают";
	элАдресаСовпадают.ПутьКДанным = "бит_АдресаСовпадают";
    элАдресаСовпадают.УстановитьДействие("ПриИзменении", "Бит_АдресаСовпадаютПриИзменении");
	
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеАдресПрибытия, Элементы.ГруппаКонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеАдресУбытия, Элементы.ГруппаКонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеИнформАдресПроживающего, Элементы.ГруппаКонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеИнострАдресПроживающего, Элементы.ГруппаКонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеТелефонПроживающего, Элементы.ГруппаКонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеТелефонСлужебныйПроживающего, Элементы.ГруппаКонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеEmailПроживающего, Элементы.ГруппаКонтактнаяИнформация);
	Элементы.Переместить(Элементы.ГруппаКонтактнаяИнформацияПолеДругаяИнформацияПроживающего, Элементы.ГруппаКонтактнаяИнформация);

	Элементы.ГруппаКонтактнаяИнформацияПолеАдресПрибытияДрРегион.Видимость = Ложь;	
КонецПроцедуры


&НаКлиенте
Процедура Бит_АдресаСовпадаютПриИзменении(Элемент)
	
	Если бит_АдресаСовпадают Тогда
		КонтактнаяИнформацияПолеФактАдресПроживающего = КонтактнаяИнформацияПолеЮрАдресПроживающего;
	Иначе 
		КонтактнаяИнформацияПолеФактАдресПроживающего = "";
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура бит_ЗаполнитьТЧПРедставителиДети()

	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить(Объект.бит_ЗаконныеПредставители);
	МассивТЧ.Добавить(Объект.бит_Дети);
	
	Для каждого ТЧ Из МассивТЧ Цикл
		бит_ЗаполнитьТЧПоФИО(ТЧ);
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура бит_ЗаполнитьТЧПоФИО(ТЧ)

	 Для каждого стрТЧ Из ТЧ Цикл
		 
		 ФИОУдостоверениеЛичности = "";

	 	 Паспорт = бит_ПолучитьУдостоверениеПроживающего(стрТЧ.Проживающий);
		 
		 Если Паспорт <> Неопределено Тогда
		      
			ФИОУдостоверениеЛичности = "" + Паспорт.ДокументВид + ", серия: " + Паспорт.ДокументСерия + ", № " + Паспорт.ДокументНомер 
			+ ", выдан: " + Формат(Паспорт.ДокументДатаВыдачи, "ДФ='дд ММММ гггг'; ДП='Не указано'") + " года, " 
			+ Паспорт.ДокументКемВыдан + ", № подр. " + Паспорт.ДокументКодПодразделения 
			+ Символы.Таб + "Дата регистрации по месту жительства: " + Формат(Паспорт.ДатаРегистрацииПоМестуЖительства, "ДФ='дд ММММ гггг'; ДП='Не указано'");
			
			ФИОУдостоверениеЛичности = СтрЗаменить(ФИОУдостоверениеЛичности, "Не указано", "...");
		Иначе 	
			ФИОУдостоверениеЛичности = "Не указано";
		КонецЕсли;
		
		стрТЧ.УдостоверениеЛичности = ФИОУдостоверениеЛичности;
	 КонецЦикла;

КонецПроцедуры 

&НаСервере
Функция бит_ПолучитьУдостоверениеПроживающего(Проживающий)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортныеДанныеФизЛицСрезПоследних.Период КАК Период,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументПричинаЗамены КАК ДокументПричинаЗамены
	|ИЗ
	|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо", Проживающий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.Количество() > 0 Тогда 
		Возврат Выборка
	Иначе 
		Возврат Неопределено
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура бит_ЗаконныеПредставителиПриИзменении(Элемент)
	бит_ЗаконныеПредставителиПриИзмененииСервер()
КонецПроцедуры

&НаСервере
Процедура бит_ЗаконныеПредставителиПриИзмененииСервер()
	бит_ЗаполнитьТЧПоФИО(Объект.бит_ЗаконныеПредставители);
КонецПроцедуры 

&НаКлиенте
Процедура бит_ДетиПриИзменении(Элемент)
	бит_ДетиПриИзмененииСервер()
КонецПроцедуры

&НаСервере
Процедура бит_ДетиПриИзмененииСервер()
	бит_ЗаполнитьТЧПоФИО(Объект.бит_Дети);
КонецПроцедуры 

&НаКлиенте
Процедура бит_ЗаконныеПредставителиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.бит_ЗаконныеПредставители.ТекущиеДанные;
	ТекущаяСтрокаИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	бит_ЗаконныеПредставителиОбработатьНаСервере(ТекущаяСтрокаИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЗаконныеПредставителиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.бит_ЗаконныеПредставители.ТекущиеДанные;
	ТекущаяСтрокаИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	бит_ЗаконныеПредставителиОбработатьНаСервере(ТекущаяСтрокаИдентификатор, Истина);
	
КонецПроцедуры

&НаСервере
Процедура бит_ЗаконныеПредставителиОбработатьНаСервере(ТекущаяСтрокаИдентификатор, УдалитьСтроку = Ложь)
	
	ТекущаяСтрока = Объект.бит_ЗаконныеПредставители.НайтиПоИдентификатору(ТекущаяСтрокаИдентификатор);
	
	бит_ЗаполнитьСвязанныхПредставителей(Объект.Ссылка, ТекущаяСтрока.Проживающий, УдалитьСтроку);
	
КонецПроцедуры

&НаСервере
Процедура бит_ЗаполнитьСвязанныхПредставителей(Проживающий, Представитель, УдалитьСтроку)
	
	ШаблонОшибкиЗаписать = НСтр("ru='Не удалось записать %Справочник%. %ОписаниеОшибки%'");
	ЗаписатьОбъект = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_Проживающиебит_Дети.Ссылка КАК Ссылка,
	|	бит_Проживающиебит_Дети.Проживающий КАК Проживающий
	|ИЗ
	|	Справочник.бит_Проживающие.бит_Дети КАК бит_Проживающиебит_Дети
	|ГДЕ
	|	бит_Проживающиебит_Дети.Ссылка = &Представитель
	|	И бит_Проживающиебит_Дети.Проживающий = &Проживающий";
	
	Запрос.УстановитьПараметр("Представитель", Представитель);
	Запрос.УстановитьПараметр("Проживающий", Проживающий);
	
	Если УдалитьСтроку Тогда
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МассивДляУдаления = Новый Массив;
		
		Если Выборка.Следующий() Тогда
			
			ПредставительОбъект = Представитель.ПолучитьОбъект();
			
			Для каждого стрТЧ Из ПредставительОбъект.бит_Дети Цикл
				
				Если стрТЧ.Проживающий = Выборка.Проживающий Тогда
					МассивДляУдаления.Добавить(стрТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого элМассива Из МассивДляУдаления Цикл
				ПредставительОбъект.бит_Дети.Удалить(элМассива);
			КонецЦикла;
			
		ЗаписатьОбъект = Истина;	
		КонецЕсли;
		
	Иначе
		
		Если Запрос.Выполнить().Пустой() Тогда
			
			ПредставительОбъект = Представитель.ПолучитьОбъект();
			
			НовСтрока = ПредставительОбъект.бит_Дети.Добавить();
			НовСтрока.Проживающий = Проживающий;
			
		КонецЕсли;	
		ЗаписатьОбъект = Истина;
	КонецЕсли;
	
	Если ЗаписатьОбъект Тогда
		
		Попытка
			ПредставительОбъект.Записать();
		Исключение
			ТекстОшибки = СтрЗаменить(ШаблонОшибкиЗаписать, "%Справочник%", Представитель);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Представитель);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура бит_ДетиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.бит_Дети.ТекущиеДанные;
	ТекущаяСтрокаИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	бит_ДетиОбработатьНаСервере(ТекущаяСтрокаИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ДетиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.бит_Дети.ТекущиеДанные;
	ТекущаяСтрокаИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	бит_ДетиОбработатьНаСервере(ТекущаяСтрокаИдентификатор, Истина);

КонецПроцедуры

&НаСервере
Процедура бит_ДетиОбработатьНаСервере(ТекущаяСтрокаИдентификатор, УдалитьСтроку = Ложь)

	ТекущаяСтрока = Объект.бит_Дети.НайтиПоИдентификатору(ТекущаяСтрокаИдентификатор);
	
	бит_ЗаполнитьСвязанныхДетей(Объект.Ссылка, ТекущаяСтрока.Проживающий, УдалитьСтроку);

КонецПроцедуры 

&НаСервере
Процедура бит_ЗаполнитьСвязанныхДетей(Проживающий, Ребенок, УдалитьСтроку)

	ШаблонОшибкиЗаписать = НСтр("ru='Не удалось записать %Справочник%. %ОписаниеОшибки%'");
	ЗаписатьОбъект = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_Проживающиебит_ЗаконныеПредставители.Ссылка КАК Ссылка,
	|	бит_Проживающиебит_ЗаконныеПредставители.Проживающий КАК Проживающий
	|ИЗ
	|	Справочник.бит_Проживающие.бит_ЗаконныеПредставители КАК бит_Проживающиебит_ЗаконныеПредставители
	|ГДЕ
	|	бит_Проживающиебит_ЗаконныеПредставители.Ссылка = &Ребенок
	|	И бит_Проживающиебит_ЗаконныеПредставители.Проживающий = &Проживающий";
	
	Запрос.УстановитьПараметр("Ребенок", Ребенок);
	Запрос.УстановитьПараметр("Проживающий", Проживающий);
	
	Если УдалитьСтроку Тогда
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МассивДляУдаления = Новый Массив;
		
		Если Выборка.Следующий() Тогда
			
			РебенокОбъект = Ребенок.ПолучитьОбъект();
			
			Для каждого стрТЧ Из РебенокОбъект.бит_ЗаконныеПредставители Цикл
				
				Если стрТЧ.Проживающий = Выборка.Проживающий Тогда
					МассивДляУдаления.Добавить(стрТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого элМассива Из МассивДляУдаления Цикл
				РебенокОбъект.бит_ЗаконныеПредставители.Удалить(элМассива);
			КонецЦикла;
			
		ЗаписатьОбъект = Истина;	
		КонецЕсли;
		
	Иначе
		
		Если Запрос.Выполнить().Пустой() Тогда
			
			РебенокОбъект = Ребенок.ПолучитьОбъект();
			
			НовСтрока = РебенокОбъект.бит_ЗаконныеПредставители.Добавить();
			НовСтрока.Проживающий = Проживающий;
			
			ЗаписатьОбъект = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ЗаписатьОбъект Тогда
		
		Попытка
			РебенокОбъект.Записать();
		Исключение
			ТекстОшибки = СтрЗаменить(ШаблонОшибкиЗаписать, "%Справочник%", Ребенок);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ребенок);
		КонецПопытки;
		
	КонецЕсли;


КонецПроцедуры 

//-bit_semenov.v_19.11.2021

&НаСервере
Процедура ОпределениеПола();
	
	Строка = Строка(Отчество);
        Строка = СокрЛП(Прав(Строка, 2));  
     Если Строка = "ич" Тогда
	   Объект.Пол = Перечисления.ПолФизическогоЛица.Мужской;
      Иначе
	Объект.Пол =  Перечисления.ПолФизическогоЛица.Женский;
	
КонецЕсли;
   
				   
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОпределениеПола();
КонецПроцедуры
