
#Область ЭкспортныеПроцедурыИФункции

// Процедура создает и заполняет документы начисления пени.
//
// Параметры:
// 		Индикатор - ЭлементФормы - показатель прогресса выполнения процедуры.
//		Надпись   - ЭлементФормы - текст. 
//
Процедура ВыполнитьНачисление(Индикатор,Улица,Здание)Экспорт	
	
	НачислятьПени   = НачислятьПени() ;
	
	Если Улица = Неопределено Или Улица = ПредопределенноеЗначение("Справочник.бит_СписокУлиц.ПустаяСсылка") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СписокУлиц.Ссылка КАК Улица,
		|	СписокДокументов.Ссылка КАК ДокументНачисления,
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_СписокУлиц КАК бит_СписокУлиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО бит_СписокУлиц.Ссылка = бит_ЛицевыеСчета.УлицаЛицевогоСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка КАК Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица КАК Улица
		|		ИЗ
		|			Документ.бит_НачислениеПениПоЛицевымСчетам КАК бит_НачислениеПениПоЛицевымСчетам
		|		ГДЕ
		|			бит_НачислениеПениПоЛицевымСчетам.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И бит_НачислениеПениПоЛицевымСчетам.ЗакрытиеПериода
		|			И бит_НачислениеПениПоЛицевымСчетам.Организация = &Организация
		|			И НЕ бит_НачислениеПениПоЛицевымСчетам.ПометкаУдаления
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица) КАК СписокДокументов
		|		ПО бит_СписокУлиц.Ссылка = СписокДокументов.Улица
		|ГДЕ
		|	бит_ЛицевыеСчета.Организация = &Организация
		|	И НЕ бит_ЛицевыеСчета.НеВестиРасчетПени
		|ИТОГИ ПО
		|	Улица,
		|	ДокументНачисления";
		
		Запрос.УстановитьПараметр("Дата",ДатаЗакрытия);
		Запрос.УстановитьПараметр("Организация",Организация);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СписокУлиц.Ссылка КАК Улица,
		|	СписокДокументов.Ссылка КАК ДокументНачисления,
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_СписокУлиц КАК бит_СписокУлиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО бит_СписокУлиц.Ссылка = бит_ЛицевыеСчета.УлицаЛицевогоСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка КАК Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица КАК Улица
		|		ИЗ
		|			Документ.бит_НачислениеПениПоЛицевымСчетам КАК бит_НачислениеПениПоЛицевымСчетам
		|		ГДЕ
		|			бит_НачислениеПениПоЛицевымСчетам.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И бит_НачислениеПениПоЛицевымСчетам.ЗакрытиеПериода
		|			И бит_НачислениеПениПоЛицевымСчетам.Организация = &Организация
		|			И НЕ бит_НачислениеПениПоЛицевымСчетам.ПометкаУдаления
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица) КАК СписокДокументов
		|		ПО бит_СписокУлиц.Ссылка = СписокДокументов.Улица
		|ГДЕ
		|	бит_ЛицевыеСчета.Организация = &Организация
		|	И НЕ бит_ЛицевыеСчета.НеВестиРасчетПени
		|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &Улица
		|ИТОГИ ПО
		|	Улица,
		|	ДокументНачисления";
		
		Запрос.УстановитьПараметр("Дата",ДатаЗакрытия);
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("Улица",Улица);
		
	КонецЕсли;	
	
	Если НачислятьПени Тогда
		
		ВыборкаУлиц = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не ВыборкаУлиц.Количество() = 0 Тогда
			ЗначениеИндикатора = 100/ВыборкаУлиц.Количество();
		Иначе
			ЗначениеИндикатора = 0;
		КонецЕсли;
		
		Пока ВыборкаУлиц.Следующий() Цикл
			
			УлицаЛС = ВыборкаУлиц.Улица;
			ВыборкаДокументов = ВыборкаУлиц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДокументов.Следующий() Цикл
				МассивЛС = Новый Массив;
				ВыборкаЛС = ВыборкаДокументов.Выбрать();
				Пока ВыборкаЛС.Следующий() Цикл
					МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет);					 
				КонецЦикла;
				
				Если ВыборкаДокументов.ДокументНачисления = Null Тогда
					
					НовыЙОбъект = Документы.бит_НачислениеПениПоЛицевымСчетам.СоздатьДокумент();
					//19.11.2019 
					НовыЙОбъект.Дата            = КонецДня(бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(ДатаЗакрытия, Организация)) - 43200;
					НовыЙОбъект.Организация     = Организация;
					НовыЙОбъект.Улица           = УлицаЛС;
					НовыЙОбъект.ЗакрытиеПериода = Истина;
					НовыЙОбъект.РассчитатьНачисленияПениПоЛицевымСчетам(МассивЛС);
					НовыЙОбъект.Комментарий		= "Документ сформирован автоматически обработкой ""Закрытие платежного периода""";
					
					Попытка
						Если НовыЙОбъект.ЛицевыеСчета.Количество() > 0 тогда	
							НовыЙОбъект.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;	
						
					Исключение
					КонецПопытки;
					
					Индикатор = Индикатор + ЗначениеИндикатора;
				Иначе
					
					ПолученныйОбъект = ВыборкаДокументов.ДокументНачисления.ПолучитьОбъект();
					ПолученныйОбъект.РассчитатьНачисленияПениПоЛицевымСчетам(МассивЛС);
					
					ПолученныйОбъект.Комментарий = "Документ сформирован автоматически обработкой ""Закрытие платежного периода""";
					
					Попытка
						ПолученныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						
					КонецПопытки;
				КонецЕсли;
				
				Индикатор = Индикатор + ЗначениеИндикатора;
				
			КонецЦикла; 
		КонецЦикла; 
		
	Иначе

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Начисление невозможно");
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция выполняет проверку настроек ЖКХ.
//
// Параметры:
// 		Нет.
//
// Возвращаемое значение:
//   булево   - флаг начисления пени.
//
Функция НачислятьПени()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	    , ДатаЗакрытия);
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.Текст  =
	"ВЫБРАТЬ
	|	НастройкаПараметровЖКХСрезПоследних.НачислятьПени КАК Начислять
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкаПараметровЖКХСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Начислять = Результат.Получить(Результат.Количество()-1).Начислять;
		
	Иначе
		
		Начислять = Ложь;
		
	КонецЕсли;
	
	Возврат Начислять;
	
КонецФункции

#КонецОбласти