
#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПередОткрытием" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вызов механизма разделения прав доступа.
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ТарифныеГруппыПоставщиков"));
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,СправочникОбъект,ЭтаФорма);	
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборГруппы();
КонецПроцедуры

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтборГруппы();
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля "Список".
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Перем ВыбЭлемент;
	
	Отказ = Истина;
	
	Если Копирование Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение4", ЭтотОбъект), "Ввод новой записи копированием запрещен!");
		Возврат;
	КонецЕсли;
	
	Если ПолучитьДокументОбъект(Отказ) Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение3", ЭтотОбъект), "Сначала необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая",,ЭтаФорма,,,, Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение2", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение4(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение3(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение2(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбЭлемент = Результат;
	
	Если ВыбЭлемент <> Неопределено Тогда
		
		ОбъектПоставщикаЭтоГруппа =                     ПолучитьОбъект(ВыбЭлемент);
		Если ОбъектПоставщикаЭтоГруппа Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение1", ЭтотОбъект), "В состав тарифной группы могут включаться только элементы поставщиков!");
		Иначе
			ТарифнаяГруппа = ПолучитьТарифнуюГруппу(ВыбЭлемент);
			Если ЗначениеЗаполнено(ТарифнаяГруппа) Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект, Новый Структура("ВыбЭлемент", ВыбЭлемент)), "Выбранный поставщик " + ВыбЭлемент + " уже входит в группу " + 
				ТарифнаяГруппа+". Включить ее текущую тарифную группу?",
				РежимДиалогаВопрос.ОКОтмена);
				Возврат;
			КонецЕсли;
			СписокПередНачаломДобавленияФрагмент(ВыбЭлемент);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение1(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбЭлемент = ДополнительныеПараметры.ВыбЭлемент;
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	СписокПередНачаломДобавленияФрагмент(ВыбЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияФрагмент(Знач ВыбЭлемент)
	
	ЗаписатьОбъект(ВыбЭлемент);
	УстановитьОтборГруппы();
	ЭтаФорма.Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	УстановитьОтборГруппы();
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура УбратьИзТарифнойГруппы(Команда)
	
	СсылкаПоставщика = Элементы.Список.ТекущаяСтрока;
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ПустаяСсылка = Элементы.Список.ТекущаяСтрока.Пустая();
		
		ЗаписатьПустуюСсылкуВОбъектПоставщикаНаСервере(СсылкаПоставщика,ПустаяСсылка);
		
	КонецЕсли;
	
	ЭтаФорма.Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура устанавливает отбор.
//
&НаКлиенте
Процедура УстановитьОтборГруппы()
	
	Если ЭтаФорма.Объект.Ссылка.Пустая() Тогда
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Код");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = "";
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		
		
	Иначе
		
		Эл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ТарифнаяГруппа");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = ЭтаФорма.Объект.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТарифнуюГруппу(ВыбЭлемент)
	
	Возврат  ВыбЭлемент.ТарифнаяГруппа;
	
КонецФункции

&НаСервере
Процедура ЗаписатьОбъект(ВыбЭлемент);
	ДокОбъект = ВыбЭлемент.ПолучитьОбъект();
	
	ДокОбъект.ТарифнаяГруппа = ЭтаФорма.Объект.Ссылка;
	ДокОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъект(ВыбЭлемент)
	
	ДокОбъект = ВыбЭлемент.ПолучитьОбъект();
	
	Возврат  ДокОбъект.ЭтоГруппа;
	
КонецФункции

&НаСервере
Функция ПолучитьДокументОбъект(Отказ)
	
	ДокОбъект = ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект.бит_ТарифныеГруппыПоставщиков") );
	
	Если Отказ = Истина Тогда
		
		Если ДокОбъект.ЭтоНовый() Тогда
			Возврат ДокОбъект.ЭтоНовый();
			
		КонецЕсли;
		
	Иначе
		ДокОбъект.Записать();
		
		ДокОбъект.Записать();
		Возврат Ложь;
		ЗначениеВДанныеФормы(ДокОбъект,Объект); 
		
	КонецЕсли;
	
	ЗначениеВДанныеФормы(ДокОбъект,Объект); 
	Возврат Ложь;
КонецФункции	

&НаСервере
Процедура ЗаписатьПустуюСсылкуВОбъектПоставщикаНаСервере(СсылкаПоставщика,ПустаяСсылка)
	
	ОбъектПоставщика = СсылкаПоставщика.ПолучитьОбъект();
	ОбъектПоставщика.ТарифнаяГруппа = ПустаяСсылка;
	ОбъектПоставщика.Записать();
	
КонецПроцедуры

#КонецОбласти
