
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Функция ПроверитьНевозможностьСохранения()
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Настр_БанковскийСчет) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Банковский счет");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Настр_БанковскийСчет");
		Возврат Истина;
	КонецЕсли;
	
	Если Настр_Программа = "" И НЕ ЗначениеЗаполнено(Настр_СоглашениеПрямогоОбменаСБанками) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "программа Клиента банка");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Настр_Программа");
		
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ Настр_ПлатежноеПоручение И НЕ Настр_ПлатежноеТребование Тогда
		ТекстСообщения = НСтр("ru = 'Не выбраны документы для выгрузки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Настр_ПлатежноеПоручение");
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Элементы.Настр_ФайлЗагрузки.Видимость = Форма.ВозможностьВыбораФайлов;
	Элементы.Настр_ФайлВыгрузки.Видимость = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьТаблицуПлатежныхДокументов(Знач ПлатежноеПоручение, Знач ПлатежноеТребование)
	
	ТаблицаДокументов = Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("Документ", ОбщегоНазначения.ОписаниеТипаСтрока(24));
	ТаблицаДокументов.Колонки.Добавить("Пометка",  Новый ОписаниеТипов("Булево"));
	
	СтрокаДокумента = ТаблицаДокументов.Добавить();
	СтрокаДокумента.Документ = "Платежное поручение";
	СтрокаДокумента.Пометка  = ПлатежноеПоручение;
	
	СтрокаДокумента = ТаблицаДокументов.Добавить();
	СтрокаДокумента.Документ = "Платежное требование";
	СтрокаДокумента.Пометка  = ПлатежноеТребование;
	
	Возврат ТаблицаДокументов;
	
КонецФункции

&НаСервере
Процедура ПолучитьДанные()
	
	//09.07.2019
	//Настройки = Обработки.бит_ЗагрузкаИзБанка.ПолучитьНастройкиПрограммыКлиентаБанка(Организация, Настр_БанковскийСчет);
	Настройки = Обработки.КлиентБанк.ПолучитьНастройкиПрограммыКлиентаБанка(Организация, Настр_БанковскийСчет);
	
	Настр_СоглашениеПрямогоОбменаСБанками            = Настройки.СоглашениеПрямогоОбменаСБанками;
	Настр_Кодировка                                  = Настройки.Кодировка = "DOS";
	Настр_Программа                                  = Настройки.Программа;
	Настр_ФайлВыгрузки                               = Настройки.ФайлВыгрузки;
	Настр_ФайлЗагрузки                               = Настройки.ФайлЗагрузки;
	//Настр_КонтролироватьОкончаниеНомера              = НЕ Настройки.НеКонтролироватьОкончаниеНомера;
	Настр_КонтролироватьНекорректныеСимволыВНомере   = Настройки.КонтролироватьНекорректныеСимволыВНомере;
	Настр_АвтоматическоеСозданиеНенайденныхЭлементов = Настройки.СоздаватьНенайденныеЭлементы;
	
	Настройки.Свойство("Платежное_поручение",  Настр_ПлатежноеПоручение);
	Настройки.Свойство("Платежное_требование", Настр_ПлатежноеТребование);
	
	Если ЗначениеЗаполнено(Настр_СоглашениеПрямогоОбменаСБанками) Тогда
		Элементы.ГруппаВидыОбмена.ТекущаяСтраница = Элементы.ГруппаПрямойОбмен;
		Элементы.ПлатежноеТребование.Доступность  = Ложь;
		ТекстНадписи = НСтр("ru = 'С банком %1 действует соглашение о прямом обмене. Отправка подписанных платежных документов и запрос банковской выписки осуществляется из 1С:Бухгалтерии'");
		// БИТ_ЖКХ 2015.08.24 Начало правки...
		//СообщениеПрямогоОбмена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНадписи, ОбщегоНазначения.ПолучитьЗначениеРеквизита(Настр_БанковскийСчет, "Банк"));
		СообщениеПрямогоОбмена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНадписи, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Настр_БанковскийСчет, "Банк"));
		// БИТ_ЖКХ 2015.08.24 Конец правки.
	Иначе
		Элементы.ГруппаВидыОбмена.ТекущаяСтраница = Элементы.ГруппаОбменЧерезФайл;
		Элементы.ПлатежноеТребование.Доступность  = Истина;
		СообщениеПрямогоОбмена                    = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Знач Организация, Знач БанковскийСчет, Знач Программа,
	Знач Кодировка, Знач ФайлВыгрузки, Знач ФайлЗагрузки,
	Знач КонтролироватьОкончаниеНомера, Знач КонтролироватьНекорректныеСимволыВНомере,
	Знач ПлатежноеПоручение, Знач ПлатежноеТребование, Знач АвтоматическоеСозданиеНенайденныхЭлементов)
	
	НастройкиОбменаСКлиентомБанка = РегистрыСведений.НастройкиОбменаСКлиентомБанка.СоздатьМенеджерЗаписи();
	НастройкиОбменаСКлиентомБанка.БанковскийСчет = БанковскийСчет;
	НастройкиОбменаСКлиентомБанка.Организация    = Организация;
	НастройкиОбменаСКлиентомБанка.Прочитать();
	
	ТаблицаДокументов = ЗаполнитьТаблицуПлатежныхДокументов(ПлатежноеПоручение, ПлатежноеТребование);
	
	НастройкиОбменаСКлиентомБанка.Организация                              = Организация;
	НастройкиОбменаСКлиентомБанка.БанковскийСчет                           = БанковскийСчет;
	НастройкиОбменаСКлиентомБанка.Программа                                = Программа;
	НастройкиОбменаСКлиентомБанка.Кодировка                                = ?(Кодировка, "DOS", "Windows");
	НастройкиОбменаСКлиентомБанка.ФайлВыгрузки                             = ФайлВыгрузки;
	НастройкиОбменаСКлиентомБанка.ФайлЗагрузки                             = ФайлЗагрузки;
	НастройкиОбменаСКлиентомБанка.ВидыВыгружаемыхПлатДокументов            = Новый ХранилищеЗначения(ТаблицаДокументов);
	
	// БИТ_ЖКХ 09.12.2014{{
	//НастройкиОбменаСКлиентомБанка.НеКонтролироватьОкончаниеНомера          = НЕ КонтролироватьОкончаниеНомера;
	//НастройкиОбменаСКлиентомБанка.КонтролироватьНекорректныеСимволыВНомере = КонтролироватьНекорректныеСимволыВНомере;
	//НастройкиОбменаСКлиентомБанка.ОтключитьАвтоматическоеСозданиеНенайденныхЭлементов = НЕ АвтоматическоеСозданиеНенайденныхЭлементов;
	// БИТ_ЖКХ 09.12.2014}}
	
	НастройкиОбменаСКлиентомБанка.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Настр_Программа.СписокВыбора.ЗагрузитьЗначения(
	УчетДенежныхСредствБП.СписокСовместимыхПрограммКлиентовБанка(Истина));
	
	Организация                                               = Параметры.Организация;
	Настр_ГруппаДляНовыхКонтрагентов                          = Параметры.ГруппаДляНовыхКонтрагентов;
	Настр_БанковскийСчет                                      = Параметры.БанковскийСчет;
	
	Настр_СтатьяДДССписаниеСРасчетногоСчета                   = Параметры.СтатьяДДССписаниеСРасчетногоСчета;
	Настр_СтатьяДДСПоступлениеНаРасчетныйСчет                 = Параметры.СтатьяДДСПоступлениеНаРасчетныйСчет;
	
	Настр_ПроводитьПриЗагрузкеСписаниеСРасчетногоСчета        = Параметры.ПроводитьПриЗагрузкеСписаниеСРасчетногоСчета;
	Настр_ПроводитьПриЗагрузкеПоступлениеНаРасчетныйСчет      = Параметры.ПроводитьПриЗагрузкеПоступлениеНаРасчетныйСчет;
	
	КритическоеИзменение = Ложь;
	
	ПолучитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВозможностьВыбораФайлов = ПодключитьРасширениеРаботыСФайлами();
	
	Если НЕ (ЗначениеЗаполнено(ЭтотОбъект.Настр_ФайлВыгрузки) ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Настр_ФайлЗагрузки)) Тогда
		#Если ВебКлиент Тогда
			Если ВозможностьВыбораФайлов Тогда
				
				Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
				ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
				ДиалогОткрытияФайла.ПолноеИмяФайла = "";
				ДиалогОткрытияФайла.Каталог = "";
				ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
				ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите путь к локальному кэшу файлов'");
				Если ДиалогОткрытияФайла.Выбрать() Тогда
					ИмяКаталога = ДиалогОткрытияФайла.Каталог;
					ИмяКаталога = ИмяКаталога
					// БИТ_ЖКХ 07.09.2016 16:06:26 Начало правки... 
					//+ ОбщегоНазначенияКлиентСервер.ПолучитьСлеш(ОбщегоНазначенияКлиентПовтИсп.ТипПлатформыКлиента());
					+ ПолучитьРазделительПути();
					// БИТ_ЖКХ 07.09.2016 16:06:28 Конец правки. 
					
					ЭтотОбъект.Настр_ФайлВыгрузки = ИмяКаталога + "1c_to_kl.txt";
					ЭтотОбъект.Настр_ФайлЗагрузки = ИмяКаталога + "kl_to_1c.txt";
				КонецЕсли;
				
			КонецЕсли;
		#Иначе
			ЭтотОбъект.Настр_ФайлВыгрузки = КаталогВременныхФайлов() + "1c_to_kl.txt";
			ЭтотОбъект.Настр_ФайлЗагрузки = КаталогВременныхФайлов() + "kl_to_1c.txt";
			Модифицированность = Истина;
		#КонецЕсли
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 07.09.2016 16:34:27 Начало правки... Защита серверного вызова, переход 8.3.8.
	Если ЗавершениеРаботы 
		И Модифицированность Тогда
		ТекстПредупреждения = НСтр("ru = 'Не сохраненные настройки будут потеряны.'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 07.09.2016 16:34:29 Конец правки. 
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Настройки были изменены, сохранить?'");
		
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Отказ = ПроверитьНевозможностьСохранения();
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ЗакрытьИСохранить(Неопределено);
	Иначе
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Настр_ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборФайлаДляВыгрузкиИЗагрузки(Элемент, НСтр("ru = 'загрузки'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_ФайлЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлДляПросмотра(Элемент, Объект.Кодировка, "Файл загрузки");
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_ФайлЗагрузкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	КритическоеИзменение = Истина;
	Настр_ФайлЗагрузки = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_ФайлВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборФайлаДляВыгрузкиИЗагрузки(Элемент, НСтр("ru = 'выгрузки'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_ФайлВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлДляПросмотра(Элемент, Объект.Кодировка, "Файл выгрузки");
	
КонецПроцедуры

// Открывает для просмотра текстовой документ
//
&НаКлиенте
Процедура ОткрытьФайлДляПросмотра(Элемент, Кодировка, Заголовок) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФайлНаДиске = Новый Файл(Элемент.ТекстРедактирования);
	Если НЕ ФайлНаДиске.Существует() Тогда
		ПоказатьПредупреждение(, "Не найден файл!");
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	Если Кодировка = "DOS" Тогда
		Кодир = "cp866";
	Иначе
		Кодир = "windows-1251";
	КонецЕсли;
	
	Текст.Прочитать(Элемент.ТекстРедактирования, Кодир);
	Текст.Показать(Заголовок, Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаДляВыгрузкиИЗагрузки(Элемент, Режим) Экспорт
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр                      = НСтр("ru = 'Текстовый файл'") + " (*.txt)|*.txt";
	ДиалогВыбора.Заголовок                   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Выберите файл для %1 данных из клиента банка'"), Режим);
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.Расширение                  = "txt";
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПолноеИмяФайла              = ?(ПустаяСтрока(Элемент.ТекстРедактирования),
	?(Режим = "выгрузки", "1c_to_kl.txt", "kl_to_1c.txt"), Элемент.ТекстРедактирования);
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбора.Выбрать() Тогда
		Если Режим = НСтр("ru = 'загрузки'") Тогда
			Настр_ФайлЗагрузки = ДиалогВыбора.ПолноеИмяФайла;
		Иначе
			Настр_ФайлВыгрузки = ДиалогВыбора.ПолноеИмяФайла;
		КонецЕсли;
		
		Модифицированность   = Истина;
		КритическоеИзменение = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_БанковскийСчетПриИзменении(Элемент)
	
	ПолучитьДанные();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_ПрограммаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("Заголовок, Список, ТекущаяСтрока",
	НСтр("ru = 'Выберите название программы'"),
	Элементы.Настр_Программа.СписокВыбора,
	?(Настр_Программа = "", "АРМ ""Клиент"" АС ""Клиент-Сбербанк"" Сбербанка России", Настр_Программа));
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("Настр_ПрограммаНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзСписка", СтруктураПараметров, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_ПрограммаНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ВыбранныйЭлемент = РезультатЗакрытия;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Настр_Программа    = ВыбранныйЭлемент;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_АвтоматическоеСозданиеНенайденныхЭлементовПриИзменении(Элемент)
	
	КритическоеИзменение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Настр_КодировкаПриИзменении(Элемент)
	
	КритическоеИзменение = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ЗакрытьИСохранить(Команда)
	
	Если ПроверитьНевозможностьСохранения() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиНаСервере(Организация, Настр_БанковскийСчет, Настр_Программа,
	Настр_Кодировка, Настр_ФайлВыгрузки, Настр_ФайлЗагрузки,
	Настр_КонтролироватьОкончаниеНомера, Настр_КонтролироватьНекорректныеСимволыВНомере,
	Настр_ПлатежноеПоручение, Настр_ПлатежноеТребование, Настр_АвтоматическоеСозданиеНенайденныхЭлементов);
	
	ИсходящиеПараметры = Новый Структура;
	ИсходящиеПараметры.Вставить("БанковскийСчет",                           Настр_БанковскийСчет);
	ИсходящиеПараметры.Вставить("ФайлВыгрузки",                             Настр_ФайлВыгрузки);
	ИсходящиеПараметры.Вставить("ФайлЗагрузки",                             Настр_ФайлЗагрузки);
	ИсходящиеПараметры.Вставить("Кодировка",                                ?(Настр_Кодировка, "DOS", "Windows"));
	ИсходящиеПараметры.Вставить("Программа",                                Настр_Программа);
	ИсходящиеПараметры.Вставить("ГруппаДляНовыхКонтрагентов",               Настр_ГруппаДляНовыхКонтрагентов);
	ИсходящиеПараметры.Вставить("ВыгружатьПлатежноеПоручение",              Настр_ПлатежноеПоручение);
	ИсходящиеПараметры.Вставить("ВыгружатьПлатежноеТребование",             Настр_ПлатежноеТребование);
	ИсходящиеПараметры.Вставить("НеКонтролироватьОкончаниеНомера",          НЕ Настр_КонтролироватьОкончаниеНомера);
	ИсходящиеПараметры.Вставить("КонтролироватьНекорректныеСимволыВНомере", Настр_КонтролироватьНекорректныеСимволыВНомере);
	ИсходящиеПараметры.Вставить("СтатьяДДССписаниеСРасчетногоСчета",        Настр_СтатьяДДССписаниеСРасчетногоСчета);
	ИсходящиеПараметры.Вставить("СтатьяДДСПоступлениеНаРасчетныйСчет",      Настр_СтатьяДДСПоступлениеНаРасчетныйСчет);
	ИсходящиеПараметры.Вставить("ПроводитьПриЗагрузкеСписаниеСРасчетногоСчета",
	Настр_ПроводитьПриЗагрузкеСписаниеСРасчетногоСчета);
	ИсходящиеПараметры.Вставить("ПроводитьПриЗагрузкеПоступлениеНаРасчетныйСчет",
	Настр_ПроводитьПриЗагрузкеПоступлениеНаРасчетныйСчет);
	ИсходящиеПараметры.Вставить("СоздаватьНенайденныеЭлементы",             Настр_АвтоматическоеСозданиеНенайденныхЭлементов);
	ИсходящиеПараметры.Вставить("КритическоеИзменение",                     КритическоеИзменение);
	
	Модифицированность = Ложь;
	
	Закрыть(ИсходящиеПараметры);
	
КонецПроцедуры

#КонецОбласти