
#Область ВложенияЭлектронныхПисем

// Открывает вложенный файл электронного письма.
//
// Параметры:
//  Ссылка  - СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы,.
//            СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.
//  Ссылка на файл, который необходимо открыть.
//
Процедура ОткрытьВложение(Ссылка, УникальныйИдентификаторФормы) Экспорт
	
	бит_ПрисоединенныеФайлыКлиент.ОткрытьФайл(бит_ПрисоединенныеФайлыСервер.ПолучитьДанныеФайла(Ссылка, УникальныйИдентификаторФормы));
	
КонецПроцедуры

// Открывает сохраняет файл электронного письма.
//
// Параметры:
//  Ссылка  - СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы,.
//            СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.
//  Ссылка на файл, который необходимо открыть.
//
Процедура СохранитьВложение(Ссылка, УникальныйИдентификаторФормы) Экспорт
	
	бит_ПрисоединенныеФайлыКлиент.СохранитьФайлКак(бит_ПрисоединенныеФайлыСервер.ПолучитьДанныеФайла(Ссылка, УникальныйИдентификаторФормы));
	
КонецПроцедуры

#КонецОбласти