
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	УправлениеВидимостью();
	Объект.ДлинаЛСЖил	= 12;
	Объект.ДлинаЛСНЖ	= 12;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравилаНумерацииЖил = "По номеру квартиры";

	ПравилаНумерацииНЖ = "По номеру квартиры";
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УлицаЛицевогоСчетаПриИзменении(Элемент)
	
	УлицаЛицевогоСчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	ЗданиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Улица", Объект.УлицаЛицевогоСчета);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыНомерЛСОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элементы.Квартиры.ТекущиеДанные.ЛС) Тогда
		
		СтандартнаяОбработка = ЛОЖЬ;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",Элементы.Квартиры.ТекущиеДанные.ЛС);
		
		ФормаЛС = ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаЭлементаУправляемая",ПараметрыФормы,Элемент);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыНомерЛСПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.Квартиры.ТекущиеДанные.ЛС) Тогда
		// Если ЛС уже есть, то менять его номер нельзя.
		Элементы.Квартиры.ТекущиеДанные.НомерЛС = Элементы.Квартиры.ТекущиеДанные.ЛС.Наименование;
	Иначе
		// Проверим уникальность номера лицевого счета.
		Если ЗначениеЗаполнено(Элементы.Квартиры.ТекущиеДанные.НомерЛС) Тогда
			НомерУникален = ИСТИНА;
			
			НайденыйЛС			= НайтиПоНаименованиюНаСервере(Элементы.Квартиры.ТекущиеДанные.НомерЛС);
			
			Если НЕ НайденыйЛС.Пустая() Тогда
				НомерУникален = ЛОЖЬ;
			Иначе
				Отбор = Новый Структура();
				Отбор.Вставить("НомерЛС",Элементы.Квартиры.ТекущиеДанные.НомерЛС);			
				НайденыеСтроки = Объект.Квартиры.НайтиСтроки(Отбор);
				Если НайденыеСтроки.Количество()>1 Тогда
					НомерУникален = ЛОЖЬ;
				КонецЕсли;
			КонецЕсли;
			Если НЕ НомерУникален Тогда
				Элементы.Квартиры.ТекущиеДанные.НомерЛС = "";

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("ЛС с таким номером уже есть");
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаНумерацииЖилОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ВыбранноеЗначение = мКэшЗначений.ВыбранныйЭлемент;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаНумерацииЖилНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Очистить();
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("Квартира","По номеру квартиры",,БиблиотекаКартинок.бит_ОПрограмме);
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("ПоПорядку","Последовательная нумерация",,БиблиотекаКартинок.бит_Реквизиты);
	
	ВыбранныйЭлемент = Неопределено;

	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПравилаНумерацииЖилНачалоВыбораЗавершение", ЭтотОбъект), Элементы.ПравилаНумерацииЖил.СписокВыбора, Элементы.ПравилаНумерацииЖил);

КонецПроцедуры

&НаКлиенте
Процедура ПравилаНумерацииЖилНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент = Неопределено Тогда
        
        Возврат;
        
    КонецЕсли;	
    
    ПравилаНумерацииЖилНаСервере(Строка(ВыбранныйЭлемент));
    
    УправлениеВидимостью();

КонецПроцедуры

&НаКлиенте
Процедура ПравилаНумерацииНЖНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ПравилаНумерацииНЖ.СписокВыбора.Очистить();
	Элементы.ПравилаНумерацииНЖ.СписокВыбора.Добавить("Квартира","По номеру квартиры",,БиблиотекаКартинок.бит_ОПрограмме);
	Элементы.ПравилаНумерацииНЖ.СписокВыбора.Добавить("ПоПорядку","Последовательная нумерация",,БиблиотекаКартинок.бит_Реквизиты);
	
	ВыбранныйЭлемент = Неопределено;

	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПравилаНумерацииНЖНачалоВыбораЗавершение", ЭтотОбъект), Элементы.ПравилаНумерацииНЖ.СписокВыбора, Элементы.ПравилаНумерацииНЖ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаНумерацииНЖНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент = Неопределено Тогда
        
        Возврат;
        
    КонецЕсли;	
    
    ПравилаНумерацииНЖНаСервере(Строка(ВыбранныйЭлемент));
    
    УправлениеВидимостью();

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура СоздатьЛС(Команда)
	
	СоздатьЛСНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	
	РаботаСФлажками(0);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	РаботаСФлажками(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	РаботаСФлажками(1);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНомера(Команда)
	
	УстановитьНомераНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура УстановитьНомераНаСервере()

	ТекущийНомерЖил = Объект.НачальныйНомерЛСЖил;
	ТекущийНомерНЖ = Объект.НачальныйНомерЛСНЖ;
	Для каждого Строка Из  Объект.Квартиры Цикл
		Если Строка.Обрабатывать И НЕ ЗначениеЗаполнено(Строка.ЛС) Тогда
			
			Если Строка.ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение Тогда			
				Пока ИСТИНА цикл
					Если ПравилаНумерацииЖил = "Последовательная нумерация" Тогда
						ПеременнаяЧастьНомера = Формат(ТекущийНомерНЖ,"ЧГ=0");
						ТекущийНомерНЖ		  = ТекущийНомерНЖ + 1;
					Иначе
						ПеременнаяЧастьНомера = СокрЛП(Формат(Строка.Квартира.НомерКвартиры,"ЧГ=0"));
					КонецЕсли;
					ДополнительныеНули	= Лев("000000000000", Объект.ДлинаЛСНЖ-СтрДлина(ПеременнаяЧастьНомера)-СтрДлина(Объект.ПрефиксЛСНЖ)-СтрДлина(Объект.ПостфиксНЖ));
					КандидатВНомера		= Объект.ПрефиксЛСНЖ + ДополнительныеНули + ПеременнаяЧастьНомера + Объект.ПостфиксНЖ;
					НайденыйЛС			= Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(КандидатВНомера);
					Если НайденыйЛС.Пустая() Тогда
						Прервать;
					Иначе
						Если ПравилаНумерацииЖил = "Последовательная нумерация" Тогда

							бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Номер "+КандидатВНомера+" пропущен, т.к. ЛС с таким номером уже есть");
							
						Иначе

							бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Номер "+КандидатВНомера+" не может быть использован т.к. ЛС с таким номером уже есть");
							
							КандидатВНомера = "";
							Прервать;
						КонецЕсли;
					КонецЕсли;					
				КонецЦикла;				
				Строка.НомерЛС = КандидатВНомера;
				Если СтрДлина(КандидатВНомера)>Объект.ДлинаЛСНЖ Тогда

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Внимание! Номер ЛС для квартиры "+Строка.Квартира+" превышает допустимые "+Объект.ДлинаЛСНЖ+" символов!");
					
				КонецЕсли;
			Иначе
				Пока ИСТИНА цикл
					Если ПравилаНумерацииЖил = "Последовательная нумерация" Тогда
						ПеременнаяЧастьНомера = Формат(ТекущийНомерЖил,"ЧГ=0");
						ТекущийНомерЖил		  = ТекущийНомерЖил + 1;
					Иначе
						ПеременнаяЧастьНомера = СокрЛП(Формат(Строка.Квартира.НомерКвартиры,"ЧГ=0"));
					КонецЕсли;
					ДополнительныеНули	= Лев("000000000000", Объект.ДлинаЛСЖил-СтрДлина(ПеременнаяЧастьНомера)-СтрДлина(Объект.ПрефиксЛСЖил) - СтрДлина(Объект.ПостфиксЖил));
					КандидатВНомера		= Объект.ПрефиксЛСЖил + ДополнительныеНули + ПеременнаяЧастьНомера + Объект.ПостфиксЖил;
					НайденыйЛС			= Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(КандидатВНомера);
					Если НайденыйЛС.Пустая() Тогда
						Прервать;
					Иначе
						Если ПравилаНумерацииЖил = "Последовательная нумерация" Тогда

							бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Номер "+КандидатВНомера+" пропущен, т.к. ЛС с таким номером уже есть");
							
						Иначе

							бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Номер "+КандидатВНомера+" не может быть использован т.к. ЛС с таким номером уже есть");
							
							КандидатВНомера = "";
							Прервать;
						КонецЕсли;
					КонецЕсли;					
				КонецЦикла;				
				Строка.НомерЛС = КандидатВНомера;
				Если СтрДлина(КандидатВНомера)>Объект.ДлинаЛСЖил Тогда

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Внимание! Номер ЛС для квартиры "+Строка.Квартира+" превышает допустимые "+Объект.ДлинаЛСЖил+" символов!");
					
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Если ПравилаНумерацииЖил = "Последовательная нумерация" Тогда
		Элементы.НачальныйНомерЛСЖил.Видимость = ИСТИНА;
	Иначе
		Элементы.НачальныйНомерЛСЖил.Видимость = ЛОЖЬ;
	КонецЕсли;
	
	Если ПравилаНумерацииНЖ = "Последовательная нумерация" Тогда
		Элементы.НачальныйНомерЛСНЖ.Видимость = ИСТИНА;
	Иначе
		Элементы.НачальныйНомерЛСНЖ.Видимость = ЛОЖЬ;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УлицаЛицевогоСчетаПриИзмененииНаСервере()
	
	Объект.Здание   = Справочники.бит_СписокЗданий.ПустаяСсылка();
	Объект.Квартиры.Очистить();

КонецПроцедуры

&НаСервере
Процедура СоздатьЛСНаСервере()

	Отказ = НЕ бит_ЗакрытыйСлужебныйСервер.ПродуктАктивирован();
	
	Если Отказ Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Система лицензирования не активирована.");
		
		Возврат;
	КонецЕсли; 
	
	КолЭлементов = 0;
	
	Для каждого Строка Из  Объект.Квартиры Цикл 
		
		Если Строка.Обрабатывать Тогда
			
			Если ЗначениеЗаполнено(Строка.ЛС) Тогда

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для квартиры "+Строка.Квартира+" уже создан лицевой счет № "+Строка.ЛС);
				
			ИначеЕсли ЗначениеЗаполнено(Строка.НомерЛС) Тогда
				НовыйЛС = Справочники.бит_ЛицевыеСчета.СоздатьЭлемент();
				НовыйЛС.Квартира = Строка.Квартира;
				НовыйЛС.Здание   = Объект.Здание;
				НовыйЛС.Организация = Объект.Здание.Организация;
				НовыйЛС.УлицаЛицевогоСчета = Объект.УлицаЛицевогоСчета;
				НовыйЛС.Наименование = Строка.НомерЛС;
				Попытка
					НовыйЛС.Записать();
					Строка.ЛС = НовыйЛС.Ссылка;
					Строка.Обрабатывать = ЛОЖЬ;
					КолЭлементов = КолЭлементов + 1;
				Исключение

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не удалось создать лицевой счет для квартиры "+Строка.Квартира+" по причине:");

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
					
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗданиеПриИзмененииНаСервере()

	Корпус   = Объект.Здание.Корпус;
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		ПодобратьКвартиры();
	Иначе
		Объект.Квартиры.Очистить();
	КонецЕсли;
	
	// Попробуем определить текущую длину префикса.
	ДлинаПрефикса = 0;
	Если Объект.Квартиры.Количество()>0 Тогда
		ДлинаПрефикса = СтрДлина(СокрЛП(Объект.Квартиры[0].НомерЛС));
	КонецЕсли;
	Если ДлинаПрефикса = 0 Тогда
		ДлинаПрефикса = 12;
	КонецЕсли;
	Объект.ДлинаЛСЖил	= ДлинаПрефикса;
	Объект.ДлинаЛСНЖ	= ДлинаПрефикса;
	
КонецПроцедуры

// Процедура - подбор квартир при выборе здания.
// Ищем все квартиры в заднии, если есть уже ЛС, то ищем и их.
//
&НаСервере
Процедура ПодобратьКвартиры()
	Объект.Квартиры.Очистить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	бит_Квартиры.Ссылка КАК Квартира,
	                      |	бит_Квартиры.НомерКвартиры,
	                      |	бит_ЛицевыеСчета.Ссылка КАК ЛС,
	                      |	бит_ЛицевыеСчета.Наименование КАК НомерЛС,
	                      |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры
	                      |ИЗ
	                      |	РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	                      |			ПО (бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка)
	                      |		ПО бит_СведенияОКвартиреСрезПоследних.Квартира = бит_Квартиры.Ссылка
	                      |ГДЕ
	                      |	бит_Квартиры.Владелец = &Здание");
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Объект.Квартиры.Загрузить(Запрос.Выполнить().Выгрузить());
	ПроставитьПризнакОбработки();
КонецПроцедуры

// Если ЛС для квартиры уже есть, то признак обработки не ставится.
//
&НаСервере
Процедура ПроставитьПризнакОбработки()
	Для каждого Строка Из  Объект.Квартиры Цикл
		Строка.Обрабатывать = НЕ ЗначениеЗаполнено(Строка.ЛС);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция НайтиПоНаименованиюНаСервере(НомерЛС)

	Возврат Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(НомерЛС);	
	
КонецФункции	

Процедура РаботаСФлажками(Режим)
	Для каждого Строка Из  Объект.Квартиры Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ЛС) Тогда
			Если Режим = 1 Тогда
				Строка.Обрабатывать = ИСТИНА;
			ИначеЕсли Режим = -1 Тогда
				Строка.Обрабатывать = ЛОЖЬ;
			ИначеЕсли Режим = 0 Тогда
				Строка.Обрабатывать = НЕ Строка.Обрабатывать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 
			
&НаСервере
Процедура ПравилаНумерацииЖилНаСервере(ВыбранныйЭлемент)

	ПравилаНумерацииЖил = ВыбранныйЭлемент;
	
КонецПроцедуры

&НаСервере
Процедура ПравилаНумерацииНЖНаСервере(ВыбранныйЭлемент)

	ПравилаНумерацииНЖ = ВыбранныйЭлемент;
	
КонецПроцедуры

#КонецОбласти