
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру исполнения отчета.
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт 
	
	Возврат Новый Структура("ИспользоватьВнешниеНаборыДанных,
							|ИспользоватьПередКомпоновкойМакета,
							|ИспользоватьПослеВыводаРезультата,
							|ИспользоватьДанныеРасшифровки",
							Ложь, Истина, Истина, Истина);
							
КонецФункции

// Получает текст заголовка.
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт 
	
	Возврат "Список первоначальной постановки на воинский учет от " + Формат(ПараметрыОтчета.Период, "ДФ=dd.MM.yyyy; ДП=...");
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет.
// Изменения сохранены не будут.
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Период"     , КонецДня(ПараметрыОтчета.Период) + 1);
	
	бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Организация", ПараметрыОтчета.Организация);
	
	бит_ОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
	// Установка параметра года рождения.
	бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ГодРождения", КонецДня(ПараметрыОтчета.Период));
	
	Отборы = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для каждого Отбор Из Отборы Цикл
		
		Если Отбор.Использование Тогда
			
			Представление = Строка(Отбор.ЛевоеЗначение);
			
			Если Найти(Представление, "ПроживающийВозвраст") > 0 Тогда
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Возвраст", Отбор.ПравоеЗначение);
				Запрос.УстановитьПараметр("Дата"    , ПараметрыОтчета.Период);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДОБАВИТЬКДАТЕ(&Дата, ГОД, &Возвраст * -1) КАК ГодРождения";
				Выборка = Запрос.Выполнить().Выбрать();
				Выборка.Следующий();
				
				бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ГодРождения", Выборка.ГодРождения);
				Возврат;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Обрабатывает результат отчета.
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт 
	
	бит_ОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
КонецПроцедуры

// Процедура используется подсистемой варианты отчетов.
//
Процедура НастройкиОтчета(Настройки) Экспорт
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Для Каждого Вариант Из Схема.ВариантыНастроек Цикл
		 Настройки.ОписаниеВариантов.Вставить(Вариант.Имя,Вариант.Представление);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
 
#КонецЕсли