#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет" ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Услуга"      ,"Услуга");
	СтруктураПолей.Вставить("Сумма"       ,"Сумма");
	// БИТ_ЖКХ 09.08.2016 18:04:52 Начало правки...
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	// БИТ_ЖКХ 09.08.2016 18:04:52 Конец правки.
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокЛС", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПроверитьДублиУслуг(ТаблицаПоУслугам, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ, Заголовок);
		
		бит_НачисленияЖКХ.СформироватьДвиженияВводаНачальныхОстатковПениПоКУХозрасчетный(ТаблицаПоУслугам,
																						СтруктураШапкиДокумента,
																						Движения,
																						Отказ);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗапролнитьСчета() Экспорт
		
	тмпСписокЛС = СписокЛС.ВыгрузитьКолонку("ЛицевойСчет");
	Колонки     = СписокЛС.ВыгрузитьКолонки().Колонки;
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(СписокЛС, Колонки, тмпСписокЛС, Организация , Дата, , Истина,,Истина);
		
КонецПроцедуры

#Область ОбеспечениеПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	РеквизитыТабСписокУслуг = "ЛицевойСчет,Услуга,Сумма"; 
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокЛС", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
КонецПроцедуры // ПроверкаРеквизитов()

// Процедура проверяет дубли строк
//
Процедура ПроверитьДублиУслуг(ТаблицаПоУслугам, Отказ, Заголовок)
	
	ТаблицаДублей = ТаблицаПоУслугам.Скопировать();
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1             ,"КоличествоПовторений");
	ТаблицаДублей.Свернуть("ЛицевойСчет,Услуга"   ,"КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке.
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			МассивСтрок = ТаблицаПоУслугам.НайтиСтроки(Новый Структура("ЛицевойСчет,Услуга", СтрокаТаблицыДублей.ЛицевойСчет,СтрокаТаблицыДублей.Услуга));
			
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""Лицевой счет"" и ""Услуга"" указаны одни и те же.";
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам,Отказ, Заголовок)
	
	ДатаДока = Дата;
	НачислениеПоПени = Движения.бит_НачислениеПениПоУслугамЖКХ;
	
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		
		Движение = НачислениеПоПени.Добавить();
		
		Если СтрокаТЧ.Сумма < 0 тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			мСумма = - СтрокаТЧ.Сумма;
		иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			мСумма =  СтрокаТЧ.Сумма;
		КонецЕсли;
		
		Движение.Период      = ДатаДока;
		Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
		Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
		Движение.СуммаПени   = мСумма;
		
		// БИТ_ЖКХ 29.05.2014	
		Движение.Организация   = СтруктураШапкиДокумента.Организация;
		// БИТ_ЖКХ 29.05.2014
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти	

#КонецЕсли