#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбеспеченияПроведенияДокумента

// Процедура заполняет движения документа.
//
Процедура ДвижениеДокументов(Таблица)
	
	Для каждого Строка Из Таблица Цикл
		
		Если ЗначениеЗаполнено(Строка.НоваяДатаПоверки) ИЛИ ВидОперации = Перечисления.бит_ВидыОперацииИзменениеДатыПоверки.СнятьДатуПоверки Тогда
			
			Движение = Движения.бит_ПоверкаСчетчиков.Добавить();
			Движение.Период        = Дата;
			Движение.ДатаПоверки   = Строка.НоваяДатаПоверки;
			Движение.Счетчик       = Строка.Счетчик;
			Движение.СнятНаПоверку = (ВидОперации = Перечисления.бит_ВидыОперацииИзменениеДатыПоверки.СнятьДатуПоверки);
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения". 
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Счетчик" ,"Счетчик");
	СтруктураПолей.Вставить("НоваяДатаПоверки" ,"НоваяДатаПоверки");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Счетчики", СтруктураПолей);
	ТаблицаУслуг              = РезультатЗапросаПоУслугам.Выгрузить();
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Счетчики", Новый Структура("Счетчик"), Отказ, Заголовок);
	
	Если Не Отказ Тогда
		
		ДвижениеДокументов(ТаблицаУслуг);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	ВидОперации   = Перечисления.бит_ВидыОперацииИзменениеДатыПоверки.УстановкаДатыПоверки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли


