
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Функция ПровестиДокумент(ПараметрКоманды)
	
	ДокументОбъект = ПараметрКоманды.ПолучитьОбъект();
	Попытка
		Если НЕ ДокументОбъект.ПроверитьЗаполнение() Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		НачатьТранзакцию();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

&НаСервере
Функция ПолучитьПараметрыДокумента(Ссылка)
	
	МетаданныеДокумента	= Ссылка.Метаданные();
	
	ЕстьРучнаяКорректировка	= бит_ОбщегоНазначения.ЕстьРеквизитДокумента("РучнаяКорректировка", МетаданныеДокумента);
	
	ИменаРеквизитов	= "Проведен, ПометкаУдаления";
	Если ЕстьРучнаяКорректировка Тогда
		ИменаРеквизитов	= ИменаРеквизитов + ", РучнаяКорректировка";
	КонецЕсли;
	
	Результат	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	Если НЕ ЕстьРучнаяКорректировка Тогда
		Результат.Вставить("РучнаяКорректировка", Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыДокумента = ПолучитьПараметрыДокумента(ПараметрКоманды);
	
	Если  НЕ ПараметрыДокумента.ПометкаУдаления 
		И НЕ ПараметрыДокумента.РучнаяКорректировка 
		И НЕ ПараметрыДокумента.Проведен Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Вставить(0, КодВозвратаДиалога.Да , "Провести");
		Кнопки.Вставить(1, КодВозвратаДиалога.Нет, "Отмена"  );
		
		Ответ = Неопределено;

		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды)), НСтр("ru = 'Перед просмотром проводок документ следует провести'"), Кнопки,, КодВозвратаДиалога.Да);
        Возврат;
		
	КонецЕсли;
	
	ОбработкаКомандыФрагмент(ПараметрКоманды, ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
    ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
    
    
    Ответ = РезультатВопроса;
    
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    ИначеЕсли Не ПровестиДокумент(ПараметрКоманды) Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(НСтр("ru = 'Не удалось провести документ'"));
		
        Возврат;
    КонецЕсли;
    
    
    ОбработкаКомандыФрагмент(ПараметрКоманды, ПараметрыВыполненияКоманды);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыФрагмент(Знач ПараметрКоманды, Знач ПараметрыВыполненияКоманды)
    
    Перем ПараметрыФормы;
    
    ПараметрыФормы = Новый Структура("ДокументСсылка", ПараметрКоманды);
    ОткрытьФорму("Обработка.бит_КорректировкаДвижений.Форма", 
    ПараметрыФормы, 
    ПараметрыВыполненияКоманды.Источник, 
    ПараметрКоманды);
    
КонецПроцедуры

#КонецОбласти