
&НаКлиенте
Процедура ЛицевойСчетПриИзменении1(Элемент)
	
	стр = ЛицевойСчетПриИзмененииНаСервере();	
	
	Если стр.Свойство("Улица") И стр.Свойство("НомерДома") И стр.Свойство("НомерКвартиры") Тогда
		Объект.Адрес = "" + стр.Улица + ", д. " + стр.НомерДома + ", кв. " + стр.НомерКвартиры;		
	КонецЕсли;
		
	Если стр.Свойство("Здание") Тогда
		Объект.Здание = стр.Здание;
	КонецЕсли;
	
	Если стр.Свойство("Квартира") Тогда
		Объект.Здание = стр.Квартира;
	КонецЕсли;
	
	Если стр.Свойство("СудебныйУчасток") Тогда
		Объект.Здание = стр.СудебныйУчасток;
	КонецЕсли;	
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЛицевойСчетПриИзмененииНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Квартира.Наименование КАК Квартира,
		|	бит_СписокЗданий.Наименование КАК НомерДома,
		|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица,
		|	бит_ЛицевыеСчета.Здание КАК Здание,
		|	бит_ЛицевыеСчета.Квартира КАК Квартира1,
		|	бит_СписокЗданий.СудебныйУчасток КАК СудебныйУчасток
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
		|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЛицевойСчет.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура();
	
	Если Выборка.Следующий() Тогда
		
		Результат.Вставить("Здание", Выборка.Здание);
		Результат.Вставить("НомерДома", Выборка.НомерДома);
		Результат.Вставить("Улица", Выборка.Улица);
		Результат.Вставить("НомерКвартиры", Выборка.Квартира);
		Результат.Вставить("Квартира", Выборка.Квартира1);
		Результат.Вставить("СудебныйУчасток", Выборка.СудебныйУчасток);
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


&НаСервере 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Подписант) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период",ТекущаяДата());
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ПодписантыСрезПоследних.ФИО КАК ФИО
		               |ИЗ
		               |	РегистрСведений.бит_Подписанты.СрезПоследних(&Период, ) КАК бит_ПодписантыСрезПоследних";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект.Подписант = Выборка.ФИО;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
			


	
	//Возврат
	
	
	
	
	//Если РезультатЗапроса.Пустой() Тогда
	//	
	//	Объект.Адрес = "";
	//	Объект.СудебныйУчасток = Справочники.бит_СудебныеУчастки.ПустаяСсылка();
	//	
	//Иначе
	//	
	//	
	//	Выборка.Следующий();
	//	
	//	ЭтаФорма.Объект.Адрес = "" + Выборка.Улица + ", д. " + Выборка.НомерДома + ", кв. " + Выборка.Квартира;
	//	ЭтаФорма.Объект.Здание = Выборка.Здание;
	//	ЭтаФорма.Объект.Квартира = Выборка.Квартира1;
	//	ЭтаФорма.Объект.СудебныйУчасток = Выборка.СудебныйУчасток;
	//	
	//КонецЕсли;

