
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Функция получает действие по представлению.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьДействиеПоПредставлению(Представление)
	
	Результат = Неопределено;
	
	Для каждого Элемент Из СписокДействий Цикл
		
		Если Элемент.Представление = Представление Тогда
			Результат = Элемент.Значение;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции // ()

&НаКлиенте
Процедура ОткрытьФормуВыбораТаблицы()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"               , Истина);
	ПараметрыФормы.Вставить("СписокВыбранных"           , СформироватьСписокВыбранных());
	ПараметрыФормы.Вставить("ТипОбъекта"                , ТипОбъекта);
	ПараметрыФормы.Вставить("ОбрабатыватьТабличныеЧасти", ОбрабатыватьТабличныеЧасти);
	
	ОткрытьФорму("Обработка.бит_ГрупповаяОбработкаСправочниковИДокументов.Форма.ФормаВыбораТаблицы", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры // ()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ОграничениеНаСтрокиНеограниченнойДлины = 999;
	
	СписокВыбора = Элементы.СписокДействий.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить("","<Выберите действие>");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если Не ОчищатьРезультаты() Тогда
		Возврат;
	КонецЕсли; 
	
	ТипОбъекта                 = ИсточникВыбора.ТипОбъекта;
	ОбрабатыватьТабличныеЧасти = ИсточникВыбора.ОбрабатыватьТабличныеЧасти;
	ТабличноеПолеВидыОбъектов.Очистить();
	
	Для каждого Значение Из ВыбранноеЗначение Цикл
		
		Строка = ТабличноеПолеВидыОбъектов.Добавить();
		Строка.ИмяТаблицы           = Значение.Значение;
		Строка.ПредставлениеТаблицы = Значение.Представление;
		
	КонецЦикла;
	
	ИнициализироватьСКД();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокДействийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		ТекущееДействие = ПолучитьДействиеПоПредставлению(ВыбранноеЗначение);
		
		Если ТекущееДействие = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		ПолеВводаДействия    = Неопределено;
		ТекущееПредставление = ТекущееДействие.ТекущееПредставление;
		
		ПолеВыбораДействия = ВыбранноеЗначение;
		
		Элементы.ПолеВводаДействия.ОграничениеТипа = ТекущееДействие.ПолеНастройки.ТипЗначения;
		ПолеВводаДействия = Элементы.ПолеВводаДействия.ОграничениеТипа.ПривестиЗначение(ПолеВводаДействия);
		
		УстановитьВидимостьКолонок();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ТабличноеПолеВидыОбъектов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОбрабатыватьТабличныеЧастиПриИзменении(Элемент)
	
	Если ОчищатьРезультаты() Тогда
		ТабличноеПолеВидыОбъектов.Очистить();
	Иначе
		Элемент.Значение = Не Элемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеВидыОбъектовПослеУдаления(Элемент)
	
	Если ОчищатьРезультаты() Тогда
		ИнициализироватьСКД();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипОбъекта = ВыбранноеЗначение Или Не ОчищатьРезультаты() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Отобрать(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Обработка;
	ОбновитьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТаблицы Из ТабличноеПолеДанных Цикл
		СтрокаТаблицы.Пометка = 0;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаТаблицы Из ТабличноеПолеДанных Цикл
		СтрокаТаблицы.Пометка = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	Если ТекущееДействие = Неопределено Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыполнитьДействиеЗавершение1", ЭтотОбъект), "Не выбрано действие для выполнения"); 
		Возврат;
	КонецЕсли;
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьДействиеЗавершение", ЭтотОбъект), "Выполнить """ + ТекущееДействие.ТекущееПредставление+ """?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеЗавершение1(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьДействиеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаДокументов

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТабличноеПолеДанных.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ",ТекущаяСтрока.Ш_Ссылка);
	
	// БИТ_ЖКХ 23.06.2014
	ИмяОбъекта = ОбъектыНаСервере(ТекущаяСтрока.Ш_ВидПредставление);
	
	Если ТипОбъекта = 0 Тогда
		
		Попытка
			ОткрытьФорму("Справочник." + ИмяОбъекта + ".Форма.ФормаЭлементаУправляемая", ПараметрыФормы);
		Исключение
			ОткрытьФорму("Справочник." + ИмяОбъекта + ".Форма.ФормаЭлемента", ПараметрыФормы);
		КонецПопытки;	
		
	Иначе	
		
		Попытка
			ОткрытьФорму("Документ." + ИмяОбъекта + ".Форма.ФормаДокументаУправляемая", ПараметрыФормы);
		Исключение
			ОткрытьФорму("Документ." + ИмяОбъекта + ".Форма.ФормаДокумента", ПараметрыФормы);
		КонецПопытки;	
		
	КонецЕсли;
	// БИТ_ЖКХ 23.06.2014
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТабличноеПолеВидыОбъектов

&НаКлиенте
Процедура ТабличноеПолеВидыОбъектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОткрытьФормуВыбораТаблицы();
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеВидыОбъектовПередНачаломИзменения(Элемент, Отказ)
	ОткрытьФормуВыбораТаблицы();
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеВидыОбъектовПередУдалением(Элемент, Отказ)
	
	Если Не ОчищатьРезультаты() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// Процедура обновляет таблицу документов. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьТаблицуДокументов()
	
	ОчиститьРезультаты();
	
	Если мСформированныйРежим = Неопределено Тогда
		ИнициализироватьСКД();
	КонецЕсли;
	
	Если мСформированныйРежим = Неопределено Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не выбрано ни одной таблицы");
		
		Возврат;
	КонецЕсли;
	
	мСформированныйРежим.ДанныеОтобраны = Истина;
	
	ЗаполнитьСписокДействий();
	
	ТаблицаКолонки = Новый ТаблицаЗначений;
	ТаблицаКолонки.Колонки.Добавить("Имя");
	ТаблицаКолонки.Колонки.Добавить("Тип");
	
	ТаблицаДанныхВрем = Новый ТаблицаЗначений;
	
	СтруктураНастроек = Обработки.бит_ГрупповаяОбработкаСправочниковИДокументов.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	Для каждого ЗапросПОбъекту Из мСформированныйРежим.масЗапросовПоОбъектам Цикл
		
		СтруктураНастроек.ОбязательныеПоля    = ЗапросПОбъекту.ОбязательныеПоля;
		СтруктураНастроек.ТекстЗапроса        = ЗапросПОбъекту.ТекстЗапросаОбъект;
		
		СтруктураРезультата = Обработки.бит_ГрупповаяОбработкаСправочниковИДокументов.ПодготовитьСтруктуруДанных(СтруктураНастроек);
		
		ТаблицаДанныхОбъекта = СтруктураРезультата.РезультатЗапроса.Выгрузить();
		
		Если ТаблицаДанныхВрем.Колонки.Количество() = 0 Тогда
			
			Для Каждого Колонка Из ТаблицаДанныхОбъекта.Колонки Цикл
				ТаблицаДанныхВрем.Колонки.Добавить(Колонка.Имя);
				новКол = ТаблицаКолонки.Добавить();
				новКол.Имя = Колонка.Имя;
				новКол.Тип = Колонка.ТипЗначения;
			КонецЦикла;
			
		Иначе
			
			Сч = 0;
			Для Каждого Колонка Из ТаблицаДанныхОбъекта.Колонки Цикл
				Стр = ТаблицаКолонки.Получить(Сч);
				ДобавитьВОписаниеТипа(Стр.Тип, Колонка.ТипЗначения);
				Сч = Сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого Стр Из ТаблицаДанныхОбъекта Цикл
			новСтр = ТаблицаДанныхВрем.Добавить();
			ЗаполнитьЗначенияСвойств(новСтр, Стр);
		КонецЦикла;
		
	КонецЦикла;
	
	// Добавим реквизиты и колонки.
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты   = Новый Массив;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	МассивТипов.Добавить(Тип("Null"));
	ОписаниеТипаБулево = Новый ОписаниеТипов(МассивТипов);
	
	Для каждого СтрокаТаблицы Из ТаблицаКолонки Цикл
		
		Если СтрокаТаблицы.Имя = "Ш_ВидПредставление" ИЛИ СтрокаТаблицы.Имя = "Ш_Вид" ИЛИ СтрокаТаблицы.Имя = "Т_ТЧ" Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрокаТаблицы.Тип = ОписаниеТипаБулево Тогда
			НовыйРеквизит = Новый РеквизитФормы(СтрокаТаблицы.Имя, Новый ОписаниеТипов("Булево"), Элементы.ТабличноеПолеДанных.Имя);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		Иначе
			НовыйРеквизит = Новый РеквизитФормы(СтрокаТаблицы.Имя, СтрокаТаблицы.Тип, Элементы.ТабличноеПолеДанных.Имя);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		КонецЕсли; 
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	УдаляемыеЭлементыФормы = Новый Массив;
	
	Для каждого Реквизит Из ДобавляемыеРеквизиты Цикл
		
		Синоним = мСформированныйРежим.СписокПредставлений.НайтиПоЗначению(Реквизит.Имя);
		
		ПутьКДанным = "" + Элементы.ТабличноеПолеДанных.Имя + "." + Реквизит.Имя;
		
		ЭУ = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), Элементы.ТабличноеПолеДанных);
		ЭУ.ПутьКДанным = ПутьКДанным;
		ЭУ.Заголовок   = Синоним;
		
		Если Реквизит.ТипЗначения = Новый ОписаниеТипов("Булево") Тогда
			ЭУ.Вид = ВидПоляФормы.ПолеФлажка;
		Иначе
			ЭУ.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли; 
		ЭУ.Видимость      = Ложь;
		ЭУ.ТолькоПросмотр = Истина;
		ЭУ.ЦветФона       = ЦветаСтиля.ЦветФонаПоля;
		ЭУ.ШрифтЗаголовка = Новый Шрифт("MS Shell Dlg", 8, Истина);
		
		УдаляемыеРеквизиты.Добавить(ПутьКДанным);
		УдаляемыеЭлементыФормы.Добавить(ЭУ.Имя);
		
	КонецЦикла;
	
	мСформированныйРежим.Вставить("УдаляемыеРеквизиты"    , УдаляемыеРеквизиты);
	мСформированныйРежим.Вставить("УдаляемыеЭлементыФормы", УдаляемыеЭлементыФормы);
	
	// Добавление данных.
	Для Каждого Стр Из ТаблицаДанныхВрем Цикл
		новСтр = ТабличноеПолеДанных.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, Стр);
		новСтр.Пометка = Истина;
	КонецЦикла;
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры // () 

&НаСервере
Процедура ДобавитьВОписаниеТипа(Куда, Откуда)
	
	// Получим квалификаторы числа для нового типа.
	Длина1 = 0;
	Длина2 = 0;
	Точность1 = 0;
	Точность2 = 0;
	ПолучитьИзКвалификатораЧисла(Куда,   Длина1, Точность1);
	ПолучитьИзКвалификатораЧисла(Откуда, Длина2, Точность2);
	Точность = Макс(Точность1, Точность2);
	Длина = Макс(Длина1 - Точность1, Длина2 - Точность2) + Точность;
	Если Длина = 0 Тогда
		КЧ = Неопределено;
	Иначе
		КЧ = Новый КвалификаторыЧисла(Длина, Точность);
	КонецЕсли;
	
	// Получим квалификаторы строки для нового типа.
	ЕстьСтрока1 = Ложь;
	ЕстьСтрока2 = Ложь;
	Длина1 = 0;
	Длина2 = 0;
	ПолучитьИзКвалификатораСтроки(Куда,   ЕстьСтрока1, Длина1);
	ПолучитьИзКвалификатораСтроки(Откуда, ЕстьСтрока2, Длина2);
	Если (ЕстьСтрока1 И (Длина1 = 0)) ИЛИ (ЕстьСтрока2 И (Длина2 = 0)) Тогда
		КС = Новый КвалификаторыСтроки(0);
	ИначеЕсли Не ЕстьСтрока1 И Не ЕстьСтрока2 Тогда
		КС = Неопределено;
	Иначе
		КС = Новый КвалификаторыСтроки(Макс(Длина1, Длина2));
	КонецЕсли;
	
	// Получим квалификаторы даты для нового типа.
	ЕстьДата1  = Ложь;
	ЕстьВремя1 = Ложь;
	ЕстьДата2  = Ложь;
	ЕстьВремя2 = Ложь;
	ПолучитьИзКвалификатораЧастиДаты(Куда,   ЕстьДата1, ЕстьВремя1);
	ПолучитьИзКвалификатораЧастиДаты(Откуда, ЕстьДата2, ЕстьВремя2);
	ЕстьДата  = ЕстьДата1  ИЛИ ЕстьДата2;
	ЕстьВремя = ЕстьВремя1 ИЛИ ЕстьВремя2;
	Если ЕстьДата И ЕстьВремя Тогда
		КД = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	ИначеЕсли ЕстьДата И Не ЕстьВремя Тогда
		КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ИначеЕсли Не ЕстьДата И ЕстьВремя Тогда
		КД = Новый КвалификаторыДаты(ЧастиДаты.Время);
	Иначе
		КД = Неопределено;
	КонецЕсли;
	
	Куда = Новый ОписаниеТипов(Куда, Откуда.Типы(), , КЧ, КС, КД);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПолучитьИзКвалификатораЧисла(ОписаниеТипа, Длина, Точность)
	
	Если ОписаниеТипа.СодержитТип(Тип("Число")) Тогда
		Длина    = ОписаниеТипа.КвалификаторыЧисла.Разрядность; 
		Точность = ОписаниеТипа.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПолучитьИзКвалификатораСтроки(ОписаниеТипа, ЕстьСтрока, Длина)
	
	ЕстьСтрока = ОписаниеТипа.СодержитТип(Тип("Строка"));
	Если ЕстьСтрока Тогда
		Длина = ОписаниеТипа.КвалификаторыСтроки.Длина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПолучитьИзКвалификатораЧастиДаты(ОписаниеТипа, ЕстьДата, ЕстьВремя)
	
	Если Не ОписаниеТипа.СодержитТип(Тип("Дата")) Тогда
		Возврат;
	КонецЕсли;
	
	Части = ОписаниеТипа.КвалификаторыДаты.ЧастиДаты;
	Если Части = ЧастиДаты.Время Тогда
		ЕстьВремя = Истина;
	ИначеЕсли Части = ЧастиДаты.Дата Тогда
		ЕстьДата  = Истина;
	Иначе
		ЕстьВремя = Истина;
		ЕстьДата  = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура заполняет список действий. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьСписокДействий()
	
	Элементы.СписокДействий.СписокВыбора.Очистить();
	
	СписокВыбора = Элементы.СписокДействий.СписокВыбора;
	
	СписокДействий.Очистить();
	
	Если мСформированныйРежим = Неопределено ИЛИ Не мСформированныйРежим.ДанныеОтобраны Тогда
		Возврат;
	КонецЕсли; 
	
	КоллекцияПолей = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора;
	
	Для каждого ПредопределенныйРеквизит Из мСформированныйРежим.ПредопределенныеРеквизиты Цикл
		
		ДоступноеПолеВыбора = КоллекцияПолей.НайтиПоле(ПредопределенныйРеквизит.Значение.ПолеКомпоновкиДанных);
		
		Если НЕ ДоступноеПолеВыбора = Неопределено Тогда
			
			Представление = "Изменить: [" + ПредопределенныйРеквизит.Представление + "]";
			
			ПолеНастройки = Новый Структура;
			ПолеНастройки.Вставить("Имя"          , ПредопределенныйРеквизит.Значение.Имя);
			ПолеНастройки.Вставить("Представление", Представление);
			ПолеНастройки.Вставить("ТипЗначения"  , ДоступноеПолеВыбора.ТипЗначения);
			ПолеНастройки.Вставить("ПутьКДанным"  , ПредопределенныйРеквизит.Значение.Имя);
			
			СписокДействий.Добавить(Новый Структура("Имя,ПолеНастройки",ПредопределенныйРеквизит.Значение.Имя,ПолеНастройки),Представление);
			СписокВыбора.Добавить(Представление,Представление);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если мСформированныйРежим.ИмяВидаОдногоТипа = "бит_ОплатаКУ" Тогда
		
		Представление = "Изменить: [Проведение документа и распределение сумм]";
		ПолеНастройки = Новый Структура;
		ПолеНастройки.Вставить("Имя"          , "Ш_Проведен");
		ПолеНастройки.Вставить("Представление", Представление);
		ПолеНастройки.Вставить("ПутьКДанным"  , "Ш_Проведен");
		ПолеНастройки.Вставить("ЭтоОплата"    , Истина);
		ПолеНастройки.Вставить("ТипЗначения"  , Новый ОписаниеТипов("Булево"));
		
		СписокДействий.Добавить(Новый Структура("Имя, ПолеНастройки",ПолеНастройки.Имя, ПолеНастройки), Представление);
		СписокВыбора.Добавить(Представление,Представление);
		
		//16.04.2019
		Представление = "Изменить: [Проведение документа и распределение сумм с учетом начислений за месяц]";
		ПолеНастройки = Новый Структура;
		ПолеНастройки.Вставить("Имя"          , "Ш_Проведен");
		ПолеНастройки.Вставить("Представление", Представление);
		ПолеНастройки.Вставить("ПутьКДанным"  , "Ш_Проведен");
		ПолеНастройки.Вставить("ЭтоОплата"    , Истина);
		ПолеНастройки.Вставить("ТипЗначения"  , Новый ОписаниеТипов("Булево"));
		
		СписокДействий.Добавить(Новый Структура("Имя, ПолеНастройки",ПолеНастройки.Имя, ПолеНастройки), Представление);
		СписокВыбора.Добавить(Представление,Представление);

		
	КонецЕсли; 
	
	Для каждого Элемент Из СписокДействий Цикл
		Элемент.Значение.Вставить("ТекущееПредставление",Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры // () 

&НаСервере
Процедура УстановитьВидимостьКолонок()
	
	Если мСформированныйРежим = Неопределено ИЛИ Не мСформированныйРежим.ДанныеОтобраны Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементФормы Из мСформированныйРежим.УдаляемыеЭлементыФормы Цикл
		
		Колонка = Элементы[ЭлементФормы];
		Колонка.Видимость = Объект.ПоказыватьВсеКолонки ИЛИ мСформированныйРежим.ОтображаемыеКолонки.Свойство(Колонка.Имя);
		
		Если НЕ ТекущееДействие = Неопределено И Колонка.Имя = ТекущееДействие.Имя Тогда
			
			Колонка.Видимость = Истина;
			Колонка.ЦветФона = WebЦвета.БледноБирюзовый;
			
		ИначеЕсли НЕ ТекущееДействие = Неопределено 
			И ТекущееДействие.ПолеНастройки.Свойство("ЭтоОплата") 
			И (Колонка.Имя = "Ш_ВводВРучную" ИЛИ Колонка.Имя = "Ш_Проведен")
			И мСформированныйРежим.ИмяВидаОдногоТипа = "бит_ОплатаКУ"  Тогда
			
			Колонка.Видимость = Истина;
			Колонка.ЦветФона = WebЦвета.БледноБирюзовый;
			
		Иначе
			Колонка.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура выполняет действие.
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура ВыполнитьДействиеНаСервере()
	
	ПолеНастройки = Неопределено;
	ПутьКДанным = ?(ТекущееДействие.Свойство("ПолеНастройки",ПолеНастройки) И Не ПолеНастройки = Неопределено,ПолеНастройки.ПутьКДанным,Неопределено);
	ИмяПоляРеквизита1 = ПутьКДанным;
	
	//16.04.2019
	Представление = ТекущееДействие.ТекущееПредставление; 
	
	ПозТЧК = Найти(ИмяПоляРеквизита1,".");
	Если Не ПозТЧК = 0 Тогда
		ИмяРеквизита2     = Сред(ИмяПоляРеквизита1,ПозТЧК+1);
		ИмяПоляРеквизита1 = Лев(ИмяПоляРеквизита1,ПозТЧК-1);
	Иначе
		ИмяРеквизита2 = Неопределено;
	КонецЕсли; 
	ИмяРеквизита1 = Сред(ИмяПоляРеквизита1,3);
	
	ЭтоДействиеСШапкой           = (ПутьКДанным = Неопределено) Или Не Лев(ПутьКДанным,2) = "Т_";
	ЭтоДействиеПроведение        = ИмяРеквизита2 = "Проведен"         или ИмяРеквизита2 = Неопределено и ИмяРеквизита1 = "Проведен";
	ЭтоДействиеПометкаНаУдаление = ИмяРеквизита2 = "ПометкаУдаления"  или ИмяРеквизита2 = Неопределено и ИмяРеквизита1 = "ПометкаУдаления";
	ЭтоРаспределениеОплаты       = ТекущееДействие.ПолеНастройки.Свойство("ЭтоОплата");
	УстанавливатьРеквизит        = Не ЭтоДействиеПометкаНаУдаление и Не ЭтоДействиеПроведение;
	
	ИпяРеквизитаБИТ1 = Неопределено;
	Если ЭтоРаспределениеОплаты Тогда
		ИпяРеквизитаБИТ1 = "Проведен"
	КонецЕсли; 
	
	МассивСсылок          = Новый Массив;
	
	ПрошлаяСсылка  = Неопределено;
	ПрошлаяПометка = Ложь;
	Для Каждого СтрокаДанных ИЗ ТабличноеПолеДанных Цикл
		Ш_Ссылка = СтрокаДанных.Ш_Ссылка;
		Если ПрошлаяСсылка <> Ш_Ссылка Тогда
			
			ПрошлаяПометка = СтрокаДанных.Пометка;
			Если ПрошлаяПометка Тогда
				МассивСсылок.Добавить(Ш_Ссылка);
			КонецЕсли;
			ПрошлаяСсылка  = Ш_Ссылка;
		ИначеЕсли ЭтоДействиеСШапкой И ПрошлаяПометка <> СтрокаДанных.Пометка Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Найдены противоречивые отметки");

			Возврат;
			
		КонецЕсли;
	КонецЦикла;
	
	МассивПомеченныхСтрок = ТабличноеПолеДанных.НайтиСтроки(Новый Структура("Пометка",Истина));
	ПрошлаяСсылка  = Неопределено;
	тмпОбъект      = Неопределено;
	СоответствиеОбъектов = Новый Соответствие;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Новое значение: " + ПолеВводаДействия);
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("-----------------------------------------------------------");
	
	Если Объект.ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Если ИмяРеквизита2 = Неопределено Тогда
		МассивПомеченныхСтрок.Добавить(Неопределено);
		Для Каждого СтрокаДанных ИЗ МассивПомеченныхСтрок Цикл
			Ссылка = ?(СтрокаДанных = Неопределено, Неопределено, СтрокаДанных.Ш_Ссылка);
			Если ПрошлаяСсылка <> Ссылка Тогда
				Если Не ПрошлаяСсылка = Неопределено Тогда
					Попытка
						
						Если ЭтоДействиеПроведение Тогда
							
							Если ПолеВводаДействия Тогда
								Если тмпОбъект.Дата > КонецДня(ТекущаяДата()) Тогда
									ВызватьИсключение("Нельзя проводить документы будущей датой!");
								КонецЕсли;
								
								Если ЭтоРаспределениеОплаты Тогда
									
									Если тмпОбъект.ВводВРучную Тогда
										ВызватьИсключение("Нельзя обработать документы введенные в ручную!");
									КонецЕсли;
									
									Если тмпОбъект.Проведен Тогда
										ВызватьИсключение("Нельзя перерасчитывать проведенные документы!");
									КонецЕсли;
									
									//16.04.2019
									если Представление = "Изменить: [Проведение документа и распределение сумм с учетом начислений за месяц]" тогда
									 тмпОбъект.ВыполнитьРасчетСУчетомНачисленийМесяца();
								    иначе								 
								     тмпОбъект.ВыполнитьРасчет();
								    конецесли;                   
								 
									тмпОбъект.ЗапролнитьСчета();
								КонецЕсли;
								
								тмпОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
							Иначе
								тмпОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							КонецЕсли;
							
						ИначеЕсли ЭтоДействиеПометкаНаУдаление Тогда
							тмпОбъект.УстановитьПометкуУдаления(ПолеВводаДействия);
							
						Иначе
							
							тмпОбъект.Записать();
							
						КонецЕсли;

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+ПрошлаяСсылка);
						
						СоответствиеОбъектов.Вставить(ПрошлаяСсылка,Истина);
					Исключение
						СоответствиеОбъектов.Вставить(ПрошлаяСсылка,Ложь);
						ОписаниеОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());

					//	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+ ПрошлаяСсылка + " - " + ОписаниеОшибки);
						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки);

						
						Если Объект.ВыполнятьВТранзакции Тогда
							ОтменитьТранзакцию();

							бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Отмена транзакции. Действие не выполнено!");
							
							Возврат;
						КонецЕсли;
					КонецПопытки;
					
				КонецЕсли;
				
				Если Ссылка = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				тмпОбъект = Ссылка.ПолучитьОбъект();
				ПрошлаяСсылка  = Ссылка;
				СсылкаВстречаетсяВпервыйРаз = Истина;
			Иначе
				СсылкаВстречаетсяВпервыйРаз = Ложь;
			КонецЕсли;
			
			Попытка
				
				Если ЭтоДействиеСШапкой и УстанавливатьРеквизит И СсылкаВстречаетсяВпервыйРаз Тогда
					тмпОбъект[ИмяРеквизита1] = ПолеВводаДействия;	
				КонецЕсли;
				
				Если Не ЭтоДействиеСШапкой и УстанавливатьРеквизит Тогда
					тмпОбъект[СтрокаДанных.Т_ТЧ][СтрокаДанных.Т_НомерСтроки-1][ИмяРеквизита1] = ПолеВводаДействия;
				КонецЕсли; 
				
			Исключение
				ОписаниеОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+СтрокаДанных.Ш_Ссылка + " - " + ОписаниеОшибки);
				
				Если Объект.ВыполнятьВТранзакции Тогда
					ОтменитьТранзакцию();

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Отмена транзакции. Действие не выполнено!");
					
					Возврат;
				КонецЕсли;
			КонецПопытки; 
			
		КонецЦикла; 
	Иначе
		Для Каждого СтрокаДанных ИЗ МассивПомеченныхСтрок Цикл
			Ш_Ссылка = ?(СтрокаДанных = Неопределено, Неопределено, СтрокаДанных.Ш_Ссылка);
			
			Если ЭтоДействиеСШапкой Тогда
				Ссылка = Ш_Ссылка[ИмяРеквизита1];
			Иначе
				Ссылка = Ш_Ссылка[СтрокаДанных.Т_ТЧ][СтрокаДанных.Т_НомерСтроки-1][ИмяРеквизита1];
			КонецЕсли;
			
			Если Ссылка = Неопределено или Ссылка.Пустая() Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СоответствиеОбъектов[Ссылка] = Неопределено Тогда
				Попытка
					
					тмпОбъект = Ссылка.ПолучитьОбъект();
					
					Если ЭтоДействиеПроведение Тогда
						
						Если ПолеВводаДействия Тогда
							
							Если ЭтоРаспределениеОплаты Тогда
								
								Если тмпОбъект.ВводВРучную Тогда
									ВызватьИсключение("Нельзя обработать документы введенные в ручную!");
								КонецЕсли;
								
								Если тмпОбъект.Проведен Тогда
									ВызватьИсключение("Нельзя перерасчитывать проведенные документы!");
								КонецЕсли;
								
								тмпОбъект.ВыполнитьРасчет();
								тмпОбъект.ЗапролнитьСчета();
							КонецЕсли;
							
							тмпОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
						Иначе
							тмпОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						КонецЕсли;
						
					ИначеЕсли ЭтоДействиеПометкаНаУдаление Тогда
						
						тмпОбъект.УстановитьПометкуУдаления(ПолеВводаДействия);
					Иначе
						тмпОбъект[ИмяРеквизита2] = ПолеВводаДействия;
						тмпОбъект.Записать();
					КонецЕсли;

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+Ссылка);
					
					СоответствиеОбъектов.Вставить(Ссылка,Истина);
					
				Исключение
					СоответствиеОбъектов.Вставить(Ссылка,Ложь);
					ОписаниеОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+СтрокаДанных.Ш_Ссылка + " - " + ОписаниеОшибки);
					
					Если Объект.ВыполнятьВТранзакции Тогда
						ОтменитьТранзакцию();

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Отмена транзакции. Действие не выполнено!");
						
						Возврат;
					КонецЕсли;
					
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.ВыполнятьВТранзакции Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Для Каждого СтрокаДанных ИЗ ТабличноеПолеДанных Цикл
		
		Если ИмяРеквизита2 = Неопределено Тогда
			Ссылка = СтрокаДанных.Ш_Ссылка;
			Результат = СоответствиеОбъектов[Ссылка];
			
			Если Не Результат = Неопределено И Не Результат = Ложь Тогда
				
				Если ЭтоДействиеСШапкой Тогда
					
					СтрокаДанных[ТекущееДействие.Имя] = Ссылка[ИмяРеквизита1];
					
				Иначе
					
					СтрокаДанных[ТекущееДействие.Имя] = Ссылка[СтрокаДанных.Т_ТЧ][СтрокаДанных.Т_НомерСтроки-1][ИмяРеквизита1];
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			Ссылка = СтрокаДанных[ИмяПоляРеквизита1];
			Результат = СоответствиеОбъектов[Ссылка];
			
			Если Не Результат = Неопределено И Не Результат = Ложь Тогда
				СтрокаДанных[ТекущееДействие.Имя] = Ссылка[ИмяРеквизита2];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("-----------------------------------------------------------");
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выполнение обработки завершено");
	
КонецПроцедуры // ()

&НаСервере
Функция КраткоеОписаниеОшибки(ОписаниеОшибки);
	ПозКонцаСкобок = Найти(ОписаниеОшибки,"}");
	Если ПозКонцаСкобок = 0 Тогда
		
		Возврат ОписаниеОшибки;
		
	Иначе
		
		Возврат Сред(ОписаниеОшибки,ПозКонцаСкобок + 2);
		
	КонецЕсли;
	
КонецФункции // ()

// Процедура инициализирует СКД. 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура ИнициализироватьСКД()
	
	масЗапросовПоОбъектам = Новый Массив;
	
	ВсегоСтрок = ТабличноеПолеВидыОбъектов.Количество();
	
	Если ВсегоСтрок = 0 Тогда
		КомпоновщикНастроек.Инициализировать(Неопределено);
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Возврат;
	КонецЕсли; 
	
	// ИНИЦИАЛИЦАЗИЯ ПЕРЕМЕННЫХ.
	
	МетаданныеОбъектов = Метаданные[?(ТипОбъекта = 1,"Документы","Справочники")];
	ИмяТипаТаблицы = ?(ТипОбъекта = 1,"Документ","Справочник");
	Префикс = ?(ОбрабатыватьТабличныеЧасти,"Ссылка.","");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ХранилищеЗначения"));
	ОписаниеТипаХранилище = Новый ОписаниеТипов(МассивТипов);
	
	МассивТипов              = Новый Массив;
	СписокПредставлений      = Новый СписокЗначений;
	СтруктураРеквизитовШапки = Новый Структура;
	СтруктураРеквизитовТЧ    = Новый Структура;
	СтруктураТиповОбъектов   = Новый Структура;
	
	ИмяВидаОдногоТипа = Неопределено;
	ПрошлоеЗначение   = Неопределено;
	
	// ПОДСЧЕТ ОДОИМЕННЫХ РЕКВИЗИТОВ.
	Для каждого Строка Из ТабличноеПолеВидыОбъектов Цикл
		
		Если Не ОбрабатыватьТабличныеЧасти Тогда
			ИмяВида        = Строка.ИмяТаблицы;
		Иначе
			ПозТЧК  = Найти(Строка.ИмяТаблицы,".");
			ИмяВида = Лев(Строка.ИмяТаблицы,ПозТЧК-1);
			ИмяТЧ   = Сред(Строка.ИмяТаблицы,ПозТЧК+1);
			
			МетаданныеРеквизитовТЧ = МетаданныеОбъектов[ИмяВида].ТабличныеЧасти[ИмяТЧ].Реквизиты;
		КонецЕсли; 
		МетаданныеРеквизитов = МетаданныеОбъектов[ИмяВида].Реквизиты;
		
		Если ТипОбъекта = 1 Тогда
			Если МетаданныеОбъектов[ИмяВида].ДлинаНомера > 0 Тогда
				СтруктураРеквизитовШапки.Вставить("Номер",
				?(СтруктураРеквизитовШапки.Свойство("Номер",ПрошлоеЗначение)
				,ПрошлоеЗначение+1,1));
			КонецЕсли; 
			
			СтруктураРеквизитовШапки.Вставить("Дата",
			?(СтруктураРеквизитовШапки.Свойство("Дата",ПрошлоеЗначение)
			,ПрошлоеЗначение+1,1));
			
			СтруктураРеквизитовШапки.Вставить("Проведен",
			?(СтруктураРеквизитовШапки.Свойство("Проведен",ПрошлоеЗначение)
			,ПрошлоеЗначение+1,1));
		Иначе
			Если МетаданныеОбъектов[ИмяВида].ДлинаКода > 0 Тогда
				СтруктураРеквизитовШапки.Вставить("Код",
				?(СтруктураРеквизитовШапки.Свойство("Код",ПрошлоеЗначение)
				,ПрошлоеЗначение+1,1));
			КонецЕсли; 
			
			Если МетаданныеОбъектов[ИмяВида].ДлинаНаименования > 0 Тогда
				СтруктураРеквизитовШапки.Вставить("Наименование",
				?(СтруктураРеквизитовШапки.Свойство("Наименование",ПрошлоеЗначение)
				,ПрошлоеЗначение+1,1));
			КонецЕсли; 
		КонецЕсли;
		
		Если ИмяВидаОдногоТипа = Неопределено Тогда
			ИмяВидаОдногоТипа = ИмяВида;
		ИначеЕсли ИмяВидаОдногоТипа <> ИмяВида Тогда
			ИмяВидаОдногоТипа = Ложь;
		КонецЕсли; 
		
		Для каждого РеквизитМетаданного Из МетаданныеОбъектов[ИмяВида].Реквизиты Цикл
			
			Если РеквизитМетаданного.Тип = ОписаниеТипаХранилище Тогда
				Продолжить;
			ИначеЕсли РеквизитМетаданного.Имя = "Вид" Тогда
				Продолжить;
			КонецЕсли; 
			
			СтруктураРеквизитовШапки.Вставить(РеквизитМетаданного.Имя,
			?(СтруктураРеквизитовШапки.Свойство(РеквизитМетаданного.Имя,ПрошлоеЗначение)
			,ПрошлоеЗначение+1,1));
			
		КонецЦикла;
		
		Если ОбрабатыватьТабличныеЧасти Тогда
			
			Для каждого РеквизитМетаданного Из МетаданныеРеквизитовТЧ Цикл
				
				Если РеквизитМетаданного.Тип = ОписаниеТипаХранилище Тогда
					Продолжить;
				КонецЕсли; 
				
				СтруктураРеквизитовТЧ.Вставить(РеквизитМетаданного.Имя,
				?(СтруктураРеквизитовТЧ.Свойство(РеквизитМетаданного.Имя,ПрошлоеЗначение)
				,ПрошлоеЗначение+1,1));
				
			КонецЦикла;
		КонецЕсли; 
		СтруктураТиповОбъектов.Вставить(МетаданныеОбъектов[ИмяВида].Имя,Тип(ИмяТипаТаблицы+"Ссылка."+ИмяВида));
	КонецЦикла;
	
	Если ИмяВидаОдногоТипа = Ложь Тогда
		ИмяВидаОдногоТипа = Неопределено;
	КонецЕсли; 
	
	// ОПРЕДЕЛЕНИЕ СОСТАВА РЕКВИЗИТОВ.
	Счетчик = 0;
	Для каждого КлючИЗначение Из СтруктураРеквизитовТЧ Цикл
		
		Если Не КлючИЗначение.Значение = ВсегоСтрок Тогда
			
			СтруктураРеквизитовТЧ.Удалить(КлючИЗначение.Ключ);
			
		Иначе
			Счетчик = Счетчик + 1;
			СтруктураРеквизитовТЧ.Вставить(КлючИЗначение.Ключ,"Т_"+КлючИЗначение.Ключ);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Счетчик = 0;
	Для каждого КлючИЗначение Из СтруктураРеквизитовШапки Цикл
		
		Если Не КлючИЗначение.Значение = ВсегоСтрок Тогда
			
			СтруктураРеквизитовШапки.Удалить(КлючИЗначение.Ключ);
			
		Иначе
			Счетчик = Счетчик + 1;
			СтруктураРеквизитовШапки.Вставить(КлючИЗначение.Ключ,"Ш_"+КлючИЗначение.Ключ);
		КонецЕсли; 
		
	КонецЦикла; 
	
	// ОПРЕДЕЛЕНИЕ ПОРЯДКА И ПРЕДСТАВЛЕНИЯ РЕКВИЗИТОВ.
	СписокПредставлений.Добавить("Ш_Вид","Вид "+ИмяТипаТаблицы+"а");
	СписокПредставлений.Добавить("Ш_ВидПредставление","Вид "+ИмяТипаТаблицы+"а");
	СписокПредставлений.Добавить("Ш_Ссылка", "Ссылка");
	
	Если ОбрабатыватьТабличныеЧасти Тогда
		
		СписокПредставлений.Добавить("Т_ТЧ"             , "Имя ТЧ");
		СписокПредставлений.Добавить("Т_ТЧПредставление", "Имя ТЧ");
		СписокПредставлений.Добавить("Т_НомерСтроки"    , "№ строки");
		
		Для каждого КлючИЗначение Из СтруктураРеквизитовТЧ Цикл
			СписокПредставлений.Добавить(КлючИЗначение.Значение, МетаданныеРеквизитовТЧ[КлючИЗначение.Ключ].Представление());
		КонецЦикла; 
		
	КонецЕсли; 
	
	СписокПредставлений.Добавить("Ш_ПометкаУдаления", Префикс + "Пометка удаления");
	
	Если ТипОбъекта = 0 И Не ИмяВидаОдногоТипа = Неопределено Тогда
		
		Если МетаданныеОбъектов[ИмяВидаОдногоТипа].Владельцы.Количество() > 0 Тогда
			
			СтруктураРеквизитовШапки.Вставить("Владелец","Ш_Владелец");
			
		КонецЕсли; 
		
		
		Если МетаданныеОбъектов[ИмяВидаОдногоТипа].Иерархический Тогда
			
			СтруктураРеквизитовШапки.Вставить("Родитель","Ш_Родитель");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Для каждого КлючИЗначение Из СтруктураРеквизитовШапки Цикл
		МетаданныеРеквизита = МетаданныеРеквизитов.Найти(КлючИЗначение.Ключ);
		Если Не МетаданныеРеквизита = Неопределено Тогда
			СписокПредставлений.Добавить(КлючИЗначение.Значение, Префикс+МетаданныеРеквизита.Представление());
		Иначе
			СписокПредставлений.Добавить(КлючИЗначение.Значение, Префикс+КлючИЗначение.Ключ);
		КонецЕсли; 
		
	КонецЦикла; 
	
	// ДОБАВЛЕНИЕ ОБЩИХ РЕКВИЗИТОВ.
	СтруктураРеквизитовШапки.Вставить("ПометкаУдаления","Ш_ПометкаУдаления");
	
	Если ОбрабатыватьТабличныеЧасти Тогда
		СтруктураРеквизитовТЧ.Вставить("НомерСтроки","Т_НомерСтроки");
	КонецЕсли; 
	
	
	// ФОРМИРОВАНИЕ ТЕКСТА ЗАПРОСА.
	
	ТекстЗапросаОкончание = "";
	
	Если ТипОбъекта = 1 Тогда
		
		ТекстЗапросаОкончание = ТекстЗапросаОкончание + "
		|УПОРЯДОЧИТЬ ПО
		|	Ш_Дата,
		|	Ш_Ссылка";
		ПоляСортировки = "Ш_Дата,Ш_Ссылка";
		
	Иначе
		
		ТекстЗапросаОкончание = ТекстЗапросаОкончание + "
		|УПОРЯДОЧИТЬ ПО
		|	Ш_Вид,
		|	Ш_Ссылка";
		ПоляСортировки = "Ш_Вид,Ш_Ссылка";
		
	КонецЕсли;
	
	Если ОбрабатыватьТабличныеЧасти Тогда
		ТекстЗапросаОкончание = ТекстЗапросаОкончание + ",
		|	Т_ТЧ,
		|	Т_НомерСтроки";
		ПоляСортировки = ПоляСортировки + ",Т_ТЧ,Т_НомерСтроки";
	КонецЕсли;
	
	ТекстЗапроса = "";
	
	Для каждого Строка Из ТабличноеПолеВидыОбъектов Цикл
		
		ОбязательныеПоля = Новый Массив;
		
		Если Не ОбрабатыватьТабличныеЧасти Тогда
			ИмяВида        = Строка.ИмяТаблицы;
		Иначе
			ПозТЧК  = Найти (Строка.ИмяТаблицы,".");
			ИмяВида = Лев   (Строка.ИмяТаблицы,ПозТЧК-1);
			ИмяТЧ   = Сред  (Строка.ИмяТаблицы,ПозТЧК+1);
			
			МетаданныеРеквизитовТЧ = МетаданныеОбъектов[ИмяВида].ТабличныеЧасти[ИмяТЧ].Реквизиты;
		КонецЕсли; 
		МетаданныеРеквизитов = МетаданныеОбъектов[ИмяВида].Реквизиты;
		
		ИмяТаблицы       = ИмяТипаТаблицы + "." + Строка.ИмяТаблицы;
		ПсевдонимТаблицы = СтрЗаменить(ИмяТаблицы,".","_");
		
		// ФОРМИРОВАНИЕ ТЕКСТА ЗАПРОСА ПО РЕКВИЗИТАМ.
		
		ТекстЗапросаОбъект = "";
		ТекстЗапросаОбъект = ТекстЗапросаОбъект + ""  + Символы.ПС + "	""" +ИмяВида+ """ КАК Ш_Вид";
		ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	""" +СтрЗаменить(МетаданныеОбъектов[ИмяВида].Представление(), """", "") + """ КАК Ш_ВидПредставление";
		ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	"   +ПсевдонимТаблицы+"."+Префикс+"Ссылка КАК Ш_Ссылка";
		ОбязательныеПоля.Добавить("Ш_Вид");
		ОбязательныеПоля.Добавить("Ш_ВидПредставление");
		ОбязательныеПоля.Добавить("Ш_Ссылка");
		
		Для каждого КлючИЗначение Из СтруктураРеквизитовШапки Цикл
			МетаданноеРеквизита = МетаданныеРеквизитов.Найти(КлючИЗначение.Ключ);
			Если Не МетаданноеРеквизита = Неопределено И МетаданноеРеквизита.Тип.СодержитТип(Тип("Строка")) и МетаданноеРеквизита.Тип.КвалификаторыСтроки.Длина = 0 Тогда
				ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	ПОДСТРОКА("+ПсевдонимТаблицы+"."+Префикс+КлючИЗначение.Ключ+",1,"+Объект.ОграничениеНаСтрокиНеограниченнойДлины+")";
			Иначе
				ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	"+ПсевдонимТаблицы+"."+Префикс+КлючИЗначение.Ключ;
			КонецЕсли; 			
			ТекстЗапросаОбъект = ТекстЗапросаОбъект + " КАК " + КлючИЗначение.Значение;
			
			ОбязательныеПоля.Добавить(КлючИЗначение.Значение);
			
		КонецЦикла; 
		
		Если ОбрабатыватьТабличныеЧасти Тогда
			
			ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	""" +ИмяТЧ+ """ КАК Т_ТЧ";
			ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	""" +МетаданныеОбъектов[ИмяВида].ТабличныеЧасти[ИмяТЧ].Представление()+ """ КАК Т_ТЧПредставление";
			
			Для каждого КлючИЗначение Из СтруктураРеквизитовТЧ Цикл
				
				МетаданноеРеквизита = МетаданныеРеквизитовТЧ.Найти(КлючИЗначение.Ключ);
				
				Если Не МетаданноеРеквизита = Неопределено И МетаданноеРеквизита.Тип.СодержитТип(Тип("Строка")) и МетаданноеРеквизита.Тип.КвалификаторыСтроки.Длина = 0 Тогда
					
					ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	ПОДСТРОКА("+ПсевдонимТаблицы+"."+КлючИЗначение.Ключ+",1,"+Объект.ОграничениеНаСтрокиНеограниченнойДлины+")";
					
				Иначе
					
					ТекстЗапросаОбъект = ТекстЗапросаОбъект + "," + Символы.ПС + "	"+ПсевдонимТаблицы+"."+КлючИЗначение.Ключ;
					
				КонецЕсли;
				
				ТекстЗапросаОбъект = ТекстЗапросаОбъект + " КАК " + КлючИЗначение.Значение;
				ОбязательныеПоля.Добавить(КлючИЗначение.Значение);
				
			КонецЦикла; 
		КонецЕсли;
		
		// ФОРМИРОВАНИЕ ТЕКСТА ЗАПРОСА ПО "ИЗ" И "СОЕДИНЕНИЕ".
		ТекстЗапросаОбъект = ТекстЗапросаОбъект + Символы.ПС + "ИЗ" + Символы.ПС + "	"+ИмяТаблицы + " КАК " + ПсевдонимТаблицы;
		
		Если ТипОбъекта = 0  И МетаданныеОбъектов[ИмяВида].Иерархический И МетаданныеОбъектов[ИмяВида].ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			
			ТекстЗапросаОбъект = ТекстЗапросаОбъект + "
			|ГДЕ
			|	" + ПсевдонимТаблицы + ".Ссылка.ЭтоГруппа = ЛОЖЬ";
			
		КонецЕсли;
		
		ТекстЗапроса = ?(ТекстЗапроса = "","ВЫБРАТЬ РАЗРЕШЕННЫЕ",ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС + "ВЫБРАТЬ") + ТекстЗапросаОбъект;
		
		ТекстЗапросаОбъект = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + ТекстЗапросаОбъект + ТекстЗапросаОкончание;
		
		ЗапросПоОбъекту  = Новый Структура("ТекстЗапросаОбъект, ОбязательныеПоля", ТекстЗапросаОбъект, ОбязательныеПоля);
		масЗапросовПоОбъектам.Добавить(ЗапросПоОбъекту);
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаОкончание;
	
	ОтображаемыеКолонки  = Новый Структура("Ш_ВидПредставление, Ш_Ссылка");
	
	// ФОРМИРОВАНИЕ СКД.
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных   = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных .Имя                = "ИсточникДанных";
	ИсточникДанных .ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных";
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	НаборДанных.Поля.Очистить();
	СхемаКомпоновкиДанных.ПоляИтога.Очистить();
	
	Для каждого ЭлементПредставления Из СписокПредставлений Цикл
		
		Если ЭлементПредставления.Значение = "Ш_ВидПредставление" 
			ИЛИ (ОбрабатыватьТабличныеЧасти И 
			(ЭлементПредставления.Представление = "Т_ТЧПредставление" ИЛИ ЭлементПредставления.Представление ="Т_ТЧ")) Тогда
			
			НовоеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			НовоеПоле.Заголовок   = ЭлементПредставления.Представление;
			НовоеПоле.Поле        = ЭлементПредставления.Значение;
			НовоеПоле.ПутьКДанным = ЭлементПредставления.Значение;
			НовоеПоле.ОграничениеИспользования.Условие = Истина;
			
		Иначе
			
			НовоеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			НовоеПоле.Заголовок   = ЭлементПредставления.Представление;
			НовоеПоле.Поле        = ЭлементПредставления.Значение;
			НовоеПоле.ПутьКДанным = ЭлементПредставления.Значение;
			
			Если НовоеПоле.Заголовок = "Ссылка" Тогда
				НовоеПоле.ОграничениеИспользованияРеквизитов.Условие = Истина;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// ФОРМИРОВАНИЕ СПИСКА ПРЕДОПРЕДЕЛЕННЫХ РЕКВИЗИТОВ. 
	
	ПредопределенныеРеквизиты = Новый СписокЗначений;
	Макет      = Обработки.бит_ГрупповаяОбработкаСправочниковИДокументов.ПолучитьМакет("ПредопределенныеРеквизиты");
	Область    = Макет.Области[?(ТипОбъекта = 0,"Справочники","Документы")];
	Счетчик    = 0;
	ВидОбъекта = "*";
	
	Для Значение =  Область.Верх По Область.Низ Цикл
		
		ТекВидОбъекта = СокрЛП(Макет.Область("R"+Значение+"C1").Текст);
		
		Если  ТекВидОбъекта <> "" Тогда
			Если ТекВидОбъекта = "*" Тогда
				ВидОбъекта = ТекВидОбъекта;
			Иначе
				ВидОбъекта = ТекВидОбъекта;
			КонецЕсли; 
			
		КонецЕсли;
		
		Если ИмяВидаОдногоТипа = ВидОбъекта ИЛИ ВидОбъекта = "*" Тогда
			
			ПолноеИмяРеквизита = СокрЛП(Макет.Область("R"+Значение+"C2").Текст);
			Описание           = СокрЛП(Макет.Область("R"+Значение+"C3").Текст);
			ЧерезТочку         = Ложь;
			
			ПозТЧК = Найти(ПолноеИмяРеквизита,".");
			ЭтоСоставнойРеквизит = Не(ПозТЧК = 0);
			ИмяКорня             = "Ш_"+?(ПозТЧК = 0,ПолноеИмяРеквизита,Лев(ПолноеИмяРеквизита,ПозТЧК-1));
			ПолеНастройки        = НаборДанных.Поля.Найти(ИмяКорня);
			
			Пока Не ПозТЧК = 0 И Не ПолеНастройки = Неопределено Цикл
				ПолноеИмяРеквизита = Сред(ПолноеИмяРеквизита,ПозТЧК+1);
				ПозТЧК = Найти(ПолноеИмяРеквизита,".");
				ПолеНастройки = ПолеНастройки.Поля.Найти(?(ПозТЧК = 0,ПолноеИмяРеквизита,Лев(ПолноеИмяРеквизита,ПозТЧК-1)));
				ЧерезТочку = Истина;
			КонецЦикла; 
			
			Если Не ПолеНастройки = Неопределено Тогда
				Если ЭтоСоставнойРеквизит Тогда
					
					Счетчик = Счетчик+1;
					
					СписокПредставлений.Добавить("Д_"+Счетчик, Описание);
					ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных("Д_"+Счетчик);
					ПредопределенныеРеквизиты.Добавить(Новый Структура("Имя, ПолеКомпоновкиДанных", "Д_"+Счетчик, ПолеКомпоновкиДанных),Описание);
					
				Иначе
					ПредопределенныеРеквизиты.Добавить(Новый Структура("Имя, ПолеКомпоновкиДанных", ПолеНастройки.ПутьКДанным, Новый ПолеКомпоновкиДанных(ПолеНастройки.ПутьКДанным)),Описание);
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЦикла;
	
	ГруппировкаКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	мСформированныйРежим =  Новый Структура("СписокПредставлений, ДанныеОтобраны, ИмяВидаОдногоТипа,ПредопределенныеРеквизиты, ОтображаемыеКолонки, масЗапросовПоОбъектам",
	СписокПредставлений,
	Ложь,
	ИмяВидаОдногоТипа,
	ПредопределенныеРеквизиты,
	ОтображаемыеКолонки,
	масЗапросовПоОбъектам);
	
КонецПроцедуры // ()

// Функция формирует список выбранных.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
&НаСервере
Функция СформироватьСписокВыбранных()
	
	СписокВыбранных = Новый СписокЗначений;
	
	тмпТаблицаВидовОбъектов = ТабличноеПолеВидыОбъектов.Выгрузить();
	
	СписокВыбранных.ЗагрузитьЗначения(тмпТаблицаВидовОбъектов.ВыгрузитьКолонку("ИмяТаблицы"));
	
	Возврат СписокВыбранных;
	
КонецФункции // ()

&НаСервере
Процедура ОчиститьРезультаты()
	
	ТабличноеПолеДанных.Очистить();
	
	СписокВыбора = Элементы.СписокДействий.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить("","<Выберите действие>");
	ПолеВыбораДействия = "";
	
	ПолеВводаДействия                      = Неопределено;
	СписокДействий.Очистить();
	ТекущееДействие                        = Неопределено;
	
	Если НЕ мСформированныйРежим = Неопределено И мСформированныйРежим.ДанныеОтобраны Тогда
		
		Если мСформированныйРежим.Свойство("УдаляемыеРеквизиты") Тогда
			
			ИзменитьРеквизиты(,мСформированныйРежим.УдаляемыеРеквизиты);
			мСформированныйРежим.Удалить("УдаляемыеРеквизиты");
			
		КонецЕсли; 
		
		Если мСформированныйРежим.Свойство("УдаляемыеЭлементыФормы") Тогда
			
			Для каждого УдаляемыеЭлементыФормы Из мСформированныйРежим.УдаляемыеЭлементыФормы Цикл
				Элементы.Удалить(Элементы[УдаляемыеЭлементыФормы]);
			КонецЦикла;
			
			мСформированныйРежим.Удалить("УдаляемыеЭлементыФормы");
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // () 


&НаКлиенте
Функция ОчищатьРезультаты()
	
	Если Не мСформированныйРежим = Неопределено И мСформированныйРежим.ДанныеОтобраны Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Результат отбора очищен.");
		
	КонецЕсли; 
	
	ОчиститьРезультаты();
	мСформированныйРежим = Неопределено;
	
	Возврат Истина;
	
КонецФункции // ()


&НаСервере
Функция ОбъектыНаСервере(Ш_ВидПредставление)
	
	Для каждого Документ Из Метаданные.Документы Цикл
		
		Если Документ.ПредставлениеОбъекта = Ш_ВидПредставление или Документ.Синоним = Ш_ВидПредставление Тогда
			
			ИмяОбъекта = Документ.Имя;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Справочник Из Метаданные.Справочники Цикл
		
		Если Справочник.ПредставлениеОбъекта = Ш_ВидПредставление или Справочник.Синоним = Ш_ВидПредставление Тогда
			
			ИмяОбъекта = Справочник.Имя;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИмяОбъекта;
	
КонецФункции

#КонецОбласти