
#Область ПроцедурыФормированияДвижений
Процедура СформироватьДвиженияВводПоказаний(НовыеДвижения, Движения) Экспорт
	
	Для Каждого Строка Из НовыеДвижения Цикл
		
		Движение = Движения.бит_ПоказанияОДПУ.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка); 
		
	КонецЦикла;
	
	Движения.бит_ПоказанияОДПУ.Записывать = Истина;
	
КонецПроцедуры
#КонецОбласти

#Область ПодготовкаПараметровПроведенияДокумента

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения = Неопределено) Экспорт

	Результат = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(бит_ВводПоказанийОДПУПоказания.Ссылка.Дата, МЕСЯЦ) КАК Период,
	               |	бит_ВводПоказанийОДПУПоказания.Ссылка.Организация КАК Организация,
	               |	бит_ВводПоказанийОДПУПоказания.Здание КАК Здание,
	               |	бит_ВводПоказанийОДПУПоказания.УслугаЖКХ КАК УслугаЖКХ,
	               |	бит_ВводПоказанийОДПУПоказания.НомерОДПУ КАК НомерОДПУ,
	               |	ВЫБОР
	               |		КОГДА бит_ВводПоказанийОДПУПоказания.УслугаЖКХ = &УслугаЭлектроэнергия
	               |			ТОГДА бит_ВводПоказанийОДПУПоказания.КТР
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК КТР,
	               |	бит_ВводПоказанийОДПУПоказания.НачальныеПоказания КАК НачальноеЗначение,
	               |	бит_ВводПоказанийОДПУПоказания.КонечныеПоказания КАК КонечноеЗначение,
	               |	бит_ВводПоказанийОДПУПоказания.ОбъемКУ КАК ОбъемКУ
	               |ИЗ
	               |	Документ.бит_ВводПоказанийОДПУ.Показания КАК бит_ВводПоказанийОДПУПоказания
	               |ГДЕ
	               |	бит_ВводПоказанийОДПУПоказания.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("УслугаЭлектроэнергия", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002"));
	
	Результат.Вставить("НовыеДвижения", Запрос.Выполнить().Выгрузить());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти