
#Область ФункцииОбработкиДанныхФизическихЛиц

// Функция получает ФИО из регистра сведений в виде структуры. 
Функция ПолучитьДанныеДокументаФизЛица(ФизЛицо, НаДату = Неопределено) Экспорт
	
	Результат = Новый Структура("ДокументВид, ДокументСерия, ДокументНомер,ДокументДатаВыдачи,ДокументКемВыдан,ДокументКодПодразделения,ДатаРегистрацииПоМестуЖительства,ДокументПричинаЗамены", "", "", "", "", "", "", "", "");
	Если Метаданные.Справочники.Найти("бит_Проживающие") = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ФизЛицо);
	Иначе
		ДанныеФЛ = РегистрыСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДата()), Новый Структура("ФизЛицо", ФизЛицо));
		Если ДанныеФЛ.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Результат, ДанныеФЛ[0]);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция получает данные документа из регистра сведений в виде структуры 
Функция ПолучитьДанныеРанееВыданногоДокументаФизЛица(ФизЛицо, НаДату = Неопределено) Экспорт
	
	Результат = Новый Структура("ДокументВид, ДокументСерия, ДокументНомер,ДокументДатаВыдачи,ДокументКемВыдан,ДокументКодПодразделения,ДатаРегистрацииПоМестуЖительства,ДокументПричинаЗамены", "", "", "", "", "", "", "", "");
	Если Метаданные.Справочники.Найти("бит_Проживающие") = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ФизЛицо);
	Иначе
		
		Запрос = Новый Запрос;
		Период = ?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДата());
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПаспортныеДанныеПроживающих.ДокументВид,
		|	бит_ПаспортныеДанныеПроживающих.ДокументСерия,
		|	бит_ПаспортныеДанныеПроживающих.ДокументНомер,
		|	бит_ПаспортныеДанныеПроживающих.ДокументДатаВыдачи,
		|	бит_ПаспортныеДанныеПроживающих.ДокументКемВыдан,
		|	бит_ПаспортныеДанныеПроживающих.ДокументКодПодразделения,
		|	бит_ПаспортныеДанныеПроживающих.ДатаРегистрацииПоМестуЖительства,
		|	бит_ПаспортныеДанныеПроживающих.ДокументПричинаЗамены
		|ИЗ
		|	РегистрСведений.бит_ПаспортныеДанныеПроживающих КАК бит_ПаспортныеДанныеПроживающих
		|ГДЕ
		|	бит_ПаспортныеДанныеПроживающих.Период <= &Период
		|	И бит_ПаспортныеДанныеПроживающих.ФизЛицо = &ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ПаспортныеДанныеПроживающих.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
		
		ДанныеФЛ = Запрос.Выполнить().Выгрузить();
		
		Если ДанныеФЛ.Количество() > 1 Тогда
			ЗаполнитьЗначенияСвойств(Результат, ДанныеФЛ[1]);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает паспортные данные физлица в виде строки.
//
// Параметры: 
//  ФизЛицо - ссылка на элемент справочников "Физические лица", "Проживающие".
//           по которому необходимо получить паспортные данные.
//  НаДату 	- получение данных на дату;.
//  ВидСтроки - при Истине не выводится код подразделения, выдавшего документ.
//
// Возвращаемое значение:
//  Строка с данными об удостоверении личности физического лица.
//
Функция ПолучитьПаспортныеДанныеСтрокой(ФизЛицо, НаДату = Неопределено, ВидСтроки = Истина) Экспорт
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"   ,?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДата()));
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.Период,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументПричинаЗамены
	|ИЗ
	|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&дата, ФизЛицо = &ФизЛицо) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ВидДокумента       = Выборка.ДокументВид;
		Серия              = Выборка.ДокументСерия;
		Номер              = Выборка.ДокументНомер;
		ДатаВыдачи         = Выборка.ДокументДатаВыдачи;
		КемВыдан           = Выборка.ДокументКемВыдан;
		НомерПодразделения = Выборка.ДокументКодПодразделения;
		
		Если НЕ (НЕ ЗначениеЗаполнено(ДатаВыдачи)
			И НЕ ЗначениеЗаполнено(ВидДокумента)
			И НЕ ЗначениеЗаполнено(Серия + Номер + КемВыдан + НомерПодразделения)) Тогда
			
			// 17.10.2018
			если ВидДокумента <> неопределено тогда			
				Результат = ?(ВидДокумента.Пустая(),"","" + ВидДокумента + ", ") 
				+ "сер."   + Серия + ", №" + Номер 
				+ ", выд. " + Формат(ДатаВыдачи,"ДФ=dd.MM.yyyy") + "г. " 
				+ КемВыдан + ?(ВидСтроки, "", " код подр." + НомерПодразделения );
			иначе				
				Результат = "";
			конецесли;	
			
		Иначе
			Результат = "";
		КонецЕсли;
		
	Иначе
		Результат = "";
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ПолучитьПаспортныеДанныеСтрокой()

// Функция возвращает паспортные данные физлица в виде строки из структуры.
// Параметры: 
//  СтруктураПаспортныхДанных - структура паспортных данных,по которой необходимо.
//            получить паспортные данные строкой.
//
// Возвращаемое значение:
//  Строка с данными об удостоверении личности физического лица.
//
Функция ПолучитьПаспортныеДанныеСтрокойИзСтруктуры(СтруктураПаспортныхДанных) Экспорт
	
	ВидДокумента       = СтруктураПаспортныхДанных.ДокументВид;
	Серия              = СтруктураПаспортныхДанных.ДокументСерия;
	Номер              = СтруктураПаспортныхДанных.ДокументНомер;
	ДатаВыдачи         = СтруктураПаспортныхДанных.ДокументДатаВыдачи;
	КемВыдан           = СтруктураПаспортныхДанных.ДокументКемВыдан;
	НомерПодразделения = СтруктураПаспортныхДанных.ДокументКодПодразделения;
	
	Если НЕ (НЕ ЗначениеЗаполнено(ДатаВыдачи)
		И НЕ ЗначениеЗаполнено(ВидДокумента)
		И НЕ ЗначениеЗаполнено(Серия + Номер + КемВыдан + НомерПодразделения)) Тогда
		
		Возврат ?(ВидДокумента.Пустая(),"","" + ВидДокумента + ", ") 
		+ "сер."   + Серия + ", №" + Номер 
		+ ", выд. " + Формат(ДатаВыдачи,"ДФ=dd.MM.yyyy") + "г. " 
		+ КемВыдан;
		
	Иначе
		
		Возврат "Отсутствуют данные об удостоверении личности."
		
	КонецЕсли;
	
КонецФункции // ПолучитьПаспортныеДанныеСтрокойИзСтруктуры()

// Функция получает ФИО из регистра сведений в виде структуры  или строки с полным именем.
// В зависимости от значения  ВидДанных при ВидСтроки = Ложь выводятся ФИО с инициалами.
Функция ПолучитьФИОФизЛица(ФизЛицо, НаДату = Неопределено, ВидДанных = Истина, ВидСтроки = Истина) Экспорт
	
	Результат = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	
	Если Метаданные.Справочники.Найти("бит_Проживающие") = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ФизЛицо);
	ИначеЕсли ТипЗнч(ФизЛицо) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		ДанныеФЛ = РегистрыСведений.бит_ФИОПроживающих.СрезПоследних(?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДата()), Новый Структура("ФизЛицо", ФизЛицо));
		Если ДанныеФЛ.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Результат, ДанныеФЛ[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	ИтогРезультат = Неопределено;
	
	Если ВидСтроки Тогда
		
		Если ВидДанных Тогда
			ИтогРезультат = Результат;
		Иначе
			Фамилия 	= СокрЛП(Результат.Фамилия);
			Имя 		= СокрЛП(Результат.Имя);
			Отчество 	= СокрЛП(Результат.Отчество);
			ИтогРезультат = (Фамилия + " " + Имя + " " + Отчество);
		КонецЕсли;
		
	Иначе	
		Фамилия 	= СокрЛП(Результат.Фамилия);
		Имя 		= СокрЛП(Результат.Имя);
		Отчество 	= СокрЛП(Результат.Отчество);
		ИтогРезультат = (Фамилия + " " + Лев(Имя,1) + "." + Лев(Отчество,1)+ ".");
		Если СтрДлина(СокрЛП(ИтогРезультат))<= 3 Тогда
			ИтогРезультат = "";  
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ИтогРезультат;
	
КонецФункции

// Преобразовывает исходную строку по формату представления реквизитов типа ФИО.
// Разделительные пробелы заменяет запятыми и преобразовывает символы в верхний регистр.
// 
//   Строка, преобразованная по формату МНС.
Функция СтрЗаменитьПробелы(ИсхСтрока) Экспорт
	
	ПромСтр=СокрЛП(ИсхСтрока); 
	
	Если ПустаяСтрока(ПромСтр) Тогда
		ПромСтр = ",,";
		
		Возврат ПромСтр;
	КонецЕсли;
	
	// Сначала удаляем возможный недопустимый символ '.'.
	ЧП = СтрЧислоВхождений(ПромСтр,".");
	Если ЧП>0 Тогда
		Для Значение = 1 По ЧП Цикл
			РезСтр=СтрЗаменить(ПромСтр,"."," ");
			ПромСтр=РезСтр;
		КонецЦикла; 
	КонецЕсли;
	
	// Число разделительных пробелов.
	ЧП=СтрЧислоВхождений(ПромСтр," ");
	Если ЧП>0 Тогда
		Для Значение = 1 По ЧП Цикл
			РезСтр  = СтрЗаменить(ПромСтр," ",",");
			ПромСтр = РезСтр;
		КонецЦикла; 
	КонецЕсли;
	
	// Проверяем соответствие формату представления.
	КолЗап = СтрЧислоВхождений(ПромСтр,",");
	Если КолЗап < 2 Тогда
		// Дополняем недостающими запятыми.
		Для Ном=(КолЗап+1) По 2 Цикл
			ПромСтр=ПромСтр+",";
		КонецЦикла;
	ИначеЕсли КолЗап > 2 Тогда
		Пока СтрЧислоВхождений(ПромСтр, ",") <> 2 Цикл
			НайденПовтор = 0;
			
			ПозицияЗапятой = Найти(ПромСтр, ",");
			Если Сред(ПромСтр, ПозицияЗапятой + 1, 1) = "," Тогда
				НачПозиция	 = ПозицияЗапятой;
				НайденПовтор = 1;
			Иначе
				ПозицияЗапятой2 = Найти(Сред(ПромСтр, ПозицияЗапятой + 1), ",");
				Если Сред(ПромСтр, ПозицияЗапятой + ПозицияЗапятой2 + 1, 1) = "," Тогда
					НачПозиция	 = ПозицияЗапятой + ПозицияЗапятой2;
					НайденПовтор = 1;
				КонецЕсли;
			КонецЕсли;	
			
			Если НайденПовтор = 1 Тогда
				ПромСтр = Лев(ПромСтр, НачПозиция) + Сред(ПромСтр, НачПозиция + 2);
			Иначе
				Если Прав(ПромСтр, 1) = "," Тогда
					// Лишние хвостовые пробелы удаляем.
					ПромСтр = Лев(ПромСтр, СтрДлина(ПромСтр) - 1);
				Иначе
					// Лишние запятые заменяем пробелами.
					ПромСтр = Лев(ПромСтр, ПозицияЗапятой - 1) + " " + Сред(ПромСтр, ПозицияЗапятой + 1); 
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ВРег(ПромСтр);         
	
КонецФункции // СтрЗаменитьПробелы()

// Получает список проживающих по ЛС на дату и с учетом истории по ЛС.
// Параметры:
// ЛС - лицевой счет;.
// Дата - дата среза.
// ИсторияПроживающих - список всех, когда-либо проживающих на ЛС.
//
// Возвращаемое значение:
// Результат - Таблица значений.
Функция ПолучитьСписокПроживающихПоЛС(ЛС, Дата, ИсторияПроживающих = Истина)Экспорт
	Если ИсторияПроживающих Тогда
		
		Условие = "";
		
	Иначе
		
		Условие = "	ГДЕ (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
		
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	бит_ПроживающиеПоЛССрезПоследних.ПричинаВыписки,
	|	бит_ПроживающиеПоЛССрезПоследних.ПричинаПрописки,
	|	бит_ПроживающиеПоЛССрезПоследних.КудаВыписан,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаПрибытия,
	|	бит_ПроживающиеПоЛССрезПоследних.ОткудаПрибыл,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛС) КАК бит_ПроживающиеПоЛССрезПоследних
	| " + Условие + "
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЛС", ЛС);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции											   

// БИТ_ЖКХ 10.04.2012 Процедура <Описание процедуры>
//
Функция ПолучитьКомпонентуСклоненияФИО() Экспорт
	
	НайденноеЗначение = Неопределено;
	
	Попытка
		// Загружаем внешнюю компоненту.
		ПодключитьВнешнююКомпоненту("ОбщийМакет.бит_КомпонентаСклоненияФИО", "Decl", ТипВнешнейКомпоненты.Native);
		НайденноеЗначение = Новый("AddIn.Decl.CNameDecl");
	Исключение
		// Не удалось выполнить операции с внешней компонентой.
		бит_ОбщегоНазначения.СообщитьОбОшибке("Ошибка загрузки внешней компоненты для склонения ФИО! Функции склонения будут недоступны!");
	КонецПопытки;
	
	Возврат  НайденноеЗначение;
	
КонецФункции // ()

// Функция склоняет переданую фразу.
// Параметры:
//  Фраза (обязательный), тип строка.
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно.
//
//  Падеж (обязательный), тип число.
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный - кто? что?.
//   2 - Родительный  - кого? чего?.
//   3 - Дательный    - кому? чему?.
//   4 - Винительный  - кого? что?.
//   5 - Творительный - кем? чем?.
//   6 - Предложный   - о ком? о чем?.
//
Функция Просклонять(Знач Фраза = "", Падеж = 1, Пол = Неопределено, Результат) Экспорт
	
	Компонента = ПолучитьКомпонентуСклоненияФИО();
	
	Если Компонента = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = "";
	
	МассивСтрок = бит_ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Фраза, " ");
	
	// Выделим первые 3 слова, так как компонента не умеет склонять фразу большую 3х символов.
	НомерНесклоняемогоСимвола = 4;
	Для Номер = 1 По Мин(МассивСтрок.Количество(), 3) Цикл
		Если Не бит_ПаспортныйСтолКлиетСервер.ФИОНаписаноВерно(МассивСтрок[Номер-1], Истина) Тогда
			НомерНесклоняемогоСимвола = Номер;
			Прервать;
		КонецЕсли;
		
		Результат = Результат + ?(Номер > 1, " ", "") + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Если ПустаяСтрока(Результат) Тогда
		Результат = Фраза;
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Если Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			Результат = Компонента.Просклонять(Результат, Падеж, 1) + " ";
			
		ИначеЕсли Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Результат = Компонента.Просклонять(Результат, Падеж, 2) + " ";
			
		Иначе
			Результат = Компонента.Просклонять(Результат, Падеж) + " ";
			
		КонецЕсли;
		
	Исключение
		Результат = Фраза;
		Возврат Ложь;
		
	КонецПопытки;
	
	// Остальные символы добавим без склонения.
	Для Номер = НомерНесклоняемогоСимвола По МассивСтрок.Количество() Цикл
		Результат = Результат + " " + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Результат = СокрЛП(Результат);
	
	Возврат Истина;
	
КонецФункции // Просклонять()

// Функция определяет пол физлица по его отчеству перенос с модуля бит_ПаспортныйСтолКлиент.
//
Функция ПолучитьПол(ОтчествоРаботника) Экспорт
	
	Если Прав(ОтчествоРаботника, 2) = "ич" Тогда
		Возврат Перечисления.ПолФизическогоЛица.Мужской;
		
	ИначеЕсли Прав(ОтчествоРаботника, 2) = "на" Тогда
		Возврат Перечисления.ПолФизическогоЛица.Женский;
		
	КонецЕсли;
	
	Возврат Перечисления.ПолФизическогоЛица.ПустаяСсылка();
	
КонецФункции // ПолучитьПол()

// Функция возвращает структура адреса объекта по параметрам.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Структура.
//
Функция ПолучитьСтруктуруАдресаИзКонтактнойИнформации(Объект, Тип, Вид) Экспорт
	
	СтруктураДанных = Новый Структура("
	|Тип,
	|Вид,
	|Представление,
	|Индекс,
	|Регион,
	|Район,
	|Город,
	|НасПункт,
	|Улица,
	|Дом,
	|Корпус,
	|Квартира,
	|Страна,
	|Комментарий,
	|ЗначениеПоУмолчанию,
	|ТипДома,
	|ТипКорпуса,
	|ТипКвартиры,
	|ПользовательЛичногоКонтакта");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип"   , Тип);
	Запрос.УстановитьПараметр("Вид"   , Вид);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1 КАК Индекс,
	|	КонтактнаяИнформация.Поле2 КАК Регион,
	|	КонтактнаяИнформация.Поле3 КАК Район,
	|	КонтактнаяИнформация.Поле4 КАК Город,
	|	КонтактнаяИнформация.Поле5 КАК НасПункт,
	|	КонтактнаяИнформация.Поле6 КАК Улица,
	|	КонтактнаяИнформация.Поле7 КАК Дом,
	|	КонтактнаяИнформация.Поле8 КАК Корпус,
	|	КонтактнаяИнформация.Поле9 КАК Квартира,
	|	КонтактнаяИнформация.Поле10 КАК Страна,
	|	КонтактнаяИнформация.Комментарий,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтактнаяИнформация.ТипДома,
	|	КонтактнаяИнформация.ТипКорпуса,
	|	КонтактнаяИнформация.ТипКвартиры,
	|	КонтактнаяИнформация.ПользовательЛичногоКонтакта
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид" ;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") 
		ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бит_КонтактнаяИнформация", "КонтактнаяИнформация");
		
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции // ()

// Функция возвращает структура телефона объекта по параметрам.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Структура.
//
Функция ПолучитьСтруктуруТелефонаИзКонтактнойИнформации(Объект, Тип, Вид) Экспорт
	
	СтруктураДанных = Новый Структура("
	|Тип,
	|Вид,
	|Представление,
	|КодСтраны,
	|КодГорода,
	|Телефон,
	|Добавочный,
	|Комментарий");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип"   , Тип);
	Запрос.УстановитьПараметр("Вид"   , Вид);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1 КАК КодСтраны,
	|	КонтактнаяИнформация.Поле2 КАК КодГорода,
	|	КонтактнаяИнформация.Поле3 КАК Телефон,
	|	КонтактнаяИнформация.Поле4 КАК Добавочный,
	|	КонтактнаяИнформация.Комментарий,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид" ;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") 
		ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бит_КонтактнаяИнформация", "КонтактнаяИнформация");
		
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции // ()

// Функция находит актуальное значение адреса в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//  ТипАдреса - тип контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного адреса.
//
Функция ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса = "") Экспорт
	
	ОбъектКонтактнойИнформации = Объект;
	
	Если НЕ ЗначениеЗаполнено(ТипАдреса) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипАдреса="Фактический" Тогда
		Начало = "Факт";
	ИначеЕсли ТипАдреса="Регистрации"
		ИЛИ ТипАдреса="Юридический" Тогда
		Начало = "Юр";
	ИначеЕсли ТипАдреса="Почтовый" Тогда
		Начало = "Почтовый";
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		Окончание = "Проживающего";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
		Окончание = "Здания";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.бит_ОрганыФМС") Тогда
		Окончание = "ОрганаФМС";
	Иначе
		Возврат "";
	КонецЕсли; 
	
	// БИТ_ЖКХ 24.11.2014{{
	Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
		//9.11.2018
//		ВидАдреса = Справочники.бит_ВидыКонтактнойИнформацииЖКХ[Начало+"Адрес"+Окончание];
		ВидАдреса = Справочники.ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];

		
		Отбор = Новый Структура();
		Отбор.Вставить("Вид",ВидАдреса);
		
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если НЕ Строки.количество() = 0 Тогда
			
			Возврат Строки[0].Представление;
			
		Иначе
			
			ВидАдреса = Справочники.бит_ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Объект", ОбъектКонтактнойИнформации);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Адрес);
			Запрос.УстановитьПараметр("Вид"   , ВидАдреса);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И
			|	КонтактнаяИнформация.Тип = &Тип
			|	И
			|	КонтактнаяИнформация.Вид = &Вид
			|";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Возврат "";
			Иначе
				Возврат РезультатЗапроса.Выгрузить()[0].Представление;
			КонецЕсли;
			
		КонецЕсли;	
		
	Иначе	
		
		ВидАдреса = Справочники.бит_ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Объект", ОбъектКонтактнойИнформации);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("Вид"   , ВидАдреса);
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И
		|	КонтактнаяИнформация.Тип = &Тип
		|	И
		|	КонтактнаяИнформация.Вид = &Вид
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат "";
		Иначе
			Возврат РезультатЗапроса.Выгрузить()[0].Представление;
		КонецЕсли;
		
	КонецЕсли;
	// БИТ_ЖКХ 24.11.2014}}
	
КонецФункции // ПолучитьАдресИзКонтактнойИнформации()

// Функция находит актуальное значение телефона в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного телефона.
//
Функция ПолучитьТелефонИзКонтактнойИнформации(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		Окончание = "Проживающего";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.бит_ПодразделенияОрганизаций") Тогда
		Окончание = "ПодразделенияОрганизации";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.бит_ОрганыФМС") Тогда
		Окончание = "ОрганаФМС";
		
		// БИТ_ЖКХ 24.03.2014{{	
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Окончание = "Проживающего";
		// БИТ_ЖКХ 24.03.2014}}
		
	КонецЕсли;
	
	// БИТ_ЖКХ 24.11.2014{{
	Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
		//9.11.2018
//		ВидАдреса = Справочники.бит_ВидыКонтактнойИнформацииЖКХ["Телефон" + Окончание];
		ВидАдреса = Справочники.ВидыКонтактнойИнформации["Телефон" + Окончание];

		
		Отбор = Новый Структура();
		Отбор.Вставить("Вид",ВидАдреса);
		
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если НЕ Строки.количество() = 0 Тогда
			
			Возврат Строки[0].Представление;
			
		Иначе
			
			ВидТелефона = Справочники.бит_ВидыКонтактнойИнформации["Телефон" + Окончание];
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Объект", Объект);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Телефон);
			Запрос.УстановитьПараметр("Вид"   , ВидТелефона);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И
			|	КонтактнаяИнформация.Тип = &Тип
			|	И
			|	КонтактнаяИнформация.Вид = &Вид
			|";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Возврат "";
			Иначе
				Возврат РезультатЗапроса.Выгрузить()[0].Представление;
			КонецЕсли;
			
		КонецЕсли;	
		
	Иначе	
		
		ВидТелефона = Справочники.бит_ВидыКонтактнойИнформации["Телефон" + Окончание];
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("Вид"   , ВидТелефона);
		
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И
		|	КонтактнаяИнформация.Тип = &Тип
		|	И
		|	КонтактнаяИнформация.Вид = &Вид
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат "";
		Иначе
			Возврат РезультатЗапроса.Выгрузить()[0].Представление;
		КонецЕсли;
		
	КонецЕсли;
	// БИТ_ЖКХ 24.11.2014}}	
	
КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()

// Функция находит актуальное значение телефона в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного телефона.
//
Функция ПолучитьВебСтраницуИзКонтактнойИнформации(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		Окончание = "Проживающего";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.бит_ПодразделенияОрганизаций") Тогда
		Окончание = "ПодразделенияОрганизации";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.бит_ОрганыФМС") Тогда
		Окончание = "ОрганаФМС";
	КонецЕсли;
	
	// БИТ_ЖКХ 24.11.2014{{
	Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
		//9.11.2018
//		ВидАдреса = Справочники.бит_ВидыКонтактнойИнформацииЖКХ["ВебСтраница" + Окончание];
		ВидАдреса = Справочники.ВидыКонтактнойИнформации["ВебСтраница" + Окончание];

		
		Отбор = Новый Структура();
		Отбор.Вставить("Вид",ВидАдреса);
		
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если НЕ Строки.количество() = 0 Тогда
			
			Возврат Строки[0].Представление;
			
		Иначе
			
			ВидВебСтраницы = Справочники.бит_ВидыКонтактнойИнформации["ВебСтраница" + Окончание];
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Объект", Объект);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.ВебСтраница);
			Запрос.УстановитьПараметр("Вид"   , ВидВебСтраницы);
			
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И
			|	КонтактнаяИнформация.Тип = &Тип
			|	И
			|	КонтактнаяИнформация.Вид = &Вид
			|";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Возврат "";
			Иначе
				Возврат РезультатЗапроса.Выгрузить()[0].Представление;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВидВебСтраницы = Справочники.бит_ВидыКонтактнойИнформации["ВебСтраница" + Окончание];
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.бит_ТипыКонтактнойИнформации.ВебСтраница);
		Запрос.УстановитьПараметр("Вид"   , ВидВебСтраницы);
		
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И
		|	КонтактнаяИнформация.Тип = &Тип
		|	И
		|	КонтактнаяИнформация.Вид = &Вид
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат "";
		Иначе
			Возврат РезультатЗапроса.Выгрузить()[0].Представление;
		КонецЕсли;
		
	КонецЕсли;
	// БИТ_ЖКХ 24.11.2014}}
	
КонецФункции // ПолучитьВебСтраницуИзКонтактнойИнформации()

//  Функция получает адрес, телефон и т.д. из контактной информации.
// Параметры:
// Объект - СправочникСсылка;.
// Тип - Перечисления.бит_ТипыКонтактнойИнформации;.
// Вид - Справочники.бит_ВидыКонтактнойИнформации;.
// Результат:
// Структура/массив структур - строка/строки из регистра сведений  бит_КонтактнаяИнформация.
Функция ПолнаяКонтактнаяИнформацияПоОбъекту(Объект,Тип = Неопределено, Вид = Неопределено) Экспорт 
	// БИТ_ЖКХ добавление кода Начало: 16.08.2012 
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		СтруктураДанных = Неопределено;
		Возврат СтруктураДанных;                        
	КонецЕсли;	
	// БИТ_ЖКХ добавление кода конец : 16.08.2012
	
	ЗапросАдрес = Новый Запрос;
	ЗапросАдрес.УстановитьПараметр("Объект", 	Объект);
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		регистр = "РегистрСведений.КонтактнаяИнформация";
		
		// БИТ_ЖКХ Комментирование кода: 16.08.2012
		// Если Тип = Неопределено Тогда.
		//	Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;.
		// КонецЕсли;.
		
		Если Вид = Неопределено Тогда              
			условие = "";
		ИначеЕсли ТипЗнч(Вид) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			условие = "И КонтактнаяИнформация.Вид = &Вид";
		Иначе
			условие = "";
		КонецЕсли;
		
	Иначе	                             
		регистр = "РегистрСведений.бит_КонтактнаяИнформация";
		
		// БИТ_ЖКХ Комментирование кода: 16.08.2012
		// Если Тип = Неопределено Тогда.
		//	Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;.
		// КонецЕсли;.
		
		Если Вид = Неопределено Тогда              
			условие = "";
		ИначеЕсли ТипЗнч(Вид) = Тип("СправочникСсылка.бит_ВидыКонтактнойИнформации") Тогда
			условие = " И КонтактнаяИнформация.Вид = &Вид";
		Иначе
			условие = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тип) Тогда
		условие = условие + " И КонтактнаяИнформация.Тип = &Тип";
	КонецЕсли;
	
	ЗапросАдрес.УстановитьПараметр("Тип", 		Тип);
	ЗапросАдрес.УстановитьПараметр("Вид", 		Вид);
	ЗапросАдрес.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1 КАК Индекс,
	|	КонтактнаяИнформация.Поле2 КАК Регион,
	|	КонтактнаяИнформация.Поле3 КАК Район,
	|	КонтактнаяИнформация.Поле4 КАК Город,
	|	КонтактнаяИнформация.Поле5 КАК НасПункт,
	|	КонтактнаяИнформация.Поле6 КАК Улица,
	|	КонтактнаяИнформация.Поле7 КАК Дом,
	|	КонтактнаяИнформация.Поле8 КАК Корпус,
	|	КонтактнаяИнформация.Поле9 КАК Квартира,
	|	КонтактнаяИнформация.Поле10 КАК Страна,
	|	КонтактнаяИнформация.Комментарий,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтактнаяИнформация.ТипДома,
	|	КонтактнаяИнформация.ТипКорпуса,
	|	КонтактнаяИнформация.ТипКвартиры,
	|	КонтактнаяИнформация.ПользовательЛичногоКонтакта
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект" ;
	
	
	Выборка = ЗапросАдрес.Выполнить();
	Результат = Выборка.Выгрузить();
	// БИТ_ЖКХ изменения кода . Начало: 16.08.2012
	Если НЕ ЗначениеЗаполнено(Тип) Тогда
		
		СтруктураДанных = Новый Структура("Тип,Вид,Представление,
		|Поле1,Поле2,Поле3,Поле4,Поле5,Поле6,Поле7,Поле8,Поле9,Поле10,
		|Комментарий,ЗначениеПоУмолчанию,ТипДома,ТипКорпуса,ТипКвартиры,ПользовательЛичногоКонтакта");
		Если Результат.Количество()>0 Тогда
			Если Результат.Количество() = 1 Тогда
				Итог = Результат[0];
				ЗаполнитьЗначенияСвойств(СтруктураДанных,Итог);
				СтруктураДанных.Поле1 	= Итог.Индекс;
				СтруктураДанных.Поле2 	= Итог.Регион;
				СтруктураДанных.Поле3 	= Итог.Район;
				СтруктураДанных.Поле4 	= Итог.Город;
				СтруктураДанных.Поле5 	= Итог.НасПункт;
				СтруктураДанных.Поле6 	= Итог.Улица;
				СтруктураДанных.Поле7 	= Итог.Дом;
				СтруктураДанных.Поле8 	= Итог.Корпус;
				СтруктураДанных.Поле9 	= Итог.Квартира;
				СтруктураДанных.Поле10 	= Итог.Страна;
				
			Иначе
				МассивСтруктур = Новый Массив;
				Для каждого СтрокаРезультат Из Результат Цикл
					
					СтруктураДанных = Новый Структура("Тип,Вид,Представление,
					|Поле1,Поле2,Поле3,Поле4,Поле5,Поле6,Поле7,Поле8,Поле9,Поле10,
					|Комментарий,ЗначениеПоУмолчанию,ТипДома,ТипКорпуса,ТипКвартиры,ПользовательЛичногоКонтакта");
					
					ЗаполнитьЗначенияСвойств(СтруктураДанных,СтрокаРезультат);
					СтруктураДанных.Поле1 	= СтрокаРезультат.Индекс;
					СтруктураДанных.Поле2 	= СтрокаРезультат.Регион;
					СтруктураДанных.Поле3 	= СтрокаРезультат.Район;
					СтруктураДанных.Поле4 	= СтрокаРезультат.Город;
					СтруктураДанных.Поле5 	= СтрокаРезультат.НасПункт;
					СтруктураДанных.Поле6 	= СтрокаРезультат.Улица;
					СтруктураДанных.Поле7 	= СтрокаРезультат.Дом;
					СтруктураДанных.Поле8 	= СтрокаРезультат.Корпус;
					СтруктураДанных.Поле9 	= СтрокаРезультат.Квартира;
					СтруктураДанных.Поле10 	= СтрокаРезультат.Страна;
					
					МассивСтруктур.Добавить(СтруктураДанных);	
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;		
	Иначе
		
		Если Тип = Перечисления.бит_ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураДанных = Новый Структура("Тип,Вид,Представление,КодСтраны,КодГорода,
			|Телефон, Добавочный,Комментарий");
			Если Результат.Количество()>0 Тогда
				Если Результат.Количество() = 1 Тогда
					Итог = Результат[0];
					ЗаполнитьЗначенияСвойств(СтруктураДанных,Итог);
					СтруктураДанных.КодСтраны 	= Итог.Индекс;
					СтруктураДанных.КодГорода 	= Итог.Регион;
					СтруктураДанных.Телефон 	= Итог.Район;
					СтруктураДанных.Добавочный 	= Итог.Город;
				Иначе
					МассивСтруктур = Новый Массив;
					Для каждого СтрокаРезультат Из Результат Цикл
						
						СтруктураДанных = Новый Структура("Тип,Вид,Представление,КодСтраны,КодГорода,
						|Телефон, Добавочный,Комментарий");
						ЗаполнитьЗначенияСвойств(СтруктураДанных,СтрокаРезультат);
						СтруктураДанных.КодСтраны 	= СтрокаРезультат.Индекс;
						СтруктураДанных.КодГорода 	= СтрокаРезультат.Регион;
						СтруктураДанных.Телефон 	= СтрокаРезультат.Район;
						СтруктураДанных.Добавочный 	= СтрокаРезультат.Город;
						МассивСтруктур.Добавить(СтруктураДанных);	
					КонецЦикла;
				КонецЕсли;
			КонецЕсли; 
			
		ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты
			ИЛИ Тип = Перечисления.бит_ТипыКонтактнойИнформации.ВебСтраница
			ИЛИ Тип = Перечисления.бит_ТипыКонтактнойИнформации.Другое Тогда
			СтруктураДанных = Новый Структура("Тип,Вид,Представление,Комментарий");
			Если Результат.Количество()>0 Тогда
				Если Результат.Количество() = 1 Тогда
					Итог = Результат[0];
					ЗаполнитьЗначенияСвойств(СтруктураДанных,Итог);
				Иначе
					МассивСтруктур = Новый Массив;
					Для каждого СтрокаРезультат Из Результат Цикл
						СтруктураДанных = Новый Структура("Тип,Вид,Представление,Комментарий");
						ЗаполнитьЗначенияСвойств(СтруктураДанных,СтрокаРезультат);
						МассивСтруктур.Добавить(СтруктураДанных);	
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли; 
			
		Иначе
			СтруктураДанных = Новый Структура("Тип,Вид,Представление,Индекс,Регион,
			|Район,Город,НасПункт,Улица,Дом,Корпус,Квартира,Страна,Комментарий,
			|ЗначениеПоУмолчанию,ТипДома, ТипКорпуса, ТипКвартиры, ПользовательЛичногоКонтакта");
			
			Если Результат.Количество()>0 Тогда
				Если Результат.Количество() = 1 Тогда
					Итог = Результат[0];
					ЗаполнитьЗначенияСвойств(СтруктураДанных,Итог);
				Иначе
					МассивСтруктур = Новый Массив;
					Для каждого СтрокаРезультат Из Результат Цикл
						СтруктураДанных = Новый Структура("Тип,Вид,Представление,Индекс,Регион,
						|Район,Город,НасПункт,Улица,Дом,Корпус,Квартира,Страна,Комментарий,
						|ЗначениеПоУмолчанию,ТипДома, ТипКорпуса, ТипКвартиры, ПользовательЛичногоКонтакта");
						ЗаполнитьЗначенияСвойств(СтруктураДанных,СтрокаРезультат);
						МассивСтруктур.Добавить(СтруктураДанных);	
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Количество()>1 Тогда
		
		Возврат МассивСтруктур;
	Иначе
		Возврат СтруктураДанных;
	КонецЕсли;
	// БИТ_ЖКХ изменения кода . Конец  16.08.2012
КонецФункции 

// функция формирует краткое ФИО проживающего или физлица.
// Параметры:
//  <ФизЛицо>  – <Справочник.бит_Проживающие или Справочник.ФизическиеЛица>.
//  <Флаг>  – булево, при истине: данные берет из регистра ФИОФизЛиц.
// При значении ложь: данные берет из регистра бит_ФИОПроживающих.
//
// Возвращаемое значение:
//   <Строка>   – <краткое ФИО владельца ЛС>.
//
Функция ПолучитьСокращенноеФИО(ФизЛицо = Неопределено,ДатаК = Неопределено, Флаг = ложь) Экспорт
	
	Если ФизЛицо = Неопределено Тогда
		
		Если Флаг Тогда
			
			ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
			
		Иначе
			
			ФизЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если  ДатаК = Неопределено Тогда
		
		ДатаК  = ТекущаяДата();
	КонецЕсли;
	ФИО = ""; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ФИОПроживающихСрезПоследних.Период,
	|	бит_ФИОПроживающихСрезПоследних.ФизЛицо,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ФизЛицо = &ФизЛицо) КАК бит_ФИОПроживающихСрезПоследних";
	
	Запрос.УстановитьПараметр("Момент", КонецМесяца(ДатаК));
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИнициалИмени = Лев(ВыборкаДетальныеЗаписи.Имя, 1);
		ИнициалОтчества = Лев(ВыборкаДетальныеЗаписи.Отчество, 1);
		Если ЗначениеЗаполнено(ИнициалИмени) Тогда
			
			ИнициалИмени = ИнициалИмени + ".";	
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(ИнициалОтчества) Тогда
			
			ИнициалОтчества  =  ИнициалОтчества + ".";
			
		КонецЕсли; 
		ФИО = ВыборкаДетальныеЗаписи.Фамилия + " " + ИнициалИмени + ИнициалОтчества;
	КонецЦикла;
	
	Если Результат.Пустой() Тогда
		Фамилия = СокрЛП(Строка(ФизЛицо));
		Если СтрЧислоВхождений(Фамилия, ".") = 0 Тогда
			
			Имя = "";
			Отчество = "";
			
			Если Найти(ФизЛицо, " ") > 0 Тогда
				
				КолвоСимволов = Найти(ФизЛицо, " ");
				Фамилия = Сред(ФизЛицо, 1, КолвоСимволов - 1);
				
				ИмяОтчество = СокрЛП(Прав(ФизЛицо, СтрДлина(ФизЛицо) - КолвоСимволов));
				
			КонецЕсли;
			
			Если Найти(ИмяОтчество," ") > 0 Тогда
				КолвоСимволов = Найти(ИмяОтчество, " ");
				Имя =  Сред(ИмяОтчество, 1, КолвоСимволов - 1);
				Отчество = Прав(ИмяОтчество, СтрДлина(ИмяОтчество) - КолвоСимволов);
				
				ИнициалИмени = Лев(Имя, 1);
				ИнициалОтчества = Лев(Отчество, 1);
				ФИО =  Фамилия + " " + ИнициалИмени + "." + ИнициалОтчества + ".";
			Иначе
				Имя = ИмяОтчество;
				ИнициалИмени = Лев(Имя, 1);
				ФИО =  Фамилия + " " + ?(ЗначениеЗаполнено(ИнициалИмени), ИнициалИмени + ".","");
			КонецЕсли;
		Иначе
			ФИО = Фамилия;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ФИО;
	
КонецФункции // ПолучитьСокращенноеФИО()

// Функция формирует структуру с данными Ответственного по ЛС.
Функция ПолучитьОтветственногоПоЛС(ЛицевойСчет = Неопределено, Момент) Экспорт
	
	СтруктураДанных = Новый Структура("ЛицевойСчет,ФизЛицо,Контрагент");
	Если НЕ ЗначениеЗаполнено(Момент) Тогда
		
		Момент = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент
	|ИЗ
	|	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_ОтветственныеЛицаПоКУСрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", 	ЛицевойСчет);
	Запрос.УстановитьПараметр("Момент", 		Момент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных,Результат[0]);
		
	КонецЕсли; 
	
	Возврат СтруктураДанных;                            
	
КонецФункции // ()

// функция формирует таблицу значений данных комнат квартиры на дату.
Функция ПолучитьДанныеКомнатКвартиры(Квартира,Момент ) Экспорт
	Если Момент = Неопределено Тогда
		
		Момент = Дата('00010101000000');
		
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(бит_СведенияОКомнатеСрезПоследних.Площадь, 0) КАК Площадь,
	|	бит_СведенияОКомнатеСрезПоследних.Комната.ЧастьПомещения.Наименование КАК Комната,
	|	бит_СведенияОКомнатеСрезПоследних.Комната.ЧастьПомещения.ТипКомнаты КАК ТипКомнаты,
	|	бит_СведенияОКомнатеСрезПоследних.Комната.ЧастьПомещения.Принадлежность КАК Принадлежность,
	|	бит_СведенияОКомнатеСрезПоследних.Комната.ЧастьПомещения.КоэффициентНачислений КАК КоэффициентНачислений,
	|	бит_СведенияОКомнатеСрезПоследних.Комната.ЧастьПомещения КАК ЧастьПомещения,
	|	бит_СведенияОКомнатеСрезПоследних.Комната.НомерКомнаты КАК НомерКомнаты
	|ИЗ
	|	РегистрСведений.бит_СведенияОКомнате.СрезПоследних(&Момент, Комната.Владелец = &Квартира) КАК бит_СведенияОКомнатеСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерКомнаты";
	
	Запрос.УстановитьПараметр("Квартира", 	Квартира);
	Запрос.УстановитьПараметр("Момент", 	Момент);
	
	ВыборкаКомнат = Запрос.Выполнить().Выгрузить();
	
	Возврат ВыборкаКомнат;
	
КонецФункции // ПолучитьДанныеКомнатКвартиры()

// Функция находит общую площадь кухни (число) из таблицы значений.
// Можно использовать результат функции ПолучитьДанныеКомнатКвартиры.
Функция ПолучитьПлощадьКухни(ВыборкаКомнат) Экспорт
	
	ПлощадьКухни = 0;
	Для каждого СтрокаКухня Из ВыборкаКомнат Цикл
		Если СтрокаКухня.Комната = Справочники.бит_НазначениеЧастейПомещения.Кухня.Наименование Тогда
			ПлощадьКухни = ПлощадьКухни + СтрокаКухня.Площадь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПлощадьКухни;
	
КонецФункции // ПолучитьДанныеКухни()

// Массив площадей квартиры из таблицы значений комнат.
// Можно использовать результат функции ПолучитьДанныеКомнатКвартиры.
Функция ПолучитьПлощадиКвартирыИзКомнат(СписокКомнат) Экспорт
	
	Массив = Новый Массив;
	Массив.Вставить(0,"ОбщаяПлощадь");
	Массив.Вставить(1,"ЖилаяПлощадь");
	Массив.Вставить(2,"МОП_площадь");
	Массив.Вставить(3,"ОтапливаемаяПлощадь");
	Массив.Вставить(4,"СовокупнаяПлощадь");
	Массив.Вставить(5,"ВнешняяПлощадь");
	
	Площадь = Новый Массив(6);
	
	Для Счетчик = 0 По 5  Цикл

		Площадь[Счетчик] = 0;
	КонецЦикла; 
	
	Для каждого СтрокаТЧ Из СписокКомнат Цикл
		Строка = СтрокаТЧ.ЧастьПомещения;
		Если Строка.КоэффициентНачислений <> 0 Тогда 
			// Отапливаемая.
			Площадь[3] = Площадь[3] + СтрокаТЧ.Площадь;
			Если Строка.Принадлежность = Перечисления.бит_ПринадлежностьКомнат.Внутренняя Тогда
				// Общая.
				Площадь[0] = Площадь[0] + СтрокаТЧ.Площадь;
				
				Если Строка.ТипКомнаты = Справочники.бит_ТипыКомнат.Жилая 
					Тогда
					// Жилая.
					Площадь[1] = Площадь[1] + СтрокаТЧ.Площадь;
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если Строка.Принадлежность = Перечисления.бит_ПринадлежностьКомнат.Внешняя Тогда
			// Внешняя.
			Площадь[5] = Площадь[5] + СтрокаТЧ.Площадь;
		КонецЕсли;	
		
		Если Строка.ТипКомнаты = Справочники.бит_ТипыКомнат.МОП Тогда
			// МОП.
			Площадь[2] = Площадь[2] + СтрокаТЧ.Площадь;
		КонецЕсли;
		
		// Совокупная.
		Площадь[4] = Площадь[4] + СтрокаТЧ.Площадь;
	КонецЦикла;  
	
	Возврат Площадь; 
	
КонецФункции //

// Функция получает таблицу значений услуг, подключенных на ЛС на Момент времени.
Функция ПолучитьСписокУслугПоЛС(ЛицевойСчет,Момент )Экспорт
	Если Момент = Неопределено Тогда
		
		Момент = ТекущаяДата();
		
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ГрафаОтчетаГЦЖС КАК ГрафаОтчетаГЦЖС
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Момент,
	|			ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.бит_УстановкаИзменениеУслугПоЛС)
	|				И ЛицевойСчет = &ЛицевойСчет
	|				И РежимПотребления <> ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.Нет)) КАК бит_СведенияПоУслугамЛССрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", 	ЛицевойСчет);
	Запрос.УстановитьПараметр("Момент", 		Момент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьСписокУслугПоЛС()

// Функция получает таблицу значений счетчиков услуг, подключенных на ЛС на Момент времени.
Функция ПолучитьСписокСчетчиковНаЛС(ЛицевойСчет,Момент)Экспорт
	Если Момент = Неопределено  Тогда
		
		Момент = ТекущаяДата();
		
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
	|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК Счетчики,
	|	бит_ГрупповыеСчетчикиСрезПоследних.Услуга,
	|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать,
	|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик.ТипСчетчика КАК ТипСчетчика
	|ИЗ
	|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_ГрупповыеСчетчикиСрезПоследних
	|ГДЕ
	|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик.ТипСчетчика
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Момент, Объект = &ЛицевойСчет) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", 	ЛицевойСчет);
	Запрос.УстановитьПараметр("Момент", 		Момент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьСписокСчетчиковНаЛС()

// Функция получает таблицу значений льготников по лицевому счету, проживающих на данный момент.
Функция ПолучитьСписокЛьготниковПоЛС(ЛицевойСчет, Момент) Экспорт
	
	Если Момент = Неопределено  Тогда
		
		Момент = ТекущаяДата();
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Льготы.ФизЛицо,
	|	Льготы.Льгота,
	|	Льготы.СрокДействияЛьготы,
	|	ФизЛица.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	ФизЛица.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	Льготы.Период,
	|	Льготы.ДокументНаЛьготуНаименование,
	|	Льготы.НомерДокумента,
	|	Льготы.ДатаВыдачи,
	|	Льготы.ДокументНаЛьготуНаименование + "" №"" + Льготы.НомерДокумента КАК ДокументНаЛьготу
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|		ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|		ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|		ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|		ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|		ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации
	|	ИЗ
	|		РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|	ГДЕ
	|		(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))) КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ЛьготыПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|			бит_ЛьготыПоЛССрезПоследних.Льготы КАК Льгота,
	|			бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы КАК СрокДействияЛьготы,
	|			бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу КАК ДокументНаЛьготу,
	|			бит_ЛьготыПоЛССрезПоследних.Период КАК Период,
	|			бит_ЛьготыПоЛССрезПоследних.НомерДокумента КАК НомерДокумента,
	|			бит_ЛьготыПоЛССрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|			бит_ЛьготыПоЛССрезПоследних.ДокументНаЛьготу.Наименование КАК ДокументНаЛьготуНаименование
	|		ИЗ
	|			РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_ЛьготыПоЛССрезПоследних
	|		ГДЕ
	|			(бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &Момент
	|					ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1))) КАК Льготы
	|		ПО ФизЛица.ФизЛицо = Льготы.ФизЛицо
	|ГДЕ
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Момент", Момент);
	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	
	Возврат Результат;
	
КонецФункции // ПолучитьСписокЛьготниковПоЛС()

// Функция получает таблицу значений сумм начислений по услугам на лицевом счете.
Функция ПолучитьРасчетыПоУслугам(ЛицевойСчет, Момент) Экспорт
	
	Если Момент = Неопределено  Тогда
		
		Момент = ТекущаяДата();
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга,
	|	СУММА(бит_ОбъемыПоУслугамЖКХОбороты.ОбъемОборот) КАК Объем,
	|	НАЧАЛОПЕРИОДА(бит_ОбъемыПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК МесяцГод
	|ПОМЕСТИТЬ Объемы
	|ИЗ
	|	РегистрНакопления.бит_ОбъемыПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_ОбъемыПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъемыПоУслугамЖКХОбороты.Услуга,
	|	НАЧАЛОПЕРИОДА(бит_ОбъемыПоУслугамЖКХОбороты.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК МесяцГод,
	|	НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ТОГДА ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.СуммаОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Льгота,
	|	СУММА(ЕСТЬNULL(НачисленияПоУслугамЖКХОбороты.ОбъемОборот, 0)) КАК Объем
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ЛицевойСчет = &ЛицевойСчет) КАК НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
	|	НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаОстатков.Услуга,
	|	ТаблицаОстатков.МесяцГод,
	|	ТаблицаОстатков.ВхСальдо,
	|	ТаблицаОстатков.ИсхСальдо
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	&ТаблицаОстатков КАК ТаблицаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Остатки.ВхСальдо, 0) КАК ВхСальдо,
	|	ЕСТЬNULL(Остатки.ИсхСальдо, 0) КАК ИсхСальдо,
	|	ЕСТЬNULL(Обороты.Начисления, 0) - ВЫБОР
	|		КОГДА ЕСТЬNULL(Обороты.Льгота, 0) < 0
	|			ТОГДА ЕСТЬNULL(Обороты.Льгота, 0) * -1
	|		ИНАЧЕ ЕСТЬNULL(Обороты.Льгота, 0)
	|	КОНЕЦ + ЕСТЬNULL(Обороты.Разовые, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Обороты.Оплата, 0) < 0
	|			ТОГДА ЕСТЬNULL(Обороты.Оплата, 0) * -1
	|		ИНАЧЕ ЕСТЬNULL(Обороты.Оплата, 0)
	|	КОНЕЦ КАК Оплата,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Остатки.ВхСальдо, 0) + ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ВЫБОР
	|				КОГДА ЕСТЬNULL(Обороты.Оплата, 0) < 0
	|					ТОГДА ЕСТЬNULL(Обороты.Оплата, 0) * -1
	|				ИНАЧЕ ЕСТЬNULL(Обороты.Оплата, 0)
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(Обороты.Льгота, 0) < 0
	|					ТОГДА ЕСТЬNULL(Обороты.Льгота, 0) * -1
	|				ИНАЧЕ ЕСТЬNULL(Обороты.Льгота, 0)
	|			КОНЕЦ > 0
	|			ТОГДА ЕСТЬNULL(Остатки.ВхСальдо, 0) + ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ВЫБОР
	|					КОГДА ЕСТЬNULL(Обороты.Оплата, 0) < 0
	|						ТОГДА ЕСТЬNULL(Обороты.Оплата, 0) * -1
	|					ИНАЧЕ ЕСТЬNULL(Обороты.Оплата, 0)
	|				КОНЕЦ - ВЫБОР
	|					КОГДА ЕСТЬNULL(Обороты.Льгота, 0) < 0
	|						ТОГДА ЕСТЬNULL(Обороты.Льгота, 0) * -1
	|					ИНАЧЕ ЕСТЬNULL(Обороты.Льгота, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КОплате,
	|	Остатки.Услуга КАК Услуга,
	|	Остатки.МесяцГод КАК МесяцГод,
	|	ЕСТЬNULL(Объемы.Объем, 0) КАК Объем
	|ИЗ
	|	Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО Остатки.Услуга = Обороты.Услуга
	|			И Остатки.МесяцГод = Обороты.МесяцГод
	|		ЛЕВОЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	|		ПО Остатки.МесяцГод = Объемы.МесяцГод
	|			И Остатки.Услуга = Объемы.Услуга
	|ИТОГИ
	|	СУММА(ВхСальдо),
	|	СУММА(ИсхСальдо),
	|	СУММА(Сумма),
	|	СУММА(Оплата),
	|	СУММА(КОплате),
	|	СУММА(Объем)
	|ПО
	|	МесяцГод,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Объемы" ;
	Запрос.УстановитьПараметр("ТаблицаОстатков", ПолучитьТаблицуОстатков(ЛицевойСчет, Момент));
	Запрос.УстановитьПараметр("Момент", Момент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции // ПолучитьРасчетыПоУслугам()
// ДОРАБОТАТЬ!!!.
Функция ПолучитьТаблицуОстатков(ЛицевойСчет, Момент)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Момент", Момент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период, МЕСЯЦ) КАК МесяцГод,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК СуммаНачальныйОстаток,
	|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.МесяцГод КАК МесяцГод,
	|	Остатки.УслугаЖКХ КАК Услуга,
	|	Остатки.СуммаНачальныйОстаток КАК ВхСальдо,
	|	Остатки.СуммаКонечныйОстаток КАК ИсхСальдо
	|ИЗ
	|	Остатки КАК Остатки
	|ИТОГИ
	|	СУММА(ВхСальдо),
	|	СУММА(ИсхСальдо)
	|ПО
	|	Услуга,
	|	МесяцГод ПЕРИОДАМИ(МЕСЯЦ, &НачалоПериода, &КонецПериода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки";
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("МесяцГод" , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("Услуга"   , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	Таблица.Колонки.Добавить("ВхСальдо" , ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Таблица.Колонки.Добавить("ИсхСальдо", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаУС = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцГод", "ВСЕ");
		
		Пока ВыборкаУС.Следующий() Цикл
			
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаУС);
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции // ()

// Функция получает таблицу значений данных начального сальдо по услугам на лицевом счете.
Функция ПолучитьОстаткиПоУслугам(ЛицевойСчет, Момент) Экспорт
	
	Если Момент = Неопределено  Тогда
		
		Момент = ТекущаяДата();
		
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток,
	|	бит_НачисленияПоУслугамЖКХОстатки.ОбъемОстаток
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", 	ЛицевойСчет);
	Запрос.УстановитьПараметр("Момент", 		Момент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьОстаткиПоУслугам()

// Функция получает таблицу значений данных льгот, начисленных физ лицу за период времени.
Функция ПолучитьРазмерЛьготыПоФизЛицу(ФизЛицо, Льгота, Момент)Экспорт
	
	НачалоПериода = Дата(0001,01,01,00,00,00);
	КонецПериода = КонецМесяца(Момент);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачислениеПоЛьготамОбороты.Льгота КАК Льгота,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо КАК ФизЛицо,
	|	СУММА(бит_НачислениеПоЛьготамОбороты.НачисленоОборот) КАК СуммаЛьготы,
	|	бит_НачислениеПоЛьготамОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			ФизЛицо = &ФизЛицо
	|				И Льгота = &Льгота) КАК бит_НачислениеПоЛьготамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо,
	|	бит_НачислениеПоЛьготамОбороты.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ФизЛицо", 		ФизЛицо);
	Запрос.УстановитьПараметр("Льгота", 		Льгота);
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецПериода);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Функция получает таблицу значений комнат, ответственных и количества проживающих на данный момент.
// По коммунальным квартирам на дату по зданию и номеру квартиры.
Функция ПолучитьДанныеКоммунальныхКвартир(Здание, НомерКвартиры, Момент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент", 		Момент);
	Запрос.УстановитьПараметр("Здание", 		Здание);
	Запрос.УстановитьПараметр("НомерКвартиры", 	НомерКвартиры);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь) КАК ОбщаяПлощадь,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь) КАК ЖилаяПлощадь,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.МОП) КАК МОП,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь) КАК ОтапливаемаяПлощадь,
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь) КАК СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства
	|ПОМЕСТИТЬ Квартиры
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&Момент,
	|			Квартира.Владелец.Ссылка = &Здание
	|				И Квартира.НомерКвартиры = &НомерКвартиры
	|				И ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Коммунальная)) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(бит_СведенияОКомнатеСрезПоследних.Высота) КАК Высота,
	|	МАКСИМУМ(бит_СведенияОКомнатеСрезПоследних.Площадь) КАК ЖилаяПлощадь,
	|	Квартиры.Квартира,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолвоПроживающих,
	|	бит_СведенияОКомнатеСрезПоследних.Комната,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет,
	|	МАКСИМУМ(Квартиры.МОП) КАК МОП,
	|	МАКСИМУМ(Квартиры.ОбщаяПлощадь) КАК ОбщаяПлощадь,
	|	МАКСИМУМ(Квартиры.ОтапливаемаяПлощадь) КАК ОтапливаемаяПлощадь,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо КАК Ответственный,
	|	МАКСИМУМ(Квартиры.СовокупнаяПлощадь) КАК СовокупнаяПлощадь,
	|	Квартиры.СтатусКвартиры,
	|	Квартиры.ТипКвартиры,
	|	Квартиры.ТипПлиты,
	|	Квартиры.ТипЗапирающегоУстройства
	|ИЗ
	|	Квартиры КАК Квартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКомнате.СрезПоследних(
	|				&Момент,
	|				Комната.Владелец В
	|					(ВЫБРАТЬ
	|						Квартиры.Квартира КАК Квартира
	|					ИЗ
	|						Квартиры)) КАК бит_СведенияОКомнатеСрезПоследних
	|		ПО Квартиры.Квартира = бит_СведенияОКомнатеСрезПоследних.Комната.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО Квартиры.Квартира = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ) КАК бит_ОтветственныеЛицаПоКУСрезПоследних
	|		ПО Квартиры.Квартира = бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет.Квартира
	|ГДЕ
	|	((бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|				И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент = ИСТИНА
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо ЕСТЬ NULL )
	|	И (бит_СведенияОКомнатеСрезПоследних.Комната.ЧастьПомещения.ТипКомнаты = ЗНАЧЕНИЕ(Справочник.бит_ТипыКомнат.Жилая)
	|			ИЛИ бит_СведенияОКомнатеСрезПоследних.Комната ЕСТЬ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	Квартиры.ТипЗапирающегоУстройства,
	|	бит_СведенияОКомнатеСрезПоследних.Комната,
	|	Квартиры.Квартира,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо,
	|	Квартиры.ТипПлиты,
	|	Квартиры.СтатусКвартиры,
	|	Квартиры.ТипКвартиры,
	|	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Квартиры";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Функция получает строку с данными ответственного.
// Параметры:
// Организация - справочник Организации;.
// ДолжностноеЛицо - справочник Физические лица;.
// Дата - дата среза.
// НаличиеДолжности - вводить ли в строку должность.
функция ПолучитьОтветственногоОрганизации(Организация = Неопределено, ДолжностноеЛицо = Неопределено, Дата, НаличиеДолжности = Истина) Экспорт
	ДолжностноеЛицоОрганизации = Неопределено;
	Если ЗначениеЗаполнено(ДолжностноеЛицо) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Период, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|ГДЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
		
		Запрос.УстановитьПараметр("Организация", 		Организация);
		Запрос.УстановитьПараметр("ФизическоеЛицо",		ДолжностноеЛицо);
		Если ЗначениеЗаполнено(Дата) Тогда
			Запрос.УстановитьПараметр("Период",		 		Дата);
		Иначе
			Запрос.УстановитьПараметр("Период",		 		ТекущаяДата());
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Количество() > 0 Тогда
			Результат.Следующий();
			ДолжностноеЛицоФИО = бит_ПаспортныйСтолСервер.ПолучитьСокращенноеФИО(Результат.ФизическоеЛицо, Дата, Истина);
			Если НаличиеДолжности Тогда
				ДолжностноеЛицоОрганизации = Строка(ДолжностноеЛицоФИО)+ " (" +Строка(Результат.Должность) + ")"; 
				
			Иначе
				ДолжностноеЛицоОрганизации = новый Структура;
				ДолжностноеЛицоОрганизации.Вставить("ДолжностноеЛицо",ДолжностноеЛицоФИО);
				ДолжностноеЛицоОрганизации.Вставить("Должность",Результат.Должность);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	Возврат  ДолжностноеЛицоОрганизации;
	
КонецФункции //ПолучитьОтветственногоОрганизации()

#КонецОбласти