
#Область ЭкспортныеПроцедурыИФункции

// БИТ_ЖКХ 20.06.2014
&НаСервере
Процедура ЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ(Индикатор) Экспорт
	
	// Запись организации для документа Ввод начальных показаний.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВводНачальныхОстатковПоКУ.Ссылка,
	|	бит_ВводНачальныхОстатковПоКУ.Организация
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПоКУ КАК бит_ВводНачальныхОстатковПоКУ
	|ГДЕ
	|	бит_ВводНачальныхОстатковПоКУ.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисление льгот по лицевым счетам.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачислениеЛьготПоЛицевымСчетам.Ссылка,
	|	бит_НачислениеЛьготПоЛицевымСчетам.Организация
	|ИЗ
	|	Документ.бит_НачислениеЛьготПоЛицевымСчетам КАК бит_НачислениеЛьготПоЛицевымСчетам
	|ГДЕ
	|	бит_НачислениеЛьготПоЛицевымСчетам.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисление по лицевым счетам.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачислениеПоЛицевымСчетам.Ссылка,
	|	бит_НачислениеПоЛицевымСчетам.Организация
	|ИЗ
	|	Документ.бит_НачислениеПоЛицевымСчетам КАК бит_НачислениеПоЛицевымСчетам	
	|ГДЕ
	|	бит_НачислениеПоЛицевымСчетам.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));

	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор =Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисления по счетчикам.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикам.Ссылка,
	|	бит_НачисленияПоСчетчикам.Организация
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикам КАК бит_НачисленияПоСчетчикам
	|ГДЕ
	|	бит_НачисленияПоСчетчикам.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));

	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисления по счетчикам групповые с индивидуальными.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Ссылка,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Организация
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными КАК бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|ГДЕ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Оплата КУ.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОплатаКУ.Ссылка,
	|	бит_ОплатаКУ.Организация
	|ИЗ
	|	Документ.бит_ОплатаКУ КАК бит_ОплатаКУ
	|ГДЕ
	|	бит_ОплатаКУ.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	

	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Разовые по услугам ЖКХ.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_РазовыеПоУслугамЖКХ.Ссылка,
	|	бит_РазовыеПоУслугамЖКХ.Организация
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХ.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Расчет предельного индекса.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_РасчетПредельногоИндекса.Ссылка,
	|	бит_РасчетПредельногоИндекса.Организация
	|ИЗ
	|	Документ.бит_РасчетПредельногоИндекса КАК бит_РасчетПредельногоИндекса
	|ГДЕ
	|	бит_РасчетПредельногоИндекса.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачисленияПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ(Индикатор) Экспорт
	
	// Запись организации для документа Ввод начальных остатков пени. 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВводНачальныхОстатковПениПоКУ.Ссылка,
	|	бит_ВводНачальныхОстатковПениПоКУ.Организация
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПениПоКУ КАК бит_ВводНачальныхОстатковПениПоКУ
	|ГДЕ
	|	бит_ВводНачальныхОстатковПениПоКУ.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачислениеПениПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисление пени по лицевым счетам.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачислениеПениПоЛицевымСчетам.Ссылка,
	|	бит_НачислениеПениПоЛицевымСчетам.Организация
	|ИЗ
	|	Документ.бит_НачислениеПениПоЛицевымСчетам КАК бит_НачислениеПениПоЛицевымСчетам
	|ГДЕ
	|	бит_НачислениеПениПоЛицевымСчетам.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачислениеПениПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Оплата КУ.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОплатаКУ.Ссылка,
	|	бит_ОплатаКУ.Организация
	|ИЗ
	|	Документ.бит_ОплатаКУ КАК бит_ОплатаКУ
	|ГДЕ
	|	бит_ОплатаКУ.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачислениеПениПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Разовые по услугам ЖКХ.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_РазовыеПоУслугамЖКХ.Ссылка,
	|	бит_РазовыеПоУслугамЖКХ.Организация
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХ.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_НачислениеПениПоУслугамЖКХ;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков(Индикатор) Экспорт
	
	// Запись организации для документа Ввод показаний по счетчикам.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВводПоказанийПоСчетчикам.Ссылка,
	|	бит_ВводПоказанийПоСчетчикам.Организация
	|ИЗ
	|	Документ.бит_ВводПоказанийПоСчетчикам КАК бит_ВводПоказанийПоСчетчикам
	|ГДЕ
	|	бит_ВводПоказанийПоСчетчикам.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_ПоказанияСчетчиков;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Корректировка показаний счетчиков.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_КорректировкаПоказанийСчетчиков.Ссылка,
	|	бит_КорректировкаПоказанийСчетчиков.Организация
	|ИЗ
	|	Документ.бит_КорректировкаПоказанийСчетчиков КАК бит_КорректировкаПоказанийСчетчиков
	|ГДЕ
	|	бит_КорректировкаПоказанийСчетчиков.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_ПоказанияСчетчиков;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисления по счетчикам.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикам.Ссылка,
	|	бит_НачисленияПоСчетчикам.Организация
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикам КАК бит_НачисленияПоСчетчикам
	|ГДЕ
	|	бит_НачисленияПоСчетчикам.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_ПоказанияСчетчиков;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисления по счетчикам групповые с индивидуальными.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Ссылка,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Организация
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными КАК бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|ГДЕ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_ПоказанияСчетчиков;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Разовые по услугам ЖКХ.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_РазовыеПоУслугамЖКХ.Ссылка,
	|	бит_РазовыеПоУслугамЖКХ.Организация
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХ.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_ПоказанияСчетчиков;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Установка счетчика.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УстановкаСчетчика.Ссылка,
	|	бит_УстановкаСчетчика.Организация
	|ИЗ
	|	Документ.бит_УстановкаСчетчика КАК бит_УстановкаСчетчика
	|ГДЕ
	|	бит_УстановкаСчетчика.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_ПоказанияСчетчиков;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОрганизациюРегистрабит_Распределения(Индикатор) Экспорт
	
	// Запись организации для документа Ввод сумм по распределениям.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВводСуммПоРаспределениям.Ссылка,
	|	бит_ВводСуммПоРаспределениям.Организация
	|ИЗ
	|	Документ.бит_ВводСуммПоРаспределениям КАК бит_ВводСуммПоРаспределениям
	|ГДЕ
	|	бит_ВводСуммПоРаспределениям.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_Распределения;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
	// Запись организации для документа Начисления по счетчикам.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикам.Ссылка,
	|	бит_НачисленияПоСчетчикам.Организация
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикам КАК бит_НачисленияПоСчетчикам
	|ГДЕ
	|	бит_НачисленияПоСчетчикам.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ЗначениеИндикатора = 100/ВыборкаДетальныеЗаписи.Количество();
	Иначе
		ЗначениеИндикатора = 0;
	КонецЕсли;
	
	Индикатор = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Остатки  = РегистрыНакопления.бит_Распределения;
		НаборЗаписей = Остатки.СоздатьНаборЗаписей();
		Док = НаборЗаписей.Отбор.Регистратор;
		Док.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записывать = Истина;
		Для каждого Запись из НаборЗаписей Цикл
			Запись.Организация = ВыборкаДетальныеЗаписи.Организация;
		КонецЦикла;	
		
		Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Индикатор = Индикатор + ЗначениеИндикатора;
		
	КонецЦикла;
	
КонецПроцедуры 
// БИТ_ЖКХ 20.06.2014

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ЗаполнитьРегистры(Команда)
	
	Элементы.Индикатор.Заголовок = "Индикатор";
	
	Если ЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ Тогда
		
		Индикатор = 0;
		
		ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ",1);
		
	КонецЕсли;
	
	Если ЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ Тогда
		
		Индикатор = 0;
		
		ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ",1);
		
	КонецЕсли;
	
	Если ЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков Тогда
		
		Индикатор = 0;
		
		ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков",1);
		
	КонецЕсли;
	
	Если ЗаполнитьОрганизациюРегистрабит_Распределения Тогда
		
		Индикатор = 0;
		
		ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_Распределения",1);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ()
	
	Элементы.Индикатор.Заголовок = "Индикатор";
	
	Состояние("Заполняется организация регистра накопления НачисленияПоУслугамЖКХ");	
	
	ЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ(Индикатор);	
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
	ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ1",2);
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ1()
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
	Элементы.Индикатор.Заголовок = "Заполнено";
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачисленияПоУслугамЖКХ1");
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ()
	
	Элементы.Индикатор.Заголовок = "Индикатор";
	
	Состояние("Заполняется организация регистра накопления НачислениеПениПоУслугамЖКХ");	
	
	ЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ(Индикатор);
	
	Состояние("Заполнена организация регистра накопления НачислениеПениПоУслугамЖКХ");	
	
	ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ",2);
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ");
	
	Состояние("Заполнена организация регистра накопления НачислениеПениПоУслугамЖКХ");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ1()
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
	Элементы.Индикатор.Заголовок = "Заполнено";
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_НачислениеПениПоУслугамЖКХ1");
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков()
	
	Элементы.Индикатор.Заголовок = "Индикатор";
	
	Состояние("Заполняется организация регистра накопления ПоказанияСчетчиков");	
	
	ЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков(Индикатор);	
	
	Состояние("Заполнена организация регистра накопления ПоказанияСчетчиков");	
	
	ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков1",2);
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков");
	
	Состояние("Заполнена организация регистра накопления ПоказанияСчетчиков");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков1()
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
	Элементы.Индикатор.Заголовок = "Заполнено";
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_ПоказанияСчетчиков1");
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_Распределения()
	
	Элементы.Индикатор.Заголовок = "Индикатор";
	
	Состояние("Заполняется организация регистра накопления Распределения");	
	
	ЗаполнитьОрганизациюРегистрабит_Распределения(Индикатор);
	
	Состояние("Заполнена организация регистра накопления Распределения");	
	
	ПодключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_Распределения1",2);
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_Распределения");
	
	Состояние("Заполнена организация регистра накопления Распределения");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗаполнитьОрганизациюРегистрабит_Распределения1()
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
	Элементы.Индикатор.Заголовок = "Заполнено";
	
	ОтключитьОбработчикОжидания("ЖдатьЗаполнитьОрганизациюРегистрабит_Распределения1");
	
	Состояние("Заполнена организация регистра накопления НачисленияПоУслугамЖКХ");	
	
КонецПроцедуры

#КонецОбласти