#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьОтклоненияОтВремени() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЧасовыеЗоныПоOlson.Ссылка
	|ИЗ
	|	Справочник.бит_ЧасовыеЗоныПоOlson КАК бит_ЧасовыеЗоныПоOlson
	|ГДЕ
	|	бит_ЧасовыеЗоныПоOlson.Предопределенный
	|	И бит_ЧасовыеЗоныПоOlson.ОтклонениеОтВремениПоГринвичу <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЧасовыеЗоныПоOlson.Ссылка,
	|	бит_ЧасовыеЗоныПоOlson.ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.бит_ЧасовыеЗоныПоOlson КАК бит_ЧасовыеЗоныПоOlson
	|ГДЕ
	|	бит_ЧасовыеЗоныПоOlson.Предопределенный";
	
	Результат = Запрос.ВыполнитьПакет();
	// БИТ_ЖКХ 12.08.2016 9:43:36 Начало правки... 
	//Если НЕ Результат[0].Пустой() Тогда
	//	Возврат;	
	//КонецЕсли;
	// БИТ_ЖКХ 12.08.2016 9:43:39 Конец правки. 
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		
		Если Выборка.ИмяПредопределенныхДанных = "Калининград" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 2;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Москва"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Симферополь" 
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Волгоград" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 3;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Астрахань"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Самара" 
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Ульяновск" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 4;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Екатеринбург" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 5;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Омск" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 6;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Кемерово"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Барнаул"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Красноярск"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Новокузнецк"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Новосибирск" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 7;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Иркутск" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 8;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Чита"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Якутск"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Хандыга" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 9;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Владивосток"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Магадан"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "УстьНера" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 10;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Сахалин"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Среднеколымск" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 11;
		ИначеЕсли Выборка.ИмяПредопределенныхДанных = "Камчатка"
			ИЛИ Выборка.ИмяПредопределенныхДанных = "Анадырь" Тогда
			
			Об.ОтклонениеОтВремениПоГринвичу = 12;
		КонецЕсли;
		
		Попытка
			Об.Записать();	
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли