&НаСервере
Функция ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, Строка)
	Запрос = Новый Запрос;
	Если Строка = "Контрагент" Тогда
		НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
	                   |	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент КАК Контрагент
	                   |ИЗ
	                   |	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних КАК бит_ОтветственныеЛицаПоКУСрезПоследних
	                   |ГДЕ
	                   |	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ВыбранныйЛицевойСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйКонтрагент = Выборка.Контрагент;
		КонецЦикла;
		Возврат НайденныйКонтрагент;
	ИначеЕсли Строка = "Адрес" Тогда
		НайденныйАдрес = Справочники.бит_СписокЗданий.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ЛицевыеСчета.Здание КАК Здание
		               |ИЗ
		               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		               |ГДЕ
		               |	бит_ЛицевыеСчета.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ВыбранныйЛицевойСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйАдрес = Выборка.Здание;
		КонецЦикла;
		Возврат НайденныйАдрес;
	ИначеЕсли Строка = "Квартира" Тогда
		НайденнаяКвартира = Справочники.бит_Квартиры.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ЛицевыеСчета.Квартира КАК Квартира
		               |ИЗ
		               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		               |ГДЕ
		               |	бит_ЛицевыеСчета.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ВыбранныйЛицевойСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденнаяКвартира = Выборка.Квартира;
		КонецЦикла;
		Возврат НайденнаяКвартира;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ВыбранныйЛицевойСчет = ЭтаФорма.Запись.ЛицевойСчет;
	ЭтаФорма.Запись.Адрес = ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, "Адрес");
	ЭтаФорма.Запись.Квартира = ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, "Квартира");
	ЭтаФорма.Запись.Контрагент = ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, "Контрагент");
КонецПроцедуры

&НаСервере
Функция КвартираПриИзмененииНаСервере(ВыбранныйАдрес, ВыбраннаяКвартира, Строка)
	Запрос = Новый Запрос;
	Если Строка = "ЛицевойСчет" Тогда
		НайденныйЛицевойСчет = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		               |ГДЕ
		               |	бит_ЛицевыеСчета.Здание = &Здание
		               |	И бит_ЛицевыеСчета.Квартира = &Квартира";
		Запрос.УстановитьПараметр("Здание", ВыбранныйАдрес);
		Запрос.УстановитьПараметр("Квартира", ВыбраннаяКвартира);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйЛицевойСчет = Выборка.Ссылка;
		КонецЦикла;
		Возврат НайденныйЛицевойСчет;
	ИначеЕсли Строка = "Контрагент" Тогда
		НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент КАК Контрагент
		               |ИЗ
		               |	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних КАК бит_ОтветственныеЛицаПоКУСрезПоследних
		               |ГДЕ
		               |	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет.Здание = &Здание
		               |	И бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет.Квартира = &Квартира";
		Запрос.УстановитьПараметр("Здание", ВыбранныйАдрес);
		Запрос.УстановитьПараметр("Квартира", ВыбраннаяКвартира);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйКонтрагент = Выборка.Контрагент;
		КонецЦикла;
		Возврат НайденныйКонтрагент;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Если Не ЭтаФорма.Запись.Адрес.Пустая() Тогда
		ВыбранныйАдрес = ЭтаФорма.Запись.Адрес;
		ВыбраннаяКвартира = ЭтаФорма.Запись.Квартира;
		ЭтаФорма.Запись.ЛицевойСчет = КвартираПриИзмененииНаСервере(ВыбранныйАдрес, ВыбраннаяКвартира, "ЛицевойСчет");
		ЭтаФорма.Запись.Контрагент  = КвартираПриИзмененииНаСервере(ВыбранныйАдрес, ВыбраннаяКвартира, "Контрагент");
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	ПараметрыФормы = Новый Структура;
//	
//	Отборы = Новый Структура;
//	Отборы.Вставить("Владелец", ЭтаФорма.Запись.Адрес);	
//	
//	ПараметрыФормы.Вставить("Отбор", Отборы);
//	
//	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбораУправляемая", ПараметрыФормы);
//КонецПроцедуры

//&НаКлиенте
//Процедура ДоговорСКонтрагентомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	ПараметрыФормы = Новый Структура;
//	
//	Отборы = Новый Структура;
//	Отборы.Вставить("Владелец", ЭтаФорма.Запись.Контрагент);	
//	
//	ПараметрыФормы.Вставить("Отбор", Отборы);
//	Форма = ПолучитьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы);
//	Форма.Открыть();
//	//ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы);
//КонецПроцедуры
