
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Отчет.Период = ТекущаяДата();
	
	Параметры.Свойство("ЛицевойСчет", Отчет.ЛицевойСчет);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	Отчет.Проживающий = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающийПриИзменении(Элемент)
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПолучитьСписокПроживающихНаСервере(Отчет.Период, Отчет.ЛицевойСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = (НЕ ВыбранноеЗначение = Отчет.ЛицевойСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающийАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = ПолучитьСписокПроживающихНаСервере(Отчет.Период, Отчет.ЛицевойСчет);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция получает список проживающих.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокПроживающихНаСервере(Знач Дата, Знач ЛицевойСчет)
	
	Результат = Новый СписокЗначений;
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("Момент"     ,КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Результат.ЗагрузитьЗначения(ТаблицаФизЛиц.ВыгрузитьКолонку("ФизЛицо"));
	
	Возврат Результат;
	
КонецФункции // ()

&НаСервере
// Процедура формирует отчет с параметром. 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция СформироватьОтчетНаСервере()
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	АдресХранилища  = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	Отчеты.бит_СправкаПоПовестке.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
	ЗагрузитьПодготовленныеДанные();
	
КонецФункции // ()

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Период"      , Отчет.Период);
	ПараметрыОтчета.Вставить("ЛицевойСчет" , Отчет.ЛицевойСчет);
	ПараметрыОтчета.Вставить("Проживающий" , Отчет.Проживающий);
	ПараметрыОтчета.Вставить("ДатаРождения", Отчет.Проживающий.ДатаРождения);
	ПараметрыОтчета.Вставить("Адрес"       , "" + Отчет.ЛицевойСчет.Здание.ПочтовыйАдрес + ", кв. " + Отчет.ЛицевойСчет.Квартира);
	
	Возврат ПараметрыОтчета;
	
КонецФункции 

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	Результат.Очистить();
	Результат.Вывести(ПолучитьИзВременногоХранилища(АдресХранилища));
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры

#КонецОбласти