
#Область ПрограммныйИнтерфейс

// Процедура выполняется перед интерактивном началом работы пользователя с областью данных.
// Соответствует обработчику ПередНачаломРаботыСистемы.
//
// Параметры:
// Отказ - Булево - отказ в от начала работы. 
// Если параметр установить в Истина.	
// Начало работы с областью осуществлено не будет.
//
Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
	РезСтр = бит_ПолныеПрава.ДействияПередСтартомСистемы();
	Отказ = РезСтр.Отказ;
	Если Отказ Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПередНачаломРаботыСистемыЗавершение", ЭтотОбъект), РезСтр.ТекстСообщения,30);
	Иначе
		бит_РаботаСДиалогамиКлиент.УстановитьПараметрыОпций(РезСтр.ЭтоИнтПоставка);
	КонецЕсли; 
		
КонецПроцедуры

// Процедура завершения немодального вызова.
Процедура ПередНачаломРаботыСистемыЗавершение(ДополнительныеПараметры) Экспорт
    
	Завершение = Истина;

КонецПроцедуры // ПередНачаломРаботыСистемы()

// Процедура выполняется при интерактивном начале работы пользователя с областью данных.
// Соответствует обработчику ПриНачалеРаботыСистемы.              
//
Процедура ПриНачалеРаботыСистемы(Знач ОбрабатыватьПараметрыЗапуска = Ложь) Экспорт
	
	бит_ОбщегоНазначенияКлиент.ДействияПриНачалеРаботыСистемы();
		
КонецПроцедуры // ПриНачалеРаботыСистемы()

// Процедура соответствует обработчику ПередЗавершениемРаботыСистемы.
//
// Параметры:
// Отказ - Булево.
//
Процедура ПередЗавершениемРаботыСистемы(Отказ) Экспорт
	
	Если Не Отказ Тогда
		
		// Процедура для штатного отсоединения от сервера лицензий.
		бит_сл_сервер.ОтключитьсяОтСервера();	
		
	КонецЕсли;	
		
КонецПроцедуры // ПередЗавершениемРаботыСистемы()

#КонецОбласти