#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ВспомогательныеФункции

Функция ПолучитьПустуюСтруктуруРезультата() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("РезультатЗапроса" , Неопределено);
	
	Возврат Структура;
	
КонецФункции // ПолучитьПустуюСтруктуруРезультата()

Функция ПолучитьПустуюСтруктуруНастроек() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ОбязательныеПоля"               , Новый Массив); 
	СтруктураНастроек.Вставить("ШаблонСметы"                    , Неопределено); // Отбор.
	СтруктураНастроек.Вставить("ИмяМакетаСхемыКомпоновкиДанных" , Неопределено);
	
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецОбласти

#Область РаботаССКД

// Среди элементов полей СКД найти поле по имени.
//
Функция НайтиПолеСКДПоИмени(Элементы, Имя)
	
	Для Каждого Элемент Из Элементы Цикл
		Если ВРЕГ(Строка(Элемент.Поле)) = ВРЕГ(Имя) Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // НайтиПолеСКДПоИмени()

// Найти поле СКД по полному имени.
//
Функция НайтиПолеСКДПоПолномуИмени(Элементы, ПолноеИмя) Экспорт
	
	масЧастейИмен = ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя);
	колЧастей = масЧастейИмен.Количество();
	
	текИмя = масЧастейИмен[0];
	Поле = НайтиПолеСКДПоИмени(Элементы, текИмя);
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Сч = 2 По колЧастей Цикл
		текИмя = текИмя +"." + масЧастейИмен[Сч-1];
		Поле = НайтиПолеСКДПоИмени(Поле.Элементы, текИмя);
		Если Поле = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Поле;
	
КонецФункции // НайтиПолеСКДПоПолномуИмени()

// Полное имя поля разделить по частям.
//
Функция ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя)
	
	масЧастей = Новый Массив;
	СтрИмя = ПолноеИмя;
	
	Пока Не ПустаяСтрока(СтрИмя) Цикл
		Если Лев(СтрИмя, 1) = "[" Тогда
			
			Поз = Найти(СтрИмя, "]");
			Если Поз = 0 Тогда
				масЧастей.Добавить(Сред(СтрИмя, 2));
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Сред(СтрИмя, 1, Поз));
				СтрИмя = Сред(СтрИмя, Поз + 2);
			КонецЕсли;
			
		Иначе
			
			Поз = Найти(СтрИмя, ".");
			Если Поз = 0 Тогда
				масЧастей.Добавить(СтрИмя);
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Лев(СтрИмя, Поз - 1));
				СтрИмя = Сред(СтрИмя, Поз + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат масЧастей;
	
КонецФункции // ИзПолногоИмениПоляПолучитьЧасти()

#КонецОбласти

#Область ФормированиеТаблицы

// Функция подготавливает структуру данных, необходимую для печати ценников и этикеток.
//
// Возвращаемое значение:
//  Стрруктура - данные, необходимые для печати этикеток и ценников.
//
Функция ПодготовитьСтруктуруДанных(СтруктураНастроек) Экспорт
	
	СтруктураРезультата = ПолучитьПустуюСтруктуруРезультата();
	
	////////////////////////////////////////////////////////////////////////////////
	// ПОДГОТОВКА СХЕМЫ КОМПОНОВКИ ДАННЫХ И КОМПОНОВЩИКА НАСТРОЕК СКД.
	
	// Схема компоновки.
	СхемаКомпоновкиДанных = Документы.бит_ФормированиеПаспортаДома.ПолучитьМакет(СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных);
	
	// Подготовка компоновщика макета компоновки данных.
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.Настройки.Отбор.Элементы.Очистить();
	
	Если НЕ СтруктураНастроек.ШаблонСметы = Неопределено Тогда
		
		ЭлементыОтбора = Компоновщик.Настройки.Отбор.Элементы;
		
		ОтборПоСмете = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСмете.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ШаблонСметы");
		ОтборПоСмете.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоСмете.ПравоеЗначение = СтруктураНастроек.ШаблонСметы;
		ОтборПоСмете.Использование  = Истина;
		
	КонецЕсли; 
	
	// Выбранные поля компоновщика настроек.
	Для Каждого ОбязательноеПоле Из СтруктураНастроек.ОбязательныеПоля Цикл
		ПолеСКД = НайтиПолеСКДПоПолномуИмени(Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.Элементы, ОбязательноеПоле);
		Если ПолеСКД <> Неопределено Тогда
			ВыбранноеПоле = Компоновщик.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ПолеСКД.Поле;
		КонецЕсли;
	КонецЦикла;
	
	// Компоновка макета компоновки данных.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	////////////////////////////////////////////////////////////////////////////////
	// ВЫПОЛНЕНИЕ ЗАПРОСА
	
	Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос);
	
	// Заполнение параметров с полей отбора компоновщика настроек формы обработки.
	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	СтруктураРезультата.РезультатЗапроса = Запрос.Выполнить();
	
	Возврат СтруктураРезультата;
	
КонецФункции // ПодготовитьСтруктуруДанных()

// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПечатьДокумента(МассивОбъектов)Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("Макет");
	
	Для каждого ЭлементМассива Из МассивОБъектов Цикл
		
		Дерево = ЭлементМассива.ХранилищеДерева.Получить();
		
		Если Дерево <> Неопределено Тогда
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.ПериодОтчета            = ПредставлениеПериода(ЭлементМассива.ДатаНачалаПланирования, КонецДня(ЭлементМассива.ДатаОкончанияПланирования),"ФП = Истина");
			ОбластьЗаголовок.Параметры.ДатаФормирования        = Формат(ЭлементМассива.Дата,"ДЛФ=""ДД""");
			ОбластьЗаголовок.Параметры.ЗаголовокОтчета         = ЭлементМассива.ЗаголовокОтчета;
			ОбластьЗаголовок.Параметры.НаименованиеОрганизации = ЭлементМассива.Организация;
			ОбластьЗаголовок.Параметры.ОГРН                    = ЭлементМассива.Организация.ОГРН;
			ОбластьЗаголовок.Параметры.ИНН                     = ЭлементМассива.Организация.ИНН;
			ОбластьЗаголовок.Параметры.КПП                     = ЭлементМассива.Организация.КПП;
			ОбластьЗаголовок.Параметры.НомерПриложения         = ЭлементМассива.НомерПриложения;
			ОбластьЗаголовок.Параметры.НомерПриказа            = ЭлементМассива.НомерПриказа;
			ОбластьЗаголовок.Параметры.ДатаПриказа             = Формат(ЭлементМассива.ДатаПриказа,"ДЛФ=""ДД""");
			
			Если ЗначениеЗаполнено(ЭлементМассива.ОтветственныйЗаФормированиеДокумента) Тогда 
				
				ОбластьЗаголовок.Параметры.ФИО                     = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(ЭлементМассива.Организация, ЭлементМассива.ОтветственныйЗаФормированиеДокумента, ЭлементМассива.Дата).Представление +
				
				" тел. " + ПолучитьСлужебныйТелефонИзКонтактнойИнформации(ЭлементМассива.ОтветственныйЗаФормированиеДокумента);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			Для Каждого СтрокаДереваЗначений Из Дерево.Строки Цикл
				
				Если СтрокаДереваЗначений.ВыводитьВШапку Тогда
					
					ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
					ОбластьШапка.Параметры.ЗаголовокШапки = СтрокаДереваЗначений.Кодификатор + " " + СтрокаДереваЗначений.СтатьяОборотов;
					ТабличныйДокумент.Вывести(ОбластьШапка);
					
				Иначе
					
					Если СтрокаДереваЗначений.ВыводитьВоВсеКолонки Тогда
						
						ОбластьСтрока  = Макет.ПолучитьОбласть("СтрокаЗаголовка");
						ОбластьСтрока.Параметры.НомерПП = СтрокаДереваЗначений.Кодификатор;
						ОбластьСтрока.Параметры.Наименование = СтрокаДереваЗначений.СтатьяОборотов;
						
					Иначе
						
						ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
						ОбластьСтрока.Параметры.НомерПП = СтрокаДереваЗначений.Кодификатор;
						ОбластьСтрока.Параметры.Наименование = СтрокаДереваЗначений.СтатьяОборотов;
						ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаДереваЗначений.ЕдиницаИзмерения;
						ОбластьСтрока.Параметры.Информация = СтрокаДереваЗначений.Информация;
						
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьСтрока);
					
				КонецЕсли;
				
				ВывестиСтрокуДерева(ТабличныйДокумент, СтрокаДереваЗначений, 0, Макет);
				
			КонецЦикла;
			
		Иначе
			
			ТабличныйДокумент = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ()

Функция ВывестиСтрокуДерева(табДок, СтрокаДереваЗначений, Уровень, Макет)
	
	Для Каждого строкиД Из СтрокаДереваЗначений.Строки Цикл
		
		Если строкиД.ВыводитьВШапку Тогда
			
			ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапка.Параметры.ЗаголовокШапки = строкиД.Кодификатор + " " + строкиД.СтатьяОборотов;
			ТабДок.Вывести(ОбластьШапка);
			
		Иначе
			
			Если строкиД.ВыводитьВоВсеКолонки Тогда
				
				ОбластьСтрока  = Макет.ПолучитьОбласть("СтрокаЗаголовка");
				ОбластьСтрока.Параметры.НомерПП = строкиД.Кодификатор;
				ОбластьСтрока.Параметры.Наименование = строкиД.СтатьяОборотов;
				
			Иначе
				
				ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрока.Параметры.НомерПП = строкиД.Кодификатор;
				ОбластьСтрока.Параметры.Наименование = строкиД.СтатьяОборотов;
				ОбластьСтрока.Параметры.ЕдиницаИзмерения = строкиД.ЕдиницаИзмерения;
				ОбластьСтрока.Параметры.Информация = строкиД.Информация;
				
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЕсли;
		
		ВывестиСтрокуДерева(табДок,СтрокиД,Уровень+1, Макет);
		
	КонецЦикла;
	
КонецФункции

// Функция находит актуальное значение телефона в контакной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//
// Возвращаемое значение:
//  Строка - представление найденного телефона.
//
Функция ПолучитьСлужебныйТелефонИзКонтактнойИнформации(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Окончание = "Организации";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Окончание = "Контрагента";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		// БИТ_ЖКХ 26.11.2014{{	
		// Окончание = "ФизЛица";	
		Окончание = "ФизическиеЛица";	
		
	КонецЕсли;
	
	// ВидТелефона = Справочники.ВидыКонтактнойИнформации["ТелефонРабочийФизическиеЛица" + Окончание];.
	ВидТелефона = Справочники.ВидыКонтактнойИнформации["ТелефонРабочий" + Окончание];
	
	Если Объект.КонтактнаяИнформация.Количество() > 0 Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("Тип",ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
		
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Если Строки.Количество() > 0 Тогда
			Возврат Строки[0].Представление;
		КонецЕсли;
		
	Иначе
		// БИТ_ЖКХ 26.11.2014}}
		
		Факс = "";
		
		Если Окончание = "Организации" Тогда
			
			ВидФакса = Справочники.ВидыКонтактнойИнформации["ФаксОрганизации"];
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Объект", Объект);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Телефон);
			Запрос.УстановитьПараметр("Вид"   , ВидФакса);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И
			|	КонтактнаяИнформация.Тип = &Тип
			|	И
			|	КонтактнаяИнформация.Вид = &Вид
			|";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				Факс = ", факс: " + РезультатЗапроса.Выгрузить()[0].Представление;
			КонецЕсли;
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("Вид"   , ВидТелефона);
		
		Если Окончание = "Организации" Тогда
			// БИТ_ЖКХ 11.01.2016 10:34:49 Начало правки... 
			//Если Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			// БИТ_ЖКХ 11.01.2016 10:34:52 Конец правки. 
				Запрос.УстановитьПараметр("Объект", Объект.ИндивидуальныйПредприниматель);
				Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
			КонецЕсли;
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И
		|	КонтактнаяИнформация.Тип = &Тип
		|	И
		|	КонтактнаяИнформация.Вид = &Вид
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат "";
		Иначе
			Возврат РезультатЗапроса.Выгрузить()[0].Представление + Факс;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли