
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьКомпоновкуДанных(Ложь);
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("СхемаКомпоновкиДанных");
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	ОтборНаФорме.Инициализировать(ИсточникНастроек);
	ОтборНаФорме.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
					
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаВDBF()
	
	Режим = РежимДиалогаВыбораФайла.Сохранение; 
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогСохраненияФайла.ПолноеИмяФайла = Формат(ТекущаяДата(),"ДФ='MMyyyy'") + "RS.dbf";
	Фильтр = "Имя файла - Не более 8 латинских символов и цифр (*.dbf)|*.dbf";                 
	ДиалогСохраненияФайла.Фильтр = Фильтр; 
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
	ДиалогСохраненияФайла.Заголовок = "Сохранение файла отчета Реестр собственников в формат dbf"; 
	Если ДиалогСохраненияФайла.Выбрать() Тогда 
		ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла; 
		СформироватьФайлНаСервере();
		
		Попытка
			ДвоичныеДанныеКлиент = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
			ДвоичныеДанныеКлиент.Записать(ПутьКФайлу);	
		Исключение
		    Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура СформироватьФайлНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("СхемаКомпоновкиДанных");
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТабЗнач = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТабЗнач);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
 	СтруктураОтбора = Новый Структура("ЛицевойСчет", Неопределено);// задаем условия
	МассивСтрок = ТабЗнач.НайтиСтроки(СтруктураОтбора);
	Для Каждого ЭлементМассив Из МассивСтрок Цикл
		ТабЗнач.Удалить(ЭлементМассив); //удаляем строки
	КонецЦикла;
	
	ДБФ = Новый XBase;
    ДБФ.Кодировка = КодировкаXBase.OEM;
    
	Для Каждого Колонка ИЗ ТабЗнач.Колонки Цикл
		
        Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда    
            Тип = "N";
            Длина = Колонка.ТипЗначения.КвалификаторыЧисла.Разрядность;
            Точность = Колонка.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти;
            Если Длина = 0 Тогда
                Длина = 15;
                Точность = 3;
            КонецЕсли;    
		Иначе
		    Тип = "S";
            Длина = Колонка.ТипЗначения.КвалификаторыСтроки.Длина;
            Если Длина = 0 Тогда
                Длина = 100;
            КонецЕсли;    
            Точность = 0;
        КонецЕсли;    
		
		Если Колонка.Имя = "ЛицевойСчет" Тогда
			 Колонка.Имя = "LS";
		ИначеЕсли Колонка.Имя = "СобственникКод" Тогда
			 Колонка.Имя = "KOD";
		ИначеЕсли Колонка.Имя = "Участок" Тогда
			 Колонка.Имя = "F";
 		ИначеЕсли Колонка.Имя = "Улица" Тогда
			 Колонка.Имя = "YL";
 		ИначеЕсли Колонка.Имя = "Дом" Тогда
			 Колонка.Имя = "DOM";
		ИначеЕсли Колонка.Имя = "Корпус" Тогда
			 Колонка.Имя = "KORP";
 		ИначеЕсли Колонка.Имя = "ПредставлениеКвартиры" Тогда
			 Колонка.Имя = "KV";
 		ИначеЕсли Колонка.Имя = "ОбщаяПлощадь" Тогда
			 Колонка.Имя = "PL";
		ИначеЕсли Колонка.Имя = "Собственник" Тогда
			 Колонка.Имя = "FIO";
 		ИначеЕсли Колонка.Имя = "ДоляСобственности" Тогда
			 Колонка.Имя = "S";
 		ИначеЕсли Колонка.Имя = "СтепеньРодства_1" Тогда
			 Колонка.Имя = "RODSTV1";
 		ИначеЕсли Колонка.Имя = "СтепеньРодства_2" Тогда
			 Колонка.Имя = "RODSTV2";
 		ИначеЕсли Колонка.Имя = "СтатусПроживания" Тогда
			 Колонка.Имя = "STATUS";
 		ИначеЕсли Колонка.Имя = "Пр_уст_Документы_1" Тогда
			 Колонка.Имя = "DOK1";
 		ИначеЕсли Колонка.Имя = "Пр_уст_Документы_2" Тогда
			 Колонка.Имя = "DOK2";
 		ИначеЕсли Колонка.Имя = "Пр_уст_Документы_3" Тогда
			 Колонка.Имя = "DOK3";
 		ИначеЕсли Колонка.Имя = "Пр_уст_Документы_Архив" Тогда
			 Колонка.Имя = "DOCARCH";

		КонецЕсли;
        ДБФ.поля.Добавить(Колонка.Имя, Тип, Длина, Точность);
    КонецЦикла;
	
	ПутьКНовомуDBF  = КаталогВременныхФайлов()+Лев(Новый УникальныйИдентификатор(),4)+".dbf";  
	ДБФ.СоздатьФайл(ПутьКНовомуDBF);
    
    Для Каждого Стр ИЗ ТабЗнач Цикл
        ДБФ.Добавить();
        ЗаполнитьЗначенияСвойств(ДБФ, Стр);
        ДБФ.Записать();
	КонецЦикла;
	ДБФ.ЗакрытьФайл();
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКНовомуDBF), УникальныйИдентификатор);
	УдалитьФайлы(ПутьКНовомуDBF);  

КонецПроцедуры

